{
    "error": false,
    "course": {
        "id": 7,
        "subject": "ACCT",
        "code": "3030",
        "name": "Intermediate Financial Accounting for Non-Accounting Majors",
        "description": "Financial accounting concepts and practices with particular emphasis on the analysis and interpretation of financial reports and data.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"ACCT\" data-code=\"2010\" href=\"/review/ACCT2010\" target=\"_blank\">ACCT 2010</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"ACCT\" data-code=\"3010\" href=\"/review/ACCT3010\" target=\"_blank\">ACCT 3010</a>, <a class=\"course-link\" data-subject=\"ACCT\" data-code=\"3020\" href=\"/review/ACCT3020\" target=\"_blank\">ACCT 3020</a>",
        "rating_content": 4.31,
        "rating_teaching": 4.46,
        "rating_grading": 4.46,
        "rating_workload": 4.31,
        "review_count": 13,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 6,
                "name": "CHAN, Dennis Suk Sun",
                "count": 11
            },
            {
                "id": 1138,
                "name": "ZHENG, Yue",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "MTEuXdOcUD43ROI1cCqSxIcykiUHZyp6",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 6,
                    "name": "CHAN, Dennis Suk Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "uni",
            "date": "Dec 28, 2016",
            "title": "",
            "comment_content": "Mid-term exam<br />Ch1 Financial reporting and accounting standards<br />Ch2 Conceptual framework for financial reporting (some new concepts will be learnt)<br />Ch3 The Accounting Information System (basically, this chapter is just revision)<br />Ch4 Income statement and related information (you will learn new stuff, e.g. OCI in this chapter)<br />Ch5 Statement of financial position<br />Ch5&amp;23 Statement of cash flows (This chapter is quite difficult, you have to do more exercises to get familiar with the direct and indirect methods)<br />Ch7 Cash and receivables<br />Ch8 Valuation of inventories: a cost basis<br />approach (basically this is just for revision, e.g. FIFO, LIFO, average-cost method)<br />Ch9 Inventories: additional valuation issues<br /><br />Final exam<br />Ch10 Acquisition and disposition of property, plant, and equipment(more complicated journal entries)<br />Ch11 Depreciation, impairments, and<br />depletion (challenging chapter, you have to do revaluation of assets and impairment)<br />Ch12 Intangible assets<br />Ch13 Current liabilities, provisions, and contingencies<br />Ch14 Non-current liabilities (beware that you are an issuer)<br />Ch17 Investments (beware that you are an investor)",
            "comment_teaching": "Professor Chan is a really great teacher. He taught accounting in a systematic and clear way. If you get some questions, you could ask him in-class, after-class, or by appointment. He would teach you thoroughly until you understand the whole concept or entries. This is a required course for all students major in FINA (but non-accounting major students). Hope you will enjoy his teaching when you meet him next time.",
            "comment_grading": "1. Class participation and classwork 6%<br />2. Assignment 9%<br />3. Mid-term exam 30%<br />4. Final exam(non-cumulative) 55%<br /><br />For (1), if you want to get the full credits, you'd better attend all lessons since professor Chan will take attendance every class. Sometimes, he will give us some in-class exercises to test our understanding. It is not that important to get it correct, but to attend the lesson and hand in the exercise.<br /><br />For (2), you have to hand in an assignment before the mid-term exam based on the topics taught. It is relatively difficult and take time to finish this assignment. Better write the 'note' clearly. <br /><br />For (3), the mid-term exam consists of MC(60 marks with 30 questions) and short-answered(40 marks with 3 questions) question. Hence, you have to be very familiar with the topic and entries so that you could finish the whole paper within the limited time. <br /><br />For (4), the final exam consists of 1 compulsory question and 2 elective questions(you could choose 3 out of 2 actually). The final exams is even more difficult than the mid-term exam. You have to understand and apply the concept to finish the whole paper with high accuracy. Some parts require you to explain your answer. Don't think that accounting needn't write any words.",
            "comment_workload": "The harder you are, you better the grade you get. You'd better finish all the assigned problems after each chapter to get you familiar with the topic. <br />It takes you less time to revise before mid-term and final exam if you finish the exercises from time to time. <br />You could choose to read the textbook. But if you are very concentrated during class and could understand all the materials from professor, I think you could just skip the reading as it is quite time-consuming.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5Z7M9mH3eAw1Ozid3QfVT4qO25JR4wGh",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 6,
                    "name": "CHAN, Dennis Suk Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Justin LTY",
            "date": "Apr 08, 2021",
            "title": "",
            "comment_content": "Content is as expected, slightly advanced than ACCT 2010, but still manageable. A-rangers in ACCT 2010 should found this course ok to deal with.<br /><br />Be prepared to deal with IFRS/GAAP difference, may take some time, especially for DSE BAFs students to adapt to.",
            "comment_teaching": "Teaching is easily understandable, especially if you have prior knowledge obtained from ACCT 2010. Can email prof. for questions, but he is not that patient in answering questions.",
            "comment_grading": "Generally speaking, grading is acceptable. <br /><br />50% for HW (3 in total)<br />30% for Final -&gt; switched to a take-home exam<br />20% In-class Quiz (multiple, partly for attendance, marks would be credited even with all wrong answers)<br /><br />End up A- with most of my problem sets 1 S.D. above mean. Not sure about the final take-home exam, but don't worry about the grades obtained in in-class quizzes.",
            "comment_workload": "Quite intense, quizzes per week without prior notification during online semesters. Three assignments in total and final exam switched to assignment eventually. Should expect assignments to be challenging, especially for the final problem set.<br /><br />Speaking of quizzes, time is short and questions require prior study.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ivvPDs6KglGtLB1ukTrVgHnezcD8tXg7",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 6,
                    "name": "CHAN, Dennis Suk Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wct",
            "date": "Jan 22, 2016",
            "title": "",
            "comment_content": "Most of the topics before mid term are covered in ACCT 2010. Then things are 90% new after mid term exam. Topics such as Fixed Asset Revaluation, Bonds and Equity Investments are relatively more complicated, so you may need to spend more time to study them. Whether they are interesting or not depends on your enthusiasm on Accounting...<br /><br />Professor will give you a &quot;concept sheet&quot; after teaching all topics for you to study accordingly.<br /><br />Topics are not cumulative in final exams.",
            "comment_teaching": "You may need to take notes during lecture as he will further illustrate the concepts and examples. Teaching is quite clear and the pace is satisfactory. Prof. Chan is a kind local professor. If you have questions, you can ask him questions after lessons with Cantonese or English.",
            "comment_grading": "Make sure you gain all the scores from in-class exercises if you do not want to attend all lessons.<br /><br />Mid term is extremely hasty for me because there is too little time to finish all the questions. I got an above mean score in mid term.<br /><br />Time is much more adequate in final if you do preparation well(I did a lot of after-chapter questions in study break). There is no final exam scores released. I think I did well in exam so i got an A range grade.",
            "comment_workload": "Workload is not a concern in this course. There is only one assignment which has 3 problems submitted before mid term. However, there are suggested problems after each chapters. They are quite similar to exam questions and supplement some concepts not taught in class. If you want to get a good result in final exam, you may do all of suggested &quot;Brief Exercises&quot; and &quot;Exercises&quot; problems.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ogrmdEX3tuQ1BGNi4JxrDVVDY1AU5x4M",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 6,
                    "name": "CHAN, Dennis Suk Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yi_Yi",
            "date": "Jan 14, 2021",
            "title": "",
            "comment_content": "Intense<br />Almost 1 chapter/ week<br />materials are the advanced ones covered in ACCT 2010<br />IFRS/GAAP difference; takes some time to adjust",
            "comment_teaching": "Teaching is great, but the Prof is not that kind of nice person lol.",
            "comment_grading": "3 Assignments 50%<br />Final Assessment 30% (Huge Assignment 4 instead this semester)<br />In-Class Quiz 20% (Tiny fractions for participation, last for accuracy)<br /><br />Me:<br />Assignment 1 39/50 (Mean 39, Sd 6)<br />Assignment 2 75/75 (1sd above mean)<br />Assignment 3&nbsp;&nbsp;71/75 (1.5 sd above mean)<br />In-class Quiz no statistics, but I got a pretty low score I think<br />Final Assessment not released, but I think mine is not bad<br /><br />End up with A-",
            "comment_workload": "I could say it's fair. Almost 1 Assignment per month.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tkXqARPe9lnckNaYv99B5yd9PewcDfsl",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 6,
                    "name": "CHAN, Dennis Suk Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SW",
            "date": "Dec 29, 2018",
            "title": "Recommended course!",
            "comment_content": "Financial Accounting and Accounting Standards<br />Conceptual Framework of Financial Reporting<br />Income Statement and Related Information<br />Statement of Cash Flows<br />Cash and Receivables<br />Inventories: Additional Valuation Issues <br />Depreciation, Impairment, and Depletion<br />Intangible Assets<br />Current Liabilities, Provisions, and Contingencies<br />Non-Current Liabilities<br />Equity<br />Dilutive Securities<br />Financial Assets<br /><br />Useful for business students, professor will even highlight some topics that may appear in interview and teach you how to impress the interviewer lol",
            "comment_teaching": "Professor is very nice. Ppts are well-arranged with different scenarios covered, but as the content is quite complicated, it is better that you attend all the lessons and jot notes. He is able to explain the concept by providing additional examples and is willing to spend more time on difficult cases. For every chapter professor will list out the recommended exercises in etextbook for practice so that you don't have to finish all of them.",
            "comment_grading": "SUPER GOOD GRADE.<br />I completed all the classwork and assignments.<br />No mean is disclosed so I am not sure how well I have performed, but I don't think I scored a high mark. Probably somewhere around mean.<br />Assignment 1:33/40<br />Assignment 2: 37/51<br />Assignment 3: 51/59<br />Assignment 4: 53/65<br />The same for final exam, no result released. The reason I said it is a super good grade course is that I guess professor is lenient in marking. To be honest I don't even have ANY confidence in at least 50% of the answers and am not able to complete the whole paper, but I think professor will give marks as long as you attempted to write the correct name of the account entry and show your workings, regardless of whether the final figure is correct.<br />I got an A at the end.",
            "comment_workload": "Classwork 5% (regardless of accuracy, random check of attendance)<br />Online Assignments(4 in total) 20%<br />Final exam 75% (non-cumulative, what appeared in assignments will not be covered.)<br />THAT'S ALL.<br />Professor said it is the first time that there is no mid term exam for this course. Very light workload for a 3000 level course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Bqn2KzTBS3NKUGvtaMkUeNvNnOVZyxMp",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 6,
                    "name": "CHAN, Dennis Suk Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Patrick",
            "date": "Dec 29, 2018",
            "title": "Good Grade and nice professor",
            "comment_content": "Content basically covers the financial statements analysis, which is useful for finance major students. Also, the course mainly is about journal entries of the chapters covered in ACCT2010, but it goes more deeper. The content itself can be complicating (especially in Depreciation/Revaluation chapter), so make sure do not cram everything few days before the exam, it will just only mess you up",
            "comment_teaching": "Professor is very approachable and nice. Clear explanation and the lecture slides are well arranged. He always links the concepts in class to the possible investment bank interview questions which I found extremely useful and valuable",
            "comment_grading": "75% Final<br />20% Homework<br />5% Classwork<br /><br />The 25% should be easily attainable as long as you show up in class. <br /><br />For the final, it is composed of 4 questions. And most of them are quite challenging. You should finish all the &quot;P&quot; assigned problem sets if you wanna ace the exam. <br /><br />Grading is quite good. After the finaI exam I really felt I fucked it up, but it turns out the grade is pretty good.",
            "comment_workload": "Light workload, 4 homework which is easy to deal with. And a final exam with non-cumulative contents (6 chapters for the final exam), but don't underestimate it, those chapters are quite complicating.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Y1pjbk4p7H05ua5jbzcWP6dO5x7bJfaC",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 6,
                    "name": "CHAN, Dennis Suk Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kevinhalim14",
            "date": "Jan 21, 2018",
            "title": "",
            "comment_content": "The materials in this course are quite useful for your knowledge about what is really happening in this Finance and Business world. The exam is more about the journal entry --&gt; similar with ACCT2010",
            "comment_teaching": "Dennis is one of the best teachers I ever have in HKUST. He really knows and understands all the materials in this course.",
            "comment_grading": "The grading is quite fair i guess<br />Mid --&gt; MEAN<br />Final --&gt; MEAN + 0.5SD<br /><br />Final grade --&gt; B+",
            "comment_workload": "The workload is similar with ACCT2010.<br />Although there is only one graded assignment, there are quite a lot of practice questions that are very useful for your understanding.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lj3ICktYtYfBplf0izlATuCvHTVY3JMM",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 6,
                    "name": "CHAN, Dennis Suk Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Samo",
            "date": "Dec 23, 2017",
            "title": "Straightforward Course",
            "comment_content": "Mostly focusing on matters such as depreciation, revaluation, equity issuances, debt issuance, equity and debt holding. Critical accounting concepts required to understand and analyze financial statements. Not very relevant since accounting rules are always changing.",
            "comment_teaching": "Mostly textbook based, but spends class time to illustrate concepts and examples. Approachable professor, and one who is willing to repeat concepts in class if you haven't gotten them at first attempt.",
            "comment_grading": "Midterm covers the first half of the course, and the mean was around 50~ out of 70 marks (not your standard business course that has a ridiculously high mean). <br /><br />Final covered only 5 chapters, and was 3 questions long. No grades were returned for the final exam, and no paper checking allowed throughout.<br /><br />One take-home assignment, and several in-class quizzes that are based off that lecture (no need to study for these, and simply doing the quiz gets you the points).",
            "comment_workload": "Barely any-workload in terms of assignments due - just one take-home assignment (homework based), midterm and final assessment.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3ab88GqPkGmIignC8G9B7n72YsPgr1dE",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 6,
                    "name": "CHAN, Dennis Suk Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AJ",
            "date": "Jul 31, 2017",
            "title": "",
            "comment_content": "Class participation and classwork 6%<br />Assignment 9%<br />Mid-term 30%<br />Final 55%",
            "comment_teaching": "Dennis is definitely one of the best professors I've had so far. He is a great instructor and he explains the concepts very thoroughly, but he doesn't put everything in the slides so make sure you take notes. He's very helpful if you come across any questions during/after class.",
            "comment_grading": "His exams are definitely not the easiest, but if you study the slides and do all the practice questions the exams would not be too difficult. The content itself can be quite challenging so just don't try to cram everything in the last few days!",
            "comment_workload": "The workload is not crazy, just make sure you go to class! He will always take attendance and randomly have in-class exercises to make sure you are actually there and it's not just your friend signing your name for you. If you get caught doing so, he will give you 0% for your attendance and in-class exercises, so don't risk it.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DgDIUTN67IrCcW7A6a0nBlaF06NKk2UG",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 6,
                    "name": "CHAN, Dennis Suk Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "李娜",
            "date": "Feb 07, 2017",
            "title": "",
            "comment_content": "The final is not cumulative; most of the content is easy. attendance is required. but can be taken by your friends. have several in class exercises. graded by attempts not by accuracy",
            "comment_teaching": "very clear. the best accounting course i have ever taken in hkust.&nbsp;&nbsp;the professor is really nice and friendly. very willing to answer your questions.",
            "comment_grading": "excellent grade. i think the professor is quite generous in giving A+",
            "comment_workload": "low. master the in class exercises and part of textbook exercises would be enough to ensure good grades in exams.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uHRKGjNXtkAZR7OqYqLTLhLtSBo3Pys2",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 6,
                    "name": "CHAN, Dennis Suk Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "1999",
            "date": "Jan 14, 2016",
            "title": "Great Professor!",
            "comment_content": "Compulsory course for non-accounting major but Finance major students.<br /><br />－From financial accounting to financial reporting<br />－Focused on published financial information and statements<br />－Deals with complexity of accounting items<br />－More principles-based by following accounting standards (IFRS)<br />－More on recognition before measurement<br />－More on valuation using fair values<br />－Emphases on earnings quality and consistency<br /><br />Topics include:<br />&nbsp;&nbsp;－Financial Accounting and Accounting Standards<br />&nbsp;&nbsp;－Conceptual Framework of Financial Reporting<br />&nbsp;&nbsp;－Income Statement, Financial Position, Cash Flows<br />&nbsp;&nbsp;－Cash and Receivables, Valuation of Inventories<br />&nbsp;&nbsp;－Acquisition and Disposition of PPE<br />&nbsp;&nbsp;－Depreciation, Impairment and Depletion<br />&nbsp;&nbsp;－Intangible Assets<br />&nbsp;&nbsp;－Current Liabilities, Provisions, and Contingencies<br />&nbsp;&nbsp;－Non-Current Liabilities<br />&nbsp;&nbsp;－Financial Assets (Investment)",
            "comment_teaching": "Professor Chan is a very nice HongKonger professor that he illustrates different concepts very clear! Taking notes is necessary during his lecture if you don't want to read textbook yourself.<br /><br />However, I usually skip his lectures if i knew that there will not be any in-class exercise. As a result i need to read the textbook to learn the concepts myself and I think it is better to have his lessons and do the end-chapter questions once finishing a chapter (the best way to learn in this course)",
            "comment_grading": "In-class Exercise 6%<br />&nbsp;&nbsp;- random in-class exercise for taking attendance<br />Assignment 9%<br />&nbsp;&nbsp;- 2-3 Problem sets (very easy)<br />Mid-term 30%<br />&nbsp;&nbsp;- MC+2short questions (very difficult and have to finish within very quick time)<br />Final Exam 55% (result will not be released)<br />&nbsp;&nbsp;- 1 short question(compulsory)<br />&nbsp;&nbsp;- choose 2 out of 3 elective questions<br /><br />i only take 4 out of 5 attendance, below mean a little bit in both assignment and mid-term, and i think I may perform quite okay in my final examination -&gt; turn out got B.",
            "comment_workload": "－Non-cumulative for midterm and final examination, so I think&nbsp;&nbsp;<br />&nbsp;&nbsp;&nbsp;the workload is generally quite low.<br />－Buying textbook is necessary as frequent practicing is&nbsp;&nbsp;&nbsp;<br />&nbsp;&nbsp;&nbsp;necessary in this course, but I just complete those suggested&nbsp;&nbsp;&nbsp;&nbsp;<br />&nbsp;&nbsp;&nbsp;questions only. <br />－If you aim high, i think you should complete all the end- <br />&nbsp;&nbsp;&nbsp;chapter questions.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Gko7jBR1kznOvaRcmYkaQFxECCp465lz",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1138,
                    "name": "ZHENG, Yue",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Chocacho",
            "date": "Jan 02, 2020",
            "title": "",
            "comment_content": "She follows the textbook and online course Wiley very closely in teaching content and grading questions. Attendance is not required but does have participation with speaking.",
            "comment_teaching": "Powerpoint slides are taken from the textbook, with an overview of which concepts are covered and which are skipped at the start. She reads from the slides which are from the textbook and tries to include some in class engagement with questions taken from Wiley the online course she follows. <br /><br />Classes can get boring, especially since its all from the textbook so can actually just read textbook by looking at her first slides for which areas of each chapters to cover. <br /><br />She does include in class exercises every few chapters with paper questions done in class where she gives time to complete then answers a few minutes later. These are useful for long questions in exams",
            "comment_grading": "4 online quizes<br />Midterm <br />Final<br />Participation<br /><br />Quizzes and most questions rely heavily on the online Wiley course all students have to pay for at the start of semester. Wiley has an online textbook, along with lots of practice questions to follow but they cover the entire textbook so some practice questions can be skipped. The quizzes are done on there and follow the practice questions almost identically, students get two tries and the questions stay the same. <br /><br />Midterm and final were MCQ with extra questions. All questions were very similar to the Wiley questions and in-class exercises she gives. Easy and therefore high mean<br /><br />Participation is taken by answering questions and signing your name down if you spoke in class.",
            "comment_workload": "Only 4 quizzes, midterm and final. All can be easily studied quickly beforehand as questions are all very similar to what she prepared us for.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tFZJNpEIu89xdVtqCPKgcwmdyApdl40l",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1138,
                    "name": "ZHENG, Yue",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lmacchch",
            "date": "Dec 02, 2022",
            "title": "One of the best course that I have ever taken in HKUST",
            "comment_content": "内容大致是2010的延伸，中规中矩，没什么好说的。但是她讲的东西真的非常有用。前面讲三张表，最后一章讲EPS的算法，在ib面试的时候非常有用，建议aim ib的同学早点去上这门课",
            "comment_teaching": "非常标准的中式教学，讲知识点讲的好清楚",
            "comment_grading": "龟应该还不错，但是有点卷<br />占比：<br />Midterm 30%<br />Homework 15%<br />Participation 5%<br />Final 50%<br />我的分数：<br />Midterm：120/120 mean：100, sd 16<br />Final: 104/120 mean：90 sd：20<br />Homework基本人均满分<br />所以可见这个课有多卷<br />最后我overall 90 around<br />A",
            "comment_workload": "细。几乎没什么workload 一学期总共四次assignment, 难度不大，找几个同学一块做可以很快做完",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}