{
    "error": false,
    "course": {
        "id": 9,
        "subject": "ACCT",
        "code": "3610",
        "name": "Business Law",
        "description": "This course is to provide students with an awareness of the overall legal framework in which businesses in Hong Kong operate so as to enable them to apply the relevant laws and practices to business problems and practical solutions. The main objective is to give students an understanding of how the society and business function in different socio-legal contexts like the legal system and process and its influence on citizens’ social rights and duties; the enforcement and honoring of agreement between private citizens, the use of business organizations in commercial society, the relationship between employee and employer from social and legal perspectives, the growing importance of business ethics and corporate social responsibilities etc.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.43,
        "rating_teaching": 4.52,
        "rating_grading": 4.4,
        "rating_workload": 4.19,
        "review_count": 63,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 7,
                "name": "LAM, Charles",
                "count": 38
            },
            {
                "id": 1270,
                "name": "TAN, Jing",
                "count": 23
            }
        ]
    },
    "reviews": [
        {
            "hash": "9GsDzetiDsQDTnDSqCSIfASYHsEtXEGC",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kabul",
            "date": "Dec 22, 2017",
            "title": "Rest in peace, Charles.",
            "comment_content": "This course introduces the legal framework business in Hong Kong operate in and enables us to understand how the society and businesses function in different socio-legal contexts.<br /><br />Topics included:<br />1️⃣ Corporate Law<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Types of business organizations<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Incorporation formalities of a company<br />2️⃣ Legal System from Socio-legal Perspectives<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Criminal law vs civil law<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Sources of law in Hong Kong<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Judicial system in Hong Kong<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Misrepresentation<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Exemption/limitation clauses<br />3️⃣ Contract Law<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Different types of contract<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Elements of a contract<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Terms of a contract<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Validity of a contract and its vitiating factors<br />4️⃣ Tort Law<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Contract vs tort<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Various types of tort<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Vicarious liability<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Negligence<br />5️⃣ Employment Law<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Importance of human resource<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Tests of employer-and-employee relationship<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Duties of employer and employee<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Termination of employment<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Current issues in employment law<br />6️⃣ Business Ethics<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Insider dealing<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Auditors<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Ethic PLUS model<br /><br />Charles will also discuss with us a number of case vignettes in which clients are seeking legal advice. We are expected to identify the legal issues involved, discuss the relevant legal principles and apply them to resolve the issues. This framework will be used very often when answering questions in the exam.<br /><br />The content is extremely useful in clarifying common legal misconceptions in our daily lives and notifying us of proper legal actions that should be taken in case of a breach of the law.<br /><br />Note that this course has little to do with accounting. NOT recommended for year 1 (except for those genii) or anyone not sufficiently proficient in English - this is far too demanding for a year-1 student. You'll suffer if your English doesn't meet the requirements - this is a law course after all.",
            "comment_teaching": "✅ Charles is the funniest guy on Earth. He illustrates legal concepts by bringing in lots of funny examples (some of them are his real experience lol). He's also extremely kind to us, and willing to answer questions when we got stuck on the group project.<br /><br />❌ However his notes are a little bit messy, so make sure you organize them well. We're also required to jot down a lot of notes in the lessons cuz these are very likely to appear on exams. If you skip his lessons, good luck in the exams.",
            "comment_grading": "Exam sucks. If you've put down the points mentioned in the marking scheme, you get the points. If you don't, you lose marks. It's basically just a game of tipping the marking scheme instead of assessing your critical thinking and legal reasoning ability. Make sure you write as much as possible in the exams to get the marks. Even if some of the issues in the questions do not have a role in the final decision, you're still required to fully explain them.<br /><br />Charles likes to test concepts that are only discussed in class but not mentioned in his lecture notes, so make sure you attend his classes and jot down everything he mentions. Pay extra attention to those topics during your revision.<br /><br />✏️ Group research paper (20%)<br />✏️ Midterm exam (35%)<br />✏️ Final exam (35%)<br />❓ Class participation (10%)<br /><br />Nobody knows how it's graded. Only the midterm result was released, and I did quite poorly on that one (slightly below mean). The marks for the final exam and the project were not released. The class participation part is even more ambiguous. There's no participation card thingy, no presentation, nothing! Maybe he gives participation marks purely based on his memory and impression.<br /><br />Final grade: B+",
            "comment_workload": "A double-sized A4 (either written or printed) cheat-sheet is allowed in the exams. This reduces the workload quite a bit.<br /><br />The legal paper is still far too demanding to us. It's a 4000-to-4500-word essay finished by groups of 5. We're required to conduct legal research in depth from authoritative sources (Wikipedia and Google are not acceptable), critically analyze the pros and cons of the current law/political system, point out existing defects in the laws, conduct comparative studies with overseas examples, and come up with viable solutions to resolve the current issues/improve the legal system.<br /><br />Our group was assigned a topic that required us to assess in the current electoral system in Hong Kong and analyze whether it conforms to democratic principles. Damn it - it's a super hard topic. I think it's more like politics than law. I wonder if we had the ability to come up with such great solutions, would we still need to sit in lectures and get tortured by all those sh!t grades? We could have been the Chief Executive then.<br /><br />Make sure you get responsible and CAPABLE group-mates to do the work, or you'll end up with spending days revising all the group work in frustration.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 7,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bZs27GkwFwx1PAQwKEG8Li5sXR9QHpBC",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "thyc0309_",
            "date": "May 18, 2019",
            "title": "For this semester, there was a change in instructor at the middle so it is different from other semesters",
            "comment_content": "1. Corporate Law<br />2. Legal System of Hong Kong + exemption clause + misrepresentation<br />3. Contract Law<br />4. Tort Law<br />5. Employment Law<br /><br />There was also a guest lecture on professional ethics (during KK Lee's reign), and one lecture on legal systems around the world (KK Lee's first ever lecture).",
            "comment_teaching": "Charles was a great instructor. He explained the concepts with lots of funny examples and did a lot of case studies with us to let us understand how to apply concepts in real-life. There were lots of notes to jot for every of his lecture, so try not to miss any. And actually, you won't wanna miss Charles' lectures coz they are actually quite interesting.<br /><br />Unfortunately, he got a stroke at early Apr and was hospitalized, so the TA, KK Lee, became the emergent substitute instructor for the rest of the semester. The TA was just basically reading out the powerpoint for every lesson so I didn't pay much attention and skipped some lectures.<br /><br />That's why I gave an overall B in teaching coz Charles deserved more than an A and KK Lee is a D.<br /><br />Update:<br />Sadly, Charles passed away at 15 May due to the severe stroke he suffered at early April. Rest in peace. We will all remember your teaching and the knowledge and laughter we had in class will forever be in our hearts.",
            "comment_grading": "10% Class participation<br />20% Group project<br />35% Midterm<br />35% Final<br /><br />Dunno how will the class participation be graded. Maybe it's from KK Lee's impression on us during lectures (?) Do bear in mind that if you asked questions during the group project presentations, he'll mark your name down and you may score higher in participation.<br /><br />For the group project, every group will be randomly assigned a topic from a list created by Charles beforehand. Originally, Charles required us to have a 4000-word limit and with footnotes and 1.5-line spacing. But after KK Lee took over, he said that there was no word limit and we can do whatever format we like provided that it's clear. Each group will also need to present their findings in class. Originally, KK Lee set the time limit to 10 mins as the syllabus does, but then he cancelled the time limit. What happened then is that some groups presented for over 20 mins and some groups need to delay their presentation to the next lessons as a result, so he kind of set a limit again for around 15 mins. The arrangement was messy.<br /><br />Midterm was still under Charles' reign. There were two short questions and two case study questions, covering the first two chapters. An A4 double-sided cheatsheet is allowed.<br /><br />Final was under KK Lee's reign. He conducted a survey in class and decided to have an open book open notes exam. There will be MCs and short questions on Contract Law, contents from the guest lecture on professional ethics, legal systems around the world, Tort Law and Employment Law, and case study questions for only the latter two topics.",
            "comment_workload": "The group project constitutes the most workload. You'll need to do lots of research and dig into the current laws as well as reading lots of news related to your topic in order to find loopholes in the law and make legal recommendations to it. However, it was quite fun as you got to know much more about what Hong Kong (or China or common law states like UK and US) is currently going on. Since I have an interest in law and politics, I actually quite like doing the project. But for others, well... good luck.<br /><br />For the midterm, I had gone through the powerpoints, Charles' supplementary notes and notes from his lectures for more than once in order to find useful information to be written on the cheatsheet. It was hard work.<br /><br />For the final, it's open book open notes, so everyone can just print out all the slides and notes and bring them alongside the textbook (which is optional) into the exam venue. You don't need to memorize a lot of stuff but as it's open nearly everything... it's going to be tough I think.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NUQFU0DWbKu8st1Z4XHvOK0KQv06EhZG",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cat",
            "date": "Jan 16, 2017",
            "title": "broken grade",
            "comment_content": "very detailed, quite interesting as he will teach tort law and employment law (as I have part time) so it really boarden my horizon.<br /><br />but the notes are VERY DISORGANISED with wrong use of bulletin points",
            "comment_teaching": "a funny guy who keeps on talking. he is nice as well",
            "comment_grading": "i expect B but i got C+<br /><br />mid term: mean<br />final: ?<br />project:?<br /><br />to be honest I am quite confident on my exams but it don't know what happened at the end...",
            "comment_workload": "a little bit heavy for project as you have to research a lot of things with annoying citation<br /><br />but can bring cheatsheet for exam",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Bu7U6HOlD6gLOOnmtYIq5svIgcwf9R7v",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nancy_",
            "date": "Jan 22, 2021",
            "title": "Great! prof is so cute",
            "comment_content": "Basic contract law knowledge structures. She mainly explains the concepts through cases, from simple ones like &quot;Alice and Bob did blabla&quot; to real-life court record documents. Not so much reading is required, but you can search for a better understanding.",
            "comment_teaching": "She tries to make more interaction with students, which can help keep you concentrated. There would be a group discussion part before answering the question part. Nothing is mandatory but active participation makes high grades.",
            "comment_grading": "best two from three quizzes 2*25%<br />Individual Final Report 30%<br />In-class writing assignment 5%<br />Individual Participation 10%<br />Group Exercise in Class 5%<br /><br />Get A+",
            "comment_workload": "nearly 0 workloads during the sem if you digest all lectures during the class.<br />the final report can be finished in 1 day (if you work like me for 20 hrs till 5 am lol)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xbJpJnmjhAtkCQPwpwRDA9ps0Lh17hia",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rn_yaggg",
            "date": "Jan 14, 2020",
            "title": "",
            "comment_content": "An introductory course about the law system in HK and some business-related laws which are important to all business students.<br /><br />1. Introduction of Law<br />2. Legal System of HK<br />3. Contract Law<br />4. Law of tort<br />5. Employment Law<br />6. Business Organisation",
            "comment_teaching": "She will upload an incomplete PPT on canvas before the class and upload the complete one afterward. She put all the key points in the PPT with lots of examples explaining the principles. You can understand most of the contents by reading the materials on your own. <br /><br />However, her teaching is a bit boring.",
            "comment_grading": "Fair grading<br /><br />50% Best two quizzes out of three<br />30% Final Project Report (group work)<br />10% Final Project Presentation (group work) <br />10% Group Exercise (group work)<br />+/- 10% Individual Class Participation<br /><br />I got around 90/100 in my quiz (i skipped all group exercises, and I don't know my project score), and finally, I got a B+.",
            "comment_workload": "Not much workload in this course. If you think the scores of your first two quizzes are good enough, then you can skip the last one.<br /><br />The project is not very difficult, and it will not take you lots of time. She will assign you a case study randomly, and what you need to do is just a reading task and applying some principles of law and giving some of your opinions.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wq1ti2OG2z5Iolh5tnT3Xl05EKRlxe2j",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "NONAMEGUY",
            "date": "Jul 31, 2018",
            "title": "Broken grade(RIP, Charles)",
            "comment_content": "I think the content is quite fun. <br />I understand about business law more.<br /><br />But how the ppt,doc are organized is very confusing, a bit messy when revising.<br /><br />I do think the prof.'s pace is too slow in the first half before midterm, only one chapter and a third of the 2nd chapter is tested. And he really hurried in the second half...makes it harder to understand. And cases are shown less in the 2nd half.<br /><br />The final is about chapter 2,3,4,5!!!",
            "comment_teaching": "Very funny teaching style! Though his English is really hard to understand!!!!!!!!!!!!!!!!!!!!",
            "comment_grading": "I think it's really broken for me.....I really study hard during the semester, not missing even 1 class= =<br />But there's a gap between understanding and having high scores in the exam ==<br />The exam requires you to write every detail!! Cannot summarize it yourself, cannot change the wordings, every exact minor minor detail need to be on it!<br /><br />Our group did the project nicely(at least I think so...), the prof smiled at our presentation too.But the project didn't help my grade at all.&nbsp;&nbsp;2 exams:1 mean, one below a little bit--&gt;B-<br /><br />When I ask the prof about my score for project, he refused to tell me and only focused on the exam scores....FML I believe the project is about 30 or 40%?!",
            "comment_workload": "The project require some workload I think.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ihKlQkGu9zFM2SucIyqCdkdwkwDcpIc0",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "helloisme",
            "date": "Jun 06, 2023",
            "title": "",
            "comment_content": "More interesting than I expected! Each lecture focus on and finish one PPT = one topic is cleared! <br /><br />1. Course Overview<br />2. Legal assumptions<br />3. Legal system, Case law<br />4. Legal system<br />5. What is a contract<br />6. Intent offer<br />7. Consideration I<br />8. Consideration II<br />9. Enforceability<br />10. Interpretation mistakes<br />11. Mistakes<br />12. Changed &amp; Circumstances &amp; Remedies<br />13. Legal writing (IRAC)<br />14. Law of tort<br />15. Defamation &amp; Vicarious liability<br />16. Negligence I<br />17. Negligence II<br />18. Business organization<br />19. Employment Law<br />20. Course review",
            "comment_teaching": "Professor is nice and always encourages us to share opinions. She doesn't mind if your answer is wrong. By listening other's ideas, you can learn to see the case from different perspectives. Teaching materials are nearly same as previous years so I recommend to buy sources if you want to get a good grade. <br /><br />- NO new lectures on quiz days",
            "comment_grading": "2 Quizzes, 1 Final exam (15%, 15%, 50%)<br />- All quizzes and final exam are open-book/open note<br />- 10 short questions for quizzes, 20 questions for final (usually case questions --&gt; Yes/No + reasons (concept))<br />- Professor will distribute some sample questions before final and do it together. PLS REVISE!!! This year, all sample questions were tested in final exam (more than 5 questions)<br /><br />In-class writing practice (5%)<br />- 2 Questions (about IRAC)<br />- Basically same as last year<br /><br />Assignments &amp; mini quizzes (10%)<br />- Need to do reflection on Canvas after each lecture, our class was allowed to use ChatGPT to do it (but another session was not allowed so I think professor just wanted to evaluate which way is better)<br /><br />Participation (5%)<br />- Each lecture will distribute a paper for you to write down the answer. Professor will explain the answer in the same lecture, so you can just copy what she said/write it on your own way. Correct/Wrong answers do not matter.<br />- Course overview mentioned it includes answering questions. I didn't answer any questions but I think it doesn't matter too. Just go to class every time and submit the answer sheet.<br /><br />Quiz 1: 15/15<br />(LQ: 11.5 | Mean: 12.3 | Median: 12.5 | UQ:14.5)<br />Quiz 2: 15/15<br />(LQ: 10.5 | Mean: 12.14 | Median: 12 | UQ:13.5)<br />Final: 48.2/50<br />(LQ: 39.03 | Mean: 42.07 | Median: 42.37 | UQ:44.87)<br />Overall grade: A+",
            "comment_workload": "Light workload. You just need to write a few sentence to finish the after-class reflection.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CuZDhSXMNElOU7EOYhVkaziYZ81O57Xt",
            "semester": "2022-23 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Ali-04",
            "date": "Apr 28, 2023",
            "title": "",
            "comment_content": "Very interesting. Might be a little confusing from times to times if you are not used to law.",
            "comment_teaching": "Since there is a lot of things to see in each class, the pace is quite fast. We have many interactions during class and the teacher makes it funnier through real-life cases, videos, dilemmas and so on.",
            "comment_grading": "The mean is very high because the exams are open-book. <br /> Quizzes, 1 Final exam 15%, 15%, 50%<br />In-class writing practice 5%<br />Assignments &amp; mini quizzes 10%<br />Participation 5%",
            "comment_workload": "The first assignments are very easy then you will havecto use a new legal writing form that makes your assignement longer to achieve.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "v6c3BPcrA0C2vhcPFUeELUkPggMhQ8oL",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "karisip",
            "date": "Jan 29, 2023",
            "title": "",
            "comment_content": "Ch 1 Legal Language<br />Ch 2 What is Law<br />Ch 3 Legal system and Case law<br />Ch 4 Legal System<br />Ch 5 What is a contract<br />Ch 6 Intent and Offer<br />Ch 7 Acceptance and Consideration<br />Ch 8 Complications of consideration<br />Ch 9 Enforceability<br />Ch 10 Interpretation and Performance: Mistake<br />Ch 11 Performance: Mistake Impossibility and Frustration<br />Ch 12 Changed circumstances and remedies<br />Ch 13 Remedies and Legal Writing<br />Ch 15 Law of Tort<br />Ch 16 Defamation and Vicarious Liability<br />Ch 17 Negligence<br />Ch 18 Negligence 2<br />Ch 19 Business Organizations<br />Ch 20 Employment Law",
            "comment_teaching": "explained every concept in detail",
            "comment_grading": "open book exam but easy questions , so the mean was quite high",
            "comment_workload": "Quizzes 10% * 2<br />1 Final exam 50%<br />Individual Final Report 15%<br />In-class writing practice 5%<br />Assignments &amp; mini quizzes 5%<br />Participation 5%",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4ujU09hX4U2HezkucRqLhUMi0o5VamD1",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "20-24",
            "date": "Jan 25, 2023",
            "title": "",
            "comment_content": "Ch 1 Legal Language<br />Ch 2 What is Law<br />Ch 3 Legal system and Case law<br />Ch 4 Legal System<br />Ch 5 What is a contract<br />Ch 6 Intent and Offer<br />Ch 7 Acceptance and Consideration<br />Ch 8 Complications of consideration<br />Ch 9 Enforceability<br />Ch 10 Interpretation and Performance: Mistake<br />Ch 11 Performance: Mistake Impossibility and Frustration<br />Ch 12 Changed circumstances and remedies<br />Ch 13 Remedies and Legal Writing<br />Ch 15 Law of Tort<br />Ch 16 Defamation and Vicarious Liability<br />Ch 17 Negligence<br />Ch 18 Negligence 2<br />Ch 19 Business Organizations<br />Ch 20 Employment Law",
            "comment_teaching": "she explained some concepts using simple examples and is easily understandable, btw she is talking quite fast<br /><br />At the beginning of the course, she will distribute a course outline that explained the concepts in a more formal and detailed way, it also covers some concepts that she did not mention in class, it's kinda useful to me, and better read that before exams",
            "comment_grading": "Quiz 1 100/100<br />Quiz 2 85/100<br />Final 65.75/70<br />In-class writing 4.13/5<br />Final report 12.45/15<br />Overall grade A<br /><br />The exams are open book and notes, closed internet, the mean is also quite high",
            "comment_workload": "Acceptable workload<br /><br />2 Quizzes 10%, 10%<br />1 Final exam 50%<br />Individual Final Report 15%<br />In-class writing practice 5%<br />Assignments &amp; mini quizzes 5%<br />Participation 5%",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QMI8BcTB4uIPkpsuh26vUaXGkQImy9ew",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Testing1234",
            "date": "Jan 14, 2023",
            "title": "Good grading and interesting course",
            "comment_content": "Some simple law concept that is interesting. You may find it useful when you are joking with your friends.<br /><br />Course overview &amp; introduction to law<br />Legal system<br />Case law system<br />Hong Kong legal system<br />General principles of contract law (1-8)<br />Final report &amp; legal writing (1-2)<br />Final report - Sample &amp; Q/A<br />Law of tort (1-4)<br />Business organizations<br />Employment law<br />Course summary",
            "comment_teaching": "Prof Tan's lecture is very fun. She uses many funny powerpoints, interesting cases for us to understand those law concepts.&nbsp;&nbsp;She also helps a lot in writing the final report. She replies to my email immediately even if I sent it at 10 pm on weekend. Overall the class is fun and chill.",
            "comment_grading": "2 Quizzes, 1 Final exam: 10%, 10%, 50%<br />25 short questions each, our TA keeps telling us to keep the answer SHORT because we can get full marks if we get straight to the point. All of them are open-book exam so you can print your notes.<br />Quiz 1: mean 88.78, s.d 9.8982, me 100<br />Quiz 2: mean 81.65, s.d ~10 (I asked our TA), me 90<br />Final: mean 88.05, s.d unknown, me 96<br /><br />Individual Final Report: 15%<br />no statistics were provided, me 13.05<br /><br />In-class writing practice: 5%<br />mean 4.43, me 4.13<br /><br />Assignments &amp; mini quizzes: 5%<br />not released, but I guess I'm full<br /><br />Participation: 5%<br />not released, but I guess I'm full<br /><br />Overall: A+",
            "comment_workload": "Light. You have to do one assignment per week, which is simply copying what professor had mentioned during class, mainly related to the application of law concepts. You can complete it in 5 minutes. <br />The final report took some time. Cause you have to read a case judgment before start writing it. You have to represent either the plaintiff or defendant in that case and write an 800-1000 words legal report. Basically you don't have to do extra research since you can directly apply concepts that you've learned in class, while still you can Google some cases to strengthen your argument if you wish.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yYSZ7YfJ62dp8rc1lKDio1zvRJUQERlc",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hayoha",
            "date": "Dec 30, 2022",
            "title": "",
            "comment_content": "Business Law<br />Employment<br />Partnership<br />Contract<br /><br />You will learn the format and some writing skills for legal report.",
            "comment_teaching": "Professor Tan is friendly, she prepared the PPTs well and the concepts are clearly explained with multiple examples.<br /><br />She provides time for dicussions and you can submit your group list. Although sadly in zoom class, my group members all silent for the whole course.<br /><br />She is welcomed for raising questions during class (for both verbal and chat box)",
            "comment_grading": "Quiz 1 17%<br />Quiz 2 17%<br />Quiz 3 16%<br />Final Report 30%<br />In-class writing practice 5%<br />Participation 5%<br />Assignment &amp; mini Quizzes 10%<br /><br />Me: Above mean for 3 quizzes, below mean for Final report<br />Mean is super high for Quizzes (around 90-92%)<br /><br />Overall: A",
            "comment_workload": "Outline provided for the overall course's content.<br />Final report, good luck, if you are assigned to defend for the party which was defeated in the case, it is super super super difficult to be above mean/ even difficult to come out with enough content for your report. It is NOT LOGICAL. Like I alreadly know my party was wrong and it was proven already, then I have no idea how to argue in a LOGICAL way to state my client is correct.<br /><br />There are rumors that having sources of Quizzes and the questions are basically the same so that why the mean is so high. Well, I hate this world.<br /><br />My approach: rewatch all lecture videos and make my notes again before the Quizzes. Since open book open notes, I was doing ok during the quiz and had time to recheck all the questions once before handed in.<br /><br />Not sure what is the situation for f2f class.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3dyzdEcIwkzKl3bcVArI3lscdkBlSd7l",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Klay12",
            "date": "Dec 23, 2022",
            "title": "BUSINESS LAW",
            "comment_content": "Business Law<br />* Legal system<br />* Case law system<br />* Hong Kong system<br />* General principles of contract law<br />* legal writing<br />* Law of tort<br />* Business organizations<br />* Employment law",
            "comment_teaching": "Discuss some cases on class to clarify the concepts clearly, easy to understand what she says.",
            "comment_grading": "Acceptable<br />Statistics (from canvas)<br />Overall / Mean / Median / UQ / LQ<br /><br /># Quiz 1 (10%)<br />100 / 88.95 / 91.5 / 96.75 / 83.25<br /><br /># Quiz 2 (10%)<br />100 / 81.51 / 83.5 / 87.75 / 75.25<br /><br /># Final (50%)<br />70 / 61.78 / 63 / 65.3 / 58.95<br /><br /># In-class Writing (5%)<br />5 / 4.41 / 4.5 / 4.63 / 4.25<br /><br /># Individual Final Report (15%)<br />Only disclose your own result but no stat.<br /><br /># Assignments &amp; mini quizzes (5%)<br /># Participation (5%)",
            "comment_workload": "Light.<br /># Individual Final Report is related to Legal Issue. Basically, you just need to write an essay with 800 words.<br /># Participation: Attend the class or answer a question on canvas after class.<br /># Assignments: Answer a question on canvas after class<br />(i.e. If you did not attend the class, you need to answer two questions after class)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ldgDeUAoBQQj7CtpGUp4yuzy5E8vyfBW",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kakkazuma",
            "date": "Dec 23, 2022",
            "title": "",
            "comment_content": "Contract law<br />Employment law<br />Trots",
            "comment_teaching": "Like her teaching style. She uses movie clip as teaching material and ask us distinguish what are the related legal issues in the video.<br />She also reply email very quick. Good professor.",
            "comment_grading": "Quizzes, 1 Final exam&nbsp;&nbsp;10%, 10%, 50% <br />Individual Final Report&nbsp;&nbsp;&nbsp;15% <br />In-class writing practice&nbsp;&nbsp;5% <br />Assignments &amp; mini quizzes&nbsp;&nbsp;5% <br />Participation&nbsp;&nbsp;5% <br /><br />Good grade for me. Quizzes and finals are non cumulative and they are Open book exams. My Quiz 1 and 2 below mean, final above mean a bit. Thought that I will have B- but turn out still have B+.",
            "comment_workload": "Not much workload. Just have 1 take home 800-1000 words take home essay and several after class reflection assignments.<br />Pay attention in class is already enough.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bMxMNWmVnjcoawBGVcOCBEg6ZcZsvPhg",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ivana",
            "date": "Dec 13, 2022",
            "title": "",
            "comment_content": "The contents are mainly focusing on contract law and tort law.",
            "comment_teaching": "The professor taught well of the materials. She also provides some Q&amp;A sessions before the quizzes.",
            "comment_grading": "3 Quizzes (17%, 17%, 16%)<br />Individual Final Report (30%)<br />In-class writing practice (5%)<br />Assignments &amp; mini quizzes (10%)<br />Participation (5%)<br /><br />Mc and short questions for quizzes and they are open-book/open notes.<br /><br />For the individual final report, it be will be assigned depending on the last digit of your sid. You either need to represent the plaintiff or the defendant.<br /><br />Also, there are two mini-quiz and some take-home assignments throughout the semester.",
            "comment_workload": "Not too heavy as just 3 quizzes and an 800-1000 words report only.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZF84ap72zQ3soJpLZxc8NKst6UaktjqA",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Woodsss",
            "date": "Aug 24, 2022",
            "title": "",
            "comment_content": "The course covers Contract Law, Torts, Business Organizations and Employment Law. <br />The topic is quite diverse but the contract law is the main focus, covering almost 1/2 of the schedule. So, make sure to be familar with the topic of Contract Law.",
            "comment_teaching": "Quite good as she is willing to answer students' questions. She has QnA sessions before the quizzes, good to ask questions at that time.",
            "comment_grading": "3 Quizzes (17%, 17%, 16%)<br />Individual Final Report (30%)<br />In-class writing practice (5%)<br />Assignments &amp; mini quizzes (10%)<br />Participation (5%)<br /><br />Mc and short questions for quizzes and they are open-book/open notes.<br /><br />Prof will assign you a case (a total of 5 cases with two sides, depends on your last digit of your student number). You have to think from both the Plantiff and the defendant on the case.<br /><br />Also, we have one mini-quiz and some take home assignments throughout the semester. (Not sure if there will be more quizzes in the coming semesters)<br /><br />Take home assignments are just reflections about some court cases discussed during the lecture, 100-200 words short essays will be fine.",
            "comment_workload": "Not too heavy as just 3 quizzes and a 800-1000 words report only. <br />Just bear in mind to start doing the report at least two weeks before the deadline as in-depth researches are needed.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NgHyhAB0m0JAIyEk2vvzzVKbJXb92oZz",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jik",
            "date": "Aug 23, 2022",
            "title": "gd grade but competitive",
            "comment_content": "same as others",
            "comment_teaching": "nice prof, always explain the concept clearly<br /><br />give u some sample questions with answer for the quiz and they will also appear in the real quiz<br /><br />useful consultation session before every quiz for someone who is not listening in the class (like me)<br /><br />need to jot notes coz sometimes she will say sth which is not in the ppt",
            "comment_grading": "good<br /><br />(quizzes are mc)<br />quiz1: below mean<br />quiz2 &amp; 3: above mean<br /><br />case report: dk<br /><br />final grade: B",
            "comment_workload": "not much workload<br /><br />mean of the quiz is super high<br /><br />no asm<br /><br />a case report need to submit which is not very difficult",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rxbs4AUlP3Wg5HTUhGBZJmq2JnBm5rhT",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yuyuu",
            "date": "Jun 06, 2022",
            "title": "",
            "comment_content": "Contract Law, 4 elements of contract law<br />Remedies <br />Law of tort, intentional Torts <br />Employment Law, Products Liability....",
            "comment_teaching": "Nice professor<br />She uses lots of interesting stories as examples to illustrate<br />Easy understanding and easy memorising <br />Quizzes are easy and open book format",
            "comment_grading": "3 Quizzes&nbsp;&nbsp;17%, 17%, 16% <br />Quiz 1 (Mean: 87 Me: 100)<br />Quiz 2 (Mean: 80 Me: 100)<br />Quiz 3 (Mean: 93 Me: 96)<br /><br />Individual Final Report&nbsp;&nbsp;&nbsp;30% <br />(Mean: 27.44/30 Me: 28/30)<br /><br />In-class writing practice&nbsp;&nbsp;5% <br />(Mean: 4.32/5 Me: 4.38/5)<br /><br />Assignments &amp; mini-quizzes&nbsp;&nbsp;10% (do not release)<br />Participation&nbsp;&nbsp;5% (do not released)<br /><br />Grade: A+",
            "comment_workload": "low workload<br />only report and asm <br />asm can be finished within 5 minutes <br />final report is not complicated",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ScLfBDSqYMrpc3cwLBSBsSyB4QoQ1sbG",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wraith",
            "date": "Jun 02, 2022",
            "title": "Good and easy course",
            "comment_content": "1. Legal Assumptions <br />2. Legal System &amp; Case Law <br />3. Contract <br />4. Intent and Offer<br />5. Consideration <br />6. Enforceability <br />7. Interpretation and Mistakes <br />8. Changed circumstances and Remedies <br />9. Legal Writing <br />10. Law of Tort <br />11. Defamation &amp; Vicarious liability <br />12. Negligence and Product <br />13. Business Organizations <br />14. Employment Law",
            "comment_teaching": "Good teaching. She is chill and willing to answer your questions. If you need help email her and she will answer it.",
            "comment_grading": "3 Quizzes&nbsp;&nbsp;17%, 17%, 16% <br />Individual Final Report&nbsp;&nbsp;&nbsp;30% <br />In-class writing practice&nbsp;&nbsp;5% <br />Assignments &amp; mini quizzes&nbsp;&nbsp;10% <br />Participation 5%<br /><br />The grading is good. 3 quizzes have a high mean which is around 80~90%. The individual final report will be the most challenging assessment during this course. The average for the final report is high as well.&nbsp;&nbsp;Assignments are just submission marks. Mini quizzes happen once during the course and it is easy. Participation mark is just class participation so if you attend the class you will get the mark. Overall the mean is very high in this course.",
            "comment_workload": "Easy Workload. <br />At least one assignment related to the lecture after every class but it is a short assignment that is easy. If you pay attention in the lecture quizzes are easy to focus on lectures and try not to skip them.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WV4aIFrA2qCydii6MAQgpJNCFkUeWMfB",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "busi trash",
            "date": "Jan 18, 2022",
            "title": "Great course",
            "comment_content": "see others, contents are quite interesting",
            "comment_teaching": "kind &amp; nice, patient &amp; energetic, always willing to answer students' questions during class and after class<br /><br />owing to her high pitch, you won't get sleepy easily!<br /><br />acceptable chinese accent, speaking in a good pace",
            "comment_grading": "grading is surprisingly good! i got all quizzes at mean score, should be full on participation (most of us get full, i guess), and an unreleased score on final project (i didnt expect a high score)<br /><br />final grade -&gt; A !",
            "comment_workload": "workload is definitely fine as a major requirement course, all you need is to attend classes, and finish the report (which i only spent few hours<br /><br />participation: i guess we only need to attend the classes and finish the in-class exercise and assignment on canvas which is extremely easy and short<br /><br />quizzes: all in mc format and open-book, as mentioned before you should attend all classes, so you probably have nothing more to revise on the quizzes cuz it's mostly questioning your understanding of the concepts but not asking you to memorize things<br /><br />final report: it is not difficult, 1000 words, you are assigned to one case, and you would need to read a document, first few pages are about the case, and the rest are the judgments and opinions by other lawyers, all you need is to cite some opinions that are beneficial to your stance and finish the report following the format",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nmdjBPbPYRo1P2TCkYs82Ezd1MUtwI4H",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "aaronic92351",
            "date": "Jan 01, 2022",
            "title": "",
            "comment_content": "Contents are the same as past years, basic law stuff, yet it can be quite complicated when different concepts are mixed together.<br />You will also learnt how to read and write with legal terms.<br /><br />Topics taught were non-cumulative, separated into 3 quizzes:<br />Quiz 1<br />- Legal System &amp; Case Law System<br />- Hong Kong Legal System<br />- Contract Law<br /><br />Quiz 2<br />- Contract Law (cont.)<br /><br />Quiz 3<br />- Law of tort<br />- Agency &amp; Business Organizations<br />- Employment Law<br /><br />Contents are not difficult to understand if you pay attention in lectures, but i'd say law stuff is quite boring.",
            "comment_teaching": "She was able to explain the concepts and clarify our questions raised during lectures. She would also illustrate the concepts with different (simple) cases and leave some time for discussion every lesson. However, sometimes she just read the slides and her scripts. She did also try hard to encourage us to speak up in class and have an interaction with her to ensure the pace of the class.<br /><br />Before quizzes, she gave us a few practice questions, in which those were the same as the real quiz. (perhaps she knows that most of us are new to law stuff)<br />No lessons on the day of quiz, but she would hold a zoom session for Q&amp;A.<br /><br />She also had a lucky draw in the last class and gifted two books out! (i didn't get it...)",
            "comment_grading": "Grade components and the associated weights are as follow:<br />3 Quizzes – 17%, 17%, 16%<br />Individual Final Report – 30%<br />In-class writing assignment – 5%<br />Individual Participation – 10%<br />Group Exercise in Class – 5%<br /><br />Quiz 1: 85/100 (mean: 87.6, sd: 8.75, high: 100, low: 52)<br />Quiz 2: 100/100 (mean: 82.96, sd: 9.37, high: 100, low: 58)<br />Quiz 3: 100/100 (mean: 88.36, high: 100, low: 76)<br />Final Report: scores not released<br />In-class writing assignment: 4.25/5 (mean: 3.7, high: 4.75, low: 0)<br />Individual Participation &amp; Group Exercise: dunno how she graded but i submitted every in-class exercise and after-class assignment/reflection<br /><br />Final grade: A+<br />A bit surprised, originally expecting an A only, guess i popped off in final report.",
            "comment_workload": "Workload is normal.<br /><br />Quizzes are open-book and there were more than enough time to finish the quizzes. Yet do spend some time to review the contents before quizzes.<br /><br />For the Final Report, you were assigned to one case and to write a case brief + argument for and against your client. Do start early as legal terms and phrases might be hard to comprehend. Utilize the knowledge learnt in contract law to generate arguments.<br />Tip: Use lawteacher.com and look at the case summary of your case!<br /><br />For in-class assignment, she will spend one lecture to introduce the IRAC structure, and then next lecture you will be given a case to analyse, using IRAC. The purpose of this is actually to help you familize with the IRAC structure, in which you need to use when writing the Final Report as well.<br /><br />For Individual Participation &amp; Group Exercise, just submit after-class reflection and attend lectures for mini-quizzes/in-class exercises. You can also answer questions during class.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MZYrmJiblQpubAIUCj0DTQelfqH3zSm9",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "不存在的",
            "date": "Aug 24, 2021",
            "title": "",
            "comment_content": "The course is about basic business law like the factors of contract.&nbsp;&nbsp;The content closely relate to our everyday life so it is not difficult to understand. But for some cases it is easy to fall into a dillima and make mistakes in undersatnding.",
            "comment_teaching": "The professor is really nice and kind to anwser students questions. The professot will provide a version of textbook that is summarized by herself. It really gives us convenience.",
            "comment_grading": "The grading is not bad. There will be four quiz and three hishest scores will be chosen. Most students did well in quiz so you should take care. The most important thing is the final report. The professor will require you to write appellate of a very old case (HADLEY &amp; ANOR v. BAXENDALE &amp; ORS) using the knowlodge leaned in the class.",
            "comment_workload": "The workload is moderate and you need to prepare for the quiz. And you have to put your efforts to the final essay(report). It will be better to read the textbook to help understand but it will not take you so long time.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "z85YAMoujx6r3jifIHwFkAgUQslpvEfJ",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "shit",
            "date": "Jun 23, 2021",
            "title": "",
            "comment_content": "Quiz 1<br />1. Legal System<br />2. Case Law System<br />3. Hong Kong System<br />4. General principles of contract law<br /><br />Quiz 2<br />5. General principles of contract law (cont'd)<br /><br />Quiz 3<br />6. Law of tort<br />7. Business Organizations<br />8. Employment Law",
            "comment_teaching": "Sometimes she might just read the slides and her scripts. However, she did try hard to encourage each student to speak up in class and have an interaction with her. This make me better understand the theory and keep me concentrated.<br /><br />The TA named KK LEE is useless and NOT helpful.",
            "comment_grading": "Fair grading<br /><br />3 Quizzes (17%, 17%, 16%)<br />Individual Final Report (30%)<br />In-class writing assignment (5%)<br />Individual Participation (10%)<br />Group Exercise in Class (5%)<br /><br />Quiz 1: 93/99 (mean: 81.8, highest: 96, lowest: 63)<br />Quiz 2: 88/99 (mean: 75.3, highest: 94, lowest: 31)<br />Quiz 3: 90/99 (mean: 84.6, highest: 99, lowest: 51)<br />Final Report: 87/100 (no statistic is released)<br />In-class writing assignment: grade isn't release<br />Individual Participation: have answered 3-4 questions<br />Group Exercise: an reflection which is about the legal theory/case analysis is needed after each class<br /><br />Final grade: A",
            "comment_workload": "The workload is acceptable or even low.<br /><br />All the quizzes were in open-book format and at least 8 practice questions were provided during the lesson right before each quiz. All you need to read and revise are the Powerpoint slides and the booklet which is needed to be gone through by yourselves. Both are important and it is advised that you have a glance of both documents before the quiz. Some of the questions in the quiz are the same as those practice questions, so don't worry too much.<br /><br />The report is only 800-1000 words and only a case brief, suggestions and a rebuttal are needed. It could be finished within 1-2 days given that you do not skip too many classes.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7MG13svbtw8WND8oRo9XWHvUCqSzGJjY",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Forcy",
            "date": "Jan 21, 2021",
            "title": "",
            "comment_content": "The content is pretty basic but some words can be confusing. Most contents are about &quot;words&quot; explanation. If you can understand the concept, the content will be easy for you, but if you cannot get the concept, the content may be confusing. Many cases are provided for students to understand a concept.",
            "comment_teaching": "I love her teaching style!!! Many cases are provided for a concept. In class Q&amp;A is quite effective and professor replies email pretty quickly. Group discussions are held every class.",
            "comment_grading": "It seems hard to get A+, but A is easier to get. The grading is good and above fair.",
            "comment_workload": "No homework. No online final exam but have an individual project. (not a boring essay and only 800words required.)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fqDfu6GzB05eV1bARqDmX6LiumRZZSsy",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "litang",
            "date": "Jun 19, 2020",
            "title": "Good if you are interested in law concepts.",
            "comment_content": "A lot of concepts are included. It can be difficult to follow up. Especially for people with no law background like me. This course is divided into 4 parts: Contracts, Torts, Business Organizations, and Employment Law. The concepts are easy to understand but I personally find it hard to apply to real cases.",
            "comment_teaching": "Her teaching is pretty boring. She basically read through the PowerPoint. She spent quite an amount of time on group discussion in the first few class. There will be at least one question opened for discussion in each class, so you might want to be prepared if you are aiming at full credit. People were quite active in-class. I, however, did not answer much questions.",
            "comment_grading": "Best 2 of 3 Quizzes (Open book) 50%<br />Individual Participation 10%<br />Individual Final Report (800-1000w) 35%<br />Group Exercise in Class 5%<br /><br />Quiz 1: 82/100 (mean: 81.64; sd: 9.01)<br />Quiz 2: 73/100 (mean: 70.4; sd: 11.06)<br />Quiz 3: 88/100 (mean: 87)<br /><br />Final grade: B+",
            "comment_workload": "The workload is acceptable. All quizzes were open book and practice questions were provided. The quizzes were based on in-class PowerPoint and the booklet that you have to go through by yourselves. The booklet contains most content of the course but not all, so it is recommended that you go through both. I did not revise much and still able to score above mean. The quizzes are not that difficult as long as you go through all the practice questions.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sw4YRv0jDGyS46SUah083JdhvKV6DqFH",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "shur",
            "date": "Jun 11, 2020",
            "title": "",
            "comment_content": "Contract law, law of tort<br />I personally find it boring and tricky (except for the law of tort because it's much easier)<br />Materials are from powerpoint and booklet",
            "comment_teaching": "She's pretty new in UST so sometimes it's as if she's reading a script, but if we ask her questions, she actually understands and can answer it clearly. She remembers names in her class (even nicknames that aren't written on our Zoom)<br /><br />TA (KK Lee) can't even answer questions and doesn't really help tbh",
            "comment_grading": "3 MCQ quizzes + 1 report<br />MCQ scores are released shortly after the quiz<br />Report score isn't released until now<br />Not bad grading, just not really transparent<br /><br />Attendance: group participation &amp; personal participation<br />Report: a report on contract law (she'll assign the cases and we have to write the appellate brief)<br />No iPeer",
            "comment_workload": "Not bad<br />The report was only 800-1000 words long<br />Actually can be considered light (as long as you quite understand the materials) because there aren't many assignments or weekly quizzes",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0Mfy19iWOwMt192shPfwepY46JJIwjzC",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ccccc1",
            "date": "Jan 21, 2020",
            "title": "",
            "comment_content": "The contents are just basic law knowledge mainly about civil law. A lot of case study.",
            "comment_teaching": "Powerpoint and the face-to-face teaching not really helpful at all.<br />The professor is nice but sometime I don't think she understand the content as well... And she like to repeat the same sentence when we asked her question which didn't answer the Q...",
            "comment_grading": "Fair enough<br />2 Quiz all above mean around 1 SD.<br />Final cancelled.<br />Project grade not disclosed.<br />Total B+",
            "comment_workload": "Not mid-term but have 3 quiz and only count the best 2.<br />Project is a case study and have presentation",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Gd17GMZN41ThDSZboGzNcxSbJGQb9OmM",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "swaggerjaggerry",
            "date": "Jun 08, 2019",
            "title": "The late Charles Lam and TA KK Lee",
            "comment_content": "- Corporate Law<br />- Legal System from socio-legal perspectives (Topic I): What law is about?<br />- Legal System from socio-legal perspectives (Topic II)-Where law comes from; How law is created; How law is administrated?; The Profession<br />- Contract Law<br />- Tort Law<br />- Employment Law<br />- Business Ethics",
            "comment_teaching": "Charles Lam - funniest professor giving the most vivid and memorable examples in class, making law an interesting subject to discuss. He was also willing to answer questions, explains the discussion cases in-class in full detail and format and content very similar to what will appear in midterm exams. Need to come to all his classes to write notes that are as complete as possible because he usually tells us things orally or just written in a paper (ppt not enough). Unfortunately, he passed away in the middle of the sem and was replaced by TA KK Lee.<br /><br />KK Lee - ever since Charles stopped coming to class, TA conducted the lectures which IMO (and maybe others too) was not insightful and simply reading the ppt, so nobody ever came to class anymore and only 5-6 people present. His first few lectures was awfully painful to watch as he was very nervous and awkward, but credits to him for trying his best, and slightly improved after a few weeks. He said that after taking over, he was extremely busy and only slept like 4 hours per day...grading exams and making our final exam. He also outsourced the teaching of our last chapter of business ethics to some guy, whatever it was as bad. It seemed like he was very tired cus when we presented in class for group project, he sat in front row and literally was falling asleep and struggling to be awake lmao<br /><br />Overall i think the teaching from TA onwards doesnt really matter because you can study the notes yourself and print it all out since it's open book. No idea who's going to be permanently replacing Charles Lam for next sems...",
            "comment_grading": "1. Group research paper 20%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />2. Mid Semester Examination 35%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />3.Final examination 35%<br />4.Class participation and presentation 10%<br /><br />Grading is fair and final grade was much more lenient for us because the TA decided to enlarge the quota for A and B range.<br /><br />Midterm - short answers and long essay (case studies)<br />Finals - MCQ, short answers and long essay (case studies)<br />Group project - grades unknown<br />Participation - ask questions in the Q&amp;A session for group presentations",
            "comment_workload": "Not much<br />No assignment/attendance/reading/quiz<br />For midterm, we were given a 1-page b2b cheat sheet so it was fine...a LOT to write down though so your answers can be as complete as possible (which is what this course is about - being extremely thorough and comprehensive)<br />For finals, it was open-book so we can print everything and studying was basically just reading notes and sample questions given<br />For group project, get some capable teammates because it really matters in terms of having a direction and determining the scope of the project, because TA wasn't very clear in defining the scope (each project is given different law topics so consultations w them really matter).",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FPhAMLjg8GOyOclKjCHQZqCyzPMm4qC0",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "zyyzyyzyy",
            "date": "Jan 19, 2019",
            "title": "good grade",
            "comment_content": "the content is useful<br />especially about the employment law<br />and also you can get the basic idea about how the <br />law system is in hong kong",
            "comment_teaching": "really funny,<br />and clear.",
            "comment_grading": "1SD above in midterm<br />No idea in final<br />kinda of good in project <br />finally get A",
            "comment_workload": "you need to go to class for the in-class writing notes<br />they are important.<br /><br />this sem the prof allows us to use the typing cheat sheet,<br />so it's not that hard to finish the cheatsheet preparation.<br />i didn't do much revision,<br />just using the time for typing the cheatsheet,<br />then i get kinda good grade,<br />so the workload for me is really low.<br /><br />the project is easy to finish,<br />you may just try to find out all the related materials<br />and integrate them together",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "i0THCRqNVSnzlqON5akaFWjUc5nWrQVf",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chichi",
            "date": "Jan 15, 2019",
            "title": "",
            "comment_content": "Useful content. Provide students with an awareness of the overall legal framework in which businesses in Hong Kong operate so as to enable them to apply the relevant laws and practices to business problems and practical solutions. The materials are also supported by real-life cases and practical examples. The professor will project his hand-written notes on the monitor, which will be tested in the examination.",
            "comment_teaching": "Interesting class. A good learning atmosphere. He paid lots of efforts in teaching. Welcome questions.",
            "comment_grading": "Quite good. But grading is not transparent. Only release mid-term result but not the group project and final exam.<br />For examination, a double-sided cheat sheet is allowed. For the midterm, no cheat sheet is allowed.",
            "comment_workload": "Not heavy. Attending the lecture is very important, otherwise, you will miss lots of information. One group project and presentation, one midterm and one final examination.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iRdtQaHtd1mZYIVoXHaMGrSe8BuEUbYg",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cinnia",
            "date": "Jan 05, 2019",
            "title": "Interesting course",
            "comment_content": "Useful content. I have a deeper understanding of some basic legal knowledge. The materials do not just focus on theoretical legal principles but also supported by real-life cases and practical examples which consolidate student's understanding. <br />Not all the notes are included in ppt, the professor will project his hand-written notes on the monitor, which are very important as some of them may be included in the examination and are helpful your understanding.",
            "comment_teaching": "Very interesting class. He is a funny person who will tell jokes in class, creating a good learning atmosphere. You will not fall asleep because you have a lot to copy. He is knowledgeable and willing to answer questions.",
            "comment_grading": "Quite good. But not transparent. Only mid-term result is released. The grade of the group project and final exam are not disclosed. <br />For both examinations, a double-sided cheat sheet is allowed. It helps a lot, at least you don't need to remind all the principles and terms. Better included all the materials, i.e. ppt, hand-written notes and cases in the cheat sheet.",
            "comment_workload": "- One group project + presentation. 5-6 people per group. 10 mins presentation. <br />- No attendance required. But attending class is important for your learning.<br />- No assignments.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bR3Nc2mgFpxjqddD4JMoSJoxZwPYszrk",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "animej",
            "date": "Jan 03, 2019",
            "title": "Nice professor, interesting course",
            "comment_content": "The content in this course was quite interesting and useful. You don't have to memorise every detail as 1 cheat sheet is allowed in the exam.<br /><br />Also, I don't recommend buying the textbook. He doesn't really follow the textbook. Some of content he covers isn't in the textbook, and many chapters in the textbook aren't covered. He only tests topics that he covered in class. You can borrow the book from the library if you want to have a look. As long as you attend every lecture and make notes about all the topics he covers, you should be fine.<br /><br />1. Formation of Company<br />- types of companies<br />- winding up process<br />- articles of association<br /><br />2. Legal system<br />- civil vs criminal law<br />- standard of proof<br />- HK gov &amp; legal system<br /><br />3. Contract Law<br />- types of contract (simple contract, deed)<br />- deed vs doctrine<br />- offer, acceptance, consideration<br />- expressed vs implied terms<br />- invalidity of contracts<br /><br />4. Tort Law<br />- novus actus interveniens<br />- vicarious/joint liabilities<br />- tort of negligence, duty of care<br /><br />5. Employment law<br />- tests to determine employment relationship<br />- duties of employer/employees<br />- types of termination<br />- rights under the labour ordinance",
            "comment_teaching": "Charles makes a lot of jokes and his classes are interesting. He goes through a lot of case studies in class which is good for helping us understand certain concepts. He is also happy to answer questions after class.",
            "comment_grading": "Group research paper&nbsp;&nbsp;20%<br />Midterm 35%<br />Final Exam 35%<br />Class participation 10%<br /><br />In the midterm, 1 question was worded quite weirdly, so most students failed that question. But the TA was nice in that he acknowledged that the question was confusing.<br /><br />In the group research paper, you are judged on the level of legal research, analysis of the law and creativity (suggestions for improvement).<br /><br />He didn't really explain how class participation will be graded, but I guess as long as you don't do anything disruptive, contribute every now and then and he recognises you, you'll probably do well in this area.",
            "comment_workload": "The workload is quite light. We can bring 1 cheat sheet to the exam, so there is no need to cram information into our brains. The final is also non-cumulative which is great.<br /><br />For the group research paper, you can form your own group or be put into a group by the TA. The essay topic is chosen at random, so hope that you get a good one.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Vf7UUpAHrqAuZ8cFEvffqbRwbbCZUxRV",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "zozo",
            "date": "Jan 02, 2019",
            "title": "Interesting Content, Funny Professor and Manageable Assessments",
            "comment_content": "Approximately 5 topics were taught for this semester, including contract law, tort law and employment law. Very interesting content with a bit challenging cases studies.<br />Assessment:<br />1 mid-term (3 topics)<br />1 group project (4500 words essay plus in-class presentation; maximum to be about 6 people in a group)<br />1 Final Exam (3 topics)<br /><br />Cheatsheet is allowed for mt and final, so it is pretty easy.",
            "comment_teaching": "Charles is very funny and knowledgeable. He welcomes questions after class. And if you pay enough attention in class, jot more notes and inclunde them in your cheatsheet, you will get a good grade probably.",
            "comment_grading": "I got approximately 1.5 sd higher in midterm, no scores are shown for final and project. But I get A+.",
            "comment_workload": "Revisions would be easy as content are so interesting with many vivid examples in class. The only revision you need is to go through all notes and put them all into your cheatsheet.<br />Project would be manageable as the workload is shared among teammates.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BS5Vu7hOPnURyWunk4K5jxcIjIVgLFWe",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "魚",
            "date": "Aug 04, 2018",
            "title": "",
            "comment_content": "Covers corporate law, the law of contract, the law of torts,&nbsp;&nbsp;legal system in Hong Kong, Employment law and business ethics. Charles will demonstrate how to answer case study questions in class and his ppt lack some of the details which might be asked in the exams.",
            "comment_teaching": "Charles is a nice person. Do seek help from Charles if there is any problem with your group project.",
            "comment_grading": "The exams are mostly essay type questions on comparing different concepts or case study. The exam is marked by the TA and he is quite strict on the marking.<br /><br />The final exam score and the project mark were not released. I scored slight below mean in Mid term and get an A in final grade.",
            "comment_workload": "1 midterm<br />1 finals <br />you can take an A4 sized cheatsheet with you<br />1 group presentation base on a 3000-word essay done by your group",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CZLhn9LMnH9qjTJlWM6FWABaVx3vPdmP",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "goby",
            "date": "Aug 04, 2018",
            "title": "",
            "comment_content": "I think the content is quite fun and I really understand more about business law and basic law. The ppt is a little bit confusing as there's no detailed explanation for every points. There is a group project about law and each team is required to have a different topics. Some of them are quite difficult, but you can definitly seek help from Charles.",
            "comment_teaching": "Charles is nice and very cute!:)",
            "comment_grading": "Mid term grade is depends on TA. He is very strict in marking key words, even if the answer has the same meaning. <br /><br />Not difficult to score above mean.<br />The final exam score and the project mark are not released in canvas. I scored above mean in MT and get an A in final grade.",
            "comment_workload": "Need time to write cheatsheet.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HGDDFjCW10dSTLss5DxqLCPhM4qUcgd8",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Erin Lin",
            "date": "Apr 05, 2018",
            "title": "",
            "comment_content": "Provided useful introductory content on legal system, employment law, contract law, and tort law.",
            "comment_teaching": "Lectures are relatively easy to follow and the professor is really considerate towards students.",
            "comment_grading": "Taking notes in class is important since some are not included in the ppt but will be tested on the exam. Didn't spend much time after class but still end up with an A.",
            "comment_workload": "Cheat sheets are allowed for both the midterm and final, so it would not be strictly memorization. The group essay assignment involves interesting topic and wouldn't be time-consuming if you coordinate with your group well.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "i2ss0DTZN24S7Rl7SI3QfTkA8tSEE7VB",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MelodyLam",
            "date": "Jan 22, 2018",
            "title": "Acct3610",
            "comment_content": "There will be some technical terms which you must understand, but it will not be too difficult to handle",
            "comment_teaching": "Quite fun<br />Charles is humorous<br />He can turn difficult content into simple concepts",
            "comment_grading": "As long as you attend all lectures and take notes of what he wrote on the board, you can definitely handle the mid-term and final. Questions won't be too difficult. You can carry a piece of cheat sheet to exam. Simply copy all relevant information you will be secured a good grade :)",
            "comment_workload": "Only a mini group project and easy presentation<br />It will not be too intense",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OjDjSrSD6HF8AzsMaWfgMGgOvO5Wda4i",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Thomas Lai",
            "date": "Jan 22, 2018",
            "title": "",
            "comment_content": "This course mainly talk about law in Hong Kong including employment law, contract law, tort law, legal system, case law and so on. It really enrich my horizon in law and I have learnt to use law to protect my own interest in my daily life.",
            "comment_teaching": "teaching is quite funny and not boring. Charles will use a lot of case to illustrate the law. For the exam, just make sure that you attend all the lesson and jot notes. Exam question would be about what he taught in class, with cheat sheet.",
            "comment_grading": "Very good grade. Just copy all the stuff on your cheat sheet to the exam paper.",
            "comment_workload": "A bit heavy because need to do the law essay, which is extremely long.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2c9grxr0RqVwTMHHjzqp604NkheUfWcT",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Harrywong",
            "date": "Jan 18, 2018",
            "title": "",
            "comment_content": "the course covers:<br />1. Formation of Company<br />2. Legal system<br />3. Contract Law<br />4. Tort Law<br />5. Employment law<br />6. Business Ethics<br /><br />the syllabus has been reduced. So it should not be a problem.",
            "comment_teaching": "The way Charles teaches is really funny. He always uses examples to illustrate the law and it does help you to remember the details. <br /><br />You really need to pay attention to the class and should not skip too many classes as there are some points that you cannot find on the teaching materials will be asked in the examinations.",
            "comment_grading": "The grading is pretty nice. <br /><br />if you got mean for everything, I believe you would get a B for this course. <br /><br />Both the midterm and final exam is pretty straightforward. <br />Do remember to copy everything on the lecture notes to your cheat sheet as they will even ask you about the cases mentioned in the class.<br /><br />The exam is basically testing your writing speed and how much content you can put on your cheat sheet. You just need to copy and paste like a retard. However, there are still some case questions that you need to analyze but don't worry, you should have enough practice during the class.",
            "comment_workload": "Apart from a group project that started after midterm, it has literally nothing to do during the semester. <br /><br />The group project is kind of an easy one. A group of 4 - 6 will work on an assigned topics about law system and write an essay of around 5000 words. <br /><br />All you need to do is to follow the structure suggested by Charles and the Teaching assistant. and you will be alright",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KvCn0YuK23p5xT9upJUPcCvWaF5fTa99",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DontSearchMe",
            "date": "Jan 16, 2018",
            "title": "Too many 學霸...",
            "comment_content": "The content is broad, which gives you an overview of what is law and how it looks like. It includes big topic in law like Tort law, Employment Law, Contract law, etc.<br />It also includes some other parts like Ethics and Legal System of HK",
            "comment_teaching": "The teaching style is very local and traditional. You will be busying to jot down all the notes as he will keep writing down key points and they are all very important and cannot be found elsewhere in his ppt or pdf.",
            "comment_grading": "The grading is okay, but also there are so many hardworking accounting major people here, it turns out to be quite difficult to get good grade.",
            "comment_workload": "The workload is light. Attendance does not count although you will definitely come to class and jot notes. There is only a research paper to turn in as assignment. Mid-term and final constitute much of the final grade.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WMGFdNm1s47uG6cKAnU2JGVoNbjpjUSj",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "usthokzha",
            "date": "Jan 12, 2018",
            "title": "",
            "comment_content": "The content of this course is actually quite interesting. Topics include company formation, tort, employment, contract and business ethics.",
            "comment_teaching": "Charles can make law topics quite interesting with his examples and cases. Delivery is quite clear and content is relatively easy to understand.",
            "comment_grading": "I got above 0.2 sd for midterm. Scores for final and the project is not released. I expected B range but got an A in the end. Make sure to have good groupmates to carry you as group project topics can range from minimum wage to Anglo-American corporate governance system. Go to lectures and take notes as they will be useful in the midterm and final.",
            "comment_workload": "Workload is not really high. If you attend all the lectures, I believe you can revise and prepare for the exams in a relatively short period of time (1 day is usually enough). You can also copy all the notes on the cheat sheet. For the project, if you have good group members, you only have to finish your part (~800 words per person) so it is easy to handle.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qBMyQLMRTt6kLPR6iONBHkZmEzJ5EVVF",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jenniferyy",
            "date": "Jan 10, 2018",
            "title": "",
            "comment_content": "It covers six topics in total: Corporate Law, Legal System, Contract Law, Tort Law, Employment Law, Business Ethics.<br /><br />Since it is an entry-level course of business law, the prof didn't dig deeply into the topics but still provide detailed explanations of each law.",
            "comment_teaching": "The teaching materials include lecture slides, supplementary notes and discussion questions for each topic in separate files. However, during the class, the prof sometimes jump between the slides and other materials and you may get lost easily. <br /><br />There are loads of notes written by the prof on the whiteboard for each class and you are highly suggested to copy all the notes in order to get higher marks for the midterm and exam. It would be even better if you copy all the words he said which some of them may not be on the whiteboard.",
            "comment_grading": "Group research paper&nbsp;&nbsp;20%<br />Midterm 35%<br />Final Exam 35%<br />Class participation 10%<br /><br />The format of midterm and exam is the same: 3 discussion problems and 2 case study questions(essays)<br /><br />You can bring a 2-sided A4 cheatsheet(no font size restrictions for hand-written).<br /><br />For the discussion problems,&nbsp;&nbsp;most of them are quite straight forward and you can just make good use of your cheatsheet and paste all the notes into it.",
            "comment_workload": "One midterm+ one final+ one group research paper.<br />For the group research paper(5-6 ppl in a grp), you need to write about 1000 words of essay discussing the current law. The topic will be randomly selected by one of the group member in the beginning of the semester. Both the TA and the prof would give detailed explanations and directions for you.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nE8SxWGbNYHehOa5dc5VkNCOVnkpp2Mj",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "younowho",
            "date": "Jan 03, 2018",
            "title": "",
            "comment_content": "Very useful course as an entry-level course in Business Law. I absolutely enjoy this course and it provides you with a lot of legal knowledge to protect yourself as you enter society.<br /><br />Topics:<br />Corporate Law<br />Legal System<br />Contract Law<br />Tort Law<br />Employment Law<br />Business Ethics",
            "comment_teaching": "The prof's lecture PPTs, supplementary notes and discussion questions were not organized in 1 single place. He would jump from PPT to the notes and then back to the PPT. So it's best if you have all the lecture materials ready before class. <br /><br />During class, you would have to copy down everything he wrote on the whiteboard, because these would be highly likely to come up in the exam. <br /><br />The prof is a hilarious guy. He applies business law to everyday life.",
            "comment_grading": "Group research paper: 20%<br />Mid Term: 35%&nbsp;&nbsp;(Mean: 33.9 and SD: 6.51 )<br />Final Exam: 35%<br />Class participation: 10%<br /><br />Mid-term and Final were all short questions and essays. No MCs. You're allowed to bring a 2-sided A4 cheat sheet. As long as you copy all the legal principles and relevant examples, you should be able to handle the exams. Also, the questions were mainly based on the discussion questions + the notes he wrote on the whiteboard, i.e. extra points that were NOT on the PPT. <br /><br />For the Mid Term, there were 2 essay questions on exemption clause and contract law respectively. They resemble the discussion questions in class. <br /><br />For the Final, there were short questions about ethical issues such as minimum wage. <br /><br />There's no absolute right or wrong in law as long as you could back your argument with legal principles. So for the essay part, try to elaborate your point with legal principles with examples. <br /><br />I don't think we did particularly well in the Paper. Got around 1.7 SD above mean in Mid term. Don't know the results for Final. In the end, got A+.",
            "comment_workload": "Moderately light workload.<br /><br />Attendance is not counted towards the grade. To get the 10% in class participation, as long as you don't cause any disturbance in class, you should be fine. <br /><br />There's a group research paper (5-6 ppl) to be submitted at the end of the semester. If you pretend to be very lost and find the prof, he would give you a lot of directions. He would also look into the amount of research you did, so try to paste as many links that you looked into in the footnote to show your effort.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xTjNUFVoEMxNakzPsEP0ec2SHLTRWyUv",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nathan CC",
            "date": "Jan 03, 2018",
            "title": "Not so sure why the grade is so good !?",
            "comment_content": "Basic legal stuff you know",
            "comment_teaching": "Charles is a funny guy. He fed me lots of useful and important information of the project when my team asked him how to do it. He is definitely helpful when it comes to school work.",
            "comment_grading": "Mid-term: Mean <br />Final:? (But I was confident that I would nail it)<br />Project:?? <br />Grade is A<br />All you need to do in exam is to put literally everything on the cheat sheet before the exam and copy everything related from your cheat sheet in the exam.",
            "comment_workload": "Standard workload with 1 mid term and 1 final + 1 project. The project was quite difficult to be frank. But if you ask him and TA, they will definitely give some useful advice.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VGBrYELbJq63FDMPhdtj9n9UWaUdUcWR",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ccyyggy",
            "date": "Aug 31, 2017",
            "title": "",
            "comment_content": "Outline of the course:<br />1. Corporate law<br />2. Legal System from socio-legal perspectives part 1<br />3. Legal System from socio-legal perspectives part 2<br />4. The Law of Contract<br />5. The Law of Torts<br />6. Employment Law<br />7. Business Ethics ( Charles was not able to cover it due to time limit this semester)",
            "comment_teaching": "Extremely good!!!<br /><br />Professor is very friendly and able to clarify the concept clearly.&nbsp;&nbsp;Not only provide many cases as example to explain each law, he tried to cracking jokes, but mostly only local students can understand it.",
            "comment_grading": "not sure how it grades, but I heard that you need to pay attention to the group research paper, given it only accounts for 20%. <br /><br />Mid-term: slightly about mean <br />Final: unknown <br />Group research paper: unknown <br />--&gt; final grade: A",
            "comment_workload": "relatively heavy since you need to make sure you jot down all the sentences he spoke during class so you are able to answer questions in mid-term and final. <br /><br />He may test concepts which he may just mentioned in class for 5 mins only.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1MXjle81Txw0MfqV2J1sAniUFrXQSSv1",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "acatslave",
            "date": "Aug 06, 2017",
            "title": "",
            "comment_content": "Corporate law, legal system, misrepresentation, contract law, tort law, employement law.",
            "comment_teaching": "Charles has sense of humour (tho his punch lines repeats every year), he can always give very funny example to explain concepts and cases.",
            "comment_grading": "The grading is fair. If you are a hard working student, who will attend every of his single class, and jot down every word he mentioned, it is not hard to get an A. I mean, really every single word! Mid-term is relatively easy comparing to final exam, you are mainly tested with the content that has not printed out, please attend his lecture if possible. Cheat sheet is allowed to bring to assist your final examination, so you don't have to remember all the stuff in the final.",
            "comment_workload": "Workload is fair. One mid-term, a group eassy and presentation, and final examination.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "a2KtoxdBaER44LO33UX7NgeXVaFk1rGv",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Florence Huang",
            "date": "Jul 17, 2017",
            "title": "",
            "comment_content": "1. Corporate Law: <br />2. Legal System<br />3. Contract Law<br />4. Tort Law<br />5. Employment Law",
            "comment_teaching": "professor is very funny and always gives you case examples in class. this will come out in exams for sure. but he speaks very fast make sure you bring your laptop and just take notes on everything he said in class. Charles is a really nice guy he replies to every of my email but sometimes he's just not fast enough",
            "comment_grading": "I think he's pretty decent in grading. Tbh i got slightly below mean in midterm. It was way lower before! I came to the paper check and got extra 3 points!! For project I really do not know, Final either. But I was pretty confident for final. Ended up with an A.",
            "comment_workload": "workload is quite okay, but I revise a lot for this course. Try to attend every class, it's important. You will be assigned a topic randomly through drawing the lot, but you can pick your own teammates. Only one project is assigned for the whole semester, my group just started pulling some real efforts 2 weeks before submission lol",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "P7RoriPnG9z0QP5tIn5i5RHyyBF7Q3jU",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "biancawong_hk",
            "date": "Mar 10, 2017",
            "title": "",
            "comment_content": "The first half of the course covers the legal system in Hong Kong and contract law. The second half covers business ethics, tort law and employment law. <br /><br />A very useful course as it will enhance your understanding of law especially when we don't have any legal background <br /><br />The prof. loves Confucianism and tries to relate it to business ethics issues.",
            "comment_teaching": "Charles is a very presentable professor. He is probably one of the best lecturers that I have ever met. He actively answers students' questions and always uses different interesting examples to explain the legal principles. He also teaches some useful answering techniques for the exams.",
            "comment_grading": "The grading is relatively low compared to other courses. It is much harder to get a B range. You need to do particularly well in the final exam. Pay attention to the ethics class and apply some principles of Confucianism to the exam paper.",
            "comment_workload": "The workload is light as you are allowed to bring a cheat sheet to the exams. However, the expectation on the group project is very high.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AN9cNZCeHepPEsnu1p4vmM8BhilL8Hgu",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lala2",
            "date": "Feb 15, 2017",
            "title": "Bad/Ambiguous grading, good teaching and interesting content, funny confucianism",
            "comment_content": "Content is good as it will give you a good glimpse into Hong Kong's legal system. Overall this aspect is good.<br /><br />Charles is obviously very pro-Confucian and tries to promote Confucian ethics mixed with law. Unfortunately, this leaves a lot to be desired. I don't think this is relevant to this course.",
            "comment_teaching": "Charles has a very entertaining style of teaching where he makes a boring subject like law fun and interesting. Its worth attending his lectures, even for entertainment.",
            "comment_grading": "I felt i was going to get a B grade as i was above the mean for my midterm, but ended up getting a C+. I honestly don't know why this is so but i couldn't check the paper and had to just trust the instructors grade. For a subjective course like this it is not very reassuring. <br /><br />The exam is essay based and requires written responses. The group project requires an essay to be written.",
            "comment_workload": "Workload is quite light as you can bring a cheat sheet to the exam. That being said, you need to be familiar with the content otherwise you will have a hard time during the exam.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qgePlqx4gvOpXw7ryEDXWGbsHqjb9w01",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Arange",
            "date": "Jan 27, 2017",
            "title": "",
            "comment_content": "Accounting major required course. In fall semester, only accounting major students can register for this course. <br />Ch1 Corporate Law<br />Ch2 Legal System from socio-legal perspectives I<br />Ch3 Legal System from socio-legal perspectives II<br />Ch4 The Law of Contract<br />Ch5 The Law of Torts<br />Ch6 Employment Law<br />Ch7 Insider Dealing<br />Ch8 Business Ethics and CSR<br />Ch9 Auditors and Ethics Plus Model",
            "comment_teaching": "Teaching is bad. The professor is speaking too fast, powerpoint slides do not cover everything. Only bullet points exist on slides. There are many supplementary notes and questions. Some of the contents are mentioned in the ppt slides. The content will be a little bit messy when you revise.",
            "comment_grading": "Group Research Paper 20%<br />Midterm Exam 35%<br />Final Exam 35%<br />Class Participation 10%<br /><br />Midterm mean 37/50, i get 41/50<br />Other marks unknown<br />Grade: B<br />The grading is bad. If you touch the mean, you will probable get C to C+.<br /><br />You need to form groups of 4 to 6 members. Topics are drawn by one of the members at TA room. No guidance will be provided except you make appointment with professors or TA.<br />Midterm exam covers chapter 1 to 4. There are three essay questions and two cases analysis questions needed to be finished in 2 hours.<br />Final exam covers chapter 5 to 9. There are four essay questions and two case questions in three hours. The level of difficulty rises as most of the questions are related to Xunzi and Confucianism.<br />You should attend all classes and at least raises some questions for 10% class participation.",
            "comment_workload": "The workload is average as there is group research paper. The word&nbsp;&nbsp;&nbsp;limit is about 5000 words. Midterm and final exams allow one double sided-cheat sheet but you can not write all the notes on the cheat sheet as the content is too much",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "kdPEnT0UwImJmCuPdJZNzZDY1js2pFvZ",
                    "name": "FLSB-2016-2017-Fall-outline (To student)",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "jSBaHXus8AgcGCUQOLHeBirjFNnhJbXo",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "oak",
            "date": "Jan 16, 2017",
            "title": "ACCT3610",
            "comment_content": "A required course for accounting student. I think it is not only useful for accounting students, but also business students. And all students should know a bit about employment law to protect themselves from their employers. <br /><br />you don't need to buy the expensive textbook because Charles will only test on the stuff he taught in class.<br /><br />Outline of the course:<br />1. Corporate law<br />2. Legal System from socio-legal perspectives part 1<br />3. Legal System from socio-legal perspectives part 2<br />4. The Law of Contract<br />5. The Law of Torts<br />6. Employment Law<br />7. Business Ethics",
            "comment_teaching": "A funny guy, always make people laugh, always turn the air-con to very low temperature!! freezingggg. Anyway, he is a super good guy.<br /><br />His note is a bit messy. you need to organize the note before exam but it shouldn't be a big problem.",
            "comment_grading": "Super GOOD grade!! I did quite well in midterm, but don't know project and final grade. The overall grade is super good for me.<br /><br />1. Group research paper&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />2. Mid Semester Examination&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;35&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />3. Final examination&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;35<br />4.Class participation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10",
            "comment_workload": "you need to copy tons of stuff in order to get high mark in midterm and final. and the project is also quite an annoying stuff, I got a super difficult questions for the project. and it would be best if you have good group-mates. it helps a lot if all people work together.<br /><br />project stuff wont appear in exam!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jiXKkKChywZuQJw8plvHw3ZbBr2EtMeq",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "sonnybb",
            "date": "Jan 02, 2017",
            "title": "",
            "comment_content": "The course teaches about law in business. There are altogether 7 topics. Additional material and textbook reading is not required. All you need to do is understand everything on ppt and things discussed in class.",
            "comment_teaching": "The professor will talk about many additional knowledge in class which is important because they will be asked in midterm or final. There is also some in class discussion question (not calculated towards final grade), these are important too as midterm and final&nbsp;&nbsp;are actually base on those question. Cheatsheet is allowed in both midterm and final.",
            "comment_grading": "The grading is good. The course is not difficult since we are allowed to write cheatsheet. <br />The grade will not be too bad if you copy all the materials needed into the cheatsheet.",
            "comment_workload": "The workload is not heavy. There is one midterm, one project ( no presentation) and one final. The project is base on research which is not really difficult to do.<br />There is no assignment or quiz.<br /><br />Reminder: need to write really fast in exams, especially in final, you might run out of time easily.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "T7u6v1AqNKw9BEC5dhd0Q9ZULpRmMwHw",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Orangee",
            "date": "Jan 28, 2016",
            "title": "Average grade, useful content",
            "comment_content": "-discussion:use of cases to apply the laws learnt<br />-topics: tort law, contract law<br />-group project: allowed to form your own group+ presentation",
            "comment_teaching": "-use of both ppt, supplementary notes and discussion<br />-the notes itself is not enough, have to attend his lesson to jot down notes<br />-he talks pretty clearly and has quite a sense of humor <br />-ve:<br />Sometimes it's quite complicating to study with both supplementary notes and ppt as they overlap at times",
            "comment_grading": "Average <br />-work hard to score high in mid terms- it's usually easier than final",
            "comment_workload": "The only workload is from the group project, try to prepare for it earlier otherwise it will overlap with your exams",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EeqziEozizsrTGuLmuhf7KD3vVW9jocu",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mike Fong",
            "date": "Jan 25, 2016",
            "title": "The importance of project",
            "comment_content": "The cases discussed are interesting. And not as many things as you may think need to memorize. <br />But you have to attend all the lesson and write down all the things he says.<br />Because you cannot rely on the ppt.",
            "comment_teaching": "The teaching style is good.<br />You won't feel bored at al.",
            "comment_grading": "Grade is pretty good.<br />As long as you work hard for the midterm and final, it should be no problem.<br />Midterm is not difficult. But for the final exam is next level.<br />Be well prepared. RMB to write down all the things he says in class. Maybe something seems irrelevant but it could be tested on final.",
            "comment_workload": "Only midterm <br />Final <br />And project",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WnYRMnYGDug2ZtMbDCJrrRJrolntHXq2",
            "semester": "2012-13 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Maria",
            "date": "Nov 18, 2015",
            "title": "Interesting professor and topic",
            "comment_content": "Overall, the content covers the business law of HK. With many cases explained in class, it enables better understanding of the legislation and how the law applies to daily life. If you are interested in law, it will be a good starting point though as a 3000 level course.",
            "comment_teaching": "The professor is soooo cute &gt;~&lt;<br />He is responsible and whenever you ask questions, he explains diligently. He is also easy to find and spend time chatting with you. However, a minor downside part would be that cases may be able to organize in a better way with logic.",
            "comment_grading": "Grading is relatively good i think. Project paper assignment is very important!<br />I got slightly below mean in midterm, but good in assignment and final, which gives me an A.",
            "comment_workload": "Not that much, but you need to memorize certain laws and learn to analyze the issue in a structured way.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9r3TV2OoUV5ke9qBGMeEUakqdNLfL3bf",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "alexlan",
            "date": "Aug 25, 2015",
            "title": "",
            "comment_content": "The course covers several topics like Basic concepts of law, The legal system in HK/China, Contract law, Employment law, Tort law and Business ethics. Don't be afraid of law, this course only covers some basic and fundamental concepts, so be ease.",
            "comment_teaching": "The professor is so really nice, whenever we have problems, he shows his helping hand to us immediately. Originally, I thought law is boring, but Charles likes to make some jokes in order to make the lesson more funny. It is easy to understand what he said during the lesson.",
            "comment_grading": "For this course, there are four assessed tasks:<br />1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Group research paper&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mid Semester Examination&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;35<br />3.\tFinal examination&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;35<br />4.\tClass participation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10 <br /><br />Points will be added up to get total points out of 100. The class curve is based on total points for the course. Grading is done on a relative (not absolute) basis. Charles will comply with university policy in grading. Just like normal distribution. Fair grade.",
            "comment_workload": "There is no homework for this course, but you are assigned to do a group project related to the law. During the lesson, you have to jot down many notes. If you miss it, you will&nbsp;&nbsp;be confused definitely in the exam.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yLJhGVzJ4Jm7oPWHzIhYxlvsOBj2QYQo",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kchanah",
            "date": "Aug 20, 2015",
            "title": "ACCT3610 Review",
            "comment_content": "The topics are incredibly interesting if you'd like to understand a bit of the basics of business law. The course covers the fundamentals of each topic (Basic concepts of law, the legal system in HK/China, contract law, employment law, tort law and business ethics). <br /><br />You don't need to be afraid of the course code - trust me. I chose this course last semester because there was really nothing else to take. I thought it'd be awful but it turned out to be the best course choice by far.",
            "comment_teaching": "Charles is super friendly and likes to make lots of jokes (though no one laughs). He uses powerpoints and a ton of word documents that contain 'past paper questions'. A typical class consists of him going through the powerpoints and then applies the concepts you just learned in the questions. You can feel free to interrupt him at any point in time to ask questions - he's always happy to clarify. <br /><br />Attendance is not compulsory even though there are 'participation points'. BUT if you want to do well (which I presume you do), you NEED TO GO TO CLASS. Charles' PPT &amp; notes (which he uploads to LMES) are not comprehensive enough. He often adds additional information. If you're a fan of taking a lot of notes and then exactly regurgitating everything the professor says then this is the class for you, seriously.",
            "comment_grading": "The grading is pretty fair to be honest. <br />Mid term 35%<br />Final 35%<br />Participation 10%<br />Group Project 20%<br /><br />The group project is the really long essay you write (with other people) on a law topic. You draw this topic out of a hat with the TA. You can then go to Charles and arrange a meeting and pretend you are honestly very confused and hopeless. He will then tell you exactly what he wants in the essay - no joke. He's the nicest person on earth. <br /><br />The 10% participation is a mixture of your questions in class and the verbal presentation you give with your group mates for the group project. Throughout the entire semester I think I asked about two questions... so honestly it doesn't really matter. I've been told that so long as you give the presentation, you get the full 10%. <br /><br />The final exam was a mind blower because half of the paper was on Confucius. We learned business ethics in the last two weeks of the semester and Charles so happened to focus on business ethics for the final. A lot of people thought memorizing business ethics was a waste of their time and didn't revise for it... so... oops?<br /><br />I got 41/50 for the midterm - slightly above mean. He never told us what we got for the group project or final or for participation. I ended up getting an A+.",
            "comment_workload": "I took this course as a terrified Freshman. The course was not as terrifying as what everyone described it to be. <br /><br />The only work you have to do is write a lot/type very quickly in class and then do the essay. That's it. That being said, memorizing information can be difficult. But I assure you that the exam questions are EXACTLY like the past paper questions he goes through in class (except 1 exam question = past paper question 1 + 2 + 3 combined). If you pay attention to class you will get a good grade.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uQwT24r6f9ocky0dr55ppXQJrcDvzVg0",
            "semester": "2014-15 Summer",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chchanca+++vcv",
            "date": "Aug 16, 2015",
            "title": "",
            "comment_content": "The topics are quite interesting but also easy to follow, if you can put effort. The course introduces you with the basic concepts of law, such as the legal system in Hong Kong, the employment law, the tort law, the contract law, and the business ethics. It must be emphasized, although the course is with the course code above 3000, it is only an introduction to law. So, it is okay for you to pick the topics up. The most important thing is your effort.",
            "comment_teaching": "The instructor is a good one. Not only can he explain the abstract concepts of laws clearly with a variety of examples in real-life, but he sometimes makes some jokes so that the lessons are not boring at all. He can cater to the needs of the students, and he welcomes questions. Actually, what is the most important in the lessons is not the notes he distribute, but what he has discussed in the lessons.",
            "comment_grading": "The grading is not too good, but fair. One mid-term(35%), one final(35%), attendance(10%), a group project(20%). I scored 32/50 in the midterm. The mean was 38 and the S.D was not shown. I guessed my mark was below 1.5 S.D. My group project was fair. And I guessed I did my final very good because overall I got a B grade.",
            "comment_workload": "As a year-one student, I personally think my decision to take the course is very bad. The examinations cover not only the power-point notes but also what has been discussed in the lessons. So, it is important to attend all the lessons and even take down the notes of what the instructor says. The workload for preparing the examinations is huge. Also, for the group project, the topics are too broad, and it is quite demanding to work on this, especially if you are not interested in the topics. The final thing to say is that if you have the enthusiasm in law, let's take the course, but otherwise, don't risk your GPA.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Q8JaPLaD1ujCyTdcA4stFwUapc3fyffr",
            "semester": "2013-14 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": ":)",
            "date": "Aug 13, 2015",
            "title": "",
            "comment_content": "Content is fun and useful. Course is about general business law such as what contributes to negligence. Highly recommend students from all field study this course.",
            "comment_teaching": "Charles provide ppt slides and supplement notes but taking notes is very important during class as his ppt may not cover all materials included in exams.",
            "comment_grading": "good grade as long as you memorize most of the notes given and jot down notes during lecture. Project presentation should be relaxing as long as your presentation is ok. Asking Charles for advice may help.",
            "comment_workload": "Only workload comes from the group project. Exams are in short questions and essay forms. Class examples contributes quite a lot, so daydreaming in class is a NONO.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JU3AoTNji0gvPsIHHYmR6kKc7Z1aEW7Q",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1270,
                    "name": "TAN, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "林子晴",
            "date": "Apr 11, 2022",
            "title": "pretty good course",
            "comment_content": "The content itself is pretty fun and overall is easy.",
            "comment_teaching": "absolutely nice and friendly professor, always trying to make the class more interesting (and in fact did most of the times)<br />is quick at response and can just ask her anything and she'll give you an answer/direction",
            "comment_grading": "- 3 quizzes 17% (mean:88.4), 17% (82), 16% (88.7)<br />- individual final report 30%<br />- in-class writing asg 5%<br />- individual participation 10%<br />- group exercises in class 5%<br />(formed a group but is mostly no use)<br /><br />my quiz scores are slightly above mean, got an A in the end",
            "comment_workload": "quizzes are easy in general, mcqs and open-book. prof provides sample questions to exercise during class, so make sure participate in class.<br /><br />final report is 800-1000 words. i got assigned to a rather easy case so i think it's quite easy. asked for prof's comment on the outline before i start to write, she gave me a lot of constructive advices.<br /><br />in-class writing asg is really easy, contains 2 parts. first part is short and easy, can maybe finish in 5 mins. second part's paragraphs were long, but if you attend class you'll find it basically examples she made in class.<br /><br />individual participation: not sure how it was graded cuz i did not raise hands in class, she hands out blank paper sometimes in class for writing notes but get it back only on occasion",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Yu2dOBG15SVMqiI7PoO7209SFsKCXSik",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cr",
            "date": "May 17, 2019",
            "title": "",
            "comment_content": "very useful, especially about criminal and employment law. <br />I would recommend this course to all majors as there is no prerequisite to take this course.",
            "comment_teaching": "one of the best professors you will ever meet. Very funny and down to earth who is more than willing to go out of his way to answer your doubts.",
            "comment_grading": "easy A range if you put in the hard work, and if your english is fluent it's an advantage.",
            "comment_workload": "very light. as midterm we could bring cheat sheet and final was open book.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AwwwB7i12DvYwpjFYY3fXF3ZgWw1qbJe",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "zerol",
            "date": "Jan 21, 2017",
            "title": "",
            "comment_content": "must attend all the lecture and drop the notes he write on board，it will be test in the exam.<br />lecture notes (ppt) is long as hell... expecially in the final though is not cumulative but things is still many to memorize",
            "comment_teaching": "very interesting，never fall asleep in class",
            "comment_grading": "will test the discussing question<br />one cheat sheet for exam. <br />grading around 1 sd above (mid term) score b- (final grade and projest unknown...)",
            "comment_workload": "project +&nbsp;&nbsp;mid term + final<br />the work sheet of extended information will test in exam. book is not necessary just attend lecture and drop notes is enough",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CMPJBRlF9IC0gHW0cV6GFrJSluY4EgyB",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 7,
                    "name": "LAM, Charles",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "whywhygig",
            "date": "Aug 09, 2016",
            "title": "",
            "comment_content": "The contents are quite useful as they cover some basic laws that we might face in daily life. Like, tort law, contract law, etc. I enjoy studying the materials and the contents of the course are well-prepared. There are some case studies in ppts and supplementary notes. There ARE quite a lot of content to remember though. You got to remember the details of each law. It sounds hard but it is not too much if you pay attention in class and understand the content.",
            "comment_teaching": "Charles gives clear presentation and always answer any question from students after class. He is a nice guy and his teaching arouses my interest in laws. I paid attention in most classes though occasionally doze off on the days after I slept late. It is better to pay attention though as you have to jot down a lot of notes when Charles explain a lot in class. You might not understand only depending on the ppts. Better get a friend cover for you so even you accidentally skip a class you get the notes. Originally I print 6 pages on one paper but I changed to 3 pages on one so I got more space to jot notes. That's how much the notes are!",
            "comment_grading": "I got mean in midterm but I probably did VERY badly in final (cannot check final paper). I knew I screwed up as I did not revise a lot. I got C+ at last. Acceptable for me given my lack of revision before final. You can have cheat sheets - A4 double size! Better write down the details of the laws and some cases for you to cover during the exam. There is also a group project. My group may have done a good job I think -- My group mates got good grades they said.",
            "comment_workload": "Attend every class and jot notes. No Homework. Start preparing your project earlier so you don't have to rush amid your other courses' exams.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}