{
    "error": false,
    "course": {
        "id": 3119,
        "subject": "BIEN",
        "code": "2410",
        "name": "Cellular and Systems Physiology for Engineers",
        "description": "Essential cellular and systems physiology for engineers. Hierarchical organization of a complex organism: from organelles to organ systems. Cellular physiology, neurophysiology, vision, muscle and movement, and the cardiovascular system.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2030,
            1930
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"LIFS\" data-code=\"1901\" href=\"/review/LIFS1901\" target=\"_blank\">LIFS 1901</a> OR Level 3 or above in HKDSE 1x Biology",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"LIFS\" data-code=\"3040\" href=\"/review/LIFS3040\" target=\"_blank\">LIFS 3040</a>",
        "rating_content": 3.86,
        "rating_teaching": 4.29,
        "rating_grading": 3.86,
        "rating_workload": 4.43,
        "review_count": 7,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1216,
                "name": "KUANG, Becki Yi",
                "count": 7
            }
        ]
    },
    "reviews": [
        {
            "hash": "Fb5OrL3qCmT79sQrgXwKgAqlNbeFm8N5",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1216,
                    "name": "KUANG, Becki Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ayir",
            "date": "Jun 20, 2020",
            "title": "Extremely detailed course",
            "comment_content": "This course covers cells and system physiology - i.e, the components of a cell, and the systems in the body like the respiratory system. However, you should note that despite this saying it is 'for engineers', I am quite sure even a student from LIFS would struggle with the amount of information that is in this course. If you do not have a strong biological background, consider taking a few more courses than just LIFS 1901 before you take this. I only took LIFS 1901 and still was so confused. If it were not for the open-note quizzes, I do not think I would have done as well as I did. She will provide the book for you to use, and I'd like to point out it is literally a medical textbook - so you can imagine that this course is going to be HARD if medical students are using the same book as you!",
            "comment_teaching": "This is the first time the course has ever run, and unfortunately, it was on Zoom. I think she did try her best to make it as informative as possible, given the strange situation, however, the teaching fell slightly short of what a course as detailed as this needs. I think this was further exacerbated by the fact there were no assignments until the very end, so it is very hard to consolidate your learning. There are nearly 600 slides packed to the brim with information, and hardly anything to help supplement your understanding. I don't know if this is just due to the strange teaching situation of this semester, or maybe she did not realize how detailed this course was going to become during her planning. We were roughly always a week behind schedule (each quiz was meant to cover 7 lectures, and for the first quiz, we only covered 5). She herself is a really nice professor, I just think this course needs additional planning for when it runs again.",
            "comment_grading": "The professor stated very clearly in the first lesson of the course that she would 'grade generously' and she truly kept her word. I personally do not think my grades throughout the course reflected the grade I got in the end, but I am not complaining! <br /><br />I am not sure what she will do for future semesters if HKUST comes back to campus. For this online semester, she chose to do the following for grading: <br />- 3 quizzes, the top 2 results are chosen, 50% <br />- 1 written assignment, 15% <br />- in-class polling, 20% (based on reading material assigned at the end of lectures from the book she uses for this course) <br />- participation (logging in on zoom), 15% <br />- bonus (book a 1-to-1 session with her) for a maximum of 2 bonus points",
            "comment_workload": "The workload is basically non-existent. This is both a good and a bad thing. Since the assignment is only given at the end, and you have nearly a month to do it, it is not a very stressful course in terms of meeting deadlines. <br /><br />However, it may seem like a blessing but it is actually kind of a curse in disguise. Because there is no work done to consolidate your learning, you start to frantically rush to revise for the quizzes. Most likely, people will do this course alongside other difficult, deadline-heavy courses like CENG2210 (if you're in BIEN, that is). You will start to regret not revising earlier, but to be honest, you'll barely have the time! I think a few mandatory assignments before each quiz might help students to consolidate their learning a bit more than just hoping they'll manage their time to revise for the quizzes! But that's just my opinion.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JXX0ElNK0LfpG6R51VTMXeSl51GwauGO",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1216,
                    "name": "KUANG, Becki Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ameen",
            "date": "Jul 13, 2022",
            "title": "straightforward content, tricky quizzes",
            "comment_content": "The lecture content in my opinion is of appropriate difficulty. I personally enjoyed them since they were an extension of the knowledge I had gained in high school. Additionally, Becki always ended the lectures with some interesting research sharing the enabled me to better grasp the practical applications of the concepts taught in class. Overall, I would say that the content is at par with or a notch higher than that taught in IB Biology HL.",
            "comment_teaching": "Professor Becki is quite passionate about Biology and I would certainly say that her teaching style is unique. Her explanations are generally lucid, although her presentations are many a time filled with errors that sometimes go unchecked. This can be confusing while revising the slides for exams. That being said, she usually ensures that she fixes her mistakes. Lastly, the tutorials given by the TA are very helpful in focusing on the key aspects being covered in the quiz.",
            "comment_grading": "40 min quiz (3; choose top 2 out of 3) 55%<br />Written assignment (3 pages; open end topic) 15%<br />In class polling 15%<br />Participation (Zoom log) 15%<br />Bonus (1 point for 15 min appointment in office hour; maximum 1 point)<br /><br />Although the content isn't very difficult, the quiz questions are extremely tricky. This is made worse by the unclear question statements, which are sometimes ambiguous and grammatically incorrect. This means that even the simplest questions on the quiz can be misleading, negatively impacting your score. Despite being open-book, the quizzes are hard to complete without thorough revision of all the lecture slides in advance. Memorizing the key details from the slides definitely helps you work through the questions within the given time limit. However, the fact that only 2 out of the 3 quizzes are counted toward the final grade is a bit of a relief. This not only allows you to make up for a poor score on one of the quizzes, but also helps you get the hang of the kind of questions asked in the quiz. <br /><br />As far as the written assignment is concerned, the grading seems to be slightly strict since even the most minor details are taken into account while marking your essay responses. Points may be deducted if you miss out on incorporating key technical terms in your answers. <br /><br />Quiz 1 - 22/31 (mean: 20.65, high: 28, low: 8)<br />Quiz 2 - 23/31 (mean: 20.77, high: 27, low: 13)<br />Quiz 3 - 18/31 (mean: 18.11, high: 25, low: 9)<br />Written assignment - 13.5/15 (mean: unknown)<br />In class polling - unknown<br />Participation - 15/15<br /><br />Grade: A-<br /><br />Although I was satisfied that the letter grade was at least in the A range, I could have been a bit more careful in the quizzes. The only way to get a good grade in this course is to perform well on the quizzes, since these constitute a major chunk of the grading. Lastly, be sure to attend every lecture in order to secure your participation points.",
            "comment_workload": "The workload is fairly manageable since the course is not too heavy in terms of difficulty. As long as you revise all the lecture slides in time for the quiz, you should be fine. Also, don't postpone doing your written assignment since you're given plenty of time to finish it.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "20tCOmJgWAnukXgv2f3t2hQ0zFYmtyLU",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1216,
                    "name": "KUANG, Becki Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LIFEGOOD",
            "date": "Jun 07, 2022",
            "title": "Easy contents, but difficult exams",
            "comment_content": "Same lecture contents as previous years. <br /><br />Lecture contents are interesting for sure, and some of them are somethings that I have already learned in high school. Contents are easy to understand with a bit of help from YouTube.",
            "comment_teaching": "Professor Becki is an enthusiastic teacher, and I would say she teaches very well. Because the lecture contents are quite easy, there was nothing that was particularly difficult to understand. There were 3 tutorials covered by TA, which provided us some past exam questions. TA explained those questions very well, and definitely helped me prepare for my Quizzes.",
            "comment_grading": "40 min quiz (3; choose top 2 out of 3) 60%<br />Written assignment (2 pages) 15%<br />In class exercise 10%<br />Participation (in class quiz on Canvas) 15%<br />Bonus** (1 point for 15 min appointment in office hour; maximum 1 point)<br /><br />Although lecture contents are easy, exams are extremely difficult. They were VERY tricky, and it is impossible to get 100% on any of the quizzes. I guess they are meant to be difficult because it was an online semester. Each Quiz is composed of 20 MCQ and 1 essay question (with 3&nbsp;&nbsp;sub questions). Essay is much easier than MCQs and it is not hard to get good points. MCQs, however, are absolute disaster. They are not something you can use Ctrl F to find on pdf files. They merge many concepts from many chapters and merge into one questions. Very low mean score (around 40%) reflects how tricky the quizzes were. <br /><br />I did poorly on Quiz 1 (below Mean), but performed well in the Quiz 2 and 3 (~1 SD above mean). Because i did poorly in Quiz 1, when I prepared for Quiz 2 and 3, I read through the pdf files 5 times. Thankfully, only 2 best quiz out of 3 are taken into account. A lot of memorization is required in this course,&nbsp;&nbsp;and trust me, you won't have time to refer back to the lecture contents. Your are given 40 minutes to complete 21 extremely tricky questions. <br /><br />In class exercise and reports are time consuming, and it is easier to get good points. <br /><br />WARM REMINDER: When you submit written assignment, do not forget to submit honor code as well. I forgot to send it the first place, and received a zero mark (very surprising). Thankfully, I later submitted honor code (which was late), but Professor allowed late submission with a 3 points penalty. Without it, I would have gotten one subgrade lower. <br /><br />Class mean<br />Quiz 1: 19/30.5<br />Quiz 2 : 17.1/30.5<br />Quiz 3 : 18/30.5<br />In class exercise report : 3.6/4<br />Written assignment : 12.2/15<br /><br />My score<br />Quiz 1 : 14.25/30.5<br />Quiz 2 : 23.5/30.5<br />Quiz 3 : 21.5/30.5<br />In class exercise report : 3.7/4<br />Written assignment : 11.9/15<br /><br />Letter Grade : B+<br /><br />Little bit disappointed with B+ as I was expecting A- .I guess I was 1 or 2 points below A-. Very close. I would say hard work pays off for this course despite the exams being very tricky.",
            "comment_workload": "Very tiny workload. 3 quizzes, but they are not cumulative.<br />What was covered in Quiz 1 will not be the syllabus for Quiz 2&amp;3, and so on. This saved my time enormously. There are 2 reports to be handed in, which are lengthy. However, they are the only&nbsp;&nbsp;2 HWs you get in this course, so I would say it is very light workload. However, you do need to spend good amount of time to revise FULLY for the quizzes. They are VERY tricky.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CSvPJ2IUxPO6iJW67SQa3mIu774DNqMs",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1216,
                    "name": "KUANG, Becki Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lady Ann",
            "date": "Aug 21, 2021",
            "title": "60% high school content 40% new learning but its a requirement",
            "comment_content": "I took this course to gain a deeper understanding of BIEN but soo much of the content was part of my high school syllabus. I understand that this may have been done to help us gain a better foundation before going into the hard content but right when things got interesting, the prof pulled out which was rather frustrating.<br />One great initiative by the professor was that she talked about a new BIEN innovation at the end of every lecture.<br /><br />The content was as follows:<br /><br />Introduction of the course<br /><br />The general features of a cell<br />The components of a cell<br />The flow of genetic information<br />The transportation of substances<br />The environment of cells<br />The communication between cells<br />Electrical potentials of cells I<br />Electrical potentials of cells II &amp;<br />Muscle contraction I<br />Muscle contraction II<br />Excitation-contraction<br />Pump of life<br />Rhythmical excitation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />Circulatory system<br />Microcirculation and lymphatic<br />Blood cells<br />Other substances in the blood<br />Respiratory System I<br />Respiratory System II<br />Gastrointestinal system I&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />Gastrointestinal system II&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />Urinary system<br />Our skin",
            "comment_teaching": "Becki is a very nice professor. But the fact that a lot of the content was very introductory combined with her reading of the slides a lot made the lectures quite boring. Lost interest soon. However, if you like to self-study, they are willing to help with your questions a lot.",
            "comment_grading": "The grading for this course is quite broken. All the quizzes focus too much on the pedantics and sometimes even the TA couldn't give a proper explanation as to why our answers were wrong.<br /><br />The grading was as follows:<br /><br />40 min quiz (3; choose top 2 out of 3) 55%<br />Written assignment (3 pages; open-end topic) 15%<br />In-class polling 15%<br />Participation (zoom log) 15%<br /><br />The top 2/3 quiz performance is a nice initiative but it would have required all the quizzes to be well standardized. The third quiz was just disproportionately harder and everyone had to rely on the first two. <br /><br />My grades:<br /><br />quizzes: averaged around 22 means: 20.x/20.x/18.x<br />final grade: A-",
            "comment_workload": "The workload is fine. It's just very triggering when you study a lot and the quizzes focus on some very specific content.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uNaxdbkPkhTuEP7spFSdLE8Ant6DBb2y",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1216,
                    "name": "KUANG, Becki Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "grizelyt",
            "date": "Jun 04, 2021",
            "title": "fair grading",
            "comment_content": "Refer to other reviews.<br />Overall is quite boring when you're a LIFS major student, things are overlapping with your major course.<br />Most of the content are like LIFS1901/1902, if you have a good fundamental knowledge of these topics, you're strongly suggested to take this course to &quot;pull&quot; your grades.",
            "comment_teaching": "English is a bit better than most of the mainland professors, but her way of teaching is mostly reading aloud.<br />I like her way of mentioning the recent development of bioengineering, even though it's extensive learning.",
            "comment_grading": "This course treats attendance very seriously, I lost most of the marks in in-class polling and attendance coz i skipped most of them. Quizzes are not really testing your understanding but your english level.<br /><br />- 3 quizzes, the top 2 results are chosen, 50%<br />- 1 written assignment, 15%<br />- in-class polling, 20%<br />- participation (logging in on zoom), 15%<br />- bonus (book a 1-to-1 session with her) for a maximum of 2 bonus points<br /><br />I got one quiz above mean 1 or 2 marks and one at mean, I dont know my assignment scores but overall grading is fair. Final grade: C+",
            "comment_workload": "Not much to do, only one assignment and 3 quizzes.<br />What most annoying is the in-class polling, you have to &quot;wake up&quot; and get the correct answer.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LENpwkHFaInwl5MrJsIIbB3vWoSJUIWp",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1216,
                    "name": "KUANG, Becki Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "USTBCB",
            "date": "Aug 04, 2020",
            "title": "Introduction of Engineer Biology",
            "comment_content": "A new introductory course of human physiology courses from a cellular level to a systemic level. This course will cover most of the LIFS 1902 topic and some advanced level LIFS course topic but compared to them, this course will not go very deep as it is an introductory course for BIEN students or minor BIEN. <br /><br />Cellular level:<br />L1: The general features of a cell<br />L2: The components of a cell<br />L3: The flow of genetic information<br />L4: Transportation of substances<br />L5: The environment of cells<br />L6: The communication between cells<br />L7: Electrical potentials of cells<br />L8: Muscle contraction<br />L9: Excitation and contraction<br /><br />Systemic level<br />L10: Pump of life<br />L11: Rhythmical excitation of heart<br />L12: Circulatory system<br />L13: Microcirculation and lymphatic<br />L14: Regulation of blood flow<br />L15: Blood cells<br />L16: Blood types and blood coagulation<br />L17: Respiratory system I<br />L18: Respiratory system II<br />L19: Gastrointestinal system I<br />L20: Gastrointestinal system II<br />L21: Urinary system<br />L22: Our skin",
            "comment_teaching": "Becky is an enthusiastic teacher. She creates a relax atmosphere for us to learn. She also encourage students to ask her questions, and she replies email very quick!",
            "comment_grading": "This course does not have any mid term and final exam.<br />The grading system is as follow<br /><br />Quiz: 50% (Best 2 out of 3)<br />Attendance: 20% <br />In-class polling: 15% <br />Assignment: 15%<br /><br />Basically, 35% is yours base-mark as the in-class polling is very easy you can directly search from the internet and attendance is not required to turn on the camera. <br /><br />Since it is a new course in this semester, the grade will be pretty good. My final grade is B- 67/100",
            "comment_workload": "The workload is pretty light, you only have one assignment with only 3 questions but all of them are essay-type questions, she gave us nearly two weeks to do the homework. And also you only have to do some revision of the quiz and the in-class polling, no need to read more references book as Becky gave very clear explanation on different topics. So, nearly the workload is only the assignment and the quiz.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5v8d8mUxA0VWoA4CgS8SYTgbgF2mdMFy",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1216,
                    "name": "KUANG, Becki Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "schendv",
            "date": "Jun 21, 2021",
            "title": "Generally a nice course",
            "comment_content": "The content is really good for students who major in bio related majors, but for me(just know little of biology),it requires effort to catch the speed of Becki. This course will introduce you some basic but not totally basic knowledge of human body. It's getting harder because you need to apply former content to the current content. BTW, better have the vocabulary course first(I didn't),or it's very uncomfortable to have the course.",
            "comment_teaching": "The teaching is satisfactory. Becki always tries to help you understand the content through giving examples and providing extra materials. You can ask her problems in the chatbox and she will answer you quickly. What's more, the tutorial is for quiz and official hours. You can book 15 min and chat with her directly. You can ask her nearly everything.",
            "comment_grading": "I got A- as I expected.<br />40 min quiz (3 times; choose top 2 out of 3) 55%<br />written assignment (3 page; open end topic) 15%<br />In class polling 15%<br />participation (zoom log) 15%<br />Bonus ( 1 point for 15 min appointment in&nbsp;&nbsp;office hour)<br />quiz1 for lecture 0-6<br />quiz2 for lecture 7-13<br />quiz3 for lecture 14-22<br /><br />You can easily get 15% by participating all the course. But you need to focus on the course as you still need to finish the in class polling to get the 15%.It's not easy even though you listen to the lecture carefully, try to make less mistakes.",
            "comment_workload": "The work load is really a lot as you need to remember the content of the lecture as much as you can. If you are not interested in biology, I don't suggest that you take the course just for a good grade or something else.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}