{
    "error": false,
    "course": {
        "id": 27,
        "subject": "CENG",
        "code": "1700",
        "name": "Introduction to Environmental Engineering",
        "description": "Fundamentals of environmental impact assessment will be discussed. Life cycle analysis of carbon and energy will be introduced using case studies. Principles of environmental engineering for control of air, water, solid and noise pollution will be discussed, including global pollution, pollution prevention and minimization. Cost of available technologies will be analyzed.",
        "categories": [
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1930,
            1830,
            1730,
            1610,
            1510,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"CIVL\" data-code=\"2410\" href=\"/review/CIVL2410\" target=\"_blank\">CIVL 2410</a>",
        "rating_content": 4,
        "rating_teaching": 3.82,
        "rating_grading": 4.09,
        "rating_workload": 3.45,
        "review_count": 22,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 25,
                "name": "LAM, Leung Yuk Frank",
                "count": 17
            },
            {
                "id": 224,
                "name": "YEUNG, King Lun",
                "count": 5
            }
        ]
    },
    "reviews": [
        {
            "hash": "P5QKfNxE5v4Ya4ZtY8nzyLHRYgPaVylK",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 224,
                    "name": "YEUNG, King Lun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ShayA",
            "date": "Jun 06, 2019",
            "title": "Avoid this course if possible",
            "comment_content": "1) Units and measurements<br />2) Fate and transport <br />3)Engineering Decisions <br />4) Water purification <br />5) Air pollution and treatment <br />6) Human Factor<br />7) Sun and water <br /><br />To be honest, I don't know where the course was going with these topics. The delivery and teaching was so bad that all these concepts seem half-assed. But if I was to be objective, I'd say the content is decent for the average engineering major. It covers a good range of scientific concepts and engineering concepts including some techniques in decision making. However, for people with no chemistry background, the course seems like a nightmare because (at least in some chapters) you need high school level chemistry to attempt the questions. The course seemed to overload on too many of these concepts. For instance, the lecture on fate and transport included too many physical and chemical properties with no time given to individual ones. At other times, the content was too easy to even bother listening. AVOID THIS COURSE IF YOU ARE NOT A PERSON WITH A CHEMISTRY BACKGROUND. The last few chapters were absolute garbage and I learned absolutely nothing from them. If you are a senior in CENG, then this course is an easy A content wise.",
            "comment_teaching": "Probably the worse teacher I have had yet in UST. Not only is his delivery of the course monotonous and boring, he barely makes an effort to get some continuation into the concepts. It honestly feels like he jumps from one chapter to the next without you even realizing. He spends too much time playing videos and reads out the ppt for the rest of the time. The bits of information he adds are absolutely useless. The worked examples he does in class barely help you do the questions yourself. He BARELY HAS A GRASP ON ASSESSMENT. The students are clueless on what exactly is expected from the assessment and what techniques are required. The resources he adds are barely useful but are flooded with useless articles.<br /><br />The TAs are decent and will go through different practice problems step by step. Although they seem clueless for most of the time as well, they are way better than the professor.",
            "comment_grading": "DO NOT BELIEVE THE GRADING IN THE SYLLABUS.<br /><br />This course has a history of not following through on the agreed upon grading methods.<br /><br />The breakdown should be:<br />Class participation (15%)<br />Examinations (50%)<br />Case Study (15%)<br />Assignments (20%)<br /><br />There were three exams and the best two were chosen. However, the difficulty level was extremely varied and the 2nd exam was way easier than the rest. The mean is very high but since we don't the grade boundaries, I cant tell if that matters.<br /><br />There were supposed to be three assignments but there were only 2. The format is odd and we barely have any idea on how to attempt. The mean is still oddly high. I do not know what happened to the case study or the class participation (we were to write answers on pieces of paper in class).<br /><br />Mean overall is high so if this course is curved, the grading is screwed up because you are competing against 3rd and 4th year engineering majors. <br /><br />My breakdown:<br />Exams:<br />&nbsp;&nbsp;&nbsp;1) 70/100 (mean 71.9)<br />&nbsp;&nbsp;&nbsp;2) 100/100 (mean 77.9)<br />&nbsp;&nbsp;&nbsp;3)&nbsp;&nbsp;90/100 (mean 83.7)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;last two chosen<br />Assignments:<br />&nbsp;&nbsp;&nbsp;1) 81.5/100 (mean 83.7)<br />&nbsp;&nbsp;&nbsp;2) 100/100 (mean 81.3)<br />Class participation (No idea but probably high because I attended most classes)<br />Case study (No idea what happened to that)<br /><br />Ended up with an A but I don't know how so yeah",
            "comment_workload": "Basic workload. Exams are open book so you barely need to study and because there aren't many practice questions, you basically only go through the slides. The assignments are a day or two of work at best. <br /><br />The annoying part is coming to classes for the class participation marks",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "A1J4r9laeTfkxXQVL4Ufqf6MPQfnln7l",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 224,
                    "name": "YEUNG, King Lun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Pranjal Mathur",
            "date": "Jun 01, 2018",
            "title": "",
            "comment_content": "This course is a basic introduction to environmental engineering and covers the following: <br /><br />Being an Environmental Engineer<br />- Identifying and Solving Environmental Problems<br />- Engineering Decisions<br />-Engineering Calculations<br />-Basic Material Balances<br /><br />Environmental Applications<br />-Water Quality<br />-Water and Wastewater Treatments<br />-Air Quality<br />-Air Pollution Control<br />-Human Factors<br />-Ethics of Green Engineering<br /><br />Most of the content is covered through Lectures and tutorials.<br />There are also additional reading materials for each chapter.",
            "comment_teaching": "This professor has a very slight interest in the engagement of the class and hence does not put in a full effort into his teaching. The lectures are neither engaging nor informative.<br /><br />The reading material is very general and does not work parallel to the teaching. The only real benefit of attending the classes is the class participation points. The content of the course must be covered through self study.",
            "comment_grading": "The course grade is SUPPOSED to be divided as such: <br /><br />Class Participation-5%<br />Assignments-20%(4 case studies across the semester)<br />Case Study-15%<br />Midterm Examination-30%<br />Final Examination-30%<br /><br />There were only 2 assignments which had been rushed across the end of the semester. There was no case study ever declared or even discussed. <br /><br />Class Participation: Attendance of classes and tutorials regularly should be enough. <br /><br />Midterm examination: Calculation based examination which tested the first half of the syllabus. The mean for the exam was 80/100. <br /><br />Final exam: Calculation based examination which tested the second half of the syllabus. No marks were declared. <br /><br />Assignment 1: A midterm styled assignment where literature values required for calculations had to be mined for individually. There was also a 500 word essay regarding a <br /><br />Assignment 2: Reaction paper to a set of YouTube videos regarding over-fishing of many seas across the world. Submitted on the day of the final exam.",
            "comment_workload": "Fairly light. Studying for the midterm and final should be sufficed if there is enough preparation with respect to the calculations as they are the most scoring part.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "b9VhVq0DRBE86NvYF1snXvZP1sXrxKgl",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ARK",
            "date": "Feb 03, 2017",
            "title": "Short Review Summary",
            "comment_content": "Content is useful to increase your general knowledge because it is a common core course. The course covers air, water, land pollution, materials balance and environmental chemistry. No previous knowledge is needed, but pay attention to the lecture notes.",
            "comment_teaching": "Frank is very nice, but lecture is very boring. You don't need to go into any lecture you can just study by reading all the lecture notes in canvas.",
            "comment_grading": "Good grading, mean+1SD on the midterms, never did the homework seriously, but Frank did not release the grades of the finals and group project. Final grade is A-<br />10% 4 sets of homework, 20% midterms, 30% project, 40% finals",
            "comment_workload": "Group project needs a lot of work, workload of studying for midterms and finals is okay, and the homework can be easy if you know where to look. But overall the workload is more than I would have wanted.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "n5H6bx0XNVMO51uA3nBRTPWYuZy4TK9w",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ls",
            "date": "Feb 03, 2017",
            "title": "Short Review Summary",
            "comment_content": "1. Environmental chemistry<br />2. Material balance<br />3. Air pollution<br />4. (Waste)Water treatment<br />5. Solid waste treatment",
            "comment_teaching": "the professor is fun, quite funny, but his notes are boring as well as his teaching, you are allowed to use 1 A4 paper for cheatsheet",
            "comment_grading": "Homework assignment 10%<br />Mid-term exam 20%<br />Group project and oral presentation 30%<br />Final exam 40%<br /><br />Homeworks are quite easy if you listened, because all the answers are basically in the notes, and sometimes he could give the solutions if the whole class don't understand the question. <br /><br />I got an A-, mid term exam Mean + almost 1 SD, he didn't announce the score for group project and final.",
            "comment_workload": "Workload is quite a lot, there are an estimate of 18-19 lecture notes. <br /><br />20 pages for report and 20 minutes of presentation.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HULYe8NMoZ0pYSoAYliraLaReekpRSu8",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Asta",
            "date": "Aug 20, 2023",
            "title": "very good grade course",
            "comment_content": "if you have study chemistry in high school then this course should be ok for you at the beginning. but as soon as it reaches to mid term, things will start to get hard and it is better to review the lesson notes after his classes.",
            "comment_teaching": "Frank is a really good and kind professor. He is willing to answer your questions after class. But sometimes his classes can quite boring.",
            "comment_grading": "the grading was so good. Best course grade. I didn't study well for the finals and didn't know how to do some of the questions, but still end up getting an A-. Most of the people get B+ or A- so if you work hard enough it will be quite easy to get an A range.",
            "comment_workload": "There is one group project, mid term, final and homework. Homework is quite easy and group project is not really demanding",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rJD5BuAqotFGxKmHgGpALvPm9ogikVDq",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YUpEp",
            "date": "Jan 15, 2023",
            "title": "Prep you cheatsheet well and you will get good grades",
            "comment_content": "Severe types of pollutions are covered in this course like water pollution, air pollution, solid pollution, water treatment etc<br />A bit challenging for a year-1 student(myself) to study when studying the material balance(not taught in dse)<br />Some part of the tutorial notes is difficult to learn, but that's out-syl so no worry.<br />I got 4 assignments and 1 group pj in this course.<br />The group project is that, you have to choose a pollution topic, design a treatment mechanism for it.",
            "comment_teaching": "Frank teaches nicely but sometimes you will still get sleepy in class (there is only one time session which is 9-1030am, maybe becuz of that haha)<br />I attended the tutorial twice but I think it was not that useful. But Frank will teach how to do the assignments in the tutorial.",
            "comment_grading": "You may prep 5 pages cheastsheet for the Midterm(cant remember clearly) and 6 pages for the final.<br />Just try to add all the formulas and some hard concepts inside as high prob to ask.<br />I prep a little for my MT and got 28/40, and the marks of final and group project arent announced. But I think the final is at acceptable difficulty if you prep cheatsheet well.<br /><br />Homework assignment 10%<br />Mid-term exam 20%<br />Group project and oral presentation 30% (15% report + 15% <br />presentation)<br />Final exam 40%",
            "comment_workload": "Assignments always take a lot of time to do as you have to go through your lec notes, understand, and try to apply on your notes. Recommend you to check and with your classmates, but you may also buy source (the assignments exactly the same in the past source.<br /><br />You have to spend a lot of time to deal with your group project. The group project is that you have to choose a pollution topic, and design a treatment mechanism for it. Prepare the presentation slides and report also take your time.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IvINlk5uZjISRvUdgdKzunnl18m9LR51",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "香港早晨",
            "date": "Dec 27, 2022",
            "title": "Nice course",
            "comment_content": "Homework assignment 10%<br />Mid-term exam (2 pieces of a4 cheatsheet) 20%<br />Group project and oral presentation 30% (15% report + 15%<br />presentation)<br />Final exam(3 pieces of a4 cheatsheet)&nbsp;&nbsp;40% <br /><br />Spend some effort preparing cheatsheet. <br /><br /><br />ppl without chemistry background may find it hard to handle this course cuz the stuff involved many chemistry knowledge",
            "comment_teaching": "Frank is a nice guy. He is willing to answer all your questions.",
            "comment_grading": "midterm mean :21/40<br />me: 23/40<br /><br />final and project marks not released.<br />final grade : B",
            "comment_workload": "Quite big. <br />The project report requires each people to write at least 5 pages and lot of time is required to do the research. Better start it quickly if you are a deadline fighter. <br /><br />4 Assignment in total. Handleable.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "T183BybdsFapphDARX4aBbHIGQgWwAmQ",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Trainer",
            "date": "Dec 23, 2022",
            "title": "Hidden Leng grade CC course",
            "comment_content": "Cumulated&nbsp;&nbsp;<br />First half Sem:<br />1. Introduction <br />2. Units and Dimension <br />3. Air pollution 1 <br />4. Air pollution 2 <br />5. Air pollution 3 <br />6. Environmental Chemistry I<br />7. Environmental Chemistry II<br />----------------------------------------<br />Second Half Sem<br />8. Water <br />9. Drinking water <br />10. Wastewater<br />11. Solid waste I<br />12. Solid waste II<br /><br />考试主要考calculation and definition and graph",
            "comment_teaching": "I would say Frank is the best teacher I have ever seen in HKUST and he is cute. You definitely will feel energetic after the lesson although it is a 9am course.<br /><br />He is care about non-engine student too and willing to tune to speed and teach the basic chem knowledge for non-engine student.",
            "comment_grading": "It is hard to say he is lenient or what. I can tell is that even business student can get a good grade (A range)<br /><br />10% hw (4 hw)<br />20% mid term <br />15% Group presentation <br />15% Group project <br />40% Final Exam <br />-------------------------------------------<br />For me:<br />Homework (Easy piece):<br />Homework 1 100/100 mean: 90.15/100<br />Homework 2 70/70 mean: 59.67<br />Homework 3 100/100<br />Homework 4 60/60<br />= 10/10<br />Mid-term (medium if you get a good cheat sheet)<br />mean: 21/40 Me: 24/40<br />Group Project and Final: unknown<br />Final grade: A-",
            "comment_workload": "It is fair if you have a good teammate. <br /><br />HW is ok for doing within a day <br />-<br />Mid-term: Frank will choose another day like the first of Nov to reduce the workload of student during midterm period<br />-<br />Group Project: You shall do it before at least A MONTH or reli G9G <br />-<br />Final : focus on water is ok",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hDa61Hn0LEKxDq8UJ6vCUgeP8xaULfzE",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "＾・ﻌ・＾",
            "date": "Jun 30, 2022",
            "title": "",
            "comment_content": "The content of this course, in my opinion, is quite difficult for an introductory course. Topics (like mass balance) need to be understood and practiced thoroughly to approach the exam questions.<br /><br />The content includes:<br />1) Introduction<br />2) Units and mass balance<br />3) Environmental chemistry<br />4) Air pollution control<br />5) Water/ Wastewater treatment<br />6) Solid waste treatment<br />7) Waste-to-energy technology<br /><br />A solid background in high school chemistry is definitely required.",
            "comment_teaching": "Frank is quite nice and you can tell he is passionate about the subject. He is very approachable and is willing to answer doubts. He is also considerate of any issues students have such as time conflicts and problems with the online system. <br /><br />However, the teaching itself tends to be a bit boring. I found the PPT to be rather disorganized. There are usually 60+ pages and it is difficult to separate the useful information from pages of statistics. And due to the scattered nature of the lecture notes, there is very little flow in the teaching. It can seem like you are jumping from one topic to another.<br /><br />Attendance is not mandatory and there are not many people who attend the lecture. Many students prefer to self-study.<br /><br />There are two TAs who taught one tutorial each just to satisfy their teaching requirement. The rest of the tutorials are all taken by Frank.",
            "comment_grading": "Grading scheme:<br />-----------------------------------------------------<br />Homework - 10%<br />Mid-term examination - 20%<br />Group project and presentation - 30%<br />Final examination - 40%<br />-----------------------------------------------------<br />HOMEWORK<br /><br />The homework assignments had a mix of easy and difficult questions. Similar questions can be found in the notes and textbook. There were a total of 4 assignments but the last one was scrapped due to time constraints.<br /><br />EXAMS<br /><br />The exams, similar to the homework, also consist of a mixture of simple and tricky questions. <br />You are allowed one A4 sized cheatsheet (2 sides) for the midterm and 2 sheets (4 sides) for the final.<br />The marks of the final exam were not released. <br /><br />GROUP PROJECT<br />The group project is quite important and can help you bounce back if you performed below average in the midterm. If you do the research thoroughly and have a well presented project, I believe it is relatively easy to get a good grade. <br />---------------------------------------------------<br />Overall, despite having only a very loose understanding of a lot of the topics, I still got a pretty decent grade.",
            "comment_workload": "I found the workload to be high for an introductory/common core course. <br /><br />The group project involves selecting a type of waste from a list given by Frank and then coming up with a way to treat this waste. You need to prepare both a presentation and a report. The presentation should be about 30 mins long (5 mins per person + 10 mins Q&amp;A). The main areas covered in the report should be 1. abstract and introduction, 2. treatment methodology, 3. advanced treatment process, 4. cost evaluation and comparison and 5. key highlights. Naturally, the project, if done properly, requires time and effort. However, I think it is easily manageable with proper planning. <br /><br />What I found more time consuming were the assignments and studying to actually understand the content. A lot of it was complex and took a lot of practice to grasp. Being a required course for Chemical &amp; Environmental Engineering&nbsp;&nbsp;majors, a large portion of the class is comprised of year 4s. Many of the concepts covered, they have already learned so it is tougher as a year 1 to catch up to the rest of the class.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UT7TpY1emDVOXzwLo9gUO8j8jOU5fOVn",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Duppy Conqueror",
            "date": "May 04, 2022",
            "title": "A fairly good CC course",
            "comment_content": "Content is good, but quite heavy for a CC course<br />1. Units and Mass Balance<br />2. Environmental Chemistry<br />3. Air Pollution and Control<br />4. Water Pollution and Wastewater Treatment<br />5. Solid Waste and its Treatment<br />6. Life-Cycle Assessment (Out of syllabus this semester)<br />(No wonder why this course has no waitlist)<br /><br />You are recommended to have chemistry background for taking this course. (Even the professor said that)<br />As it covers mass balance, expect some calculations.",
            "comment_teaching": "Frank is a nice person. He is willing to answer questions from the students. However, the lecture is a bit boring due to the heavy content.<br />Frank expects some students to appear only in the first lecture, midterm exam, review lecture, presentation and final exam.<br />Skipping lectures isn't a problem but make sure to read those 60+ pages of lecture notes after that",
            "comment_grading": "ACCORDING TO THE COURSE ASSESSMENT:<br />Homework Assignment 10%<br />Midterm Exam 20%<br />Group Project and Oral Presentation 30%<br />Final Exam 40%<br /><br />Both exams are closed-book.<br />1 cheat sheet is allowed in the midterm exam.<br />2 cheat sheets are allowed in the final exam.<br />Contents can be written on both sides of the cheat sheets.<br />Make sure to write every point and equation into your sheets!<br /><br />Group project and final exam results are not released.<br />Transparency is questionable.<br />Hard to tell if it is good-grading<br /><br />Final grade: A+",
            "comment_workload": "Assignment: Light<br />4 assignments as designed<br />3 assignments only this semester<br />Most of them are calculations. Plug the correct formula and equations and you are good.<br /><br />Group project: Medium to heavy<br /><br />- Form a group of 4 (Good luck on that)<br />- 30 mins (5 min./student + 10 min. Q&amp;A)<br />- Choose a waste from the list Frank has given (Make sure to choose an easy waste)<br />- Identify the information, possible source, spreading pathways of the waste<br />- Design a treatment process for the waste<br />- Describe the discharging process, technology and devices involved<br /><br />A lot of research is required",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QkOjy270lT7YB0uVBmgjTe4var87uGAI",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Woody..",
            "date": "Mar 26, 2022",
            "title": "",
            "comment_content": "Units and mass balance<br />Environmental Chemistry<br />Air pollution control<br />Wastewater treatment<br />Solid waste treatment<br />Waste-to-energy technology<br /><br /><br />Except mass balance,&nbsp;&nbsp;the contents is not that difficult if you are pay attention to Frank on lecuture. <br />Frank will also give some samples to explain mass balance.",
            "comment_teaching": "Frank is quite nice and always makes some jokes to wake the class up(because the lecture time is 1030-1150)<br /><br />he put much effort on explaining the teaching with some handwritting notes. Although it is hard to recognize^^<br /><br />better to have in-person lecture if lecture conducted in mix-mode. Frank may not focus on zoom chatbox if he is in the lecture theater",
            "comment_grading": "Homework assignment (10%) (7.06/7.5)<br />Mid-term exam (20%)<br />Group project and oral presentation (30%)<br />Final exam (40%)<br /><br />have no idea the mean and sd of the midterm and final, Frank did not release in canvas.&nbsp;&nbsp;i guess the grading is so far fair(?<br /><br />use time to prepare the cheatsheet in advance!! <br />use time to prepare the cheatsheet in advance!!<br />use time to prepare the cheatsheet in advance!!",
            "comment_workload": "Medium.<br />For assignments, things need to do: choose the correct formula and plug in numbers<br />Midterm and Final : open-book exams, cheatsheet used in midterm could also kept for the final, save time to copy the contents again.<br />Project presentation: i found some good groupmates and prepare quit well for present. But still need some time to do research.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yOveoY7ntfRdVbeB5knMtdVWbT3KXWGd",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "C4",
            "date": "Mar 08, 2022",
            "title": "Nice",
            "comment_content": "Pre-req:<br />Very basic highschool chemistry<br />Very basic highschool physics<br /><br />Better learnt industrial chem in DSE so you can skip a whole part teaching how to plot NH4+ verses pH graph<br /><br />Life cycle of E&amp;C is not teached since Frank thought too rush for this sem.(Straight cut, assign - 1 &amp; syllabus chapter - 1)<br /><br />You can know a lot of stuff around you at home by env. civl. Which is fun to learn.<br /><br />But most of it not to be examined.",
            "comment_teaching": "He is a passionate in his teaching.+1<br /><br />Funny, kind, energetic professor. But I usually fall asleep at last 15 min of lecture.<br />Watch zoom record is good, but he always run out of the range of PC mic/cam.<br /><br />He got 2 TAs(maybe his students) each for one of first two tutorial, but they are poor at teaching.<br /><br />Lengthy ppt. You love it when Frank present it in lecture, but hate it when you search stuff in it for assignment.<br /><br />Lengthy ppt.<br />Lengthy ppt.<br /><br />Very important so I should say 3 times.",
            "comment_grading": "You of course can use casio calculator.<br />One A4 cheat sheet (both side) in mid<br />TWO A4 cheat sheet (both side) in final<br /><br />Frank: &quot;dont throw away your paper ya↑, you can use it again in final, just get a new one thats two :)&quot;<br />Some students: &quot;bruh I just throwed it away oh no&quot;<br /><br />Homework assignment 9.1/10<br />Mid-term exam 9.2/20<br />Group project and oral presentation (13?)/30<br />Final exam (?&lt;38)/40<br /><br />Even this I get B+<br /><br />Tricky mid term.<br /><br />Project graded &quot;13/0&quot; on canvas, I don't sure what is it. We were the first group so I even had no clue how I'm doing by looking at prof.'s face.<br />I am poor at oral also.<br /><br />My final at most 38 as I know I messed up a unit.(realised after exam).<br /><br />Final exam did not require us to calculate the lengthiest &quot;some bacteria is in river so calculate the oxygen content&quot; equation(Streeter-Phelps Oxygen Sag Model), which should at least cost a full A4 for steps.<br /><br />You can hand in exam paper and have early go in final.",
            "comment_workload": "Each assignment costs me 3~5 hours,<br />including me spending half time edit it in Word for prettier look.<br />Only 3 assignment (as I mentioned, cutted syllabus)<br /><br />Project is hard, need to do &quot;research&quot; with your 4 people group<br />(I just get group of 4 in lecture where we 4 sit in same corner)<br />Chose a category of waste to &quot;solve&quot;.<br /><br />But why you thought prof. expect you to have good content since your're yr1/2? Just relax a bit.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3mfjcuCfhKdB82WbSkYUamnl1EQ1HD0H",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "海棉體寶寶",
            "date": "Feb 16, 2022",
            "title": "",
            "comment_content": "Not recommended for no chemistry background students.<br /><br />Unit and dimensions<br />Air pollution<br />Environmental chemistry<br />Water (drinking water, waste water)<br />Solid waste",
            "comment_teaching": "He is a passionate in his teaching. Even though there is example for the calculation, he will still demonstrate the step once more. He always gives further examples to explain which are not included in slides.",
            "comment_grading": "Homework assignment (10%)<br />Mid-term exam (20%)<br />Group project and oral presentation (30%)<br />Final exam (40%)<br /><br />In mid-term exam, one cheat sheet is allowed.<br />In final exam, two cheat sheet is allowed.<br /><br />Grading is nice. However, there is no grading for final exam and the group project.",
            "comment_workload": "Huge workload for both assignment and group project. The assignments require lot of time to finish.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DlbydpDXTcsj8Fzop4hljx811cRMX4Hd",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jintong",
            "date": "Jan 15, 2022",
            "title": "Great introduction to some waste/pollution treatment",
            "comment_content": "Environmental chemistry, mass balance, air, water, solid waste treatment",
            "comment_teaching": "Frank likes to joke and give us a good laugh. He is responsible and genuine. The content is quite a bit, you may need to review every week and read his ppt ahead. Sometimes the treatment process could be boring, but he will leave his lecture note on canvas so you could always go back to have a look.",
            "comment_grading": "4 assignments, a mid-term, a team presentation and final. <br />To get a good grade, you may want to discuss assignment with class mates and check each others' work, so you don't make careless mistake. <br />The mid-term wasn't too hard but he will give a trick question and most of us didn't know how to do it. He will allow a piece of A4 cheat sheet.<br />If you only got a average for mid-term, please do well for the team presentation, my group did quite a bit of research so he and the TAs were satisfied, and I guess we got a good grade.<br />The final he will allow 2 pieces of A4 cheat sheet, so don't throw away your previous sheet. It wasn't too hard, but will include more concept question. You can review this from the PPTs.",
            "comment_workload": "Assignments get harder as we progress in the course. So do not expect to finish it right away. They took me quite some time.<br />To do well for presentation, you need to research throughly. Please take some time. <br />The workload is heavier than most of my courses, e.g. 1902 LIFS.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uzQdLi9VP97bJUHbf7U9kcLyOWfDD7k8",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pilgrimage",
            "date": "Dec 29, 2021",
            "title": "",
            "comment_content": "1.Introduction<br />2.Units and mass balance<br />3.Environmental Chemistry<br />4.Air Pollution Control<br />5.Water and Wastewater Treatment<br />6.Solid waste Treatment<br />7.Waste-to-energy Technology<br /><br />Some basic knowledge of chemistry and physics is necessary.",
            "comment_teaching": "The content is rich, and it is interesting when the professor talks about some principles and facts. But there are a lot of calculation involved in the course, it becomes difficult to understand when the professor talk about it. You need to learn by yourself.",
            "comment_grading": "4 homework assignment&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />Mid-term exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Group project and oral presentation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;30%<br />Final exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;40%<br /><br />The exam is closed book but one piece of cheat sheet is allowed.",
            "comment_workload": "I think it is OK. <br />If you understand the PPT, homework is easy to finish.&nbsp;&nbsp;<br />There will be four people working on a project and each person speaks for about five minutes. And professor may ask a few questions.<br />You should prepare your own cheat sheet. The more information, the better. You will need them when you take exams.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PavFbr3AmsghcHBSr49CDKLA9xDqfHME",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mgenie",
            "date": "Jan 19, 2021",
            "title": "nice person but okay professor",
            "comment_content": "His slides are so content-heavy. He always has 60-70 pages and there is so much to memorize.<br /><br />You are allowed to have an A4 cheatsheet during the mid-term and final but you will end up not using it.",
            "comment_teaching": "He is a funny guy and a nice person. He promised to buy a pizza.<br /><br />Besides his personality, he is a professor who is just so passionate about his major, which is environmental engineering. So even when he prepared 60-70 pages of slides, he always gives additional explanations even when it is not included in the curriculum. It is good that you get to know more about environmental engineering, but it becomes so hard to differentiate which one was part of the course and which one was not when it comes to mid-term and final.",
            "comment_grading": "Despite the heavy workload, his grading was good. But he doesn't show what grade we got for finals and the group project.",
            "comment_workload": "The workload was heavy because we have 20 minutes long presentation along with 20 pages of a report, while we have a mid-term, final, and four assignments.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IFSBD5G6lzDBpLeWAP3f7WIkBo1Hb6PH",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ynag",
            "date": "Jan 08, 2021",
            "title": "",
            "comment_content": "• Introduction<br />• Units &amp; Mass Balance<br />• Environmental Chemistry<br />• Air Pollution Control<br />• Wastewater Treatment<br />• Solid Waste Treatment<br />• Waste-to-energy Technology<br /><br />The content of the course is interesting for those who are interested in environmental engineering but have little to no background in it. It covers the general material from various different topics which I found to be a good introduction to the field.",
            "comment_teaching": "The prof is very good at explaining the topics and you can see that he is passionate in the subject. He also likes to include several experiences and would lighten the mood with some jokes if he sees that students are getting bored. However, due to time limit, the later parts of the lectures (towards the end of the term) were covered a bit too quickly/ skipped over. Overall though, his teaching is good and would recommend him.",
            "comment_grading": "Homework Assignment 10%<br />Mid Term Exam 20%<br />Group Project &amp; Oral Presentation 30%<br />Final Exam 40%<br /><br />The grades for the final exam and group project were not released but aside from that, the grading was generally transparent. You get approximately what you expect.",
            "comment_workload": "A bit high for a common core course, especially as the professor likes to cover a wide range of topics throughout the term and the fact that there is a group project as well. However, it is manageable as long as you start early.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "l33CGPq8hhFC2LA4eH2YZ5ksfoUR2FKd",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "soso_1414",
            "date": "Dec 24, 2020",
            "title": "",
            "comment_content": "Content is quite heavy in terms of a 3-credit course<br />Majorly environmental stuff.<br />Divided into:<br />Solid Waste<br />Air Pollution<br />Wasterwater",
            "comment_teaching": "Even though online classes were going on teaching was ok. Professor Frank is quite a jovial soul and understands students SOMETIMES :).Answers emails really quick.<br />TA was also very helpful.",
            "comment_grading": "Assignments are easy to score if you have paid attention in class.<br />Mid-term is also ok <br />Finals are so so as well.<br />Grading has not been released so far.",
            "comment_workload": "HEAVY WORKLOAD!!!!!!<br />4 assignments <br />1 midterm<br />1 final <br />1 group project+presentation",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dKI7ZuZSTY5WcjWC3kliD091z6syZahX",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 224,
                    "name": "YEUNG, King Lun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "aiikooo",
            "date": "Aug 18, 2019",
            "title": "",
            "comment_content": "Content is ok. Learned about environmental issues basically. No chemistry knowledge is needed but you will definitely struggle if you don't have a chemistry background. <br /><br />3 quizzes but they will choose your 2 best scores. Consists of multiple choice, essay and problem solving (calculations) <br />Class participation in lectures.<br />Group homework (I forgot if there's 2 or 3 of them) and case studies (included in the homework)<br /><br />Took this course in my first yr and I think there are a lot of year 3/ year 4 students taking the class so it's hard to find fellow first years",
            "comment_teaching": "Boring lectures but he sometimes shows ted talks or videos that are more interesting. Monotonous voice. Most of the students prefer sitting at the back of the class",
            "comment_grading": "Grading is ok. Dunno what happened to my assignments and how they graded it but my assignment scores were around mean. <br />High mean for quizzes but they chose the 2 best scores so I guess that gives u a second chance if you mess up with one of them",
            "comment_workload": "2 or 3 group homework (I forgot). Groups of three. The format of the homework varies. There are calculations, analysis, and case studies.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AYqHXMHgROVRoA8ejABULShelH1jSsgu",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 224,
                    "name": "YEUNG, King Lun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "2535",
            "date": "Jun 05, 2019",
            "title": "Boring and useless course but low workload",
            "comment_content": "It was supposed to have this syllabus<br />Week Topic<br />1 Identifying and Solving Environmental Problems<br />2 Engineering Decisions<br />3-4 Engineering Calculations<br />5 Basic Material Balances Environmental Applications<br />6 Water Quality<br />7-9 Water and Wastewater Treatments<br />10 Air Quality<br />11 Air Pollution Control<br />12 Human Factors<br />13 Ethics of Green Engineering",
            "comment_teaching": "Lectures are very boring but you have to attend as there is participation mark (attendance)<br />Always spending time in searching relevant videos on Youtube and fixing problems about the audio",
            "comment_grading": "Normal grading, get what expected",
            "comment_workload": "Class Participation (Attendance): 15 %<br />Assignments (x2, suppose 3): 20 %<br />Case Study Project (maybe in the assignment???): 15 %<br />Examinations: 50 % (Three exams will be given during the semester. Only two exams will be counted towards grade.)<br /><br />All exams are open notes, quite easy",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "J1lDKlqt0Rh758lsJfEprLBWTWVcQvm1",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 224,
                    "name": "YEUNG, King Lun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ohikuy",
            "date": "Aug 15, 2018",
            "title": "quite good",
            "comment_content": "Week Topics<br />1 Identifying and Solving Environmental Problems<br />2 Engineering Decisions<br />3-4 Engineering Calculations<br />5 Basic Material Balances<br />7 Midterm Examination(Late March)<br />7 Water Quality<br />10-11 Water and Wastewater Treatments<br />12 Air Quality<br />13 Air Pollution Control<br />14 Human Factors<br />14 Ethics of Green Engineering<br />15 Final Examination",
            "comment_teaching": "a bit boring because of his tone<br />lots of videos and examples given during lectures",
            "comment_grading": "Grade Assessment:<br />Class Participation5 %<br />Assignments20%<br />Case Study15%<br />Midterm Examination30%<br />Final Examination30%<br /><br />grade: <br />A1: unknown<br />A2: unknown<br />MT: 100/100<br />Final: 68/100<br />Final grade: A-<br /><br />there should be a case study as a group project, but it seemed that he forgot or something, so there was an assignment 2 handed in during final exam.<br /><br />class participation: he asked us to solve some problems every lecture, and hand in at the end. not sure about if tutorial counts cuz i skipped almost all of them.<br /><br />all open book exam and assignments were given ahead of time.",
            "comment_workload": "quit light<br /><br />exams are open book, just print all the lectures and materials and you r good to go.<br /><br />Assignment: follow the notes and use common sense to solve the problems. correct calculation and decent reasoning will be fine",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "N94Al9ckFp4RDPbVoFOo5QT8Riqyykmi",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 25,
                    "name": "LAM, Leung Yuk Frank",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Leung Ka Chung",
            "date": "Jan 13, 2017",
            "title": "",
            "comment_content": "1. Environmental chemistry<br />2. Material balance<br />3. Air pollution<br />4. (Waste)Water treatment<br />5. Solid waste treatment<br /> Although the course have no pre-requisite, it require a lot of knowledge on chemistry and it would be a tough time if you have no chemistry background.",
            "comment_teaching": "Frank is nice but his lecture is boring.",
            "comment_grading": "Homework assignment 10%<br />Mid-term exam 20%<br />Group project and oral presentation 30%<br />Final exam 40%<br />As professor didn't release the result of group project and final exam, it is hard to comment on grading but i got a C even i have put much effort.",
            "comment_workload": "The workload is quite heavy. There are four assignment and each of them takes much time to finish. For the group project,&nbsp;&nbsp;we form a group of 5 and have to finish a 20-page report and do a presentation around 20 min. Frank give us a list of waste and each group will choose one to figure out how to treat them appropriately.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}