{
    "error": false,
    "course": {
        "id": 23,
        "subject": "CENG",
        "code": "1000",
        "name": "Introduction to Chemical and Biological Engineering",
        "description": "From chemistry to engineering, molecules to useful products. Physical, chemical and biochemical transformation of materials. Survey of industries related to modern chemical and biological engineering. Basic principles of materials and energy balance. Strategy of molecular synthesis, process selection and design, economic and environmental considerations. Examples taken from a diverse range of products spanning realms of food, consumer products, energy, environment, and medicine. Case studies and team projects on process and product design. For engineering students only.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.04,
        "rating_teaching": 3.98,
        "rating_grading": 4.37,
        "rating_workload": 3.43,
        "review_count": 81,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 20,
                "name": "CHAU, Ying",
                "count": 46
            },
            {
                "id": 21,
                "name": "LAM, Henry Hei Ning",
                "count": 25
            },
            {
                "id": 34,
                "name": "NG, Ka Ming",
                "count": 9
            },
            {
                "id": 27,
                "name": "LIU, Yuanshuai",
                "count": 5
            }
        ]
    },
    "reviews": [
        {
            "hash": "x6nDNiQ39tg3yB5qhqRpAfnEfcEI81un",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "seanlo",
            "date": "Jan 16, 2020",
            "title": "a good course for those who want to know more about CBE",
            "comment_content": "This course contains three main topics<br />1. Conservation Laws and Material Balance<br />&nbsp;&nbsp;&nbsp;&nbsp;Chapter 1 could be the easiest part of this course. <br />Only some simple concepts and a few formulas you must remember and understand. If you have learned chemistry in high school then it could be easy for you. But you must put some attention on controlling units.&nbsp;&nbsp;<br />2. Balance, motion, and storage of Energy<br />&nbsp;&nbsp;&nbsp;&nbsp;Things started to get more difficult since Chap.2.<br />Some fundamental knowledge about Thermal Dynamics could really help you on this chapter. The first law of Thermal Dynamics is the core of this chapter so you must remember its basic theorem and formulas. Keep an eye on UNITS !!<br />3. Transport and Kinetic<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Chapter 3 is mostly about the transport of first-order reactions and Pharmacokinetics. It could be the most complicated one in these three topics. Many formulas that you HAVE to remember and once you wanna realize it well you must know some calculus before. In addition to that, there could be some medical nouns and they might appear in your quiz and final.<br /><br />Overall, you could learn something useful if you gotta take a CBE major or tend to know more about CBE. But if you really don't have any interest in the relative field, you must think more than twice before take it.",
            "comment_teaching": "Prof. Chau is nice and willing to discuss with students or explain the detail of concepts to you after class. She would do every chalk-talk question step by step which is quite helpful for students to realize well. TAs are also nice and patient. Course PPTs are HELPFUL.",
            "comment_grading": "Grading is fair in this course.<br />Original Version:<br />30% Quiz (2 best out of 3)<br />15% Chalk-talk question presentation<br />15% Studio write-up<br />40% Final Exam<br />Due to the uni's decision to cancel all the face to face class in the rest of the semester, it has been revised to be:<br />40% Quiz (2 best out of 3)<br />15% Studio write-up (Studio1&amp;2)<br />45% Final Exam (Online Quiz)<br /><br />I got an overall 78.9% and got an A.",
            "comment_workload": "Not too much. Only studio write-ups may cost you some time to get it done.<br />But if you wanna score higher as possible, you must put much effort into it. Previewing all the chalk-talk questions before classes and reviewing them again before every quiz could be a good choice. Sometimes you may have to find some extra sources in order to understand better about the course material.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "CNTfwrMr9AHDhtsgN3ezzrrVAbluXitG",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "bonnie46",
            "date": "Jan 06, 2020",
            "title": "要小心",
            "comment_content": "分3個大topic,19份notes，<br />1.Conservation Laws and material balance<br />2.Balance, Motion and Storage of Energy<br />3.Molecular transport and Kinetics<br />係幾有趣的，concept唔難，但考果時出得難。",
            "comment_teaching": "ying chau 係幾nice的，上堂會問下啲人明唔明，做chalk talk question會問下人識唔識做，都會解下，但佢會認為你地好似識曬咁，每一條都會識咁。<br />佢做得最好應該係會搵d chem engi or bio engi既師兄黎做TA，然後分組解題目，再出去present。<br />如果係自學型既學生，ying chau應該好岩你地。<br />如果需要聽完老師解先明既學生，要小心啦，呢個course對大家黎講可能有難度啦。",
            "comment_grading": "Chalk-talk presentation (15%)<br />呢一part因為今個sem轉左online teaching。<br />Quizzes (30%, 2 best out of 3)<br />3份quiz根翻果3個大TOPIC，仲會cover埋果3個topic既studio，難度同note既chalk talk question係2個level，你明左chalk talk question之外仲要識應用，所有concept都要好熟，做卷時唔會有時間俾你慢慢諗，要好快咁做決定。（有人滿分有人零分）（sd都好大）<br />quiz 1: Mean 5.9/10<br />quiz 2: Mean 6.5/10<br />quiz 3: Mean 5.4/10<br />我記得之前睇果mean唔係咁高，仲有佢幾次都有改錯，啲人有加分，或者全部人都有加分。<br />Studio write-ups (15%)<br />似做lab咁，之後寫心得同lab啲野咁。<br />3份studio（今次就得2份，因為轉左online class）呢part係俾分你的，有做就一定有分，但個mean係3－4分，佢有2份，滿分係5分。<br />Final exam (40%)<br />今年online exam，不出所料，同quiz一樣既難度，因為交左一題冇得翻轉頭，所以好難時間有啲難分配。<br />Final exam average = 12／25 standard deviation 3.9",
            "comment_workload": "workload都幾大，因為除左3份quiz又要交3份Studio write-ups（2頁work檔，但唔一定要寫曬2頁，寫幾多都得，但個分就應該好關字數同內容事），之後佢啲concept又要你記得好熟同明曬，同埋因為分得散去考，所以你要用好多時間去準備佢啲野，上堂要專心，因為會用lucky draw去抽邊組答問題。所以上堂好少機會做自己野，討論較多。",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "etvlk8eGRLdZSOKhLSaop9dThPs3B6IE",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Aelfwine",
            "date": "Apr 03, 2019",
            "title": "Don't take the course if the instructor is Ying Chau",
            "comment_content": "Basic view of chemical and biological engineering. Knowledge like material balance, thermodynamics and pharmaceutical Kinetics. Content is pretty hard comparing with another engineering intro course. Thermodynamics in this course is actually something in 2000-3000 level. <br /><br />Lessons before add drop period is something about chemical engineering history. You will think it is easy but the lessons later are totally another dimension.<br /><br />Some guests will be invited to the lecture for talks. But they said will be examined in the final exam. So don't miss their notes in the final<br /><br />Don't expect this is an engineering entry course",
            "comment_teaching": "Ying Chau is decent but her teaching is not interesting at all. She tried to illustrate some ideas but it didn't work.",
            "comment_grading": "Tests 15% <br />Only takes best two tests (total three)<br />My result 6/10 4/10 3.5/10 (below mean)<br /><br />Homeworks 10%<br />6.x /10 (slightly below mean)<br /><br />Class participation 5%<br />IPRS every lessons<br /><br />Projects 30% <br />Luckily I found responsible and smart group mates. Then our project win the champion in class.<br />Me&gt;85 mean:7x<br /><br />Final: Super hard. I only got 3 out of 10 in mc questions. Even the final question about Fick's law I only received 1.5 points. However I get full marks in the first long question and 13/20 in the most difficult thermodynamic question.<br />47.5/100 mean 46.x (merely pass)<br /><br />Finally got a B",
            "comment_workload": "Heavy workload. Homeworks after every lectures. So there are total 2x homeworks in the whole semester. What a ust workload! <br /><br />But the most annoying one is the project. You have to take it as a serious&nbsp;&nbsp;research. Work so hard for uncertain marks.<br /> <br />Too much workload in one word.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "E3uJuIu6Lj7j1ChPByZiJQYfoKLHCD6K",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tim1",
            "date": "Jul 23, 2023",
            "title": "Best first semester course",
            "comment_content": "This course touches on the basics of chemical engineering. The course covers:<br />1. Material and Energy Balance<br />2. Heat and Mass Transfer<br />3. Fluid flow<br />4. Reaction Rate<br />5. Process Control<br />6. Process Economics.<br />The content of the course is designed very well for first-year students as it introduces chemical engineering concepts clearly, but I felt that it lacked depth, and wasn't challenging, however, it was understandable, since it's an introductory course.",
            "comment_teaching": "I really enjoyed Ying Chau's teaching. Since the course was less packed, the pace of the teaching was slower than most courses I took. In the lecture, she was mixing up some demonstrations and some lab sessions to learn in a more 'enjoyable' way. I was able to understand her lectures without much difficulty, so I don't have any complaints.",
            "comment_grading": "iprs: 10%<br />project : 20%<br />Final: 35%<br />lab reports: 15% (3 x 5)<br />Homework: 20%<br />Very satisfied with the grading, they are mostly very easy to get high grades in; In lab reports, as long as you come to the experiment sessions, it should be a 100%, homework can be tricky, but you can ask TAs and Ying Chau if you aren't sure about something, iprs is basically a give away grade, you will get a decent grade in project if you put in a decent effort, final exam is an open book so not much pressure.",
            "comment_workload": "If you learned chemistry and physics in high school, then you already know 70% of the course, so you wouldn't need to study much. (Final is open book as well). There are only 5 questions in each homework as well, compared to 10 in maths and physics, this is very light. Overall, this course is considered a very light course in ust.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "B5M7DKtayao47gWlwcRSGJZTGF14UgQG",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yuki Liao",
            "date": "Nov 16, 2022",
            "title": "boring",
            "comment_content": "3 main modules:<br />1. Conservation laws and material balance.<br />Mass balance of chemical components in a system.<br /><br />2. Balance, motion, and storage of energy<br /><br />3. Transports and kinetics<br />How a drug is transported in the human body",
            "comment_teaching": "I didn't understand much of the instructor's teaching. And you cannot rely on PowerPoint slides because they are overly simplified and cannot give you much information about the contents. Also, boring",
            "comment_grading": "- Class participation (10%) –iPRS participation after add‐drop <br />- Homework (20%)&nbsp;&nbsp;‐‐4 HW, individual submission, 5‐point grading<br />- Studio writeup(15%) –3 studios, team submission, P/F <br />- Class Project (20%) –Individual posting of narrated slides (5‐10min) <br />- Final exam (35%)–Open‐book, MC questions",
            "comment_workload": "The course consists of the following:<br />1) 4hw<br />2) Project<br />3) 3 studios<br />4) Final Exam<br /><br />Personally, I felt the workload was pretty heavy for this introductory-level course.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MK4RJDyaEvCCpbmBRFv6ttZ28fqeKLXU",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bakso goreng",
            "date": "Oct 03, 2019",
            "title": "okay la",
            "comment_content": "3 main modules:<br />1. Conservation laws and material balance.<br />Mass balance of chemical components in a system.<br /><br />2. Balance, motion, and storage of energy<br /><br />3. Transports and kinetics<br />How a drug is transported in the human body<br /><br />Basically every module just adds on top of the previous one so make sure to understand each one.<br />Content for me is not really interesting. Read up more about the content from the course quota or other reviews.",
            "comment_teaching": "Professor Ying Chau seems very passionate in her teaching and would give opportunities to ask questions anytime during class. However, professor tend to over complicate things resulting in a disconnect between her teaching and the students' understanding. You still learn some from her teaching but I needed to reinforce my understanding by going over the ppt slides again and asking TA.<br /><br />However, I decided to give teaching an A because the format of the teaching mode in this course is somewhat unique compared to other courses in the university. Basically, the class is divided to ~10 groups of 4-5 people where students can sit together with their group mates during class with one TA assigned to each group. Every class there would be a chalk-talk question where students are supposed to figure out together with help of TA. Therefore, class would not get boring and is very much interactive.",
            "comment_grading": "Chalk-talk presentation (15%)<br />During each workshop and studio, students in teams of 5 will work together to answer questions (given in advance) and teams are randomly picked to respond. One student (decided by the team) will present on behalf of the team in front of the class. Each team will be called at least 5 times, so there is no excuse about missing the opportunity to score. Note that each student will do chalk-talk presentation once. The presenting student will be graded on: thoroughness, logic, clarity<br /> <br />Quizzes (30%, 2 best out of 3)<br />An open-book, open-notes quiz will be given towards the end of each module. Each quiz will have 10 multiple-choice questions and you are to answer them individually. Your two best quizzes will be counted towards the course grade.<br /><br />Studio write-ups (15%)<br />A 1-2 page write-up, with no particular format, as long as it is in your own words, to reflect on what you have learnt in the studio. <br /><br />Final exam (40%)<br /><br />Quizzes and Final are open-book but require understanding of the course material. Open-book still helps as there are still some formulas here and there but the exams ultimately tests the students' understanding. <br />In my case, final was held online with all MCQ but I think normally would have some long questions requiring steps and calculations.<br /><br />My marks:<br />Quiz 1: 8/10 ,<br />(Mean 5.9, sd 1.8 )<br />Quiz 2: 7/10,<br />(Mean 6.5, sd ~ )<br />Quiz 3: 7/10,<br />(Mean 5.8, sd 2.0 )<br /><br />Best 2 quiz taken was quiz 1 and 2.<br /><br />Write-up 1: 5/5 <br />(Mean 3.3, sd ~ )<br />Write- up 2: 5/5<br />(Mean 4.0, sd 0.77 )<br /><br />Write-up 3 and chalk-talk presentation grades cancelled due to protests situation.<br /><br />Final: 16/25<br />(Mean 11.9, sd 3.9 )<br /><br />Final grade: A<br /><br />I heard from others its not too difficult to get A range in this course.",
            "comment_workload": "Very little workload.<br />In a month, you just have to write one reflection write-up (essay) regarding the studio. Write-up has no strict format or length but is encouraged to be 1 to 2 pages. Asides from that, no homework or assignment. No attendance as well but no cloud recording and ppt slides could be ambiguous. Class somewhat fun anyway so just show up.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "489phyRd2tV2me4nPW83krxud7t5Sj8B",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "dc919",
            "date": "Jan 05, 2019",
            "title": "",
            "comment_content": "It is an introduction course in chemical engineering. This course has three big topics: material balance, energy balance, and the Pharmaceutical Industry.",
            "comment_teaching": "Honestly, I think Chau teaches not quite good. Her powerpoint is copied, Henry and lack of explanation. Although she tries hard to let us understand what she wants to say, it still a detail explanation of some calculation.",
            "comment_grading": "Homework\t10%<br />Assignments\t0%<br />Quiz\t15%<br />Class Participation\t5%<br />Project\t30%<br />Final Exam\t40%<br /><br />Quizzes and finals are open book.<br /><br />There have three quizzes and only count two higher one. I only have the half mark of the quizzes ( around mean ). l I got below bare marks of mean in Final examination. My group did well in the group project, we were one of the winner group. It earned a lot of mark to me. ( GROUP PROJECT IS IMPORTANT) Finally, I got B. You can make it reference.",
            "comment_workload": "In each week, it contains one or two homework and will be counted every homework.<br /><br />About the project, it needs to submit a meeting log on every week. It needs to create a 15 minutes video at last.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9e7eNroy3uWeSfP64I7J4Rge1U39DFk4",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yyych",
            "date": "Apr 25, 2016",
            "title": "Very Good Grade",
            "comment_content": "1. Material balance<br />2. Energy balance<br />3. Kinetics",
            "comment_teaching": "The professor is very nice and helpful. He gave a lot of useful suggestions to our group project.",
            "comment_grading": "Very good.<br />Final exam below mean, still got a B.",
            "comment_workload": "1-2 assignments per week, some are calculation homework and some just need you to search the answers on the Internet. At first, you might find the calculation parts difficult when you are doing the assignments but you will think they are easy once the professor explains everything to you after you submit the assignments.<br />Project is quite easy to do. Probably I had good group mates.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KNGjFaMgr574QNN30kxVlNYjYrKv6kgJ",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "thpoonaa",
            "date": "Jan 30, 2023",
            "title": "Very good grades, in exchange for your sanity",
            "comment_content": "The course is called Intro to Chemical and Biological engineering, but it's mostly just focused on physics and chemistry. <br /><br />There's a good number of topics covered, but its not really that in-depth. If you have taken DSE chemistry and physics, most of the stuff is not going to be an issue.<br /><br />The topics covered are:<br />1. introduction<br />2. role of chemical engineering<br />3. describing physical quantities<br />4. solving engineering problems<br />5. material balances<br />6. fluid flow<br />7. mass transfer<br />8. reaction kinetics<br />9. energy balance<br />10. process control<br />11. process economics",
            "comment_teaching": "If it hadn't been for attendance taking during the lesson (using iPRS), I wouldn't have went to the classes. <br /><br />Chau Ying's teaching is so bad the TAs do a far better job. You might get even more confused after taking her class, so the best option is to prepare for the classes beforehand (that is, if she decides to upload the lecture notes earlier. Sometimes, she only uploads the lecture notes less than an hour before the lesson.)",
            "comment_grading": "Class participation (using iPRS) - 10%<br />Homework (x4) - 20%<br />Studios (x3, pass/fail) - 15%<br />Individual class project and peer evaluation - 20%<br />Final exam (20 MC, open book, 3 hrs)- 35%<br /><br />My grades:<br />&nbsp;&nbsp;attendance - (not completely sure) full marks<br />&nbsp;&nbsp;homework - 20/20<br />&nbsp;&nbsp;studio - all passed<br />&nbsp;&nbsp;Individual class project - 18.43/20<br />&nbsp;&nbsp;final exam - 19/25<br /><br />final grade: A+<br /><br />The homework is graded on a 5-point system:<br />&nbsp;&nbsp;5- Excellent: 100% or nearly 100% correct<br />&nbsp;&nbsp;4-Very Good: Majority correct with minor mistakes<br />&nbsp;&nbsp;3-Satisfactory: Show understanding of course materials despite <br />&nbsp;&nbsp;&nbsp;&nbsp;some major mistakes&nbsp;&nbsp;<br />&nbsp;&nbsp;2-More effort needed: Incomplete submission, or missing major <br />&nbsp;&nbsp;&nbsp;&nbsp;parts<br />&nbsp;&nbsp;1-Minimum effort shown<br /><br />The 3 studios are essentially labs (in 3 or 4 ppl groups), with a worksheet that you have to hand in to be graded (pass/fail).<br /><br />For the individual project, you are given some topics to choose from, and you would need to choose a product/problem related to that topic to do a presentation on.<br /><br />The final is not that difficult. you won't use up all 3 hours for the 20 questions, and it's open book as well, so you can just print all the lecture notes.",
            "comment_workload": "Other than the individual project, the general workload is quite light. <br /><br />The homework is quite easy as long as you go through the materials from the tutorial sessions. <br />For the studio worksheets, you can probably do most of the questions before even attending the lab.<br /><br />The individual project is what's going to take up most of your time. My advice is to allow yourself around a month to do it, so you can take your time to decide on a topic to write about.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "57rFl1tMSyXeFwcGhBluKBRhKFyljQj9",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Haibara Ainstei",
            "date": "Jan 03, 2023",
            "title": "",
            "comment_content": "3 main modules:<br />1. Conservation laws and material balance.<br />Mass balance of chemical components in a system.<br /><br />2. Balance, motion, and storage of energy<br /><br />3. Transports and kinetics<br />How a drug is transported in the human body<br /><br />4.&nbsp;&nbsp;a little bit of Materials, process control and economics<br /><br />Actually, not much real &quot;chemistry&quot; content, cost are maths and concepts with the fundamental of chemistry.",
            "comment_teaching": "Ying Chau is actually kind and quite passionate about teaching us. She brought us some jokes and practice questions together in the lecture.<br /><br />However, the performance of the TAs was bad, they've done nothing good except give us guidance on the homework.<br /><br />#FreeKalindu",
            "comment_grading": "- Class participation (10%) –iPRS participation after add‐drop, just simple MCs<br /><br />- Homework (20%)&nbsp;&nbsp;‐‐4 HW, individual submission, 5‐point grading<br /><br />- Studio writeup(15%) –3 studios, team submission, P/F<br /><br />- Class Project (20%) –Individual posting of narrated slides (5‐10min), the projects would be graded by the group partners and the TAs<br /><br />- Final exam (35%)–Open‐book, MC questions<br /><br />My grade (for reference):<br />Class participation: Full participation<br />Homework: 4.5,2.5,4.75, 4.2<br />Studio: All pass<br />Individual class project: 18.9/20<br />Final exam: 19/25<br /><br />My overall grade: A<br />(I think I could go for A+ if I worked harder on homework)",
            "comment_workload": "I wouldn't say the workload is light, although the course has no midterm with an open-book final exam.<br /><br />Actually, you have about 3 weeks to deal with your homework, 5 long full-step question each. The questions are actually hard and complicated (though has guidance from TAs and the lecturer, and that's why I had 2.5 in my second homework).<br /><br />The project also needs much hard work than you thought, from topic research to the final recording and the peer evaluation, you just had to try your best if you want to have a good grade.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JIZqTOQbgPGOhy8muZAQCkZVbdLHFFR4",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bosco Avon",
            "date": "Jan 02, 2023",
            "title": "Easy in Content but Difficult in Contest",
            "comment_content": "Some basic aspects of Chemical Engineering will be discussed. Including:<br />Material Balance<br />Fluid Flow<br />Energy Balance<br />Mass Transfer<br />Reaction Engineering<br />Process Control<br />Economics<br /><br />The content is generally not very difficult and easy to understand if you pay enough effort on studying them.",
            "comment_teaching": "Professor Ying Chau has a very clear explanation and casual style lecture. She can make you understand complex concepts while keeping the lesson pace not too fast. She is also quite nice to the students.",
            "comment_grading": "The course is generally easy, but also because of that, the competition of the course is vigorous as anyone is struggling to get the best grade. Here is the grading system according to canvas:<br /><br />The course is letter-graded. The final grade will be awarded based on performance in the following categories, with weights in parentheses: (Fall 2022-2023)<br />Class participation (10%)<br />Homework (20%)<br />Studios (15%)<br />Individual class project and peer evaluation (20%)<br />Final exam (35%)",
            "comment_workload": "Light workload. Not a lot of assignments. The greatest part of the workload is the individual project. You need to introduce a chemical engineering invention or achievement with details recorded video on PowerPoint/slide.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ivSjV54JESbsVq6mfLRjfPcOK1MJIBm8",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "potatoc",
            "date": "Dec 29, 2022",
            "title": "good if you are interested in cbe",
            "comment_content": "as described by others",
            "comment_teaching": "the Prof and TAs are all very nice and respond to emails quickly. Also, Prof Chau's delivery is incredibly interesting.",
            "comment_grading": "the mean of assignments is quite high, so be sure to try to get them all correct. <br />pass all studio reports, obviously<br />for sure the project requires a certain amount of effort, but I enjoyed learning about cbe very much, so it's not much of a pain. <br />for the exam, since it is open book, just print all the things if you think it has the tiniest chance to appear on exam (it will)",
            "comment_workload": "the content is not too hard but you do need to spend some time on it (as a local student) esp for lectures building on previous ones, if you do not make the concepts clear beforehand you will be very very confused in class <br />4 assignments, 3 studios (P/F), one individual project, open book final exam <br />iPRS in lessons <br />Fair workload, I think",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JQwziBNu12eG2V76zLzYI4bC7bkngNT2",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hakenchok1",
            "date": "Dec 28, 2022",
            "title": "Sounds controversial",
            "comment_content": "1. Material balance<br />2. Fluid flow<br />3. Mass transfer<br />4. Reaction Engineering<br />5. Heat transfer<br />6. Materials, process control and economics<br /><br />The content is not easy sometimes, however it is understandable for those who know Chemistry, Physics and Math well.",
            "comment_teaching": "Teaching is interesting and unusual. I liked one TA out of three although each of them can always help if you want.",
            "comment_grading": "Grading seems to be honest. Average = B. <br /><br />Class participation - 10% (iPRS)<br />Homework -&nbsp;&nbsp;20%<br />Studios - 15%<br />Project - 20%<br />Final - 35%<br /><br />Homework is not trivial at all and it helps a lot to understand the materials, however you cannot use it as a tool to understand the topic because it is graded. The reason for that is that many locals (as you know) buy answers for these homeworks and so on.... So, you are not allowed to do mistakes.<br /><br />Studios are easy and do not take them too seriously, you will still get Pass grade. It's just for fun and experience.<br /><br />Project is what you can make perfect to get a good garde. Majority of students will tell you here that you can do it in 3 hours before the deadline. That's why they have the average grades. Just trust me: start it at least in October.<br /><br />Although Prof. Chau said that final will be not HELL as in&nbsp;&nbsp;previous years, in fact it was about the same difficulty. Sometimes you just don't understand what they want from you even though you know the topic. That's because there is not enough practice in this course and all problems are completely different from each other.<br /><br />My results:<br />Class participation: 97% (Avg: 97%)<br />Homework: 18/20 (Avg: 17)<br />Studios: 100% (Avg: 98%)<br />Project: 19.03/20 (Avg: 15.5)<br />Final: 13/25 (Avg: 13.9)<br /><br />Grade: B+",
            "comment_workload": "Workload is fine. You need to attend lectures and spend 3 hours on each homework and also extra 2 hours per week on your own work with the materials. Still, I don't know why but this course looks very controversial to me.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "W6Q7TSpO1li6YOFeSeN0VL9ey5IvP1K5",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 27,
                    "name": "LIU, Yuanshuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gyy",
            "date": "Jan 11, 2022",
            "title": "",
            "comment_content": "Topic covered: <br />1) material balance <br />2) thermodynamic <br />3) pharmacokinetics <br /><br />I did Chemistry IB HL so I find material balance not that hard, as long as you have basic chemistry knowledge you should be fine since it is similar to mole conversion <br /><br />thermodynamic is a bit difficult but you will get use to it after going through the examples in the slide <br /><br />Pharmacokinetics is an extension of material balance but with some involvement of differentiation and integration (the prof don't expect us to be able to differentiate or integrate so if you don't know how to it'll be fine)",
            "comment_teaching": "Professor is very kind, and he makes a lot of jokes during class, which makes it very enjoyable. He demonstrates concepts in a fun manner which makes them easier to pick up. However, his pace is fast so you got to pay a lot of attention, or else you can miss out on small details.",
            "comment_grading": "only 3 out of the 4 quizzes are graded so if you screw up in one you still got a chance to make up for it.<br /><br />40% final exam: 76/100<br />10% HW 2/2 2/2 2/2 1.5/2 1.9/2 2/2<br />20% quiz: 8/15 8/15 13/15 13/15<br />20% project <br />10% class participation <br /><br />A+",
            "comment_workload": "workload: 6 assignments, 4 quizzes, 1 final group project<br /><br />Assignments are a bit hard and it will take you some time just to understand the question and the concept behind it. There's TAs to help you with it so you can ask them when you are stuck. <br /><br />Quizzes are based on presentation, and it's open book so you could go back and check it. But the time given for each quiz is very little, so you got to be quick.<br /><br />Final project is a group work of 4 people. You have to write a 800 words synopsis and make a video presentation of the topic. A lot of research about the topic you choose is required.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "REAbYj7YuEl2ClBOfs3xXbUtyeVC2LQS",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 27,
                    "name": "LIU, Yuanshuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "dong",
            "date": "Jan 10, 2022",
            "title": "",
            "comment_content": "There's only three parts:<br />1. Material Balance<br />2. Energy<br />3. Kinetics <br /><br />The content is not easy. Practice and understanding of concepts is key. <br /><br />Only need to memorize around five equations but it's hard to use them if you don't fully understand the concept.",
            "comment_teaching": "Marshal's teaching pace is fast. He loves challenging students and he makes us think hard in class, assignments, or quizzes. Although he gives students new knowledge, he also assumes too much about our background knowledge. Btw, we learn how to assume too. <br /><br />Some slides that are presented in class won't be in the posted slides and it's usually the solution to the problems. Also, the professor doesn't give a lot of example problems.",
            "comment_grading": "As long as you exceed professor's expectations (~60%) you will get a high grade. <br /><br />Quiz: 14/15, 11/15, 13/15, 13/15<br />Final: 70/100 <br />A+",
            "comment_workload": "4 quizzes, 6 assignments, final, group project<br /><br />Assignments are 2-3 questions long and it requires a few hours to finish. <br /><br />Our group meeting is every tutorial session. Getting an appropriate topic was difficult but we had adequate time so there was no rush.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "w7ULWwhKOU6ryH1kBX8R64elBbQU5cV4",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 27,
                    "name": "LIU, Yuanshuai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Caramel",
            "date": "Jan 06, 2022",
            "title": "A course that force you to grow and tell you how hard engineering can be",
            "comment_content": "( just because I only got level 4 for Chemistry？)<br />Content of this course is very difficult for an introductory level course:<br /><br />1. Material balance(Mass balance,energy balance)<br />2. Thermodynamics (Latent heat + enthalpy+heat capacity+plus pressure stuffs)<br />3. Pharmacokinetics (require good concept of rate of reaction in DSE)<br />4.Talks by alumni irregularly<br /><br />DSE chemistry students can have some concepts on the material balance part with enough chemistry background on mole,mass,volume and density.<br />However,thermodynamics and pharmacokinetics is extremely hard for year 1 students to understand.(I can see many of the top scorers are NDS and Asso people with strong fundermentals on Physics and Chemistry)<br />Professor: I have tried my best to include all the parts of Chemical engineering to you.<br />Yes,this course shows you in-depth chemical engineering(with cost of bad grading)",
            "comment_teaching": "Although you may keep blaming for the thick Chinese accent,Marshal Liu is an extremely nice professor (still remember he discussed with us the purpose of university studies and invited a boy to sing for us on the first lecture). By the way, he is very good at forcing students to grow,TAs followed him mentioned that he requires students to finish the same amount of questions with 1 hour less in many of his courses.<br /><br />(My own experience: The exam questions are not for year 1 students,I did the last year past paper and at least I can read the questions though I may not correctly answer. Well, for his exam paper,I can barely understand what he wanted me to do)<br /><br />I'd say that the lectures are not helpful for understanding,even for the lecture notes &amp; HW solution,you need to spend time watching Youtubes yourself for deaper understanding.(One thing I complaint to professor in the mid-term questionnaires is that his distributed lecture notes do not include the solution for examples. It's good that he added then for more comfortable understanding) <br /><br />I agree that some TA were really helpful and will always detail-ly answer your questions about either and lesson or the homework. Even in their private time ,they will hold extra tutorials for you. However, some of my friends' TA are lazy/busy and will just straight off ignore you (with excuses).",
            "comment_grading": "Acceptable grading. <br />I'd say the group project is extremely important and you really need good ideas and good group mates(a variable)<br />The finals is open book/internet (which doesn't help much) you only have to do 4 out of 5 questions. The mean is 50 and I got 4x even though I have paid many efforts in this course that I spend at least 6 hours for each HW and watched every lectures till understood ppt)<br />I predicted myself a C+ cuz my quizzes&amp; HW are just barely on mean and my final was below mean.<br />In the end I got an B-,which somehow relieved me!",
            "comment_workload": "Frequently coming quizzes,assignment,group projects. Deadlines are suffocating(maybe just because I do 18 credits)<br />There is homework for almost every single week. The homework is EXTREMELY hard(TA also said HW are exam level and actually he picked them from past papers) and students end up copying other students' homework/ask TA. There are also many quizzes to do&nbsp;&nbsp;which is about the small details discussed in the lectures(especially those he put on ppt in lessons but not on your given notes) so make sure you pay attention.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "25bxuj6pIB23AAI8XQLNvYH5GprwpFwg",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 27,
                    "name": "LIU, Yuanshuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "化工之鬼",
            "date": "Jan 03, 2022",
            "title": "a little bit too difficult introductory course",
            "comment_content": "there are three topics,<br />material balance,<br />energy balance,<br />pharmacal kinetics.<br />they use concepts in dse chemistry, but they introduce a lot of difficult theories above that, i got a 5** in dse chemistry and still not able to handle much in the syllabus so good luck if you dont have good chemistry basic.",
            "comment_teaching": "Liu got a very strong accent, i could hardly understand what is he saying, and the powerpoints are too simple. by simply reading the PowerPoint, you definitely cant understand the concepts, just go ask your friends and ta, the professor cant help much.",
            "comment_grading": "mean in quizzes,<br />0.6 marks below in final<br />full in Homeworks<br />got a b overall (not bad)<br /><br />the quizzes and final are long but they gave you too little time to finish, he doesn't expect a normal student to finish it but they are open notes and internets, this helps a bit though",
            "comment_workload": "got a homework every two weeks and quiz every two week (they come alternatively)<br />so basically you got to do sth throughout the whole semester.<br />they are pretty difficult so maybe you need to get some help from ta or your friends<br />also this course got group work to complete, which i got shitty groupmates and the workload is tremendous for me.<br />i could say all the burden of this semester is from this course.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "olveEm1YiShTZgKVQtRaeks9A6O9HBEG",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 27,
                    "name": "LIU, Yuanshuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Natcha",
            "date": "Dec 26, 2021",
            "title": "Another underrated course",
            "comment_content": "I'd say the content of this course is pretty difficult for an introductory level course: <br /><br />1. Material balance <br />2. Thermodynamics <br />3. Pharmacokinetics <br /><br />For me, I feel that you can master the material balance part with some chemistry background but thermodynamics and pharmacokinetics is in the 2000-3000 difficulty level and will be extremely hard for year 1 students to understand.",
            "comment_teaching": "Marshal Liu is an extremely nice professor and is very approachable. He has a thick Chinese accent but I got used to it after a few lectures. I'd say that the lectures are not the very best since Marshal keeps talking about other stuffs that are not relevant on the exam (I found it interesting tho) instead of doing example practice problems for us. Some TA were really helpful and will always thoroughly answer your questions about either and lesson or the homework. However, some are lazy and will just straight off ignore you.",
            "comment_grading": "Really good grading. I'd say the group project is extremely important and I found amazing group mates. The finals is open book/internet (which doesn't help) and you only have to do 4 out of 5 questions. The mean is 50 and I got a 57 even though I studied like crazy. HOWEVER, in the end I got an A which really shocked me! I guess it is because the final is only 40% and I did really well on both the quizzes and the group project. HARD WORK PAYS OFF!",
            "comment_workload": "There is homework for almost every single week. The homework is extremely hard and students end up copying other students' homework. There are also many quizzes to do at the beginning of class which is about the small details discussed in the lectures so make sure you pay attention.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VfkNlfLV6w1h5WEUwiAg2oFZhrGgVBOE",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SATB",
            "date": "Aug 22, 2021",
            "title": "",
            "comment_content": "There were three main modules:<br />1. Conversion Laws and Material Balance<br />2. Energy Balance and Storage<br />3. Molecular Transport and Kinetics<br /><br />A very holistic overview of the field of chemical and biological engineering, good for those who are interested in majoring in chemical or bioengineering.<br /><br />Personally, I find the 3rd module the most interesting.",
            "comment_teaching": "Prof. Chau is patient and willing to answer all questions, in-class or after class. She also tried to explain everything in detail so that we can fully understand everything. But since this is just an introductory course, I am not sure if it is the best thing.",
            "comment_grading": "Class Participation (Zoom poll): 10%<br />Homework: 20%<br />Group Project: 30%<br />Final Exam: 40%<br /><br />For the participation, as long as you click an answer in the poll, you'll get a point no matter the answer is right or wrong.<br /><br />Class Average:<br />Participation: 8.87 / 10<br />Homework: 14.75 / 20<br />Group Project: 24.68 / 30<br />Final Exam: 19.74 / 40<br />Total: 68.04 / 100<br /><br />My grades:<br />Participation: 10 / 10<br />Homework: 15.42 / 20<br />Group Project: 27 / 30<br />Final Exam: 24 / 40<br />Total: 76.42 / 100<br /><br />Letter Grade: A-<br /><br />Actually, I think the final letter grade is quite lenient.",
            "comment_workload": "In this semester, there were in total 6 pieces of homework, they were not especially difficult but may take some time. However, you must pay attention to each intermediate step for the calculations to make sure there is no mistake.<br /><br />The pieces of homework are a good review for you to see if you really understand the concepts.<br /><br />The component with the highest workload is probably the group project, where you have to work with 3 to 4 classmates in investigating a topic related to chemical engineering, the professor will provide some general direction for your topic, but you have to decide the specific topic yourself. There are 6 major areas, including the conversion of Food waste to useful products, Technologies to improve access to clean water, Renewable energy for transportation, Control of diseases transmission, Manufacturing of vaccines against COVID-19, and Sustainable cosmetic products. It is actually very broad so you can do many different things.<br /><br />The final exam was quite difficult, even it was an open boon and open internet assessment, the mean was still very low.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FtDXQ0zrdLrkECt9N4IO7c4LZYp7DaVD",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kkbb",
            "date": "Apr 12, 2021",
            "title": "Online sem",
            "comment_content": "3 modules in total<br />1: Conservation Laws and Material Balance<br />2: Energy Balance and Storage<br />3: Molecular Transport and Kinetics<br />Difficulty: 3&gt;2&gt;1",
            "comment_teaching": "Prof. Chau is always willing to answer students' questions. She also tried to make the lectures fun and interactive.<br />*Online semester*",
            "comment_grading": "The grading is fair<br /><br />Class participation (10%)<br />Homework (20%)<br />Class Project (30%)<br />Final exam (40%)<br /><br />Easy to get that 10% of class participation if u attend all classes.<br />HW is not really difficult but take quite a lot of time to do(6HW in total)(2-3 questions in each HW)<br />Group project (5ppl in a group)<br />-project presentation (ppt)(8min presentation + 2 min Q&amp;A)<br />noted that you need to present your project in the class 3 times!!!<br />-project synopsis (500-800 words)<br />Final exam is 20 Mc questions. Two 1‐hour sections and 10 multiple‐choice questions in each section. Not allow to go back to previous questions<br /><br />My grade:<br />Class participation : 10/10<br />Homework: 19.5/20<br />Class project: 76/100 (mean:82.3)<br />Final exam：11/20 (mean:9.87)<br />B+",
            "comment_workload": "The workload is large compare to other engine intro. courses that I have taken<br />HW is not really difficult but take quite a lot of time to do<br />The project is time-consuming<br />I think that is pretty annoying that u need to present the project 3 times...<br />I won't recommend this course due to its large workload.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "AO9M9siEUP2JY9Jn35Zxb87JShHQ6R2I",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "MMhhhh",
            "date": "Jan 23, 2021",
            "title": "",
            "comment_content": "There are 3 modules.<br />Module 1: Conservation Laws and Material Balance<br />Module 2: Energy Balance and Storage<br />Module 3: Molecular Transport and Kinetics<br /><br />Module 1 is easy but it is difficult for modules 2 and 3. If you work hard on module 2, it will be ok. For module 3, there are many difficult concepts about kinetics that are not basic knowledge.",
            "comment_teaching": "Chau Ying put effort to explain basic concepts but she didn't give explanation on difficult concepts. Maybe she gave but it didn't work. Btw she is willing to answer students' question.<br />During the tutorial class, you can discuss your group project with groupmates and TA who is year 3 CENG student. If you ask them for assistance with the problems from homework, they may answer you they are busy with their hw/midterm/project and cant help you:)",
            "comment_grading": "Class participation 10%<br />Homework 20%<br />Class project 30%<br />Final exam 40%<br />My grade:<br />Class participation : full<br />Homework: slightly below mean<br />Class project: 85/100 (mean82.3)<br />Final exam：6/20 (obviously below mean)<br />I got C+",
            "comment_workload": "It's quite heavy as every homework is hard. Nearly one homework every 1-2 week. 6 homework in total. It's good that there is no midterm.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zKHT9TQalTri20VLTuxI9vlxwoeTJqzI",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JJKK",
            "date": "Jan 22, 2021",
            "title": "Good course",
            "comment_content": "1.Conservation Laws and material balance<br />2) Balance, motion, and storage of energy<br />3) Pharmaceutical kinetics and transport<br />The contents are quite abstract it will take you some time to understand the content properly",
            "comment_teaching": "Quiet good but she tends to explain some parts of the content very briefly. Especially for unit 3, 'pharmaceutical kinetics and transport'.<br />Also, the PowerPoint is very vague and it's not enough for the preparation of finals.",
            "comment_grading": "The Final is difficult but the mean is extremely low. Around 10/20. <br /><br />20% HW<br />10% Attendance<br />30% Group project<br />40% Final<br /><br />HW: Significantly above average<br />Attendance: Full mark<br />Grou project: Mean<br />Final: 13/20<br /><br />Grade: A",
            "comment_workload": "Quite heavy. <br />6 homework and considering that they are just homework it's adequately difficult.<br />The group project is also annoying",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6aZOEGuPzKY2IY3BY2yDMFq8leBHVlCf",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LIFEGOOD",
            "date": "Jan 20, 2021",
            "title": "Good",
            "comment_content": "1. atom balance<br />2. material balance<br />3. pharmacokinetics<br /><br />Module 1 is easy<br />Module 2 quite hard. But once you understand them, its easy.<br />Module 3 is quite hard, but i really enjoyed this module.<br /><br />Work hard, then you will get at least B-",
            "comment_teaching": "At first i didnt quite understand the materials but as i go through and watched lectures the second time on zoom, i understand a lot better. She teaches well in fact if you watch it the second time. <br /><br />She replies emails really fast.(the same day most of the times) and you can ask questions on HW if you want. She will answer you very clearly. <br /><br />TA s are nice as well.",
            "comment_grading": "Attendance <br />HW<br />Group presentation + report<br />Final<br /><br />Attendance. you should get 100%<br /><br />HW is not very hard to get 80% or above<br />I suggest you to work with other ppl and make sure you get the same answer. Teacher suggests you to work in groups. Just don't copy each other, im sure TA can tel if you did. <br /><br />About Group presentation, pick your group members wisely. Some of my group members were not helpful at all.One of my group members did only 3% of whole work. Please choose your group member wisely. When you see a free-rider during final period, it drives you mad cuz all group members get the same mark. Towards the end, one of my group members did so little work, that i reported him to my TA for his little contribution. <br />There are 2 parts in group presentation. 1.presentation and report. You and your group members will receive the same mark. 2. particiation mark (im not sure exactly how it was called). Your TA will mark this. Individually marked within group<br /><br />Finals, not very hard. Quite similar to the mock exam. Just make sure you go through every example you learned during class and actually understand them. <br /><br />I got <br /><br />HW 114/120<br />Group presentaion 92/100<br />Attendance 100%<br />Final 11/20<br /><br />Overall A<br /><br />I felt quite nervous on finals and i definitely could have done better but got an A, won't complain.",
            "comment_workload": "6 HW in total.<br /><br />i spent quite a lot of time solving them, but i got full marks on 5 of them expect for HW4 so hard work pays off.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0GIo8E9cuRM73cMP6mCAMUv3j4AF8vC4",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HiK",
            "date": "Jan 16, 2021",
            "title": "Nice",
            "comment_content": "There are 3 module of this course.<br /><br />Module 1: Conservation law and materials balance.<br />(It's some calculation of mass, mole, concentration in some physical and chemical reaction. You can tackle it if you have studied chemistry in high school)<br /><br />Module 2: Balance, motion, and storage of energy<br />( Some calculation of energy change when exothermic, endothermic reaction and change of physical state are carried on.)<br /><br />Module 3: Pharmaceutical Industry and Pharmacokinetics<br />(The chapter is trying to tell you how the drug delivery happens in our body. It teaches us how to calculate the rate of change of the drug concentration after it has come into our body)<br /><br />I would say the the content was quite interesting but it would take some time to understand the concept. It would be easier if you have physic and chemistry background.",
            "comment_teaching": "I think Professor Chau is not skillful in teaching as she only read the ppt without further explanation. The presentation was quite sleepy for me so it's hard to follow the concept. What I did in the lesson was mostly copying her handwriting of calculation steps when she solving the example in the lecture notes and reviewed it after the lesson. <br /><br />There are 3 PG TAs in the course who are very nice and helpful. Each of them will give us a presentation of a summery of each modules which benefited to our concept understanding.",
            "comment_grading": "Class participation (10%)<br /><br />(The participation mark is all about polling question on zoom and open question on padlet. Any reasonable answer would have a full mark.)<br /><br />Homework (20%)<br />( The homework is something help you to clear the concept. It's suggested to treat it seriously.)<br /><br />Class Project (30%)<br />( Do some research on the area provided. Describe the problem and suggest a solution on it.)<br /><br />Final exam (40%)<br />20 Mc questions.<br /><br />If you study hard and do more exercise, you would get a higher score.<br />Overall around 75% and got a B+",
            "comment_workload": "Each module had 2 homework so there are 6 homework in total. I think doing homework is helping my understanding. It is ok to take some time. <br /><br />The project seems to have lots of thing to do and I also feel stressful in the beginning. The most challenging part is suggesting a solution with engineering sense but it would let you learn something.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nMAxuJapcfthQ4kjjUH7gac6WSRaVkAi",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Domoto295",
            "date": "Jan 12, 2021",
            "title": "An underrated course; Hard Work Pays Off!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "comment_content": "The content is quite challenging, which covers many mathematics, physics, chemistry and biology knowledge. <br /><br />Syllabus:<br />1. Conservation Laws and Material Balance<br />2. Energy Balance and Storage<br />3. Molecular Transport and Kinetics<br /><br />As a student without biology background, I completely messed up in the 3rd module. However, the overall course content is very interesting and fruitful. I enjoyed the content a lot.",
            "comment_teaching": "Professor Chau is very helpful and kind. She tried to illustrate the concepts with many examples, which are very useful for the assignments. She is very passionate in teaching and welcome students' questions. When I emailed Professor Chau to ask questions, she replied me as soon as possible, with a super detailed explanation. <br />There were many TAs to help us, not only with the assignments, but also the project. They are very responsive in emails and Slack.<br />After attending this course I seriously think that this course, and also the professor, are underrated on this platform...",
            "comment_grading": "Participation (polling + padlet) -10%<br />HW-20%<br />Project-30%<br />Final-40%<br /><br />As long as you have responded to the polling, your attendance would be marked. No matter you chose a correct or an incorrect answer. For Padlets, the professor would ask some open-ended questions, or require us to draw some diagrams. It is quite fun to see other students' work.<br /><br />I spent a lot of time on the assignments. I could not get high marks in all of the assignments as I messed up too hard in module 3...<br /><br />The project rubrics were clearly stated before the project presentation. Thanks to my good groupmates, we got a high score (not the highest though)<br /><br />I did much revision before final exam. Thanks to my physics and chemistry background, I got pretty good results in the final exam. Finally got an A+.",
            "comment_workload": "There were 6 assignments. Each assignment took me so long to finish, but hard work pays off. I got nearly full marks in the assignments for module 1 and 2.<br /><br />Everybody has to finish a group project. Various themes about chemical engineering are provided, and every group can choose any research topic related to the chosen theme. The project is quite unnecessary to be honest. Nearly 50% of tutorials were used for group project discussions. It is pretty time-consuming.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "st5En1Se9LYXEyCnxL6KSZOyztOFBRkB",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "徵",
            "date": "Jan 06, 2021",
            "title": "靚grade但chur",
            "comment_content": "There are three chapters in this course:<br />1) Conversation Law and Material Balance <br /><br />2) Balance, motion, and storage of energy<br /><br />3) Pharmaceutical kinetics and transport<br /><br />The first chapter is secondary school stuff, which means you can handle it easily if you have taken Chemistry in secondary school. However, things began to become difficult since chapter 2. And the final is",
            "comment_teaching": "Prof. Chau is enthusiastic in teaching and always willing to answer your question.",
            "comment_grading": "Pretty good<br /><br />1) Class participation 10% <br />Zoom polls and Padlet posts.&nbsp;&nbsp;As long as you finish them, whether you're correct or not,&nbsp;&nbsp;you get full marks.<br /><br />2) Homework 20%<br />6 homework, each two for one chapter.<br /><br />3) Group project and presentation 30%<br />A group ( 5 students) chooses to solve a question from the six assigned area. A TA will be assigned to help your team. At last, your present your project in the class 3 times (Yes, it's 3 times, I'm not joking)<br /><br />4) Final 40%<br />20 difficult MC questions, huge time pressure<br /><br />As many other reviews on this course mentioned, comparing to other introductory courses, CENG 1000 is not an easy one. You have to put in much more effort to secure a good grade<br />(unless you're a genius).<br /><br />My score: <br />full class participation marks<br />17/20 for homework ( mean around 14/20) <br />87 for project ( mean 82.3 high 95)<br />14/20 for the final ( mean 9.9 high 17/20)<br />overall around 81%<br />It's true though I can't believe that I finally got A+.<br /><br />One of my groupmates, whose final score slightly above mean and homework score severely below mean, still got a B. So, the grade is pretty good.",
            "comment_workload": "heavy as an introductory course. <br />The 6 homework is quit annoying as most of them is not that easy. Be careful not making stupid mistakes in the final. As the final&nbsp;&nbsp;is all MC questions, any careless mistake will make you get 0 mark on that question.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FIM8eDvj6AjvtT07Zw4L2dQ4ZvCQi4jI",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Abshdjfj",
            "date": "Apr 25, 2020",
            "title": "",
            "comment_content": "we learnt the basic of chemical engineering <br />material balance and all sorts of thing <br />mostly formulating equation then substituting no to get the ans<br />not especially difficult, just time consuming to have to always attend lecture",
            "comment_teaching": "quite good ,enthusiastic",
            "comment_grading": "quite good <br />i did't do well in final but still got decent grade",
            "comment_workload": "-lots of calculation with 1 homework per week ,quite a lot<br />-time-consuming course, need to meet up with group mate every week at tutorial to discuss the design project<br />-a bit bother by not providing necessary value need to finish the calculation in hw",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kjEZDD2IzzAuQ4oY0In8Xii3SsP6I3WZ",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Beru",
            "date": "Feb 13, 2020",
            "title": "",
            "comment_content": "A decent introductory course although some may find the content a bit much. The course content is quite interesting especially module 3 but is taught poorly. The content starts off easily but as the course progresses becomes much harder to grasp, so if you are a slow learner, you will need to put in more work to understand it better<br /><br />3 Modules:<br />Module 1: Materials Balance<br />Module 2: Energy Balance<br />Module 3: Transport &amp; Kinetics<br /><br />You were assigned groups at the start of the course whom you would do your studio experiments with and chalk-talk questions.<br /><br />Studio:<br />There are 3 studios, 1 for each module, that were not really useful and wasted time. But you had to do a write up of that studio which was pretty easy to get a good score.<br /><br />Chalk-talk:<br />Mostly questions from the ppt where one person in the group has to answer and explain the solution to the whole class. Everyone must go up once.",
            "comment_teaching": "You are better off learning everything yourself or asking the TA's because she can't teach well. She just reads the ppt without really explaining anything. Most of the lectures are spent doing chalk talk questions.",
            "comment_grading": "Original grading:<br />30% - Quiz (2 best out of 3) <br />15% - Chalk-talk question presentation<br />15% - Studio write-up x3<br />40% - Final Exam<br /><br />Due to the situation occurring at that time, our grading became<br />40% - Quiz (2 best out of 3) &lt;-- (quiz = 10 mcq's)<br />15% - Studio write-up (Studio 1 &amp; 2)<br />45% - Final Exam (Online quiz)",
            "comment_workload": "Apart from the studio write-ups, there isn't any extra work. With the concepts getting harder throughout the course, you could do extra practice questions to make sure you understand the concepts thoroughly.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7KDoI4L0eJ82urT26HHGpR9yL4Wt8aKr",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "uha",
            "date": "Jan 22, 2020",
            "title": "Don't take this class haha",
            "comment_content": "Work, Energy, and Heat. <br /><br />The contents are pretty much confusing. She just starts teaching the contents without explaining in specific. I was just thrown in the river without anything. The contents are pretty abstract.",
            "comment_teaching": "I read all the reviews before taking this course, and I hesitated a lot. But at last I decided to take this, but that was a mistake. Believe in people who writes this review. Her teaching is like wtf. She doesn't care about the students. She blames TA for everything. She is late and she blames TA for not being ready. We ask any question, she's like &quot;go talk to TA&quot;. <br /><br />She also makes things really complicated. While you can just solve it in 5~10 minutes in your way, in her way it takes 30 minutes. Her way of solving problems is not very efficient in actual exams.",
            "comment_grading": "Grading is just normal I think. It just depends on how well you do on the exam. By the way you have to do studio-write up. Just answer all the chalk-talk questions. In that way you can get full marks. <br /><br />1. Quizzes<br />2. Chalk-talk question<br />3. studio-write up<br />4. Final<br /><br />for the quizzes just review the class chalk-talk questions. Since it is open note, you can just print out all the presentations with solutions.<br /><br />2. chalk-talk question is basically presenting how you solve the problem in front of the class. She draws the group number and one of the group members have to present. It's better to do this at the start of the semester as the semester goes on contents get more difficult.<br /><br />3. Studio-write up a.k.a. simple lab report. I just wrote it as my IB chem IA style. I always got full mark.<br /><br />4. Final : haha I really do not like online problem solving and i messed up. But as long as you study for the past papers, you should be fine.",
            "comment_workload": "workload wasn't that bad.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Hj7OipMsWkiFfuXknfulrwLOtl67H57Y",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ls0207",
            "date": "Dec 24, 2019",
            "title": "Be careful before you choose this course",
            "comment_content": "Topic 1: Introduction to chemical and biological engineering and material balance<br />Some brief to the subject of Chemical and Biological Engineering and concepts of material balance in reactions<br />Topic 2: Energy balance <br />similar contents with topic 1 but focus more on energy changes<br />Topic 3: Drug delivery and pharmacokinetics <br />Holly X! This topic is very difficult. Focus on the pharmacokinetics which calculates the time, amount of drug injected.<br /><br />In each topic, you will need to do a studio workshop ( something like an experiment) and make a write-up on it",
            "comment_teaching": "There's no tutorial for this course ( all of the tutorials will be used as lectures)<br />Prof. Chau will talk on the contents with some examples, then the chalk-talk question will be done by everyone in the class with their groupmates assigned.<br />Prof.Chau and the TAs are helpful and always answer the questions.<br />However, the information on the lecture notes seems to be not very sufficient",
            "comment_grading": "&quot;-&gt;&quot; refers arrangements after class suspension<br />Studio Write-up*3-&gt;2&nbsp;&nbsp;: 15%<br />Chalk-talk presentation ( best groups will have 2% bonus): 15%-&gt; 0%<br />Quizzes ( 2 best out of 3): 30%-&gt; 40%<br />Final Exam: 40%-&gt; 45%<br />My scores:<br />Studio write-up: 9/10<br />Quiz 1: 8/10<br />Quiz 2: 9/10<br />Quiz 3: 4/10<br />Final: 12/25<br />And I finally get an A-",
            "comment_workload": "The workload is not heavy at all, as you just need to do a studio write-up after each workshop, but if u want a good grade, you better study the chalk-talk questions before class and also study for the quizzes.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "h4Yf68VOOTQdtwNVl9MFRYBi7qFkR8hQ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ILY3000",
            "date": "Nov 21, 2019",
            "title": "DO NOT TAKE THIS COURSE IF IT IS YING CHAU",
            "comment_content": "The beginning of the course seems easy, so do not be falsely encouraged to take the course. <br /><br />She tries to cram the ENTIRE syllabus of chemical engineering into this one course. Even my current friends who are in year 2 of chemical engineering find their classes easier than CENG 1000. Definitely NOT an intro class. Only take this class if you will persevere through it, and you are definitely SURE you want to take chemical engineering.<br /><br />This class is a GPA KILLER if you are not good at chemistry or problem solving.",
            "comment_teaching": "Her teaching is terrible. She makes easy concepts so much more difficult to learn. My friend taught it to me so much better than the professor did. <br /><br />Her teaching pace is super fast and she expects everyone to keep up with her.",
            "comment_grading": "Quizzes 15%<br />Only takes the scores of the two best quizzes (best two of three)<br />My result 6/10 7/10 4/10 (below mean)<br /><br />Homeworks 10%<br />4.x/10 (slightly below mean)<br /><br />Class participation 5%<br />IPRS every lessons<br /><br />I stopped attending her classes because I couldn't follow her teaching anyways, so I self-studied.<br /><br />Projects 30%<br />I found responsible and smart group mates. Will require a bit of video editing skills. In our project, we got C, which is not bad. The requirements for this project are so vague and I don't know how she decided the winning projects. <br /><br /><br />Final 40%: The final exam tests everything. If she says something won't be covered in the exam, DO NOT believe her. She even asked about the history of chemical engineering which she said she WOULDN'T ask. The final was super hard. I settled and was happy with 3x %, and got a C overall for the class.",
            "comment_workload": "The workload is pretty crazy. There is homework given after every class and the homework is not easy either. Each homework takes a couple hours to do (after the first few homeworks). Do be patient when you are doing the homework and avoid careless mistakes. Even if you spend a lot of time doing the homework, do not expect good scores. Many arguments were made when I took this course because of disagreements with the TA because of the assumptions taken when doing homework. <br /><br />The project did not help at all. Sure, it may have helped you develop some &quot;creativity&quot;, but it did nothing to help you learn to course material. Honestly, I don't know why the teacher added the project section in this class. <br /><br />There are three quizzes and you should try your best in the first 2 because the third one is really hard. Be prepared to spend a lot of time studying and preparing for the quizzes by reviewing homework questions and even doing the extra questions she provides.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nQItcS3gJnbzp8JPLvibrGgXJ7RWN1AK",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "buzzybtlkf",
            "date": "Nov 17, 2019",
            "title": "",
            "comment_content": "In general, I would say this is a relatively difficult introduction course compare to the others. There are 3 modules in total: material balance, energy balance, <br />and pharmaceutical industry.<br />You may find the content during the add drop period pretty easy and straightforward, but trust me, that is not the case.<br />From my point of view, only take this course if you think you are interested in chemical engineering and you wanna know more about it. If not, don't waste your time here.",
            "comment_teaching": "Professor is really passionate and effort can be seen during her teaching. Questions are welcomed. However, dont only rely on the slides, they are lack of details.",
            "comment_grading": "Due to the current situation of HK, the grading policy changed a bit by removing the chalk talk part. But supposed, it should be like:<br />- Chalk talk presentation - 15%<br />- Quiz (2 best out of 3) - 30%<br />- Studio write-ups - 15%<br />- Final exam - 40%",
            "comment_workload": "Chalk Talk presentation: After the add drop period, you will be split into groups randomly. During each lecture, there will be a few chalk talk questions in which the professor will randomly pick a group and you need to send one group mate out to present and answer that question. <br />Quiz: open book; there will be 1 for each module. Remember to really go through the chalk talk questions and even the studio make sure you know them well. I will also suggest you to bring along the slide notes with you.<br />Studio write ups: For each module, there will be 1 studio experiment and you are expected to write a 1-2 page of summary/evaluation afterwards. I would consider this to be the easiest part of the course.<br />Final exam: Open book as well.<br /><br />Btw: quizs are all mc questions; no attendance but since there are chalk talks, I do suggest you to attend every lecture if you can.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WOtZMddA2CqeCCLIPCe2jeRf0lGrGZFX",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Aanas",
            "date": "Oct 21, 2019",
            "title": "",
            "comment_content": "It was a great introduction to chemical engineering. He introduced everything that was necessary for us. The amount of content can be considered to be small when you compare it to other courses but the Professor included guest lectures to improve our understanding of chemical engineers",
            "comment_teaching": "He was great. The best thing was that his English was greta. You could understand his concepts very well. We had TA as well for groups of 5 so you could ask question from them as well.",
            "comment_grading": "The grading was easy. I would say that it was fairly easy to get a good score in the course if you worked hard enough",
            "comment_workload": "workload was fine. though the project was unnecessary",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "30XurdRT30kEm53sMrhOelPhWnnCzpIW",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "lemonteaxd",
            "date": "Oct 02, 2019",
            "title": "",
            "comment_content": "It covers material balance, thermodynamics and pharmaceutical Kinetics. It is like the combination of physics, chemistry and biology.",
            "comment_teaching": "The instructor was quite nice but too boring.<br />Sometimes, there would be a guest giving a speech and you have to pay attention what the guest talked because there was iprs after it.",
            "comment_grading": "mean was high in final exam.<br />i got a very good marks in the project thanks to a nice group.<br />The assignments were nearly full marks.<br />The quizzes were easy too.<br />However, the exams were really hard.<br />This results in why low grade.",
            "comment_workload": "workload quite heavy. Many assignments per week.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jMsmiTAZem03fpN5F7iLGJrZ0Q6fii4Y",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Jsugiarto08",
            "date": "May 13, 2019",
            "title": "",
            "comment_content": "Content is appropriate, consisting of material balance, energy balance, and kinetics.",
            "comment_teaching": "to be honest, she is knowledgeable, but her teaching is quite boring. She did not go to the area which most of the students are interested about, instead she emphasize more on the calculation.",
            "comment_grading": "Grading is quite good, knowing I scored very low on my finals. But, it really helps since my group won the project. Got a B- even though got trash scores on quizzes, midterm, and finals.",
            "comment_workload": "Workload is 1 HW per LECTURE. Not too long until I found myself start copying my friend's homework. But, if you had done it by yourself, it pretty much helps you to study for finals.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9lxSt3SoMSBN6p0o0hD13YnsqRtpk8JC",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "M.K",
            "date": "Jan 31, 2019",
            "title": "It's a difficult Introductory level course",
            "comment_content": "There are 3 modules for this course:<br /><br />Module 1: Chemical Industry, food industry and materials balance<br /><br />Module 2: Energy industry and energy balance<br /><br />Module 3: Pharmaceutical industry, transport and kinetics",
            "comment_teaching": "I didn't understanding much of instructor's teaching. And you cannot rely on the powerpoint slides as well, because they are very overly simplified and cannot give you much information about the contents. Plus you will find a lot of copy &amp; paste within the lecture powerpoints within the same module.",
            "comment_grading": "The grading policy for this course is as followed:<br /><br />1) Class participation (5%) - Utilize in-class iPRS to take attendance <br /><br />2) Homework (10%) - One homework set per week<br /><br />3) Quizzes (15%, best 2 out of 3) - 3 in-class quizzes after each respective module.<br /><br />4) Project (30%) - A group project with presentation required<br /><br />5) Final exam (40%) - An openbook exam with MCs and long questions",
            "comment_workload": "The course consists of the following:<br />1) Weekly assignments<br />2) Group Project<br />3) Quiz X2<br />4) Final Exam<br /><br />Personally I felt the workload was pretty heavy for this introductory level course.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NPqCGzZLsNRvlqT4GTLa9X93tSSfMsCU",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "SamLeungguy",
            "date": "Jan 24, 2019",
            "title": "Do you enjoy sleeping and a shit grade?",
            "comment_content": "Module 1: Food Industry and Materials Balance <br />Module 2: Energy and Energy Balance <br />Module 3: Pharmaceutical Industry and Pharmacokinetics",
            "comment_teaching": "Honestly, I don't know what I have learned in the class, The professor&nbsp;&nbsp;&nbsp;just follow the powerpoint and you have to attend just for iprs.",
            "comment_grading": "Class participation (5% (3% for iPRS and 2% for peer grading))<br />Homework (10%)<br />Quizzes (15%, best 2 out of 3)<br />Project (30%)<br />Final exam (40%)<br /><br />Statistics<br />Quiz 1:&nbsp;&nbsp;&nbsp;Mean&nbsp;&nbsp;- 6.3/10 <br />Quiz 2:&nbsp;&nbsp;&nbsp;Mean&nbsp;&nbsp;- 4.5/10 <br />Quiz 3:&nbsp;&nbsp;&nbsp;Mean&nbsp;&nbsp;- 6.26/10<br />Project:&nbsp;&nbsp;Mean&nbsp;&nbsp;- 73.1/100 <br />Final:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mean - 46.4/100 <br /><br />Mean is about B-",
            "comment_workload": "The workload is quite heavy, almost one assignment every single lecture. 2 marks for correct answer, 1 marks for incorrect. The assignment is quit hard, you will cry if you have no source. And there is a project. In a nutshell, good luck to you.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GG5vi0PCKPZBUc1OkrRrsPxwcEVu5OXv",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JerJerB",
            "date": "Jan 20, 2019",
            "title": "OK",
            "comment_content": "It is an introduction course in chemical engineering.",
            "comment_teaching": "There are sharings and talks that will also be examined in the final examination.",
            "comment_grading": "Homework\t10%<br />Assignments\t0%<br />Quiz\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;15%<br />Class Participation\t5%<br />Project\t30%<br />Final Exam\t40%<br /><br />Quizzes and finals are open book.<br /><br />**Personally think that Quiz Grades are more important.",
            "comment_workload": "Not quite much workload.&nbsp;&nbsp;<br /><br />In each week, it contains one to two simple homework and will be counted every homework.<br /><br />In-class iPRs are also counting as participation grades.<br /><br />Group project requires a 15 minutes long video for specific topics, including some own analyse, phenomenon studies.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0dxg8ShGP85TDye2BApGXYiCiXLKeITT",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cl377",
            "date": "Jan 19, 2019",
            "title": "",
            "comment_content": "Module 1: Food Industry and Materials Balance <br />Module 2: Energy and Energy Balance <br />Module 3: Pharmaceutical Industry and Pharmacokinetics",
            "comment_teaching": "CHAU, Ying is a great teacher. Detailed explanation and helpful instruction. You will understand the content as long as you paid enough attention during lectures.",
            "comment_grading": "Class participation (5% (3% for iPRS and 2% for peer grading))<br />Homework (10%)<br />Quizzes (15%, best 2 out of 3)<br />Project (30%)<br />Final exam (40%)<br /><br />For me:<br /><br />Quiz 1 : 6/10<br />Quiz 2:&nbsp;&nbsp;&nbsp;4/10<br />Quiz 3 : 8/10<br /><br />project: around 80 %<br /><br />Final: around 60%<br /><br />Got an A",
            "comment_workload": "Personally I think the workload was quite heavy . The project was really important as it can help a lot if you did not perform well in final exam. The quiz is not really difficult. You need to go through all the example and homework from the lectures. Then you should be able to score most of it. There are also assignments around once a week. These are&nbsp;&nbsp;easy assignment. The final exam is very difficult. You have to make sure that you completely understand the concept taught during lectures. Otherwise, you will feel helpless when you face the calculation problem. If you can't understand the question, then you won't be able to perform correct calculations.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FHmZOgJp0gs89sojcJmgOvo0H51r7wfw",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "bbbbbbel",
            "date": "Jan 13, 2019",
            "title": "",
            "comment_content": "3 Modules:<br />Module 1: Food Industry and Materials Balance <br />Module 2: Energy and Energy Balance <br />Module 3: Pharmaceutial Industry and Pharmacokinetics",
            "comment_teaching": "The professor is very nice but she couldn't explain things clearly. A lot of people got confused when she introduced a new equation in module 2 and 3. And the powerpoints are quite crappy, a lot of pictures but too little explanation. But you can learn how to use the equations on your own, you just need to spend some time to understand how she did the example questions.",
            "comment_grading": "Class participation (5% (3% for iPRS and 2% for peer grading))<br />Homework (10%)<br />Quizzes (15%, best 2 out of 3)<br />Project (30%)<br />Final exam (40%)<br /><br />Statistics<br />Quiz 1:&nbsp;&nbsp;Mean - 6.3/10 <br />Quiz 2:&nbsp;&nbsp;Mean - 4.5/10 <br />Quiz 3:&nbsp;&nbsp;Mean - 6.26/10<br />Project:&nbsp;&nbsp;Mean - 73.1/100 <br />Final:&nbsp;&nbsp;Mean - 46.4/100 <br /><br />My score <br />Quiz 1: 10/10<br />Quiz 2: 12/10 <br />Quiz 3: 10/10<br />Project: 82.79/100<br />Final: 74/100<br />Final grade: A<br /><br />One quiz for each module and you have 30 minutes to complete one quiz. The quizzes weren't very difficult, and you can get full mark easily if you can apply the equations correctly. Btw, all the quizzes and the exam are open book and open note, so you don't need to memorize anything from the lecture notes. <br /><br />The final exam consists of 10 MC and about 4 LQ, and the time limit is 3 hours. The MC part asked about very subtle things from the lecture notes and the content of the lectures given by guest speakers. So you should probably print out all of the useful slides from the lecture notes if you want to secure the marks from the MC part. The LQ part is pretty complicated and involves a lot of calculations, I finished the paper just in time.<br /><br />The grading for the group project is quite lenient, the professor gave every group eighty something. But if you aim for higher marks, you can use some editing software to make the project video (like filmora) coz the professor prefers graphics over content of the video.",
            "comment_workload": "The workload is quite heavy, almost one assignment every single lecture. <br /><br />The weekly tutorial is for doing the group project, which is just useless and time-wasting. But you still need to attend every tutorial as your group need to fill in a meeting log that record the attendance.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kcsc9nn5sMuQtN6FDDRJ6KB5rfEmQcu2",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hahanah",
            "date": "Jan 03, 2019",
            "title": "",
            "comment_content": "3 Modules:<br />Module 1: Food Industry and Materials Balance <br />Module 2: Energy and Energy Balance <br />Module 3: Pharmaceutial Industry and Pharmacokinetics<br /><br />Each module has 1 quiz.<br /><br />1 group project, a 15 min video, topic chosen from the following 6 areas:<br />Area 1: Food waste to useful product<br />Area 2: Portable water or air purifier<br />Area 3: Renewable energy for transportation<br />Area 4: Toilets for the 21st century<br />Area 5: Advanced materials for clothing <br />Area 6: Artificial organs and regenerative medicine<br /><br />1 final.<br /><br />Quizzes and finals are open book.",
            "comment_teaching": "Module 2 &amp; 3 are quite formula heavy. Took forever to understand the concepts.<br />The course requires you to completely rethink chemical concepts in a different light.<br />Pay attention to anything and everything. Prof Chau explains OK but the bulk of understanding will come from yourself.",
            "comment_grading": "Class Participation - 5% (3% iPRS + 2% Peer Grading for Project)<br />Homework - 10%<br />Quizzes - 15% (Best 2 out of 3)<br />Project - 30%<br />Final Exam - 40%<br /><br /><br />Make sure to do good in your project, it will be a major carry for the rest of your grades! But... if your group has freeriders, then hAHaHA &quot;you are f*cked&quot;, quoted from another review and experienced personally by me. Only advice for this, follow the rubric and make your video as interesting as possible. (95/100)<br /><br />Homework was challenging. Advice for this would be to understand the problem and draw systems for everything. In case of unclear wording, send email. Prof &amp; TAs are willing to answer.<br /><br />For the 3 module quizzes, only 2 will count towards the final. You can probably read the other reviews to get a sense of the mean and SD of this semester's quizzes.<br />Around 20-30 mins. to complete each quiz. You will be scrambling to complete and check your answers.<br />This semester, Prof. Chau implemented bonus points for each quiz. Some people actually got full marks + extra, resulting in scores of 12/10. I was like wtf m8 how???///???<br />Also, the grading for each quiz was delegated to a different TA. Grading somewhat depends on how nice and lenient the TA is. If you are not satisfied with the grading, you can go to the review sessions after each quiz to &quot;argue&quot; (quoted from email) with the TA.<br />(8/10 ; 7/10)<br /><br />For the final, just do your best. Try not to cry. 3 hours of pure hell. Experience the 5 stages of grief afterwards, or nothing if you're as mentally drained as I was. Since it is open book, don't take chances. Bring both consolidated notes and print. fucking. everything!!!! (66/100)<br /><br />(total score, ~81/100. A)<br />Fair grading so an A it is for this section.",
            "comment_workload": "Hard work pays off. <br />Really. <br /><br />Especially for the project.<br />I don't want to experience this ever again LMAO<br /><br />PS, for the people who want to use the &quot;suggested&quot; textbook for exam review. Don't. Minimal correlation with the exam problems, will just increase your self-doubt exponentially. <br /><br />Good luck, future chemical engineers. Fall 18-19 class salutes you. Fare thee well.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BziPYwhFDDbSZ6J7KwHVJGDQt6Wb63N8",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ayir",
            "date": "Jan 03, 2019",
            "title": "Proceed with caution...",
            "comment_content": "The course is split into three modules in terms of learning, and on top of this you will also have a group project. <br /><br />Module 1: Food Industry and Materials Balance <br />Module 2: Energy and Energy Balance <br />Module 3: Pharmaceutial Industry and Pharmacokinetics<br /><br />Group Project: <br />The group project requires you to think of a solution towards a problem that comes from 6 different areas. My group did ours in cell regeneration and artificial organs. Pick the group project topic carefully as it must cover a range of things. <br /><br />Overall the topics are interesting, but can be quite difficult.",
            "comment_teaching": "In terms of learning, the beginning of the course is quite good but the pace picks up exponentially during midterm season, which throws many students back as they do not have adequate time to understand so much new material whilst doing multiple exams at the same time. <br /><br />Professor Chau uses slideshows every lecture, which can be useful for those who like to make notes using the slides. Be warned that the content and the slides become increasingly hard, and you will have to dedicated a lot of time towards revision if you do not understand things immediately, as there is no time to revisit tough parts of the course (particularly, in my course, students had issue with complex energy balance and pharmacokinetics).",
            "comment_grading": "The course grading is split up into:<br />- Module 1 Quiz<br />- Module 2 Quiz<br />- Module 3 Quiz<br />- Group Project<br />- IPRS<br />- Homework Assignments <br /><br />The quizzes are worth 15%, and the best 2 of 3 quizzes scores are taken into consideration. The final is worth 40%. Homework assignments are worth 10%, and graded out of 2 points. <br /><br />Grading for assignments are quite harsh - out of 2 points and any small error will cost you 1 mark, leaving you with 50% less. The homeworks get progressively harder, which makes it even more frustrating. <br /><br />Group project can be a pain for those that prefer to work independently, and for those who have a lot of free riders in their group. It is doable if you get lucky with a good group. <br /><br />Final exam was extremely tough, with a low mean. Quiz 1 was okay, but Quiz 2 and 3 had generally low means. <br /><br />As long as you do enough of the IPRS questions, you will get all the participation marks.",
            "comment_workload": "Workload is very intense. Not only do you have a group project, but you also have 3 very long and hard modules to work towards near the end of the semester. <br /><br />Every lecture will have an assigned homework, so there are 2 homeworks every week for the entire semester, up to 21-22 homeworks overall. This is quite a lot to manage near the end of semester as the group project and final exams are also nearing. <br /><br />The group project, for me, was unnecessary stress. It did not teach me very much about Chem/Bio Engineering and was a pain to do during such a busy season due to the nature of my group.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aXWfVeSsgEJUc5K1qGEM8aV5hoevPhWe",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Luweegee",
            "date": "Jan 02, 2019",
            "title": "Moderate Content, High Workload",
            "comment_content": "The course materials are generally interesting. The amount of content is alright as it doesn’t contain too much topics to be learnt. The course mainly focuses on three main modules and concepts, but the questions can get extremely difficult and tricky. <br /><br />===Content=== (** = important concept &amp; equations)<br />Module 1: Chemical Industry, Food Industry &amp; Material Balance<br />• Production of High Fructose Corn Syrup<br />** Material Balance at steady state (In – Out + Production – Consumption = 0)<br /><br />Module 2: Energy Industry &amp; Energy Balance<br />• Energy types (Primary vs Secondary) &amp; Energy units<br />• Forms of Energy (Internal, Kinetic, Potential, Work)<br />** Energy Balance in steady state<br />** Enthalpy &amp; Internal Energy of ideal gas &amp; incompressible liquids<br />** Energy change in reactions (Enthalpy change of reaction)<br /><br />Module 3: Pharmaceutical Industry, Transport and Kinetics<br />• Types of drugs &amp; Production<br />• Drug delivery<br />** Drug Kinetics (Differential equations &amp; Material balance)<br />** Passive &amp; Facilitated Diffusion <br /><br />===General Comments===<br />This course can give you overall insights of chemical engineering, which involves a lot of material and energy balance. You can learn some equations to solve related problems. However, the content can get difficult as professor literally teaches Year 2 chemical engineering stuff and differential equations. The stuff you'll learn also isn't too useful in other engineering fields...<br /><br />I think the content load is moderate as you just need to know the material and energy balance equations, and drug kinetics equation. The hardest part have to be the diffusion part in Module 3 as the concepts are very hard to understand, while material balance in Module 1 is the easiest since you apply the same equation again and again.<br /><br />Professor generally loves to invite post-graduates to share their research field and guests speakers working in the chemical engineering field. They give a lot of insights to the industry, but it's kinda boring if you're not interested.",
            "comment_teaching": "===Teaching===<br />She can explain concepts in clear way and show us how the formulas are deduced. She also explains the notation used to avoid confusion (like the use of brackets in energy balance)<br /><br />She also demonstrates how the questions are done by writing it on paper and asks us if we have any questions after class through iPRS. She also held a review session for final exam.<br /><br />The bad thing is that she sometimes expect us to have decent background information. She LOVES not giving important information or not telling us to make assumptions in homework, which can get really frustrating. She also didn't explain the diffusion part in Module 3 clearly and it's very easy to get confused.<br /><br />===Lesson Atmosphere===<br />The lesson atmosphere is very relaxed :D Professor sometimes play music before lessons and during lessons (in short breaks). She'll make jokes and analogy during lessons and also invite students to come at the front for demonstration (of how diffusion works).",
            "comment_grading": "The great thing is that YOU DON'T NEED TO MEMORIZE ANYTHING! All the quizzes and final exam are OPEN-BOOK!<br /><br />You can get a good grade already if your score is above mean. I heard people saying you can get A- if your score is around 1 SD above mean but I'm not too sure... The mean for quizzes and final exam is generally low so if you do good, then you can get very high marks above the mean.<br /><br />===Grading===<br />Class Participation - 5% (3% iPRS + 2% Peer Grading for Project)<br />Homework - 10%<br />Quizzes - 15% (Best 2 out of 3)<br />Project - 30%<br />Final Exam - 40%<br /><br />===Statistics===<br />Quiz 1:&nbsp;&nbsp;Mean - 6.3/10 ; SD - 1.93<br />Quiz 2:&nbsp;&nbsp;Mean - 4.5/10 ; SD ??<br />Quiz 3:&nbsp;&nbsp;Mean - 6.26/10<br />Project:&nbsp;&nbsp;Mean - 73.1/100 ; Range: 0 ~ 95<br />Final:&nbsp;&nbsp;Mean - 46.4/100 ; Range: 0 ~ 86<br /><br />===My Scores===<br />Class Participation - 5/5<br />Homework - 8.08/10<br />Quizzes - 13.5/15 [Quiz 1 - 9/10 ; Quiz 2 - 9/10 ; Quiz 3 - 8.5/10]<br />Project - 25.81/30 [Raw Score: 86.03/100]<br />Final - 31.4/40 [Raw Score: 78.5/100]<br />-------<br />Final Score: 83.79<br />Final Grade: A<br /><br />===Quizzes===<br />You'll have a quiz when the professor finishes one module. You got 30~40 minutes to complete the 10 marks paper. The difficulty is fine. The quizzes are OPEN-BOOK and OPEN-NOTES so you don't need to memorize anything :)<br /><br />Be sure to do your best for the Module 1 quiz because that quiz is the easiest! <br /><br />===Project===<br />Oh god the project is so freaking annoying. You need to pick a theme of your project in the given ones and present your team's solution to the problem you've picked in a 15 minute video.<br /><br />Our team picked the problem to be solved is food waste problem and we make a video on how we can convert food waste into plastic bags :( If your team have free-riders then congrats, you are f*cked. [More on this in the workload section]<br /><br />===Final Exam===<br />The final exam is SO F*CKING DIFFICULT! You got 3 hours to complete 10 MC and 4 LQ.<br /><br />For the MC, they ask the smallest details in the lecture notes like the use of water in producing corn syrup :( They also ask about which topics are not covered in the guest speaker lectures... Now I regret falling asleep in that talk :P<br /><br />For the LQ, first question asks about the themes of project-winning teams. Just write the themes down in your notes. Next, you got 1 question for every module (So total you have 3 questions). Each of them are so painfully difficult that will make you question why you enrolled this course in the first place. The question types are completely new and it's a disaster (Much difficult than the sample final papers given to you)<br /><br />I'm generally surprised to get 78.5 marks in the final to be honest. Also the mean of the final exam is low :(",
            "comment_workload": "The workload is so freaking high when compared to other Year 1 courses. Professor Chau loves to annoy and torture you with different methods!<br /><br />===Homework Workload===<br />Basically you need to submit one homework for nearly EACH lesson. Sometimes you need to submit a short paragraph describing the chemical engineering stuff you felt 'interested' and sometimes you do calculations. <br /><br />The most frustrating about the homework is that the calculation problems are missing SO MANY important information. Especially for the diffusion problems,there's no way you calculate anything as you need to freaking ASSUME values for some constants in the equation. How the hell am I supposed to know that?<br /><br />===Project Workload===<br />The project is so frustrating. The TAs demand you to create a new stupid Instagram account to post your photos during meetings with your teammates so that they can give you participation marks. You need to fake photos and post them regularly after there's a weekly tutorial session (The tutorial is for you to discuss with your teammates). The whole Instagram thing has turn into a place for spamming photos and competition of which team is the most active.<br /><br />At the end, you need to hand in 15-minute long video featuring background information, your chemical process and the pros and cons of this process. If you want to get higher marks then you need to animate your stupid video using Powtoon and also edit your video. <br /><br />===Studying Workload===<br />The studying workload mainly comes from drilling questions from the 6 mock final papers given to you at the very beginning. It's frustrating to get the questions wrong all the time :(",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "z3duZL3LofOZAxmuOU4j6ymyK9KtXtP5",
                    "name": "Lecture 1 - Introduction to course",
                    "format": "pdf"
                },
                {
                    "key": "cA2Xn9bkryU6NF4b6JYMURbVJeJTnCd3",
                    "name": "2017 Final Solution",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "6FVGnSjy00ojXnsFluE0VLSDH3yCVaqN",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "LMM",
            "date": "Nov 06, 2018",
            "title": "Never is a good grade course again, dont choose CENG",
            "comment_content": "introduction course of Chem.ENG teach like 2000-3000 level major course.<br />not introduction<br />3 big section <br />1. Material balance<br /><br /><br />2. Energy balance (Thermodynamics)<br /><br /><br />3. Pharmaceutical Industry, Transport and Kinetics<br />with stuck project<br />***each lesson per 1 homework***",
            "comment_teaching": "DON'T CHOOSE CHEM ENG department as you major department<br /><br />DON'T CHOOSE CHEM ENG department as you major department<br /><br />DON'T CHOOSE CHEM ENG department as you major department<br /><br />(so important which i need to say 3 times)<br /><br />only copy by the notes from Henry Lam<br />stuck teaching but personal is very well<br />so IN CONCLUSION<br /><br /><br />DON'T CHOOSE CHEM ENG department as you major <br /><br />if u want have better future life like job or good grade for academic<br />choose IEDA is much more better than CENG<br />THIS DEPARTMENT IS GOING TO COLLAPSE!!!!<br /><br /><br />If Henry teach this course i think i will much more better!!!!!!!<br /><br /><br /><br />For TA part ,<br />Some Chinese TA you ask for question ,he/she don't&nbsp;&nbsp;ans u and always like just wake up in every moment<br />Only the Indian and the Korean TA will ans your question in detail way which make you can learn the thing from 0 to 100",
            "comment_grading": "5% ~~attendance/participation almost iPRS<br />***need to iprs and grading to other group project***<br /><br />10% homework<br />difficult if you have source that you know you will better<br /><br />15% quiz 2 of 3<br />quiz always play 9 you not let you know what she want to do<br />Little bit hard<br /><br />30% project<br />not relate to CENG topic group will good grade<br />highly relative to professional CENG topic will fXXk up and below mean&nbsp;&nbsp;<br /><br />40% final<br />If your TA good than good mark<br />If your TA suck/silly than (you know)",
            "comment_workload": "very high workload<br />1 week around 2 assignment //<br />1 lesson 1 assignment<br />but only let you get 2 mark/ 1 mark /0<br />some stuck TA will give you 1.5mark I donno why<br />some good TA will always remind you to let you know how to get full mark in Homework<br />almost have 20 -23 of homework<br />Project every week 1 meeting for project<br />which in the tutorial section",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "UicTJLnM8XvyhoKjCpA0IzpdtuCEFOrr",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MatthewChan",
            "date": "Jun 07, 2018",
            "title": "",
            "comment_content": "1. Material balance<br />2. Energy balance<br />3. Kinetics",
            "comment_teaching": "The professor is willing to help and give a lot of examples during lectures for the calculation part.",
            "comment_grading": "You can easily get a good grade even you are slightly below mean.",
            "comment_workload": "Each week will have around 2 assignments: some of them are tricky but they help you clear the concepts. Professor will discuss the answer of the assignment immediately right after the submission of assignments.&nbsp;&nbsp;Thus, you can clear the concepts immediately.<br /><br />For the project, 4 people in a group, in which you have to propose an idea related to the courses.&nbsp;&nbsp;You can do whatever you want.&nbsp;&nbsp;Meanwhile, a TA will be assigned to your group to keep track of your progress.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "W06nCziHfe5mtolRavJTsIApjMKiy1Rr",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "srastogiab",
            "date": "Jan 29, 2018",
            "title": "Recommended, especially if you are confused regarding major selection",
            "comment_content": "The course consists of 3 modules:<br />1) Material Balance<br />2) Energy<br />3) Pharmaceuticals<br /><br />The content is designed to provide the students with an overall view of what chemical engineering is like.",
            "comment_teaching": "Prof. Henry is really good and teaches passionately. The lecture slides a consist of interesting facts and historical details. He clears doubts really well and does not hesitate to repeat any concept if the class has not understood it well. He possesses in depth knowledge of the subject.",
            "comment_grading": "Pretty lenient and fair grading.<br /><br />Class Participation - 5%<br />Homework - 10%<br />Quiz - 15%<br />Project - 30%<br />Final Exam - 40%<br /><br />You will probably get A- if you are above mean in the final and project and score an A if you are 1 sd above mean.",
            "comment_workload": "It is very important to concentrate on the project and final. The Final is pretty hard compared to the examples given in class and the homework and hence clarity of concepts and practice from past papers is required. The class participation just includes grading the projects of others groups and the homework is also pretty simple but you got to do it on a weekly basis, i.e. after every lecture there is a homework question. You need to work hard on the project and do some research but the topics are interesting and you learn a lot. The good grading makes up for all the workload",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "luIZqmyp8QhGSEu9DEj8zntmPWvZ3fwP",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jaehun",
            "date": "Jan 22, 2018",
            "title": "CENG 1000 Review",
            "comment_content": "Most of the content is useful and worth to become a chemical engineer. The course is divided into 3 major sections. Each section requires one quiz. The content is consist of stoichiometry, thermodynamics, and pharmaceuticals. Most of content are easy enough to follow, but sometimes, you might need to review more time to sufficiently understand the concepts.",
            "comment_teaching": "The professor Henry is so passionate and enthusiastic. When you are in his class you will feel his passion and teaching mechanisms. Sometimes, you may feel that he is so smart that you cannot understand, but once you understand the concept you will notice he is a good professor.",
            "comment_grading": "The grade is mostly based upon your final exam and group project. There are quizzes in each section, but only 2 quizzes are counted. The final exam was specially hard for me, but other quizzes were okay. The project is really depending on group members and personal workload.",
            "comment_workload": "Although there is only one question per lecture, the question takes more than 30 minutes for me to solve. The homework is extremely challenging than the professor's example. Therefore, keep in mind that you have to review your homework.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uTMm5t65r5MPrCzc2AX63idR02PD2DUY",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anisha",
            "date": "Jan 21, 2018",
            "title": "Definitely recommended",
            "comment_content": "The content is divided into 3 main topics- food, energy and kinetics. It is well-designed and just right for the length of the semester. All the content is pretty straightforward and whatever is needed is given in the lecture notes which are available in canvas. There is no need of the book. <br />Moreover, the professor will invite quite a lot of guest speakers including other professors, alumni and his old friends or colleagues and the content in their lectures will also be tested upon in the final exam. There is also a group project on which you'll work on for 6 weeks. The concepts covered in the winning teams' projects will also be included in the exams. More often than not, he will even bring in slight historical facts and events related to the topic which I'd find pretty interesting.",
            "comment_teaching": "Professor Lam is excellent! He has good knowledge of whatever he is teaching and about teaching itself. He is very much approachable and answers all our questions. Before the final exams, he will hold review classes where he gives good tips which actually come in handy to prepare yourself for the finals. During the group project planning, he plays an active role in understanding how each individual group is progressing and is very enthusiastic to help.",
            "comment_grading": "You will probably score an A if you score above mean+SD. It is not very difficult to do so because all you gotta do is do all the assignments diligently, prepare for quizzes which are similar to the assignments and make sure you work well in a team during the project. Even then, mean is pretty low and if you work hard enough, an A is not unattainable.",
            "comment_workload": "Apart from the project, workload is pretty light. There will be assignments almost every week but they should take about half an hour to complete. Right before the exams, it is a good idea to practice ALL the past papers and quizzes in order to do well.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eDN9tr3rfQRto4VBXUYroGDW48u4V1Qj",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Victor Cheung",
            "date": "Jan 18, 2018",
            "title": "",
            "comment_content": "Topics talk about some basic chemistry, petroleum, soaps and detergents, plastics, oils and fats, natural products, product design, energy, food, sustainability. Seems like lots of stuff but just remembering the keywords is fine. You have to do some calculations about mass balance and thermodynamics.",
            "comment_teaching": "Professor NG is nice. He is experienced and helpful. He likes people asking questions and interacting with him.",
            "comment_grading": "Homework 10%<br />Midterm 20%<br />Term project 30%<br />Final 40%<br /><br />4 homework ~90%<br />Project&nbsp;&nbsp;90% (highest)<br />Midterm above 1sd<br />Final above mean10 marks<br />Overall ~ 80% =&gt; A+",
            "comment_workload": "4 homework total. However, each homework needed a lot of time for me to compete.<br /><br />You will be fine in studying midterm and final since he will provide past paper for you to study. Final will cover all materials including the stuff you have learnt before midterm. However, some questions are related to student's group project, you may need a bit of luck or you have to study all 14 groups' Powerpoint!",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kxZ2Yco5UIfbUqwnCWcaCsiowYSEWj2V",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "liu wai kwan",
            "date": "Jan 15, 2018",
            "title": "easy",
            "comment_content": "super easy<br />no much thing to memorize<br />about industrial chemistry process <br />students who studied chemistry and math should have no difficutlies in stuying this course.<br />but the part talking about the medical injection is quite hard to understand. <br />some calculation may include the&nbsp;&nbsp;concept of differetiation and integration. students who dun have clear concept of them may not understand very well, but it is ok to not understand ( by instructor ), as lobg as you remember how to use the equation provided in the notes",
            "comment_teaching": "henry is a good teacher who can answer everything u ask",
            "comment_grading": "project <br />quiz -&gt; 3 quiz , can bring notes<br />hw -&gt; after every lecture<br />final -&gt; can bring notes<br /><br />hw 97%<br />quiz 1&nbsp;&nbsp;&nbsp;&nbsp;10/10<br />quiz 2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10/10<br />quiz 3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;9/10<br />my project ranked no.1 <br />final : 77/100<br />got A",
            "comment_workload": "not much workload<br />hw is easy<br />quiz is easy <br />but final is quite hard<br />project is not very time-consuming<br />if your project is ranked no 1 , you will be invited for an presentation. by accepting to do so, extra score will be awarded to u. but you will have to answer teachers' and students question. peoject presentation is included in finals",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bThYLZc3sDa5AxCTnjRjcuU3SqBegWcN",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Alilem",
            "date": "Jan 09, 2018",
            "title": "",
            "comment_content": "Material Balance: similar to the mole calculation in DSE chemistry, but in a more systematic way, practice make perfect , you will find that u cannot get the right answers even though u have done the same question twice, don't be sad just practice more<br /><br />Energy Balance: Advanced studying on enthalpy, first law of thermodynamic in open system, require tons of time to digest and understand if u are really passionate in chemistry. However, exam is just exam(open book), its totally fine u just print out the formula&nbsp;&nbsp;and handle the easy questions without understanding .<br /><br />Pharma-Kinetics : the most interesting part in the course, talk about drugs and biology. I spend many time to digest the content but it turns out that exam is just an exam again, no need to understand, just use the formula or understand the mathematics part is okay.",
            "comment_teaching": "Very Good, Henry is nice and teaches with heart , best professor i have seen in my first sem in UST<br /><br />but i skip lessons as always<br /><br />btw many Korean engineering girls &lt;3",
            "comment_grading": "Super good grade, saved my gpa, henry is my boy god<br /><br />40%-Final<br />30%-Project<br />15%-Quizzes<br />10%-Homework(s)<br />5%-Class Participation <br /><br />forgot hand in hw once<br />participation 4/5 (never ans question in lecture haha)<br />quiz(best 2 out of 3): 1/10 , 10/10 ,9/10<br />project: below mean<br />final: 1.6 SD<br /><br />total ~&gt;80% A+<br />(if u want get A+, u need go back revise things in DSE chem because final exam may contain DSE content that have never mention during the course, so your chemistry sense is important )",
            "comment_workload": "Me Skip lessons , seriously don't do that<br />15 mins Project video maybe annoying , depends on teammate",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "47Owd32hbKH7ZtoTCiHqJBe9s3bMPovL",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "shirayuki653",
            "date": "Dec 29, 2017",
            "title": "An interesting intro course",
            "comment_content": "An introductory course for CBE<br /><br />Topics include :<br />0. History of chemical engineering<br />1.Food industry and material balance<br />2.Energy industry and energy balance<br />3.Pharmaceutical industry and drug delivery<br /><br />The materials covered can give me an overview of today's chemical engineering industry,&nbsp;&nbsp;and the reasons why chemical engineering is attractive.",
            "comment_teaching": "The professor is nice and patient, he is willing to answer students' question in detail.Also, he gave a lot of suggestions to our group project.<br />However, the symbols used in his notes are quite confusing.",
            "comment_grading": "5% participation<br />10% Assignment<br />15%quiz<br />30%group project<br />40%Final<br /><br />In fact, the method of grading caters both lazy and hardworking<br />students.Also, grading is quite lenient (Mean is probably B/B-)<br /><br />For me, I failed in two quizzes, got about 70% in assignments and projects, and above mean 0.5sd&nbsp;&nbsp;in final.Finally, I got a B.",
            "comment_workload": "Compared to other courses taken by year 1 SENG students, it is a bit on the tough side.There are 1-2 assignments every week and a quiz after finishing one topic, it is quite time-consuming if you are a slow-learner.Also, group project counts a lot, so you have to pay a lot of effort on it.Remember to attend tutorials to complete your project",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1TiXxm6dwu7UBjq1RwrGayWgKtARzS1e",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pranjal Mathur",
            "date": "Dec 29, 2017",
            "title": "",
            "comment_content": "A very insightful introduction to the large field of Chemical Engineering. The content covers 3 units: <br />1) Material Balance<br />2) Energy Balance<br />3) Pharma-Kinetics <br />Each unit begins with a historical introduction of the field including formulas, scientists and practical applications. This is followed by sample calculations and finally a homework assignment that is slightly similar yet more difficult then what is discussed in class. There are also PG or alumni sharing sessions that dwell more into the application of the knowledge that is taught in class.<br /><br />There are also quizzes at the end of every module's completion which is very similar to homework questions. <br /><br />The group project is a big part as well which allows students to chose a topic of their choice from the allowed list and form a real life application while presenting in a 15 min video. Winners of the group project get to present their topics and earn up to 5% extra grade<br /><br />The final exam(30% MCQs, 70% Long Questions) covers all units including the slides containing general and historical information as well as PG, Alumni sharing. Even questions about the winning group projects can come. The exam is open book, open notes.<br /><br />The content can quite easily be kept in track with however requires hours of work",
            "comment_teaching": "Prof.Henry is a very liberal and demonstrative instructor in the classroom and is even more helpful outside; always taking calls and replying to emails. <br /><br />The level of difficulty of the final exam however cannot be justified by the teaching style and course content covered in the classroom because of the very sudden rise in difficulty that is quite clearly seen. The professor should aim to provide more difficult questions in class or less difficult ones in the final",
            "comment_grading": "40%-Final: Mean was 48/100<br />30%-Project<br />15%-Quizzes <br />10%-Homework(s) <br />5%-Class Participation <br /><br />Although the grading pattern varies with every semester, in general, a 85% should be enough to secure an A grade",
            "comment_workload": "This course requires a lot of practice and application in order to achieve a good grade. It will take time to understand the terminology of the course and fathom the calculations involved but it can certainly be achieved.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "y7NGoluZDoP7f915nmGs3lzM4wM1c1Gw",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mcli",
            "date": "Dec 28, 2017",
            "title": "",
            "comment_content": "3 topics including Material Balance,Energy Balance and Pharmaceuticals,mainly about calculation and no need to recite since all quiz and exam is open book.",
            "comment_teaching": "He teach us with heart,he will invite guests to have guests lecture and let us know what a chemical engineer does in the reality.He will remember our name and he is really a good teacher.",
            "comment_grading": "Very good grade<br />There are 3 quizzes and final exam,no midterm<br />Quiz 15%(only the best two are counted)<br />Project 30%<br />Final 45%<br />Homework:10%<br />Participation:5%<br />For me,quiz full mark<br />Project about the mean<br />final above mean 0.5sd<br />73% something overall<br />A- finally<br />the final is much more difficult than the quiz,the mean of the final is only about 4x%.<br />However,even final below mean it is still possible to get a B.",
            "comment_workload": "homework is given after each lecture,we have to go to tutorial each week for the project<br />Project will spend you a lot of time<br />therefore the workload is quite high<br />Luckily,the exam and quiz is open book and it don't require many time to revise them.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nIhMvT7mA7zLMuXxMVkvzN4QTcHSoCb3",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "seis",
            "date": "Nov 14, 2017",
            "title": "Good intro course",
            "comment_content": "similar to highschool chemistry with some new concepts<br />split into 3 modules, <br />1. food<br />2.energy<br />3.pharmaceuticals",
            "comment_teaching": "Professor lam is very friendly and explains concepts clearly.<br />However, some calculations are not explained in detail and he goes over the steps very quickly.<br />He also pays attention to class participation so being active in class is helpful.",
            "comment_grading": "Lenient grading, almost garunteed to have full marks for quizes and homework which is 25% of the course.<br /><br />Group project 30%<br />Final exam 40%<br />class particupation 5%",
            "comment_workload": "Homework almost every lecture with a group project and quizes after each module.<br />Homework is usually short.<br />Project takes up alot of time due to mandatory tutorial sessions every week in the evenings.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fm1n389gqHvUXqAsptxJmmOt1CMEKhxU",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 34,
                    "name": "NG, Ka Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "OAO",
            "date": "Sep 09, 2017",
            "title": "Not a bad course",
            "comment_content": "　　內容主要都是關於manufacturing process，會列出很多technical terms ，有少部份以前會接觸過，大部分都沒見過，可以學到不少東西，不過不會每個terms都有詳細解釋，想弄清楚可以問教授／ＴＡ或上網看看。除了process, 還會教一件product 如何設計，推出需要考慮的因素，個人認為頗為有趣和受用。<br />　　考試方面。考得非常仔細，很多以為不會出的內容都考了，要會畫圖，也要計算，還有project content 也會考。<br />　　總而言之，是個好的課，不過希望能有多一些生活例子作為分析，比較能幫助解釋理論在生活中的應用與實踐。不過瑕不掩瑜，是個好課程。",
            "comment_teaching": "教授人非常友好，很樂意解答問題，教得很用心。<br />TA們都很好。全部都很nice.",
            "comment_grading": "好grade。肯複習就能拿好成績，算是比較簡單的課。<br />HW 10%<br />Project 30%<br />Mid Term 20%<br />Final 40%<br />Me:<br />HW ~87%<br />Project ~75%<br />Mid Term ~90%<br />Final ~80%<br />Total: ~82% A+",
            "comment_workload": "有點多。<br />homework:還是挺花時間的。<br />Project: 看你的運氣了。好的組員會做得開心舒服，本人很幸運只遇上了一個 半freerider，還有題目不同找資料的workload也不一樣。不過真的能學到很多東西。<br />Mid term + Final: 要複習的內容頗多，要記很多細節，不過記了就能拿分的話，還是值的。",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5h7ENr9hlcwP87TmVppBjQM34vcTZbj1",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 34,
                    "name": "NG, Ka Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Frontjai",
            "date": "Jun 17, 2017",
            "title": "A course that decide my major",
            "comment_content": "Topics talk about some basic chemistry, petroleum, soaps and detergents, plastics, oils and fats, natural products, product design, energy, food, sustainability. Seems like lots of stuff but just remembering the keywords is fine. You have to do some calculations about mass balance and thermodynamics.",
            "comment_teaching": "Professor NG is nice. He is experienced and helpful. He likes people asking questions and interacting with him.",
            "comment_grading": "Homework 10%<br />Midterm 20%<br />Term project 30%<br />Final 40%<br /><br />4 homework ~90%<br />Project&nbsp;&nbsp;90% (highest)<br />Midterm above 1sd<br />Final above mean10 marks<br />Overall ~ 80% =&gt; A+",
            "comment_workload": "4 homework total. However, each homework needed a lot of time for me to compete.<br /><br />You will be fine in studying midterm and final since he will provide past paper for you to study. Final will cover all materials including the stuff you have learnt before midterm. However, some questions are related to student's group project, you may need a bit of luck or you have to study all 14 groups' Powerpoint!<br />The group project is very demanding. You can not choose your group members, so you need a bit of luck for a good member. You have to submit an interim report around midterm, with 10 slides of powerpoint to introduce your product. You can not choose the topic. In the final report, you have to present a 10-15 min video about your product, and answering questions from the professor and classmates. You also have to submit your final powerpoint and a summary.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9doTX5RF3C14qivnSStvqCpV6d4i7dW6",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 34,
                    "name": "NG, Ka Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Vicchanccy",
            "date": "Jun 08, 2017",
            "title": "Good Grade",
            "comment_content": "The course has around 20 powerpoint files and mainly about physics calculation and very few chemistry background is needed. The content is fairly simple and straight forward, not many deep concepts are needed to be cleared. However, some hidden information is needed to pay attention and spell as the professor will taken those words in the powerpoint slides into the exam.",
            "comment_teaching": "The professor is a Hong Kong person and very care about what the students learnt in the lecture. The professor is very caring as well and very willing to share his experience with the students.",
            "comment_grading": "Very good grade. Even my project just barely mean but I can still get an A- in spring sem.",
            "comment_workload": "Homework: 10% (around 4)<br />Project: 30%<br />Mid term exam: 20%<br />Final exam: 40%",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eQF9tTPKNcbL68WwW8PExrq8tXjnw4lJ",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 34,
                    "name": "NG, Ka Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HokJa",
            "date": "Jun 08, 2017",
            "title": "Not as bad as i thought",
            "comment_content": "A lot to remember, quite difficult,<br />chemistry background and a little bit physics knowledge can help A LITTLE<br />little calculation (not easy as well)<br />prof will give you a proj title and you will do market research and so as the product design",
            "comment_teaching": "Prof Ng is very kind<br />He is passionate<br />since it is a 9am lesson so i dont really go to class<br />it is not a problem as prof ng mainly read the ppt",
            "comment_grading": "Grading is great!<br />HW 10%<br />Project(in a team) 30%<br />Mid term exam 20%<br />Final exam 40%<br /><br />HW got ~90%<br />Project got ~75%(mean is 6x%)<br />Mid term below nearly 1 sd<br />Final below mean few marks<br />Overall 62%<br />--&gt; B",
            "comment_workload": "4 HWs in total<br />The project is quite demanding: few meetings with TA(attendance is recorded), interim report, final report, video presentation(which is you record your video and it will be played in class, but still you need to attend that class as there is a q&amp;a session) and i heard a lot of groups have free-rider problem, it affects a lot since the proj is quite difficult<br />Mid-term and Final: testing your memory, just few calculations",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PX0ZucUOFceF717fNc5haHnGg0x9QXE2",
            "semester": "2013-14 Fall",
            "instructors": [
                {
                    "id": 34,
                    "name": "NG, Ka Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "qhuab",
            "date": "Apr 20, 2017",
            "title": "The course that led me to become a Chemical Engineer",
            "comment_content": "I took this course 3 years ago and I still remember some of the contents. This course:<br />1. Introduces what is Chemical Engineering and what Chemical Engineers do.<br />2. Introduces major principles of Chemical Engineering like material and energy balance, major unit operations like reaction and separation.<br />3. Incorporates economic consideration and analysis related to chemical production and plant design.<br />4. Explores major streams of Chemical Engineering including Food processing, Environmental engineering and Material science.",
            "comment_teaching": "Prof NG taught well. He displayed a professional image when telling students about Chemical Engineering, thanks to years of his industry experience. He did not rush in lectures and yet did not go into too much detail of each concept.",
            "comment_grading": "Wonderful as it was, the grading was not as nice. I understood the main concepts in this course but did not do well in both midterm and final because the exams tended to be difficult and detailed concepts covered in lecture notes were examined. I did not memorize the details. Also, some basic chemistry knowledge was examined too.",
            "comment_workload": "Workload seemed to be fine.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KSVWrK7vhlpfoJJEpfcusUSf2xeQ4yM4",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                },
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "canishu",
            "date": "Mar 23, 2017",
            "title": "Great course",
            "comment_content": "Great introduction to Chemical Engineering, the content in the course is pretty straight forward.",
            "comment_teaching": "good teaching by Prof. Lam, he would survey students about the pace and quality of teaching in the middle of the course, and fit the needs of his students that semester.",
            "comment_grading": "Overall grading is ok, got average scores in quizzes and the project. <br />Final exam score was 1.4sd higher than the mean, got an A",
            "comment_workload": "Homework every week: Pretty simple and easy<br />Project: make a video to provide solution to specific areas in engineering, manageable.<br />Quiz: a little challenging but only grade 2/3 quizzes.<br />FInal Exam: looked hard at first glance, but could be well off with revision.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NKXh76pdU5OFIviEmgDJ1i8Qf3bTbDDj",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                },
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Edith Chan",
            "date": "Feb 03, 2017",
            "title": "",
            "comment_content": "the course is divided into 3 parts<br />1. material balance<br />2. energy balance<br />3. pharmaceutical<br />and a lot of guest lectures by other professors or past students that graduated from chemical engineering to share about their occupations",
            "comment_teaching": "Both professors are very nice<br />they will upload all the powerpoints, notes, past paper and extra exercise on canvas<br />they will do some examples during lectures which make the concepts easier to understand",
            "comment_grading": "grading is quite good<br /><br />-3 short quizzes (15%)<br />can pick the scores of the best 2, and the quizzes are quite straight forward, around 20-30 minutes, the format of the quizzes are similar to the examples done during the lectures<br />-1 group project (30%)<br />-1 piece of assignment after every lecture (10%)<br />2 marks for every assignment, will have at least 1 mark if you have submitted something<br />1 lab work (the lab report is counted as 1 of the assignments)<br />-class participation (5%)<br />-1 final exam (40%)<br />(the final is much more difficult than the quizzes)",
            "comment_workload": "1 group project (the tutorial section is used for project discussion)<br />1 piece of assignment after every lecture",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BRlURaSlEXryinGvGAZdbgmYyXygyznB",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                },
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Emanuel",
            "date": "Feb 02, 2017",
            "title": "Lots of Canvas Homework",
            "comment_content": "Easy to understand content. There are various guest lecturers throughout the semester that give you an understanding on what chemical engineering truly is. The exam may include various facts or information on the aforementioned lectures. One thing I didn't quite like about the exam was the fact that it included trivial facts about the guest lectures or guest lecturers.",
            "comment_teaching": "Professor Lam (he prefers to be called Henry) makes the course interesting.",
            "comment_grading": "Quite lenient. If you are more extroverted or actively participate in class, you will get full participation marks.",
            "comment_workload": "Homework after every lecture. At first, it may seem easy, but after a while, it adds up and gets annoying.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PQgGbqRkIelTCpwDtgqVubt8gvCl9SzW",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                },
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "oxole",
            "date": "Jan 26, 2017",
            "title": "",
            "comment_content": "Not so easy, but somehow a little hard for everyone. It needs some time to get used to the complicated calculations, especially in the second-half of the course, while it's very easy at the beginning :(.",
            "comment_teaching": "Very very very very GOOD!!!!<br />I like Henry so much!!!!<br />He teaches so well!!!!<br />Almost everyone go for the class with attendance only counted for 5%.<br />Also he will ask for advice and suggestions to make this course better.",
            "comment_grading": "I think it's good enough thanks to my final.<br />BTW It is important to make the project video interesting for a higher grade!!",
            "comment_workload": "Some homework after class but not so hard.<br />The project adds a lot workload.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tgVlQ9K7uR3McpyXBRO35SopTUZ057UY",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                },
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "skwok16",
            "date": "Jan 20, 2017",
            "title": "",
            "comment_content": "quite interesting, many guest lectures",
            "comment_teaching": "teaching is split into two parts, first part by henry and second part by ying chau. they both are very clear about the content. although ying chau's handwriting is a bit messy and difficult to follow.",
            "comment_grading": "quite generous, only count the best two quizzes out of three. for the homework, if you completed it you automatically get 1/2.",
            "comment_workload": "workload is quite light. very short homework questions every week, one video project, three quizzes. if you pay attention in class you will be able to do the work.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jQHODcBvktLfIbsUjm7s0MuoJSeF8vCZ",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                },
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Centmank",
            "date": "Oct 11, 2016",
            "title": "Good Instructor, good grade",
            "comment_content": "The courses will be carried out half by Henry and half by Ying CHAU. <br /><br />The content include something important about the reality of chemical engineering, something about methods in chemical engineering and some calculation examples. <br /><br />Actually the content is interesting and the instructor are trying to use a interesting way to let all students understand all the principles in chemical engineering.<br /><br />However, Henry likes to release the PPT after every lecture. Be careful of this, which means you have few ways to preview before the lecture.<br /><br />Meanwhile, project is also an important part of this course. 125 people will be divided into 25 groups. And you can choose to be in a group that have you friends included. Henry will give you 6 different topic and every group can choose the topic freely.<br /><br />And tutorial in every week will give you chance to have a group meeting discuss about the final project. There will be a leader to collect what you've discussed in every group meeting.",
            "comment_teaching": "The teaching speed is proper I think, and the content is not so hard to understand and operate. The Instructor will give you some surveys to let you give them feedbacks about the whole courses, including teaching speed, teaching methods, contents and what you want to say to the instructors. Actually, they are real humble and attempting to make it better for every student.",
            "comment_grading": "Our grade is:<br /><br />Homework/Assignment: 10% of the Final<br /><br />Project(include two part: a title &amp; abstract and a video): 30% of the Final<br /><br />Quiz(2 of 3, choose the better two): 15% of the Final<br /><br />Final Exam: 45% of the Final<br /><br />The homework/assignment will not be so hard. At the beginning of a semester, the homework is always very subjective. And grading will be like: 0 = no answer; 1 = good try but the answer is not correct or any response; 2 = good answer or thoughtful response. That actually could be unfair......<br /><br />And otherwise, Henry will let TA and students to give a grade to your project video and presentation.",
            "comment_workload": "Homework will be released after every lecture but not very hard.<br /><br />You'll have 3 quiz on lecture with a reasonable difficulty, and the better 2 results will be graded.<br /><br />Project need you pay great attention and effort. You have to plan well and provide a good title. Then, make everything the best in the video before your presentation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uWKbwrkc0pteFvcWudgOrZCWZRW2bZNg",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "13chanj5",
            "date": "Sep 22, 2016",
            "title": "",
            "comment_content": "Suffers from the issue of teaching only the trivial, surface level aspects of the course, and not going in depth to the more interesting parts. Not as bad as the other introduction courses though.",
            "comment_teaching": "Teacher is pretty chill. His English is fine, and the lectures are interesting, given the relatively poor content. There's also a tutorial session if you really do need it.",
            "comment_grading": "The course is ezpz baby. Most of the concepts are relatively simple, and the math is also pretty simple. Not that difficult to get a B+ or above.",
            "comment_workload": "A large part of the grade involves a group presentation, which can take alot of time and effort. However, the grading of the presentation is relatively kind.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EW9MzNUuLZGickwoiaA4GZHJrDIQa4aT",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 34,
                    "name": "NG, Ka Ming",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "legendarychriz",
            "date": "Apr 24, 2016",
            "title": "Good grade but Extremely Heavy Workload, recommend to do this in fall semester",
            "comment_content": "Introduce what is Chemical Engineering.<br />This course talks from basics of Chemistry, to the chemical and physical principles of factories. It also discusses about sustainability issues.<br />Quite an interesting thing if you wish to choose CENG, CBME, CEEV as your future major.",
            "comment_teaching": "Not too much people will listen to the lecturer, and there will be 9 videos at the first session, it covers a lot about basic chemistry and chemistry which you have learned in DSE. It is better for you to choose this course with fundamental chemistry knowledge so that you will have less difficulties.<br />Beware: Some of the questions he discussed will be in mid term or final exam, so better listen although his tone is quite boring, so&nbsp;&nbsp;not recommended to skip lessons.",
            "comment_grading": "2% online quiz<br />13% Assignments<br />20% mid term<br />30% project (5% for the interim report)<br />35% final<br /><br />Mid term above 0.5 S.D.<br />But assignments completely eradicated my advantage in midterm, as I score quite low in assignments since I have no idea about the questions which require calculations.<br /><br />Project: mean is about 72/100 while i got 66/100<br />Final: mean is 32/60 while i got 28/60, i may have a chance for below 1 S.D. since the S.D. of midterm is about 4<br /><br />Good grade course, but need extremely hard work",
            "comment_workload": "4 assignment, it isn't much, is it? You're wrong. The assignments are extremely difficult, especially the calculations, the difficulty is slightly lower for tasks which require you to find the answer from the Internet, which the lecturer hopes us to do so. He wants us to find answers from the Internet, rather than listening to his lectures.<br />There are also quizzes at the first two weeks, but those are way too easy as all the answers can be found, no idea why someone can score a 0.<br />For the project, well, my group mates are not too active, I need to assign tasks by myself. The projects are actually easy, and information can be found easily from the internet, and advisors will give you some advice about your project, however I still do not understand some of its requirements. <br />The arrangement of final exam is driving me crazy.<br />THE FINAL EXAM WILL COVER ALL TOPICS DISCUSSED IN THIS COURSE!!! <br />I assume I need to study about 800 pages of power point slides, you can think about MECH 1906, more slides than MECH 1906, plus assignments and projects. YOU HAVE TO STUDY A LOT IN ORDER TO GET GOOD GRADES! It is appropriate that hard working can give you good grades, but the workload is WAY TOO HEAVY.",
            "rating_content": 5,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "I4V0HOQgbCBwfWVIuNjvf74NSQelpTBI",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jaehwang",
            "date": "Jan 25, 2016",
            "title": "Great course",
            "comment_content": "Interesting content, based on energy, drug delivery and heat transfer.",
            "comment_teaching": "In the case of Henry, he is known for his good teaching skill.",
            "comment_grading": "The grading is fairly easy. If you finish all the assignments and put an effort on the group project, it is easy for you to get a good grade. Although the final exam is a bit difficult, it is difficult for the majority that there should be no worry.",
            "comment_workload": "It has a pretty high workload. There are small assignments every week, although these take around 10 minute, it can be a hassle. Also, the group project can consume some time.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SmOkoEsSZelpkzQcRkQj4c52V9OJ712l",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sweetheart",
            "date": "Jan 04, 2016",
            "title": "",
            "comment_content": "The contents of the course are really interesting and actually pretty easy only if you understand. No to little science knowledge is needed for this course. <br />There are 3 main topics : Material Balance, Energy Balance, and Kinetics.",
            "comment_teaching": "His english is good and really understandable. He's really kind and friendly (?). But anyhow i find his teaching hard to understand sometimes. I think it would be better to read the lecture notes beforehand.",
            "comment_grading": "Compared to other subjects , the grading is much much better. If you get an overall score about the mean you can even get a B+.",
            "comment_workload": "3 quizzes : one on each topic. Actually pretty easy compared to the mock problems or final. Only the best 2 are taken towards the grade.(15% total)<br /><br />Project : done in groups, topic depends&nbsp;&nbsp;on the prof. Be sure to do good, as this is worth 30%. <br /><br />Homework almost every lecture. <br /><br />Finals : open-book. Problems similar to mock problems. <br /><br />The most important thing is to keep up with the lectures. Make sure to master the 'symbols' first! Dont wait till the finals to study everything, and you'll do alright.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Hjt1wtoepVl1xxY9AyKuRXXgTQ0Hzxru",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "siuka104",
            "date": "Dec 28, 2015",
            "title": "",
            "comment_content": "教3個module<br />Module 1: Food industry and materials balance&nbsp;&nbsp;&nbsp;<br />Module 2: Energy industry and energy balance<br />Module 3: Pharmaceutical industry and kinetics<br /><br />3樣都係著重計數 睇落難入手 不過睇多幾次就唔難理解<br />module1同2都係簡單solve unknown數學<br />module3會涉及calculus 不過無學過都無問題<br />功課同考試佢只會要求你列一開始條式 solve都唔洗你做",
            "comment_teaching": "超級有心既老師<br />好著重學生意見<br />有唔識可以問到你識 好有耐性<br />study leave會用上堂個個time slot比你返去問野 <br />每次quiz前都會比好多exercise同example",
            "comment_grading": "Project\t30%<br />Homework\t10%<br />Quizzes\t15%<br />Exam\t40%<br />Class Participation\t5%<br /><br />Project 有6個topic揀 會有TA比意見同guide<br />HW係每堂之後都會有功課canvas交<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;不過唔難既 唔識睇返lecture notes就OK 大同小異<br />Quiz就3個modules各測一次 3個分揀best2<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;自己第1次4/10 後尾2次都10/10 拎哂15% 難度難HW少少<br />Exam OPEN-NOTES!!15題MC+每個modules1題LQ+1條3揀1<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;MC主要問lecture notes既野 3揀1會問guest lectures同projects 內容 不過好淺 <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;LQ就係quiz既加長版 題目比好多野好多字 混淆你視線 其實唔太難<br /><br />Class participation 就上堂坐前d 舉下手答問題<br />佢會逐個逐個認人樣同人名 肯上堂同前面就拎硬4~5%<br /><br />final exam 佔分低 ,below mean同overall 76%都有B+ <br />連埋hw同quiz基本上都拎硬滿分 好好grade",
            "comment_workload": "workload少少大 因為每個lecture都有hw<br />quiz就3-4個星期1次 睇落好快 不過足夠你明哂先考<br />project就因人而異 唔洗太chur都ok",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jHjNuuvH4184wPn3O2wHAvERmuZch7av",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bohr",
            "date": "Dec 26, 2015",
            "title": "CENG1000",
            "comment_content": "3 Modules:<br />1. Material Balances <br />Atom balance, component balance<br />2. Energy Balances <br />First law of thermodynamics (closed, open system)<br />3. Kinetics <br />Rate equation,enzyme kinetics <br />(need to set up differential equation but no need to solve)<br /><br />Guest lecture",
            "comment_teaching": "Professor 好有心教<br />解釋得好清楚",
            "comment_grading": "Quiz x3 (計grade果陣 係揀左2次最高既出黎計既)<br />Project (會有特定area比你地揀 選擇完area自定title)<br />Final Exam <br />cover all notes + guest lecture(有機會出現係mc or LQ到, note係會搵到ans既<br />final 份卷係會好新 同以前d mock exam paper好5同 <br />但做落去 個做法會好似mock exam paper既做法",
            "comment_workload": "每堂完左會有hw (放心 照note咁做實得 同埋好easy)<br />每學完一個module就有quiz (total 3 quiz)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TipJ7Kfbj4zaM60iLtRow136BzkJELBT",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hot and Sexy",
            "date": "Jul 21, 2015",
            "title": "",
            "comment_content": "唔好以為佢真係chem<br />其實佢係phys<br />入面主要都係圍繞住2大個topics:<br />1. Material Balance<br />2. Energy Balance<br />入面會提吸好多phys既概念，尤其係thermodynamic<br />而且入面極多數計...",
            "comment_teaching": "Henry係一個好有heart既professor<br />你唔明佢真係答到你明而且唔會覺得你煩",
            "comment_grading": "極度好grade<br />佢上堂都話自己give good grade<br />其實feel到佢唔太注重派grade<br />反而佢覺得你學唔學到野更加重要",
            "comment_workload": "每堂完左之後都要都要起lmes答一條功課<br />答岩有2分<br />岩左但唔岩1分<br />冇答0分<br />同埋有個project做，要做presentation同一張紙既張度既project review",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Tm2dPYeXmKnK9PcoHGmMVcvM3VjUTbem",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tianyu",
            "date": "Dec 28, 2022",
            "title": "Good grade course!",
            "comment_content": "Basic chemical engineering knowledge <br />Including material balance <br />Energy balance <br />Mass transfer <br />Energy transfer<br />There are many phy equations. But because I learned them in phy1003, I didn't need to look at the lecture notes for the Energy part.<br />Actually, it is an open-book exam so I didn’t read the lecture notes. Just print them out.<br />P.S. Prof said that since this year, the syllabus is more narrow and the content is easier than the previous year.",
            "comment_teaching": "Quite good and interesting teaching style!<br />But because most of the time I just sat there chatting with my friends, I didn’t understand many concepts. My assignments are lower than the mean.",
            "comment_grading": "//Iprs 10% (=attendance <br />//4 Assignments 20%<br />//Studio 15%<br />//Project 20%<br />//Final 35% (All mc <br />As long as you attend and hand in the studio, you’ll get full marks.<br />Indeed, I don’t know how to do the assignments. (I didn’t revise DSE chemistry and got level 3 so chem is really my weakness ) The mean is 4.4 out of 5 but I always get 3.5 (overall 15/20). <br />The marks of the project and final have not been released. But I can tell you that I just used one night (4-5hours) to find the topic and finish the project. For the exam, as it is an open book exam, I just printed out all notes and didn’t revise them. However, I missed some equations so I was not able to work out at least 3 mc in the exam (25 total as I remember)<br />I thought I would have B or B- but eventually, I got an A. Every every surprising!!<br />##Update :<br />Project: mean15.5/20 highest19.4 me17.53<br />final:mean13.9/25 highest23/25 me20/25<br />overall: 86.23% A<br />It seems the grade is much greater than the effort I paid.<br />You don't need to get high marks on assignments. Just do better in the final and project, and you will be able to get an A.&nbsp;&nbsp;Remember to print out all lecture notes for the exam. That will be really helpful.",
            "comment_workload": "As I mentioned in the grading, I didn’t spend much time on this course. 1-2 hours for each assignment and 1-day doing project + printing notes. Still got an A. I think the workload is not big.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5IqcCL8zPL2GHdneUd7N1hIsgHgyFlk3",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ShayA",
            "date": "Jan 29, 2019",
            "title": "Broad content but high workload and useless material",
            "comment_content": "The content is mostly great. It is broad and covers three main areas of chemical engineering that you'll encounter further in the program. There is a good amount of detail into the material which gives students a better idea of how the the field works. However, my gripe is mainly with the excess amount of extra content in this course. In the beginning of the chapter there was too much detail about real world examples relating to the chapters. There are also guest lectures which are annoying and frankly, not worth all the time. In retrospect, while I did get a better idea of the field, I feel like the course could better handle different parts of the content.",
            "comment_teaching": "Ying Chau is an excellent and attentive teacher. The negative reviews on this site are, in my opinion, a reflection of the content, structure or the workload in this course rather than Chau's teaching itself. She has a good command over the materials and is able to communicate her ideas very effectively. Her accent is good and overall, she is a fun instructor to learn from.",
            "comment_grading": "Grading is divided up into quizzes, a group project, IPRS, homework and a final. The final was 40% of the grade which is fair enough. The mean, however, was laughable (a 46/100 I think). I'm not sure if this is a reflection of the student's efforts or the content difficulty. The questions are undoubtedly hard and seem way harder than what could be expected by just being in class. The quizzes were a similar story but just with annoyingly less time. The thing is, the questions are structured to be long questions which take time to understand and solve. It takes a long time just to get a gist of the question and when you realize you made an error, it is too difficult to backtrack and review your long answer. Time management is what makes it way more difficult.The mean for the quizzes was roughly 6/10 and they were taken at times when students were definitely not ready. The project is was a sad display from start to finish. It was difficult to get my partners to get started but that did not matter because it felt like the whole thing was a video editing competition and none of us knew anything about making videos. My team and I got below mean in the project so I might just be talking out of spite, but that's my verdict (Death to all group projects). The project was 30% (hurt my grade immensely) and the quizzes were 15%. The IPRS and homework comprised the rest but did not make much of a dent. I managed to get just above average in the homework, quizzes and the IPRS (with a decent amount of effort), waaaaaay above average in the final (not boasting, just trying to emphasize how low the mean was but I did make a good amount of effort and and i still owe some of it to my pre-existing skill in chemistry), and my project was below average. Overall, I managed to get an A which is not extremely difficult as long as you make sure you get a good grasp of the topic AS YOU GO RATHER THAN AT THE END LIKE AN IDIOT ( me actually, that idiot is me). As for the project, manage your team and choose good team mates, you'll be fine.",
            "comment_workload": "Unbearable for one course. Two weekly homework on top of IPRS every class was horribly annoying.The homework take too much time and you spend all night just coming up with the weirdest solutions to what were supposed to be simple practice questions. Quizzes every month were also a pain. In the later half of the course, working for the project was an extra annoyance. I kid you not, we had the project deadline, a quiz and a god damn homework due in one week. Insane amount of work in my opinion. Manageable but will take up a lot of time if you are serious about the course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rHOUbwWwIMyaB9LI5fwveCdU0DGqbE4L",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "dlo00",
            "date": "Jan 08, 2019",
            "title": "",
            "comment_content": "You learn materials balance, energy balance, and finally some kinematics and drug delivery. For each unit you have a short 20-minute quiz in which you have to do calculations - some of which you'll need a calculus background to understand. I know there are people who got full marks on quizzes, but personally the time allocated for the quiz wasn't enough for me to do calculations.<br />The materials balance quiz is the easiest unit, and from then on it goes downhill. The final exam was really hard. However, I found the content of the last unit really interesting. As well, the calculations are fun to do, even if they are hard.",
            "comment_teaching": "Prof Chau is very passionate about both chemical/biological engineering and teaching. She knows by name the students who participate in class and will stay behind to explain concepts in a different way if you do not understand the first time. Her lectures and slides are organised and easy to follow, though sometimes she doesn't finish all the slides in one lecture and has to leave them till the next.<br />Usually she goes through slides and explains things, and then gives students some time to do an example question. I suggest that you go through the slides before class and attempt the questions first, as you won't have much time to do so within the short time frame she gives.<br />Sometimes she likes to spice things up by bringing some objects or having students come up and demonstrate theories of kinematics. She also invites PG students, professors, and alumni to come and share their experiences as chemical engineers.",
            "comment_grading": "I think the grading was fair. You will need to put in time studying to get a good grade.<br />The prof uses IPRS for attendance; other than the final exam, you also have a project and three quizzes.",
            "comment_workload": "You are usually given a calculation or brief research-based question each lecture. You will need to think quite hard for the calculation-based questions, but luckily you are only given one or two at a time.<br />Just doing the homework won't be enough to get a good grade. You should also study by reviewing old questions and&nbsp;&nbsp;doing other questions in thermodynamics textbooks.<br />There is also a group project in groups of five. Two of my groupmates were complete freeriders but luckily we managed to pull through and be voted one of the top projects. We presented the video in class and answered one or two questions, so the presentation wasn't too hard, and you don't have to prepare for it as long as you know what's going on in the project.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Sj7Wc9Ot68E5pec13tkwSpCWDK2FU2GR",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 20,
                    "name": "CHAU, Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "whoooami",
            "date": "Oct 25, 2018",
            "title": "Heavy Workload, but not too difficult",
            "comment_content": "Module 1. Food/Chemical Industry and Material Balance<br />Mainly using High Fructose Corn Syrup (HFCS) production as issue, introducing the concept of material balance. Easy if you know mole concepts well. Just remember In-Out+Reaction=Accumulation is fine.<br /><br />Module 2. Energy Balance and Energy Industry<br />First Law of Thermodynamics will be the mathematical tools in this module. Then, concept of enthalpy change will be introduced, very similar to heat and gases learnt in HKDSE Physics syllabus.<br /><br />Module 3. Pharmaceutical industry, transport and kinetics<br />Some basic exponential calculation. Watch out if you do not have &quot;common sense&quot; in biology.<br /><br />Extra: Many guests talks, mainly about the industry and career future of Chemical and Biological Engineers. Very useful and insightful if you are interested in joining CBE.",
            "comment_teaching": "She cannot teach.",
            "comment_grading": "Class participation (5%)<br />By iPRS and regular Instagram posts of group project<br /><br />Homework (10%)<br />1-2 Homework per week. Mostly will be about calculations related to topic teaching, some might be some reflections or research about CBE or even major choices.<br />Only 0 marks (no/late submission), 1 mark (incorrect answer) or 2 marks (correct answer), needa be careful if you wanna get decent grades for Homework.<br /><br />Quizzes (15%, best 2 out of 3)<br />25 Minutes open book quizzes, one for each module<br /><br />Project (30%)<br />Six areas will be provided (related to CBE), choose one and suggest one issue and one solution for chemical engineers. Submission by video.<br /><br />Final exam (40%)<br />Open notes exam, 30% MC and 70% LQ.",
            "comment_workload": "Workload is quite heavy as meeting is required every week during tutorial session. Making such a long video is quite challenging.<br /><br />Also, a homework each lecture is quite tough as well.",
            "rating_content": 5,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "m6Gae5iN93Poszr7DU63tJWylqRFidai",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 34,
                    "name": "NG, Ka Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kobe24",
            "date": "Aug 06, 2017",
            "title": "",
            "comment_content": "都多野要記 (e.g. chemicals, 食品材料)<br />又有計數 (e.g. thermodynamics)<br />需要chemistry底子 因為一開始就回教一堆chemicals<br />skip曬d基本野<br /><br />另外project會隨機比TOPIC <br />可以學到用咩材料同方法整個target",
            "comment_teaching": "上堂有問答 5會太悶",
            "comment_grading": "all hws around or slightly below mean<br />mt: 20/32 mean: 20<br />project: 81.8/100 mean: 62.2<br />final: 47/60 mean: 33.8<br />finally get an A xd",
            "comment_workload": "希望無freerider if not project都有d辛苦",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3bMx74kFU0nHTsXgV7nCESbEEvLOKMRr",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 34,
                    "name": "NG, Ka Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "calvin",
            "date": "Oct 06, 2016",
            "title": "",
            "comment_content": "教下小小chem （plastic，mass balance）<br />thermodynamics <br />energy balance<br />dse有讀chem應該輕鬆",
            "comment_teaching": "教得幾好 講既內容都講得清楚<br />落堂去問佢都好肯答你<br />好有heart既老師",
            "comment_grading": "超好grade <br />midterm above 1SD<br />final below mean<br />project above mean<br />homework 5份有3份below mean<br />有2% online quiz<br />B＋<br />肯比心機就有回報既course",
            "comment_workload": "教完topic會比幾題homework question 不過同考試唔係好關事<br />尚升輕鬆",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SGO2nk3iprOBh2eexuYx9SFetpdHXLnC",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 34,
                    "name": "NG, Ka Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jayson",
            "date": "Aug 28, 2015",
            "title": "有付出才有回報的一課",
            "comment_content": "我讀完覺得內容很有趣 所以給A<br />課程教什麼內容你自己看class schedule and quota那裏就好 前面寫review的人是不同instructor教的 內容會差很遠 我這裏只寫我上的版本 <br />這是一個以blended learning為試驗性質的課程 每星期上三小時lectures 有homework 要看跟堂上不同的video lectures+online quizzes 要做一個group project+presentation",
            "comment_teaching": "基本上沒什麼可以挑剔的 所以A<br />Prof. NG 講課不悶 內容都解釋得很清楚 準時下課 課後課外也可以去找他問 <br />除了Prof. NG 還有其他的人會教你東西的 Dr. FUNG 是guest lecturer 會有幾課in class lecture是他講 <br />Dr. ZHANG是project advisor 做project的時候 她可以幫到你很多",
            "comment_grading": "挺合理 不過有一些是open-ended的task 我不知道grading算不算合理 我給B<br />online quizzes 5%<br />homework 15%<br />mid term 20%<br />project+presentation 25%<br />final 35%<br /><br />project佔分比mid term重 要重視 我就是被它拉低了不少總分 可能有一個sub grade",
            "comment_workload": "有一點點重 所以我給B<br />堂上要求active participation 雖然沒有很多人會做（也沒有很多人來上課） 也不是計分項目 但你想讀得好就多參與吧 <br />homework是比較open-ended的類型 format跟考試未必是一樣 溫習的功用不大<br />video lectures裏的內容是會考的 不要臨考試才看 很多很長的 你看不完<br />可能你會覺得online quizzes很簡單 以為考試也是這樣？ 抱歉 你誤會了<br />notes與其他materials都會上載到CANVAS 強烈建議預習/溫習 <br />project and presentation是分組做的 但評分可以是個人的 希望你們不要freeride你們的組員 盡量均分workload 組長是要寫internal appraisal的 會不會影響評分我不知道 補充：每一組都有交project 不過有人project拿了0分 為什麼我就不多說了<br />總的來說 workload其實可重可輕 在乎於你想怎樣對待這一科",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "i0exGqOFOa2PydGoZp4nNvNoKHX6KGgx",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cheung Ka Po",
            "date": "Jan 20, 2018",
            "title": "",
            "comment_content": "Acceptable(if you attend all classes and do all the hw yourself)",
            "comment_teaching": "very interactive and Henry is very considerate. Best Prof. ever. He is really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really really a nice guy",
            "comment_grading": "Very good",
            "comment_workload": "although you need to do group project but it is so much fun and with acceptable workload.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}