{
    "error": false,
    "course": {
        "id": 115,
        "subject": "CHEM",
        "code": "4320",
        "name": "Environmental Analytical Chemistry",
        "description": "Topics covered include fundamentals of sampling issues, sample pretreatment techniques, water Analysis of major and trace constituents; determination of inorganic and organic gas pollutants, Atmospheric analysis of particulate matter, determination of soil pollutants, environmental control standards, chemometrics in environmental analysis. For students with major or minor in Chemistry and in Environmental Science only.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2010,
            1910,
            1810,
            1710,
            1510
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"CHEM\" data-code=\"2310\" href=\"/review/CHEM2310\" target=\"_blank\">CHEM 2310</a> OR <a class=\"course-link\" data-subject=\"CHEM\" data-code=\"2311\" href=\"/review/CHEM2311\" target=\"_blank\">CHEM 2311</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3,
        "rating_teaching": 2.4,
        "rating_grading": 3.4,
        "rating_workload": 3.4,
        "review_count": 5,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 972,
                "name": "NAGL, Stefan",
                "count": 5
            }
        ]
    },
    "reviews": [
        {
            "hash": "zQrT0qg95DiRXlTgDHVAXNbB1Lx9kUwT",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 972,
                    "name": "NAGL, Stefan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ds",
            "date": "Nov 03, 2020",
            "title": "",
            "comment_content": "Week 1. Introduction to Environmental Analytical Chemistry, Recap of Concepts<br />Week 2. Water Analysis – Major and Minor Constituents<br />Week 3. Water Analysis – Major and Minor Constituents<br />Week 4. Water Analysis – Trace Metals<br />Week 5. Water Analysis – Trace Organic Contaminants<br />Week 6. Water Analysis – Trace Organic Contaminants<br />Week 7. Soil Analysis<br />Week 8. Fundamentals of Air Pollutants<br />Week 9. Determination of Volatile Organic Compounds<br />Week 10. Determination of Polycyclic Aromatic Hydrocarbons<br />Week 11. Continuous Monitoring of Air Pollutants<br />Week 12. Guest Lecture and Field Visit<br />Week 13. Recap and Student Presentations<br /><br />IDK DUDE, sometimes it's fun but sometimes it's not.<br />His voice are not engaging? But I think he tried to make the class less boring. I attend the class but can hardly understand anything",
            "comment_teaching": "He's very nice and fun.&nbsp;&nbsp;Since the class quota is small, he can interact with us. His ppt is very useful and all of the exercise there is important. It's not hard tho. He gives us a lot of videos in class so it's not boring. But he has some technical issues very often and he also teaches quite slow. We're always behind his schedule.<br />I think the professor had problems with his mic. you need to fix it prof, the whole class can't understand you very well throughout the semester",
            "comment_grading": "Good grading!!!! he's very lenient. Idk if it's curved or absolute though since there were only 25 students in my class and I know most of them.<br /><br />70% Course project<br />(40% Write-up and<br />30% Presentation)<br />30% Homework<br /><br />wrong sigfig= - some points:)<br />He didn't tell us his grading scheme, no idea how to do well in this class but I'm tired dude I don't even care anymore I just want to graduate.",
            "comment_workload": "Dude seriously no midterm and final exam. And the project is a group project. The assignments are super easy, only need 1 hour&nbsp;&nbsp;(or 1 week) to finish everything! You can find the answer from his lecture! But I never listen in class so I have to watch the lecture video to find his sample questions. and ok the project is quite demanding and I'm lazy.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aPR01a0nYr8YbybZ07EJ3x33Z1HADw5n",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 972,
                    "name": "NAGL, Stefan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "F",
            "date": "Aug 21, 2018",
            "title": "He gives 25% A range",
            "comment_content": "T1.&nbsp;&nbsp;&nbsp;Introduction to environmental analytical chemistry<br />T2.&nbsp;&nbsp;&nbsp;Fundamentals of trace component analysis<br />T3.&nbsp;&nbsp;&nbsp;Fundamentals of pollutants and their measurement<br />T4.&nbsp;&nbsp;&nbsp;Determination of airborne carbonyls<br />T5.&nbsp;&nbsp;&nbsp;Determination of polycyclic aromatic hydrocarbons in the&nbsp;&nbsp;atmosphere<br />T6.&nbsp;&nbsp;&nbsp;Continuous monitoring of air pollutants<br />T7.&nbsp;&nbsp;&nbsp;Measurements of water quality<br />T8.&nbsp;&nbsp;&nbsp;Measurements of metals in water<br />T9.&nbsp;&nbsp;&nbsp;Analysis of ions in natural water<br />T10. Analysis of metals and pesticides in contaminated soil samples<br />T11. Quality control for environmental analysis",
            "comment_teaching": "He just repeat the PPT and always ask students to do the exercises during the lessons.<br /><br />This is his first time to teach this course and even the material is not made by him. So it is understandable and hope that he can improve that.",
            "comment_grading": "More than 25% student can get an A from this course.<br />For a course with only 55 students, 14 students can get A range.<br />Also, the exam is very very easy if you really try hard to do the exercises. They are very similar and in fact easy to understand.<br /><br />By the way, he gives 36% B range (20/55) and only 1 fail.",
            "comment_workload": "Mid-term exam (30%) <br />Final exam (40%)<br />Course project: presentation + write-up (30%)<br /><br />No homework but highly recommended to finish the exercises.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TH1u64WaadyTANdTM4ezLySxxzUvy6LG",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 972,
                    "name": "NAGL, Stefan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gazelle",
            "date": "Dec 31, 2020",
            "title": "A worth-taking CHEM option course.",
            "comment_content": "1.\tIntroduction to Environmental Analytical Chemistry, Recap of Concepts<br />2.\tWater Analysis – Major and Minor Constituents<br />3.\tWater Analysis – Trace Metals<br />4.\tWater Analysis – Trace Organic Contaminants<br />5.\tSoil Analysis<br />6.\tFundamentals of Air Pollutants<br />7.\tDetermination of Volatile Organic Compounds<br />8.\tDetermination of Polycyclic Aromatic Hydrocarbons<br />9.\tContinuous Monitoring of Air Pollutants<br />10.\tSimon Chan’s guest lecture – Environmental Exposure to Aristolochic Acids<br /><br />Most memorable part of this course is Simon’s guest lecture. I couldn’t help but burst out laughing for his baldness. It seems that his hairline keeps going backward while his hair is becoming sparser and sparser.<br /><br />Speaking of his presentation, I am literally impressed by his contributions in disciplines of chemical toxicology and environmental analysis. He has developed number of novel methodologies in the fields that have facilitated research studies of other scientists.<br /><br />I don’t know why Simon can deliver such a deep, impressive presentation of his own work, but gives a disastrous teaching in CHEM 2310. Anyway, these at least explain why Simon can still stay in UST despite his not being an excellent teacher.",
            "comment_teaching": "This course covers essential theoretical frameworks for environmental analysis, which is indeed inspiring. Especially I have worked in an environmental testing laboratory for few months. Of course, some content is outdated and not particularly useful in the real-world scenario. Still, I am happy to learn from Stefan’s lecture and solve some calculation problems.<br /><br />As a matter of fact, part of the content of my course project is inspired by Stefan’s presentation. His presentation might seem unappealing at first glance because of messy slides and calm voice. But his elaboration does help you understand things broader, at least better than reading the slides alone.<br /><br />One thing problematic, however, is that he is unable to manage the time well. He simply over-elaborates the first few topics, leaving insufficient time for the last few. So, a B for his imbalanced delivery.",
            "comment_grading": "30% assignments (@10% X 3)<br />30% research presentation<br />40% term paper<br /><br />I originally thought that I could at most get a B in this course, because of my limited intellectual ability compared to other smart, outstanding students, my disastrous experience in 神童’s CHEM 4340, and my receiving a shit grade in Simon’s CHEM 2310. Fortunately God bless me and I received an A+ in the end (with a total score of &gt;96%). What a special New Year’s gift! XDDD<br /><br />It is great that Stefan adopts absolute grading, with grade cut offs same as previous years’ (refer to previous reviews for more details). Curve grading is indeed unfair for students in research-based courses like this. I myself am a Business minor student, and I have seen super mean professors adhere strictly to “20% A range grades” policy, ruining my friends’ painstaking efforts spent on the research project. So, I would love to thank Stefan for his being generous and flexible in handling our grades, given this is such a small class (25 students only).<br /><br />It is also praiseworthy that minor, careless mistakes in the (calculation-based) assignments do not deter us from getting an A. For some bad grade courses, every mistake counts and can pull your grade down from A to A-/B+. Luckily this has not happened in this course, as assignments only account for a small proportion of the course grade.<br /><br />One thing that perplexed me is Stefan emphasizes on the referencing of diagrams/figures. Stefan seems not satisfied with my referencing style of diagrams, which is otherwise perfectly fine in other research-based courses.<br /><br />Strangely he only stresses the referencing of diagrams, rather than that of numerical data and equations, nor whether the sentence/paragraph is an unjustified claim or if it is logically rigorous. I would suggest you ask for him what is meant to be a good referencing of diagrams, if you would be taking this course.",
            "comment_workload": "Workload ranges from medium to very heavy, depending on your aim. Preparation of presentation slide and term paper are not the most time-consuming. What takes the most time is to understand thoroughly what the heck the research papers are talking about, and somehow establish relationship between one another.<br /><br />Only by doing that will you be able to answer Stefan’s tough, abstract questions during Q&amp;A. Just like FYP presentation, failing to immediately handle Stefan’s questions will result in loss of marks. This is, obviously, more intellectually demanding than a written exam – you literally have no time to think and cannot skip the question.<br /><br />Calculation-based assignments are fine, everyone should be able to do well. Lecture videos do provide enough demonstrations on how to solve relevant problems, particularly on how to handle the significant figures. Essay-type assignment is a bit more demanding, but still fine compared to the research project.<br /><br />After all, hard work does pay off, as long as you work hard on the right track.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9tS45wG0HscAnF8cBDlakKlzWSdKkQR0",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 972,
                    "name": "NAGL, Stefan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "YSA",
            "date": "Dec 23, 2017",
            "title": "Do not take unless you have done CHEM2311 / 2310 and CHEM3320 / 4330",
            "comment_content": "Topics:<br /><br />Introduction to environmental analytical chemistry<br />Fundamentals of trace component analysis Fundamentals of pollutants and their measurement Determination of airborne carbonyls<br />Determination of polycyclic aromatic hydrocarbons in the&nbsp;&nbsp;atmosphere<br />Continuous monitoring of air pollutants<br />Measurements of water quality<br />Measurements of metals in water<br />Analysis of ions in natural water<br />Analysis of metals and pesticides in contaminated soil samples<br />Quality control for environmental analysis<br /><br />Some topics are interesting, but most topics have too many irrelevant and unnecessary details about specific instrumental parameters. <br /><br />Too much content- ~18 PPTs with 30-40 slides each = 500-600 slides in total.<br /><br />Topics are very complex. This course only has CHEM 2310 / 2311 as prerequisite, but don't take the course unless you have also done CHEM 3320 Instrumental analysis or CHEM 4330 Separation science. Very hard to understand all the complex analytical techniques.",
            "comment_teaching": "He just reads off the PPTs in every lecture. Can get very boring and difficult to follow with interest. Attendance became quite low later in the term, because it's the same as just reading the PPT at home.",
            "comment_grading": "Midterm 30%<br />Final 40%<br />Project 30% (Presentation 15% + Report 15%)<br /><br />Midterm and final are both very long. No MCQs, all short/long answer questions. Grading is very hard. For the midterm, 15 out of 55 students got D or F...<br /><br />Project grading is much better, helps the overall grade a lot.<br /><br />Midterm average: 68%<br />Final average: 69.2%<br />Project average: 81.2%<br />Total average: 72.5%",
            "comment_workload": "Midterm, final, and a course project.<br /><br />The project includes a 12-minute group presentation with 3-4 people, and a 2-page long individual report. The topic is some previous research paper about some analytical techniques, just need to summarize the results of that paper in the project. Takes a lot of time, but grading of project is very good and helps increase the overall grade.<br /><br />Midterm is fine, but preparing for final is crazy. All topics in the course are included, so that's 600+ slides of detailed, heavy information to memorize.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "IrQg8gAxv6KzYQDHd23g0xfq51GQcGVl",
                    "name": "final results",
                    "format": "png"
                },
                {
                    "key": "fkvYUKdz0sOTe6u24KN8Uh71mifRyIRz",
                    "name": "midterm results",
                    "format": "png"
                }
            ]
        },
        {
            "hash": "9e9Lutun0wow9Vn2N9sFnDzEIZB1ZSRZ",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 972,
                    "name": "NAGL, Stefan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "R_Liaw",
            "date": "Dec 22, 2017",
            "title": "",
            "comment_content": "September: Review on AN Chem I, sig.fig., error propagation, basic calculations, etc.<br />October: Airborne Analysis<br />November: Water Analysis, Soil Analysis<br /><br />Including sampling, derivatization, working principle and detection limit of every method.",
            "comment_teaching": "字海lecture slide<br />照讀ppt 仲讀到喘哂氣<br />無重點 (well, indeed the word key point appeared several times, though the key point is to clean the sampling vessel and clearly date the record form =.=)<br />題目得1個sig fig 點算? 咁一於係1mL 後面加.00令佢變3個sig fig 啦<br />有時會上堂叫人出去做exercise, 但係你一路做佢佢就一路擾亂你",
            "comment_grading": "Overall grade:<br />Project 30%, Mid term 30%, Final 40%<br />5分1個subgrade<br />Average: B-<br />Grade Distribution attached<br /><br />Project 唔知點俾分 死無對證<br />出埋grade 先話再過多2個禮拜有得check Final 等拜山好過啦",
            "comment_workload": "Some in-class &amp; take home practice, not very helpful though<br /><br />Mid term and Final:<br />要背哂所有calculation formula<br />記哂每種pollutant 用咩analytical method and the detection limit<br />will ask basic environmental chemistry concepts from ref book<br />Mid-term 同佢d exercise &amp; sample paper都尚算相似<br />Final 無俾practice paper, 問d 嘢又唔似exercise<br /><br />Project:<br />鬥快搶topic, 先到先得<br />Group presentation (4ppl) and individual report<br />Presentation: 12 min + 3 min Q&amp;A<br />Individual report: 2 page<br />Basically is to summarize the literature paper provided. Not very demanding. 睇唔明篇literature 可以去問佢",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "bMAFmlazYBshmGQc6iN5B44dtJii8D66",
                    "name": "Grade Distribution",
                    "format": "jpg"
                }
            ]
        }
    ],
    "composer": []
}