{
    "error": false,
    "course": {
        "id": 135,
        "subject": "CIVL",
        "code": "1140",
        "name": "Environmental Quality Control and Improvement",
        "description": "Introduction to up-to-date environmental issues in both local and global scales; providing essential physical, chemical, biological and societal concepts required to understand the nature of pollution and environmental problems; applying science, engineering, management and social science approaches to solutions to environmental issues that affect our water, air, land, eco-systems, living environment, and sustainable development. The objective of this course is to equip our next generation leaders in different disciplines with enhanced environmental awareness and knowledge of tools and solutions to environmental issues. They will therefore be able to make responsible decisions and actions, with due consideration of the environment and sustainability. Each lesson is divided into two parts. The first part is the introduction and discussion of essential concepts and environmental issues and debates of these issues and will be delivered and guided by the instructor. The second part involves presentations of projects, focus studies, or service learning activities of new, emerging environmental issues selected by student groups, with emphases on solutions to the issues.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2010,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.71,
        "rating_teaching": 3.82,
        "rating_grading": 3.53,
        "rating_workload": 3.18,
        "review_count": 17,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 85,
                "name": "SHANG, Chii",
                "count": 13
            },
            {
                "id": 1226,
                "name": "LING, Li",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "JNyxMRleYcbF2ckZQEnHNdzToH1G0FJi",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1226,
                    "name": "LING, Li",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AndrewChung",
            "date": "Jan 25, 2019",
            "title": "無想像中咁理想",
            "comment_content": "無midterm無final<br />個couse主要淨係做兩個project, 每個係20分鐘嘅powerpoint presentation<br />上堂基本上淨係教啲project嘅outline同introduction<br />一個關於設計aquaponic<br />一個關於設計一個方案令係2030降低香港50%碳排放<br />主要靠學生自己做project嘅時候學習, lecturer唔會點教嘢<br />但係基本上堂堂都要attend, 有啲堂係compulsory, 唔係compulsory個啲 free dicussing 基本上其他groupmate都會返曬, 所以唔返嘅話佢地會覺得你freeride",
            "comment_teaching": "上lecture學唔到啲乜, 凌教授都淨系會介紹下project同引領大家點樣按部就班做project, lecture個陣叫唔同組出黎簡單介紹下自己個project嘅重點<br /><br />我個TA會好細心咁睇實我地個組個project嘅進度, 會主動指出我地嘅錯誤同畀返啲容易follow嘅建議, 大大幫助到我地完成project",
            "comment_grading": "20% project 1<br />20% project 2<br />(project&nbsp;&nbsp;組組差唔多分)<br /><br />10% quiz (好容易)<br /><br />10% 一個quiz去test你search嘢能力, 畀份卷你即刻上堂上網search答案<br /><br />15% self-reflection report 1800-2000字, 攞咩grade主要睇呢個<br /><br />20% TA會因應你對project嘅參與率同埋貢獻而畀分, 具體點畀唔係記清楚<br /><br />5% peer evaluation<br /><br />每缺席一堂compulsory -2%<br /><br />我兩個project都算高分, 平時都經常參與, 可能report寫得唔好,&nbsp;&nbsp;最後攞B+, 唔係話靚grade科",
            "comment_workload": "雖然無midterm無final, 但係project嘅workload真係好大<br /><br />組員都好合作, 好幫得手, 但係都係每個禮拜要chur project進度<br /> finalize project個陣仲要特登約出黎傾, 其實都頗大負擔<br /><br />個project要好多細節, 要搵好多資源同埋計好多數, 唔係話一兩個禮拜可以輕鬆搞得掂, 基本上每日都要做research, 好辛苦好chur<br /><br />重點最後考曬final之後要寫篇千幾二千字嘅report, 個個考曬試之後你仲要chur report, 真係唔係咁舒服",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "fZslxUEbr8dCmbb3aaOMEq1EJ3vfRsOl",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Oscarfung2",
            "date": "Aug 23, 2019",
            "title": "",
            "comment_content": "Usually, the teacher on class won't teach you a lot&nbsp;&nbsp;What you learn is mostly from what you researched during the preparation of the project. The content is interesting though.",
            "comment_teaching": "They won't teach you a lot as I said. However, the TA will guide you during the progress of the project.",
            "comment_grading": "Pretty good grading",
            "comment_workload": "Lots of work have to put on to the project. Include data research or preparation of the PPT. However, there are no midterm / final that you need to study, it is sort of compromising the work load, else it will be way too heavy.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2bqsGFamn9rGvAynF2v6QpjM0CxelWlq",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "abeez",
            "date": "May 22, 2019",
            "title": "",
            "comment_content": "According to the Professor, the course is designed for year 3 and 4 students, not 1 and 2. But majority of the students taking this course were 1 and 2. The content was interesting and fun to study. The course is mainly focused on project presentations, and group works. Attendance is also counted towards the grade.",
            "comment_teaching": "TAs were more helpful than the professors. Professors gave us a guideline on the project presentations, and TAs helped us to establish the relevant knowledge.",
            "comment_grading": "According to the professor, the grading system was generous than other courses, with wide range of A and B due to the excessively huge workload.",
            "comment_workload": "The workload is significantly huge compared to other 3 credit courses. I personally felt this course like a 5 credit course. There were exam, quiz, 2,000 words report, and 2 huge presentations with a given topic. Our group had students from school of business, however, I strongly do not recommend students who are not studying science or engineering relevant major to take this course. This course is based on engineering skills and knowledge. Moreover, due to the nature of the group working, there are some free-riders, yet there was a peer assessment at the end of the course, but I am not sure if that is really counted in our grades.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hwOkiAOoRoA8bAPH1mb9HslNZYTjxhwI",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 85,
                    "name": "SHANG, Chii",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Angus31",
            "date": "Jan 23, 2019",
            "title": "CIVL1140",
            "comment_content": "It is a project-based course and requires two presentations. One is to construct an aquaponics system for Wat Opot Community in Cambodia, and the other one is to find ways to reduce carbon emission by 50% in Hong Kong by 2030, using 2005 as a baseline.",
            "comment_teaching": "Self-learning as a majority. Lessons will inspire you with different newly developing technologies. Every group will be assigned with a TA, which you can ask them anything about your project.",
            "comment_grading": "In a group, you will receive a range of grade that depends on your performance of presentation.",
            "comment_workload": "In my opinion, it is quite heavy. As it is a project based project, you have to research a lot and digging very deep in order to make your idea feasible.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mTXIZZO5MY0OM9VzGvCOURTql9MEttS0",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 85,
                    "name": "SHANG, Chii",
                    "rating": 1
                },
                {
                    "id": 1226,
                    "name": "LING, Li",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AceOfSpades",
            "date": "Dec 10, 2018",
            "title": "Great for me, the grade depends on your teammates in the end.",
            "comment_content": "CIVL1140 is a project-based course, meaning it won't have any exams throughout the entire semester (YAY!). It consists of two projects, one is to construct an aquaponics system for Wat Opot Community in Cambodia, and the other one is to find ways to reduce carbon emission by 50% in Hong Kong by 2030, using 2005 as a baseline.<br /><br />Let me be straight. Do not expect to learn anything from the professors in the lectures. Yes, they will give you a brief introduction at the beginning of each project, but most of them still require you to find information from the Internet.",
            "comment_teaching": "SHANG Chii and LING Li:<br />Their teaching methodology is so-so, but it's in my expectation since they encourage us to learn by ourselves. Both of them made it very clear in terms of the requirements on each project. Nothing more to say on the teachings.<br /><br />TA:<br />Each group is assigned with a TA to check the progress on the projects regularly. Our TA is a Chinese. She has been very kind and helpful compared to others throughout the whole course. She really keeps things in check and tries to encourage us in-depth learning.",
            "comment_grading": "You could say it's very easy to score high in presentations. Getting perfect marks is not difficult once you can fufill their basic requirements. It seems they are adapting a mark reduction system （扣分制）. All you need to do is getting adequate elaboration and in-depth information. Just putting bunch of equations and not explaining them won't help you.<br /><br />The one and main flaw of this course is that they do not have marking guidelines. The professor stated that their marking scheme is all but same as how they comment on the lectures given by to-be-professors. It would be best if there are files published to students regarding the grading system. This applies to the self-reflection individual report as well. It is better if we could get the samples written by past students.",
            "comment_workload": "The workload is not heavy, but not too light. It all comes to time management and your teammates. Let me spill some beans: each presentation must consist of general part (EASY) and detailed part (HARD). The former means you include different viewpoints of the project, but need not do in-depth research. The latter requires you to do a lot of calculations while at the same time give explanation or elaboration to your audience. Everything has to be clear so that the professors and TAs can still understand what you're talking even though you are not present.<br /><br />I was the core participant of detailed part, but I did help finding some basic information for the general part as well. What I always feel is that you don't find it difficult at all in the beginning, but as you progress into the detailed part, more in-depth research has to be done. However, everything has its limits. Even the earth itself has its bedrock, where it's impossible to dig down anymore. I often find it frustrating when the TA urges me to do more learning on a certain topic when there's no more to learn.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ejME87ONZcVXdI867TQ4Wu9558PWdvhp",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 85,
                    "name": "SHANG, Chii",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ivannnnnnnnnnnn",
            "date": "Aug 24, 2018",
            "title": "",
            "comment_content": "many interesting science facts. quite fun to know more about Hong Kong electronic development and Cambodian aquaponic farm. but quite useless.",
            "comment_teaching": "The teaching is hea. Useless teaching. Little support from the professor.",
            "comment_grading": "its ok. project everyone almost same score. quiz as well. the final reflection accounts for most of the grading so u better pay more effort to it. it's quite awful.",
            "comment_workload": "Extremely heavy. Very heavy burden especially I met a lot of free riders in my group :( I eat all workload so I feel frustrated and helpless.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dgnyBGCaeGnbWUkUgUMu87b3nzU9DLLx",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 85,
                    "name": "SHANG, Chii",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "G港小王子",
            "date": "Jul 03, 2018",
            "title": "not so good not so bad",
            "comment_content": "Two group projects<br />1) Design aquaponic farm for The Wat Opot Children’s Community, Cambodia<br />2)Making Hong Kong greener–Controlling global warming and carbon emission in Hong Kong",
            "comment_teaching": "The TAs will only give you some brief information regarding the projects during the class. You have to learn by doing research on your own.",
            "comment_grading": "I would say it's so-so.<br />No grading guideline is provided so you won't know what the way of scoring a higher mark...<br />You will get a higher grade if you have some great teammates.",
            "comment_workload": "It's not heavy compared to phys1112.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zYaPiP3H1ukPWVjn9GmE1hD3w0UT2KBt",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 85,
                    "name": "SHANG, Chii",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "淺水健",
            "date": "Jan 22, 2018",
            "title": "1140",
            "comment_content": "this course is a special course,&nbsp;&nbsp;It allow students from different school cooperate together to solve social problems. It is meaningful",
            "comment_teaching": "instructor told us the basic concept of the project. Ta gave us suggestion.",
            "comment_grading": "B+, my poor essay make my grade so low although there was a excellent performance in presentation.",
            "comment_workload": "mostly the work of the group projects are done by group mate who have stronger ability, I represent for the less important part so fewer workload. This course need to prepare a small quiz but the quiz can be prepare very early.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ChltUpHFzPKPbJXG0LfUv7k60lXnUrOC",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 85,
                    "name": "SHANG, Chii",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "PineTree",
            "date": "Aug 21, 2017",
            "title": "Quite interesting for blended learning, good grade if you work hard",
            "comment_content": "Project course divided into 3 parts (one month each):<br />1.HK carbon control <br />2. device for water purification <br />3. Sustainable greener HK<br /><br />Professor will give brief introduction in the first two lecture (every month first two classes), then rest of the month will be doing project with your group-mates. <br />[Team grouping is decided by prof. ,but he said he regret to do so ]<br /><br />Simply, get inspired by Prof. --&gt; set up topic --&gt; discussion and searching for information --&gt; presentation<br /><br />** A free field trip is optional to go<br /><br />Last class is the challenge test for the water purifier <br /><br />But not sure if this class (in blended learning style) continue in the future as it mentioned that it is an experimental course to be modified.",
            "comment_teaching": "Small class teaching &amp; the atmosphere is quite good<br />You will meet students from different background in the group, quit interesting<br />Prof. is friendly, if you ask question about the project, he will answer you briefly<br />TAs are helpful, they did really good job, especially preparing for the water test.",
            "comment_grading": "20% for each project (60%)<br />final report&nbsp;&nbsp;(15%)<br />classroom discussion (15%)<br />peer evaluation (10%)<br /><br />Some point will be deduced if you skip class (discussion part)<br /><br />Prof. and group TAs will give marks for the presentation content (first score) and the PowerPoint submitted (second score).<br /><br />Each group also rate score for the other team base on &quot;How much did you learn from other team ?&quot;<br /><br />Overall is quite good grade if you work hard.",
            "comment_workload": "Base on how hardworking your are, more hardworking, heavier workload.<br /><br />It is worth of it to do so if you want to get a good grade.<br /><br />Prof. always stress on quantitative research, you may have to deal with quite many data.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TiLibJk5xtVDgjZNxx1stKiWXIM6PNRn",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 85,
                    "name": "SHANG, Chii",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "vforvendetta",
            "date": "Feb 01, 2017",
            "title": "good grade",
            "comment_content": "As what it is called, about environmental issues<br />Project 1: How to save up to 50% CO2 emission in hk in 2020<br />Project 2: Design a water purifier<br />Project 3: Something about green (can choose topic freely)<br />well, i think quantitative analysis is the key point of the three projects instead of raising your environmental awareness...",
            "comment_teaching": "Most of the time was used for group discussion<br />TAs are very helpful, they helped us to create the outline of projects, professor is nice, he shared a lot to our group, but in my view TAs helped us more when we came up with difficult problems and got confused. Anyway they are all good tutors and very experienced",
            "comment_grading": "No transparency<br />But as long as you work hard (and no free rider in your group), participate actively in group discussion (since TAs will grade your performance and report to the professor), B+ or above is definitely possible",
            "comment_workload": "3 projects and 1 report<br />difficult to judge the workload as it depends on whether you want to get a good grade or not, but I would say it's a good course that you should try (before I heard that we may be the last to join this course as it is an experimental course and students' reflection on it may determine the decision of opening such kind of class again or not, luckily they do open it again, but in this sem the format of the course appears to be very different, can't tell how it will change)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5gEqyfpydrnBf1jo6jgduSfvvxJyDUdS",
            "semester": "2015-16 Fall",
            "instructors": [],
            "is_author": false,
            "author": "wkchanjason",
            "date": "Jan 22, 2016",
            "title": "",
            "comment_content": "Pretty interesting for introduction to environmental engineering. Content basically consists of 2 projects for the whole semester. One general case on how to reduce HK carbon emission and another practical case on building water purification device (second project might differ every semester depending on current issues). Best part of the course: FREE trip to China (for this semester).",
            "comment_teaching": "This is a self-study basis course, so not much teaching is done, lecture notes are all uploaded from the beginning of semester. But generally speaking professor is very nice and passionate to make us learn. Professor really care about the outcome of our learning.",
            "comment_grading": "Grading might be subjective, depends on performance during class and labs. There will be lots of discussion throughout the course, try to be active. Participation is an essential key for this course.",
            "comment_workload": "All group project. If you are really interested in the topic, you might want to do extra research &amp; study every week (don't worry the project is pretty exciting). If you only take this for the 3 credits common core, forget it or hope you get a nice group mate. All you have to submit is 1 presentation for each projects (group effort) and one final essay regarding the whole course (individual effort).",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "DOeMU8gQbiZnbAjtEQB8fi0yVnR2Jfqz",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 85,
                    "name": "SHANG, Chii",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "SHANGchii",
            "date": "Jan 04, 2016",
            "title": "COmmon core course",
            "comment_content": "the content is quite boring",
            "comment_teaching": "",
            "comment_grading": "the grading is absolutely confusing. Surprisingly no grading guideline when we did our projects. The TAs and professor will rate our presentations, but it turns out that whole your group got 20 from some TAs, one of the TAs could just give you 10, and your group would suddenly became the lowest mark in class. The transparency is the key problem in the marking. Like you do not really know why a group scoring higher than the others, because the professof will only say &quot;the other group is making more effort&quot;",
            "comment_workload": "the workload is ok. since everything is done in group basis.",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "cCAZPAco1UqOvLfOSHUdz9doU0lthNd4",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 85,
                    "name": "SHANG, Chii",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ah Lam",
            "date": "Jan 13, 2018",
            "title": "Interesting Group-project-based Course",
            "comment_content": "The course is concerned with environmental topics. Two topics are discussed in the course, including &quot; how to reduce 50% Hong Kong's carbon emission by 2030&quot; and &quot; design an aquaponic farm&quot;.<br />(The topics of the projects may vary a bit for each term since the instructor is still trying to figure out the best topics for the projects. But basically, the main ideas of the projects are the same.)<br />The course is project-based and is exercising a blended-learning course delivery.",
            "comment_teaching": "The instructor, Mr Shang, is quite funny and his presentation of the learning materials is interesting comparing to most of the instructors of other coures.<br /><br />Every group will be followed by a TA, who may give some ideas about the projects' contents and is a spy for evaluating individual contribution in the group.<br /><br />Have a two-day trip to China to study the aquaponic farm.",
            "comment_grading": "Projects (by group)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;40% (20% each)<br /><br />Final self-reflection report (by individual)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br /><br />Classroom discussion, contribution and leadership<br /><br />(by individual)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br /><br />Mini quiz (by individual)&nbsp;&nbsp;(pretty easy, no worries)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br /><br />Peer evaluation (by individual)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br /><br />Attendance (2% off each from the third absence)",
            "comment_workload": "No exams, just need to do two group projects and present them in class.<br />The course focuses on discuss issues with data analysis and rational assumptions. Information processing can take a lot of time since you have to study a considerable amount of documents from the internet for getting the desirable information you want.<br />Time-consuming studies are needed for good project presentation",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "caPNFffSMcPJXL5vG7oTOrTKfR0i53wt",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 85,
                    "name": "SHANG, Chii",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "doi124",
            "date": "Jan 10, 2018",
            "title": "Great course for experiencing group-based projects",
            "comment_content": "Project course divided into HK carbon control, device for water purification and sustainable greener HK<br />We need to find a great amount of information about the project ourselves as the professor only gives a small lecture on every project",
            "comment_teaching": "The professor and TAs give great support about the project. We can meet students from different background in the group<br /><br />TAs are helpful and helped us solve lots of obstacles especially when preparing for the second project.",
            "comment_grading": "20% for each project (60%)<br />final report&nbsp;&nbsp;(15%)<br />classroom discussion (15%)<br />peer evaluation (10%)<br /><br />The grading is good as soon as you pay enough effort on the individual report.",
            "comment_workload": "It is not heavy as you will have your groupmates with you",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1ueun2zyPFTdHSEAP55AZPGSiJum7LZp",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 85,
                    "name": "SHANG, Chii",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "siu_peter",
            "date": "Jan 14, 2016",
            "title": "",
            "comment_content": "This content is quite interesting. The course is separated into two part, the first part is about how to reduce CO2 by 50% within 30 years and the second part is about building a water filter.",
            "comment_teaching": "The professor is passionate and well equipped with relative knowledge. Also, the TA is helpful.",
            "comment_grading": "The grade is so subjective. It depends heavily on the performance of during classes and project.",
            "comment_workload": "Fair as all of them are groupwork. Therefore, it depends on your groupmate. However, the professor would not allow you to choose your groupmate, therefore it depends on your luck.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0hDX3HueAq0J8dlll2WjDYu0SvF9K7H4",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 85,
                    "name": "SHANG, Chii",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "姚乔乔",
            "date": "Jan 18, 2018",
            "title": "I recommend it.",
            "comment_content": "Two projects, one is about &quot;How Hong Kong can reduce 50% of its Green House Gases emission by 2030&quot;. The second is about &quot;Designing a aquaponic farm for a society in Cambodia&quot;. Each is big project, require a 20 minutes long presentation(group). Every member need to say something and do some job in the presentation. During the semester we had a study trip to Mainland China. Of course its on weekend and you can choose to join or not. It's good for year one students if you need opportunities to practice English speaking and academic presentation as you are new to the university environment.",
            "comment_teaching": "Prof Shang is a very good professor. Speaking mid-speed, accurate English without accent. He does not talk more when you are doing discussion except Sometimes he will join and give some advice. There are many TAs in the class. Nearly every group will get a TA to help. TA is very hard working, same as you, you are working together for the final projects. But of course during which the TA is also looking at you whether you are making efforts and contributions in your group or not. So the eventual assessment is very precise. You cannot escape the judge as a free rider.",
            "comment_grading": "Not so good, but understandable. Because anyway we can only have about the same very small percentage of people getting an A+. Anyway I think my grade is satisfying, worth my contribution. I am not the most hardworking one. One person in our group get an A+. He was really hard working and brought new ideas into the group. So he worth a A+. And TA and Professor know that for sure if you are the hard working one.",
            "comment_workload": "Work load is big, but it depends. you can be a free rider in the class and then you have nothing to do because its all group project and others may do for you. And during the classes you have less things to hear and remember. But for a good grade you should make sure when doing the job distribution you are willing to handle a tough part. That means you need to do a lot. In the end there will be rehearsals for the presentation so that must be time consuming. So you need to prepare.&nbsp;&nbsp;At the end of the semester you are required to write a self reflection essay. You not only have to write what you have learnt in yourself, but also what you have learnt from others.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JAI2ToMrpG7pR7zQzm6oAxQbcdcl4p8v",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 85,
                    "name": "SHANG, Chii",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AY",
            "date": "Jan 28, 2016",
            "title": "",
            "comment_content": "In this course, we learn some environmental issues such as how to reduce carbon in HK. Also, we learn study how to make a water filter for village people using. In addition, there was a free and nice trip to Mainland.",
            "comment_teaching": "All students learn from themselves and other group-mates during the project. TA will help a lot if you have some problem. Professor helps not much at all but he is nice to answer your question. A hard-working group-mate always plays an important role to score higher mark.",
            "comment_grading": "This course will grade depends on two presentation (projects) and one individual assignment. we dont know the assignment mark but we all know the grading system for two presentation are unfair. A group did a great result for filtering process but get lowerest mark in the class. Also discussion and attendance in class are important. I think these are the most important part. It seems that some students will get huge different grades within a same group. My overall grade is acceptable.<br /><br />*** Please dont find a free rider for being your partner. You must be regret of it.",
            "comment_workload": "It is easy to deal with.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}