{
    "error": false,
    "course": {
        "id": 248,
        "subject": "COMP",
        "code": "4632",
        "name": "Practicing Cybersecurity: Attacks and Counter-measures",
        "description": "This course equips students with cybersecurity knowledge and current IT practices on security risk management. Through hands-on laboratory sessions, students will understand existing IT security issues, learn how to assess IT security risks, and conduct experiments on ethical hacking. They will practice system attack and defense strategies using security tools, so as to gain practical experience to become a cybersecurity professional. The course covers current security trends, industrial practices on IT security, design requirements for secure web and mobile applications, security assessment, risk analysis and risk management. Knowledge in web programming and database administration is not essential but a plus.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2030,
            1930,
            1830,
            1730,
            1610,
            1510
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"2012\" href=\"/review/COMP2012\" target=\"_blank\">COMP 2012</a> OR <a class=\"course-link\" data-subject=\"COMP\" data-code=\"2012H\" href=\"/review/COMP2012H\" target=\"_blank\">COMP 2012H</a>",
        "corequisites": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"3511\" href=\"/review/COMP3511\" target=\"_blank\">COMP 3511</a>",
        "exclusions": "",
        "rating_content": 3,
        "rating_teaching": 2.44,
        "rating_grading": 2.67,
        "rating_workload": 2.56,
        "review_count": 9,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 800,
                "name": "IEONG, Sze Chung Ricci",
                "count": 9
            }
        ]
    },
    "reviews": [
        {
            "hash": "Dctm62mgK5PSR7bnNg4EXP8bof4CTqzv",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 800,
                    "name": "IEONG, Sze Chung Ricci",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Dipsy",
            "date": "Mar 20, 2020",
            "title": "啲人都9衝呢科垃圾on L 99 (無錯我又係on9 之一)",
            "comment_content": "so far 唔覺自己學到啲咩，唔識嘅繼續唔識，識嘅繼續依然識<br /><br />我無咩networking 背景，好多嘢做咗都唔知自己做咗咩，但即使做返本身自己識嘅web programming 都係唔知自己做緊啲咩，所以我都唔知係我自己嘅問題，定係啲material 同教學唔清晰嘅問題<br /><br />哎佢啲hacking 係度hack 現代人唔用嘅WEP 同vanilla PHP HTML4 standard 真係喊出來，感覺好似小朋友玩泥沙<br /><br />呢科成功扼殺我對cyber securities 嘅興趣",
            "comment_teaching": "成個教學團隊英文都唔多好，講嘢同寫嘢都幾吃力，所以我地聽得更吃力，lecturer 好似仲無咁嚴重，聽個TA講嘢會想打人，反正都係聽唔明，自己做lab sheet 好過啦，如果唔係會做唔切<br /><br />收返，啲Lab 都係1999 ，最仆街係個Lab5 ，後面好多Lab 同Assignment 2 都要用返，但個lab5 我做得唔好，你又唔同我講衰咩，點做落去呀<br /><br />我問個教授我Lab 5 會唔會做漏嘢，佢叫我俾AWS ip 佢test ，結果佢test 果陣就已經係grade 果陣，屌那星呃9我，浪費我啲錢長開個instance<br /><br />最後被扣分都係唔知咩事，有問題問TA，佢就rephrase 你個問題當答咗你，再唔係就射俾第二個TA，問教授，教授就射俾TA，都唔知呢條係teaching team 定係football team<br /><br />然後個Assignment 2 叫我地揾Lab5啲vulnerabilities 出來，仆你個街個Lab5 自由發揮又好似無得自由發揮咁，係有機會唔小心整走咗啲vulnerabilities，見到啲skeleton 有啲不明奇怪嘢梗係會刪鬼咗佢啦，用GET param 做login status 擺明會食屎啦，sql 全部text template 擺明會俾人inject 啦，display user input db column info 又唔escape html char 擺明會俾人XSS啦，我做lab5順手搞掂哂佢，仲點做Assignment 2 呀<br /><br />仲要懶係唔想leak 啲assignment 2答案出來，唔解䆁清楚lab 5想我地做咩<br /><br />迫啲學生專登整個漏洞處處嘅program，仲要佢地小心翼翼咁唔好整走啲漏洞， 真係吐血 。寧願佢直接俾Lab5 答案都唔好搞好咁成舊屎又學唔到嘢，我真係唔L想學vanilla php5.4 同HMTL4。Assignment2又唔知佢想要幾多vulnerabilities <br /><br />你以為你啲功課環環相扣好L 型呀，火燒連環船來咋",
            "comment_grading": "透明度0<br />完全唔知準則係咩<br />完全唔知佢想我地做咩<br />更加唔知個model answer 係咩<br /><br />最後成功withdraw 逃離魔掌",
            "comment_workload": "每個禮​拜唔見一日算唔算多，個Lab 永遠做唔切兼啲instructor 本人都要overrun先請得哂，小弟我資質有限，每次都要最少用兩日時間做<br /><br />小弟衷心佩服可以係lab section 做哂所有嘢嘅各位大神，請受小弟一拜(拜~",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 15,
            "vote_count": 16,
            "voted": false,
            "is_upvote": false,
            "comment_count": 6,
            "attachments": []
        },
        {
            "hash": "MX5LINZKhzXzUaBrMzRvDcNFytt9NCW2",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 800,
                    "name": "IEONG, Sze Chung Ricci",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "smallpotato tom",
            "date": "Jun 04, 2020",
            "title": "As course title states: &quot;Practical&quot;, but &quot;Hard&quot;",
            "comment_content": "Very fruitful and comprehensive, but quite hard to understand all the things.<br /><br />Week 1: Introduction to Cyber Security<br />- Set up virtualization environments like Azure Cloud Lab, AWS and CSE VM<br /><br />Week 2: Virtualization and Network, WiFi Security and Encryption<br />- Analyze network activities, PCAP<br />- WiFi cracking<br /><br />Week 3: Network Basics<br />- Set up AWS for web server<br /><br />Week 4: Network Security and Attack<br />- Introduce vulnerability scanning tool, Nessus<br /><br />Week 5: Web Application Programming<br />- Develop a simple web application using HTML, PHP and SQL<br /><br />Week 6: Web Application Hacking<br />- Introduce common web application vulnerabilities<br /><br />Week 7: OS System Security<br />- Privilege escalation and introduce Netcat<br /><br />Week 8: IAM, Authentication and Authorization<br />- Password cracking, access control security and 2FA<br /><br />Week 9: Application and Software Security<br />- Use buffer overflow to override authentication<br /><br />Week 10: Network Security Defense Mechanisms<br />- VPN, AWS Network Security Group and Snort IDS<br /><br />Week 11: Incident Handling and Web Log Analysis<br />- Introduce Elasticsearch and analyse Apache log",
            "comment_teaching": "In this semester, we had lessons in Zoom.<br /><br />Ricci was a good guy and had passion, though, his tone was really too boring. <br /><br />Lecture notes and actual teaching content had great difference. He liked to mention some concepts that did not exist in the lecture notes or lab when he saw some wordings on the notes (these concepts even appeared in the final exam). The most challenging thing was, it's not possible to concentrate on the 4-hour lessons all the time (lecture+lab), so probably some important concepts could be missed.<br /><br />Lecture notes and lab were not well designed too. The key content and relatively less important information were not balanced in the lecture notes. The instruction, requirement and questions in the lab were not clear enough.",
            "comment_grading": "Grading Scheme:<br />1. Lab work - 30%<br />2. Attendance (Required to attend all) - 10%<br />3. Two written assignments - 10%<br />4. Group presentation - 20%<br />5. Final exam (online quiz, open notes) - 30%<br /><br />Mine:<br />99% in lab work,<br />full marks in attendance and written assignments,<br />group presentation slightly above mean,<br />final exam above mean ~10 marks,<br />got an A.<br /><br />Ricci gave 10-15 students A range, and I actually did not master all the things. Fortune is really important.<br /><br />But the grading is still quite good to me.",
            "comment_workload": "No midterm, but the workload was still quite heavy for me.<br /><br />Weekly 4-hour lecture+lab really, really tortured us.<br /><br />We could have few days to finish each lab work, but they were not easy.<br /><br />2 assignments counted only 10% for the grade but they consumed a lot of time.<br /><br />The instruction and requirement for group presentation were not clear. Although it's officially called &quot;project&quot;, it's more likely a &quot;paper referencing assignment&quot;, but in group.<br /><br />Like other people stated, the final online canvas exam was a nightmare. Although it's open book, it's just a game of Google + fortune. Questions were shuffled. MC and short questions were mixed. We could not return to the previous questions once we went ahead. Time limit, of course, was not enough for many people.<br /><br />But if you have friends, many troubles can be solved (for the lab and assignments) :D",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hHNCyAD5b3wIlNnmNQBJpm82Jv460EmI",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 800,
                    "name": "IEONG, Sze Chung Ricci",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ImC4k",
            "date": "May 28, 2020",
            "title": "nope",
            "comment_content": "basic concepts on IT security and setup of virtual environment<br />OS security and virtualisation<br />networking basics<br />network security<br />web application programming and hacking<br />operating system security<br />IAM, authentication and authorisation<br />application security<br />infrastructure design<br />incident response<br />computer forensics<br /><br />some of the topics are outdated eg PHP programming<br /><br />don't study this course if you haven't done 3632 and 4621.",
            "comment_teaching": "please note that the class was conducted using zoom this semester.<br /><br />4hr consecutive lecture + lab was way too long to stay focused. <br /><br />Ricci is monotone most of the time, hard to focus.<br />TA explaining lab sections are bad. hard to follow due to speed.<br /><br />if you want to fully understand the content, watch the lecture video and search online. the only reason why I attended lecture during class time was because I could ask questions to TA during lab sections as well (somewhat helpful).<br /><br />classes were overrun every single time, I had to leave &quot;early&quot; for another class.",
            "comment_grading": "lab 30%<br />attendance 10%<br />2 assignments 5% each<br />group presentation 20%<br />final exam 30%<br /><br />assignments are unclear, lack of guideline, same goes for the group. <br />no marking scheme, no solution after submission, so we don't even know what we did wrong.<br /><br />final exam WTF. cannot go back and redo questions (we used canvas and zoom this semester); the required pcap file for Wireshark is zipped, required password to unlock and use special software to decompress. ultimately spent too much time troubleshooting and I skipped some of the related questions.",
            "comment_workload": "basically lab works every week. super demanding. although they go through the labs during class, it's not uncommon having to spend another 2-3 hours going through them after class because the labs were gone through super fast.<br /><br />throughout the semester, we have to use virtual machines from CSE department, Azure lab, AWS EC2 and (optionally) local virtual machines. CSE department servers are trash.<br /><br />this was my bucket list course from year 1, though I won't recommend studying this.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zameK0mu6EmQnmAE7J3GxfgzKiITdgvp",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 800,
                    "name": "IEONG, Sze Chung Ricci",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cshime",
            "date": "May 26, 2020",
            "title": "Really think twice before you register",
            "comment_content": "The course includes these things in each week (number represents the week):<br /><br />1. Basic concepts on IT Security / Setup VM environment<br />2. CentOS VM / Kali Linux / WiFi analysis and cracking / Wireshark / Virtual network<br />3. DNS / LAN and WAN / Directory services / SSL TLS / POODLE / WWW and FTP<br />4. Nmap scanning / sniffing / DoS attack / DNS info searching / Email attacks<br />5. PHP / HTML / CSS / Javascript / SQL / Web authentication / MySQL<br />6. OWASP 2017 top 10 attacks (teach 3 only, SQL injection / XSS / CSRF) / Web session management<br />7. System and kernel attack / patch management / Metasploit / reverse shell<br />8. IAM / Authentication / Authorization / Password cracking / Federated Auth.<br />9. Application security / Buffer overflow / Application firewall / secure code review / malware and virus<br />10. Network defense mechanisms / firewall / IDS / honeypot / VPN / Snort<br />11. Log analysis with Elastic Search / Kibana / Attack tracing<br /><br />WoW, I cannot imagine a student can master all of them within ONE SEMESTER! The content is so rich, I suggest you to better think twice before you study this course as you must suffer if you did not learn half of them before. Despite the content is very useful, it is a bit too much.<br /><br />Also, the technology used in some lessons are awful. Like the others said, PHP 5.4... I also don't know why I should use 2 hours to complete several html pages and write CSS in my Lab 5. It is a security course...",
            "comment_teaching": "Why I am giving D instead of E is completely because of Ricci. He is heartful in reminding us the important things we need to notice, no matter in completing the labs or during the lecture.<br /><br />However, the others are really SUCKS!<br /><br />Firstly, I even cannot receive suggested answer to the lab that I have submitted. I just receive the final marks to my lab exercises which I did it with a lot of questions in my mind. That means I cannot learn from my wrong.<br /><br />Secondly, the Canvas Quiz is awful. The question is completely randomized and you cannot go back to have a double check. The quiz last for 90 minutes but have 38 MC and 6 short questions, many of students did not have enough time I think. For me, I have to make a wild guess on 10 quesions when I realize I only have 5 minutes left.<br /><br />Thirdly, for the lab 3-5, it is really hard to follow. The situation becomes better after one student complained on canvas. But however, I think every student still needs around 1 day to complete 1 lab.",
            "comment_grading": "As this comment is written right after my quiz, so I don't know what grade will I receive and cannot give comments on the final grade.<br /><br />However, I could say that the grading should be without transparency.<br /><br />The scheme are as follows:<br />30% lab assignments<br />10% attendance<br />10% assignments<br />20% group presentation<br />30% final quiz<br /><br />4/6 UPDATE:<br />From what I have heard, if you have mean, you have B. <br /><br />Attendance is really important. One of my friend scored the same as me except attendance. He attended full lesson and I attended only 6 of them. His grade is B and my grade is C+.<br /><br />So, make sure you can attend all lesson. Don't just watch the lecture recordings like me.",
            "comment_workload": "Really high.<br /><br />Each week has a lab assignment, usually you need around 1-2 days to finish it.<br /><br />Also, each week teachs very deep. Despite you can learn a lot, you must suffer in searching related issues and concepts during the whole semester.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oruPcRaTdoF2qkWW1QmxGndK2RGi8ide",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 800,
                    "name": "IEONG, Sze Chung Ricci",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TrebledJ",
            "date": "May 20, 2023",
            "title": "A holistic survey of vocational cybersecurity skills",
            "comment_content": "If you're looking for hands-on stuff, you'll be disappointed in this course, except for the few labs on basic web attacks and binary attacks. Why disappointed? Because the majority of the course focuses on a high-level view, utilising offensive Kali tools (which automate a lot of the hacking process) and defensive tools (which automate a lot of the filtering and protection).<br /><br />Me? I already experienced hands-on attacks and fun in the Firebird CTF courses (COMP2633-4633). But cyber reality is far from just CTFs. Hence, I took this course to get a holistic understanding of attacks and countermeasures, learn Kali hacking tools, and familiarise myself with Windows. (Note one of the keywords in my title: vocational.) A lot of enterprise machines use Windows, and I haven't used Windows in a decade, so the opportunity to use Windows again was nice.<br /><br />Seriously, if you want to have fun with cyberattacks and mess around with vulnerabilities, I suggest taking 2633-4633 instead of this course. It's much more rewarding, exhilarating, and addicting. The “hacking” labs of 4632 are a joke compared to what you learn in 2633-4633 (assuming you put in effort, ofc).<br /><br />Those who are saying &quot;oh 4632 bad because PHP old and yuck&quot; are missing the point. Technology constantly evolves—no surprise. What you take out of this course shouldn't be the specific technology, but the underlying processes, reasoning, and attitude. Like- why do you think they teach C++ in 201X and not Python? Because pointers; raw, efficient algorithms, stripped of any garbage collection or automated process; low-levelness. Do you know how inefficient GitHub's markdown emoji picker is on long lines of text?<br /><br />Also don't focus on the version and tool that much. Do you think the C++11 they teach is enough for jobs? Companies are using C++17 now, and C++23 is around the corner. And the libraries/tools—Boost, Qt, clang, CMake—those are also useful. One of my friends, who has been using Flutter for a long time once complained: &quot;Haiyah, version updated. Need to learn so many things again.&quot; So don't get hung up on the tech. Focus on the processes and underlying (or err... overarching) things instead.<br /><br />Side note, and back to PHP: this was the first time I played with a traditional pure server-side language (well, Python Flask doesn't count here), so it was an interesting experience learning how it works and seeing how crappy its documentation and vulnerabilities truly are. Come to think of it, a lot of server side software (Flask, Django, etc.) are based on the same principle of substitutions and evaluations. I suppose another benefit of learning old tech is being able to critique it more precisely by understanding its flaws.<br /><br />Thanks for reading my rant.<br /><br />Syllabus hasn't changed; see other reviews.<br /><br />One thing they don't cover in the syllabus are modern cybersecurity vectors: blockchain/web3, AI, IoT. These were covered by group presentations though, so props to the groups that went there.",
            "comment_teaching": "I won't discuss much here. A large portion was taught to me by our good friends Google and ChatGPT.<br /><br />I only listened half-heartedly to Ricci's lectures while I worked on the labs. Ricci is nice though. Raises awareness of cybersecurity, recent cybersecurity news, and different fields (although biased towards forensics, i.e. his company/research). He takes time to answer our questions and prods us to think further (esp. during after-class questions).<br /><br />One of the TAs delivered well. If you know, you know. The other TAs... well... they could improve.<br /><br />To echo a few points:<br /><br />- TAs don't prepare well for labs unless it's their assigned lab. So make sure to ask for the right TA.<br />- Sometimes asking the people around you is more effective than asking TAs. Don't hesitate lah.<br /><br />So don't (solely) rely on TAs.<br /><br />Also, the lab/hw marking is rather lazy. Feedback is ambiguous, and that’s *if* they give any feedback at all. Dropping this from an A to a B.",
            "comment_grading": "I'll just echo and mention a few things.<br /><br />- No exemplars of successful assignments after grading; except from friends who got full marks.<br />- Some deductions on lab work aren't commented on. You're left to guess what went wrong.<br />- Fair overall, but could be more transparent.",
            "comment_workload": "Labs are taxing and occasionally overrun.<br /><br />The exam was very challenging, but pretty fun. Wish we had more time to complete it properly.<br /><br />Group presentation mechanics were... interesting. We're asked to record a 20-minute video of our presentation and submit it prior to presentation day. Makes sense, due to time constraints. Most groups just played their video, so it was quite chill.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2mfflh0xatGT6APqZDfTaxe1MoMDtjgQ",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 800,
                    "name": "IEONG, Sze Chung Ricci",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JustChill",
            "date": "May 05, 2023",
            "title": "An extreme waste of time",
            "comment_content": "There are other posts that listed the course content so I will skip them. But I have to add on the professor always spent tons of time talking about unrelated stuff and I am feeling a complete waste of time sitting in the class. <br /><br />Although I can see that the prof has the heart to promote the field of cybersecurity, the course is executed in the worst possible way and almost every aspect of this course is a complete failure. It became torture for me to go to the class every Friday. (But I still have to go because of the attendance requirement) I think students will feel much better if they just take some online courses to learn cybersecurity instead of joining this course.<br /><br />THANK YOU prof for ruining my interest in cybersecurity. Before I join the class, I have an interest to work in the cybersecurity field and I would like to learn more about it. But after joining this class, I HATE cybersecurity.<br /><br />*警世* If you would like to learn more about cybersecurity, PLEASE just take some online courses and do not register for this course. I had a genuine interest in cybersecurity so I choose not to trust the review on USTSpace before and registered for this course but I FXXKING REGRET my decision.",
            "comment_teaching": "Extremely boring tone.&nbsp;&nbsp;<br /><br />Also, the lecturer has extremely poor time management skills. The normal lecture time including the lab is 10:30-2:20. However, it overran almost every time, and there was a time when he finished the class at 3 pm. In my personal situation, I had another class at 3 pm, which meant that I did not have any time to grab some food for lunch, and I had to suffer from extreme hunger until my other class ended every Friday.<br /><br />The professor may defend himself by saying that we can actually leave the classroom earlier and watch the Zoom lecture video afterward. However, please be noted that the quality of the Zoom video is extremely poor. Sometimes the screen shown on the Zoom video did not match the content. This may be caused by the fact that the Prof/TA only shared the screen of one of the applications but forgot to switch the screen sharing in Zoom when they were using other applications. This led to the fact that I can only listen to the recording, but I am not able to see what the Prof/TA is actually doing on the screen. Moreover, the soundtrack of the Zoom video is also of extremely poor quality. Sometimes the prof walked away and talked to the entire class, but the Zoom video could only vaguely record his sound. I could not hear what he said entirely when he walked away from the mic.<br /><br />You may say that this is a face-to-face class, so it is normal that the quality of the Zoom video is poor. So, because of the poor quality of the video, I have to sit in the class physically until the class ends so that I can understand the course material.<br /><br />I strongly suggest that if the lecturer still insists to hold this course next year, either the course should start at 8/9 am so that students can enjoy their lunch after the class or it should start at 12/1 pm after everyone finished their lunch. Also, you should put in the class descriptions saying that “It is expected that there will be huge delays in the class time, so please do not arrange another class or activities right after this class”. In my situation, I still have a 40mins gap so at least I can give up my lunch to attend the class. But what if other people have something to do at 2:30 pm? <br /><br />Furthermore, most of the TA are extremely unknowledgeable. Most of the time, only one of the TA has prepared for the lab beforehand. The other TA did not understand the lab and was not able to answer my questions during lab time.<br /><br />I want to put teaching grade Z. E is not low enough.",
            "comment_grading": "To be fair, I did not get my final grade for the course yet. So, no comments for this part for now.",
            "comment_workload": "One lab each week including the add-drop period<br />Physical attendance required every week including the add-drop period<br />WTF? &quot;Ricci, do you know what is the meaning of the Add-drop period?&quot;<br /><br />Moreover, the grading of the lab exercises is extremely slow. Today is 25/4 already but I still have not yet received my grade for my lab exercise for lab 6 which was due on 15/3. I understand that the prof has his own company so he is probably very busy. But if I didn’t receive the feedback on my lab exercise timely, how can I learn and improve properly? I probably had forgotten what I have wrote after such a long time. Also, for the assignment, the prof only released the grades but did not mention why my mark got deducted and where I did wrong. The prof also did not release any model answers so how can I learn from my mistakes when I don’t even know what did I do wrong?",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wmhluX3GBE3H92YYbSUro5ECaIWl8SBZ",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 800,
                    "name": "IEONG, Sze Chung Ricci",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Michael Chin",
            "date": "Aug 26, 2021",
            "title": "Practical but need time to absorb",
            "comment_content": "Lot of lectures notes that is useless for the lectures and examination. The only useful things would be the labs. Basically teach you some existed hacking tools and network analysis tools. For example how to crack a wifi password, how to perform some web base attack (SQL injection, path traversal attack ... )",
            "comment_teaching": "Ricci's notes actually have so much content inside it. However, due to the large amount of information, there is no way for him to teach it all. As a result, usually he will just mention a very little part of the lecture note and tell you just read the others part by yourself. The Labs are interesting but it's not that easy. Basically you better to have some experience on Linux operation and some basic web deployment knowledge before get in this class",
            "comment_grading": "Well, not bad not good. For me, every things are just above mean a little bit, and finally i got a B+",
            "comment_workload": "1 presentation, 2 assignment, 1 final examination and labssssssss<br />For the presentation , you have a find a topic by yourself and just have a presentation about that topic.<br />For the 2 assignment, it is quite easy, just follow the instruction and complete them.<br />For the labs, although it is not that easy, but with the search on Google and ask for the TA, you could still got full marks with certain possibility.<br />The main issue would be the final exam. Since there are lot of notes included in this, you have no idea what you should prepare for the exam. The exam is open notes and open source, basically you can do whatever you what except the communication with others. Luckily, the exam question mainly focus on the labs operation. For example to capture the network communication and decrypt the message. So if it is known previously, you could have a better preparetion",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PNa4Di1MQfEHWE9SrWdIXMdbcy6mtPfQ",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 800,
                    "name": "IEONG, Sze Chung Ricci",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "hidden",
            "date": "Apr 14, 2020",
            "title": "極度不建議",
            "comment_content": "啲material太old school，2020年仲教緊人寫php5.4同html 4。明明呢個course嘅重點唔係呢度，點解要迫人寫爛code呢？<br />有底嘅人唔好預自己會學到新嘢，呢個course只會浪費你時間。",
            "comment_teaching": "Ricci講書吹水佬feel。<br />兩個TA其中一個睇得出都係幾有料，但對完全冇底嘅同學仔嚟講佢個lab去得太快。<br />另一個TA就普普通通。",
            "comment_grading": "Lab俾分好迷, lab5個PHP lab本身就係多bug, Ricci話係for之後assignment用, ok fine。之後轉個頭又扣人分。仲要死得不明不白，TA又係永遠都唔會直接話你知錯乜，好似猜緊迷咁，令人完全零動力從錯誤中學習。",
            "comment_workload": "上堂overrun做唔切係例排，要自己抽時間出嚟做。部分Lab questions同Assignments意義不大。",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "I9DWBr6o1PNCxcU6LSLd3JxKOOlAbH8u",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 800,
                    "name": "IEONG, Sze Chung Ricci",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anonymouse",
            "date": "Jan 17, 2016",
            "title": "每個 CSE 學生都應該讀",
            "comment_content": "呢個 course 既內容圍繞好多作為 IT 人應該認識而科大係從來無教過既 security 課題<br />例如 XSS Cross Site Scripting, SQL Injection, Code Decompliation, Buffer Overflow, Crack Wifi 等等<br />課堂方面，只係每個禮拜返黎上一個5個鐘既 lab + lecture<br />一般lecture 會佔一個鐘左右，去講解今日做既 lab 既 concept。而之後果四個鐘就會用 VMWare set up virtual machines 去試唔同既 Attack<br />唔需要太擔心自己無security底，不過真係應該要有network概念。Lab sheet基本上係續個step&nbsp;&nbsp;教你做，當然會有minor 部份要思考，例如比一個 .pcap file 你，然後你就要係還原返d traffic 出黎去估呢部電腦係點樣比人攻擊過，又或者係instructor set up vm 比你，然後你就要試圖用 sql injection 既方法去拎入面既資料。<br /><br />整體黎講，學左好多野，不過唔知下年仲有無得開",
            "comment_teaching": "Instructor 講書清楚，但有時會有小小悶(10點半堂)",
            "comment_grading": "正常Grade，Mean 大概係 B-<br />但有心讀過Mean唔難<br />考試高MEAN 1個 SD -&gt; A-",
            "comment_workload": "三份功課，都係輕鬆野<br />Assignment 1 : 寫一份 Vulnerability Scanning Report (5分)<br />Assignment 2 : 寫一個PHP網頁 (大部份code都比左你) (10分)<br />Assignment 3 : 針對之前 Assignment 2 寫既網頁，去寫一份 Penetration Test Report (15分)<br /><br />不過有樣野要留意就係千奇唔可以走堂，因為每堂既內容都係連住，同埋 Attendance 係計分",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 20,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}