{
    "error": false,
    "course": {
        "id": 2944,
        "subject": "COMP",
        "code": "4910",
        "name": "Co-op Program",
        "description": "Students in this co-op program will be engaged in practical hands-on training for a period of at least 5 months working in an organization or company that provides qualified training relevant to the computer engineering profession. Students are required to complete a final year project under the supervision of an industrial supervisor and a faculty member during the co-op. May be graded PP. For COMP and COSC students in their third or fourth year of study only. Approval of the course coordinator is required for enrollment in the course.",
        "categories": [],
        "website": null,
        "credits": 6,
        "semesters": [
            2230,
            2220,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"4981\" href=\"/review/COMP4981\" target=\"_blank\">COMP 4981</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"4981H\" href=\"/review/COMP4981H\" target=\"_blank\">COMP 4981H</a>",
        "rating_content": 1,
        "rating_teaching": 5,
        "rating_grading": 5,
        "rating_workload": 5,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [
        {
            "hash": "XhtdiSPcEBlzbhnESEToLkcA2ezSbRxb",
            "semester": "2022-23 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Never Social",
            "date": "Feb 20, 2023",
            "title": "RISK doing irrelevant work for the entirety of your employment",
            "comment_content": "According to the COMP4910 information to employer page, the participating industrial company is supposed to compose a workload similar to a FYP project. I am hugely disappointed that the school does not examine and communicate with the industrial party to ensure a relevant and coherent set of workload is assigned in actuality.<br /><br />In my experience, none of the person in the team (team formed and started way before I joined) is aware of COMP4910's nature, obviously they have no interest in catering your reporting needs since the campus relationship team who signed up for this is irrelevant (they don't make money 🗿) . Therefore, you are just a regular employee to the project manager and you may experience the following scenario that will fuck up your reporting. <br />1. Being assigned to deal with project management work, have fun doing clerical work (spreadsheets, presentations).<br />2. Being assigned to multiple projects. I was told that this project (in their pov) is scheduled to be completed a month or two after I commence.<br /><br />You should have communicated! The industry and the school could both have said that. In this hypothetical situation they are well aware that they have authority (def. the power or right to give orders, make decisions, and enforce obedience) and your only option is say haha yes and suck it up. Any refutation will lead to bureaucracy and coercion. It's just a cruel fact that in this powerplay, students are the one with the lower hand and spring pocket fully exposed. A mirror of the numerous times when your grade suffer when the course logistic fucked up. Understandably, both of them have incentives to appeal to each other, so if there is an issue that result in conflict of interest u are the one to blame with an arbitary reason, will you refuse complying to this &quot;resolution&quot; and risk graduation? Probably not. Knowing that u will do whatever the fuck the company assigned and you are not able to switch to another company, I honestly can't imagine how a person can write up an COMP FYP report when the company assign no code task what so ever. &quot;In this COMP project I participated in 5 irrelevant projects, I wrote meeting minutes, make spreadsheets and presentation decks?&quot; your graders may be sympathetic to your difficulties but they also have to suck it up (comply to the grading scheme).<br /><br />Overall my experience so far aren't as bad, the scenario above are just worst case. By pure luck, I'm assigned a piece of software (unlike another CS intern being assigned business bullshit) and the project completion date is changed for an unnamed reason. But I do hope by this time I have conveyed the fact that your project's presentation is highly dependent on the commitment of the participating industrial company towards upholding the non-binding pact betweem them and ust.",
            "comment_teaching": "N/A",
            "comment_grading": "Don't care.",
            "comment_workload": "Honestly most of you at this point had your honors set in stone, so just fuck all and do the bare minimum to not get fired.",
            "rating_content": 1,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}