{
    "error": false,
    "course": {
        "id": 217,
        "subject": "COMP",
        "code": "3021",
        "name": "Java Programming",
        "description": "Introduction to Java programming. Fundamentals include language syntax, object-oriented programming, inheritance, polymorphism, exception handling, multithreading and lambdas. Standard libraries for input/output, graphics programming, built-in data structures. Programming for events, generics and higher-order functions.",
        "categories": [],
        "website": "https://course.cse.ust.hk/comp3021/",
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"2012\" href=\"/review/COMP2012\" target=\"_blank\">COMP 2012</a> OR <a class=\"course-link\" data-subject=\"COMP\" data-code=\"2012H\" href=\"/review/COMP2012H\" target=\"_blank\">COMP 2012H</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"ISOM\" data-code=\"3320\" href=\"/review/ISOM3320\" target=\"_blank\">ISOM 3320</a>",
        "rating_content": 3.32,
        "rating_teaching": 3.38,
        "rating_grading": 3.08,
        "rating_workload": 3.11,
        "review_count": 37,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 110,
                "name": "ZHANG, Charles Chuan",
                "count": 14
            },
            {
                "id": 118,
                "name": "CHEUNG, Shing Chi",
                "count": 10
            },
            {
                "id": 799,
                "name": "LAM, Ngok",
                "count": 6
            },
            {
                "id": 846,
                "name": "TSOI, Yau Chat",
                "count": 3
            },
            {
                "id": 96,
                "name": "KIM, Sung Hun",
                "count": 1
            },
            {
                "id": 108,
                "name": "LIN, Fangzhen",
                "count": 1
            },
            {
                "id": 1576,
                "name": "CHEUNG, Shing-Chi",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "LkJh54zJDe6YmhDi7U0XVjDoW9tanjWz",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "高海千歌",
            "date": "May 30, 2022",
            "title": "EVERYTHING IS FUCKED UP, EVERYTHING!!! (Alert : Long comments)",
            "comment_content": "(Update 21/10/2022)<br />As my comment floats to the top and the 4 Es may deflect the judgement of people who want to enroll this course in the furture. I make a disclaimer here.<br /><br />If you see 4 Es in this comment session, those are ONLY applicable for 2022 Spring, or any session where the name &quot;ZHANG, Charles Chuan&quot; appears on the name of the instructor in the future (I hope it will never happen though...). For other professors, they are fine and you can consider enrolling their session. Originally, this is a good course but it is completely ruined by this professor, as well as the ratings here.<br /><br />Anyway, I still encourage you to read this comment to see how shxt this professor is and try to avoid him in the future.<br /><br />Ah, btw, I get a B- eventually. I dont know what happened but I sincerely appreciate for Charles's last pity for not killing me straightly. However, I will still regard this learning experience as TRASH. Don't think a non-C-range can bribe me and change my mind Charles<br /><br />------------------- Disclaimer end --------------------<br /><br />1. Object and Classes<br />2. Strings<br />3. Inheritance and polymorphism<br />4. Exceptions and text I/O<br />5. Abstract classes and interfaces<br />6. Generics<br />7. Inner Classes<br />8. Functional programming and lambda expressions<br />9. Event-driven Programming with Java FX<br />10. Multithreading<br />11. Aspect-oriented Programming in Java (Optional)<br /><br />Content-wise, it is still OK as it teaches the fundamental of Java. For a Java beginner, I still learn something. The only problem is it still teaches outdated Java FX. Fine, the professor also knows it is outdated so he just skim through the topic in like one to two lectures. However...<br /><br />WHY THE FUCK YOU HAVE TWO LABS WITH JAVAFX??? WITH BUNCH OF METHODSSSSSS TO BE IMPLEMENTED??????<br /><br />Teaches the least, contains the most content in labs...<br /><br />Ok so if you think this has been the worst part of the course, don't worry, please read the other three titles.",
            "comment_teaching": "Since this part is ultimately long so I put the central idea first : When you see this prof teaching this course, PLEASE DON'T REG. THIS GUY IS DEKAI 2.0. Wait for SC Cheung or Alex. Or if you don't mind your elective requirement then just find another elective. FreeCodeCamp is your good friend for learning Java. Anyway, STAY AWAY FROM THIS PROFESSOR!!!<br /><br />Great, talk about the teaching, I am indeed speechless but I still try to describe it out with words so that other people can know what is happening.<br /><br />First, talk about the professor, he is a quite chill guy. He plays music before lecture starts. However, he speaks very very slow. Even I play the lecture recording in 1.25x I still find no difference from a normal person talking. Also, he hesitates a lot. These make me hard to concentrate. Moreover, it seems like he doesn't know Java very clearly. Quite often when students asked questions, he didn't know how to answer. I think he is not a really professional Java programmer.<br /><br />However, the lecture is not the worst thing. The worst thing is his course management strategies. <br /><br />The most annoying thing is, his plan keeps changing. At the first lecture, he proposed for 3 PAs and a regular final exam. But at a particular instance of the semester, he changes his mind by adding one more PA (which due during final exam period), shrinking (not cancel) the scale of final (in terms of both amount and grade proportion) and adding unknown amount of assessment tasks. THANK YOU PROF <br /><br />Ok so these are still not quite a big deal compared to the below things. Here comes the real annoyance <br /><br />When everyone feels happy and relieved about the semester finally ends...<br /><br />Professor : SUrPRisE MoThERFuCkER<br /><br />Guess what. He add an assessment task (2nd coding interview) AFTER THE FINAL EXAM, without any prior notification. It just comes randomly, arbitrarily, out of thin air. WHAT THE FUCK? <br /><br />Originally, the coding interview was announced on 26 May and due on 27 May (I am not lying, one day due). This triggered a lot of students because 27 and 28 May still has final exam (For me I have COMP2211 and COMP3111 final in these two days) and the due date is short. Therefore, he changes his mind AGAIN. Instead of asking every students to submit a respond document, he randomly picked 60 students (in 109 students) to have a Zoom interview on 30 May, which is today.<br /><br />I just can't get it why he insists to hold a interview RANDOMLY and AFTER FINAL. Do you know how I feel about that? <br /><br />I think many of you have played New Super Mario Bros Wii right? When I played it for the first time, I feel relieved that Bowser is finally defeated in the last castle stage. However, a witch comes out and after some magic, Bowser recovers and become giant. When I see that I think : OMG I still need to beat Bowser again? That's my feeling<br /><br />For some translation : When I feel relieved that final period ends, this course ends, the whole semester ends, this motherfuxker gives out a pop-up assessment, which frustrates me deeply. I just want some rest.<br /><br />Also, I can't get it why he randomly picked 60 people only, which will make the situation more unfair.<br /><br />Another thing really triggered me is that, even though the course is in complete chaos and professor is clearly torturing us, he still thinks that he is a nice person, these things help us and he does a good job. He claimed that these policies are helping us to &quot;overcome the hard covid period&quot; and &quot;give us more practical practice for Java&quot; . I just got annoyed by these nonsense.<br /><br />Then, the TAs, which are the assistants of professor torturing us. They are not only useless in the lab (Only repeat the ppt), but also nearly made mistakes in any part of their work, which worsen the situation. They are like coming to troll and sabotage us. Here are some examples :<br />1. Labs contained many bugs<br />2. PA contains BUGS and WRONG TEST CASES<br />3. In the midterm coding demo, they gives out WRONG TEST CASES as well, which seriously affect the judgement of students under such a pressure test<br />4. In the final, two of the TAs mistaken the exam time from 15 mins to 20 mins<br /><br />I think these mistakes are very ridiculous, unreasonable and unprofessional. I have never meet a programming course which contains these huge amount of mistakes (We all should appreciate the professional COMP2011 and COMP2012 teaching team). <br /><br />So everything went wrong, and how did the professor deal with it? Make-up. Make-up. Make-up. Anything went wrong just make-up. All midterm and final has make-up (Not maximum policy, so if you screwed up in make-up. Congratulations, you waste time and effort in decreasing your score). I just feel tired when we have 4 midterms and 2 finals in one course. When I am dealing with this course, I hope my life can also have a make-up then I will straightly jump mushroom right now. Unfortunately this is not true. <br /><br />Although prof try to compensate us by offering make-up, I just got annoyed by them. Instead of make-up everything, he should ensure things do not go wrong (Just look at 2011 or 2012, will these programming course be this chaotic?). This is the duty and responsibility of being the course coordinator. It is infuriating that the teaching team made a lot of mistakes but students need to take the accountability and join the make-up. Why? What did we do wrong? We did nothing. All mistakes come from your fucking stupid teaching team. And now we need to waste more time and effort to prepare for those make-upssssss in order to compensate your fault?????? Moreover, the repeated mistakes also implies that professor and TA never learn from history, which is very disappointing.<br /><br />Also, although the professor tries to make the course more fruitful and more practical, unfortunately, they need to be executed CORRECTLY. Otherwise, it will backfire. This professor genuinely does not know how to manage a course but he keep proposing more ideas to make the situation even worse. Currently, everything went wrong and every student in this course is suffering. This course is off the track in any possible direction and it is full of unfairness. It is a catastrophic failure. If you cannot ensure things can be executed correctly, then please don't propose them out. Just adopt the usual course structure. Your proposed changes just created a more unfair situation and tortured students more. WHAT IS THE POINT?<br /><br />The only good thing from this course is that the professor opened a complain board (forum), where students can complain anonymously. GOOD, because now everyone can see how we suffered from this piece of shit. Everyone can see how desperate, helpless, frustrated and angry we are. <br /><br />Very probably the fucking prof and TAs deal with none of the complaints; but have been reading it with a big smile on their face, just like those celebrities watching player falling from the glass bridge one-by-one in Squid Game.<br /><br />If you are interested, please access the website below (I swear it is not virus or rickroll. If it is then i get five Ds in this semester)<br /><br />Website of complain board : https://xoyondo.com/mb/2WXq6OJsZWP5cZk<br /><br />I use 3 songs to summarize this course. Prof I recommend you to play them in your lecture because they fits you:<br />https://www.youtube.com/watch?v=X-KwYX2u8e4<br />https://www.youtube.com/watch?v=gkTb9GP9lVI<br />https://www.youtube.com/watch?v=_B0CyOAO8y0 <br />(ps : 1.25x speed is recommended for the third one)<br /><br />(I can't believe I used half hour to criticize a course...But I am very angry about this course so I just did it. If here has option of F I will definitely give all Fs)<br /><br />(Update 31/5/2022)<br />Now the prof made a new BIG TROLL. For our PA4, he proposed a new marking scheme today suddenly. Aside from the correctness of the code (output checking), now the semantics are also take into account. Specifically, &quot;Whether your code is robust and close to the best practice for the programming task&quot; (From prof. email). That is, if your output is correct but you write spaghetti code then you will still got point deduction.<br /><br />(The above coding review part is applicable for non-interview students only. For interview student, they will consider interview performance instead.)<br /><br />In 109 of students, 78 students got marks deduction, either -12 marks or -24 marks out of 100 marks<br /> <br />I GOT DEDUCTED BY 24 MARKS. WOW<br /><br />I mean...it is good to ask student not to write spaghetti code and practice for a good programming habit. However,<br /><br />YOU NEVER MENTION IT BEFORE<br /><br />How can your marking scheme change suddenly after we submitted the assignment? Does that even sound fair??? University always emphasize honesty and warns student not to cheat, but now this professor shows ZERO HONESTY and cheated on us. <br /><br />I start suspecting the whole teaching team did these things deliberately due to some reasons (Revenge?). I can't imagine the whole teaching team is stupid as fuck and did EVERYTHING wrong.&nbsp;&nbsp;Moreover, the teaching team start trolling and sabotage us after the SFQ is due so that we cannot change the ratings. GOOD. I will blacklist this prof forever.<br /><br />Anyway, I am done with this course. As long as you don't give me F then I am contented.<br /><br />(Update 31/5/2022 13:27)<br />Fine, since too many students complained, the professor finally gives up this new policy",
            "comment_grading": "1. Labs 10%<br />2. Lecture exercise 10%<br />3. Programming assignments (10%+15%+15%+15%)<br />4. Mid-term coding show (5%+10%)<br />5. Final exam (10%)<br />6. Coding interview (??%+??%)<br />7. Bonus of finding error (+2% max)<br /><br />The only thing I would say is : GARBAGE<br /><br />The proportion of daily assessment and exam assessment is 75:25. For a programming course, it is a nightmare. Because everyone will just get full marks in daily assessment, which means everyone has got 75% by default (If not then you have already died). Moreover, the mid-term coding shows are also easy. Many people just get &gt;90% or even get bonuses. <br /><br />So the only component to determine your fate is the final. And guess what is the format?<br /><br />20 T/F questions, in 15 mins<br /><br />Great, my grade just comes from luck. Even if you don't know something, you can treat it as a random lottery and you may still get good grade because P( getting a question right) = 1/2. RIDICULOUS. <br /><br />As a result, everyone will very likely to get &gt;90%, and imagine getting overall &gt;90% but ends up a C range, how will you feel? <br /><br />Someone makes joke:<br />100% : A<br />99% : B<br />98% : C<br />97% : D<br />&lt;=96% : F<br /><br />I doubted whether it is joke now<br /><br />These assessments and grading scheme just failed to discriminate students' ability so they are indeed TRASH.<br /><br />Moreover, if you ask why do I put question marks in the proportion of coding interview, that's because even the professor nor the course website didn't mentioned the proportion at all. The two coding interview just popped out randomly. We are being told and threatened that they may affect our grade and if we don't do the interview then we will receive marks deduction. That's all. It is non-transparent as fuck<br /><br />Ok so now I finally know what the coding interview is for. Please see the updated part (the last paragraph) in &quot;TEACHING&quot; (Update 31/5/2022)<br /><br />Grade has not been released yet. After released I will update. But being a newbie of Java and make quite a few mistakes, very probably I will get C range. RIP my cga<br /><br />Even though the grade is unexpectedly good, I will still regard this course is a trash course since the arrangement is in chaos and ridiculous.",
            "comment_workload": "1.) 9 Labs (2 can be skipped) + 4 PAs<br />Usual programming course work. Nothing special.<br /><br />One interesting thing is, for this course, labs are even harder than PA. I don't know why. Moreover, in this course, labs and PA lacks instructions. Quite often I just got lost when reading the lab ppt or PA description. TA are also useless so you will got lost easily.<br /><br />2.) Lecture exercise<br />a.k.a. attendance. Not every lectures have but it is pop-up randomly so you cannot skip class unless you have friends to carry you. Even though you submit piece of shit you still get the point. <br /><br />3.) 2 midterm coding demo (+ 2 make-up)<br />Midterm exam. However, it is in coding format. Specifically, you will get the problem description at the beginning of the midterm. Then, you need to write programs to solve it and submit to Canvas. The time limit is short, if you are not familiar enough you may got stuck and cannot finish the tasks.<br /><br />Unfortunately, the logistics are in a mess. As mentioned in &quot;Teaching&quot; part. TAs perform badly in handling the exam as they can gives out WRONG TEST CASES. Moreover, we are divided into four timeslots to attend the exam. Some students claimed that the problem in different time sessions are same or similar and this may lead to cheating or unfair situation. As a result, both midterms got make-up<br /><br />4.) Final (+ make-up) <br />As mentioned before, 20 T/F questions. Lottery time<br /><br />Also, as mentioned before, due to two stupid TAs mistaking the exam time limit and the subsequent unfair situation, we got to make-up AGAIN<br /><br />5.) 2 coding interview<br />You will need to propose modifications or new features to existing lab tasks or PA (Maybe prof or TAs are lazy to design the tasks for next year). The first one you need to submit document. The second one is Zoom interview and only 60 out of 109 students need to attend.<br /><br />------------------------------------------------------------<br />As a 3 cred course, the workload is somewhat equivalent to or even more than comp2011 or comp2012, which are 4 cred course. And the number of exams...BRAVO<br /><br />Moreover, I think the toughest workload is that we need to bear the repeated and repeated mistakes made by the TAs and the unreasonable arrangement from the professor. The psychological impact and frustration is much more heavier than those physical workload. At the end of the course, my heart is just tired as fuck.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 59,
            "vote_count": 59,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "K4pd82csRcXz9G9sbgYGlgcx5jcPl3jz",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "MissSomebody",
            "date": "May 29, 2022",
            "title": "應該會係COMP3021 教得最垃圾既一個SEM",
            "comment_content": "1. Object and Classes<br />2. Strings<br />3. Inheritance and polymorphism<br />4. Exceptions and text I/O<br />5. Abstract classes and interfaces<br />6. Generics<br />7. Inner Classes<br />8. Functional programming and lambda expressions<br />9. Event-driven Programming with Java FX<br />10. Multithreading<br />11. Aspect-oriented Programming in Java<br /><br />咩年代 仲教Java FX? 邊個用",
            "comment_teaching": "條友以為自己教得好好 但其實勁垃圾<br />堂堂LECTURE都播歌以為自己好Chill 教好d書先啦<br /><br />最好笑既係 上堂問佢lecture入面d answer 佢好好野叫你自己去compile 唔好乜都問佢<br /><br />記得有一堂有個同學問佢野 唔知佢係唔識定點 話下堂會講 點知下堂都無答到 <br /><br />整個complaint board出黎 都唔知有冇睇<br /><br />d TA 又向左走向右走, midterm final 乜都可以remake 可唔可以remake埋個prof同ta佢?<br /><br />最向左走向右走係 完L左SEM 仲加份唔知乜春Assignment interview, 連佔overall幾多%都唔講 都CLS. 咁L得閒<br /><br />總結：<br />根本學唔到野 全部chapter都係自己上網學 多謝charles zhan g you are a good guy<br />gg la ha",
            "comment_grading": "1.\tLab Participation 10%<br />2.\tLecture Participation 10%<br />3.\tAssignments\t4份 55%<br />4.\tMidterm Coding Show 15%<br />5.\tFinal Assessment 10%<br /><br />Final exam True/False 15分鐘 20條 根本睇運氣<br /><br />Overall 96/100 食B 好野",
            "comment_workload": "what is workload exam period出一堆additional work 又加assignment interview <br />做左既人就慘了 一開始仲要扣分制interview 見到自己扣分都唔好話唔驚 個cut off 1,2 分就一個subgrade. 點知到最後全部cancel, 又白驚又白做.<br /><br />Conclusion:<br />In Charles, We trust.<br />Charles: 彈出又彈入 你吹得我漲啊",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 34,
            "vote_count": 34,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AXYgwz24Du4p4iCXBbuQDxRgrewfukl8",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "L.LP",
            "date": "May 30, 2022",
            "title": "Professor please play this song -&gt; 凛として時雨 『unravel』",
            "comment_content": "Welcome to Sosc 3021,<br />This course teaches you how to be tolerant.<br /><br />You should forgive the TA and professor to give you peace of mind.<br /><br />Prof teaches you how to play Suona (嗩呐）<br /><br />Topics:<br />1. How to listen to a bad presenter<br />2. How to forgive TA's mistakes<br />3. How to cooperate with cheaters<br />4. How to pray to be luckier<br />5. How to accept your failure<br />6. How to write a complain letter",
            "comment_teaching": "Garbage. <br /><br />What I mean is garbage is just garbage.<br /><br />Professor is a DJ. He knows how to play music but doesn't know how to teach Java.<br />e.g., he cannot answer students' questions, and his eclipse always gets a problem running the demo code. <br />We all know most of the professors in HKUST read ppt only, but he can't even read ppt in a fluent way. <br /><br />The funniest thing is that there are students who praise the professor because of his &quot;good taste&quot; in music; in Chinese, we call it 擦鞋仔.<br /><br />He provides us a platform to complain about his teaching, but he never reads those comments.<br /><br />He said, &quot; I am a nice guy, so even if you don't remember to attend the first midterm, you can attend the make-up exam.&quot; <br />(When students ask him about the letter grade, he replied, &quot; I will follow HKUST policy&quot;)<br />:) Nice Guy.<br /><br />Of course, there are in-class exercises, but they are useless. Those in-class exercises will not help your final exam since the final exam is purely T/F.<br /><br />In conclusion, his arrangement and teaching are even worse than Dekai's. Sorry, Dekai.",
            "comment_grading": "Assessments:<br />2&nbsp;&nbsp;* Final exam<br />4&nbsp;&nbsp;* midterm exam<br />9&nbsp;&nbsp;* labs<br />5&nbsp;&nbsp;* Assignment<br />13 * in-class exercises<br /><br />Scores:<br />Final exam 1 mean: 12/20<br />Final exam after make-up: 14 / 20<br />High: 18<br /><br />Midterm exam 1 mean: ~ 4.2 / 5<br />Midterm exam 1 after make-up: ~ 4.41 / 5<br />High: 6<br /><br />Midterm exam 2 mean: ~ 8.1 / 10<br />Midterm exam 2 after make-up: ~ 8.65 / 10<br />High: 11<br /><br />lab1 Using Git in Eclipse mean: 1.98 / 2<br />lab2 Creating Classes and Objects mean: 1.92 / 2<br />lab3 Notes Sorting and Searching mean: 1.84 / 2<br />lab4 File IO mean: 1.91 / 2<br />lab5 Generic mean: 1.89 / 2<br />lab6 Lambda mean: 1.91 / 2 <br />lab7 GUI programming mean: 1.83 / 2<br />lab8 GUI programming mean: 1.71 / 2<br />lab9 Using Threads in Java mean:&nbsp;&nbsp;1.74 / 2<br /><br />Assignment 1 Quarantine System mean:&nbsp;&nbsp;<br />98.75 / 100 (10 bonus points)<br /><br />Assignment 2 String Processing System mean: <br /> 96.34 / 100<br /><br />Assignment 3 Task Management (Lambda) mean: <br />95.44 / 100<br /><br />Assignment 4 Banking System (Threading) mean:<br />75/ 100 (its mark depends on assignment 5. if you are not lucky, you will be invited to an interview with lovely TAs. There are chances you get marks deducted.<br /><br />Assignment 5,&nbsp;&nbsp;69 / 108 of us will be invited to the coding interview: <br />(additional and hidden task) Why is this one hidden? The professor wants to select some of us to get a marks deduction since he is a &quot;Nice guy.&quot;<br />It's like HKDSE. After finishing all the examinations, you plan everything, including traveling, Etc. However, you received a phone call one day, and you are invited to join an SBA interview... <br /><br />Exams:<br />Students are divided into four sessions, and each session is held in a different time slot. However, those sessions' question paper is very, very similar.<br />So students who have friends in this course can get better grades. Unfortunately, a toxic guy like me sucks.<br /><br />The examination is similar to the code below:<br />////////////////////////////////////////////////////////////////////////////<br />interface make-up {<br />&nbsp;&nbsp;&nbsp;&nbsp;void remake();<br />}<br /><br /> /*15 minutes T/F final exam, students are required to answer it in the text file. ( if you don't remember to save the txt file or misorder your answer, you suffer.) */<br /><br />/*Some sessions are offered for 20 minutes; in One Piece, we called them&nbsp;&nbsp;&quot;Heavenly Celestial Dragon&quot; (天龍人). They have not only 20 minutes to answer the questions but also one more chance to attend the make-up exam.*/<br /><br />class Final_Exam implements make-up {<br /> public Final_Exam () {<br />&nbsp;&nbsp;&nbsp;remake();<br /> }<br /><br />// Mean increases by 10% after the make-up exam.<br />void increase_mean () {<br />&nbsp;&nbsp;<br />}<br /><br />/* unfortunately, make-up is an interface. we must override remake. */<br />void remake() {<br />&nbsp;&nbsp;&nbsp;&nbsp;increase_mean();<br />}<br /><br />}<br /><br /><br />/*<br />Professor called it a &quot;CODING SHOW.&quot;<br />Testing criteria:<br />1. file downloading speed,<br />2. IDE selection,<br />3. project importing speed<br />You need to program a class and an interface in 10 minutes. If you can do it within 5 minutes, you can get a bonus point. (students in the later exam session benefits since they know the exam format and question type)<br />*/<br />class Midterm_1 implements make-up {<br /><br /> public Midterm_1 () {<br />&nbsp;&nbsp;&nbsp;remake();<br /> }<br /><br />void increase_mean () {<br /> ....<br />}<br /><br />/* unfortunately, make-up is an interface. we must override remake. */<br />void remake() {<br />&nbsp;&nbsp;&nbsp;&nbsp;increase_mean();<br />}<br /><br />}<br />/*<br />it tests you how to implement bubble sort.<br />TA gave us ~5000 wrong test cases.<br />my computer takes few seconds to run it.<br />Sorry for the poor computer..<br />Originally I can get a full mark, but the test cases affect my judgement.<br />As usual, students in the later session can copy and paste the format and coding which is very FAIR.<br />*/<br />class Midterm_2 implements make-up {<br /><br /> public Midterm_2 () {<br />&nbsp;&nbsp;&nbsp;remake();<br /> }<br /><br />void increase_mean () {<br /> ....<br />}<br /><br />/* unfortunately, make-up is an interface. we must override remake. */<br />void remake() {<br />&nbsp;&nbsp;&nbsp;&nbsp;increase_mean();<br />}<br /><br />}",
            "comment_workload": "2&nbsp;&nbsp;* Final exam<br />4&nbsp;&nbsp;* midterm exam<br />9&nbsp;&nbsp;* labs<br />5&nbsp;&nbsp;* Assignment<br />13 * in-class exercises<br /><br />Painful.<br />This song summarizes my feeling.<br />https://www.youtube.com/watch?v=Fve_lHIPa-I<br /><br />This is the complain board for your reference:<br />https://xoyondo.com/mb/2WXq6OJsZWP5cZk<br /><br /><br />05/06/2022:<br />professor loves cheaters, he deducts their assignment 4 by 20 % only.<br /> It's like 中忍考試 in Naruto.<br /><br />06/06/2022：<br />100% A-,<br />98% B+,<br />94.5%B -,<br /><br /><br /><br />Recommendation:<br />You should go to Wong Tai Sin Temple before registering the lecture.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 31,
            "vote_count": 31,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rb1Egf3MwJi3mEL8g8XRY12y1QwUu5qf",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Good",
            "date": "May 30, 2022",
            "title": "A make-up can make up everything and fxxk up students, run 润！",
            "comment_content": "To be honest, the content of Java is very important and interesting, but the powerpoints are horrible to read. Prof directly copied and pasted Desmond and Alex's PowerPoint, leading to an awkward situation where he cannot understand and explain many questions in the PowerPoint. Most of the time, I am self-learning via youtube and Bilibili.<br />There are four programming assignments. All of the four assignments are extremely near 100 points since they are just too easy and with too many bugs. I don't really understand why a COMP 3xxx course's programming assignment only tests a student's ability of how to use String Class's default method. Except for PA1, all the remaining PAs are just copies of the demonstration code from the textbook. Even the labs are more difficult than PAs but the labs are derived from the past years' lectures. TAs are too lazy to prepare anything solid.",
            "comment_teaching": "Don't read the PowerPoint and say &quot;syntax sugar! more fun!&quot; please. It should be better for the professor to do the research rather than teach students. To be honest, these four TAs are maybe the TAs with the most dazzling resume. But it doesn't influence that they know nothing about Java and know how to communicate with each other in teaching students. The happiest time of their cooperation should be finding a way to pull down the scores of some unlucky students, so as to complete the course better. What's more, improve your spoken English please!",
            "comment_grading": "The most interesting part. My mom always taught me to tolerate others' fault, but after seeing these four TAs I suddenly understand not every man in the world has a mother.<br />If you are a born cheater, I should say that this is definitely the best course prepared in CSE for you. We have two mids and one final, and all of them have a make-up because of TAs' stupid mistakes. All three exams have many sessions, and if you can get the test paper from your friends, Congratulations! Because all the papers are remarkably the same. And you can do the test 1 hour earlier than others. The final is a 15 minutes' 20 T/F questions, but hey how can TAs make stupid mistakes in this simple test? 1. Well first, they got the wrong answer for the grading. 2. Then they suddenly found that two TAs mistakes up the exam period! and one-half of the students got&nbsp;&nbsp;20 mins to finish the exam, too good! 3. Students took the test behind can directly got the paper from the previous session! 4. one-half of the students got&nbsp;&nbsp;20 mins to finish the exam, unfair! How to fix that? We can give all the students to take make-up in 15minutes with much similar questions. Anyone with basic logic and common sense knows that the best remedy is for everyone to take the test again or give everyone a 20-minute make-up. But they don't want to. I don't know how they got into graduate school and Ph.D., Canvas shows that the students who take make-up are 3 points higher than the previous test on average, some of them even get high.<br />The overall mean on Canvas is 95.4, but the real one is much higher. 99 A range, 97 B range, 95 C range. Nice and fair grading indeed. I am ready to get C range now. Thank you TAs!<br />Update(WOW! PA4's grade is not decided by the result of the test case, but the result of the interview. I got 40 points deducted! Good!)",
            "comment_workload": "After the final, we suddenly received an announcement that we need another code interview, due tomorrow. I mean what the fxxk? most of the students still have many exams to finish. They change the grading scheme implicitly only because TAs found that most students' overall grades are beyond 95, and they need a reason to drag down your students' grades. Then a clever and lovely professor came up with a solution: 60/109 students were picked up and interviewed after the exam period, and I got deducted points hahaha. TAs: even if you pass the final test and got 100, your implementation is not correct, you forgot to test this feature. But why you say if you can pass the given test.java your PA4 grade would have no problems when we submitted the PA4? Different TAs will ask you different questions, and your final grade will deduct. For the rest of the 49 students, I should say that God really blesses these lucky dogs.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 25,
            "vote_count": 26,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bRut9QBei7uBwthHYoeCzKeCg8zeVfKB",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "豬仔",
            "date": "May 31, 2022",
            "title": "未見過一個course 可以安排得咁垃圾",
            "comment_content": "Course and logistics overview<br />Introduction<br />Objects and Classes<br />Strings<br />Inheritance and polymorphism<br />Exceptions and text I/O pdf,In-class exercise<br />Abstract classes and interfaces<br />Generics<br />Inner Classes<br />Functional programming and lambda expressions<br />Event-driven Programming with Java FX<br />Multithreading<br />Aspect-oriented Programming in Java<br />對經歷過2012嘅人黎講，呢個course 絕對唔難",
            "comment_teaching": "上堂有教過野咩?professor上堂播下歌，講少少亂到七彩嘅lecturer notes,俾20分鐘你做下啲唔知喺度做咩嘅in-class exercise,完，問問題就問非所答,google 仲好。上下stackoverflow嘅價值同效率一定高啲。<br />啲TA仲精彩,英文差到睇好耐先明啲announcement 同description，send Email 問問題答啲唔答啲,問完等於無問。成個course無一樣野唔出事，由midterm到出grade啲TA都有野做錯要remake。原本一個好簡單，好正路嘅course ，俾你班professor同TA搞到咁，真迫我完sem 都要專登打長文數臭你。",
            "comment_grading": "Lab Participation 10%<br />一定攞曬，唔識做?抄github, 個個都public repo, 慢慢參考<br />Lecture Participation 10%<br />上堂有交就得<br />Assignments 10% +15%+ 15% +15%=55%<br />好簡單嘅Assignment, 做曬四個pa加埋嘅時間都無2012一個pa多,但攞滿分都無用,下面講<br />Midterm Coding demo 15%<br />分兩次5%+10%, 限時做task, 提早交就有bonus, 成績唔滿意?唔緊要, 兩次都有makeup,可以重新計分，大家一齊攞滿分<br />Final Assessment 10%<br />20題random TF，睇你好唔好彩啦，但係呢個係未有coding interview 前唯一分水嶺, 因為另外嗰90%大把人滿分。考衰咗?都唔緊要,又有remake, 有多次機會你刷分<br />Bonus<br />搵到notes, pa ,lab有java coding 問題有Bonus 拎,好重要,一個bonus加1%，唔多，應該值兩個subgrade 到<br /><br />唔使理啲分佈，唔重要，完全唔重要，絕對唔重要，反正會朝令夕改。過完add/drop 話改grading scheme, exam 由原本40%改到10%，由3個pa改到4個，多個Midterm coding demo，結果係投票決定，少數服從多數，唔滿意無得走。一切問題嘅開端就係改咗個grading scheme出事，個course 開咗咁多年，有face to face 有zoom，一直都無問題，好好地搞呢啲係做咩事? 改grading scheme都算，推高cut off 啫。Exam 完，臨時加個interview,之前完全未講過,真係臨時, 問同pa4 相關嘅問題,表面上係捉plagiarism(我完全唔覺係捉plagiarism, 啲問題都唔係問你點做),實際上係分grade, 每人隨機扣0-24分到，無任何扣分準則，TA覺得你唔識就扣,無俾人抽中interview就睇code 扣分，你唔會知點解俾人扣。抽中扣24分嘅恭喜曬，會俾人扣15%*24=3.6%，原本攞99分最高分攞硬A range 會幫你調整到C range,final grade 睇個TA啦（update翻，最後太多人投訴，終於取消咗呢個扣分方法）<br />最後出完grade都未完事，TA計錯分（我total 98%都可以食b range)連出grade都要投訴翻先remake 改翻。",
            "comment_workload": "原本就幾輕鬆，頭先都有講，做曬四個pa加埋嘅時間都無2012一個pa多,lab有部分要多啲時間。要預定時間會突擊midterm demo啦,final 完都預下時間突擊code interview啦，最後預下時間上ust space打長文啦，寫下文投訴啦。反正final grade 都係睇運數架啦,努力又有咩用?原本努力攞highest都可以突然變mean",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 21,
            "vote_count": 21,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OSUCNg9zj6QoLL73K0xAXoHXobJizK0J",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "chowjai",
            "date": "May 31, 2022",
            "title": "HONESTY? INTEGRITY? You can find NONE of them in this course",
            "comment_content": "Please write an email to CSE directly.<br />Template provided here.<br /><br />This course is not full of mistakes. This course is a mistake itself.",
            "comment_teaching": "Good morning/afternoon to all of you,<br /><br />I believed that many of you are very confused or angry about the course, but it is useless to say here/ in USTspace. I have drafted an email template to the CSE department head to complain about this course.<br /><br />Please check the below link:<br />https://docs.google.com/document/d/1Z0hJB0MPM97GmefwTSoAhwagcl6D8-40DStullRWCSw/edit?usp=sharing<br /><br />Sorry that I am not that good at English, but I hope this can help you to express your anger to the CSE department. Please feel free to add more content to the email or make any adjustment you like. Please notice that there are 1 placeholder at the end of the email and you may need to add some photos as supporting document if you directly use the template.<br /><br />The email address of the department head is dyyeung@cse.ust.hk.<br /><br />Thanks all and have a nice day:)",
            "comment_grading": "Good morning/afternoon to all of you,<br /><br />I believed that many of you are very confused or angry about the course, but it is useless to say here/ in USTspace. I have drafted an email template to the CSE department head to complain about this course.<br /><br />Please check the below link:<br />https://docs.google.com/document/d/1Z0hJB0MPM97GmefwTSoAhwagcl6D8-40DStullRWCSw/edit?usp=sharing<br /><br />Sorry that I am not that good at English, but I hope this can help you to express your anger to the CSE department. Please feel free to add more content to the email or make any adjustment you like. Please notice that there are 1 placeholder at the end of the email and you may need to add some photos as supporting document if you directly use the template.<br /><br />The email address of the department head is dyyeung@cse.ust.hk.<br /><br />Thanks all and have a nice day:)",
            "comment_workload": "Good morning/afternoon to all of you,<br /><br />I believed that many of you are very confused or angry about the course, but it is useless to say here/ in USTspace. I have drafted an email template to the CSE department head to complain about this course.<br /><br />Please check the below link:<br />https://docs.google.com/document/d/1Z0hJB0MPM97GmefwTSoAhwagcl6D8-40DStullRWCSw/edit?usp=sharing<br /><br />Sorry that I am not that good at English, but I hope this can help you to express your anger to the CSE department. Please feel free to add more content to the email or make any adjustment you like. Please notice that there are 1 placeholder at the end of the email and you may need to add some photos as supporting document if you directly use the template.<br /><br />The email address of the department head is dyyeung@cse.ust.hk.<br /><br />Thanks all and have a nice day:)",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 20,
            "vote_count": 20,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TzbNlZX4JsOSJUZVwwlkPMvbiuU5BlCU",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "haha2011",
            "date": "May 30, 2022",
            "title": "Many mistakes course",
            "comment_content": "JAVA programming<br />Objects and Classes<br />Strings<br />Generics<br />Inner Classes<br />lambda expressions<br />Java FX<br />Multithreading",
            "comment_teaching": "It has some useless exercises in the lecture, but it needs to submit. You can miss two lecture exercises.<br />Many mistakes in this course.<br />Not only have bugs in the notes, but it also has mistakes in the mid-term and final. Even they can make a mistake in the final grade.<br />I don't know what is error-free in the course.",
            "comment_grading": "10% Lab<br />10% Attendance<br />55% Assignment<br />15% Mid-term<br />10% Final",
            "comment_workload": "You may need to spend about 3 hours to finish the assignment.<br />Also, the Lab exercise was not very difficult.<br />However, the coding show may not have enough time.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 19,
            "vote_count": 19,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4FlYEN1y1VxHP34BddsVk7FBioXYOSDE",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "haha1234",
            "date": "May 30, 2022",
            "title": "bad",
            "comment_content": "It is about java and make-up and nothing else",
            "comment_teaching": "poor<br />the professor tried to be cool but the result is that we are not able to fully understand the materials. he sometimes failed to answer our questions.<br />btw, he seldom replied to your emails.<br />He launch a complaint board but I think he never looked at it.",
            "comment_grading": "10%attendance 10%lab<br />55%assignment 15%midterm 10%final<br />Everyone gets high scores but the professor still insists on the university grading policy. So 0 tolerance for mistakes.<br />~60 out of 109 are required to take an interview which will simply lower your score.",
            "comment_workload": "light. you can finish the assignment within 2 hours",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 19,
            "vote_count": 19,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qU3FTGe0dH5tI1FnAIhZwXNffki7uWbM",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AvoidCOMP3021",
            "date": "Jun 06, 2022",
            "title": "荒謬 Ridiculous",
            "comment_content": "不要抱有任何期望。<br /><br />👎👎👎👎&nbsp;&nbsp;𝗔𝘀𝘀𝗶𝗴𝗻𝗺𝗲𝗻𝘁𝘀 👎👎👎👎<br />Assigments 設計奇差，指引唔清晰，朝令夕改，製造混亂，未做好本份就搞 Bonus 分制度。例子就係一個 Split string task 要用 Delimiter 將一條 String 拆開，然 Print 一行一個。好啦做完出 Grade 見到最淺個 Task 被人扣咗分都打個突，結果原來 TA 就唔畀你 Replace delimiter with &quot;\\n&quot;，佢一定要你轉做 array of String 再用 for loop print 出嚟。但份 Assignment 冇話過一定要先轉做 Array object，只係有簡短 Description, Input 同 Output 畀你去理解，結果你用咗 String class 嘅 replace method 就要扣你 5 分。明明份 Assignment 第一頁就講明係俾你熟悉 String API，但原來暗啞底唔用得 replace，反智到無倫。借問聲 Java 幾時將 replace 從 String class 入面剔除咗？既然你有咁嘅 Requirement 點解唔喺 Skeleton code 度擺埋相應 Test case 去消除 Ambiguity或者喺 Specification PDF 度 Explicitly 寫清楚？<br /><br />👎👎👎👎 𝗠𝗶𝗱𝘁𝗲𝗿𝗺 𝗲𝘅𝗮𝗺𝘀 &amp; 𝗙𝗶𝗻𝗮𝗹 𝗲𝘅𝗮𝗺 👎👎👎👎<br />有兩個 Midterm exam 一個 Final exam，每次都整一個 makeup version 嘅 exam。其中一個 Midterm 就係畀錯 Test file，令到 Test case 冇可能會 Pass 之餘你要浪費一大堆時間去 Debug。<br /><br />最離譜係 Final exam 有兩位 TA 畀咗佢地組 20 分鐘去考，但其他組只係得 15 分鐘，事後出 Announcement 道歉都仲厚顏無恥地話其實 20 分鐘嘅人表現都唔係比 15 分鐘嘅人好，所以其實 20 分鐘都冇乜著數嘅，繼而叫覺得受影響嘅人 Join 返個 makeup exam 啦，但其實個 Makeup exam 都只會係畀你 15 分鐘㗎渣。<br /><br />每次出錯都有 Makeup，但就無考慮過新安排到底公唔公平，明明自己出錯仲成日講成係 COVID period 畀學生嘅 Flexibility，恩賜嚟仲唔快啲講多謝。考試設計又係一個問題，分組考 20 條 True or False，運氣成份佔多，根本就考核唔到學生對 Java 嘅認知。<br /><br />利申：我冇參與過任何 Makeup<br /><br />👎👎👎👎 𝗖𝗼𝗱𝗲 𝗿𝗲𝘃𝗶𝗲𝘄 𝗶𝗻𝘁𝗲𝗿𝘃𝗶𝗲𝘄 👎👎👎👎<br />考完 Final 突如期來話要搞個 Code review interview 同 TA 一對一深情對話，話要捉 Plagiarism 喎。好啦我好彩本身冇Reg咁多科，但我都戥其他人慘。仲有抽到個口音重嘅 TA 連問題都聽唔明咁你就自求多福啦。好啦搞完一大輪 in 完，到頭來就話取消。白 in。<br /><br />利申：in 完我好好彩係冇俾佢扣到任何分，但成件事根本多此一舉，話突擊其實都係有時間準備，成件事個成效同製造出嚟嘅麻煩衡量下就知根本多餘<br /><br />📣📣📣📣 𝗖𝗼𝗻𝗰𝗹𝘂𝘀𝗶𝗼𝗻 📣📣📣📣<br />建議唔好折磨自己，呢科被一堆 TA 搞到極度惡劣。雖然 Professor 表面就割晒蓆咁，擺一副樣樣事不關己嘅模樣，實質係點都冇人知，要 Take 自己睇路啦。",
            "comment_teaching": "不予置評",
            "comment_grading": "👎👎👎👎 𝐆𝐫𝐚𝐝𝐢𝐧𝐠 𝗦𝐜𝐡𝐞𝐦𝐞 &amp; 𝐌𝐲 𝗦𝐜𝐨𝐫𝐞𝘀 👎👎👎👎<br />Assignments 1 (10%)\t104/100\t(𝗕𝗼𝗻𝘂𝘀 𝗶𝗻𝗰𝗹𝘂𝗱𝗲𝗱)<br />Assignments 2-4 (45%)\t295/300<br />Lab Exercises (10%)\t18/18<br />Lecture Exercise (10%)\tFull marks<br />Final (10%)\t\t\t15/20<br />Code Demo (15%)\t\t16/15\t(𝗕𝗼𝗻𝘂𝘀 𝗶𝗻𝗰𝗹𝘂𝗱𝗲𝗱)<br /><br />𝗠𝘆 𝗳𝗶𝗻𝗮𝗹𝗶𝘇𝗲𝗱 𝗴𝗿𝗮𝗱𝗲:\t𝗕+ (𝗕𝗲𝗹𝗼𝘄 𝗺𝘆 𝗲𝘅𝗽𝗲𝗰𝘁𝗮𝘁𝗶𝗼𝗻 𝘁𝗯𝗵)<br /><br />👎👎👎👎 𝗠𝘆 𝘁𝗵𝗼𝘂𝗴𝗵𝘁𝘀 👎👎👎👎 <br />👉 All about unfairness (unclear instructions, all makeup exams and TA's mistakes)<br />👉 Lack of transparency on the assignment &quot;bonus&quot; grading scheme (Losing the &quot;bonus&quot; potentially affect your grades)<br />👉 Strongly believe I am already lucky, many students could have more negative feelings towards this course and the TAs",
            "comment_workload": "Workload 一般",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 18,
            "vote_count": 19,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aucakqlmiQVHK4RUOPJT4IVndP8C0Rrp",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "misky",
            "date": "May 31, 2022",
            "title": "Comp3021 Introduction to Emotional control and problem solving",
            "comment_content": "lab, assignment,demo, exam all bugged, only ta is accountable. Lab bug? make up lab. Demo bugged? make up demo. Exam bugged? Make up exam. Test case bugged? Make up test cases. Instructions bugged? Make up instructions (after grading). Did something wrong? Just make up excuses.<br /><br />Comp3021 Introduction to peoblem solvig<br /><br />Sorry type wrong title. Let's do a make up on the course title",
            "comment_teaching": "lab, assignment,demo, exam all bugged, only ta is accountable. Lab bug? make up lab. Demo bugged? make up demo. Exam bugged? Make up exam. Test case bugged? Make up test cases. Instructions bugged? Make up instructions (after grading). Did something wrong? Just make up excuses.<br /><br />Comp3021 Introduction to peoblem solvig<br /><br />Sorry type wrong title. Let's do a make up on the course title",
            "comment_grading": "lab, assignment,demo, exam all bugged, only ta is accountable. Lab bug? make up lab. Demo bugged? make up demo. Exam bugged? Make up exam. Test case bugged? Make up test cases. Instructions bugged? Make up instructions (after grading). Did something wrong? Just make up excuses.<br /><br />Comp3021 Introduction to peoblem solvig<br /><br />Sorry type wrong title. Let's do a make up on the course title",
            "comment_workload": "lab, assignment,demo, exam all bugged, only ta is accountable. Lab bug? make up lab. Demo bugged? make up demo. Exam bugged? Make up exam. Test case bugged? Make up test cases. Instructions bugged? Make up instructions (after grading). Did something wrong? Just make up excuses.<br /><br />Comp3021 Introduction to peoblem solvig<br /><br />Sorry type wrong title. Let's do a make up on the course title",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 16,
            "vote_count": 16,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4AEC05pqjpnCJWXpYgmJiPhW7qmaMSm7",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Longnguyen",
            "date": "May 31, 2022",
            "title": "Avoid Charles in every course if possible",
            "comment_content": "Bad Bad Bad<br />Ok an java course.<br />There is nothing special just like 2012 and 2012H<br />I see the past exam, it is good so I decide to take this course.<br />But I regret now.<br />Charles try to make it fair but he got a really bad idea<br />Do not take course if he teach<br />Regret to take this",
            "comment_teaching": "He is ok but dont need to attend lecture because we have lecture note",
            "comment_grading": "55% assignment<br />Minor mistake will get large penalty<br />Make up everything<br />Got deduct point for the scheme that we don't know before<br />(It is added later because everyone got high score)",
            "comment_workload": "Quite light for this semester",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 13,
            "vote_count": 13,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YkGcWHSnHLpiIavQa6rksKCNC2mZNB35",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "YARRRRRR",
            "date": "Jul 18, 2022",
            "title": "SUS?",
            "comment_content": "The lecture contents were okay. Students are assumed to be familiar with basic programming concepts like OOP, functions and variables. Java specific details about these concept were taught. Some new concepts untouched by COMP2011 and COMP2012 like producer/consumer, multithreaded programming are present.<br /><br />The slides generally were adequately paced. Although you may need to chew on specific slide and look for online resouces to get a full grasp on more complicated subjects. <br /><br />The assignments were too trivial and instructions are often unclear. <br />Important java specific concepts were not tested thoroughly in these assignments and you won't be improving significantly after completing them. Only the first assignment (OOP) put up to a moderate challenge and the others were a breeze. <br />Instructions were often unclear and leave some questions unanswered. You can ask the TAs or figure it out yourself. The added benefit is that you have to be more concious on the general behaviour on you program, but those who require detailed instructions may find it difficult.<br /><br />The labs were actually harder and will test your knowledge on taught matters. There were some instructions given but you will have to figure out many things out by yourself.<br /><br />C for actually teaching me java and got me an internship xD.",
            "comment_teaching": "I never really paid attention in lectures so I can't comment on them.<br /><br />But HOHO, the teaching team is very SUS.<br /><br />Wrong/bugged files were given for labs. Test cases for assignment 4 are actually wrong and doesn't evaluate your code correctly. Wrong questions delivered for mid-term. Different exam length for different groups...<br /><br />and they forgot to schedule my mid-term makeup session even if I informed my unavailability on the day that it was announced. Leaving me very confused when they released the mid-term marks. I've also heard that the new makeup mid-term (which I took) were harder than the original one, so that is a bit unfair for me.<br /><br />Overall its like they make a mistake on every announcement and had to do a makeup for every real-time assesment that they made. It's like the professor never talks to the TAs and all of them are very SUS.<br /><br />Rated E for Ejected.",
            "comment_grading": "The grading were a complete shit fest, only if i can show you the complaint board. The grading scheme is like a quantum superposition where it would be different everytime you observe it.<br /><br />They even released an assignment with a &lt;24h deadline during the exam period to &quot;evaluate whether you did plagarism in assignments&quot;. It later changed to a zoom meeting where the TA seems to be reading questions and assess your program based on &quot;correctness&quot;. It resulted in mark deductions out of nowhere on assignment 4 for nearly all student which (obviously) led to out outrage and (luckily) they revoked it.<br /><br />Final exam was 20T/F questions, like W(hat) T/F.<br /><br />The grades were arse as nearly everyone got everything correct. Tbh only the final exam mattered and its T/F.<br /><br />Since the final exam is an T/F, I will also give a T/F mark, so thats a E.",
            "comment_workload": "one moderate/challenging lab per week (can miss up to two)<br /><br />random exercies on lectures as attendance, you get marks as long as you upload the file (can miss up to two)<br /><br />1 okay assignment (OOP)<br />2 easy assignments (lambda exp, multithreaded)<br />1 brain-dead assignment (???BASIC STRING MANIPULATION???)<br /><br />a written assignment which evaluates your understanding of one assignment and ask a design related question if you have to re-design the assignment to access a different skill (like lambda exp) <br /><br />2 live mid-term coding demo (I actually think its a good type of assessment but they messed it up)<br /><br />the legendary 20 T/F question exam<br /><br />aaaannndd the mysterious assignment that appears during the exam period with 24h deadline and disappears after 30 minute like my hope for living.<br /><br />aaaaaaaaaaaaaaaaannnnnnnnndddddddddddddd a coding interview after the fucking semester is over.<br /><br />LMAOOOO have a E.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 10,
            "vote_count": 10,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "W2twU2GJ226CrBz6riP6nAQBOkrILrZX",
                    "name": "Sus",
                    "format": "png"
                }
            ]
        },
        {
            "hash": "xcuujzffulfg2aNLb51WQh8rRKQOOv9A",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "一點寒芒",
            "date": "Jun 01, 2022",
            "title": "失望既一個course",
            "comment_content": "不再贅述",
            "comment_teaching": "prof 既teaching還好，上堂氣氛都幾輕鬆",
            "comment_grading": "grading完全係亂嗮，選擇性make up根本就唔公平<br /><br />-最離譜既係midtern同final都有make up, final原本話係15分鐘，跟住有兩個TA 搞錯時間開多咗5分鐘 ，最後沒有任何處理唔公平既方法，個個人都可以去make up<br /><br />-份PA4，TA話過到佢既test case就可以滿分，結果又係另外一回事，如果你用其他方法去做而TA覺得唔符合佢哋個預期方法，就會被扣分，如此特別既處理手法真係令人失望",
            "comment_workload": "it's fine<br />有4個PA，每個難度都算容易，上網查下就做到<br /><br />啲TA在final period 出PA同埋assignment",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 10,
            "vote_count": 13,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "B2I8m3XesqtCLg0xd41dINmYqdiiBBC2",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 799,
                    "name": "LAM, Ngok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kit9973",
            "date": "Jun 09, 2019",
            "title": "",
            "comment_content": "Introduction to Java programming. Fundamentals include language syntax, object-oriented programming, inheritance, polymorphism, exception handling, multithreading and lambdas. Standard libraries for input/output, graphics programming, built-in data structures. Programming for events, generics and higher-order functions.",
            "comment_teaching": "",
            "comment_grading": "As my programming courses COMP1022P and COMP2012H&nbsp;&nbsp;both were taught by a bad guy Dr. Tsoi, what I expected in the midterm and final was very difficult:(<br /><br />But Alex is a good guy. His questions only focus on the basic concept or problems commonly occur. Unlike the bad guy, the questions are very tricky or about some uncommon code. <br /><br />Score:<br />midterm mean: 72.8/100 me: 92/100<br />final mean: 75.2/100 me: 84/100<br />PA and Lab: full<br />overall:91.6%<br />Grade: A-<br /><br />Btw Alex also said that &quot;I am a kind person, the questions should not be difficult for all of you.&quot; in the COMP3021final exam. <br />But he didn't said in the final of COMP2611, and the questions were very hard for me :( <br />Eventually, I got C in the 2611. So Alex may be also a bad guy actually:(",
            "comment_workload": "comparing to the copm2012, the PA is very easy and there are clear instruction for you.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 8,
            "vote_count": 10,
            "voted": false,
            "is_upvote": false,
            "comment_count": 5,
            "attachments": []
        },
        {
            "hash": "orn39liRYvbyRMCmscbqiZQKRPFyaJDG",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 799,
                    "name": "LAM, Ngok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hidden",
            "date": "Apr 14, 2020",
            "title": "最輕鬆嘅COMP course",
            "comment_content": "教Java 12。一開波預你識C++，會教Java同C++之間有乜分別，用幾個week由零開始重溫OOP同Polymorphism。Mid-term之後開始教新嘢(Interface/Abstract Class/JavaFX/multiThreading)。",
            "comment_teaching": "Alex教得幾好，好有耐性解答同學問題。個人本身好nice。",
            "comment_grading": "",
            "comment_workload": "每個禮拜一個勁簡單嘅Lab, 唔需要即日交。Assignment同Comp2012差唔多，但由於係Java嘅關係實在係容易得多。分兩至三日慢慢寫好輕鬆就完成，而且assignment嘅指引好清晰，唔會跟唔到。",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rjoVeWTveb9FyngQ67U7IxyMbEl3Hmrg",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 118,
                    "name": "CHEUNG, Shing Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ああああ",
            "date": "Jan 26, 2017",
            "title": "",
            "comment_content": "Java零底入去is ok，但基本oop講得好快，基本上預你無唔記得晒comp2012<br /><br />基本上講晒Java所有Syntax，包括java8嘅lambda，差無講annotation<br /><br />去到sem尾基本上final boss係javaFX、multithreading (ReentrantLock)、generic class (ArrayList&lt;? extends Number&gt;)<br /><br />CS人想出來做野之前可以有信心咁話自己識一隻language，呢科就唔可以錯過啦，鬼叫無一科C++ programming咩",
            "comment_teaching": "講得幾清楚，prof幾好人，落堂喺走廊繼續講is ok，網上一堆extra野，咁囉",
            "comment_grading": "Attendance (iPRS) / Lab / Assignment * 2 / Mid-term / Exam<br /><br />mc係多選型，錯一個即成題無分，於是就無得亂撞<br /><br />midterm同exam嘅mean去到六七十，個final exam淨係寫一個class有getter setter已經有一堆分(long question兩條其中一條)，條curve偏高，好多失分都係喺mc度失<br /><br />搵到notes有錯嘅話每次送0.5%，呢個我覺得幾好，可以鼓勵人提早去睇，不過差唔多只適用於已經識java嘅刷grade黨<br /><br />功課改得幾仔細，有次個TA compile唔到send email問我，我就同佢一齊搵咗個bug出來，應該扣咗啲分掛，不過唔會好似2011 2012呢啲大course咁比個零你<br /><br />功課有bonus，自己propose additional features然後email比prof比佢地睇，最多+功課分10%<br /><br />lab可以事後send email叫佢地睇github",
            "comment_workload": "九點正iPRS應該都算係workload嘅一部份掛<br /><br />功課最好等人問出FAQ先做，如果唔係就等收檔<br /><br />兩份assignment，skeleton接近零，真係要識design program嘅人先寫得出，唔再係啲幾十行嘅河內塔，而係750~1000行嘅怪獸",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SQuzCScl0ChMttK9ucYNpx1f2LR2vM3O",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 118,
                    "name": "CHEUNG, Shing Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ustjj",
            "date": "Dec 28, 2022",
            "title": "Back to normal comp3021",
            "comment_content": "Same as previous semesters, basically teaching COMP2011 and 2012 but in Java, with the main addition being multi-threading and interface, which are quite java specific<br /><br />You can definitely say that you are a competent Java programmer after taking the course",
            "comment_teaching": "SCC quality teaching as usual, enthusiastic, patient, and knowledgeable in both java and software engineering in general<br /><br />He's always explaining why the java designer make restrictions/syntax as they are, rather than just talking about the resulting designs<br /><br />TAs are quite friendly, so do actively find them for help if you are stuck in PAs or labs.",
            "comment_grading": "42% assignment (3 of them, each 14%)<br />42% final (3% each for 20 MC questions, 40% for short questions)<br />8% lab (nearly all people get full marks)<br />8% quiz (you get full mark by participating in the zoom poll, you can actually take this attendance at home rather than having to be physically present in the classroom)<br /><br />Unlike the chaotic last semester, the grading is clear and fair at least. I think it is way better than expected, I didn't even get upper quartile but got an A in the end.",
            "comment_workload": "Main workload are the PAs, where you really need to start earlier (at least 1 week before deadline) to finish it. Rather than being tedious, they are generally shorter than the 2011/2012 ones, but require good understanding of the concepts and lots of googling in order to know how to implement some parts.<br /><br />Labs generally take &lt;1 hour to finish. 1 or 2 of them may be harder, but you can always ask the TA or even the prof for tips.<br /><br />Final exam is open-book where you can bring anything (in paper) into the exam venue, so you don't have to spend time memorising the stuffs. The exam questions are quite tricky, so you should spend some time trying different special cases before the exam.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cBmymzuA05YXoeGMLlpFXKD3ylVM9nut",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 118,
                    "name": "CHEUNG, Shing Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "enor2017",
            "date": "Oct 07, 2022",
            "title": "Excellent Professor &amp; Content but difficult",
            "comment_content": "Using Java 17, the latest java version!! Wonderful!<br /><br />1. Java language fundamentals<br />Basics<br />Classes and Objects<br />Java Development Tools (IntelliJ)<br />String Processing and Text Input / Output<br />Inheritance and Polymorphism [*Important*]<br />Interfaces and Inner Classes [*Important*]<br />Unit Testing<br />Exceptions<br /><br />2. GUI Programming<br />Graphics<br />Event Handling [*Important*]<br /><br />3. Advanced Topics<br />Multithreading [*Important*]<br />Generic Programming [*Important*]<br />Lambdas and functional programming [*Important*]<br />Built-in Functional Interfaces and Streams [*Important*]",
            "comment_teaching": "One of the best professors I met at HKUST.<br /><br />Professor Cheung is a very passionate professor, and his classes are of high quality. He has a deep understanding of software engineering, explains things clearly, and will always tell you HOW and WHY programmers (especially Java developers) do this instead of just teaching things. <br /><br />He is willing to answer all your questions and respond to emails quickly (I usually get a reply in 10 minutes).<br /><br />It's also valuable that he teaches the latest Java version with new features included.",
            "comment_grading": "[IMPORTANT] If you want a good grade, PAY FULL ATTENTION TO HIS LECTURES. You may think his slides are easy, but he will do lots of demos during lectures containing very tricky stuff. He will also emphasize important points during class.<br /><br />Remember to watch the recording before the exam in case you forgot the early lectures. : )&nbsp;&nbsp;It will definitely help.<br /><br />Grading Scheme <br />- In-class Quizzes and Participation 8%. mean 7.87, me 8<br />- Laboratory exercises 8%, almost everyone full<br />- Course assignments 45%<br />-- PA1 mean 87.94, me 96.39<br />-- PA2 mean 94.69, me 100<br />-- PA3 mean 87.76, me 100<br />- Examination 39%<br />-- MC questions, full 52, mean 20.63, me 42.33<br />-- Short questions, full 48, mean 32.76, me 45.5<br /><br />Grade: A+",
            "comment_workload": "I think the workload is good. PA1 is a bit complicated since you need to think of all stuff clearly and there are a lot of codings. I think finish the PA is easy but it's hard to make it elegant.<br /><br />PA2 and PA3 are shorter, as long as you understand the content, you can finish it very quickly.<br /><br />Perhaps one of the workloads is the polling before each class (since 1 of the 2 classes is 9:00 AM), but as long as you participate in the polling, you get full marks.<br /><br />The final exam is very difficult (if you have experienced his polling questions, you will know). There are 26 multiple-choice questions, each worth 2 points. Multiple correct answers are possible; you will lose all points if you select any one of the incorrect answers, and will get 2 * x / y points if you select x correct answers out of y correct answers. (This is really a workload for TA to calculate scores lol)<br />Remaining 48 points are programming questions, hand-written codes. They are basic stuff, and you should be okay if you pay attention to his lectures.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "0kvDrN2iPpyIFHBYTt1ylBRzicjxbd37",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 118,
                    "name": "CHEUNG, Shing Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pccw",
            "date": "Dec 29, 2020",
            "title": "",
            "comment_content": "for the first half semester, mainly focus on the basic OOP. after that it mainly focus on \t<br />Java Multi-Threading<br />Generics<br />Lambda Expressions and High-order Functions<br />Exception Handling<br />Java Event-Driven Programming (inner class)",
            "comment_teaching": "his teaching is quite good, he speaks slowly and explains the concept clearly with some concrete examples. the quiz questions are also quite good for understanding concept (though it is much much easier than the MC in the final). he is also willing to answer questions.",
            "comment_grading": "Quiz - 8%, full<br />Lab - 8%, full<br /><br />PA - 45%, 15% each<br />PA1 mean 87, I got 100<br />PA2 mean 82, I got 100<br />PA3 mean 58, I got 82<br /><br />Final - 39%<br />Exam mean 51, I got 61/100<br /><br />i finally got A in this course, quite good grade",
            "comment_workload": "quiz (2 polling for zoom), start at the beginning of each lecture, basically everyone can get full mark because no need correct answer, kind of attendance. <br /><br />Lab, everyweek have a lab session which is required for 15 mins attendance, but can submit lab work later, most can finish within 1 hours<br /><br />PA, PA1 is quite easy and should be finish in 3 days (just about some basic thing of OOP), PA2 is quite time consuming if you do not know anything about JavaFX, I spend around 1 week to finish it (the hardest part should be handling application thread), for the PA3, it is a bit easier than PA2, mostly about multithreading, I spend around 3 days. Maybe its deadline is in exam period so it is really not too hard.<br /><br />Final, very hard for MC, even though open book, for each question with 5 choices, there may be not only one answer. For LQ, mainly focus on generic and lambda.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KZApBiORW72h3u0VEy9Zz42Fz4AxBUUL",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 118,
                    "name": "CHEUNG, Shing Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DrainGang",
            "date": "Dec 28, 2022",
            "title": "Good course with bad grading",
            "comment_content": "Java programming, consider it an extension of COMP2012.<br /><br />Quite the overlap with C++ OOP in the first half of the semester, with new contents in the second half. Overall it is quite nice picking up a new language.",
            "comment_teaching": "Good.<br /><br />While he's no Desmond, Professor Cheung's lessons are interesting, with good live coding demos, useful quizzes and good explanations on topics. There's a quiz every lecture to count attendance, but it is conducted on Zoom so technically you don't have to be there. <br /><br />However, it is recommended that you do attend the lectures because they are worth the time and since there are no lecture recordings.<br /><br />Tutorials and Labs can be skipped fully, just complete the Labs and hand them in, the tutorials simply explain what to do in the Lab, which isn't necessary.",
            "comment_grading": "In-class Quizzes and Participation (8%): 2 quizzes every lecture, conducted on the Zoom, the questions are very useful for clearing up concepts, answers for them are released making for great study materials as well.<br /><br />Laboratory exercises (8%): Simple labs, just follow the .md file in the project and complete them. <br /><br />Course assignments (42%): 3 PAs, all around the implementation of a Sokoban game, PA1 plays in the terminal, PA2 runs in a GUI and PA3 implements a multithreaded replay system. Again all are simple and most people get over 90%. <br /><br />Examination (42%): 1 final exam, unfortunately this is where the course gets worse. 20 MCQs, and 5 short programming questions, however all 5 short questions about generic programming, no multithreading, no javaFX, no inheritance. The MCQs are very difficult with multiple correct answers, and you get 0 points if you choose just 1 incorrect answer. Average is around 50%.<br /><br />1% total below mean, C+, bad grading.",
            "comment_workload": "Typical for COMP course, similar to COMP2011/12.<br /><br />All labs take around 1-2 hours to complete, PAs may take a week or so.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YmTmAxXejnSsyZ55MQI0AMfX4adeLw8F",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 118,
                    "name": "CHEUNG, Shing Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SmartBee",
            "date": "Jan 28, 2019",
            "title": "One of the Easiest COMP Electives",
            "comment_content": "Build on prior knowledge of Java programming.<br />However, this prior knowledge is not required as Java is pretty straight forward and more intuitive than C++.",
            "comment_teaching": "SC is a very energetic professor, I find that he explains concepts very well. Although he does speak pretty slowly. However, he puts all the videos online, which allows you to watch the class at 1.5x the speed.",
            "comment_grading": "I got almost 100% (100 and 98) for both assignments.<br />Midterm I received 1/5 SD above mean<br />Final received mean.<br /><br />Attendance: Labs (1 point for submitting the lab in time and 1 point for attendance)<br />Quizzes: At the beginning of each class there would be a PRS quiz. You only needed to attend 8 of the quizzes during the whole semester <br /><br />Overall got a B. This was mostly due to my absences in a couple of lab classes.",
            "comment_workload": "I found the workload not too hard, the Labs are very easy - with mandatory attendance, althought you do not need to submit the lab during the lab session which meant that a lot of students ended up just going to the lab session in order to sign their name.<br />The assignments were not hard but were somewhat of a heavy workload, I started 1-2 weeks before the deadline and did a little each day. (however, I am not the best coder) I know of a lot of students who started the day before and still managed.<br /><br />Both midterm and final were open book and therefore a lot harder than initially thought. However the trickiest part was the MCQs at the beginning of each test.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XKSJ1zLHNM92yIKwWeRRYiTfUGXoF0el",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 118,
                    "name": "CHEUNG, Shing Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Argen",
            "date": "Dec 24, 2018",
            "title": "Meaningful Course to Learn Java Effectively",
            "comment_content": "Up-to-date content that most important Java updates have been well covered. Good for beginner, and also informative for students who already has a little Java background.<br />Java10 this semester, also very little Java11 (released in Sept 2018) content (not examined).<br /><br />Since COMP2011/2012 provided most of the OOP syntax and characteristic, this course focuses on the OOP features that is unique for Java or not covered in COMP2011/2012.<br /><br />Major Topics:<br />Polymorphism, abstract class, interface, GUI using JavaFX, event driven programming, lambda/high-order functions",
            "comment_teaching": "Detailed explanation. You will gain a lot by attending the lectures.<br /><br />Prof. Cheung encourages students to in in the Java developer's perspective to inspect a particular feature.<br />He also likes making unusual operations to Java and ask &quot;what will this output&quot;. It is reflected through his iPRS and exam questions.",
            "comment_grading": "For exam difficulty:<br /><br />Desmond tends to make easy but tricky MCs, lengthy and time-consuming Long-questions.<br /><br />Prof. Cheung prefers making deep and difficult MCs, which usually require choosing 2-5 answers from 5 choices and 1 wrong answer causes 0 mark in the whole question. <br />Long-questions are much shorter but focused. A 4-credit question can test in various concepts and require students to be extremely careful.<br /><br /><br />Overall grading: <br /><br />Fair, and better than UST grading standard<br />iPRS 100% attendance.<br />Assignments full mark.<br />Mid-term above mean 1.5 SD.<br />Final above mean 1 SD.<br />A.",
            "comment_workload": "Similar to but a little lighter than COMP2011/2012, which is medium for a 3-credit course.<br />Lecture iPRS attendance.<br />12 labs.<br />2 programming assignments.<br /><br />Attendance is recorded as long as you submitted an answer of iPRS, regardless of correctness.<br /><br />Labs are much simpler than COMP2011/2012 lab. Each can be finished in an hour.<br /><br />Each PA requires around 8-20 hours to complete (including debugging and document works)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PIKOETdcjNHGfI5IBnuXX4XsnupNkZ66",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 118,
                    "name": "CHEUNG, Shing Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "smallpotato tom",
            "date": "Dec 24, 2018",
            "title": "Useful programming course with Good grading",
            "comment_content": "We learnt Java 10 in this semester .<br /><br />Before Midterm (Something similar to COMP2012):<br />- Java Basics<br />- Classes and Objects<br />- Java Development Tools (IntelliJ)<br />- String Processing and Text Input / Output<br />- Inheritance and Polymorphism<br />- Interfaces and Inner Classes<br />- Unit Testing<br />- Exceptions<br /><br />After Midterm (New and useful):<br />- GUI Programming<br />- Event Handling<br />- Multi-threading<br />- Generic Programming<br />- Lambdas and functional programming<br />- Built-in Functional Interfaces and Streams",
            "comment_teaching": "Professor Cheung did have passion in each lesson. He would prepare a lot of things to the lectures such as demo programs and extra exercise. <br /><br />One bad thing was his boring tune and lesson atmosphere which often made me fall asleep.",
            "comment_grading": "Good grading!<br /><br />In-class Quizzes\t8%<br />Laboratory exercises\t10%<br />Programming assignments\t20%<br />Midterm examination\t22%<br />Final examination\t40%<br /><br />Mine:<br />- In-class Quizzes and Laboratory exercises got 100%<br />- PA1 got 97% and PA2 got 100%<br />- Both Midterm and Final exams got a score below mean 0.2-0.3 SD.<br />- Total score is 75.34% (should be around mean).<br /><br />I got B. In UST, it absolutely is a good-grading course.",
            "comment_workload": "2 iPRS quizzes were provided in each lesson, making the lessons compulsory.<br /><br />Lab attendance was compulsory too. After each lab tutorial, you would have 1-week time to finish the lab work.<br /><br />2 PAs were related. PA1 was a text-based Sokuban project in which TO-DO parts focused on the logic part of the game. Based on PA1, PA2 was a GUI version of the game in which TO-DO parts focused on the GUI part of the game, event handling and multi-threading.<br /><br />Basic Github skills were required.<br /><br />As 'Content' mentioned, Midterm focused on upper half of the course, and Final covered all things with great focus on Event Handling~Functional Interfaces. One thing I want to mention is the MC part of the exams. Be careful as correct options are more than one. If you pick more than correct answers, you will get 0 mark.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cX6XrPfhvXgELMmfyLhPntoP3YUhbVAE",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1576,
                    "name": "CHEUNG, Shing-Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hj5k1od1",
            "date": "Dec 28, 2022",
            "title": "kinda like comp2012",
            "comment_content": "The first half part is OOP in java. I think it is easier than C++ syntax-wise.<br /><br />Then we have javafx, easy but kinda useless, just need to memorize things.<br /><br />The real challenges starting from multi-threading to lambda.",
            "comment_teaching": "Although the prof is not humorous as Desmond, you can feel the passion of him. <br /><br />He's well prepared before lesson, he would like to try to explain why Java is designed this way so we can memorize more easily &amp; guess how will Java behave in other similar new situations.<br /><br />He also provided many well-designed quiz in every lessons. Those quiz will make you realized you don't understand the topic well enough although you think you are.",
            "comment_grading": "In class quiz : 8%<br />Lab : 8%<br />Assignment : 42% (14% each)<br />Exam : 42%<br /><br />Everyone get almost full marks in quiz &amp; lab.<br /><br />PA1 mean : 80.78<br />PA2 mean : 91.72<br />PA3 mean : 82.85<br />I got full marks in all pa.<br /><br />Exam mean : 47.33<br />I got 63.<br />Turn out A.<br />Good grade, was expecting B+.<br /><br />The exam is open book.<br />Highly suggest you print every notes to the exam &amp; do some indexing so you know where to find the thing you want<br />I didn't print anything &amp; I regretted especially when I saw Junit in the exam paper which I didn't pay attention to when I was studying.",
            "comment_workload": "Quiz is free to get, as long as you answer anything in the zoom poll in the beginning of the class, you will get the point.<br /><br />Lab are easy, it should take around 2-3 hours for each.<br /><br />The workload mainly come from assignments.<br />Each took around 2-3 days to finish.<br />There is no hard algorithm you need to write. The difficulty come from learning some Java features yourself.<br />There are some java18/javafx features not covered in the class but required you to use in the assignment. It took some time to learn.<br /><br />For the exam, it depends on what grade you you want to get, personally I spent 3 days studying before the exam.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "c1BiI1JjQj8x74xqZ9sScix2ilprAgbf",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 799,
                    "name": "LAM, Ngok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tooooooo",
            "date": "Aug 25, 2021",
            "title": "good java course",
            "comment_content": "just the content of normal programming course, how to code, yes...<br /><br />Introduction to Java programming. Fundamentals include language syntax, object-oriented programming, inheritance, polymorphism, exception handling, multithreading and lambdas. Standard libraries for input/output, graphics programming, built-in data structures. Programming for events, generics and higher-order functions.",
            "comment_teaching": "professor is passionate and nice, always repeat the content until there is no confusion, just attend the lecture and you will find yourself more comfortable with java",
            "comment_grading": "i think not bad (good) for comp course.<br />homework and lab full marks.<br />mid term around mean as i remember,<br />final above mean. finally A-, very good for me becoz i get so bad grade in other comp course lol",
            "comment_workload": "hw is easy, lab is easy, but midterm and final is a bit hard and have to write code on canvas is troublesome, but overall is not large workload. if you code before, you will find it easy to complete the lab and homework, for midterm and final need more effort to score high, but as i remember the mean is not so high as other comp course",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9D5UJ2mNFJJgcp6lof1RloVZNNIIlH15",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 118,
                    "name": "CHEUNG, Shing Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Dok",
            "date": "Jan 06, 2019",
            "title": "Great course to learn Java",
            "comment_content": "The professor has updated the material to the newest Java version (10.0.2 as of 2018 Fall). The professor cares very much about the content and has put in a lot of effort into his slides and demo code. <br /><br />1. Introduction<br />2. Classes and Objects<br />3. Strings and Wrapper classes<br />4. Inheritance and Polymorphism<br />5. Exception handling and File IO<br />6. Abstract classes and Interface<br />--- Midterm --- <br />7. Java GUI<br />8. Event driven programming<br />9. Multithreading<br />10. Generics<br />11. Lambda expressions<br />--- Final ---",
            "comment_teaching": "Amazing professor who explains everything very clearly. I highly suggest going to the lectures because they are actually really helpful.&nbsp;&nbsp;His English is good as well. TAs were very nice and supportive and open to questions/help.",
            "comment_grading": "In-class Quizzes\t8%<br />Laboratory exercises\t10%<br />Programming assignments\t20%<br />Midterm examination\t22%<br />Final examination\t40%<br /><br />Got &gt;0.5sd but &lt;1sd for both midterms and finals; got full marks for labs/assignments/attendance, ended up with an A-",
            "comment_workload": "Workload is quite light.<br /><br />In class quizzes: in reality, this is just attendance. The quizzes are done in PRS but you just have to respond to get the points (no need to get correct answers).<br /><br />Labs: Attendance every week. Not difficult tasks. Have to submit either during lab session or to CASS by the weekend.<br /><br />Assignment: Quite time consuming, so don't leave them to do at the very end. 2 assignments in total. First assignment is due after midterms, and focuses on classes/inheritance/interface etc. Second assignment is due before finals and focuses on GUI, event driven programming, and some multithreading<br /><br />Midterm: ~1 hr long. Open notes. Half MCQ and half code writing. MCQ is quite confusing (can choose multiple) and need thorough understanding to choose all correct answers. Code writing is straightforward. The javadoc for necessary functions are provided.<br /><br />Final: Similar but 3 hours long",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "c7UelRQxb5qEh1SZnj3XGzFKtzqDnCBO",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "takecare",
            "date": "Feb 03, 2018",
            "title": "Not as easy as COMP2012",
            "comment_content": "Not that updated and not much different from C++ foundation courses, some important topics, like networking, clients and servers are even missing from previous semesters, not to mention current popular Java spring framework, AOP, etc.<br /><br />1. Java basics<br />2. Objects and classes<br />3. Inheritance and polymorphism<br />4. Exceptions, assertions and file I/O<br />5. Abstract classes and interfaces<br />6. GUI programming<br />7. Event-driven programming<br />8. Multithreading<br />9. Generics and collections<br />10. Lambda expressions",
            "comment_teaching": "Desmond's teaching skills are impeccable. You always have fantastic learning experience when attending his class. Lecture videos are a great plus for this course as well.",
            "comment_grading": "Do not underestimate the difficulty of the exams. Content does not vary a lot from COMP2011 and COMP2012 in terms of syntax and concept, but questions are a lot trickier.<br /><br />Lab - 15 %<br />2 Programming assignments - 20 %<br />Mid Term - 25 %<br />Final - 40%",
            "comment_workload": "Workload is light. The only bad thing is that there is not a plenty of time for you to complete&nbsp;&nbsp;the programming assignment. Each is just given to complete within 2-3 weeks.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IzTcrKdi0GsKWSeUQRjsKWYluGICCfHq",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "pooja",
            "date": "Jan 25, 2018",
            "title": "",
            "comment_content": "Very good course learn Java programming. The professor will cover all the necessary concepts like OOP, GUI programming, Generic Programming, Exception Handling. Very well structured, well-executed course.",
            "comment_teaching": "Desmond is very very good at teaching and will make the course very enjoyable. He makes the content interesting and understandable. The video lectures are also plus in case we want to revise.",
            "comment_grading": "The grading is like any other CS course<br /><br />lab - 15 %<br />Prog assn - 20 %<br />Mid Term - 25 %<br />Final - 40%",
            "comment_workload": "The workload is manageable, especially professor helps a lot in keeping pace with the assignments",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9I0zYnDB9nIuqXaZ4frombUk3dnaqtVT",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kmleungaj",
            "date": "Jan 24, 2018",
            "title": "",
            "comment_content": "Very rich in content, covered many topics about Java programming, mentioned comparison between C++ and Java",
            "comment_teaching": "Desmond teaches really well.&nbsp;&nbsp;Every topic is explained in detail combining with instant demos and theories behind.&nbsp;&nbsp;Humorous and encouraging.",
            "comment_grading": "10 Lab Exercises (15%)&nbsp;&nbsp;-- Total 13 labs but take the best 10 for the score (2 marks for each lab, 1 for finishing the task, 1 for attendance)<br /><br />2 Programming Assignments (20%) -- Basically the second PA is the extended version of the first one.&nbsp;&nbsp;The difficulty of both PA is relatively simple.&nbsp;&nbsp;Bonus marks are given if you can finish some extra tasks.&nbsp;&nbsp;You can also propose some extra features.<br /><br />Mid-term Exam (25%)&nbsp;&nbsp;-- Mean: 73/100<br /><br />Final Exam (40%) -- Mean: 63/100<br /><br />The grade is set for B around the mean.&nbsp;&nbsp;I think it is mostly depends on the score in the final exam as almost everyone get the similar score for the labs and PA.",
            "comment_workload": "Relatively light comparing to other Comp course.<br /><br />The workload comes mainly from the 2 PA which takes around 1 week to finish (the PAs are given around 2 weeks for you to work with).<br /><br />The content is affordable without lots of things to remember.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "A1LgyeZSlGlw5hNxRWQr8AFPcPQKwFIO",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "stereo",
            "date": "Dec 25, 2017",
            "title": "Desmond 幾時再教其他COMP course",
            "comment_content": "其實部份topic COMP2012都有講, 只係用唔同language會有d分別<br />Java / Java 8要講既野應該都講哂(?)<br /><br />Basic Syntax | Classes |&nbsp;&nbsp;Inheritance, Polymorphism |&nbsp;&nbsp;Exception &amp; Assertion | Abstract Class &amp; Interface | GUI (終於脫離COMP2011 2012 Console Programming) | Multi-threading | Generics | Lambda Expression (which makes Java 8 the most important update in Java history)<br /><br />今個sem 3111 project要用Java, 上堂除左用一堂講完3021 Chapter 1 lecture notes之外就冇啦, 有讀3021一開始有優勢",
            "comment_teaching": "reg呢科有好大部份原因係因為Desmond (O)<br /><br />go and see COMP2012 reviews about Desmond for more<br /><br />風趣幽默lol 上堂好似用好多時間吹水搞gag<br />有問必答仲會即場dem埋你睇, 講解又detail<br /><br />無論係Desmond定係TA都好好人, 教得好好",
            "comment_grading": "&quot;(try to make) mean = B range&quot; from Desmond<br /><br />10 Lab Exercises (15%) // 13個lab計best 10, 有attendance<br />2 Programming Assignments (20%) // 同一個遊戲, 一份console一份GUI<br />Mid-term Exam (25%)<br />Final Exam (40%)<br /><br />Midterm mean 71, Final mean 63, PA mean都係80幾90幾<br /><br />midterm final above mean ~ 0.5 SD, B+, 多謝Desmond, 好似有common core水準grading",
            "comment_workload": "同今個sem任何一個CS course (3111 3511 3711) 比, 3021實在太輕鬆......<br /><br />lab attendance 應該係最辛苦既workload<br />PA 唔難, guidelines甚至部份code都比埋, bonus想精益求精會比較花時間<br /><br />midterm final 同其他coding course大同小異",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eWQ9WcLEgpwMxeXC3UkCR0zBaTvjRvhJ",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 108,
                    "name": "LIN, Fangzhen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Rilakuma",
            "date": "Aug 09, 2017",
            "title": "",
            "comment_content": "The content before mid-term is quite easy. If you did well on comp1022p and comp2012, you can probably follow the teaching schedule by yourself. The content after mid-term, something related to server and javaFX, is relatively difficult and need more time and example to understand.",
            "comment_teaching": "The lecture notes are difficult to read. The professor did not explain the lecture notes and examples well. It will be better to read it by yourself. If you attend the lecture, bonus marks will be given.(No accurate marks were told..) but I would say, save time to complete your assignment....<br /><br />Each week will have a compulsory lab session. The TAs did not teach in the lab session. They are only there to answer questions...",
            "comment_grading": "Mid-term and examination are both about mean.<br />Assignments are about 90%, and the mean is 60% to 70%.<br />Full marks in lab attendance and attended 80% of the lectures.<br />Finally is a B-.",
            "comment_workload": "There are one mid-term examination, two programming assignments, one examination, lab attendance and bonus marks if you attend the lecture.<br /><br />The lab tasks are not necessary to complete but the content in lab is easy. <br /><br />The two programming assignment is difficult. Three weeks are given for completing each assignment and it is just enough. In the first assignment, you will need to develop a game in command prompt by following the instructions. The whole game need to be completed by yourself without any code provided. Although a class diagram is provided, it is difficult to follow it. The second assignment is use javaFX to create the GUI of the game in assignment 1. It also require to implement the game to be interactive, to play with the computer or other users. This assignment is very difficult and many students cannot complete it finally.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QuCLlb5AML7welCimmm1v88jsCJuVS9Q",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 118,
                    "name": "CHEUNG, Shing Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LAAAAAAAAAAAAAA",
            "date": "Jan 13, 2017",
            "title": "Intensive Course",
            "comment_content": "The course cover most topics about java (Thread, javaFX, class and etc). The knowledge is useful. If you are looking to master java, this is a course you may want to take",
            "comment_teaching": "The lecture is friendly, he gives a lot of additional information, exercise, quiz.<br />The TA are so helpful. They are willing to stay after the lab session to answer question. You can also ask them through email, they will answer you within two day mostly.",
            "comment_grading": "The grading is average. I think mean is B or B-<br />I have mid term and final below around 0.5 SD, i got C+<br />Attendace is needed 8%<br />2 assignment for 10% each<br />midterm 25%<br />final 35%<br />lab 12%",
            "comment_workload": "The workload is pretty heavy. The assignment lacks of guideline, you are given the simple output and input. Thats it, the skeleton code is so empty that you cant get any help from it. The level of difficulties is also high. But, it is also a great chance for you to check the understanding on java. <br />Something special is that the MC in final and midterm is not choosing the correct answer, but choosing all the correct answer. The grading scheme is 0 mark if you chose a wrong one",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tspvdy3uYYWlWhiIibnvTHH2LiHwxQPP",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 96,
                    "name": "KIM, Sung Hun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "別問我是誰",
            "date": "Jul 20, 2015",
            "title": "延續 1022P 既 Java course",
            "comment_content": "內容由最普通 Java data types, 去到 OO, exception handling, generics, GUI &amp; events (係咁而提下), networking, DBMS, JUnit testing 去到重頭戲 design pattern 同 multi-threading. 最後 web programming。<br /><br />Quiz 方面，每星期上兩堂，除左特別事前通知外一般每星期第一堂有quiz，一上堂會比條關於 readings / 上一堂講既野 既題目，答岩2分，錯就1分，無交0分，成個sem大概有10條多d。",
            "comment_teaching": "professor 上堂個陣都有講有笑，好鐘意上堂個陣比關於final會考咩既tips。佢亦會經常提出問題引導學生諗野 (e.g. 點樣fix段code, 某d java keywords 有咩作用)。",
            "comment_grading": "final 扣左幾分，走左2次 quiz, 總分~94，turn out A。估計無走堂既話可能A+到。<br /><br />另外 final mean ~73 sd ~20。",
            "comment_workload": "如果平時走慣堂，會對呢個course既quiz有抗拒 (必要，佔分重，有時要上哂成堂先知個日無quiz)。<br /><br />final 唔算難，主要背熟 design patterns 既優點例子就夠。佢好似第一次教呢個course, 無佢出既past paper，份final亦同其他人出既完全唔同。",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "M1CPwbKBEoUc8JDyViMipKQ06xNliNn2",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 799,
                    "name": "LAM, Ngok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "!gpa_god",
            "date": "Aug 09, 2021",
            "title": "Too fucking easy, almost 1022P level",
            "comment_content": "1. Basic Java syntax and primitive data types<br />2. Classes and objects<br />3. Strings<br />4. Inheritance<br />5. Exceptions<br />6. Interface<br />7. GUI Programming (Java FX)<br />8. Event-driven programming<br />9. Multithreading<br />10. Generics<br /><br />To be honest, I was kinda disappointed that we didn't go through networking due to time constraints. I took this course because I wanna learn some new topics, not because I wanna retake 1022P.",
            "comment_teaching": "Alex is a very kind and down to earth lecturer. He would always stay after class to chat with you and would reply to your emails within milliseconds. However, Alex's teaching pace is still an issue after all these years. He still has to offer make up classes to cover up the slow progress.<br /><br />On a side note, some of the questions in the midterm and final exam are actually from the discussions in class. So you might not be able to find them directly in the lecture notes.",
            "comment_grading": "Ehh... My only complaints are that the midterm and the final exams contain too many tricky MC questions and you will need quite a lot of time to deal with those tricky scenarios. You better be prepared for the tricky dynamic binding questions (Alex LOVES those).",
            "comment_workload": "2 Programming Assignments + 1 lab every week.<br />Everyone can finish the PAs within 6 hours. I personally find the PAs too easy and too much guidance was given throughout the TODOs. <br /><br />And the labs would only take you like at most 1 hour to complete. Are programming labs supposed to be this easy? (Probably because my ass got ripped by 2012H labs).",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JIp1ISytRwKlcY8dRXfdNEa28r1TPtLK",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 799,
                    "name": "LAM, Ngok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cyzk",
            "date": "Jun 04, 2020",
            "title": "Alex好好人 好nice",
            "comment_content": "一開頭都係學返concept野先 <br />有C++底好輕鬆switch到過去學埋java<br />midterm就考到少少inheritance同Polymorphism",
            "comment_teaching": "Alex份人好nice 堂堂都留低答哂同學問題先會走 唔識解到你明為止 有幾次仲留到夜晚11點幾等緊堆同學問哂先(online class",
            "comment_grading": "未出letter grade未知住",
            "comment_workload": "每個星期一份輕鬆lab<br />有齊instruction 基本上你照住佢堆step就會做得到<br />另外有兩份assignment 都係跟足instruction唔會唔識 pa2仲會有bonus question 比你拎返pa2入面大意失左既分",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "s8L0sg6NZW9BkPdCGGcvC72SN4okgZ5X",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 110,
                    "name": "ZHANG, Charles Chuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jimmy8976",
            "date": "Aug 24, 2022",
            "title": "",
            "comment_content": "Basically cover almost all important concept of java, beginner can manage to follow the content very well. Everything is not hard to understand and is covered in detail. It is not in a rush. I am very satisfied.",
            "comment_teaching": "I love the professor very much. He is fun and kind. However, there are too many mistakes caused by the TA team. I think they can be more serious and more careful as their mistakes are causing a lot of trouble for many people. I see people very mad about that.",
            "comment_grading": "As everything is quite easy, there is a huge competition in the course. You will assume you won't get a good grade if you make too many mistakes. Basically, you have to be perfectly careful if you want to win the course!",
            "comment_workload": "In terms of a COMP programming course. I think the workload is very acceptable. The assignments and labs are quite easy and straightforward. The instruction is however not adequate in my opinion. You may have to send quite a lot of emails to ask for details.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 18,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "h9VdBv6oT0yOTcaW8xjQgbYkZI2e3zYg",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 799,
                    "name": "LAM, Ngok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hakenchok1",
            "date": "Dec 28, 2022",
            "title": "Honest review of an international student",
            "comment_content": "Very basic Python. The content is pretty easy and quite understandable. Everyone is talking about it in reviews, so you can read it in other reviews if you want.",
            "comment_teaching": "Theaching is OK. Even good for UST. You can skip lectures and work on materials on your own. It could be even better than wasting time in the classroom.",
            "comment_grading": "Grading is good. Average = B. Labs are the thing you should take seriously and have 100/100. They are not difficult but time-consuming. Many local students want to finish them as soon as possible to go and play computer games. So, you can beat them in this part being very careful and attentive. The competition is extremely high in this course, so you have no right to make mistakes. There are also 2 grading schemes because some students (me including) have never experienced tests in programming world and can perform not satisfying their plans. You know, asians can do well without understanding much because they have tests in their DNA. That's why having 2 grading schemes is a good idea.<br /><br />My results:<br />Labs - 100/100 (Avg: 92)<br />Midterm - 60/100 (Avg: 62)<br />Final: 79/100(Avg: 70)<br />Second grading scheme -&gt; 87.8% overall B+",
            "comment_workload": "Do not listen to other reviews in terms of workload. Again, for many asians a task which is not mandatory means NO TASK. That's a silly approach. In fact, you need to spend 4-5 hours on materials+tasks+lab every week. <br />IF YOU WANT TO DO WELL IN THE EXAM:<br />There are so many past papers! Start a long time before the exams and it will help you a lot! Many students will look only on 10% of them. You can be better!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 23,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        }
    ],
    "composer": []
}