{
    "error": false,
    "course": {
        "id": 215,
        "subject": "COMP",
        "code": "2711H",
        "name": "Honors Discrete Mathematical Tools for Computer Science",
        "description": "Discrete mathematics needed for the study of computer science: sets, functions; propositional logic, predicate logic, rules of inference, proof techniques; pigeonhole principle, basic and generalized permutations and combinations, binomial coefficients, inclusion-exclusion principle; probability theory, Bayes theorem, expectation, variance, random variables, hashing; cryptography and modular arithmetic, Euclid’s division theorem, multiplicative inverse, divisibility, RSA cryptosystem, Chinese remainder theorem; mathematical induction, strong induction and well-ordering property, recursion, recurrence relations; graph representation, isomorphism, connectivity, Euler paths, Hamilton paths, planarity, graph coloring. Gentle introduction to many discrete mathematical concepts that will appear later in more advanced computer science courses.",
        "categories": [],
        "website": "https://course.cse.ust.hk/comp2711h/",
        "credits": 4,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510,
            1410
        ],
        "prerequisites": "Grade B or above in AL Pure Mathematics/AL Applied Mathematics; OR level 5* or above in HKDSE Mathematics Extended Module M1/M2; OR grade A- or above in <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1014\" href=\"/review/MATH1014\" target=\"_blank\">MATH 1014</a>; OR grade B+ or above in <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1020\" href=\"/review/MATH1020\" target=\"_blank\">MATH 1020</a> / <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1024\" href=\"/review/MATH1024\" target=\"_blank\">MATH 1024</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"2711\" href=\"/review/COMP2711\" target=\"_blank\">COMP 2711</a>, <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2343\" href=\"/review/MATH2343\" target=\"_blank\">MATH 2343</a>",
        "rating_content": 4.97,
        "rating_teaching": 4.84,
        "rating_grading": 4.71,
        "rating_workload": 3.97,
        "review_count": 31,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": true,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 107,
                "name": "ARYA, Sunil",
                "count": 31
            }
        ]
    },
    "reviews": [
        {
            "hash": "3XrdNHwAGpH41Us9mFejXa8usBkZaStQ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Think",
            "date": "Dec 24, 2018",
            "title": "Just take this",
            "comment_content": "Same as 2711. Maybe a little bit deeper, but basically the same.",
            "comment_teaching": "He is a great teacher. Shows everything step by step and very clearly so that everyone can understand. The lectures are quite different from the notes on the course website, but in the essence, they are the same. Still, it is very recommended to attend the lecture since you can gain much deeper understanding of the concept much easier.",
            "comment_grading": "Grading is great. More than half gets A range. The scheme was <br /><br />MT 35%<br />Final 45%<br />Assignments 20%<br /><br />The exams have high means, yet if you study the notes, examples in class, past papers, and especially the Question Bank and Extra exercises carefully, you will be able to get high marks.",
            "comment_workload": "All you have to do is just study for the exam plus just 4 assignments. The assignments tend to be quite hard and mean is very high either: still, if you search online, you have access to most of the answers, and even the lecturer do not stop you from doing so. He thinks it is one of the ways you learn.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FEy9j0T9xV5FX4tCltrPmRkYXI33ppF6",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "xdlok",
            "date": "Nov 21, 2017",
            "title": "Don't be afraid of the 2000 title! Take it if you meet the prerequisites!",
            "comment_content": "MATH course with COMP course code. The content is similar to the non honor version:<br />Basic logic, proofs; combinatorics, discrete probability; Number theory, cryptography; Induction, recursion, Big O, omega, theta notations; Graphs.<br />The prerequisites are not really needed because no calculus are required, but good problem skills are (good DSE core combinatorics and probability knowledge would be a great plus).<br />The content is appropriate even for a year 1 student like myself.",
            "comment_teaching": "HIs teaching is really good and the content is good. He encourges thinking about a topic or question deeper because this is honor class. He is funny as well. Although he has an accent, it is comprehensible. <br />The ta is just ok, we only do a few questions in the tutorial, looked at the answer for a little while, and move on.",
            "comment_grading": "The midterm have a mean of 78 and a sd of about 15, and the exam have a mean of 81. I got slightly above mean for both, but below mean for all homework, but still got an A.<br /><br />It is worth mentioning that the midterm is heavily &quot;inspired&quot; by the homework, as prof pointed out. I was shock though, seeing the same question about proving the Chebeyshev Inequality (worth 10 points), and overall are quite similar to the homework. The exams are just a memorization fest where you write out things you memorized from the notes. Just read all the notes and you are done.",
            "comment_workload": "OH BOY DOES HE MEAN IT WHEN HE SAID THAT THE WORKLOAD IS HIGH. There are 4 homeworks, with about 9 - 14 days to finish the homework, which consists of about 10 - 15 question. Those questions are very hard, really require you to spend a whole night to think about, doesn't work, and try another way. I ended up googling some of them. And only some of the questions were graded each time, and they chose the easy one. If you did well on the questions that they didn't mark, well, bad luck for you.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CE0axgCgNGqsvIwY9cKAYPupcFlH3TdC",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rind",
            "date": "Dec 28, 2020",
            "title": "",
            "comment_content": "1. Prepositional logic<br />2. Predicate logic<br />3. Inference<br />4. Sets, Functions (self-study)<br />5. Mod<br />6. GCD<br />7. Cryptography<br />8. Counting<br />---Midterm---<br />9. Permutations, Combinations<br />10. Binomial Coefficients<br />11. Inclusion-exclusion principle<br />12. Algorithm<br />13. Probability<br />14. Conditional Probability<br />15. Expectation, Variance<br />16. Induction<br />17. Recursion<br />18. Graph<br /><br />If you have studied M2 before, some topics like induction and binomial theorem are easy for you.<br />If you have MO experiences, then many topics in this class are easy for you.",
            "comment_teaching": "Arya is very enthusiastic on teaching. You can feel his excitement in lessons. It takes some time to get used to his accent. He explains everything clearly.<br /><br />In the first lecture, he said he knows that we will forget all the course content after this course, but the main takeaway from this course is the way of thinking. How to deal with different kinds of problems. Arya does have his own ways to solve every questions and most of them are very effective.<br /><br />He and TAs are willing to answer all questions. Tutorials are good and TAs really can teach you something.",
            "comment_grading": "Assignment 10/10<br />Midterm 100/100<br />Final 87/100<br />Final grade: A<br /><br />You can find more details of grading in other review, I personally do think students this year are much more stronger (very high mean score). Maybe not so &quot;good grade&quot; compared to previous years?",
            "comment_workload": "Workload depends on your basis. Please attend lecture if you don't learn the materials before.<br />Lecture notes are not written is a good way because some of the slides are not examined/some details are missing.<br />Assignments are much harder than exam questions. If you can finish it by yourself then you are doing pretty good in this course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "rScoSkfHhIulvajK2sg6mEKUk4toFGV9",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "qjk",
            "date": "Dec 28, 2020",
            "title": "Not as good as the other reviews say",
            "comment_content": "Basically the same content as in COMP2711. The order of teaching is different, however. Also, is this semester graphs were covered in H but not in non-H.",
            "comment_teaching": "Sunil is a good teacher. He has a bit of an accent but you can still clearly understand what he is saying. Both Sunil and the TAs are helpful and will respond to emails promptly. I sent many emails to TA Jiachuan before the finals and he responded in detail to all my questions. One time he even responded within 4 minutes. The whole teaching team is very professional.",
            "comment_grading": "HWs 10% at 2.5% each<br />Midterm 40%<br />Finals 50%<br /><br />Me:<br />HW: 20/20 20/20 18/20 20/20<br />Midterm 95/100 - Mean 87.5 SD ~13<br />Finals 92/100 - Stats not official released, mean should be 89.9 according to canvas<br />Total course grade: 93.75%<br />Grade: A<br /><br />In the midterm I lost 5 marks because I forgot the whole proof of Euler's GCD algorithm, and in the finals I lost 8 marks because I made a careless mistake.<br /><br />For comparison, I hear a 91.75% in 2711 was worth an A+ in the semester I took 2711H. So I basically signed up for a shit load of extra work with no extra gain GPA-wise. I spent 7 (seven) days revising for the finals, man.<br /><br />I don't know what other ppl got, but FYI Sunil said the mean would be around A-.",
            "comment_workload": "The workload is intense.<br /><br />The HW is insane and I needed to google all the answers, but it is okay if you google the answers but you memorize how the questions are done.<br /><br />The question sets are optional but you need to do them to get an A. There are questions sets and supplementary question sets and all of them are useful. Half the exam questions are copy pasted from the HW and the question sets.<br /><br />For the finals, I spent 7 days revising for it, going through all the questions sets and HWs and doing some past papers. Sunil will release the past papers.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "z1WBJwuK4MSAeNLEfJqwmZxqfgwEbOgA",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CyrusL",
            "date": "Jan 10, 2019",
            "title": "",
            "comment_content": "Similar content as that of COMP 2711.<br /><br />1. Logic and Proof<br />2. Modular Arithmetic<br />3. Combinatorics<br />---- MIDTERM EXAM ----<br />4. Probability and Statistics<br />5. Induction and Recursion<br />6. Graphs*<br />---- FINAL EXAM ----<br /><br />*Graphs will only be covered if time allows. In this semester, the professor finished around half of it.",
            "comment_teaching": "The professor explains the concepts in much detail (as expected for a honors course) and often emphasizes the importance of thinking about the same problem in different ways, so as to build a richer mathematical sense. Possibly as a result, the proofs in class may differ from the ones displayed in the lecture notes posted on the course website. General recommendation is to not skip class, although the professor said himself that it is totally alright to just read the lecture notes. If you do attend class, be warned that using mobile phones is frowned upon (laptops are fine).<br /><br />On the other hand, the tutorials are just about average. What happens is that several problems are selected from the question bank (which will be posted on the course website beforehand) to be explained by the TA, which is, frankly, quite boring. If you have done all of the questions in advance and checked your answers, the tutorials can be skipped. Only attend if you have questions.",
            "comment_grading": "Assignments 20%<br />Midterm 35%<br />Final Exam 45%<br /><br />For each assignment, only 4 to 5 questions are chosen randomly to be graded.<br /><br />Both the midterm and final exam cover all content taught previously. Many of the questions were taken directly or closely adapted from the question bank, so be sure to use the question bank as exam practice! The final exam was significantly easier than the midterm for this semester.<br /><br />The professor mentioned that as long as you put in the same amount of effort, the grade achieved should be around the same as if you took COMP 2711. Having a mean score should guarantee you an A-.<br /><br />MY RESULTS<br />Assignments: 93.5/100 (Mean: 92.8, S.D.: 8.1)<br />Midterm: 53/100 (Mean: 70.0, S.D.: 20.3)<br />Final Exam: 97/100 (Mean: 81.0, S.D.: 19.8)<br />Overall: 80.9/100 (Mean: 79.5, S.D.: 15.9)<br />Rank: 38/60<br />Grade: A-<br /><br />The professor released the scores of each and every student (identified by last few digits of SID); couldn't hope for more transparency than that.",
            "comment_workload": "There are 4 assignments, each with around 10 questions. Depending on the difficulty, each assignment can take anywhere from 4 to 16 hours to complete (assuming that you do not search online for answers). Both handwritten and printed work are accepted (hard copies only).<br /><br />Considering that I also took COMP 2012H during this semester, the workload for this course isn't really that much... right?<br /><br />If you are not interested in discrete mathematics, taking COMP 2711 may be a better idea.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OV5skuwYhRJ0Hs0aV3lEqGASj9aJ6Zz7",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "M.L",
            "date": "Aug 15, 2022",
            "title": "must reg if you can",
            "comment_content": "similar to 2711 but actaully easier than 2711 lol. I swear I don't know how to do the questions on 2711 ahahah. <br /><br />Lecture and assignment much focus on proving.",
            "comment_teaching": "arya is sooooooo goooooooood. Willing to answer all your questions after class, sadly I have others lecture to attend so I cant ask him frequently. Have Indian accents but it is fine to me.",
            "comment_grading": "you only have to get mean in order to get A-.<br /><br />however, it is quite competitive, as lots of people get full marks in all assessments. I got 94 in the final but it was only the median lol fml. <br /><br />mid-term slightly below mean, final median, assignment around 94%. A-",
            "comment_workload": "moderate. homework take around 2-3 hours to finish but you got around 2 weeks to do it.<br /><br />Exam consists of 7-8 questions.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XrdRiwZZHT0b9lBCvKzbRxCR0dDaSOYM",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "akiyamamiobf",
            "date": "Dec 16, 2021",
            "title": "",
            "comment_content": "sets, functions; propositional logic, predicate logic, rules of inference, proof techniques; pigeonhole principle, basic and generalized permutations and combinations, binomial coefficients, inclusion-exclusion principle; probability theory, Bayes theorem, expectation, variance, random variables, hashing; cryptography and modular arithmetic, Euclid’s division theorem, multiplicative inverse, divisibility, RSA cryptosystem, Chinese remainder theorem; mathematical induction, strong induction and well-ordering property, recursion, recurrence relations; graph",
            "comment_teaching": "Arya teaches well but sometimes his English is a little hard to understand.",
            "comment_grading": "It is said that you will get A- once you reach the mean.",
            "comment_workload": "There are 5 HW in total and 4 of them are used for grading. It will take you several hours to finish each of them.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ng0AhTOSaLg37T3oArtYKbYkww92AAZh",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "H.Y",
            "date": "Feb 23, 2020",
            "title": "Great Course",
            "comment_content": "Similar to COMP2711 but with a slightly different order, we taught &quot;number theory&quot; after &quot;logic&quot;(first chapter), and skipped &quot;set and function&quot;(self-study).",
            "comment_teaching": "Great teaching! Very enthusiastic and willing to interact with students. He always starts from the most basic concept and gradually gets deeper. If u followed him, u will found everything makes sense and easy to absorb.",
            "comment_grading": "The question in midterm and final was very similar to HW and tutorial( if not identical). Thus, there is a high chance to do well in exams as long as u get familiar with the content and practice some of the questions.<br /><br />(Edit) <br />The grading is very very good, over 1/3 got A+ this semester! huge A range!",
            "comment_workload": "Adequate workload. Only 4 assignments with 5-8 questions each. Since there around 2 weeks for each of them, if u start thinking them early, u only need to spend few hours writing down your solution in the end. I recommend( and u should as the professor said in the first lecture) do all the homework alone. It feels very good when figuring them out :)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5TcTTDpRzwZc8wo4WvBW0GG7GZ1JnEdA",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jade Zhang",
            "date": "Jan 09, 2018",
            "title": "Honors Discrete Mathematical Tools for Computer Science",
            "comment_content": "The course mostly cover the content of 2711, i.e. logic, combinations, discrete probability and number theory and&nbsp;&nbsp;Arya also gives some insight into graph theory, which you may find it useful in 3711.&nbsp;&nbsp;It discusses some proofs, like those combinational proofs of combination identity and you are required to understand them and prove them in the exam. Some useful techniques may be taught and required to practice in your homework, but you are not required to think out very fancy or wield techniques.",
            "comment_teaching": "Arya has his accent, but once you get used to it, you must like it. His teaching style is relatively relaxing and interesting and he is quite nice to answer questions after class and are willing to praise you for your small findings.",
            "comment_grading": "The grade is really good. Arya promised in the first class that, if you spend the same effort, you won't get a worse grade than those in 2711. Many students get A arrange.",
            "comment_workload": "Throughout the semester, you will be distributed 4 to 5 problem sets, which you may need to turn in after one or two weeks. To practice on them is quite helpful for your exam.&nbsp;&nbsp;Generally speaking, its workload is smaller than any other honor course's.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sqsTy4GuYtOQqSxHOffXGATz7t1qETLj",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "NightShade",
            "date": "Aug 25, 2015",
            "title": "Simply Amazing",
            "comment_content": "Book exists but is unnecessary as long as you attend all lectures and read all notes and do all your homework (which inevitably you're gonna have to google!)<br /><br />We used professor DYY's notes, they're amazing.<br />(https://course.cse.ust.hk/comp2711h/dyyeung_notes/1_Logic_print.pdf)<br />If you love maths, you're gonna love this course.<br />If you dread maths, you're&nbsp;&nbsp;still gonna love this course.",
            "comment_teaching": "Is amazing. Despite being an honors course, the journey was slow, smooth, with elaborate explanations and easy-to-understand analogies. Professor explains all concepts from the grassroots and slowly builds upon them.",
            "comment_grading": "Was good, courtesy a small classroom.<br />Mean around 70% (B+)",
            "comment_workload": "Almost 7-8 sets of homework that are time consuming but essential, since they are graded and lead to a better midterm/final grade. If you like combinatorics and tricky problem-solving, you may breeze through the understanding-part. Sorry, but this really needs hard work (aka practice).",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wA8dCX8OOiIiKhIpv3Y6UkxtMXALbY1Z",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "UnconMarketeers",
            "date": "Dec 14, 2022",
            "title": "Essential math course teaching essential math tools",
            "comment_content": "1. Official textbook: Notes on the course website, and his own lecture - The content taught in class might be different from that in the notes, and not all stuff is taught. <br /><br />2. Course structure: <br /><br />========Part One: Pure Logic stuff=======<br /><br />TL;DR: Literally basic building block in math.<br /><br />i. Propositional logic, inference,... (Most useful takeaway: p implies q iff not q implies not p - A logical mistake that everyone makes in daily life)<br />ii. Set and cardinality<br />iii. Function (Mapping between sets), and injective, surjective, bijective...<br /><br />==========Part Two: Number Theoty===========<br /><br />TL;DR: Basic number theory. <br /><br />iv. Mod arithmetic and number theory (Euclid's algorithm, Fermat's little theorem, C.R.T... - One shall study abstract algebra topics like group and ring for further study)<br />v. Cryptography (RSA)<br /><br />========Part Three: Counting principle==========<br /><br />TL;DR: One of the hardest types of question appears here! You have to prove identity, usually combinatorial approach instead of analytic. It is quite difficult because you may not figure out the correct scenario for the proof!<br /><br />vi. Permutation and combination, binomial coefficient<br />vii. Inclusion-exclusion principle<br />viii. Analysis of algorithm (Big-Oh, Big-Theta, Big-Omega...)<br /><br />=========Part Four: Probability======<br /><br />TL;DR: Discrete random variables. The only continuous stuff taught is normal distribution.<br /><br />ix. Random variable<br />x. Expectation and variance, conditional probability<br />xi. Special distribution (Bernoulli, binomial, geometric, normal...)<br /><br />=========Part Five: Others=======<br /><br />xii. Strong/weak induction<br />xiii. Recursion<br />xiv. Graph theory",
            "comment_teaching": "Interactive, encourage students to ask and answer questions. Although I never attend his lectures after midterm because the content in latter part is quite familiar for me, I still agree that the instructor is a good teacher.",
            "comment_grading": "Homework 10%, Midterm 40%, Final 50%. Given this is an Honors course, the grading should not be bad.",
            "comment_workload": "Moderate. 4 homeworks for different topics. <br />For exam, it is essential to master some special types of questions, like combinatorial proof. Some messy stuff like derangement, recursion, CRT or even RSA algorithm will be examined (Chance of appearance in exam from high to low. roughly) so make sure you know how to do them.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bLuZnAEskG1l51knCG5pnjUL60bAjI9m",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "PearlLHF",
            "date": "Apr 10, 2019",
            "title": "",
            "comment_content": "Basic Discrete Math:<br />Logic<br />Mod<br />Combination and permutation <br />Expectations and variations <br />Graph...",
            "comment_teaching": "The professor is nice and the teaching is great. He always shows vivid examples and sometimes interacts with students. The explanation of each problem is quite clear, and it is easy to follow him when doing hws and exams.<br />Tutorial is useful but actually a little boring compared to lectures.",
            "comment_grading": "Easy exams, good grades.<br />Large A range.",
            "comment_workload": "Just focus in class, take the given questions seriously and fully understand all the problems. You don’t need to spend more time on this class.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lFH1XrzD2pKlypmGxbbJfcnUrOFBGEEc",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Otaku",
            "date": "Dec 25, 2018",
            "title": "",
            "comment_content": "The course provides a gentle introduction to students who are interested in further study in computer science the mathematics which commonly appears in their studies. As suggested by its title, this course revolves around the discrete part of mathematics, namely:<br /><br />1. Logic<br />2. Number Theory<br />3. Counting and permutations<br />3. Discrete probability<br />4. Induction and recursion<br />5. Graph theory<br /><br />The course enables students to develop their mathematical maturity as the content is rather rigorous and formal, though the instructor also succeeds in telling the motivations and intuitions behind formal definition and proofs.<br /><br />The instructor does not cover all of the graph theory content in the lecture notes because of time constraint.",
            "comment_teaching": "Despite the instructor's Indian accent, his English is easy to comprehend. His teaching is well structured and can be easily followed. He does not like to teach using slideshows. Instead, he loves to use the whiteboard to write the contents down. Some of the content are not present in the lecture notes, which is the same set of notes used in the non-honor version of COMP2711, so do remember to attend the class and take notes. In the mid-term examination, the professor posted a question on the proof of Fermat's Little Theorem, which of course has been taught but only written on the whiteboard! If one wants to avoid losing easy marks it is advised that you do take notes.<br /><br />He is really knowledgeable in the subject matter since he is a seasoned veteran in the field of algorithms. He offers insights to problems and concepts which could have been very difficult to grasp for inexperienced learners.",
            "comment_grading": "The grading is lenient. The instructor said in class that he will give all As. Despite being outperformed by a quarter of the students, the writer still managed to get an A+. Therefore, at least a quarter (25%!) of students gets A+ in this course.",
            "comment_workload": "The workload is light as students are only expected to complete and submit four assignments consisting of around 5-10 questions. The questions are challenging yet approachable and insightful. It is expected that the time one spent on this course is mostly due to revision as the instructor provides a large set of problems for us to practice. He provides incentives for the students to practice those questions by reusing them in the written examinations. (He said this in class)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OadDTU8OnwKPY7kVq45zkxe2NmJPHoCP",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Seeking4u()",
            "date": "Feb 03, 2018",
            "title": "",
            "comment_content": "0. Basics: Sets and Functions (self-study)<br />1. Logic and Proofs<br />2. Combinatorics<br />3. Discrete Probability<br />4. Number Theory and Cryptography<br />5. Induction, Recursion, and Recurrence Relations<br />6. Graphs (wasn't covered thoroughly due to time constraint)",
            "comment_teaching": "One of the best instructors from CSE department. Sunil is not just knowledgeable, he can really explain mathematical concepts in an intuitive and organic manner. He's inspiring and humorous as well. I went to every lecture, overall very enjoyable.",
            "comment_grading": "HW 20%, Midterm 35%, Final 45%<br />Probably one of the most generous grading scheme among courses offered by CSE department. Admittedly most students taking this course are quite diligent and smart, and this drives up the mean scores easily, but if you can keep up with your peers, it's very likely for you to get A-range.",
            "comment_workload": "4 written assignments (feel free to use LaTeX) in total for this semester. Originally it was supposed to be 5, but it was reduced to 4 in the middle of the semester. For each assignment, we had slightly less than two weeks to solve 10++ problems. Better start early because every assignment will definitely have some difficult questions. Pay attention to basically all examples used by Sunil, they might appear in the midterm/final.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oT7wEG1ZQRic5mfuKi7h7ueL66Vpzr5j",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MEMENTO",
            "date": "Dec 28, 2017",
            "title": "",
            "comment_content": "The content includes logics, combinatorics, probability, number theory, recursion and graph theory. These contents are very interesting if you like math.",
            "comment_teaching": "Arya's lectures were very easy to understand, and he was engaging students into his lecture, which was good. I think the TA was quite smart, and his materials clearly helped with understanding the course materials.",
            "comment_grading": "The grading was amazing. I think if you get above mean in&nbsp;&nbsp;mid-term and final and all the assignments, you will get at least A. If you do better than that, like getting around 0.5-0.6sd above mean, you will get A+. However, note that the mean on the exams and assignments tend to be very high, since this is an honor course.",
            "comment_workload": "In my opinion, the workload was quite light. For this semester, you only needed to do 4 assignments, each assignments with around 10-15 questions. If you paid full attention during the lecture and reviewed the lecture notes, the assignments would not feel very difficult. Also, you are given about 2 weeks to finish each assignments, so you do not need to rush in time.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pIXaKDXO2Ha7281NiNNgwz9a7CElqHQK",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "當科",
            "date": "Jan 22, 2017",
            "title": "Excellent course, heavy workload",
            "comment_content": "To quote from the course homepage: &quot;Discrete mathematics needed for the study of computer science: sets, functions; propositional logic, predicate logic, rules of inference, proof techniques; pigeonhole principle, permutations and combinations, binomial coefficients, inclusion-exclusion principle; probability theory, Bayes' theorem, expectation, variance, random variables, hashing; cryptography and modular arithmetic, Euclid division theorem, multiplicative inverse, divisibility, RSA cryptosystem, Chinese remainder theorem; mathematical induction, strong induction and well-ordering property, recursion, recurrence relations&quot;<br /><br />We were supposed to learn about graphs too but we didn't have enough time so the professor just gave an introduction to the topic.<br /><br />The concepts were easy, but the actual applications were difficult and complicated. Very interesting nonetheless.<br /><br />~90% of exam questions are taken from homework and lecture notes. Although Sunil emphasised that we should understand the content instead of memorising, but at the end it was still a memory contest more than anything.",
            "comment_teaching": "Excellent professor. Clear and humorous teaching. Never seen such a high attendance in a 9am class. Sunil is the kind of professor who makes you want to go and check the class schedule website and see whether or not you can enroll in his other courses in the next semester.<br /><br />Our TA was Yuchen Mao, who was also excellent. He responds quickly to emails and teaches clearly.",
            "comment_grading": "Good grading, I believe almost everyone got A-range.<br />Above mean = A+<br />Mean = A<br />Below mean = A-<br />(but just don't exploit Sunil's good grade and get ridiculously low scores, someone in our class didn't attend the finals, and idk what grade he/she got at the end)",
            "comment_workload": "5 written assignments in total, we were given 1-1.5 weeks to finish each.<br />Assignments were very challenging, quite a few assignments I had to finish by googling the answers.<br /><br />Don't take too many credits along with this course cause it's quite demanding.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "D8K4rUEfv1dVFHplFH0wlzcqyw68xnsi",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sheetal",
            "date": "Aug 21, 2016",
            "title": "",
            "comment_content": "The content is same as the non honors course, but taught at a different pace. The content is majorly about algorithms, probability and running time.",
            "comment_teaching": "I absolutely love how sunil arya teaches! His teaching is organic and has a very good flow i.e. he wont teach something simple and expect you to understand a ver hard concept from that. He explains everything step by step and gives a lot a practice!",
            "comment_grading": "He needs you to have at least a B+ in the previous MATH Courses. Absolute grading: most people get A range or a B+.",
            "comment_workload": "Heavy! But worth it if you really want to learn all the concepts properly!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qmGKihlxOKIuiPjR6CEV657kU4KYtEN8",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "WilLEE",
            "date": "Jan 25, 2016",
            "title": "",
            "comment_content": "Very similar to normal version of COMP 2711. Lecture notes are from normal version COMP2711 at 2014 Spring. The course is totally MATH course. Extra topics (graph theory) may discuss during lecture time but no notes, have to attend and jot down by yourself.<br /><br />Book is not required but may useful for handling assignment problem. Book name: Discrete Mathematics and Its Applications 7th edition, Publisher: McGraw-Hill",
            "comment_teaching": "Lecture will elaborate all terms and theories, and may show you the correct way to solve problem. Teaching style is quite traditional, by writing everything on board instead of PowerPoint, but won't boring and easier to follow. Tutorial will discuss the use of theory taught in lecture to solve problem.<br /><br />The only drawback is Prof. ARYA spent too much time on early topic, causing no time teach topics behind (some of graph theory are skipped and some of them are concluded only in 1~2 lectures.) But overall, his teaching is good for students from all background to follow, and wanna everyone understand before goes on.",
            "comment_grading": "Very good grade, ~75% or above can reach at least A-.<br /><br />Grading: 20% for assignment, 30% for mid-term, 50% for final.<br />Mid-term and final may also cover topics in assignments (may not be discussed in lecture), but exam questions are easier than assignments.",
            "comment_workload": "Total 5 assignments, each assignment consist at least 10 questions, some of them consist 20+ questions. They are extremely hard, some of them require extra knowledge which is not included in lecture to solve it. Assignment will be released 2 weeks before due date.<br /><br />Assignment count for final grading 20%, and some theory not being discussed in lecture but existed on assignment may also included in exam. Have to work extremely hard for good grade.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EThGDSRA5wVT4gOQLasakfUgnPcpakux",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TO Junheng",
            "date": "Dec 31, 2022",
            "title": "A clever class does some clever things",
            "comment_content": "The course teaches basic number theories, logics, combinatorics, probabilities, and some graphs. Most of the content is easy to grasp but needs your own understanding and assimilation.<br /><br />If you are a Mainland student, you may find it much alike &quot;xiao xue ao shu&quot; in a more systematic way.",
            "comment_teaching": "Professor Arya is very passionate in teaching, and he is so popular with his students that you hardly find a seat if you come at the class-begin time sharp (That's why I always sit in the last row or directly disappear [crying]). The professor speaks a perfect Indian accent, so it is a good chance for you to improve your Indian English listening.",
            "comment_grading": "Homework 10%<br />Midterm 40%<br />Final 50%<br /><br />The exam questions are straightforward, most of them bearing great resemblance to examples covered in lectures. But getting a high score really requires you to elaborate your proofs and solutions elegantly, since ambiguity and lengthiness may lead to score deduction.&nbsp;&nbsp;<br /><br />Lenient grading, getting above mean means A range.<br /><br />For your information, I got 96 in midterm, 100 in final, and the letter grade is A+.",
            "comment_workload": "The workload is small. There are only 4 homework sets and two exams.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0vZVElSL9jvkXYkrMhJO461IKSG30gMh",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Evanescence",
            "date": "Dec 28, 2022",
            "title": "Take This Is Always Right",
            "comment_content": "Some General Contents of Discrete Mathematics:<br />1. Logic<br />2. Number Theory<br />3. Combinatorial Mathematics <br />4. Induction/Recursion<br />5. Probability <br />6. Graph<br />Due to time limit, Graph only covered some basic concepts and didn’t appear in the final examination this semester.<br /><br />Difficulty: 数竞一试, some basic mathematics Olympic questions. If you learned Olympics before, you’ll certainly have no problem.",
            "comment_teaching": "Frankly speaking I don’t know quite well. I attend the course for 2 or 3 lectures and I find Arya’s teaching is quite well-structured.<br />He is responsible that he conducted a make-up lecture via zoom.<br />But I couldn’t say more as I really didn’t know…",
            "comment_grading": "Quite Lenient:<br />Midterm 40%, Final 50%, Assignment 10%<br /><br />Midterm Mean: 80.5/100<br />Mine: 88/100<br />Final Mean: 79.7/100<br />Mine: 98/100<br /><br />Overall: ~94.2&nbsp;&nbsp;Final Grade: A+<br />Assignment nearly all the full marks.<br />Be well-prepared for the exam you will have no problem. Just remember to refer to the textbook and review more combinatorial math (since it’s more difficult).",
            "comment_workload": "Light.<br />Only study 1 hour to see the slides and spend 1-2 hours on each assignment. And review 6 hours for the midterm and 3 hours for final examination.<br />If you have some Olympics foundation, I think you will do a great job with a little effort.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PCy7sKEwXe4kG2Num0YQunzLt5HFIFRn",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "scyeung",
            "date": "Dec 19, 2022",
            "title": "Equivalent to F.3 Olympiad level math",
            "comment_content": "Pretty standard discrete mathematics stuff including number theory, combinatorics, probability, expected value, recurrence relation and&nbsp;&nbsp;graph theory.<br /><br />Difficulty-wise, the course covers only very basic stuff. For number theory, only basic congruences, Euclidean algorithm, Chinese remainder theorem and Fermat's little theorem are taught. For combinatorics, you need to know how to count with star-and-bars and some common double counting skills. For expected value, probability and graph theory, you only need to know very basic stuff.<br /><br />People who are trained in HK IMO team should find this course very easy since secondary olympiad math is way more comprehensive and in depth than this course. I'm honestly, a little disappointed in this fact since it's supposed to be an honour course.<br /><br />BTW, there are enough supplementary exercises for students who wish to practise more, which is a big plus for the course.",
            "comment_teaching": "The lectures are great, the instructor is passionate&nbsp;&nbsp;about its teaching and try to invoke thinking from students. I didn't attend any tutorial so I can't say anything about that.",
            "comment_grading": "Haven't received the grading yet. I'll update about this part later.<br /><br />Update:<br />Receiving 94 or above will give A+, which is pretty fair.",
            "comment_workload": "The workload is light. Only 4 assignments throughout. Most people got full marks in all assignments.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AV4N14NcveSYJKQiNlqdllTMZAOCdgER",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yeah~",
            "date": "Jan 23, 2022",
            "title": "",
            "comment_content": "Logic<br />Number Theory<br />Probability<br />Induction<br />Graph",
            "comment_teaching": "Sunil is really passionate during his lecture. His English is fluent, so the speed of teaching won't be very slow. Though he has accent, it completely won't influence understanding him.",
            "comment_grading": "I will give A to grading because it's true that you can get an A by staying a little above mean.<br />However, I have to say the mean is really high (around 85-90). Though the content is not very difficult to learn, a small mistake in the exam will make you slightly above mean or below mean.<br />Getting A+ requires getting around full marks in all homework and exam.<br />I got above mean in mid-term and around full marks in the rests, and I got A.",
            "comment_workload": "Totally 4 homework, each containing 10+ problems.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tKGeaVN7JvYtInxES0Q6djqQe9r7R2S3",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Colythme",
            "date": "Jan 21, 2022",
            "title": "Really good grade",
            "comment_content": "logic<br />basic number theory<br />a little bit graph theory",
            "comment_teaching": "Though cannot really understand his accent and written language, yet can see that he dedicated a lot in the class.",
            "comment_grading": "Really good grade!<br />If you're above mean, then you're in A range!<br />And as well a great range of A+!",
            "comment_workload": "Not so much<br />If you wanna only get mean then have A range, then maybe 1h a week is enough.<br />If you wanna get A+, then maybe about 1h a week for review, and 8h a week for doing exercises is enough.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eqYGY93pScTrO6sc9cnZDpIGQ6yQkkG2",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "XVYI",
            "date": "Dec 20, 2021",
            "title": "Nice course with good grade",
            "comment_content": "The content includes is as following:<br />- logic and methods of proof. ie. proof by induction.<br />- some number theory ie. RSA, euler totient theorem, Chinese remainder theorem.<br />- algorithm analysis (Big O, theta, omega notation and asympotic)<br />- discrete probability (some basic stuff)<br /><br />Overall the content are not twoo difficult but is definitely interesting.",
            "comment_teaching": "Prof. Sunil is a decent teacher. You can tell that he is passinate about his topics and would like to engage the class. He is very nice when asnwering any of our questions. <br />However, he would skip some of the details (such as some proofs) in the lecture and reading the lecture notes would help. His handwriting is sometime hard to recognize. <br />Some of the harder problems are in the tutorials so I would recommand at least attempt some of the questions in the question bank.",
            "comment_grading": "The grading is very good. I did not do so well at the midterm and final (around 85) and still get an A-. <br />I would recommand this course for getting a good grade.",
            "comment_workload": "Workload is fine. There are 4 homeworks in total and each one took about 2 hrs to finish in about a week. It is quite time consuming, especially when sometimes stuck on some problems, over I guess its fine when spreading in the whole week.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3YAlz0XfS084La7So01q5Hm70D5tTqhe",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "purpleworld",
            "date": "Dec 20, 2021",
            "title": "Enjoyable course",
            "comment_content": "Logic\t<br />- Propositional logic\t<br />- Predicate logic<br />- Inference and proofs<br /><br />Number theory<br />- Modular arithmetic<br />- GCDs and congruences<br />- Cryptography<br /><br />Counting\t<br />- Basic counting<br />- Permutations and combinations<br />- Binomial coefficients<br />- Inclusion-exclusion<br />- Analysis of algorithms (half taught by TA to keep up with the schedule that was affected by typhoon)<br /><br />Probability<br />- Introduction to probability<br />- Conditional probability<br />- Expectation and variance<br /><br />Induction and recursion<br />- Induction<br />- Recursion<br /><br />Graphs (covered very small portion this sem)",
            "comment_teaching": "His teaching is logical and clear.<br />Every topic is explained from easy concepts, then slowly developed into complicated ones.<br />He is also willing to answer any questions patiently.<br />It is worth it to take the H course.<br /><br />TAs are willing to answer questions.<br />Tutorials covers some questions in the question banks provided.",
            "comment_grading": "It is good in my perspective as above mean gets A-.<br />\t\t\t\t\tMy score<br />Assignments\t10%\t\t16/20,17/20,20/20,18/20 <br />Midterm\t\t40%\t\t80/100<br />Final\t\t50%\t\t90/100 <br /><br />The mean is around 17,18 for assignments, <br />around 82 for midterm and<br />around 84 for final.<br />So I get slightly above mean.<br /><br />For assignments, only a few questions are selected to be marked so comparatively difficult questions may not count towards the grade.<br />Midterm and final are not as hard as it can be but still there are some more challenging questions included.<br />As a few people get full marks for midterm, the professor told us that final will be harder. (still some gets full marks anyway)",
            "comment_workload": "I need to work a few hours for around 2 to 3 days for every assignment and spend 2 to 3 days for revision but still feeling not enough before each test. Although it may because lectures are in the morning and I had a hard time not to fall at sleep so that I need more time to understand topics that I did not concentrate and listen, some complicated concepts needs time to be understand fully. (there are videos for the lecture to review or just not physically attend the lecture but still I prefer attending them in person) As a year 1 student I have not adapt to a good study habit for university yet, if I had done what the professor said, which is to preview each topic before lecture, it may be much better.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pCzTxktuCIMtsMnUM6qP87wS2FMs6W9Q",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JimmyLeung1998",
            "date": "Jan 21, 2018",
            "title": "Honors Discrete Mathematical Tools for Computer Science",
            "comment_content": "Discrete mathematics needed for the study of computer science: <br />1. sets, functions; <br />2. propositional logic, predicate logic, rules of inference, proof techniques; <br />3. pigeonhole principle, permutations and combinations, binomial coefficients, inclusion-exclusion principle; <br />4. probability theory, Bayes' theorem, expectation, variance, random variables, hashing; <br />5. cryptography and modular arithmetic, Euclid’s division theorem, multiplicative inverse, divisibility, RSA cryptosystem, Chinese remainder theorem; <br />6. mathematical induction, strong induction and well-ordering property, recursion, recurrence relations; <br />7. graph representation, isomorphism, connectivity, Euler and Hamiltonian paths, planarity, graph coloring.<br /><br />(1) is not formally taught in class, basically ur knowledge in thz topic is assumed, meaning that u would hv to do some self-study. Btw it is not difficult, just some terminology.<br />(2) would be a really conceptual topic, no matter how much or how less u memorised, as long as u can use the logic rule to solve problems is ok. Btw I think thz topic would be a good math foundation for one considering taking 3000-4000 math ug courses.<br />(3) (4) is just slightly &gt; dse lv core math + m1, with sth new like pigenhole and inclusion-exclusion. Btw thz part also overlaps with some math 2000 lv stat prob course, (2411, 21, 31...), which are also in comp curriculum. I think the cse dept should really re-consider to construct a better course structure...<br />(5) is about mod operation. Comp 1000lv prog course gives u insight, but this course gives u a more in-depth knowledge. Better take it serious for its wide application in many other Comp theory courses or even courses in diff subj, e.g. math courses like Abstract algebra, Number Theory.<br />(6) is just an extension of Dse lv m2 version MI. Again, what's inmportant is the idea. The stupid work flow and clumsy format would not really bother u much once u get the whole picture<br />For (7) I think prof usually doesn't hv too much time to cover it. Just like in thz sem, basically he just introduced some terminology and definitions. But those fancy terms are stll important. What u hv to do to deal with thz chapter is memorising stuffs as much as possible. In thz way u cen prevent any &quot;surprises&quot; in final exam.",
            "comment_teaching": "I think prof’s teaching is quite well, but one may first listen him speaking eng with a quite strimg accent..<br /><br />One thing worth to mention is, prof has a quite<br />old-style teaching. For most of the topics, he would like to explain by writing everything on board, but not by using ppt slides or showing his work on projector. Plus he does not really hv a nice handwriting. So one might expect to be really concentrated in the lesson to get the idea.<br /><br />Another thing is, some notes or ppt slides he provides in advance are just other prof’s work. And he just provide to us for ref, but does not choose to follow them strictly. For some topics like (5) concerning number theory and (7) graph theory he even told us to ignore those slides, but instead search Rosens textbook for the definitions and thms he illustrated in the lesson. So u may really want to get a Rosen e-book just in case. Luckily there are some free online versions ~<br /><br />And he somehow hates people using smart phone in class, but he just managed to accpet student using computers... So u either use phone in secret or use ur computers in class&nbsp;&nbsp;for learning or other(?) purposes.<br /><br />Overall his teaching is good and the course really equip u with solid knowledge of some discrete math tools. But somehow u hv to get used to the prof’s teaching style.",
            "comment_grading": "20% for assignments (4-5 / sem)<br />35% for mid<br />55% for final<br />A bit diff from most of the math courses<br /><br />As far as I know, most of the people taking thz course would get A range. But i think it is just becoz of their strong academic background...<br />U know, nds and even some locals are really gd at math and logic... <br />(Thz might explain why as an average-lv HK-er, I only can get a A- grade...)<br />(Btw no offense.)<br /><br />One thing gd is, prof is willing to provide pp for us to prepare for mid and final. He may even send u pp in last several sems, as long as sby request in class. And some of the Qs would really re-appear in ur mid / final paper,<br />meaning that u would hv less risk relative to other comp courses when dealing with exams.<br /><br />Overall, hard-working can help for obtaining gd grade, which is good for a comp course.",
            "comment_workload": "For the assignments, he usually delivered it 1-2 weeks before. Like those in C++ class, u may not be able to finish it in last minutes. We are talking abt some REAL stuff here. So just be early planned and better prepared. <br /><br />One thing good is, prof allows or u may say he encourages u to hand in a printed version of ur hw. Plus he specifies that poor hand-writing in hw might cause a lower marks. So u can actually use MS Word or Latex to finish ur hw, which is good for a bad writer like me.<br /><br />For the difficulty lv, some of the hws would be as difficult as those math honor courses (1023, 24, 2131,...). But as the course title suggested, it is also a H course, so u just gotta deal with it.<br /><br />To sum up, u might want to expect to hv a huge workload if u r not really that familiar with math. Even if u r, u still need to work hard to compete with others",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Wr2haSyp0rTijPsBNVYfhm4q8yoorCPY",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yanghaolin",
            "date": "Aug 24, 2022",
            "title": "",
            "comment_content": "lecture and assignment much focus on proving.<br />it is very similar to 2711 but a little more difficult.",
            "comment_teaching": "good and he is willing to answer all your questions.<br />it's easy to understand although he has an Indian2ho accent",
            "comment_grading": "you only have to get mean in order to get A-.<br /><br />however, it is quite competitive, as lots of people get full marks in all assessments. I got 94 in the final but it was only the median lol fml. <br /><br />mid-term slightly below mean, final median, assignment around 94%. A-",
            "comment_workload": "not very big, only need 2 hours for homework every 2 weeks",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CNdVmm79rymoZkZKH8q630whGFXpNjTs",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rigbones",
            "date": "Jan 24, 2022",
            "title": "I love COMP 2711H !!!",
            "comment_content": "Logic<br />Basic number theory<br />Counting<br />Probability<br />Induction, recursion<br />Graphs (briefly)",
            "comment_teaching": "Sunil's teaching is top notch (just like desmond!!!).&nbsp;&nbsp;He stresses intuition and understanding over memorization which is really great.&nbsp;&nbsp;He also enjoys teaching a lot which can be seen by his excited voice when he talks about certain theorems lol.&nbsp;&nbsp;This semester, classes were at 9am but I attended every single one just because of Sunil.",
            "comment_grading": "Really, really good grade.&nbsp;&nbsp;Mean is about A-, which means around half of the class can get A range!!<br /><br />Grades for reference:<br />Midterm&nbsp;&nbsp;100/100,&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mean 81.76<br />HW1&nbsp;&nbsp;19/20,&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mean 18.4<br />HW2&nbsp;&nbsp;20/20,&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mean 17.95<br />HW3&nbsp;&nbsp;20/20,&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mean 18.39<br />HW4&nbsp;&nbsp;20/20,&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mean 17.34<br />Finals&nbsp;&nbsp;95//100,&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mean 83.9<br />Letter grade:&nbsp;&nbsp;A+<br /><br />I know someone who got slightly below mean on midterm and mean in final and got A-,&nbsp;&nbsp;really really good grade",
            "comment_workload": "Moderate workload.&nbsp;&nbsp;<br /><br />HW problems are really hard and some of them can take you 2, 3 days to think about it yourself, but the problems are all standard problems so you can always google the answer if you don't know.&nbsp;&nbsp;<br /><br />If you can do all the HW problems without googling, you probably can get an A+.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BgpAO03myW9Z3odiMSMVkgn8HmSrzTVx",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wlph17",
            "date": "Jan 22, 2021",
            "title": "Great content with great grade",
            "comment_content": "The content is a bit hard but very interesting.",
            "comment_teaching": "Teaching from Sunil is great he will answer your question if you ask, but sometimes I don't really understand him due to his accent.",
            "comment_grading": "The grading is good, you will get an A if you are mean. Midterm and Final are not really hard, some are questions from the assignment, you can do it if you have done the assignment, some are a bit hard though.",
            "comment_workload": "You will have an assignment every week, only a few questions, they are a bit hard, but the answer can be found on the internet.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VJY80784lpwbb3ECEUPZQAGcIYA7E29z",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lucien▪Evans",
            "date": "Dec 13, 2021",
            "title": "a good grading course with excellent teaching",
            "comment_content": "This term Sunil covered Logic, Number theory, Counting, Probability, Induction and Recursion, graphs.<br /><br />Probably due to the typhoon, he didn't finish the part of graphs, and only briefly introduced this part.",
            "comment_teaching": "Following his explanation in discrete mathematics, you will understand it easily since Sunil will explain all these theories in detail and give some examples.<br /><br />If there is a ranking in all the courses i have taken, i will position this course in top 3.<br /><br />The only problem is that it might take you some time to get familiar with his accent.<br /><br />Sunil didn’t make his course hard to understand. I didn’t have the background in discrete mathematics but didn't take too much time to follow with his lecture.",
            "comment_grading": "Final and midterm are very easy and mainly based on the HW and tutorial. As long as you finish these two and write the past paper, you will find every problem is very familiar. <br /><br />Just for reference:<br />midterm: mean 82.54/100<br />HW1: 18.42/20<br />HW2: 17.94/20<br />HW3: 18.41/20<br />HW4: 17.36/20<br /><br />My score:<br />midterm: 100/100<br />HW1:19/20<br />HW2,3,4: 20/20<br /><br />I am waiting for the final scores and will give a supplement after receiving the final results.<br /><br />Final: 92/100<br /><br />Well, my final is not that good since I didn't read the problem very well. It asked us to prove an identity with the&nbsp;&nbsp;inductive tools but I prove it directly. This my scores in this problem were almost deducted.<br /><br />I thought I can only got a A but eventually got an A+. Sunil, I like you!<br /><br />Just for reference, my overall score is 95 very approaching 96. Still don't know the letter grading scheme.",
            "comment_workload": "4 assignments in total. Each has around 10 questions. Compared to other mathematics course, it is rather light. i normally start to do the assignment one day before due date.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dBR71Rl9LD9GprTtngnTSlYPixgJd7hB",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 107,
                    "name": "ARYA, Sunil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Abraham.H",
            "date": "Jan 22, 2021",
            "title": "An excellent course as an introduction to discrete math for CS",
            "comment_content": "The content of this course is very comprehensive to me. It covers a great range of topics like Logic, Number theory, Probability, Recursion, etc.<br />It can be a bit tricky for beginners like me. I've put quite a lot of effort into this course to understand those concepts and theories, but I have to say I'm fully satisfied with this course's content.",
            "comment_teaching": "Prof. Sunil's teaching method is great. He will guide you to think about how the problem comes out and how we develop a solution to it step by step.",
            "comment_grading": "I heard that overall the grading scheme is very good. <br /><br />My grades: <br />5 assignments: 19/20, 20/20, 19/20, 20/20, -/- (the last one was not marked)<br />midterm: 100/100<br />final: 100/100<br />Got A+",
            "comment_workload": "5 assignments, each with 8-10 questions<br />midterm + final<br /><br />Almost all the questions in assignments and exams are proof questions, which requires you to memorize those theories and use them in the right way. They are not unreasonably difficult to do, as long as you are familiar with those several question patterns. But it did take me quite a long time to memorize theories and practice proving. <br />I have to spend at least 5 hours on each assignment. TA also provides supplementary questions of each chapter for revision. <br />Exam questions are not as tricky as assignment questions.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 13,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}