{
    "error": false,
    "course": {
        "id": 2780,
        "subject": "COMP",
        "code": "4462",
        "name": "Data Visualization",
        "description": "This course will introduce visualization techniques for data from everyday life, social media, business, scientific computing, medical imaging, etc. The topics include human visual system and perception, visual design principles, open- source visualization tools and systems, visualization techniques for CT/MRI data, computational fluid dynamics, graphs and networks, time-series data, text and documents, Twitter data, and spatio-temporal data. The labs and the course project will give students hands-on experience to turn their data into beautiful visualizations.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            1930,
            1830
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"2011\" href=\"/review/COMP2011\" target=\"_blank\">COMP 2011</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4,
        "rating_teaching": 3.67,
        "rating_grading": 4.67,
        "rating_workload": 3,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 805,
                "name": "MA, Xiaojuan",
                "count": 2
            },
            {
                "id": 131,
                "name": "QU, Huamin",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "FZMCQVyDigzxhfuT7WVcHk35l9v7OuVn",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 805,
                    "name": "MA, Xiaojuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "#001/BULBASAUR",
            "date": "Dec 14, 2021",
            "title": "You can get A range even below mean in exam",
            "comment_content": "Lecture Outline:<br />Week 1: Introduction<br />Week 2: Color and Perception<br />Week 3: Visual Design Principles<br />Week 4: Visual Design Tasks and Rules<br />Week 5: Top Vis Competition<br />Week 6: Visual Analytics of Trajectories<br />Week 7: Visual Analytics of Multi-Dimensional Data<br />Week 8: Text Data Visualization<br />Week 9: Project Proposal<br />Week 10: Graph Visualization<br />Week 11: Interaction and Evaluations<br />Week 12: Narrative Visualization<br />Week 12-13: Final Project Presentation",
            "comment_teaching": "To be honest, not many people attend the lectures after the add-drop period as the teaching style is not attractive.",
            "comment_grading": "Grading Scheme:<br />- In-Class Exercise and Participation (10%)<br />- Lab Activities and Exercise (10%)<br />- Top Vis Competition and Essay (10%)<br />- Final Project (35%)<br />- Final Exam (35%)<br />Bonus points will be given in in-class exercise, top-vis essay, top-vis voting<br /><br />My score:<br />- In-Class Exercise: 10/10 + 3 bonus points<br />- Lab Activities: 10/10<br />- Top Vis Competition: 10/10 + 2 bonus points on voting<br />- Final Project: 29.44/35 (Highest, mean = 25.62)<br />- Final Exam: 17.85/35 (mean = 20.67)<br /><br />Final Grade = A-<br />Anyway, this is a good grade course as even I got below mean in the exam you can still get an A range. Except for me, all my project teammates got A+, with mean to above mean performance in the final exam.",
            "comment_workload": "If you try to work hard and be perfect in every assignment/project then you will think this course workload is high.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 9,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wkFWNg6fbdWd4C77ZIIHNHSUFYBm9RLr",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 131,
                    "name": "QU, Huamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ptrknow",
            "date": "May 31, 2019",
            "title": "真係 好~好~grade~",
            "comment_content": "List of topics:<br />1. Perception and Color<br />2. Basic Visualization Principles (e.g. show full scale, show full context..)<br />3. Data and Visual Channels<br />4. Task Abstraction<br />5. Rules of Thumb (e.g. eye beats memory; overview first, zoom and filter, details on demand...)<br />6. Trajectory (Time and Space) Visualization<br />7. Multi-dimensional Data Visualization<br />8. Text Visualization<br />9. Graph Visualization<br />10. Validation and Evaluation<br />11. Narrative Visualization<br /><br />====Optional Topics=====<br />12. BitExtract - Financial Data Visualization<br />13. Explainable AI<br />14. Flow Visualization<br />15. Volume Rendering<br /><br />Topics 1 - 5 are about general concepts. For example, when designing visualization, you better obey the rule 'Eye beats memory' by showing as many things simultaneously on the screen as you can, so as to cater for the human's incapable short-term memory.<br /><br />Topics 6 - 9, 11 are about various advanced visualizations (not just some simple line graph or bar chart) that you can choose when doing design. One very typical example is parallel coordinates, which are very useful when your dataset consists of many dimensions (google it and you'd see what it is).<br /><br />Topic 10 introduces research methods to measure/investigate how effective your visualization is. Topics 12 - 15 are more advanced, and are not required in exams (you may want to use these materials in the project and see if professor and TAs would be impressed; in this semester, no group had ever used these materials)<br /><br />Teaching materials (slides) are basically a collection of works of various researchers (at different universities or organizations). Because of this, the styles and outlooks of these slides are varying from topic to topic, i.e. inconsistent.<br />IMPORTANT: Almost all topics have more than one slides, but not every slide is used, and even when that slide is taught, it is possible that some of its parts are skipped during lectures. This essentially means you might not want to skip the lectures so that you can know what unnecessary things can be filtered out when revising for the exam.<br /><br />Overall speaking, contents are not many and not deep. (In some sense, even 1000-level COMP courses teach deeper...) But personally I am quite interested in some of the topics, so I still give a 'B' to this column.",
            "comment_teaching": "Professor's teaching varies with topics as well.<br /><br />If the professor is not interested in that particular topic, or the professor finds that topic boring (you can tell from his teaching and facial expression), then the teaching becomes more boring.<br /><br />On the other hand, if the professor knows the topic well or is interested in that topic (say, when he is introducing the project that he was also in charge with), he talks deeper and makes more jokes.<br /><br />Although the overall teaching is not exemplary, I still give this column a 'B' because the professor is much more effective when answering our questions individually.<br /><br />Both TAs are generally approachable, especially the local one.<br /><br />(By the way, each lecture is 1.5hr long, but usually the professor just finished in 1 hr. The remaining time is for in-class ex., if any)",
            "comment_grading": "10% exercise (in-class exercises and lab exercises)<br />10% TopVis competition<br />30% Final Exam<br />50% Group Project<br /><br />EXERCISE:<br />- A total of 10 in-class exercises and 8 lab exercises<br />- Finishing 9 out of 18 of them would give you a full 10% (even when you just do all lab ex. + 1 in-class ex., or just do all the in-class ex.)<br />- Basically everyone would get this 10%. <br />- Some in-class exercises would appear (only with slight modification) again in the final exam. <br />- Lab exercises are mainly done on Google Collaboratory and Observable Notebook.<br /><br />TOPVIS COMPETITION:<br />In around the end of April, you need to select/search for a visualization that you think is great, then write a report (about 2 pages is ok) and give a 2-min presentation on it. Basically everyone would get this 10% as well.<br /><br />FINAL EXAM:<br />7 problems in total.<br />- The first problem consists of 10 MC questions. Not asking for specific details, but some general concepts.<br />- The second and third problems are mainly about the concepts of topics 1-6. One question is about suggesting several time-series visualizations to solving a specific problem, which is related to topic 6.<br />- The forth to the seventh questions are about visualization designs. We need to sketch (and draw) the outline of visualization and give (annotated) explanations. Try to design a visualization that is effective for comparison purposes and that does not violate the 'eye beats memory' rule of thumb.<br />- The paper is not difficult, but somehow you need to guess what requirements are set by the professor for the visualization design problems.<br /><br />GROUP PROJECT:<br />PHASE I (20% of project mark)<br />- Need to form a group (~4 people) before the end of February<br />- Need to give a proposal presentation (8min) in around late-March<br />- Need to tell what data you have collected, what task you have formulated, and what visualization design you have chosen; you can talk about some initial designs and attempts as well, if there are any<br /><br />PHASE II (80% of project mark)<br />- Need to give an 8-min presentation on your final product in around early-May<br />- Need to describe and explain your visualization design, and what findings can be derived from them. It would be good if these findings are interesting (to the professor and TAs).<br /><br />Things NOT to do:<br />- You better avoid using line graphs, bar charts, or any such kinds of simple visualizations; a quote from the professor: &quot;If I can use Excel to achieve these things, then why do I even take this course?&quot;<br />- You better not say anything like &quot;there is no particular finding&quot; from your visualizations; another quote from the professor: &quot;If there is no meaning, then what is the meaning of your visualization? Your visualization has no meaning as well!&quot;<br />- The above two quotes are comments that are given by the professor to some groups (poor guys...). You can tell the professor can be quite mean when you've &quot;got on his nerves&quot;. So you really don't do the above two things in your presentation!<br /><br />Things to do:<br />- If you think your visualization is complicated enough, present this complication clearly so that professor and TAs could give &quot;sufficient appreciation&quot; on this aspect. (A point made by the local TA)<br />- Usually each group would do at least 4 different kinds of visualizations in total. It would be good if you can integrate all these visualizations together as a system (e.g. a change on one visualization would automatically lead to changes reflected in other visualizations)<br />- Four criteria for grading the project: <br />1. The application of knowledge and skill from the course (e.g. have you violated some rules of thumb) <br />2. Sophistication (complication)<br />3. Findings (are they major? interesting?)<br />4. Presentation (yes.. a good presentation would also do you a favor)<br /><br />ROUGH STATS:<br />Final: mean ~69, sd ~14 (out of 100)<br />Project: min ~25, mean ~34-35, max ~45 (out of 50)<br /><br />Why do I say this course is good-good grade?<br />Although I am 1SD above mean in final, but final contributes less (30%) to the grading than the project (50%), and our group just got a mean score for the project. So I think I would definitely be in B range, or if there is a miracle, I might got an A-. But it is an A. A 4.0 GPA. I mean wtf. Totally unexpected, really.<br /><br />You just need COMP2011 to take this course?<br />For the project, no. Please no. C++ is not useful in this course. You should at least have some basic knowledge on HTML+CSS+JavaScript. If you are an expert in (or acquainted with) front-end web development, or data mining and AI techniques, that would be a great plus!<br /><br />Tools that might be useful for the project: PowerBI, R (ggplot2/ggvis), Python (Matplotlib, seaborn, ...), JavaScript (react/vue/angular/node), python web server, relational database (MySQL...), mapbox, ......<br />(So COMP1021 is more useful? Neither)<br /><br />But for the concepts part (or final exam), you really don't need any prerequisite (even for graph visualization). Because as I said, professor doesn't teach deeply, i.e. many technical parts are just skipped.<br /><br />Who should avoid taking this course?<br />People who extremely hate / are not good at presentation. There are 3 presentations throughout the course (two group presentations + one individual), held in late-March, late-April and early-May. This is somehow different from regular COMP courses.",
            "comment_workload": "Very light, compared to other courses. Three reasons:<br /><br />1. No attendance taken. <br />- In-class exercises and lab exercises need not be done right before the lesson ends. <br />- In-class exercises dead at 11.59pm the same day of the lecture<br />- lab exercises have around a week to finish<br />- So it is not a problem even when you never show up for the whole semester<br />- Plus it is not mandatory to do all of them<br /><br />2. No midterm.<br /><br />3. Workload of project is usually manageable<br />- Normally if your group is not aiming very high, the workload would be okay.<br />- Personally, the biggest challenge is to manage the workload of other courses so that you can have time doing the project of this course...<br /><br />So in some situations and sense, this course even has a lighter workload than 1000-level COMP course. But I do encourage you not to skip all the lectures and labs, because you might still need them for final and project.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 13,
            "vote_count": 17,
            "voted": false,
            "is_upvote": false,
            "comment_count": 13,
            "attachments": []
        },
        {
            "hash": "xHkS301c74i6kKxsCak9fsVjNNLmO5AM",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 805,
                    "name": "MA, Xiaojuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Icespirits",
            "date": "Dec 25, 2022",
            "title": "Bad Course Outline and even WORSE Workload",
            "comment_content": "這個課程本身相交的內容是一個相當有趣的概念，裏面教了很多關於圖像處理，分析數據及資料可視化的概念，在現在大數據盛行的情況下其實個人覺得應該會相當好用。<br /><br />可是這份教材本身已經沿用了好幾年沒變，而且裏面一些內容實在太雜，架構得不好，好幾名朋友都表示上完後不知道自己學了什麼，所以個人覺得沒有那麼實用。<br /><br />非常不建議最後一年的同學讀這個course，原因在workload那邊。<br /><br />Syllabus<br />Part 1: Fundamentals<br />Intro2Vis<br />HCI4Vis<br />Color and Perception<br />Perception<br />Color4Vis<br /><br />Part 2: Design Process<br />Visual Design Principles <br />Visual Channel <br />Visual Design Tasks <br />Visual Design Rules<br /><br />Part 3: Visualization Design\t<br />Visualization of Time Series Data <br />Visualization of Spatial Data (updated on Oct 9)<br />Visualization of Trajectory Data<br />Visual Analytics of Multi-Dimensional Data<br />Multivariate Data Visualization <br />Multi-Dimensional Data Visualization<br />Text Visualization<br />Graph Visualisation<br /><br />Part 4: Evaluation<br />Validation<br />Evaluation",
            "comment_teaching": "一樣覺得實在一般，前幾堂在說一些關於distortion的話題的時候大家都還有興趣，也說得還可以，到了後期基本上就是每天在念powerpoint，在背那些graph的名字，搞得像是在唸大慈大悲咒...到後期基本上沒有人在聽書，甚至乎可能看到大部分人都在玩手機、打麻雀之類的...<br /><br />說真的對比起鍾自己有幸去中大上過一兩次的圖像處理、裏面的上課方式以及互動其實好很多，而且整體course架構也比較差、不過在科大來說這應該己經算是中等水平了。",
            "comment_grading": "Grading Scheme:<br />In-Class Exercise and Participation (10%) <br />Lab Activities and Exercise (10%)<br />Top Vis Competition and Essay (10%)<br />Final project - Proposal (6%) <br />Final project - Final Presentation (15%) <br />Final project - Code Check + Demo Vid(3%) <br />Final project - Individual Essay (6%) <br />Midterm 1 (20%) <br />Midterm 2 (20%)<br /><br />Personal<br />In-Class Exercise and Participation 10/10&nbsp;&nbsp;most people get a full mark<br />Lab Activities and Exercise 10/10 most people get a full mark<br />Top Vis Competition and Essay - 10/10 as long as you speak you get a full mark<br />Final project - Proposal 5.4/6<br />Final project - Final Presentation 13.5/15<br />Final project - Code Check + Demo Vid 3/3<br />Final project - Individual Essay 6/6<br />Midterm 1 90.5/100, Mean: 73.32<br />Lower Quartile: 69, Median: 73.5, Upper Quartile: 80.5<br />Midterm 2 85/100, Mean: 74.55<br />Lower Quartile: 69, Median: 75.5, Upper Quartile: 82<br /><br />Final Grade A+<br />雖然拿了A+ ，但是對比其他course需要做的東西實在太多了，而且其實我也算是花了比較多時間在溫習，對比起其他一些course這個grade也沒有多好。<br />主要分數分水嶺會在project以及兩個midterm、兩midterm都不太難只要你肯花一兩天把內容背起來分數不會太差。",
            "comment_workload": "一個字，煩，三個字，極其煩<br />正常的課程要不寫essay要不做project要不考試，九成三選一最多三選二，他可好他全都要，讀作4 cred實際12 cred。<br />個人是final year student就更嚴重了，我11月還有四至五個interview，基本上全撞了，非常不建議最後一年的同學讀這個course。<br /><br />每天上完課基本都有一個in-class exercise，然後每個星期再有一個lab exercise，基本上每個星期就已經有三份功課，弄得好像我整個學期就讀他一個course一樣。<br /><br />這還沒完，上完沒幾堂就要我們上台present，最後發現只要有上台說話都是滿分，那你present什麼呢？？？就拿來浪費我們時間？<br /><br />然後兩個midterm塞在同一個月裏，相差不到兩星期，final project presentation還要跟第二個midterm撞在一起，我真的是從來沒有看過這麼離譜的課程設計。",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}