{
    "error": false,
    "course": {
        "id": 1637,
        "subject": "COMP",
        "code": "5711",
        "name": "Introduction to Advanced Algorithmic Techniques",
        "description": "This is an introductory graduate course in algorithmic techniques.  Topics include: advanced data structures; graph algorithms; amortization; approximation algorithms; on-line algorithms; randomized and probabilistic analysis.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.82,
        "rating_teaching": 5,
        "rating_grading": 4.55,
        "rating_workload": 3.82,
        "review_count": 11,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 115,
                "name": "YI, Ke",
                "count": 9
            },
            {
                "id": 1493,
                "name": "KAFSHDAR GOHARSHADY, Amir",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "p0o63Wi8IpUJrbIhIrVU7ilGos7vGCLU",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 115,
                    "name": "YI, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "E",
            "date": "Aug 21, 2018",
            "title": "Pretty Good Course",
            "comment_content": "The course covers a lot of content very rapidly. The content is super interesting if you find Algorithms interesting, but boring otherwise. Don't take this course if you struggled with COMP3711 or COMP2711. This course is essentially comp3711+comp2711 on steroids. <br /><br />The content covered is:<br /><br />1) Amortized analysis, including explaining Fibonacci heaps (After he explains Fibonacci heaps, the only thought you'll have will be how the fuck did anyone come up with this shit?)<br /><br />2) Fixed-parameter algorithms. Essentially, we know NP hard problems are difficult to solve in general efficiently. Now, let's set that aside. Can we solve an NP hard problem is &quot;moderately&quot; okay time? This section will cover reducing the run time of algorithms from something ridiculous like O(2^n) where n&lt;=1000 (essentially taking more than the age of the universe to terminate), to O(2^k n^2) where k&lt;=4 which takes around 2-3 seconds to run. In other words, parametrize the&nbsp;&nbsp;solution of the problem on some other variable that is not big to make it feasible.<br /><br />3) Approximation algorithms (This shit's hardcore). One of the harder sections, algorithms which deal with approximating solution to NP hard problems where there is a guarantee on your approximation (e.g: at most 2 times the minimum value). Pretty cool shit, but needs lots of exercise. <br /><br />4) Local search: Not that hard tbh, a bit boring. <br /><br />5) Randomized algorithms: This shit is hard, plain and simple. Probability + Algorithms on steroids. Honestly, pick up a randomized algorithms book from the library and solve many questions. The final will have a shit ton of questions on Randomized algos, so you better solve this shit real well.<br /><br />6) Streaming algorithms and Parallel/distributed algorithms: Pretty simple. Just explains the basics.",
            "comment_teaching": "Yi Ke is a pretty cool professor. He explains very clearly, and his English is pretty good. However, don't ask him super dumb questions, he'll look visibly annoyed :'D (but still answer you)",
            "comment_grading": "Midterms and Finals are deadly. Also, 4 Assignments. <br /><br />Assignments: 10% (Virtually everyone gets ~10%)<br />Mid: 30%<br />Final: 60%<br /><br />Me:<br /><br />Assignment 1: 98/100 (Mean 94)<br />Assignment 2:100/100 (Mean 97.5)<br />Assignment 3: 90/100 (Mean 93.8)<br />Assignment 4: 100/100 (Mean 99.6)<br /><br />Midterm Exam: 90/100 (Mean 62.4)<br />Final: 73/100 (Fucked up the last question, correct idea, but computation is entirely wrong). (Mean 60.4)<br /><br />Overall Total: 80.5% ==&gt; A<br /><br />A range (A-/A/A+) is pretty easy. Yi Ke told me he gives 40% A range, 40% B range, and 20% below. <br /><br />Note: Be extremely careful in the exam. Yi Ke is a really strict grader. Don't waste your time in the final writing any bullshit in a problem hoping for 1-2 marks extra, you're either getting full marks or 0. He'll only give 1-2 marks extra if your **idea** is correct, but you did a mistake in computation or in the middle, and that's still only 1/2 marks /20!!! Focus on completing problems fully than just half assing some problems. <br /><br />I think only 2-3 A+ where given.",
            "comment_workload": "Heavy workload in hard assignments + you gotta solve lots of extra outside questions to keep up with the deadly exams.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 12,
            "vote_count": 14,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cu1AKmPgRMBrqs32LI8bOHTUFwYTuJ6c",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1493,
                    "name": "KAFSHDAR GOHARSHADY, Amir",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Azrael",
            "date": "Dec 21, 2022",
            "title": "Challenging but Enjoyable",
            "comment_content": "The course is divided into 4 main parts.<br />[*] are the important topics covered in HW or Final.<br />[**] are some advanced topics that might be quite confusing when learning for the first time.<br /><br />Part 1: Amortized Analysis<br />- Basic Amortization Methods and Examples<br />- [*] Splay Trees<br />- Union Find, Kruskal's Algo<br />- [*] Binary Heaps, Binomial Heaps, Fibonacci Heaps<br /><br />Part 2: Randomized Algorithms<br />- Basic Examples: Quick Sort, Min-Cut, Quick Select<br />- More Involved Examples: Lazy Select, Max-3-SAT<br />- Randomized Data Structures: Treap, Randomized Skip Lists<br />- [*] Randomized Complexity Classes<br />- Game Theoretic Techniques (Yao's Technique) with the AND-OR Tree example<br />- [*] Markov's and Chebyshev's Inequalities and Chernoff Bounds with Examples<br />- [*] The Probabilistic Method with Examples: Max-3-SAT, Max-Cut, Min Dominating Set, Ramsey Number<br />- [**] Fast Algorithm for All-Pairs Shortest Paths in Unweighted Graphs using Randomized Techniques<br /><br />Part 3: Parameterized Algorithms<br />- Intro to Parameterized Algos, XP, FPT<br />- Branching: Vertex Cover, Closest String<br />- [*] Kernelization: Vertex Cover, Feedback Vertex Set, Feedback Edge Set, Clique Cover<br />- Color Coding: Longest Path, Sparse Subgraphs, (Q,K)-Cut, <br />- Iterative Compression: Vertex Cover, Feedback Vertex Set<br />- [*] Intro to Treewidth/Pathwidth: Tree Decomposition, Boundary Graphs<br />- [*] Examples with Treewidth/Pathwidth as Parameters: Maximum Independent Set, 3-Colorability, Hitting Problem, Constrained Knapsack<br />- [**] Polynomial Identity Testing &amp; Perfect Bipartite Matching<br />- Randomization in Parameterized Algos: Randomized Feedback Vertex Set<br /><br />Part 4: Approximation Algorithms<br />- Intro to Approx Algos, PTAS, FPTAS<br />- [*] Basic Greedy Approx: Vertex Cover, Set Cover<br />- [*] More Involved Greedy Approx: Register Allocation, Greedy Knapsack, Bin Packing, PTAS for Bin Packing, Makespan Minimization<br />- Approx with Linear Programming: Vertex Cover, Set Cover, Metric Store Location Problem<br />- [**] Approx Counting: 3-SAT Counting, DNF Counting, Perfect Bipartite Matchings Counting",
            "comment_teaching": "This is the first semester for Amir to teach this course. The contents he scheduled are a bit too much for a semester, so the pace is quite fast and requires constant review of course materials or reading/watching extra materials.<br />It is not easy to keep up with his pace of teaching in class, but if you rewatch the recordings after class, you'll find that Amir actually explains most of the contents quite clearly, and all you need is some more time to think about them.<br />All video recordings of this semester are published on Amir's Youtube channel, and you may have a preview of them before enrolling in this course. Although only about 10 students attend each f2f lecture after add-drop, I recommend both attending the f2f lectures and rewatching the recordings afterward.",
            "comment_grading": "Grading Scheme: HW 4x10% + Final 60%<br /><br />Statistics (Mean/Median/UpperQuantile/FullMark):<br />HW1 - 6.15/7/9/10<br />HW2 - 5.27/5/8/10<br />HW3&amp;4 - 12.92/16.5/19/20<br />Final - 37.3/39/50.5/60<br />Me: full marks in all homework, 58/60 in final ---&gt; A+<br /><br />This course uses absolute grading, but I don't know about the final scheme. The grading is probably pretty good considering that this is a PG course. I'm rating a B for this because I'm not very sure about the exact scheme.<br /><br />For UG students interested in theoretical CS, the course might be somewhat challenging, but please believe in yourself and try your best",
            "comment_workload": "You might need to spend quite some time reviewing course materials and reading/watching extra materials on your own after class, this is part of the workload of this class.<br />Four (actually three since HW3&amp;4 are published together) homework. For each homework, 10~14 days are given for the first submission, and you may resubmit some problems within 7 days after receiving the feedback.<br />Some of the homework problems are quite hard and might require some further research on the topic. The hints given only point out the direction that you should think about. The second homework, involving graph theories related to tree decomposition, is the hardest one. This is because the class only covered how to use treewidth as a parameter, but not the related graph theory knowledge.<br />Homework is required to submit as a pdf generated by LaTeX, which makes the workload heavier. It takes me 3~5 days for each homework.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fcxpPcFxQFQAkqTcOOtQr3XnaNTerhLk",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 115,
                    "name": "YI, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Zaher",
            "date": "Jan 04, 2022",
            "title": "Great course if you like algorithms; lots of interesting ideas",
            "comment_content": "Most of the topics are quite standard for an advanced algorithm course. Randomized algorithms and probability are major themes of the course, they appeared in all topics following the randomized algorithms unite. The topics are very broad, so the course doesn't go too deep into them (but deep enough to fully understand the content).<br /><br />The topics are:<br />- Parameterized algorithms.<br />- Amortized analysis.<br />- Randomized algorithms.<br />- Hashing.<br />- Tail inequalities and random sampling.<br />- Online algorithms. <br />- Streaming algorithms.<br />- Parallel/distributed algorithms.",
            "comment_teaching": "The teaching was great! Although the topics are quite challenging, the instructor is very good at explaining and simplifying things.",
            "comment_grading": "I think the grading was nice and friendly. There were 4 homework (10%), a midterm (30%), and a final exam (60%). I didn't like putting too much weight on the midterm and final exams. The mean for homeworks was high, but for the midterm it was 52%, and for the final it was 65%. However, if you pass 50% then you'll most likely get a passing grade.<br /><br />The homework questions are usually variations of something taught in the lecture, and the exams are usually variations of something taught in lecture or given in homework. The exams this year were actually much more friendly than previous years, in the final is was around 10 (mostly) direct questions rather than 4-5 more challenging questions.<br /><br />Perhaps it is helpful to mention that the aim of the course is to be able to proficiently use the tools taught to solve problems. So most of the questions (either in homework or exams) just require you to use these tools in a very similar manner (as in lectures/homework) but within a different problem (or a variation of a previously-studied problem) - so the questions don't get very creative.",
            "comment_workload": "The workload was not much. There are 2 lectures every week, and the slides are quite self-contained. The homework questions do not take much time if you understand the lectures. However, if you're aiming to get an A/A+, then you'll probably need to spend more time maybe reading the suggested readings or solving problems to get more practice.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RxUsAIO1a5tqro9Z9FMIbRp2eVhSITsJ",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 115,
                    "name": "YI, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ruozhilaji",
            "date": "Dec 12, 2021",
            "title": "Great Course on Some Modern Things",
            "comment_content": "FPT, Amortized Analysis, Randomized Algorithms and some basic concentration bounds, hashing, online algorithms, basic streaming algorithms, parallel algorithms.<br /><br />This course emphasizes a lot on probabilistic, which is also one main style of today's research.",
            "comment_teaching": "Prof. YI teaches quite well, but I think he spent too much time on some easy inequalities. When he discussed parallel algorithms, the explanation is also a little bit confusing for me, but I guess it is because this area is not well developed and he can not talk too much about computation models since not too many people in the class has some prior knowledge.",
            "comment_grading": "Midterm Mean: 52<br />Final Mean: 65<br /><br />I do not receive the grade, but I think it should be fine. For Ph.D. students, getting 50% in total is guaranteed a Pass grade. And this year's final is much easier than the previous ones. For UG students, the final is quite a MATH2421-level probability exam, which is not too difficult and focuses on computation. There are also lots of easy questions in both midterm and final.",
            "comment_workload": "The workload is not that heavy and I think you even do not need to review too much before the exams since the exams are open-book and not that related to homework, past papers, and lecture notes. Although there are some questions which you can find answers to from the notes.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fUStNzFvzBe2gXvVRqtDnI9fKgvT6n9A",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 115,
                    "name": "YI, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Dipsy",
            "date": "Jan 03, 2020",
            "title": "",
            "comment_content": "Amortized analysis<br />Fixed parameter algorithm <br />Randomized algorithm<br />Hashing<br />Tails inequality <br />Online algorithm <br />Streaming algorithm <br />Parallel algorithm<br /><br /><br />Starting from hashing I just can't understand everything, I am just too stupid to understand, although I got A in COMP3711H<br /><br />Tbh the content really worth learning but I am too stupid 😭",
            "comment_teaching": "He is explaining well and clearly and better English than me.<br />Lecture video is provided",
            "comment_grading": "Mid term mean 29/100, me 15/100<br />Final exam changed to a term paper<br />Mean 90/100 me 80/100<br />4 assignments everyone just score high<br />Me always below mean still B+, so good grade (it's because prof see everyone did so bad in mid term so he promise if get 50+ in final he just give at least B+, even later it is changed to a term paper",
            "comment_workload": "Just 4 assignments<br />I didn't study for exams since idk how to do it anyway(?<br />The past paper just fake 9 me as they are way more easy than the real one (?",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "z1mFhWvmUNrlkAzlr36uh0aPyLVLid3w",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 115,
                    "name": "YI, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "柒",
            "date": "Aug 24, 2022",
            "title": "Good Course",
            "comment_content": "Algorithms with rigorous theoretical analysis. Especially random algorithms. Very informative.",
            "comment_teaching": "the proving process is done one step by one step on the whiteboard. And you can also ask questions during class or after class. There is also office hours for asking questions.&nbsp;&nbsp;The professor is good at algorithm theories, and very patient.",
            "comment_grading": "Exams are not easy. But are open-book and open-notes, you can take any material you need during exams.",
            "comment_workload": "Have 3 or 4 homeworks. A midterm exam and a final exam. Some questions in homework are not very easy, you can discuss with your classmates.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iUMNfZB1vyfn4eiPwWh1189JhaFQn6ZB",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 115,
                    "name": "YI, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "伽马星人",
            "date": "Jan 25, 2022",
            "title": "",
            "comment_content": "This course includes several interesting topics in algorithmic techniques. Although each topic only introduces some basic content, it's still very difficult and technical. As long as you master the skills, you can still solve the problem easily without understanding the reasons. COMP 5711 can be regarded as one of the most difficult courses in CSE department.",
            "comment_teaching": "Prof. YI has excellent teaching skills. Even if the content is difficult, he can let the students understand through vivid PPT and examples. In addition to the teaching content itself, Prof. YI is also very humorous, which is the type of teaching I like.",
            "comment_grading": "Although the exams of this course are very difficult, you can get B+ with only a score of 50 totally. Also, questions are graded by process, sometimes even if you don't know how to solve the problem, you can get half of the marks by digitizing the question.",
            "comment_workload": "The workload isn't too high. We totally have 4 written assignments and each of them has only 4-5 questions. Since homework only accounts for 10% of the total mark, it just allows us to feel the format of the exam without spending too much time.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "47iDadEj3GXCHbXbAl5fjNVXXxhtGkfd",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 115,
                    "name": "YI, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Reza",
            "date": "Nov 12, 2018",
            "title": "COMP 5711",
            "comment_content": "The course is really demanding for those who still struggle in COMP3711. However, it is a very fun course for those who love Algorithmic topics.",
            "comment_teaching": "The teaching quality is excellent. Yi Ke is one of the best professors I have ever seen in my study life!",
            "comment_grading": "If you manage to get more than 50% of all grades, you will survive to get a B+. Thus, Ph.D. students have a chance to pass the course.",
            "comment_workload": "Only 4 series of homework questions were given, but the course itself demands a lot of more practices.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nfBZ4OWVVdPG0FN6RmXfe9JljUjkUrdA",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 115,
                    "name": "YI, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "w_w_w",
            "date": "Oct 29, 2020",
            "title": "short summary",
            "comment_content": "Syllabus and Notes<br />Introduction. <br />Amortized analysis.<br />Parameterized algorithms <br />Randomized algorithms.<br />Hashing. <br />Tail inequalities and random sampling. <br />Online algorithms. <br />Streaming algorithms.<br />Parallel/distributed algorithms.",
            "comment_teaching": "the content is difficult, but the instructor illustrates in a comprehensive way.<br />A lot of examples are given in the course.",
            "comment_grading": "hw and exams are difficult, but the grading is ok.<br />hw: mean=90% marks<br />exam: mean=29/100<br />at least 50% of students get B+",
            "comment_workload": "a bit heavy. I spend approx 2 days for each homework, and 1 week to prepare the exam.<br />For the hw, there are answers on Google<br />for the exam, some questions are adapted from previous exams, hw, or exercises in the class",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YnwelvyKmmZxmKu6OUmtZES3ORzrAah5",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 115,
                    "name": "YI, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wwcd",
            "date": "Jan 16, 2020",
            "title": "Useful, but rather difficult course",
            "comment_content": "The course explores the following areas: <br />Fixed-parameter algorithms<br />Approximation algorithms<br />Local search<br />Amortized analysis<br />Randomized algorithms<br />Streaming algorithms<br />External-memory algorithms<br />Parallel and distributed algorithms",
            "comment_teaching": "The instructor presents the content in a very comprehensive way. He is willing to go into detail on every aspect of the course, and is very supportive of studets' in-class questions.",
            "comment_grading": "The course is very demanding and can be ambiguous some times considering solutions, but the grading felt consistent and fair.",
            "comment_workload": "Assignments + Midterm + Final<br /><br />A lot of work but it is worth it.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6kcK3Yn1stZYNUBdUlBuncmhivb4Owxs",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1493,
                    "name": "KAFSHDAR GOHARSHADY, Amir",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Togzhan",
            "date": "Oct 15, 2022",
            "title": "",
            "comment_content": "The course focuses on theoretical aspect of algorithms and presents a lot of useful information. It was interesting to learn new techniques as it was directly related to my research.",
            "comment_teaching": "Instructor gives a great explanation and writes everything on a white dashboard. Also, the lectures are recorded, which is good, because you can rewatch them. We have lecture notes too.",
            "comment_grading": "Not sure about it, because we haven't done any exams yet.",
            "comment_workload": "I would say that the content can be a bit heavy for a person without algorithmic background, so a lot of self-study will be necessary.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}