{
    "error": false,
    "course": {
        "id": 240,
        "subject": "COMP",
        "code": "4441",
        "name": "Computer Music",
        "description": "This experiential project-oriented music and video technology course will provide hands-on experiences in creating music videos and movie/game trailers by\ncreatively remixing music, recutting video, and applying effects such as time and frequency distortion, time warping, reverse, filtering, and phasing. Students will create music remixes, music/video/actor mashups, and plot twists in their music video storytelling. It will give students a chance to work with emerging video technologies such as deepfakes. Whether students have music or video background or not, this course will provide them a chance to create like a sound designer and director. For each of their music video creations, students will also create a behind-the-scenes commentary video that describes what they did and how they did it. They will share their creations and commentaries in class, and learn from and be inspired by one another.",
        "categories": [],
        "website": "https://course.cse.ust.hk/comp4441/",
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2030,
            1930,
            1830,
            1730,
            1630,
            1530,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"2011\" href=\"/review/COMP2011\" target=\"_blank\">COMP 2011</a> OR <a class=\"course-link\" data-subject=\"COMP\" data-code=\"2012\" href=\"/review/COMP2012\" target=\"_blank\">COMP 2012</a> OR <a class=\"course-link\" data-subject=\"COMP\" data-code=\"2012H\" href=\"/review/COMP2012H\" target=\"_blank\">COMP 2012H</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.63,
        "rating_teaching": 4.5,
        "rating_grading": 4.5,
        "rating_workload": 4.44,
        "review_count": 16,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 126,
                "name": "HORNER, Andrew Brian",
                "count": 13
            },
            {
                "id": 1636,
                "name": "HORNER, Andrew",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "RcDdNuwdk9ieWaiMwUjfK3A2PjwXUCqd",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 126,
                    "name": "HORNER, Andrew Brian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Alanx",
            "date": "Jun 02, 2021",
            "title": "Think twice if you don’t know music",
            "comment_content": "The content is very interesting, basically about music remixing and video cutting. I am not sure if you will still use the applications after the course. It does not require any prior knowledge in music but you will be FUCKED UP if you really do not have any music knowledge. <br /><br />Let’s talk about the first assignment, it is just mixing music, adding sound effect to a video trailer. Sounds fun and relaxing right? Indeed it was, but your grade will be horrible&nbsp;&nbsp;afterwards if you do not put efforts in modifying the pitch, chord, bpm, etc. Well I know nothing about music but I felt my work was at least medium in terms of the way I cut the narrative, music and video to tell a totally new story but you know what this is a computer music course,&nbsp;&nbsp;not a computer video or computer story course. What you need is MUSIC. I didn’t realize that early enough before the end of the add drop period. <br /><br />If you know nothing about MUSIC, I will say congratulations! Have fun in the course.",
            "comment_teaching": "There is literally nothing taught during lessons but just appreciating the excellent from previous students, and watching and rating your peer’s work. The tutorials will teach some application and techniques for music remixing and video cutting like audacity, band lab, davinci resolve, etc.",
            "comment_grading": "I know nothing about how the works were graded but if you failed to deliver an amazing music, good luck with your grades. Sometimes you will see the professor praised something in your work but you ended up getting shitty grades, sometimes the professor said nothing and just skipped to the next video after playing yours but you ended up getting not too bad grade. <br /><br />I never got above mean and was for most of the time just slightly below the mean. While I am typing the comment, the project score is just released. 4/5 with mean 4.2/5 and the project counted for 40% of the course grade. My teammate and I really put effort and tried hard to improve the music and do the video cutting but anyway. Who the hell knows how the work was graded. <br /><br />I won’t say it is a good grade course, at most a very normal cs course grading. Don’t come to the course if you are not TALENTED IN MUSIC. There are lots more 4000-level good grade cs course out there. My intention to write the comment is NOT to tell how bad the course it is, but to make you think twice before taking the course especially if you don’t know anything about music as there will be no theory taught in the course telling you which music is good and which is bad to give you an idea about how to do your assignment better. And don’t be influenced by the other comments though I know there are indeed many crazy people like even DJ taking the course but still, the grading for students with no music background is not good in my opinion or maybe just I am not suitable for the course.<br /><br />I thought I would be graduating without a letter C on my transcript. Thank you COMP4441 for helping me to add more diversity in the grades I got. Thank you for almost dragging me down from the 1st class honor cut off.",
            "comment_workload": "Workload is fine because there is not too many things to learn but just 3 assignments and 1 final project though you need to spend days for each assignments (well depends on how you are talented in music but I am shitty on that so).",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 11,
            "vote_count": 14,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "92ngZKTSsRPj4HQCETzZLYZhIxm9vUKN",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 126,
                    "name": "HORNER, Andrew Brian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Endrave",
            "date": "Jun 20, 2020",
            "title": "FREEEEEDOM ! Absolutely fun course to play with",
            "comment_content": "Do whatever you want, Just put your favorite game , anime ,music into your work to show you passion.&nbsp;&nbsp;<br /><br />To be honest, this course is pure experimental learning course. There is nothing to teach. 99% are based on self-learning. <br /><br />If you expecting actual music theory, here is not the place, here is more like a intro video edit and music composition course which teach you about the WOW factor.<br /><br />There are manly 5 assignment.<br />1. Game Trailer mashup<br />2. Reversing video<br />3. Punk /Jazz / (i dun understand music anyway)<br />4. Romantic story<br />5. Final Battle<br /><br />So no background is required, no programming is needed in general (unless you need). But skill in video and audio edit will be advantage. Also if you can make your own art, it will be a super advantage.",
            "comment_teaching": "There are only 2 parts of learning in the course.<br />1. TA may teach you about some trick on Audacity and some online music making tools. (many dun understand at the end, just take it easy)<br />2. looking at others work (you can learn about how others compose their piece by looking at their&nbsp;&nbsp;director commentary) <br /><br />Yet , the TA are super qualify for their work.",
            "comment_grading": "Absolute grading,the grading system is based on roughly 60~70% given by professor/ TA based on your effort (It is extremely important to make good director commentary, it is even more important than your work, some even make ppt for it, If you work is not impressive but it shown you did put a lot of time on it you should still in 4 range). <br />Whereas the rest of the percentage are from other students in the course rank by canvas quiz, so dun just try to impress the prof , but use theme that will get everyone (Note, TA and prof are Otaku too ~)<br /><br />I got A+, technically the full mark for each is 5<br />I got , 4.4,4.1,4.6,3.8,5 respectively.<br />This is a relative low mark compare with others, (some say their works never get below 4.5 UwU)<br /><br />Tips, use some old material that will let other rmb their childhood, like old meme/ anime song.(e.g.一万年と二千年前から阿姨洗铁路~, Bad apple these works). Ah also in my semester JOJO reference and Kamen Rider everywhere",
            "comment_workload": "It depends on your effort, basically each assignment is a 2 week project. Some like to solo it, some like team up in 2. I was in a team of 2 , still each work spent us 1 week.<br /><br />If you are fast editor and have great idea in mind then maybe a day can complete a video already, which is not my case. Normal video editing are very common and will be boring. Best approach is try to include some feature thats other is hard to replicate.<br />For example super heavy video editing (Meme level), meme looping (brain wash level ,), original animation (Yes, artist will have advantage,手書, MikuMikuDance).<br /><br />Your work will not rank low if you did something unique. But yet it is time consuming, think about you need to learn After Effect, Premiere Pro, MMD, 3D modeling in a week in order to out win others. Trust me it worth it. Also imagine when the professor show MMD to department, it is a kind of achievement.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0UMoy05gGlHBaO9WZoYpCikLT0TvXz8i",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 126,
                    "name": "HORNER, Andrew Brian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "youth222",
            "date": "May 31, 2022",
            "title": "Best course in ust",
            "comment_content": "Throughout the semester, you need to submit 3 assignments and 1 final project.<br />For the video, you need to submit the commentaries as well, try to make it as detailed as possible. <br />for the 3 assignments (10,15,20%): video within 1-2 min<br />final project (45%): video within 2-3 min<br />Peer evaluation and research rating (10%): no difficulty <br /><br /><br /><br />You can use any software you like.",
            "comment_teaching": "He is the best professor I have met in ust. Super encouraging and kind ^^ He will appreciate your work after you submit your assignments.<br />He is very knowledgeable in music.",
            "comment_grading": "I agree with the review below: Don't take this course for grading. <br /><br />I think he tries to be lenient in grading, but unfortunately, the grading scheme in HKUST doesn't allow him to do so.<br />It is easy to get B range, but not A range.<br /><br />For all assignments, the mean is 4.2<br />I got 4.4, 4.4, 4.28 in the 3 assignments, and the score of the final project was 4.47 --&gt; B+<br />A bit disappointing but the grade is nice compared to other comp courses, but at least I have enjoyed the course !!!! ^^",
            "comment_workload": "Super light. <br /><br />My background:<br />I have no video and audio editing experience before.<br />20-year experience on an instrument + performance diploma <br /><br />I spend about 10hours on each assignment on average.<br />I use iMovie and audacity / bandlab. <br />iMovie's features are not as functional as Da Vinci resolve and Adobe premiere pro, but it is super user-friendly. <br />I am not a creative person so it is difficult for me to create something memorable or special. I put more effort into modifying the music. <br />Despite being a &quot;computer music&quot; course, I think having different visual effects on the videos is more important than tuneful music. ( I think I can get A range if the marking scheme emphasizes the music part more )<br /><br />Conclusion: no music background is required to take this course",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "W2S5tAwUH8dGTIq8WvQBEeatUTr41FxT",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 126,
                    "name": "HORNER, Andrew Brian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wendingp",
            "date": "Mar 05, 2018",
            "title": "",
            "comment_content": "Interesting course, not too much difficult technical stuff about music for a non-music background. But basically listening to assignment audios in the class. Project-based course. Provide students with hands-on experiences in creating music and soundtracks with a wide range of emotional characteristics for a variety of situations in computer games and videos.",
            "comment_teaching": "The professor is very enthusiastic and knowledgeable about music.",
            "comment_grading": "9 Mission Impossible Assignments (50%), Project-Presentation (50%),&nbsp;&nbsp;+Bonus(Inspiring Assignment Work, Insightful Participation, Lecture Attendance)<br /><br /> Audit the course so I don't know or care much about the grading...",
            "comment_workload": "One assignment every week but easy to do: &quot;You will share your musical creations and learn from one another, allowing you to dive in and create music that modulates the moods of listeners.&quot;",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wMNHa5gwVYkuvZT4W3NDAKmK1jbPLoeG",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 126,
                    "name": "HORNER, Andrew Brian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "erict",
            "date": "Jun 09, 2021",
            "title": "The course and the people in the course are weird",
            "comment_content": "You watch videos; you make videos, and that's it. Should you try harder? Yes, this is one of the most rewarding class to try hard on since it is all about your own creations. Do you need to try hard? No, just make sure that you enjoy working on the videos. <br /><br />If you are interested, you can Google for COMP 1943 and COMP 4441 to get a feel for the course by looking at some previous work (some people uploaded their work online).<br /><br />Grading scheme and Assignment topics, may be very similar to later semesters:<br />10%: Peer &amp; research ratings<br />10%: A1. Mashup Trailer, Try think of some wacky video + music combination.<br />15%: A2. Anime Music Video. If you have good music taste, you can do well by simply syncing your video to the music/lyrics. <br />20%: A3. Romantic theme. Well, I do pretty bad here due to a tacit problem.<br />45%: A4/Final project. Deepfake MV, yes, you need to use deepfake to do it. You just need to run the completed google colab notebook available online.<br /><br />The real content quality depends on your fellow classmates. I say it was generally good in this semester, but personally I would say quite a lot of the creations are unnecessarily long.<br /><br />Almost the same the same experience as comp1943, so you can also refer to those review.",
            "comment_teaching": "The professor and TA give you some nice and encouraging words for your submissions. They are friendly people that you can casually chit chat with them in the zoom chatroom. I personally did not ask for any suggestion so I wouldn't comment on their real teaching quality.<br /><br />Well, the real instructor for this course is actually google and yourself, and the amount of things you learn depends on yourself.<br /><br />Basic audio engineering and video effect are not difficult (but can be time consuming) and you can follow tutorial on Youtube to do those. A difficulty is that you need to first come up with using those techniques in the first place. You probably need to consume a lot of Youtube content and remember the cool things about the videos that you have watched.<br /><br />Well, if you insist to take the course even though you are not particularly interested, you can try making random meme videos to get by. You can do well enough (&gt;=mean) in this course by trying to make your work intentionally bad and broken since your fellow classmates and the instructor/TAs are weird people.",
            "comment_grading": "Do not take this course for the grading, there are some even better options for you. (Like COMP4631, 30% A range + only 8% C range, lowest is C+, basically 0 workload)<br /><br />Let me give you some idea on score numbers since no one has mentioned it. In original wordings,<br />3: base mark, granted by submission<br />3.5: somewhat inspiring<br />4: inspiring<br />4.5: very inspiring<br />5: super inspiring<br /><br />So, you can imagine that the difficulty to get higher score is growing exponentially. From my friends and my own experience in comp1943 (last sem) and comp4441, Below are what the score actually means:<br /><br />3 - 3.5 means your work is not even understandable. (people are giving you some bonus score purely for sympathy)<br /><br />4 means your work is not interesting. In truth, it means you basically get the lowest score.<br /><br />4.2-4.3 means your work is average. B to B+<br /><br />4.5 means your work is pretty good. An weighted average of 4.5 should be an A- already, given that you complete all the other things.<br /><br />Beyond 4.5 is A to A+ territory. Say averaging at 4.6 can already be an A+.<br /><br />The highest score each time is around 4.9/5, and it sometimes even goes beyond 5/5 lol.",
            "comment_workload": "4 assignments + their commentary video/direct cut, peer review on each assignment, attend an survey for their research. Not a meaningful number but I had spent 3-15 working hours on each assignment (solo).<br /><br />YOU NEED TO SUBMIT YOUR FIRST ASSIGNMENT BEFORE THE END OF ADD DROP PERIOD. This is probably good for you to know if you are really interested in doing this course.<br /><br />I would say attendance is required since you need to rate your fellow classmates' work reasonably. They said that they would check if you were spamming. <br /><br />You should treat everything they said to be optional as requirement. They have a list of optional things in assignment description, you better do at least 1 of them if you can't think of anything special on your own.<br /><br />As mentioned in other reviews, music knowledge is really nice to have, but In truth, I have not learned or tried anything meaningful about music for the assignments. And my video editing skill is pretty load even at the end.<br /><br />Suggestions for average people to get above mean:<br />- Do not go beyond the 1-2 min time limit for each video if you are not very good.<br />- Do try to sync your video in your music as often as possible.<br />- Do add sound effects (adding sound and/or editing them) and video effects.<br />- If you want higher score, example trick: find a midi version of the music, and add other instrument layering on where you want to emphasize (playing the exact same note as provided in the midi file) and see how it sounds. It will sound good 80% of the time. <br />- Lastly, do try to come up some new idea on your own. It does not need to be good, just sharing it in your video will improve your grade significantly.<br /><br />The previous examples shown in class often show inspiring ideas, and quite a lot of them do not demonstrate any special skills in video editing and music. So, maybe creative idea is more important? I can't say.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dTBY4iwJ6P0JuEf2JwGjoFZxGZQSDXrf",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 126,
                    "name": "HORNER, Andrew Brian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "girl",
            "date": "Aug 29, 2020",
            "title": "Amazing professor, most creative class i took in ust",
            "comment_content": "I took this class online and I love it you literally can get your creativity out as a destress and get good grades while suffering for other boring courses and get bad grades. If you're a creative person and like to edit videos this should be easy for you!! I definitely recommend you to take this class. There's another class that's literally the exact same Comp1943 you should take that too<br /><br />For Comp4441:<br />You have to do 4 'Mission Impossible' Assignments (MIA) 60% of your grade (each 15%) where they give you four themes and you have to produce a video with sound editing and video syncing. <br /><br />MIA 1: Wow Mashup trailer - basically remake a movie trailer and make it look legit<br />MIA 2: Going back to the start - basically incorporating the element of 'reverse' in your assignment<br />MIA3: I like to move it move it mashup remix <br />MIA 4: 1000 years romance remix - love song/sad ballad remixes<br /><br />And for the MIA 5 Final project is 40% of your grade so you better use lots of time doing this.<br /><br />MIA 5 (FINAL PROJECT): Final fight mashup /your own choosing project but you will have to get approval from prof and TAs<br /><br />Each of these you have to provide the 'commentary' which is literally you make another video letting them know how you made this final product and show them at each point in the video what did you do in regards to video editing or sound mixing.<br /><br />All these assignments will be showned in class and everyone will have to do this peer evaluation because it counts towards 10% of your final grade... WHICH i have no idea how that works because that will be 110% but this was on the syllabus so you should do the peer evaluation it's just a canvas quiz that you can do anytime before the due date.",
            "comment_teaching": "In the lectures, they don't teach you anything it's just showing past examples of these MIAs and showing the student's MIAs so that people can do the peer evaluation.<br /><br />They have tutorials to teach you some skillsets but I never attended because I already know what I can do and can not do and I work around it on my video final products. <br /><br />If you don't know anything about video editing and sound mixing you should take those tutorials by TAs they have different topics every week like removing vocals of a song and leave the background audio.. cutting videos with the apps they recommend etc.",
            "comment_grading": "For all these I got MIAs I got around 4.27-4.6 out of 5. <br /><br />I have no idea how they grade it but I know that they have like 3-4 TAs and the Prof where each of them looks for different things in your product. Some look for good syncing in video recording, some look at your effort put into producing the final product, some look for coolness in sound mixing, some look for overall 'WOW-ness' in creativity and process of producing the final project. The peer evaluation by everyone in the class also counts towards your grade of the MIA. So It's very subjective and they don't tell you how they came to the grade.<br /><br />but yes I got A in the end! I could've put more effort into it but with minimal effort an A is already very good to me",
            "comment_workload": "The workload was fine for me. It's all projects and the peer evaluation so I'm not ticking the quiz box because it's not really a quiz..<br /><br /> They give you a week and a half for each assignment and I used one to two days to brainstorming the storyboard of the video and find audios and mix them and match it up to the video and cut it!<br /><br />Depending on whether you're skilled in video editing and sound mixing... To me, it was pretty easy and I just used any apps I can download off the internet. <br /><br />They don't provide paid video editing/sound mixing apps for you it's pure just what you can download off google.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QE0vVB3Dez7prYA9rb2l0GuhyxKz4Cup",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 126,
                    "name": "HORNER, Andrew Brian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gossipgirl",
            "date": "Jun 02, 2018",
            "title": "Do yourself a favour and take this course",
            "comment_content": "Very interesting way to teach the course. Every week, we submit 1 assignment (1-2 mins) of audio/video based on a theme set by Professor. He discusses the theme briefly and shows us&nbsp;&nbsp;few examples in class for inspiration. Themes range from romance, horror, reverb, spooky, alien, etc. A dream course for people with creative minds and/or a musical background.",
            "comment_teaching": "Hands down, the best, most creative, most approachable and interesting professor in the department. He makes a lot of effort to discuss examples and is very open to students' interpretation of the assignments. <br /><br />Being an experiential based course, there are no lecture slides and no typical lectures. <br /><br />I learnt an amazing set of skills from this course.",
            "comment_grading": "50% weekly assignments + 50% final project.<br /><br />Final project is very similar to weekly assignments except he expects a higher quality of work and we have to present to the class and discuss our approach. <br /><br />Final project score is not released. If you love the course, A range should not be a problem.",
            "comment_workload": "Continuous but light-ish workload. <br />Doing well in assignments does require a bit of work but its great once you develop (or already have) an interest in the work.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "g9onjkvhI35JpgZ1PEJ60B0sLW7LJ8Zo",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1636,
                    "name": "HORNER, Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ppowoe",
            "date": "Jun 05, 2023",
            "title": "Literally a video editing course with focus on music",
            "comment_content": "4 video projects, with 1 main video and 1 video describing your video, so total 8 videos. Each video 1-2 minutes long, the last one can go longer to 3 minutes. Although many people go beyond the time limit, which is allowed, it's better to make it shorter, as long as you can maximize the WOW factor. <br /><br />Music is an important part of the course. You need music for every video. You don't have to compose your own music. Just find some online and do some remixing or editing to make it fits the video.<br /><br />No essay, quiz, midterm and exam. Just 4 video project with 8 videos.<br /><br />Topics:<br />1. Parady Movie Mashup (10%)<br />2. Character Mashup Remix (15%)<br />3. Villain Lyrics Video Remix (20%)<br />4. Multiverse Surprise / Deepfake Remix (45%)<br /><br />You have to think of the contents yourself, and there are some freedom in choosing the topic. So, you don't need to follow the above topic strictly, especially for the last video project. Besides, you can use whatever software you want for making your video. Generative AI is also allowed.<br /><br />For the rest 10% of marks, they are from peer review and research rating. Peer review means you rate other people's work. And research rating is to do surveys and record yourself playing the given music game (Osu). The research review may be different for different semester.",
            "comment_teaching": "During lectures, you just watch other people's work and rate from 1 to 5, and professor will also comment on the videos. You can learn and inspired from the work of others. Skills for video and audio editing will be released as notes and you read by yourself. Not much technical things or theories to talk about, it's more about your creativity.<br /><br />Horner Andrew is a nice and generous professor. He allows late submission as long as he get enough video to play during the lecture. And he also allows flexibility in the topic, so you can do whatever you like.",
            "comment_grading": "Partly depends on peer review, not just professors own decision.<br /><br />Video 1 (10%)<br />Mean: 4.2<br />Max: 4.8<br /><br />Video 2 (15%)<br />Mean: 4.2<br />Max: 5<br /><br />Video 3 (20%)<br />Mean: 4.2<br />Max: 5<br /><br />Video 4 (45%)<br />Mean: 4<br />Max: 5.1<br /><br />Pear review and research rating (10%)<br />Mean: 20.4<br />Max: 25<br /><br />Me all above mean, final grade A+.<br />Very good grade, at least to me.",
            "comment_workload": "Varies a lot, depends on how much effort you want to put into your video. If you want a high grade (A range), workload can be pretty high because there are many professional students in the class. Otherwise, it is low, as you just need to submit short videos with simple editing.<br /><br />No attendance is taken, but since you need to review others work, you have to attend lecture, unless you don't care about the 10% mark.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "i6WKXDPYTalGYmSOTa9RICXElCVlfo9o",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1636,
                    "name": "HORNER, Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YARRRRRR",
            "date": "Jun 05, 2023",
            "title": "Nice grades if you have some experience in video editing and music remixing",
            "comment_content": "The most fun I had in UST from a course, truly (just put JOJO/UST meme reference).<br /><br />The entire course is about editing videos and remixing music to create something new and inspiring. Prof. Horner encourages us to include surprise elements (e.g. creative concepts, unexpected plots and techniques).<br /><br />Each lecture revolves around Prof. Horner showing past submissions for inspiration in the upcoming assignment, or playing submissions for us to give a peer rating.<br /><br />There are 3 assignments and a final project for a total of 4 submitted videos. 1-2 mins for assignments and 2-3 mins for the final video, and also a commentary for each submitted video with around the same length. Some general instructions are given for each video like the theme (e.g. music remix, green screens), but you can also just do anything that you want (given that you have the idea).",
            "comment_teaching": "TBH there aren't much taught content in the course. You are expected to learn video/music editing skills by yourself and create a final product. If you have a busy semester (FYP) or are uninterested in media editing, then it is probably better to not take this course.<br /><br />However the prof does play some videos from previous semester and explain what is good about them and some interesting techniques. He also gives comments on each submitted video after they are played in class. He replies quickly and comments on your video if you submit via email.",
            "comment_grading": "Grading weights:<br />Assignment 1 (10%) 4.57/5 (movie mashup)<br />Assignment 2 (15%) 5.01/5 (green screen mashup)<br />Assignment 3 (20%) 4.46/5 (Villain lyric video remix)<br />Project (45%) 4.72/5 (Multiverse surprise/ Deepfake/ generally anything)<br />Peer &amp; research ratings (10%) 22/25<br /><br />Mean is around 4.17 for assignments and 4 for project. UQ is generally around 4.5.<br /><br />If you submit via canvas only (no email), he won't play it in class but you also get less marks (and no feedback from him).<br /><br />You will get a grasp of your marks after the prof give comments in the class. Generally, he always give positive feedback so there are a few things to look out for to know whether you will really get a high mark. If he replay certain parts of your video to give further comments, or he speaks about unique elements in your submission, then you will (probably) get a good mark. Just speaking from experience, the TAs also gives you marks so his comments doesn't reflect everything.<br /><br />Attendance is counted in peer &amp; research ratings. There will be a peer evaluation quiz (multiple choice) on canvas for each class and you will give a mark for each video.<br /><br />Research ratings are just online research hosted on Qualtrics. You are required to record the session and use a headphone in a quiet room. each rating takes about 30-40mins and you do 4 of them for 4 bonus marks in that 10%.<br /><br />Overall I expected around B+/A- but prof. Horner surprised me with an A+ (my only A+ haha and my third assignment wasn't that great). I would say the grading is quite lenient.<br /><br />If you have no experience and interest in video editing/music remixing, then idk if you can get a good grade (A range). But generally the more work you put in your video, the better the marks will be.<br /><br />FYI link to all my creations for this course:<br />https://drive.google.com/drive/folders/1NhlVkcbY2yCnd1aBR_wXau6xwrWohAVa?usp=sharing",
            "comment_workload": "Here are the due dates:<br />Assignment 1 - Feb 13 (1 week later if you joined during add drop)<br />Assignment 2 - Mar 1<br />Assignment 3 - Mar 22<br />Project - Apr 20<br /><br />The due dates are pretty tight to get around, as all of the workload is concentrated on the first half of the semester. After you submit the project, the only things left are research ratings (really light) and attendance. You will probably be extremely busy if your FYP due date is on top of the project due date (like me💀).<br /><br />The workload largely depends on the what you want to achieve in your video. My second and fourth video had ambitious scopes(many green screens/voice acting/ memes) and took me way longer than expected to complete. I spent probably around 80 hours on all of the assignments combined with learning the necessary techniques.<br /><br />If you have zero/little prior experience in video editing/music remixing and you want to produce something good, then the workload will be very heavy.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XfY1JKSILGiyoFRXsn4zVMQTfsoJE0fd",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1636,
                    "name": "HORNER, Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Angez",
            "date": "May 31, 2023",
            "title": "A celebration for experienced individuals, a nightmare for beginners.",
            "comment_content": "This experiential project-oriented music and video technology course will provide hands-on experiences in creating music videos and movie/game trailers by creatively remixing music, recutting video, and applying effects such as time and frequency distortion, time warping, reverse, filtering, and phasing. Students will create music remixes, music/video/actor mashups, and plot twists in their music video storytelling. It will give students a chance to work with emerging video technologies such as deepfakes. Whether students have music or video background or not, this course will provide them a chance to create like a sound designer and director. For each of their music video creations, students will also create a behind-the-scenes commentary video that describes what they did and how they did it. They will share their creations and commentaries in class, and learn from and be inspired by one another.<br /><br />Course web: https://course.cse.ust.hk/comp4441/<br />(with instructions for assignments and the final project provided)",
            "comment_teaching": "Horner is a very kind prof who frequently praises his students. <br />He is understanding and allows for a postponed deadline if you send an email in advance. <br />During class, we appreciate videos created by other students and watch inspiring student assignment videos from previous years. Horner provides feedback for each video, mostly pointing out strengths and innovative aspects, and rarely mentioning weaknesses. <br /><br />Tutorials are recorded videos made by TAs, and do not require face-to-face attendance. They cover some video and audio editing techniques, and sometimes include music theory knowledge.<br />To be honest, I hardly watch these videos because unlike other courses, the tutorials do not teach the exam material, but rather just one of the many ways to achieve the final result. If you know other techniques, it is perfectly fine. AI face-swapping and lip-syncing are often taught, but I have never used them.<br /><br />By the way, I do not think that the grading of this course is biased towards video and audio. If you think &quot;I got a bad grade because my audio was bad, even though my video was good, and this course is called Computer Music,&quot; it is probably because your video is not as good as you think it is in the eyes of others (or your audio is sooooooo bad that it is beyond acceptable, but this is rare).",
            "comment_grading": "3 Assignments (45%: 10, 15, 20%), Project (45%), Peer &amp; research ratings (10%)<br /><br />Mine:<br />Assignment1: 4.55/5 pts<br />Mean: 4.19\tMedian: 4.3\tHigh: 4.82<br />Upper Quartile: 4.5\tLow: 0\tLower Quartile: 4.16<br /><br />Assignment2: 4.82/5 pts<br />Mean: 4.18\tMedian: 4.21\tHigh: 5.01<br />Upper Quartile: 4.49\tLow: 0\tLower Quartile: 4.04<br /><br />Assignment3: 5.01/5 pts<br />Mean: 4.16\tMedian: 4.34\tHigh: 5.01<br />Upper Quartile: 4.49\tLow: 0\tLower Quartile: 4.12<br /><br />FinalProject: 4.8/5 pts<br />Mean: 4\t\tMedian: 4.21\tHigh: 5.11<br />Upper Quartile: 4.47\tLow: 0\tLower Quartile: 3.98<br /><br />Peer &amp; research ratings: Full<br />Mean: 20.35\tMedian: 21\tHigh: 25<br />Upper Quartile: 24\tLow: 6\tLower Quartile: 17.75<br /><br />Grade: A+<br /><br />I strongly advise against taking this course without a foundation, unless you do not care about your grades, as you will be competing with at least 10 other students who are like professional producers and animators for every assignment. <br /><br />You can check if you are capable of taking this course by watching some of the students works by searching &quot;COMP4441&quot; on YouTube. I have watched most of the videos related to COMP4441 on YouTube, and although I am sorry to say this, they are not very impressive (if you want to ensure a grade of B or above, you need to have more impressive works than those shown in the videos, I think).",
            "comment_workload": "The workload varies from person to person. <br />However, according to the course design, if you do not delay the deadline, the workload will be staggered from other courses.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GrVBPfbPZ0hDUkqK3Rtr9QKaEl8g0k0W",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 126,
                    "name": "HORNER, Andrew Brian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "martinman2020",
            "date": "Aug 09, 2022",
            "title": "",
            "comment_content": "3 assignments <br />(1-2mins video and commentary video)<br />Focus on inspiring people (WOW-factor)<br />MA1: Wacky Mashup Trailer (10%)<br />MA2: Anime Music Video Remix (15%)<br />MA3: Odd Couple Remix (20%)<br />After you submitted, you can get at least 4/5 points for each assignment.<br />Project: Deepfake MV Remix (45%)<br />Peer and research rating: peer review in Canvas every assignments (10%)",
            "comment_teaching": "Very nice professor. He will give a comment after you submitted the assignment.<br /><br />In the lessson, he provided some example video for inspiring us to do the assigment.",
            "comment_grading": "Overall B<br /><br />MA1: 4.04/5 (the explanation in the commentary video is not enough)<br />MA2: 4.46/5<br />MA3: 4.21/5<br />Project: 4.11/5",
            "comment_workload": "Fair enough. Just remember to do the peer review in Canvas (easy 10%)<br /><br />No restricted video and audio editing tools. I personally use PR for video editing and audacity for audio editing tools. <br /><br />For the commentary video, you may need to give more explanation for how to edit your video (e.g. give a storyline or point out what effect you had included in the video). Just show that you put so many effort in this video.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GaHBtGMvUlkH7pbxHQh1hVIoo7U3wmse",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 126,
                    "name": "HORNER, Andrew Brian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "科大痴漢",
            "date": "Aug 26, 2021",
            "title": "輕鬆剪片靚Grade course",
            "comment_content": "Professor會上堂播以往學生嘅作品俾同學參考 <br />成個Sem總共有3份Assignment + Final project<br />每次交片之餘仲要整多段Commentary去講解返你條片整左啲咩, 可能講下整左咩特效, 配樂原來係你自己用software整嘅同點解你要咁樣整等等....<br />我好懶唔想打, 你有咩想問嘅tg問我(如果個tg ac仲係到&gt;3&lt;)<br />tg:gpa4fatboy",
            "comment_teaching": "Lecture:<br />Lecture淨係會播片同講下啲片有咩令佢WOW嘅地方xD<br />其實上唔上Lecture都冇所謂, 最緊要做番Peer evaluation就得.<br />Assignment1開始之前會播以往同學做Assignment1嘅片,<br />完左Assignment1後就會開始播同學整嘅片再俾大家互評.<br /><br />Tutorial:<br />Tutorial會教你可以用啲咩software去整片同埋個software點用. 不過我走哂堂haha",
            "comment_grading": "- 3 Assignments:<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Assignment1(10%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Assignment2(15%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Assignment3(20%)<br />- Project (45%)<br />- Peer &amp; research ratings (10%)<br />懶得打下面有寫點俾Grade:<br />(整得幾垃圾都好, 唔好唔交片, 交左至少有3分&gt;&lt;)<br />Assignments and a project are scored by the professor, TAs, and peer evaluation.<br />&nbsp;&nbsp;&nbsp;&nbsp;The peer evaluation score you gave to yourself will be omitted.<br />&nbsp;&nbsp;&nbsp;&nbsp;Any unreliable peer evaluation score will be omitted.<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;e.g. All score are max/min, peer evaluation with extremely short time spent on finishing the survey.<br />&nbsp;&nbsp;&nbsp;&nbsp;Each assignment is graded by &quot;3 base mark + maximum 2 bonus mark&quot;.<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3 base marks will be obtained once you submit the assignment in Canvas.<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2 bonus marks can be obtained if you also submit the assignment to Professor's email (horner@cse.ust.hk) to allow playing your piece in the class.<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The 2 bonus mark is the score mentioned above, which is judged by professor, TAs, and peer evaluation.<br />&nbsp;&nbsp;&nbsp;&nbsp;Peer ratings + Research ratings (10%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;After the add-drop period, we will take attendance from the peer evaluation survey.<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Here are some conditions those may not be taken attendance. <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Late submission for peer evaluation survey (Please finish the survey within the day it started.)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Your peer evaluation score has extremely low correlation score to other coursemates'. (e.g. Giving the max score to every pieces)",
            "comment_workload": "我唔識剪片, 每條片都係Deadline前幾日至一星期先開始, 自己上youtube學, 鳩下鳩下咁剪都過mean=_=如果你平時有剪開片嘅我相信呢科對你黎講唔難, 難在係要有idea去諗點整條片. 基本上用腳慢慢剪片都交得切.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sKBf3mnycoYyajO1FzK4j3zzqYAL4mO9",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 126,
                    "name": "HORNER, Andrew Brian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chris law",
            "date": "Sep 06, 2020",
            "title": "computer music (good grade:) )",
            "comment_content": "in-class: we just watched videos and filled the peer review form to give the scores to that students. <br /><br />If you are shy to play your videos in front of all students, you can choose to submit privately which means your work will not show to all. But, there will be some bouns marks if your show your work to all. This is a trade of between getting higher marks and being no-showing work.",
            "comment_teaching": "not much teaching in class. But, the tutorial will teach you some useful skills for mixing sounds so that you can come up with your own videos.",
            "comment_grading": "VERY GOOD grade <br /><br />NO exam, NO mid term <br /><br />Marks will be given by Professor, TA and peer review form (students)<br /><br />Weight:<br />Assignments: 60%<br />Final Project: 40%<br />Peer Evaluation: 10%<br />So, 110% in total",
            "comment_workload": "There are only 5 videos submission are needed. <br /><br />professor called the assignments as Mission Impossible Assignments (MIPA) <br /><br />4 short videos (MIPA1, 2, 3, 4)<br />You need to create short video last for 30 sec to 1 min<br /><br />1 final video <br />3 mins video <br /><br />All 5 videos, you can choose to do it in group of 1 or 2 member(s)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IWbquZ5OqrP6FbE6CGZcNxormPTdd9Hs",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 126,
                    "name": "HORNER, Andrew Brian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kelvin Y",
            "date": "Jul 28, 2020",
            "title": "Best course I've ever had (no programming involved)",
            "comment_content": "Music editing and video editing. You can use whatever software you want, suggested music editing software for beginners is Audacity.<br /><br />You are given a topic to create a music video on every two weeks.<br /><br />You have to submit your work to canvas, but you are also allowed to email your work to the professor for bonus marks. He says bonus marks but if you add up the % of possible marks together it's like almost 200%, and it's on a curve so you need to get those bonus marks. He shows the videos he gets emailed in class, and you basically spend every lesson watching videos made by others.",
            "comment_teaching": "Well there's not much teaching involved other than the TAs teaching some basic music editing with Audacity, which I used. Otherwise you learn from watching other people's videos.<br /><br />Every class is just watching videos that other people made. <br /><br />It's a good idea to get inspiration from others, or just look online for professional level videos.<br /><br />Professor Horner always praises your work, I've only heard him not say anything positive about one video because honestly no one knew what was going on. He's a really positive professor.",
            "comment_grading": "He tries to give as high a grade as possible. Honestly he is the nicest grader. I'm pretty sure he gives as many As as he is allowed to.<br /><br />I tryharded this course because I find it fun. Got an A+<br /><br />You will learn as you go, just try to learn from the videos other people made and use their techniques in your own work. Also listen to what the professor finds good/interesting.",
            "comment_workload": "Workload depends on what grade you want. There is an assignment every two weeks, and a final project which is basically another assignment but slightly longer. <br /><br />You want an A range? You gotta put more time and effort into your music remixing/creating and videos. I put an average of about 10 hours per assignment but I got an A+ so ¯\\_(ツ)_/¯<br /><br />You wanna chill? You can just put something together in a few hours, and probably get a B/B-<br /><br />If you put like bare minimum effort but still do something you'll probably get a C range",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iNwvh8HuYO9P5V0eznBC86u1lziz2YRv",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 126,
                    "name": "HORNER, Andrew Brian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wesley Hui",
            "date": "May 31, 2020",
            "title": "",
            "comment_content": "This course is mostly about video and sound editing. Every two week or so you would need to submit a video based on the theme given out. There are 4 assignments and 1 final project (which is similar to a normal assignment, just a longer duration). this semester the themes are:<br />1. No theme (just make a mashup video with a song, you would need to submit this before the first lecture)<br />2. Reversing video<br />3. Rhythmic (?)<br />4. Romantic story<br />5. Final Battle<br /><br />As the description said, having a musical background certainly helps but it's not necessary.",
            "comment_teaching": "As the start of each assignment the professor would show some works from previous semesters to give you an idea of what to do (except the first assignment). Besides that, you would be learning how to use your video/audio editing software mostly by yourself. Ask the TA's for tips if needed.<br /><br />Overall it's a pretty casual course.",
            "comment_grading": "The scores of your assignments and final project comprise of grading from TAs and professor, as well as peer evaluation. As long as your video is decent it won't be hard to get a good grade.",
            "comment_workload": "The amount of workload depends on how polished you want you final product be. 1-2 hours per day for 3-4 days usually get the job done for me but there are people who spends much more time on it I think. No pressure though.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0v4QL5d6J2sVE89MTTkPbkP1BrRCN73n",
            "semester": "2013-14 Spring",
            "instructors": [
                {
                    "id": 126,
                    "name": "HORNER, Andrew Brian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yanks",
            "date": "Jan 15, 2018",
            "title": "",
            "comment_content": "The course begins with basic contents, from waveforms, acoustics, and to the tools used(CSound/PVan) to analyze/synthesize sounds.<br />Really easy to follow and most of the contents taught will be practiced through lab sessions using CSound.<br />When it gets to FM/AM synthesis and wavetables, it may be easy for ones with electronic musical background but for those without any musical background, there are tons of youtube tutorials explaining such concepts so it shouldn't be too hard.<br />Applications of such knowledge to real music production is minimal. These are mostly theoretical parts and mostly aren't used in fields such as music production(but maybe in research?)",
            "comment_teaching": "The professor is quite chill, will answer any questions you may have. When asking questions related to computer music but outside of class coverage, he will gladly provide any reading materials he can find.<br />Most contents are very basic and only scratches on the surface of computer music so I cannot comment on how well such knowledge is taught. Just ppt slides will not be enough to understand the concepts though.",
            "comment_grading": "I guess very generous. I took this course as a freshman without any&nbsp;&nbsp;prior knowledge in coding. Still got a fairly good grade from midterms and the freedom of choice to do whatever I can for the final project is really a big plus.<br />The professor will respect your ideas and gladly mark it in accordance with the course contents.",
            "comment_workload": "Just labs using C-Sound(basically a walk-through in lab) is all until final project.<br />You have to decide on your own to find what to do for your final project and present it to the class at the end.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}