{
    "error": false,
    "course": {
        "id": 205,
        "subject": "COMP",
        "code": "1941",
        "name": "Great Ideas in Computing",
        "description": "Digital computing technology has brought many sweeping revolutions to our society. This course introduces some great and inspiring ideas in computing in the modern world, and discusses how people use computing tools to create useful solutions for challenging and important problems we are facing. Topics include artificial intelligence, data mining, biometrics, computational complexity, cryptography, efficient search, webpage ranking, network science, computer and society, and computational photography.",
        "categories": [],
        "website": "https://course.cse.ust.hk/comp1941/",
        "credits": 3,
        "semesters": [
            1510
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.2,
        "rating_teaching": 3.6,
        "rating_grading": 3.6,
        "rating_workload": 3.8,
        "review_count": 5,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 101,
                "name": "LI, Xin",
                "count": 5
            }
        ]
    },
    "reviews": [
        {
            "hash": "JYrOLU1J3mUEmGUJ5DShrgLrx5EsH3W7",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 101,
                    "name": "LI, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "http",
            "date": "Jan 20, 2017",
            "title": "",
            "comment_content": "The content is very wide, from AI to recursion to search engine works to cryptography.<br />You will also learn a simple programming language called Scratch, developed by MIT, which is for babies and kids, So as a university student, you should be able to handle it easily, especially if you are Computer Science student.<br /> The content is in huge amount, but if you don't mind to memorize them, it will be a piece of cake for you. remember, the final examination includes calculation.",
            "comment_teaching": "Dr. Li is a kind teacher, and she will try to warm up the atmosphere by showing videos, which is pretty fun. However, her class is a bit boring and I almost slept in all her class.",
            "comment_grading": "The final examination is kind of hard even for a CSE student like me. <br />But you can get easy scores if you put just put a little bit hard work on your assignments. <br />The final project is quite interesting on scoring, because every student will need to participate the scoring when presenting your project. Besides, I got A+ from Dr. Li and average A from my classmates for my project.<br />The below link is my project.<br />https://scratch.mit.edu/projects/88679258/",
            "comment_workload": "The workload is not heavy at all. Usually, there will be two assignments&nbsp;&nbsp;and two scratch programming project. However, final project consists of an essay, a video, a presentation(PPT) and a Scratch program.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bvFG1aNVOXpDn6USnWSocYQJjBz9sd4E",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 101,
                    "name": "LI, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "patrick330602",
            "date": "Feb 10, 2016",
            "title": "",
            "comment_content": "The content is very broad, from AI to recursion to how search engine works. Also, you will learn a simple programming language called Scratch. The content is kind of hard, but if you don't mind to memorize them, it will be a piece of cake for you. remember, the final examination includes calculation.",
            "comment_teaching": "Not a fun class.... Miss Xin is a kind teacher, and she will try to warm up the atmosphere by showing videos, which is pretty fun,. however, overall her class is very boring. To be honest, sometimes I even wanted to sleep during the class.",
            "comment_grading": "The final examination is kind of hard even for a CSE student like me(although I got a fairly high score compare to others).&nbsp;&nbsp;And you can get easy scores if you put just put a little bit hard work on your assignments. The final project is quite interesting on scoring, because every student will need to participate the scoring when presenting your project.",
            "comment_workload": "The workload is not that heavy. Usually, there will be two assignments&nbsp;&nbsp;and two scratch programming project. However, final project consists of an essay, a video, a presentation(PPT) and a Scratch program.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JjNPK226bRVbcpYLI3pHxkzHPoOskvzB",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 101,
                    "name": "LI, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anish",
            "date": "Jan 28, 2016",
            "title": "",
            "comment_content": "The course cover many computing topics, easy for students with computing background to understand. The content is very basic and is easy to follow.",
            "comment_teaching": "The lecturer gives a thorough understanding of each topic taught in the course. The labs almost cover every aspect of the assignment.",
            "comment_grading": "Many students are from computer science stream. Therefore, they are in advantage when doing the examination.",
            "comment_workload": "The workload is high, but manageable. It has 2 home works and 2 programming project. One programming project is group-based, it has to submit paper report, scratch program, video and live presentation. The final examination is open book so easy to score in.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VFcDWF0CblO1DCvEDchsl7dA3MNuNVjq",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 101,
                    "name": "LI, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "queenb",
            "date": "Jan 24, 2016",
            "title": "",
            "comment_content": "The course cover many computing topics, which is difficult to catch up for students have no computing background. It require in-depth understanding on the topic.",
            "comment_teaching": "The lecturer is quite demanding. Teaching is a bit fast for students have no computing background.",
            "comment_grading": "Many students are from computer science stream. Therefore, they are in advantage when doing the examination.",
            "comment_workload": "The workload is high. It has to do 2 homeworks 2 programming project. One programming project is group-based, it has to submit paper report, scratch program, video and live presentation. The homework need to be search online and is quite vague in nature.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DK2htSZU9fPUgra6MJRKSCgzu6L4BDmQ",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 101,
                    "name": "LI, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Loong",
            "date": "Dec 28, 2015",
            "title": "Interesting &amp; Relaxing course",
            "comment_content": "The courses introduces you about some general topics in computer science such as artificial intelligence, data mining, cryptography, web search, etc.<br /><br />Within each topic, you learn about the important underlying theories (just a brief introduction, not in depth), the application of those theories in real world and the current state of development of the fields.",
            "comment_teaching": "Dr. Li speaks English very clearly and slowly, so it is very easy to follow the lectures and understand the content right in class.<br /><br />Besides, Dr. Li also include many interesting videos in her lectures, although they concentrate at the end.",
            "comment_grading": "- Attendance (lectures + labs, 5%) is taken randomly during the semester<br />- 2 Written Assignment (10% each): Not hard:<br />+&nbsp;&nbsp;One is investigation about a topic learned in class (just Google, Wiki, ... -&gt; Clean &amp; Concise Presentation Document)<br />+&nbsp;&nbsp;One is programming questions on paper (just re-read the lectures before doing this and you'll be ok)<br />- 2 programming assignment: This class uses Scratch, a visual (drag&amp;drop) programming language, which is very intuitive to use. The final programming assignment is creating a game. Just be creative and you'll get good grades",
            "comment_workload": "Very light:<br />- 2 programming projects<br />- 2 (relatively short) written assignment<br />- Final exam (open book)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}