{
    "error": false,
    "course": {
        "id": 221,
        "subject": "COMP",
        "code": "3111H",
        "name": "Honors Software Engineering",
        "description": "General methodologies, techniques, and tools for planning, designing, implementing, validating, and maintaining large-scale software systems. Collaborative development environment, automatic static analysis, and testing techniques. Open source project development methodologies and techniques.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510,
            1410
        ],
        "prerequisites": "Grade A- or above in <a class=\"course-link\" data-subject=\"COMP\" data-code=\"2012\" href=\"/review/COMP2012\" target=\"_blank\">COMP 2012</a> / <a class=\"course-link\" data-subject=\"COMP\" data-code=\"2012H\" href=\"/review/COMP2012H\" target=\"_blank\">COMP 2012H</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"3111\" href=\"/review/COMP3111\" target=\"_blank\">COMP 3111</a>, <a class=\"course-link\" data-subject=\"ISOM\" data-code=\"3210\" href=\"/review/ISOM3210\" target=\"_blank\">ISOM 3210</a>",
        "rating_content": 3.67,
        "rating_teaching": 4.33,
        "rating_grading": 4.17,
        "rating_workload": 4.17,
        "review_count": 6,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 96,
                "name": "KIM, Sung Hun",
                "count": 3
            },
            {
                "id": 124,
                "name": "LEUNG, Wai Ting",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "8j5QHbdWWTF7j23YFY2QuodWPD0jtYuz",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 124,
                    "name": "LEUNG, Wai Ting",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TomNotch",
            "date": "Jan 14, 2021",
            "title": "Delay this course, careful if you decided to take it",
            "comment_content": "Basical software engineering concepts, only qualitative analyses, no quantitative analyses. So you can say that it's like a business management course, no coding of any language is taught, surprising, isn't it ? But the result is that you can only learn a little about software engineering, even if we only talk about the management part.<br /><br />Ever since online teaching, the faculty has adopted flip mode, which means the main course material is delivered through pre-recorded videos, and they require you to watch 2 videos before weekly lecture, and finish 2 quizzes, each consisting of 5 single multiple choice questions, which they say are easy, but according to most students' feedback, at least on of the questions in each quize are quite vague and hard to do right. They put some in-class exercises during the lecture (usually 2), and require you to submit them after lecture for attendance.<br /><br />All in all, I dislike flip mode, because sometimes when you have questions regarding the real course materials in the pre-recorded videos, you cannot ask the professor directly. Writing e-mail every time can be annoying, and it's easy to forget about the questions when you attend the lecture to do some &quot;practical&quot; exercises.",
            "comment_teaching": "3111 and 3111H track students are taught together, the only difference is that H track students have a slightly more challenging project and &quot;better grading&quot; (said by the professor) than non-H track students.<br /><br />Since it's flip mode that they delivered the course, the teaching is only about in-class exercises.<br /><br />You'll feel that the conventions of drawing a class diagram is unclear and it's often the case that whether you are right or not is totally up to the professor and TAs.<br /><br />Other in-class exercises are fine though.",
            "comment_grading": "This part is what I'm so disappointed about.<br /><br />Grading scheme : (directly copy and paste from canvas)<br />Evaluation: Pre-Lecture Quizzes (10%), In-class Practice Exercises Assignments (10%), Labs (10%), Project (30%), Final (40%)<br /><br />Professor adopted a mixture of both relative and absolute grading as a result of the whole class has done a good job.<br /><br />Well, here's some fun facts :<br /><br />Overall 89.93% == A<br />Overall 85.26% == B<br />Overall 81.69% == C+<br /><br />It doesn't matter which one is mine, what matters is that this shows that most students' overall lies in 80%~90%, and the professor has to decide who gets A+ and who gets D-, thus you have D- to A+ in just 10%.<br /><br />Grading of the final exam is totally dependent on professor and TAs, because there's even no standard or preferred&nbsp;&nbsp;solutions provided after exam. How can you appeal ? You can only wish and you are doomed, that's it.<br /><br />Professor Kennethe said &quot;I'm generous&quot;, but actually not.",
            "comment_workload": "Workload is not high, as long as you know how to use github and code Java.<br /><br />The main problem is about project.<br /><br />This semester the project is a Gradle based data analysis application. If it's the same when you are taking this course, then good luck with Gradle + Eclipse, because many students and I all encounter misterious problems when setting up the environment and coding, that even the TAs cannot solve. Then who do you expect me to approach, father of Java, Eclipse developer or Gradle developer ?<br /><br />Another serious problem is that the teaching team acts as the client/stakehoder and all student teams act as &quot;Party B&quot;, who's gonna be responsible for everything that goes wrong. We are just beginners learning how to be a good software engineer, OK ? Not some employees that are disposable and can be used as tools.<br /><br />One little problem in the project (which is due to the vague requirement that they put on canvas), and they deduct 20 points from 100. I run out of words to express my disappointment towards this course.<br /><br />TLDR, the workload is not high, but whether it'll be turned into a good result, you never know.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 8,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XkUM94Z0GRyTLj9LPHVh6BvgnaZQ5D5Y",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 124,
                    "name": "LEUNG, Wai Ting",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "RickyLeung",
            "date": "Dec 17, 2021",
            "title": "",
            "comment_content": "Some of the teaching material is quite common sense, such as how to manage the project, how to plan the project. But most of the material is useful for programmers, such as teaching different design patterns (Observer pattern, Factory pattern) and teaching object-oriented graph drawing (UML model). By comparing with other COMP courses, this course does not teach much specific knowledge but you can still learn some software engineering skills.",
            "comment_teaching": "LEUNG, Wai Ting is a nice professor. Students can contact him via telegram to ask questions related to the courses. Besides, TA is also nice that if you have any questions related to the lab, you can contact him for help.",
            "comment_grading": "Kenneth promised that &gt;90 = A in telegram while the class overall average is 88. The grading is really nice.<br /><br />10% in-class exercises<br />10% quizzes<br />10% lab<br />30% project<br />40% exam<br /><br />Almost all of the students can get a full mark in In-class exercises, quizzes, and lab. Don't be too lazy, then you can easily get a full mark here.<br /><br />The project is a bit difficult but the grading is still nice, there are a few groups can have a full mark in the project.<br /><br />Impossible to get a full mark in the exam, but the class average is quite high (around 75). If you can get a full mark in other components, getting an average score in an exam is not terrible.",
            "comment_workload": "Assignment:<br />In-class exercises, quizzes, and labs are really easy to do.<br />The group project takes around a whole week to do. By comparing to other COMP courses such as COMP2011 and COMP2012, the workload is like a doubled-PA. However, COMP3111H has one group project only and the deadline has been postponed for 3 to 4 days. Thus, the workload of the project is not heavy.<br /><br />Class:<br />Instead of the regular class, each student has to watch two extra videos a week for two weekly quizzes. These videos may take you an hour a week, but still an acceptable workload.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Q1mrw97kNQfE76IlnzvnQU4p8q0kyy1X",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 124,
                    "name": "LEUNG, Wai Ting",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Think",
            "date": "Dec 23, 2020",
            "title": "Same as 3111",
            "comment_content": "Same as 3111. SW engineering concepts and some modeling.<br /><br />Although theoretical background is important, the course puts too little focus on git usage. It was such a pain in the neck to collaborate for the project with other students who have no idea of typical git workflow...",
            "comment_teaching": "One pre recorded video per week, and one zoom lecture for recap and exercises. It is not a bad approach, but the pre recorded videos are just reading the ppt slides, so they are not worth too much.<br /><br />Also, the labs are nearly useless imo. They are too much focused on eclipse usage, and the instructions have some mistakes too. They teach git usage only with eclipse integration...",
            "comment_grading": "Grades are not out yet, but one thing: it is too easy to get good marks except for the final, making the mean very high: so final exam will basically decide your grade. I think final exam is more or less a matter of luck, given that you are to draw diagrams that is correct according to the professor.",
            "comment_workload": "Workload is just Ok. The difference with non-H course is that you should include some more wow factor into your project, so you need to spend more time on it. Still, given that it's a 4 credit course, not too much workload.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XESQCRa62eRDhJCLkn2UYFdsXkjHxS1O",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 96,
                    "name": "KIM, Sung Hun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lynn",
            "date": "Jan 20, 2017",
            "title": "",
            "comment_content": "Contents are sufficient but remain at introductory level. Lectures are mostly talking about some must-known concepts of software engineering. You could get a general understanding about dev pattern, testing, architecture, etc. The group project is a web application. However, there is almost no difference between 3111 and 3111H, which made me a bit disappointed.",
            "comment_teaching": "Professor is active in teaching and sharing his own experience, but sometimes lab materials are not well-prepared.",
            "comment_grading": "It is quite easy to get a good grade as long as you've been truly devoted to the group project. Exams are mostly about the concepts introduced in lectures.",
            "comment_workload": "Although I have spent much time and effort on the group project, I still felt that the project is not as challenging as expected (partially because of the ambiguous requirement).",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vAYReNpuXAplYtfRgGltGSuj3bchXG8g",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 96,
                    "name": "KIM, Sung Hun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jshin49",
            "date": "Jan 11, 2017",
            "title": "Good Grades, not much workload",
            "comment_content": "The content is essentially about Design Patterns, Development Processes, and many other common Software Engineering Practices.",
            "comment_teaching": "The professor's teaching style is okay.<br /><br />He tries to interact with the students, but they do not respond much.<br /><br />His English is not bad to understand either.",
            "comment_grading": "Grading scheme is pretty lenient if you do what you are supposed to do.<br /><br />Just do everything and you are pretty much guaranteed an A range unless you mess up your exams. <br /><br />Doing above mean in the exams is good enough.",
            "comment_workload": "No coding required for the lectures, but a lot for the Project and labs.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "24CJAUDsac6gGCSz8xW41Dw267EFGqqh",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 96,
                    "name": "KIM, Sung Hun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cdbn",
            "date": "Dec 30, 2017",
            "title": "",
            "comment_content": "这门课的主要内容:<br />midterm 1前:<br />- Java, Java spring, github<br />- Software development process<br />- Requirements<br />- OO Modelling with UML<br />- Design patterns<br /><br />midterm 1后:<br />- Design patterns<br />- Refactoring<br />- Defensive programming<br />- Testing<br /><br />这门课的lecture note水准低，教授没把它们统一好，导致很多不同notation的出现。很多知识点也都是浅浅带过，只说definition罢了，导致学生不知道应该细读还是直接ignore。<br /><br />如果选择不上H堂，建议大家在大二spring上这门课，因为大二暑假实习的时候可能会用到很多这门课的知识点。",
            "comment_teaching": "教授教书很热情，尝试与学生互动，但是学生们都不给予反应。",
            "comment_grading": "midterm1: mean 70/100，highest: 97<br />midterm2: mean 75.1/100，highest 100<br />project: mean 118.9/130<br />本人: midterm1 80，midterm2 95.5，project 126 —&gt; A+<br /><br />这门课的grade很好，因为H堂采用absolute grading，所以建议大家上H堂。<br /><br />**个人感觉midterm的题目都莫名其妙的，尤其是midterm1问了一些匪夷所思的题目让学生们不知该如何回答，小心为上。",
            "comment_workload": "这学期的project是要做line的chatbot，workload和代码量还是很大的，不过会分成几个milestones来guide学生们完成project。<br /><br />project有三个topics，H堂和non-H的差别是H堂会指定做一些难度更高的features。认真做这门课的project的话还是可以学到很多practical的知识，比如说如何collaborate on Github，设计UML diagram和选择哪个design pattern，都是现实生活中很重要的skills。<br /><br />**建议大家提早开始做milestone，不要临时抱佛脚。",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}