{
    "error": false,
    "course": {
        "id": 3898,
        "subject": "CORE",
        "code": "1200",
        "name": "Engineering Team Design Experience",
        "description": "The Engineering Team Design Experience course allows students to explore various areas of engineering in order to design and build a remote controlled device or vehicle, culminating in the final competition before the end of the term. Students will use these specific project requirements as an opportunity to explore activities in which managers/engineers of various disciplines are involved. Specifically, they will build a device or vehicle that has motors and propellers for propulsion and control, and is controlled remotely using an Android device. Students in this course will be divided into design teams with a common goal: construct their project artifact. Each team will then undergo half-a-term training on construction, mobile phone programming and hardware communication. Team members work together to obtain the skills needed to design their project. Finally, the teams compile an project and contest other teams in a competition.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230
        ],
        "prerequisites": "a passing letter grade in <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1401\" href=\"/review/CORE1401\" target=\"_blank\">CORE 1401</a> OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1402\" href=\"/review/CORE1402\" target=\"_blank\">CORE 1402</a> OR CORE 1403 OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1404\" href=\"/review/CORE1404\" target=\"_blank\">CORE 1404</a> OR LANG 1002 (prior to 2022-23)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 0,
        "rating_teaching": 0,
        "rating_grading": 0,
        "rating_workload": 0,
        "review_count": 0,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [],
    "composer": []
}