{
    "error": false,
    "course": {
        "id": 3768,
        "subject": "CORE",
        "code": "1905B",
        "name": "Behavioral Foundations of University Education: Habits, Mindsets, and Wellness",
        "description": "This course will help students adapt to university life through advising, sharing and discussion, and applying the science of well‐being to enhance their personal and interpersonal development. It also aims to foster their self‐understanding and confidence as young adults who can fully enjoy their university education and career thereafter. The course has 3 components: Lectures and Seminars, Self‐Directed Experience, and Advising and Community Meetings. Lectures and Seminars will orientate students to their respective Schools/IPO, provide academic advices and equip them with the scientific bases of well‐being. Self‐Directed Experience will provide opportunities to develop mindsets and habits for students’ physical and social‐emotional wellness and personal enrichment. In Advising and Community Meetings, students will bring knowledge and skills together through reflection and discussion with peers and School/IPO advisors. Topics such as learning and time management skills, purpose of university education, and planning for personal and professional development will be covered. Graded PP, P or F.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "IDPO 1010",
        "rating_content": 3.56,
        "rating_teaching": 3.89,
        "rating_grading": 4.22,
        "rating_workload": 4.56,
        "review_count": 9,
        "single_review": false,
        "enrollment_status": 2,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [
        {
            "hash": "4kfFBlwn5e3G5q4a4DJtjWFI8IuhhJLF",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "LIN Yi",
            "date": "Oct 26, 2022",
            "title": "",
            "comment_content": "10%:线上单元(须在每单元的12题中答对9题以获得该部分的10%分数)<br />10%:讲座出席<br />20%:社区见面会出席<br />20%:自主经历(体育课等)<br />20%:线上调查问卷<br />20%:自我反馈(和朋友的一张照片等)<br /><br />10%:Online modules(have to correctly answer at least 9 out of 12 questions in each module to score 10%)<br />10%:Lecture attendance<br />20%:Community meeting attendance<br />20%:Self-directed experience(Sports Skill Classes, etc)<br />20%:Online surveys<br />20%:Self reflection(a photo with friends, etc)",
            "comment_teaching": "感觉课程和社交活动类似(?)，没有太多的“教学”。<br />Classes are more like orientations, not much &quot;teaching&quot; actually.",
            "comment_grading": "拿到90%的分数可通过，否则会挂科。<br />Scoring 90% will get you &quot;P&quot;, otherwise you will get &quot;F&quot;.",
            "comment_workload": "工作量不大，只要在期限之前完成任务就好了<br />Not much workload, just remember to finish all the tasks before deadlines.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sb5yeV7KZI30ujaTVHNaxlrWT69leiPh",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "tsu",
            "date": "Aug 21, 2023",
            "title": "",
            "comment_content": "Complete 4 modules of the Online Modules on Canvas<br />Attend 2 community meetings in Fall and 2 meetings in Spring<br />Some self-directed experiences, including sports skills class and attending activities on HKUST Engage <br />Complete 3 online surveys <br />Submit 2 self reflection in each semester",
            "comment_teaching": "The sports skills class are fun if you can choose the ones that you like. But the community meetings and online modules are quite boring.",
            "comment_grading": "Pass or Fail only<br />To get a pass, you have to complete at least 90% of the requirement.",
            "comment_workload": "Since it is only pass or fail, the workload is somehow small. But the online modules are really time consuming.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "j1P6CAVQOYhFB8E6cj7spDFQqAQWPrTy",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Timthngan",
            "date": "Jul 20, 2023",
            "title": "Take your time to finish the requirments",
            "comment_content": "Online quiz + Event hours + Community Meeting<br />The events and sports classes are engaging for students. Yet, the online part forces you to watch videos and do quizzes. It may not work and make the students really understand and remember the content concerning mentel hea<br /> <br />The content was initially designed to improve students’ health and well-being. However, it goes in the opposite direction. I indeed feel anxious when doing the quiz with limited attempts.&nbsp;&nbsp;Hard to judge, but the content itself may be fine, the problem will be the mechanism of the course design.&nbsp;&nbsp;It will be more enjoyable if it incentivizes students to learn rather than setting up a lot of standards and requirements.",
            "comment_teaching": "Online quiz and events.<br />The PE class is quite fun, good for students to try different sports. I took the squash class, and the vibe is quite good, and I built up the foundation for this sport.<br />Forum: It will be interesting if you choose something you really want to know and get exposure from. * Sadly, not all events at school being included in the course and counted toward your event hours.",
            "comment_grading": "P and F only. It occupied your credits, but still easy to pass as long as you follow the instructions.",
            "comment_workload": "It is time consuming, but not difficult to handle.<br />One useful tip: Finish the quiz and accumulate your event hours when you are available, do not leave everything till the final. It will be painful trying to fulfill the course requirement while doing revision for your final exams.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eJG0MJ7a6Ngv3TMLNI9EAdgXluppsvmk",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "あすか",
            "date": "Jul 19, 2023",
            "title": "",
            "comment_content": "10%:Online modules(have to correctly answer at least 9 out of 12 questions in each module to score 10%)<br />10%:Lecture attendance<br />20%:Community meeting attendance<br />20%:Self-directed experience(Sports Skill Classes, etc)<br />20%:Online surveys<br />20%:Self reflection(a photo with friends, etc)",
            "comment_teaching": "Very boring. This guy talks like my foreign grandmother in mainland China. Always talk some nonsense bullshit. I always&nbsp;&nbsp;fall asleep.",
            "comment_grading": "Pass or Fai",
            "comment_workload": "Very low because this subject has very little homework which means you have very little things to do so you will be very happy. I am very happy too.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MngeT2zIoeYw92SYYK5G3ixtOCv2K61W",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Lgu",
            "date": "Oct 30, 2022",
            "title": "",
            "comment_content": "Universal for engineering students.Includes two community meeting and you have to attend it in order to pass.The meeting is about the instructor giving a inspiring speech and playing some games that help you to make more friends.",
            "comment_teaching": "The instructor is quite humorous and it is not too boring to attend such a unnecessary but required course.",
            "comment_grading": "You attend all the meetings and do the assignments then you can pass.",
            "comment_workload": "You have to submit a photo of a group of students gathering.You have to find some group mates and have meals with them.Not difficult to find them because there’s a contact&nbsp;&nbsp;exchanging session at the end of the meeting.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "K2q1GgFoEfSmuhQb4JevEtAbUo9zlK4l",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "wokar",
            "date": "Oct 22, 2022",
            "title": "A course that force you to take less credit in the first year",
            "comment_content": "CORE1905B = for engineering school<br />3 cred course across the whole year<br />New course due to new common core curriculum<br /><br />Attend 70+% Lectures &amp; Seminars &amp; Events<br />Finish 4 module of quizzes in canvas, answer at least 75% correct<br />Attend *ALL* advising and community meeting, otherwise immediately fail<br />Do minimum 9hrs of sports and 3hrs of zoom meeting about mental health, total need 15hrs in one year, otherwise immediately fail<br />Complete intake survey, depression test, first year experience survey<br />Submit 2 reflections<br /><br /><br />If failed to complete two or more of the above tasks in the whole year, then need to retake it in the second year.",
            "comment_teaching": "Mostly online materials, the meetings that force you to go are just ice breaking games, treat it as a new student orientation would be better",
            "comment_grading": "Pass or Fail",
            "comment_workload": "Actually not very much, just remember to do the things needed before deadline and you will be fine.<br /><br />Since this is a 3 cred course across fall and spring sem, the maximum credit you can take in the two sem falls from 18cred to 15cred, also since you cannot credit overload in year 1, you are forced to take less courses.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "yVKX0LSI6lekfZapEYoke8s6CYX40oDa",
                    "name": "84436DC0-596D-40F0-9267-092ABC37575B",
                    "format": "jpg"
                }
            ]
        },
        {
            "hash": "5eQhQWuCR5leCRkVjHn4IkILEHcXVAdn",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "151",
            "date": "Jan 26, 2023",
            "title": "",
            "comment_content": "A compulsory (core) course for all students, where the B division means that this course is for students in the Engineering School. This course spans the whole year, so you will need to take the course in both the Fall (2 credit) and Spring (1 credit) semesters of your first year.<br /><br />The course is divided into many tutorial sessions, and the session you get assigned to depends on your Engineering Clan (i.e.: everyone in the same tutorial session must also have the same clan). You will remain in the same tutorial session for both semesters, and it is not possible to change which session you are in, so you may be unable to choose certain other courses if they clash with CORE1905.<br /><br />You will have to fill in a few surveys, finish some online quizzes on Canvas, participate in some self-enrichment activities, and attend two community meetings every semester. The content is relatively easy to complete.",
            "comment_teaching": "The teaching for the Sports Skill Classes is decent. The events in the Community Meetings are okay as well, but people who don't like to socialize might not enjoy them as they're basically a bunch of ice-breaking games and other similar activities for &quot;encouraging socialization&quot;.",
            "comment_grading": "The whole course is a P/F course, and you must complete 90% of the following requirements in order to Pass. <br />Passing itself is relatively easy and does not require much effort, but make sure to attend all the events on time and complete all the tasks, as you will likely fail if you miss a task.<br /><br />Lectures and Seminars (10%) - Have an attendance rate of 70% or above for lectures, seminars and events<br />Online Lectures and Quizzes - Complete 4 online lecture modules and complete the respective quizzes on Canvas.<br />Community Meetings (20%) - Every semester, you will need to attend two meetings with everyone in the same tutorial section (four in total for the whole year). Note that missing even one of these meetings will cause you to fail this section and thus the whole course.<br />Self-directed Experience (20%) - You must complete a total of 15 hours of such activities throughout the whole year, at least 9 (i.e.: six lessons) of which must be from a Sports Skill Class. The remaining 6 hours can either be from additional sessions of the Sports Skill Classes (total 12 hours max) or from other events (talks, volunteer service, workshops, etc) that you can apply for on HKUST Engage. Like the community meetings, note that that you need to complete all 15 hours or you will fail the course.<br />Surveys (total 20%) - You need to fill in three surveys - the Intake Survey in September, a mental health assessment survey in October, and the First Year Experience Survey in April. <br />Self-reflection (total 20%) - You need to submit one reflection assignment per semester, and each is worth 10% of your grade.",
            "comment_workload": "The workload is extremely low, as what tasks there are (surveys and self-reflection) can usually be completed in less than half an hour.<br /><br />The quizzes can be easily passed as long as you take some time to look at the slides and the videos (subtitles of the videos, if you're rushing)/apply common sense.<br /><br />The community meetings and self-directed experience do eat up some of your time, but it's only 15 hours total spread out throughout a year, so it can be done without difficulty as long as you plan your activities well and don't have them clash with other events or exam periods.<br /><br />The self-reflection sounds like a hassle but is actually fairly easy to do, as they just want you to upload a picture of you spending time with your clanmates/classmates in the same tutorial session as you. I strongly doubt that taking a selfie and adding a caption will take more than 5 minutes.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zrLWDufPPRnMrQYKkomhRHPyqIo6LkF1",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "APKB",
            "date": "Nov 24, 2022",
            "title": "Waste of time and credits",
            "comment_content": "Year 1 fall sem 1 cred + spring sem 2 cred.<br />Mental health issue which is boring, and a small community to unite SENG students. Tutorial sessions are divided according to your SENG clan.",
            "comment_teaching": "Games in the first committee meeting.<br />Sharing by SENG professors about how he/she did in the u-life.",
            "comment_grading": "Pass or fail course.<br />You may easily failed if you missed ONE single commitee meeting.<br />Read others' review to know more about the whole grading system, you need to get 90% of scores in order to pass the course.",
            "comment_workload": "You have a whole year to complete the online modules, with all MC quizzes and you can do it anytime and anywhere, but within limited attemps.<br />Self reflection does not need essay, only taking photo with your friends met after commitee meetings.<br />Sport skill class and seminars are required.<br />Much better than many 3 credits course in UST.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oocwvkH5AM0hZZGVSUVaGy8oK7w2QzYo",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "chingm",
            "date": "Dec 24, 2022",
            "title": "Bad because it wasted my credit.",
            "comment_content": "Totally 3 credits.<br />Fall sem 1 cre and Spring sem 2 cre.<br /><br />just simply complete the requirement in the whole academic year.<br /><br />The content is not useful but compulsory to complete.<br /><br />Contents include:<br /><br />Lectures and Seminars<br />Advising and Community Meetings<br />Self-Directed experience<br />Surveys<br />Self-Reflection<br /><br />BIG PROBLEM.<br />For freshman, in fall sem, you are allowed to take 18 cre only. This 1 cre course make students connot take 6 courses in fall sem, and finally I took 16 cre only in this sem....",
            "comment_teaching": "Online teaching modules: just watch the video and answer 12 MC for each units. I think the contents are not very useful.<br /><br />No Lectures and seminars in this sem(needed in Spring sem).",
            "comment_grading": "The grading for each part is full mark or zero.<br />90% to pass the course. Be careful.<br /><br />Lecture and seminars(10%):<br />Attend at least 70% Lectures and seminars<br /><br />Online module(10%)..<br />Complete 12 MC in each units with 9 correct answers. Not difficult<br /><br />Advising and Community Meetings(20%):<br />Two community meetings in each sem. You will be assigned to a clan at the start of year 1.<br /><br />Self-Directed Experience(20%):<br />total 15 hours needed<br />12 hours sports skill class+3 hours events in UST Engage.<br />OR<br />9 hours sports skill class+6 hours events in UST Engage.<br /><br />Surveys(20%):<br />Intake Survey(7%)<br />DASS(6%)<br />First Year Experience Survey(7%)<br /><br />Self-reflection(20%):<br />each sem 1 self-reflection.<br />You need to upload a photo to complete the self-reflection in fall sem.<br /><br />AGAIN, notice that you have only 10% marks to lose. I don't recommend anyone to try missing one of the above requirement unless you want to retake the course in year 2.",
            "comment_workload": "The workload is not high. Just spend little time in each sem to complete the course.<br /><br />I found that someone complete 30-hour events in UST Engage. Please don't do this unless you enjoy the events in UST Engage very much. No need to attend extra event after the time requirement is reached.",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        }
    ],
    "composer": []
}