{
    "error": false,
    "course": {
        "id": 3758,
        "subject": "CORE",
        "code": "1413",
        "name": "Advanced Putonghua for Non-Chinese Language Background Students",
        "description": "The course is designed for non-Chinese language background students who have learned Chinese for up to 300 tuition hours. It prepares students for an advanced-level understanding of spoken Chinese and to equip them with a strong communicative competence in using Chinese in social and professional situations. After successfully completing the course, their listening and speaking skills will be enhanced, and they will be able to handle a wide range of discourse with nearly full linguistic control and communicate effectively on complex topics relating to life, study and work.",
        "categories": [
            "Common Core (C-Comm)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "CORE 1416, <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1421\" href=\"/review/CORE1421\" target=\"_blank\">CORE 1421</a>, CORE 1422, <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1423\" href=\"/review/CORE1423\" target=\"_blank\">CORE 1423</a>, LANG 1117, <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1125\" href=\"/review/LANG1125\" target=\"_blank\">LANG 1125</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1126\" href=\"/review/LANG1126\" target=\"_blank\">LANG 1126</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1127\" href=\"/review/LANG1127\" target=\"_blank\">LANG 1127</a> (prior to 2022-23)",
        "rating_content": 3,
        "rating_teaching": 4,
        "rating_grading": 4,
        "rating_workload": 2,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 445,
                "name": "RAO, Yu Jing",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "PXD4xQykxdS2BXFQor0de5sWm8Zfbbg4",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 445,
                    "name": "RAO, Yu Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mading18",
            "date": "May 09, 2023",
            "title": "Only take this CC requirement if all your other courseload is light",
            "comment_content": "Generally a mixed bag. Some of the content was actually interesting to learn about (especially in Chinese) but most was rather boring and tedious <br />The content was divided into two units; really no difference between the type of content between the units except for how it was taught (see workload)<br /><br />Unit 1: <br />Study Abroad<br />From writing to typing<br />Living in the big city vs small city<br />Chinese people are changing<br />Defining &quot;family&quot; and &quot;hometown&quot;<br />Favors and Rule of Law<br />Unit 2: <br />Cyberbullying<br />Environmental Protection vs Economic Development<br />Technological advancement and Personal Equality<br />Chinese buzzwords and Gender Equality<br /><br />These topics are generally around HSK5-HSK6 level material (designed for those who don't have native language as Chinese but have extensively learned Chinese in a foreign language curriculum), except for some of the topics in Unit 2 which got really complicated and required you to dig deeper in to Chinese culture<br /><br />Each week's topic is structured into a few different sections: Reading and content, Grammar structures, Synonym differentiation, and Extended Discussion. <br /><br />For Unit 1, all of these except for Extended Discussion topics were taught in-class lecture style, and the Extended Discussion was reserved for self-reading (most people just ignored them until the group discussion)<br /><br />Unit 2 was taught in a more rushed manner probably due to the short time span. The remaining 4 topics were allocated for us to complete them majority of tasks online outside of class period, where class time was mainly reserved for short discussions about the topics and consultations for the group oral assessment. Basically, you were expected to complete Unit 2 independently",
            "comment_teaching": "Emma's teaching style is more &quot;interactive&quot; than other courses at UST; she tries to get everyone engaged with the content by randomly picking students to answer questions or recite articles, and arranges discussion time amongst student groups like creating sentences or delivering short responses. I have to say I wasn't really a fan of this type of teaching (mainly because I dislike language courses in general) but for a good majority of people in the class, it was okay<br />She will almost exclusively teach in Chinese which means that you are expected to already know how to speak and understand Chinese very well before enrolling. However, she will get suspicious if your speaking skills are borderline native-like fluent as she would tell you to switch to CORE1416, especially if she discovers you have been in a Chinese learning environment before.",
            "comment_grading": "Normal for a language course: a lot of little assignments that slowly build up to your grade<br />As this course focuses on speaking and listening skills rather than reading and writing, most of the assignments are structured this way. There is still a lot of reading/writing though<br /><br />Individual Oral Assessment(Week 8): 15%<br />Group Oral Assessment(Week 13): 20%<br />Listening and Grammar Midterm(Week 8): 30% <br />Canvas Quizzes(Week 1-13): 10%<br />Extended Topic Group Discussion(Week 10): 5%<br />Blended Learning Task - Synonym Differentiation(Week 2-10): 15%<br />iPeer Evaluation(Week 13): 5%<br />Attendance and Participation: IDK, but she records it for some reason<br /><br />I honestly have no idea how harsh or lenient she grades, given that she hasn't graded anything besides the midterm throughout the whole semester, will update once final grades are released<br />EDIT: Well, it looks like she gave me an A. Have no idea what the grading criteria was but can't argue with that; given how much work I put into this course I'd say it was deserved.",
            "comment_workload": "Really should be worth 4 credits due to heavy workload for a CC course, literally has every type of assignment except for a final exam <br />Every week where a new subunit was taught has a pretty lengthy Canvas quiz involving multiple choice, complete-the-sentence, sentence formation, and essay response. Don't bother trying too hard on those because they're graded on completion and as far as I know she never checked anyone's answers<br /><br />The extended topic group discussion is a 15 minute Zoom recording of a group of 5 students talking about their thoughts on a specific topic from Unit 1; this is also graded on completion so just talk about something relevant to the topic and you'll be fine<br /><br />One of the first group projects of the course is a &quot;Corpus-based Synonym Differentiation task&quot; where you and a partner are assigned two Chinese phrases that are &quot;synonyms&quot; of each other and you have to use a big data website called BCC to find trends in how the words are used. Each group of 2 can decide on which word they want to choose, and each word is automatically allocated to a date between Week 2 and Week 10 where you and your partner give a 7-10 minute oral presentation to the class of your research. Generally, the harder synonyms to differentiate were placed near Week 10 so those who had to choose harder words had more time to prepare. <br /><br />The midterm comprised of a listening portion where you answer questions based from an audio recording, and a grammar portion with generic questions like fill-in-the-blank, sentence rearrangement, translation between English and Chinese, and multiple choice. This midterm requires you to go back to everything in Unit 1 and memorize pretty much all of the grammar and vocabulary, so studying for it takes up a lot of time. Record the multiple-choice and complete-the-phrase questions in the Canvas quizzes as they will be similar to the midterm exam<br /><br />The first oral presentation was rather inconveniently placed right before the midterm examination, meaning that you had another task to practice for while studying for the midterm. It's basically a 3-4 minute individual speech about your thoughts of one of the Unit 1 topics. Note that you are not allowed to bring a script or outline with you when delivering your speech, although you also have to submit a copy of any material you used to prepare. You get to choose what topic you want to talk about, given that it's still available (first come first serve basis). <br /><br />This course's final project is a Group Oral Assessment where you alongside the same group of 5 you talked with for the Zoom meeting host a &quot;mini-forum&quot;, or interactive discussion, about a specific topic from Unit 2. Each person is expected to introduce their thoughts on the topic as well as facilitate a 15 minute long discussion between your groupmates. Again, no physical script is allowed but for this assessment you're given 10 minutes before the forum to handwrite on a sheet of blank paper anything that may help you remember your topic. This assignment required much more time to prepare than the midterm or the first individual oral assessment (as expected), but at least it was finished before exam season. One more thing to add: Topics for the group discussion are randomly selected, but if your group gets allocated the Chinese buzzwords and gender equality topic, you may want to start practicing earlier than most people because it requires a really, really, really thorough analysis of Chinese culture and even going into local Chinese media. Try not to get this topic, and if you do, well good luck :P<br /><br />iPeer evaluation is an evaluation for each group member's involvement in the Group Oral Assessment, self-explanatory<br /><br />Overall, borderline CORE1404 level workload: lots of tedious work that you'll be forced to commit to a lot outside of class. If you're taking both CORE1404 and CORE1413 at the same time (which is quite a few international students), make sure to manage your time wisely or else the CLE will basically be your life for this semester.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}