{
    "error": false,
    "course": {
        "id": 3759,
        "subject": "CORE",
        "code": "1414",
        "name": "Elementary Reading and Writing for Non-Chinese Language Background Students",
        "description": "The course is designed for non-Chinese language background students who have learned Chinese for less than 50 tuition hours.It aims to equip students with Chinese reading and writing skills for daily and social purposes through a range of familiar topics. After successfully completing the course, students will have acquired a basic knowledge of Chinese characters, be able to identify information from simple passages,and write basic sentences to introduce themselves and describe their daily lives.",
        "categories": [
            "Common Core (C-Comm)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"CORE\" data-code=\"1412\" href=\"/review/CORE1412\" target=\"_blank\">CORE 1412</a>, <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1413\" href=\"/review/CORE1413\" target=\"_blank\">CORE 1413</a>, <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1415\" href=\"/review/CORE1415\" target=\"_blank\">CORE 1415</a>, CORE 1416, <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1421\" href=\"/review/CORE1421\" target=\"_blank\">CORE 1421</a>, CORE 1422, <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1423\" href=\"/review/CORE1423\" target=\"_blank\">CORE 1423</a>, LANG 1117, <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1121\" href=\"/review/LANG1121\" target=\"_blank\">LANG 1121</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1122\" href=\"/review/LANG1122\" target=\"_blank\">LANG 1122</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1123\" href=\"/review/LANG1123\" target=\"_blank\">LANG 1123</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1124\" href=\"/review/LANG1124\" target=\"_blank\">LANG 1124</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1125\" href=\"/review/LANG1125\" target=\"_blank\">LANG 1125</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1126\" href=\"/review/LANG1126\" target=\"_blank\">LANG 1126</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1127\" href=\"/review/LANG1127\" target=\"_blank\">LANG 1127</a> (prior to 2022-23)",
        "rating_content": 4.67,
        "rating_teaching": 4.67,
        "rating_grading": 3.67,
        "rating_workload": 3.33,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 453,
                "name": "ZHOU, Tong",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "CspOuVlR178b9QX5fSPvHHCGCsjWQcrO",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 453,
                    "name": "ZHOU, Tong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hkust.t",
            "date": "Jan 13, 2023",
            "title": "",
            "comment_content": "Chinese Character Introduction<br />Self-Introduction<br />Identity<br />Describing Appearances<br />Number and Address<br />Time and Date&nbsp;&nbsp;<br />Daily Schedule<br />Shopping<br />Dining<br />Direction and Transportation<br />Hobbies<br /><br />- You will not be required to learn how to speak, so it depends on you whether you want to put that extra effort. <br />- The content is really heavy. You will be required to learn 250+ characters. It is definitely not a course for beginners. Some people in the class will have a basic understanding, most will be already at an intermediate level.",
            "comment_teaching": "Mandy cares a lot about her students. She is always available, even out of her office hours and talks clearly most of the times. <br />However, during class she goes a bit fast on the content, maybe because she is asked to cover too much from the department.",
            "comment_grading": "Grading not clear. <br /><br />During the semester you will only see your score in percentage and you won't know your letter grade until the end (after your final is graded). The professor was never able to give us directions about whether it would have been curved or not. The department wasn't clear with her. <br /><br />Actually, we never received any information about how the grade was calculated, even after it was posted on our SIS. As of my calculations, a 90% corresponded to an A-. I refer to my own calculations because the grades of our final WRITING exam was given as a scale of descriptors (and no direction about numeric correspondence was given):<br />- Exceptional <br />- Advanced<br />- Competent <br />- Emerging <br />- Entering <br />While for the READING we received a numeric score out of 20. <br /><br />The professor had given us the hint that the grade would have probably been absolute as of department decision. I assume that, by the end, they confirmed to go in this direction.",
            "comment_workload": "Few assignments are graded but the professor will provide different exercises on Canvas for you to test your knowledge (but won't impact the grade). Working in class is very important. she will add information that the book doesn't highlight. <br />Moreover, expect to work a lot if you are not used to Chinese characters. Learning how to write them, or even just how to recognize them, requires a lot of time and dedication (especially if you start with 0 prior knowledge). <br /><br />*speaking and listening seemed much easier! Start with that if you have never studied Chinese.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aqO5JVRf0GyY6PITt0k4KVil8t7xJ7Fr",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 453,
                    "name": "ZHOU, Tong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "finally77",
            "date": "Oct 21, 2022",
            "title": "",
            "comment_content": "Just a typical introductory Mandarin course for non-Chinese background students with less than 50 tuition hours. The course materials come from the textbook &quot;Discover China&quot; and worksheets provided by the teacher. <br /><br />If you have learnt Mandarin before, especially reading and writing, you would not have many problems achieving a satisfactory grade. However, be aware that most of the students have a sufficient Chinese background (eg. some students taking this course have lived in China for a few years or have already taken HSK) and still taking this course with literally no shame.",
            "comment_teaching": "Ms Zhou Tong's always willing to help out students and tries to make students understand the materials thoroughly. She really wants you to comprehend even the small things she says during the class and you wouldn't want to miss those.",
            "comment_grading": "I guess grading for this course is pretty fair.",
            "comment_workload": "There isn't much to do honestly, as you only have some Chinese character writing worksheets and canvas assignments to complete each week. <br /><br />Although if you have no Chinese learning background, then you would have to put some more effort and time into this course as the contents get more difficult as the course progresses.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wd2rapV2GDE3b9r3uv9Y1KI6tS4ZDK05",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 453,
                    "name": "ZHOU, Tong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fkriuk",
            "date": "Oct 20, 2022",
            "title": "",
            "comment_content": "The content is great. In fact, the course is based on the Macmillan Discover China 1 book. You will study 1 book unit per week (there are 2 classes a week). If you don't know Chinese at all, don't be afraid of that: the material is well structured, starting for very-very basics. In your group, there will be some people who have an understanding of elementary Putonghua. I'd say the majority of students. Be ready.",
            "comment_teaching": "Ms. Tong Zhou is a great teacher. She is always ready to help. She really wants you to understand the material.",
            "comment_grading": "Mid-term 30%<br />Final 40%<br />Canvas assignments 20%<br />Review of the course 10% (essay written in English at the end of the course)<br /><br />If you don't know any Chinese (except nihao), you need to work quite hard to get an A.",
            "comment_workload": "As for the workload, you have to study Chinese characters every week (~20 character per week). If the level you start with is 0 (like mine), you will spend ~3 h per week memorising the character strokes. Also, there are some reading and writing assignments after each class. They aren't time consuming (~10-20 min).",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}