{
    "error": false,
    "course": {
        "id": 3769,
        "subject": "CORE",
        "code": "1905C",
        "name": "Behavioral Foundations of University Education: Habits, Mindsets, and Wellness",
        "description": "This course will help students adapt to university life through advising, sharing and discussion, and applying the science of well‐being to enhance their personal and interpersonal development. It also aims to foster their self‐understanding and confidence as young adults who can fully enjoy their university education and career thereafter. The course has 3 components: Lectures and Seminars, Self‐Directed Experience, and Advising and Community Meetings. Lectures and Seminars will orientate students to their respective Schools/IPO, provide academic advices and equip them with the scientific bases of well‐being. Self‐Directed Experience will provide opportunities to develop mindsets and habits for students’ physical and social‐emotional wellness and personal enrichment. In Advising and Community Meetings, students will bring knowledge and skills together through reflection and discussion with peers and School/IPO advisors. Topics such as learning and time management skills, purpose of university education, and planning for personal and professional development will be covered. Graded PP, P or F.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "IDPO 1010",
        "rating_content": 4.33,
        "rating_teaching": 4,
        "rating_grading": 4.67,
        "rating_workload": 5,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [
        {
            "hash": "IHthVz79m7mnt5gRXqgqbISdLBjxwgmE",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "ian.lau",
            "date": "Aug 11, 2023",
            "title": "",
            "comment_content": "3 Zoom sessions about major selection, exchange, etc.<br />5 pre-recorded videos about psychological stuff with quizzes<br />1 AAAC group meeting and let AAAC know you know what you are doing and you understand what you need to do to graduate<br />2 Community meetings with program advisor<br />2 Reflection exercises<br />Do at least 9 hours of sports skill classes, and an additional 6 hours of either sports skill class or self directed workshops (15 hours in total)<br />1 Intake Survey<br />1 Psychological Wellness Survey<br />1 First Year Experience Survey",
            "comment_teaching": "Fair, mostly just informational stuff from powerpoints",
            "comment_grading": "You get a pass as long as you finish all required assessments~",
            "comment_workload": "Just a general mandatory informational course, no study required, make sure you finish all required assessments",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wP0oE6OKfDgh52ilT6AgDQFoYS0fRYtu",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "cutelilcat",
            "date": "Oct 27, 2022",
            "title": "Average course that isn’t really helpful",
            "comment_content": "The course comprises the following parts:<br />1) Lectures: There were 3 compulsory zoom lectures on 3 Mondays in September, and 5 videos we needed to watch on Canvas and complete relevant quizzes afterwards<br />2) Advising and community meetings: Meet with your AAAC once in the fall semester, and attend 2 community meetings in the spring semester<br />3) Reflection journals: To be completed in the spring semester<br />4) Self-directed workshops: Need to take part in 9 hours of sports skills class (1905C is given priority to reg sport skills class in spring), and 6 hours of self-directed experience, eg attending core1905-recognised zoom meetings. An advice would be to attend the workshops in summer first to lower your workload after sem starts.<br />5) Surveys: have some surveys to fill in with deadlines",
            "comment_teaching": "Not much teaching is involved, the zoom lectures are rather informative (eg about major selection). The Canvas self-paced videos were a little too slow, but they were short and so were not burdensome to watch.",
            "comment_grading": "Pass or fail, so won’t affect your GPA; but you must make sure you complete every compulsory item (even though there are make-up lectures from my understanding).",
            "comment_workload": "Quite low, since there are no exams, no studying is required. Just need to make sure to reserve time to complete the small tasks (eg the quiz after each self-paced video, intake survey…) and attend the lectures/ sports skills classes.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Hr05MsZ1CdMz9vRmu4gGhXCrTk4fW5BF",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "jesuisfatiguée",
            "date": "Oct 27, 2022",
            "title": "",
            "comment_content": "Lectures (20%)<br />1. Attend 3 compulsory real-time online (RTO) lectures in Fall 2022-23 <br />2. Watch 5 online self-paced lecture videos and complete quizzes with at least 80% of all questions answered correctly in Fall and Spring 2022-23 <br /><br />Advising and Community Meetings (10%+10%)<br />- 1 small group meeting with AAAC in Fall 2022 with the Educational Plan completed <br />- 2 community meetings in Spring 2023 <br /><br />Reflection Journals (20%)<br />- 2 reflection journals related to the 2 community meetings in Spring 2023 <br /><br />Self-Directed Experience Workshops (20%)<br />- Complete at least 15 hours, including at least 9 hours in Sports Skill Class <br /><br />Surveys <br />- Complete the following compulsory questionnaires/surveys: <br />(a)&nbsp;&nbsp;Intake Survey <br />(b)&nbsp;&nbsp;Psychological Wellness Survey DASS <br />(c)&nbsp;&nbsp;First Year Experience Survey (FYES)",
            "comment_teaching": "The zoom meetings gave us an overview on UST life. It was informative, but as it's held over zoom, it's definitely not engaging.",
            "comment_grading": "Pass or fail<br />&gt;= 90%",
            "comment_workload": "Very light workload, you just have to log in to zoom for the RTO lectures. For the assignments, you have to watch the self paced videos first in order to unlock the quiz. You may have to search for extra information online as not all the answers are covered in the videos.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}