{
    "error": false,
    "course": {
        "id": 3917,
        "subject": "CORE",
        "code": "1631",
        "name": "Music of the World",
        "description": "This course surveys various folk and traditional musics of the non-Western world using an ethnomusicological perspective which involves studying how people make, perform and consume music in their respective cultural contexts. Music cultures will be discussed individually in turn, while maintaining a cross-cultural or cross-regional perspective so as to discern underlying themes and processes common to many of them as well as differences and points of divergence that make each one unique.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230
        ],
        "prerequisites": "a passing letter grade in <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1401\" href=\"/review/CORE1401\" target=\"_blank\">CORE 1401</a> OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1402\" href=\"/review/CORE1402\" target=\"_blank\">CORE 1402</a> OR CORE 1403 OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1404\" href=\"/review/CORE1404\" target=\"_blank\">CORE 1404</a> OR LANG 1002 (prior to 2022-23)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4,
        "rating_teaching": 4,
        "rating_grading": 3,
        "rating_workload": 4,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1650,
                "name": "DUJUNCO, Mercedes Maria",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "rj98Lrr36AkzJwS43fGVtbPA1GO0GAWQ",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1650,
                    "name": "DUJUNCO, Mercedes Maria",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HU-HT",
            "date": "May 09, 2023",
            "title": "Please search HUMA 1100 for other reviews of this course",
            "comment_content": "Before Mid-term Break:<br />(1) Fundamental Issues<br />- What is Music?<br />- Ethnocentrism<br />(2) Aural Analysis<br />- Timbre, pitch, rhythm, dynamics<br />- Sachs-Hornbostel System (Very important!)<br />1. Aerophone<br />2. Chordophone<br />3. Idiophone<br />4. Membranophone<br />5. Electrophone (Not taught)<br />(3) Irish Music<br />(4) The Argentine Tango<br />(5) The Music of Brazil<br />(6) Silk and Bamboo music of Southern China<br />1. Guangdong yinyue<br />2. Jiangnan sizhu<br />3. Chaozhou xianshi<br />4. Kejia hanyue (Not taught)<br />5. Fujian nanyin (Not taught)<br />After Mid-term Break:<br />(7) Hindustani Music<br />(8) Music in the Islamic World<br />(9) Southern Asian Gong-Chime Cultures<br />1. Gamelan<br />2. Kulintang<br />3. Piphat (Not taught)<br /><br />10% Geography<br />40% Instruments (need to use Sachs-Hornbostel System)<br />50% Vocal or Dance Cultures<br />Before Mid-term Break, professor first taught cultures that are more familiar to us (Western traditional music + Chinese music)<br />After Mid-term Break, the topics taught are those that we may never have experienced before.<br />It is like learning a different language.<br />Attendance of lecture is required.",
            "comment_teaching": "Her teaching was fine, and she had shown to be knowledgeable.<br />She also occasionally picked someone and asked questions, and gave some pop quizzes too. So, make sure you review the PowerPoints after every lecture.<br />From the reviews from last semester (2022-23 Fall), people seemed to think her teaching was absolutely terrible. In my experience, she is not that bad. I assume someone complained to her and she had a change in attitude.<br />(Edit: I think she regret for allowing the course to be too &quot;relaxing&quot;. So, hopefully the next semester won't be her being like before again.)",
            "comment_grading": "Absolute grading, meaning you need a very high score in order to get A range.<br /><br />7.5% Attendance<br />7.5% Pop quizzes and online discussion<br />10% Assignments<br />25% Concert Review<br />25% Mid-term Exam<br />25% Final Exam<br /><br />My results:<br />Attendance: 100/100<br />Pop quizzes: 12/17 in total<br />Discussion: 10/10<br />Assignment 1: 39/40<br />Assignment 2: 25/25<br />Assignment 3: 10/10<br />Concert review: 94/100<br />Mid-term exam: 89.5/100 (Mean is meaningless because too few people)<br />Final exam: 97.5/100 (Mean is meaningless because too few people)<br />Grade: A<br /><br />Don't know how pop quizzes and discussion contribute to overall score.<br />Attendance is better than before now. If you missed the iPRS attendance, TA would also give you the attendance sheet to record your attendance.<br />The marking of the concert review is very lenient. She gave me 94 even though I made tons of mistakes in the review to the point that I was very embarrassed on giving this terrible concert review to her after I looked back my review.<br />The highest mark you can get in mid-term exam and final exam is actually 105/100 because there are 5 bonus marks.",
            "comment_workload": "There was only 1 online discussion needed to participate, and it was after one of the first few lectures. <br />3 assignments were given. Those were relatively easy to do if you follow the instructions and review the PowerPoint carefully.<br />For concert review, I needed to write more than 1500 words (Used to be 2000 words, but other students complained). She gave me 3 weeks after the concert to write. She also provided some reading materials and videos to help us write the review. Remember to send the draft to the professor so that you know what to improve.<br />Since there were pop quizzes and occasional questions during the lecture, reviewing PowerPoint is important. Although it may be annoying, at least you wouldn't need to review them just before the exam like someone who just learnt the topics.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}