{
    "error": false,
    "course": {
        "id": 3922,
        "subject": "CORE",
        "code": "1666",
        "name": "Photography",
        "description": "This course provides an overview of the various forms of Photography, explores the relationship between visual communication and art. The course will examine the collaborative process between light and graphic, concepts and skills. The increasing influences of images and trends from visual media will also be discussed.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230
        ],
        "prerequisites": "a passing letter grade in <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1401\" href=\"/review/CORE1401\" target=\"_blank\">CORE 1401</a> OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1402\" href=\"/review/CORE1402\" target=\"_blank\">CORE 1402</a> OR CORE 1403 OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1404\" href=\"/review/CORE1404\" target=\"_blank\">CORE 1404</a> OR LANG 1002 (prior to 2022-23)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4,
        "rating_teaching": 3,
        "rating_grading": 4,
        "rating_workload": 5,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1733,
                "name": "CHU, Shun",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "eJRtEMQShFjCs9obDTlHSxQ8ihkrpO8j",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1733,
                    "name": "CHU, Shun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "肚餓就是要吃飯",
            "date": "Jul 06, 2023",
            "title": "Not for newbies but good for experienced Photography lovers",
            "comment_content": "Own digital camera is needed. Tripod is not compulsory.<br />10% Attendance, 3hrs lsn each week, tick on paper for attendance. <br />Include 2 times outing photo class in CU and Tai Po Railway Museum and one Exhibition visit in HK Art Center. Outing are not compulsory to go as the prof dun rmb most of the students and won't take attendance during outing. Just be noted that outing is on Weekends.<br /><br />30% Individual Midterm Project<br />A series of 8 photos about your living neighborhood that can reflect the community's feature. With 600 words photography statement.<br /><br />20% Research Presentation (2 ppl a Group)<br />Essay and make ppt present to share a photographer. Basically will get full marks as long as u did a fair work present with useful information that show you did it seriously(he said it, but marks were not told)<br /><br />40% Final Project<br />A series of 10 photos about your best sides of Hong Kong. With 600 words photography statement.(Not sure did he really read it)<br /><br />Topic may change next sem.",
            "comment_teaching": "Birdy is a professional Photographer but may not be that good in teaching tho. He taught some basic photography skills and shared works of his own and other masterpieces. Other lessons were mainly outing and project presents.<br /><br />If you are newbie of Photography, I won't suggest you to take this course. You can ask Birdy for some tech skills suggestions if you got photography experience. However, it is hard to develop own 'photography sense' from 0 by having 3 hours lecture in classroom. You have to try to take more photos yourself, self-learning through Youtube may even be more useful for newbie.<br />Also, if you are not that passion to Photography, you will be super bored and waste of time for lessons.<br /><br />For non-locals, to be noted that Birdy PTH is bad and can't really speak. Most of the time he spoke Cantonese and bad accent English. He only spoke English for teaching section and comments on non-local photos IF HE RMB YOU ARE NON-LOCAL. He will interact and chat with students but always speak in Cantonese. If you can't understand Cantonese, your experience during lesson may be a little worse for comment and break section.<br /><br />For the lesson after outdoor shooting, Birdy will ask students to share the photos they took in class and ask others to comment. You dun have to if you dun want to share. You will enjoy it as a kind of interchange with Photographer lovers if you are experienced and really passion with it. In some how Birdy comments are a bit rude in attitude, but sometimes will provide useful suggestion for you to improve. He always say he welcome students to ask but just a bit rude while reply lol.<br /><br />For projects, Birdy's time management is so BAD. He spent too much time for comment and ask other comment to the project. Kindly suggest, better raise hand and request to present in advance, or else you have to wait another week to come and present. He won't rmb if you miss the lesson for presentation. If you didn't tell him at the beginning of next lesson, he won't rmb to give you extra section to present. Better told him asap when he move on to next topic if you haven't present yet. You may got a zero at the end when he realised you didn't present.<br /><br />For his expectation of projects-- be a series and related to topic with photography skills. Our final project is best side of Hong Kong, which is a subjective topic. Birdy will judge on you asking why is it the best sides and is it a series. Not only focusing on your Photography skills.Idea is more important The grading is subjective and tbh related to impression and how much Birdy rmb you. So Good Luck and chat more wif him lol<br /><br />Lastly, just treat it as an interest class for Photography lovers. Grading can't judge your Photography. Art should not be limited, it's just grade from Birdy, not from Art!",
            "comment_grading": "Only final grade will be told. None of the mark details of each project will be told. More likely to be Impression mark (he like to chat wif girls so...).But mainly good grade(at least B range) if you got experience of photography before with own sense of beauties. Birdy expected you to know how to make all photos look in 'series' while match with topic. Presentation skills in wording may help to link the photos to topic, try to show your Idea and sense of series during present to Birdy before he judge you. He expect to feel 'this is a series' just through seeing the 8/10 photos. Dun just try to link the photos through wording.",
            "comment_workload": "Late lesson from 6-9, better live hall if you take this course. Rmb bring some food and drinks to avoid death due to hunger.<br />Just 2 projects with photography statement and a photographer research. Not that big but just time consuming. Won't be a big deal if you originally play photography and with passion to it.<br /><br />Better take the photos earlier while semester started. Any type of photos, just save it and see whether you can use it in your project afterward. It was hard to take extra time for taking photos outside during midterm and final period, not even including days with bad weather. Fyi the final project weeks were cloudy and with non-stop rain last sem, some of the students can't take what they want due to the weather. So better take more photos with early preparation when the weather is good.<br />For procedure of making own project.<br />Brainstorm you idea of topics, then think what photos you want to take. The challenging part is how to make it a series. I would say idea is more important than your skills in some how. Of cuz you still need to show basic photography skills, don't take like snap. Just be clear with what you want to express and how it is related to topic in a series. For photography statement, put your photos in it during description or else it will look wordy and boring.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        }
    ],
    "composer": []
}