{
    "error": false,
    "course": {
        "id": 3929,
        "subject": "CORE",
        "code": "2261",
        "name": "What is Design and Why Design?",
        "description": "This course introduces what design is and why it is valued. Design is the purposeful act of creative problem solving. Students learn about fundamental design theories, principles, and methods through a project-based learning approach. Students then experience several stages of a creative design process. The process begins by asking students to identify real-world problems through social, business, scientific, and technological perspectives. To add specificity, students will be able to describe the behaviors and needs of social interactions, observe demographic phenomena, assess business viability, and identify and understand technological changes and impacts, etc. After defining a problem statement, students will be guided to generate creative solutions using brainstorming tools and creative thinking skills. Selected solutions will be presented in form of prototypes and open for user feedback. This course emphasizes the appreciation of the role and significance of design for our society.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230
        ],
        "prerequisites": "a passing letter grade in <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1401\" href=\"/review/CORE1401\" target=\"_blank\">CORE 1401</a> OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1402\" href=\"/review/CORE1402\" target=\"_blank\">CORE 1402</a> OR CORE 1403 OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1404\" href=\"/review/CORE1404\" target=\"_blank\">CORE 1404</a> OR LANG 1002 (prior to 2022-23)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 0,
        "rating_teaching": 0,
        "rating_grading": 0,
        "rating_workload": 0,
        "review_count": 0,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [],
    "composer": []
}