{
    "error": false,
    "course": {
        "id": 3925,
        "subject": "CORE",
        "code": "1669",
        "name": "Exploration of Chinese Calligraphy",
        "description": "Chinese Calligraphy is one of the most unique traditional art forms in Asia. This course will develop students' appreciation of various types of Chinese Calligraphy. The course provides practical writing workshops which can encourage students’ interest and experience the progress; deepen students’ understanding basic calligraphic skill and generate visual creativity. It prepares students having a better overview of Chinese culture.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230
        ],
        "prerequisites": "a passing letter grade in <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1401\" href=\"/review/CORE1401\" target=\"_blank\">CORE 1401</a> OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1402\" href=\"/review/CORE1402\" target=\"_blank\">CORE 1402</a> OR CORE 1403 OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1404\" href=\"/review/CORE1404\" target=\"_blank\">CORE 1404</a> OR LANG 1002 (prior to 2022-23)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3,
        "rating_teaching": 1,
        "rating_grading": 2,
        "rating_workload": 2.67,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1733,
                "name": "CHU, Shun",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "HViJEiIxJdS8AZO6avsn32YwsMjdgsqb",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1733,
                    "name": "CHU, Shun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "MYW_8210",
            "date": "Jun 07, 2023",
            "title": "You better be a Chinese caligraphy master, else you will get a C range or lower",
            "comment_content": "Don't want to copy again. <br />Basically practice standard script 楷書 and semi-cursive script 行書. Visit museum. Instructor will advise you to buy his suggested material (around $300), You can bring your own brush or paper, won't make any difference though. <br />Don't expect that you can learn how to write Chinese caligraphy in this course. This course is basically equivalent to practicing by yourself at home.",
            "comment_teaching": "The worst instructor I've seen in my life. His teaching is a piece of shit. Lecture is 2 hours, followed by 1 hour tutorial. Lecture is mainly about development of caligraphy, and about masterpieces. Instructor demonstrates a boring lesson perfectly. <br /><br />He always tell the students to not hesitate to ask questions, but he obviously feels annoyed when people really do so, and ask other students to answer your stupid questions, etc.<br /><br />I am a local student, but I can't understand what he is saying and what's his main idea. He always switched between English to Cantonese, causing an inconsistency for what he's saying. I really wonder if the non-locals can understand his speech. Sometimes he tried to speak Mandarin, but he needs students to guide him lol.<br /><br />But still, the attendance are high, because it is counted towards the grading. I still get a C even though attended every lessons.<br /><br />In the tutorial, you will bring your own brush and practice writing. Instructor won't 'teach' you, he would just put the masterpiece on canvas and tell you to imitate the writings. <br />I've never given a E on any course, he managed to do so, good job!",
            "comment_grading": "10% attendance<br />30% mid term project<br />40% final project<br />20% learning portfolio (sketchbook+digital version)<br /><br />But these information is not important, because you won't know any of your marks. So he can give any grade he wants lol.<br /><br />I get a C finally. I appreciate his generosity for not giving me D or F. <br /><br />If you try this course because you have experience in primary school, I promise you can get similar grade.",
            "comment_workload": "Basically the workload is from the learning portfolio.<br />Another workload is to waste 3 hours per week to listen to his boring lecture for attendance. <br />PS: After you've finished your portfolio, he will tell you that you don't need to submit the sketchbook version, only need to submit the digital version on canvas.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TwTBvDQ8tUBxoXCaGavlgVruMIzInvTN",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1733,
                    "name": "CHU, Shun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Lato",
            "date": "Jun 08, 2023",
            "title": "Beginners DON'T choose",
            "comment_content": "Lecture:<br />Calligraphy History <br />Masterpiece Study<br />Standard script 楷書 &amp; Cursive script 行書 (mainly)<br /><br />Tutorial:<br />Practical writing<br />(see others)<br /><br />You have to buy materials yourself, around $300, because the 宣紙 cost around $180 (a lot), others are not expensive.&nbsp;&nbsp;開紙刀 is mentioned but never used, no need to buy in fact",
            "comment_teaching": "Not a good experience at all<br /><br />The instructor was rude when he was answering some questions, feel like he was impatient<br /><br />This course supposed to be taught in English except the Chinese characters and some terms were pronounced in Chinese, but the instructor always speak in Cantonese, and then English , so the lessons are alternately Cantonese and English. If you can't understand Cantonese, don't choose this course<br /><br />You need to practice writing in the 1hr tutorials, the instructor showed some masterpieces on the screen and asked you to follow, no demonstration or instruction, he just walk around to observe students' works, nothing difference to practicing at home<br /><br />Boring teaching at all, don't choose as cc course",
            "comment_grading": "1. 10% Attendance <br />2. 30% Mid-term project&nbsp;&nbsp;(Produce a piece of standard script 楷書 in class)<br />3. 40% Final Presentation (Create a set of standard script 楷書 or cursive script 行書 calligraphy artwork in large and small sizes. (In class &amp; Homework))<br />4. 20% Learning portfolio (A journal that reflect one’s own learning progress, observations, and ideas<br />during the semester, written in hard copy and then scan it and upload in soft copy)<br /><br />NO&nbsp;&nbsp;marks were released so you cannot know his grading criteria<br /><br />The project accounted for majority of the grading, if you know nothing about Chinese calligraphy, just don't choose this course because there were many students with rich experience in calligraphy, you won't write as pretty as them in a few months",
            "comment_workload": "Depends on your experience<br /><br />For beginners, you may have to spend many time to practice writing<br /><br />Remember to write the portfolio every week, otherwise you may forget the content taught before",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zoHATIqPtftsbyHNPJ3KHeRIry65X4GW",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1733,
                    "name": "CHU, Shun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Mario Bus",
            "date": "Jun 06, 2023",
            "title": "白老鼠一名，缺乏相關經驗者慎入",
            "comment_content": "以下內容複製自Syllabus文件<br /><br />Course Description<br />Chinese Calligraphy is one of the most unique traditional art form in Asia. This course will develop students'<br />appreciation of various types of Chinese Calligraphy.<br />The course provides practical writing workshops which can encourage students’ interest and experience the<br />progress; deepen students’ understanding basic calligraphic skill and generate visual creativity. It prepares<br />students having better overviews of Chinese culture<br />Intended Learning Outcomes<br />Upon completion of this course, students are expected to be able to:<br />1. Understand a major Chinese art form<br />2. Apply knowledge and technical skills of brush work and styles of Chinese calligraphy<br />3. Analyze the development of calligraphy through Chinese art history and the influences in the society nowadays<br />4. Create Chinese calligraphy artwork in a few styles and varies sizes<br /><br />Course Schedule &amp; Outline<br />Week Date Topics Briefly outline what this topic will cover<br />1 Feb 6 Course Introduction Course briefing. Eg, Contents / Assignments / Final<br />Presentations<br />2 Feb 13<br />Introduction of Chinese<br />Calligraphy<br />(History / Style)<br />What is Chinese Calligraphy?<br />Learning from Masterpiece (Case study)<br />(Concepts and Techniques)<br />3 Feb 20 History, development<br />Basic ink art skills &amp; philosophy<br />Ink writing skills demo / Practice<br />Standard script 楷書 &amp; semi cursive script 行書<br />4 Feb 27 Practical Workshops<br />(Grid / bylines)<br />Experiment with calligraphic materials.<br />Paper/ Brush/ Ink ...etc. (Grids)<br />(Checking Learning Journal progress)<br />5 Mar 6 Practical Workshops<br />Review<br />Analyze and review the works of students, prepare<br />Midterm project<br />6 Mar 13 Midterm project Produce a piece of standard script 楷書 calligraphy<br />artwork (Large sizes) in class.<br />7 Mar 20 Midterm project (critique) Works critique and discussion<br />8 Mar 26<br />Sunday<br />HK Art Museum<br />10am – 12:30pm<br />Appreciate how calligraphy interpret and present in<br />the museums<br />9 Apr 3 Semi cursive script 行書<br />(Demo)<br />Masterpiece study &amp; practice<br />Reviews of Visits &amp; Learning Portfolio<br />10<br />Apr 6<br />Make Up<br />For Apr 10<br />Running Script 行書<br />Application of Calligraphy and<br />Typography<br />Case Studies and analyze the urban typographic<br />design for Learning portfolio<br />*5 research samples of ( Applied Calligraphy )<br />Eg. Shops / Neon lights / Walls deco/ Ads...etc<br />Put them in the Learning Portfolio.<br />Mid Term Break (5-11)<br />11 Apr 17<br />Learning portfolio Submission<br />Review Course &amp; SFQ<br />Preparations for Final Project:<br />. Rules to follow<br />. Format / Small scale / layout / bylines....etc<br />12 Apr 24 Final Project:<br />(in-class) submission- large size<br />May 1 Holiday<br />Submission:<br />Soft Copy of {Small Scale} project submit to CANVAS<br />3<br />May 2<br />(T)<br />Final Project Critique<br />(Only T2)<br />Bring your {Small Scale} works to class for critique<br />Works critique and discussion<br />13 May 8, 9<br />Final Project Critique<br />(T1+T2)<br />Bring your {Small Scale} works to class for critique<br />Works critique and discussion",
            "comment_teaching": "新舊曆不分 :|<br />新曆四月即舊曆三月，但是導師要求同學在by-line(文末小字)中以新曆月份look-up「雅稱」，實屬不當",
            "comment_grading": "白老鼠一名，在這個全新設立的科目中信心滿滿，結果只得C+<br /><br />以下內容複製自Syllabus文件Assessment部分<br /><br />Assessment<br />Assessment Tasks Description<br />Attendance<br />Course participation<br />10%<br />Students arriving 10 minutes after the beginning of each session will be counted as late.<br />Being late or leaving early for more than 10 minutes twice will be counted as one absence.<br />Mid-term project<br />30%<br />Produce a piece of standard script 楷書 calligraphy artwork (Large sizes) in class.<br />Final Project<br />40%<br />Create<br />a piece of semi-cursive script 行書 in large size (In-class submission)<br />a piece of semi-cursive script 行書 or standard script 楷書 in small size (Homework)<br />Submission Deadline: May 1<br />Learning portfolio<br />20%<br />The journal should reflect one’s own learning progress, observations, and ideas during the<br />semester. (Eg, Observations, finding on related subjects, like words, street signs, fonts<br />design...etc.)<br />Suggest making at least 2 pages per week.<br />(Checking Learning Journal progress on week 4)<br />Submission Deadline: Apr 17",
            "comment_workload": "要製作Learning Portfolio，只要「四周遊歷」，哈哈",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}