{
    "error": false,
    "course": {
        "id": 3773,
        "subject": "DASC",
        "code": "2210",
        "name": "A Survey on Big Data in Science and Society",
        "description": "A survey on data collection and applied data science in different areas of science and in the society as a whole. Examples and case studies will be taken from physics, chemistry, life science and ocean science as well as other disciplines that are heavily data driven. Graded DI, PA or F.",
        "categories": [],
        "website": null,
        "credits": 1,
        "semesters": [
            2210
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 5,
        "rating_workload": 5,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1637,
                "name": "NG, Krates",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "ZgRloX1vUZIEb9wa3A5GrToZlS8gUkqe",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1637,
                    "name": "NG, Krates",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ccccccc",
            "date": "Oct 28, 2022",
            "title": "Nice course",
            "comment_content": "This is a totally new course, because DASC is a fresh major this year. Through the whole course, we can learn a lot of basic knowledge about data science. As to me, this major is more closed to Data Science than DSCT maybe. The whole course is more similar to a meeting and we will share our ideas with other members. By studying and analyzing case, we can know what data science is and what data scientists do. The instructor also introduced 3Vs and Readme file and more things related to data science. And in the last several courses, we watch the video about the final project. There are two subjects, and we need to choose one of them to complete.<br />a. https://youtu.be/6bMvxmHAHr8<br />b. https://youtu.be/ExPyZL8R_18",
            "comment_teaching": "The instructor is pretty nice. He is humorous and he can attract every member of the class. Also, he is patient in every aspect. He will answer the question online and in the classroom. Meanwhile, we can communicate with him about nearly everything including data science or more other interesting things.",
            "comment_grading": "P/F Complete the paper carefully, you will pass the course. Also, attendance is necessary.",
            "comment_workload": "none.&nbsp;&nbsp;it's a simple PF class. Only 1.5 hours per week and it is more similar to a seminar.&nbsp;&nbsp;As to me, I am a physics student and I attend this course. This course is quite easier than those complex physics courses. You don't need to do everything after the class. Just attending the class is enough. As long as you complete the final paper carefully, I believe you can get a great mark.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        }
    ],
    "composer": []
}