{
    "error": false,
    "course": {
        "id": 281,
        "subject": "ECON",
        "code": "3024",
        "name": "Managerial Macroeconomics",
        "description": "This course modifies and extends the standard models studied in introductory macroeconomics course (2123), highlighting the role of expectations in determining the aggregate output, the inflation, and the asset prices. The course consists of two parts: (A) lectures on the models and their applications on the economics issues such as monetary and fiscal policies, financial crises, and exchange rate policies; and (B) group research projects undertaken by the students to apply macro models, statistical and econometrics tools to analyze a real-world question of their pick, in order to gain better understanding of the models and to practise the skills on problem solving, team-work and presentation.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"ECON\" data-code=\"2123\" href=\"/review/ECON2123\" target=\"_blank\">ECON 2123</a> AND <a class=\"course-link\" data-subject=\"ECON\" data-code=\"3334\" href=\"/review/ECON3334\" target=\"_blank\">ECON 3334</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"ECON\" data-code=\"3123\" href=\"/review/ECON3123\" target=\"_blank\">ECON 3123</a>, <a class=\"course-link\" data-subject=\"ECON\" data-code=\"3143\" href=\"/review/ECON3143\" target=\"_blank\">ECON 3143</a>",
        "rating_content": 3.67,
        "rating_teaching": 3.5,
        "rating_grading": 3.5,
        "rating_workload": 3.92,
        "review_count": 12,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 147,
                "name": "LU, Yang",
                "count": 10
            },
            {
                "id": 1045,
                "name": "FOK, Pik Lin",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "Xm6yQLxQg7gzlhyvFph7psrL1QupbEG5",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 147,
                    "name": "LU, Yang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Testing1234",
            "date": "Jul 28, 2023",
            "title": "Finding good group mates is the most important thing",
            "comment_content": "1. Monetary Policy<br />2. Extended IS-LM<br />3. The Crisis<br />4. Financial Markets and Expectations<br />5. IS-LM-PC<br />6. Exchange Rate Regimes<br /><br />There aren't many topics covered in this course, as the project is the key component of this course.",
            "comment_teaching": "I'll split the review in 2 parts.<br />For the lecture, professor Lu delivers the content clearly. She raised different examples to help us understanding the topics. Topics covered in this course are closely related to daily life, and professor Lu teaches them in a clear and good way.<br />For the project, professor Lu also helps a lot. She provides detailed suggestions and feedback about how to work on the project. I'll mention more about the project in the Workload part.",
            "comment_grading": "There are 2 grading schemes, the one with higher score will be chosen.<br />1. 50% midterm + 50% project<br />2. 100% project<br />The grading for the project is further evaluated as follows:<br />Research plan &amp; reading list 10%<br />Proposal Presentation 10%<br />Draft term paper 20%<br />Paper Presentation 15%<br />Response/Revision Presentation 10%<br />The term paper 20%<br />Peer evaluation by group mates 15%<br /><br />If you want good grades, FIND GOOD GROUPMATES!!<br /><br />I'll mention more about the terrible experience of this project. In short, I spent 200% effort to work on the project and secure a good score. The score of all components of the project are above mean, and I scored 93 in the midterm (mean 67.86, UQ 85, LQ 58, max 96). Overall I got an A.",
            "comment_workload": "I give a &quot;C&quot; for workload because it's the average score if you have good or bad groupmates. If you have good groupmates, you guys can work together and share the workload, then it will be an &quot;A&quot;. If you have terrible groupmates, who don't show up in EVERYTHING, the workload will be an &quot;E&quot;. <br />I strongly recommend you to find groupmates with good Econometrics background. In this project, you'll have to find data, build models, run regressions, do analysis etc. Having good grades in ECON3334 isn't a must, but I'm sure it does help.<br /><br />If you have bad groupmates, you can treat you're taking Econ4670 and you have to write a term paper by yourself.<br /><br />I don't wanna blame my groupmates anymore, I gave up on them for a long time. The actual situation is 10 times worse than what I've said here. So please bare in mind: FIND GOOD GROUPMATES!!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "50imlefxiuFfmhHzhE8FQjQDCb0Ku4jG",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 147,
                    "name": "LU, Yang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "economist",
            "date": "Feb 22, 2020",
            "title": "Too much on project and too little on economic theory",
            "comment_content": "I have put the highlights next to the topics<br />1) Monetary Policy (Mcs, liquidity trap i.e. zero interest rate, indifferent between holding bonds or money)<br />2) Extended IS-LM (Mcs, SQs, LM curve flattens as it reflected target interest rate)<br />3) Crisis (MCs, SQs, leverage ratio, debt ratio, MBS)<br />4) Financial Market Expectation (SQs, discount cash flow problem)<br />5) Philips Curve (MCs, SQs, original vs modified curve)<br />6) ISLMPC (LQ in Final, prepare to do some training in it!)<br />7) Exchange rate (cut in this semester due to protests)",
            "comment_teaching": "Not good. <br />Unclear explanation. The people in the classroom always get confused.<br />The powerpoints are too neat. More words should be given for clarifications.",
            "comment_grading": "(Project score not released) <br />Better than expected given that few people in the class.<br /><br />Scheme1: 100% Project<br />Scheme2: 50% Project + 50% Exam<br /><br />1. The project is very important. Make sure you have great groupmates.<br /><br />2. The professor would not expect too much for the research report as you are not the Ph.D. students. Following her advice and guidelines would save your grade.<br /><br />3. Make sure you write long comments for other groups in the presentation. Bonus marks are granted. My group gets two bonus points due to this policy.",
            "comment_workload": "Quite large as you need to work for a group project for a research report. I spend 70% time on the project and 30% time on the exam.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wWVkJXQbq1xEihVAmVgl9BmYh4sGxbfz",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 147,
                    "name": "LU, Yang",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Sun",
            "date": "Jan 02, 2017",
            "title": "Worst ECON final exam I have ever taken",
            "comment_content": "1. The Goods Market, GDP, Price and Inflation (Chapter 2.1, 2.3) <br />2. The Money Market, Nominal and Real Interest Rates (Chapter 14.1) <br />3. Labor Market and Unemployment Rate (Chapter 2.2) 4. Financial Markets, Asset Prices and Expected Present Discounted Value (Chapter<br />14.4, 15)<br /><br /> 2. Expectations, Consumption and Investment (Chapter 16) <br />3. The Money Market (Chapter 4, 5.2, 17.1) <br />4. The IS-LM Model (Chapter 5.3) <br />5. Expectations and the IS-LM Model (Chapter 17.2, 17.3) <br />6. Expectations and Financial Markets (Chapter 15.1, 15.2)<br /><br />1. Openness in Goods and Financial Markets (Chapter 18) <br />2. IS-LM Model in an Open Economy (Chapter 19, 20) 3. Exchange Rate Regimes (Chapter 21)<br /> 4. Expectations and Currency Crisis (Chapter 21)<br /><br />1. Financial Crisis (Chapter 9) <br />2. China’s RMB exchange rate and current account imbalance (notes)<br /><br />She skipped too many lessons this semester and thus content is also not much&nbsp;&nbsp;<br /><br />Basically nothing difficult. As long as you have taken ECON 2123, no problem for understanding the course content.",
            "comment_teaching": "Useless.<br /><br />You do not need to attend her lecture and also the tutorial.<br />She and TA cannot make you understand the content.<br /><br />Read the textbook yourself.",
            "comment_grading": "Final is everything.<br />But the final is rubbish.<br />Only 2 long questions in final.<br /><br />Only 2 student can solve one of the LQ, which is a DCF problem as the way she write the question is too confusing but the question itself is very easy.<br /><br />I got a very low score for the long question.<br /><br />I got almost full mark for midterm.<br />Above mean for assignment.<br />Final above mean 0.6 SD <br />Got a B+.(First time no A-range in ECON courses.)<br />Actually, the grading is fair .<br />But her way to write final is meaningless. Not exam on ECON knowledge and logic. But how to understand her writing style.",
            "comment_workload": "No Workload.<br /><br />Even hing zone than a 3-credit courses",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "i3PFsSwdWAjUm2AjOpbeSaoVpIPNhnKl",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 147,
                    "name": "LU, Yang",
                    "rating": 0
                },
                {
                    "id": 1045,
                    "name": "FOK, Pik Lin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Happypig375",
            "date": "May 08, 2023",
            "title": "Just form a group of ECON3334 A rangers then you can learn nothing and get A range lol (fuck this grading)",
            "comment_content": "The lecture topics themselves were highly related to real life. But too much focus on the project which isn't even purely about macroeconomic theory.<br /><br />A for lecture content, C for project, take B as average.<br /><br />Syllabus here: https://econ.hkust.edu.hk/sites/economics/files/courses/ugcourses2223/ECON3024.pdf",
            "comment_teaching": "The lectures (Prof Lu Yang) and tutorials (TA Astor Fok) were helpful. But the tutorials, iPRS questions and group exercises were far more helpful to the exam than the lecture content which included too much off topic information.&nbsp;&nbsp;It's just that the professor included lots of other content that I wasted time studying especially the complex stocks equations that did not matter in the end despite &quot;everything will be in the exam&quot;. But those are minor problems. The main gripe I have with this course is regarding the assessments especially the group project.",
            "comment_grading": "UPDATE: My groupmates gave me 4/15 in peer eval and the prof won't review any scores. I encourage you to give your groupmates the lowest of lowest scores because there is zero checking against evaluations that only aim to harm other people. 🫠🫠🫠<br /><br />+1sd in midterm exam, get C-, &quot;better grade than you think&quot; (said by professor to me) my ass<br />50% exam + 50% project or 100% project<br />My grades are here. https://cdn.discordapp.com/attachments/876155439476277309/1113144283160129617/my_grade.png<br />Syllabus here. https://econ.hkust.edu.hk/sites/economics/files/courses/ugcourses2223/ECON3024.pdf<br />In what world does +1sd in exam and a few points below mean in project get me a C-?? And this is a 4cred course. 4cred C-. Fuck.<br /><br />I hate that feedback were limited unless you specifically emailed the professor. The professor won't give helpful directions regarding the exam, while she was unexpectedly lenient in giving away project directions even for some groups' presentations for the next day. Officially in consultation hours, the directions about the presentations won't directly help the project marks, and the only reason for why project marks were low was &quot;not as good as other groups&quot; without clearly listing what major points to improve that directly help the marks. Unofficial emails were somehow much more helpful. It was a mess trying to figure out what the professor wanted even if we thought our work was enough. For such a large part of the grade, more specific directions would have been much preferred, especially for the breakdown of each grade. Despite sharing the proposals, draft papers, and presentations from other groups, the professor somehow does not want to share how the merit points were given to the best group and what criteria constituted meritable comments. Even for the &quot;recommended papers&quot; in the resource repository, no associated marks were listed to judge if the paper really did score the best in its semester. Trying to follow it ended up with marks less than satisfactory.<br /><br />Exam time was too limited for 50% of the grade and it was rushed. It was not enough to offset the risks involved in the group project. The claim that &quot;the exam won't lower your grade and will only improve your grade&quot; is unverifiable without past data and what past comments for this course does have from outside sources (disregarding what was included by the professor since those are obviously hand picked by the professor to be biased towards agreement), is that only relying on the research project will land a poor grade (B- or below). There were just too little emphasis on economic theories and too much on a group project which has little to do with the lecutre or tutorial content themselves, instead much more related to ECON3334.<br /><br />The course overemphasised on the project with all the shared information from the other groups and yet underemphasised the topics covered using 2 whole months with all the unshared recordings which only constitutes 50% of the grade. I understand the professor's perspective of ChatGPT making exams and intaking existing knowledge obsolete but we don't need 3 required courses for economics writing and research - ECON3024/3700/4670 especially this one which heavily depends on the groupmates assigned therefore cannot even fulfill ECON4670. (This is also what I hate about some of the 4000 level courses but at least they are not required courses and can fulfill ECON4670.) We also do not need a parallel system of research courses specifically required by the Economics department along the UROP system. It's great that ECON3700 will replace ECON4670 but it should have integrated with this required course better.<br /><br />By the way, if the professor had not put too much stress on the group project, more students would have had time to raise the SFQ response rate (7 out of 41 at the time of writing) for her. How ironic.<br /><br />Before you start the course, you should probably look at the mind maps and final papers in the resource repository here first https://www.notion.so/Resource-Repository-46c016fc53134d919c1679fd38672376",
            "comment_workload": "At the last month, hours per meeting long into night, a few days per week for the project. But not much for other parts of the course.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hsKmypyFFFEtbirNdJIUHM7WpRtrwwJH",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 147,
                    "name": "LU, Yang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "雪特",
            "date": "Dec 04, 2020",
            "title": "",
            "comment_content": "Tentative Topics:&nbsp;&nbsp;<br />1.The modern conduct of monetary policy<br />2.Financial crisis and the limitations of policies<br />3.Phillips curve and the role of expected inflation<br />4.IS-LM-PC model<br />5.Exchange rate regimes<br />6.Financial markets and expectations<br />7.Consumption, investment, and expectations<br />8.Technology progress and unemployment",
            "comment_teaching": "I would say the teaching is average in ust since many prof arent very good at presenting their content anyway. Although the contents are clear, I feel each of the topics was only briefly mentioned.",
            "comment_grading": "I would say the grading is not very good since I got a really good final score (88.975%) while was only given B+ since the class size was small and the stupid A range distribution had to stick 20% of the class. Meanwhile I appreciate the grading scheme where we can have 100% project or 50% project and 50% final exam. This really alleviate our workload (unless your group-mates were too shit).",
            "comment_workload": "As mentioned the grading scheme can have 100% project or 50% project and 50% final exam. The workload can vary depending on what groupmates you have. Mine were excellent, each of us did a fair part of the project and easily secure B+. However to get A range you probably have to either work the shit out of your final exam or be No. 1 in group project or get an average project score but get those bonuses points.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lWlrSyqSxIFof1x7EBuIyWObrhbhUf2Y",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 147,
                    "name": "LU, Yang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "swaggerjaggerry",
            "date": "Jun 08, 2019",
            "title": "50% Midterm 50% Project !!! (or 100% project)",
            "comment_content": "Midterm:<br />1. Monetary policy<br />2. Phillips curve<br />3. IS-LM-PC model<br />4. Exchange rate regimes<br />5. Financial markets and expectations <br />(extension of econ 2123, used same textbook)<br /><br />Not tested:<br />6. Financial crisis<br />7. China’s RMB exchange rate<br />8. Technology progress and unemployment",
            "comment_teaching": "At the start, it was pretty useful coming to class because things were relatively understandable and probably kind of fresh from your memory of studying econ 2123, or just general econ stuff.<br /><br />Towards the middle, she was just racing through the material and we barely understood what she was talking about in class. The content got harder and harder, so it's advisable for you to pre-read/pre-study the chapter before going to class, otherwise it's going to be a waste of your 1,5 hours.<br /><br />For group project, the team can choose any econ-related topic - please go to her consultation sessions and book an appointment because she will really give you the sense of direction whether you're going for the right topic or not. Throughout the whole project progress, update her on your findings and see if she has any comments from that and build on her suggestions or improve from her criticisms.",
            "comment_grading": "Midterm 50% or 0%<br /><br />Group research project 50% or 100%<br />- Project topic and abstract 0%<br />- Research plan &amp; reading list 5%<br />- Draft term paper 10%<br />- Two presentations (+interactions) 20%<br />- The term paper 10%<br />- Peer evaluation by group-mates 5%<br /><br />optional: group comments for other group's research proposal and term papers (easy bonus points given, so put effort in making these)<br /><br />Midterm stats:<br />Average 66.56<br />Median 70.5<br />St dev 20.18",
            "comment_workload": "Group project EXTREMELY matters, so be sure to get good teammates and choose a good project topic to work with. Work very very hard on this if you flunk your mids so you can secure an A range.<br /><br />Other than that, no workload at all",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MKMYlOaR28Cxay4vAYLuF33tqOMaGDlj",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 147,
                    "name": "LU, Yang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Szczesny",
            "date": "Jan 18, 2019",
            "title": "A brand new syllabus was introduced in 18-19 FALL",
            "comment_content": "In 2018-19 FALL, a whole new syllabus was introduced by Professor Lu<br /><br />Only mid-term and group project, no final exam.<br /><br />This course was divided into two parts:<br />Pre-midterm and Post-midterm<br /><br />Content covered in the pre-midterm period is an extension of ECON2123, which covers:<br /><br />1. Monetary policy<br />2. Phillips curve<br />3. IS-LM-PC model<br />4. Exchange rate regimes<br />5. Financial markets and expectations<br /><br />No memorizing is required, some students may find it hard to follow at first, and review after lessons are required. After you understand the logical flow behind the concepts, things should be easy.<br /><br />The mid-term coverage was up to topic 5, while the remaining three topics were meant to give some insights to students for the group project, as mentioned by Professor Lu.<br /><br />6. Financial crisis<br />7. China’s RMB exchange rate<br />8. Technology progress and unemployment",
            "comment_teaching": "Professor Lu was simply rushing throughout the pre-midterm period due to the tight schedule. The pace was really hard to follow, and we were like attending a MBA lecture LOL, everyone of us look utterly puzzled and confused after every lecture. The material is not straightforward and requires quite some time to digest, luckily we got lecture videos for revision.<br /><br />Professor Lu liked to illustrate the logic behind different concepts by drawing diagrams in class, that made the material clearer to us.",
            "comment_grading": "Since 18-19 FALL ECON3024 is the first ever semester to have the new syllabus implemented, everything is experimental. I guess that's why Professor LU is quite lenient this time in grading.<br /><br />The grading policy:<br />1. 50% midterm<br />2. 50% group project<br />- 5% research plan<br />- 10% draft paper<br />- 20% 2 presentations (Pren-tation as pronounced by Professor LOL) <br />- 10% final term paper<br />- 5% peer-evaluation<br /><br />I was honestly quite scared when I saw group project weighs 50%. That means your grade is highly depend on your project topic and of course, your group-mate.<br /><br />Midterm will be quite easy if you can thoroughly understand what Professor taught in class, the midterm was easier than expected, and I got 93/100 (Max:99/100; median: 72/100)<br /><br />There was two grading path that a student can choose:<br />50% midterm+50% project<br />or 100% project (risky option)<br /><br />Basically we have two chances to decide whether to shift the whole 100% to the project. If a student skip the midterm for any reasons, all the weighting are automatically shifted to the group project. The second chance is granted after the midterm result is released, Professor Lu let students have their grade wholly depend group project (of course that is a little bit unfair for students who study hard for the midterm).<br /><br />5-6 students in a project group, and the group should focus on a topic related to macroeconomics, which does not limited to the concepts taught in class. That's why you can still achieve a A range if you attend none of the lectures and only focus on the group project.<br /><br />Sometimes it was hard to judge whether Professor Lu was really appreciating your group's work or not, as she gave the similar comments to all group in the project presentation (like well done, good job). You thought you did a great job in the beginning stage of the project as professor gave you positive comments, and confident in shifting all the weighting to the group project. Then you may ruin your grade at last (that's my group-mates' case lol, project mean:33/50 max:40/50, my group:31/50)<br /><br />My final grade is A-<br /><br />Considering I got below mean in my 50% of grading, and I could still secure a A-, I think Professor Lu is very lenient in grading this time. My group-mates who shift all the weighting to group project (below mean) got B-.",
            "comment_workload": "If you are to decide shift all the weighting to the group project. There is no need for you to attend the class. The only workload from the course is the group project, however, the group project can be of heavy workload since the group has to submit a 3000-word report by the end of the semester. The group project requires quite a lot of effort and time to complete. But again, all-in group project is very risky and it's like betting (that means thrilling LOL)<br /><br />If you pursue the 50-50 path, you need extra effort to manage the midterm, if you are decent in economics and logical thinking, the revision for mid-term examination should not take more than 4 hours per topics, that means 20 hours in maximum.<br /><br />Overall speaking, the workload is medium to quite heavy.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aqW9BWpnCN5WJOHXrCOBYKoapGo5PF6V",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 147,
                    "name": "LU, Yang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Fiona",
            "date": "Jan 07, 2018",
            "title": "Not a bad choice",
            "comment_content": "The stuff this course teaches you could find most of them on the textbook minus the open economy part.<br />I have read some of the reviews before, apparently she has improved quite much, adding some real-life applications here and there.",
            "comment_teaching": "She was able to guide you through the content, pause to wait for questions and answer them after class.<br />But she did quite rush through the later half of the course, barely finish it so we didn't have a summary course.<br />The stuff she teaches differs a bit from the TAs. I recommend to stick to her way of understanding first.",
            "comment_grading": "Her way of writing the exams (eg: homework, final) sometimes could be very confusing, some part of the grading will depend on your comprehension.<br />All in all, I do think her grading is fair. got full marks in midterm and homework, top 5 in final, got A+. (total 60+ students)",
            "comment_workload": "Just two homework with midterm and final.<br />Though the homework is quite long, but it doesn't really take much time to write comparing to other courses.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EeriIepw84s73HF38Py1sYumy2frNIVP",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 147,
                    "name": "LU, Yang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MegaSprite",
            "date": "Jan 19, 2017",
            "title": "Short Review",
            "comment_content": "Materials are mostly based on the textbook.<br /><br />Could have talked more about how to use the theories as a tool in the real world applications",
            "comment_teaching": "Professor's English is good.<br /><br />Able to explain most of the points clearly.<br /><br />Given the contents of this course, her teaching could have been more intriguing",
            "comment_grading": "Though I got very good grade, I still think the assignments and exams are not well designed. More exercises could be provided to help us understand the materials. <br /><br />I was surprised to see the same homework question appear on the midterm exam paper, lol. Then I thought too much, trying to persuade myself that prof had made some changes to the original problem. So I misinterpreted the problem and got it wrong. If it were not for the kind TA, I would have got even lower marks in midterm. <br /><br />Fortunately, I got relatively high marks in the final so the final grade is satisfactory.",
            "comment_workload": "Only two assignments, most of the questions are based on the end-of-chapter questions on the textbook.<br /><br />Unfortunately, Prof got sick at the beginning, and we missed the in-class discussion, which might be very interesting.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IWSkNIEzq0wlZ8gimV4W2Tj0wL1XAwYy",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "doowkin",
            "date": "Jan 16, 2017",
            "title": "",
            "comment_content": "Interesting. but half of the contents are based on general macroeconomics, so it is not that hard.",
            "comment_teaching": "Need to concentrate in order to follow the class material. there is no ta session, except after the assignment and midterm. it is difficult to get help when needed",
            "comment_grading": "as there are not many student in the class, it is difficult to get an A.",
            "comment_workload": "there are two assignments, they are not hard, but they take some time to finish. but the ta does not even mark the whole assignments, but just the hard questions.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3v0Kr7pxYNp8nie95QAINy3vxuLVJ3qO",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 147,
                    "name": "LU, Yang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SKY",
            "date": "Aug 17, 2016",
            "title": "",
            "comment_content": "Honestly speaking the content has not much difference with the one studied before( Econ 2123), especially those parts talked about ISLM model or ASAD model, which you could find them familiar. To conclude, the main difference of this course is that adding an important factor into all those models: Expectation. And also this course mentioned a bit on Philips Curve.",
            "comment_teaching": "I would say she's quite passionate, but might be a bit slow paced especially in the first half, making she has to speed up in the later half to try finish her schedule. The notes are uploaded in advance and quite clear, though seems were made by publisher instead of herself.",
            "comment_grading": "The grading is hard to comment because the sample size is rather small, only 3x people in whole class. I scored full for all in-class exercises and homework, also around 0.5 SD above mean for mid-term(30%), final(50%)no score or stat disclosed, ended up B+.",
            "comment_workload": "Not much workload, basically just 2 problem sets extracted from textbook exercises. Then is mid-term and final. Even tutorials are not that compulsory if you think yourself can handle book chapter exercises perfectly.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yjCueDXKDoOl9sKkZZ6Czqxe9RBHZ6bJ",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Pan Xiaoyue",
            "date": "Dec 28, 2020",
            "title": "",
            "comment_content": "Tentative Topics:&nbsp;&nbsp;<br />1.The modern conduct of monetary policy<br />2.Financial crisis and the limitations of policies<br />3.Phillips curve and the role of expected inflation<br />4.IS-LM-PC model<br />5.Exchange rate regimes<br />6.Financial markets and expectations<br />7.Consumption, investment, and expectations<br />8.Technology progress and unemployment",
            "comment_teaching": "Clearly interpreted and easily understood. really nice professor",
            "comment_grading": "two grading schemes:<br />final 55% + project 45%<br />or final 100%<br />Not very good grading I think, we only get a median&amp; average at the final project, and get a B+ at last.",
            "comment_workload": "workload is not heavy since most of the workload came from the project which also means that there are lot of group meeting. And the due were little bit tense.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}