{
    "error": false,
    "course": {
        "id": 2258,
        "subject": "ECON",
        "code": "4124",
        "name": "Applied Game Theory",
        "description": "This course introduces the basic concepts of game theory, it emphasize on the unifying perspective that game theory offers to questions in economics, other disciplines, and everyday life. It will enable students to view social interactions as strategic games, to use game theoretic concepts to predict behavior in these interactions and to conceive of ways in which altering the game affects social outcomes.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"ECON\" data-code=\"2103\" href=\"/review/ECON2103\" target=\"_blank\">ECON 2103</a> OR <a class=\"course-link\" data-subject=\"ECON\" data-code=\"2113\" href=\"/review/ECON2113\" target=\"_blank\">ECON 2113</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"MATH\" data-code=\"4321\" href=\"/review/MATH4321\" target=\"_blank\">MATH 4321</a>",
        "rating_content": 3.92,
        "rating_teaching": 3.33,
        "rating_grading": 3.42,
        "rating_workload": 3.33,
        "review_count": 12,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 140,
                "name": "LIM, Woo Young",
                "count": 11
            },
            {
                "id": 1285,
                "name": "WU, Qinggong",
                "count": 1
            },
            {
                "id": 1286,
                "name": "ZHANG, Yi",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "N0Vt1LFq4DtSehdjAIH49WJ4hJuX2ly0",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 140,
                    "name": "LIM, Woo Young",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Dreamscometrue",
            "date": "Jan 27, 2019",
            "title": "",
            "comment_content": "由教你數number of strategy到game theory 既實際應用，內容上係幾有趣既。不過咁，由mt 開始你就會發現d野既難度幾何級咁上。每個case 望落一樣但實際處理係完全唔同。<br /><br />去到中段就用唔少數學，無啦啦會同你講set theory，又有d睇唔明既notation，總言之你對自己腦筋或者數學能力無過人既信心既，就祝你好運啦。",
            "comment_teaching": "Wooyoung 係有心教既，上堂係課室手舞足蹈，不過佢好少會教你點做題目，試過教新concept，計完一大輪（無錯，我去到一半已經迷失左），做功課個陣答翻同樣既野，收到既comment 係incomplete answer。<br /><br />仲有midterm佢改下hw數字諗住送分，考完之後個堂教點計，佢計完都覺得好驚奇。<br /><br />最後，你上堂以為自己明？太天真，做功課你就會知咩事。",
            "comment_grading": "唔好，今年班太細，但應該有拉curve，變左A range 好窄，唔少人都B range。",
            "comment_workload": "望落得功課考試，實際：<br />一份功課要做幾日<br />考試難到不得了，final mean 得40%<br /><br />祝你好運 :)",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dcu2KyWCWux6Kc517NHO0NPSpIikZbYO",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 140,
                    "name": "LIM, Woo Young",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Doge",
            "date": "Jul 08, 2018",
            "title": "Let the pain speak to me",
            "comment_content": "Interesting content , not so interesting when you try to study it.<br />10 sets of ppt:<br />1.sequential-move Games<br />2.Simultaneous-move Game<br />3.Best-response Curve Analysis<br />4.Mixed-strategy<br />5. Games with Incomplete Information<br />6.Equilibrium Refinement<br />7.The Prisoners’ Dilemma and Repeated Game<br />8.Auction &amp; Mechanism Design<br />9.Bargaining Theory<br />10. Rationality and Bounded-rationality",
            "comment_teaching": "Chaotic is a far cry from what is happening in this course.<br /><br />There is no way that you could gain any insight of the subject from class teaching, as not only the teaching is disorganized and erratic (which is basically a kill yourself for a 4000 level math based econ course), the notes also offers only examples that provide little to no help on how to tackle question that is within this course,either due to the fact that their logic leap is too huge for my tiny brain or because of the reality that they provide no assistance for me to differentiate between different cases and scenarios in the subject.&nbsp;&nbsp;&nbsp;&nbsp;<br /><br />Furthermore. to add salt to the wound , most of the actual &quot;useful&quot; stuff are only mentioned within class ( which itself is also chaotic and erratic and requires reorganization) , meaning that you have to drag your sorry donkey to a 9am class , and copy them down before it all gets wiped from the board, only to found out later that day&nbsp;&nbsp;you couldn't understand a thing and give up reorganizing the entire thing.<br /><br />Finally to nail the dead horse into the coffin , the knowledge prerequisite for this course is extremely important. In simpler words, if you have little to no knowledge in set theory, multi variable differentiation and integration, there is a very high chance that you are going to have a very, very hard time .<br /><br />The most insightful part of this course is actually the tutorial , which the TA will start a non stop 1hr frenzy in writing down examples and answer. Those are actually parts that could help you understand the subject , but then again , as others have mentioned , 7/10 times the TA is just as confused as the students.<br /><br />That being said, the professor is actually very enthusiastic about this course, but then again, i have also put so much time and effort in this course that would have earned me an A in other Econ 4000 level math based course based on my experience in the past, but still ,I get a C , so yeah kudos for enthusiasm, E for teaching.",
            "comment_grading": "The grading is not actually bad, it is actually that you would never get a good one , starting from the early-mid of the semester, the class is divided into two parts: Those who either have learned all of the stuff before or those who actually owned the ~700HKD textbook and understand all of it's content, and those who watch the world burning slowly around them while there are gasoline leaking everywhere.<br />If you are unlucky like me and belong to the latter part , chances are you will struggle , and you will get burned.",
            "comment_workload": "5 Problem sets (or 4, i don't quite remember)(20%)<br />class participation (5%),<br />a mid-term (30%), <br />and a final exam (45%)<br />Workload is ok if you formed a 3 people group , if you decide to do this solo then you will have quite a bad time, there are only 5 PS, but still each PS takes around 14-20 hrs to do( even with the answers beforehand) , and the attendance is quite hard to get as this course is a 9am one.<br /><br />*In all , you may doubt that whether or not this course is as bad as it seems, I personally consider myself as an imbecile, and&nbsp;&nbsp;tend to prefer courses with the highest Grade/Effort value so I strongly recommended those of you who are of the intellectually sophisticated batch to try it out",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Vr2s4fhIn84HpK0ZrZhIGfj8u5Gawxa2",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 140,
                    "name": "LIM, Woo Young",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "USTGG",
            "date": "Dec 31, 2018",
            "title": "For students who are good at and LOVE Game Theory and Algebra",
            "comment_content": "First of all, you must be good at algebra, I'm 100 percent sure that students taking this course are super good at Econ as well as algebra. If you are kind of interested in this topic and think that you can handle it because you have got an A+ in microeconomics, then you are wrong. You have to ask yourself 2 questions before taking this class. First, are you one of the best econ students? Second, do you like and keen on using algebras",
            "comment_teaching": "Prof Lim is a funny guy. However, humorous doesn't mean he is good at teaching. Most of the time, he preferred students to drill on a difficult question or a concept without giving us any inspiration. As a result, you might or might not be understand a problem or concept even though you spent 4 hours in a problem set. However, I would prefer a teacher providing inspirations to us and let us develop something that is not existed in the world yet, rather than spending hours and hours to develop something already existed. In addition, he misled us sometimes that the lecture notes and his teaching provided us wrong information. How did I realise that? This is because I found out that the answer in the final exam are inconsistent to what he said which was confirmed by his TA! However, as I don’t have any evidence when he said that, so it can only be claimed that he missed the detail of the lecture notes at that time.",
            "comment_grading": "Super bad grading, even you score everything slightly above mean, you still get a B-. I suggest you guys take other econ electives, never put your grade in jeopardy.",
            "comment_workload": "5 homework sets, on average it takes you 3 hours per homework. And then it all depends on your mid term and final exam.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4JqmbwSHGKmiyD8ZlEO29VNT7aJ2vefu",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 140,
                    "name": "LIM, Woo Young",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "solarski22",
            "date": "Feb 01, 2023",
            "title": "LIM Woo's distribution: 28% mean",
            "comment_content": "It covers essentials Game Theory knowledge with emphasis on Economics. The Math requirement is not too high. The difficulty rises after Lec Note 6 - Equilibrium Refinements. The things are interesting to know, but I do not think taking it for grades is necessary. You can just read through the notes or find an advanced Game Theory textbook to learn it yourself. If you want to show that you re good at Game Theory, why don't you take MATH4321- Game Theory instead? That will be more useful from the perspective of learning Game Theory.",
            "comment_teaching": "He is a good guy, likes to talk, good at presenting, sometimes humorous. However, when it comes to explaining complicated stuffs like different kinds of equlibrium refinements, he gave bad explanations. He just explained a specfic example on the lec notes. What you can learn is just that particular example. But in fact, there are still a lot of variations which he was unable to cover, and unable to provoke you to think about them. Borrowing the words of the review by Dreamscometrue (2019), &quot;最後，你上堂以為自己明？太天真，做功課你就會知咩事。&quot;. His comments are pretty precise. Lim also gave us a lot of troubles in learning, for example, he writes on the blackboard, which only one side of students can see what he wrote, and that side is not captured by the RVC. He also will not provide the detailed solutions for the problem sets, only the final answers are provided. You can learn nth from them. The answers for PS1 is just to fake you to stay at the class and keep registering. Later on ,the value-add of his solutions are just 0, or even negative. <br /><br />The TA, Weixuan Zhou, is his PhD student. I think he is nice in the sense that he will reply to your questions through email. He however cannot make the tutorial section, which was supposed to explain the questions in the PS, too useful.<br /><br />The teaching team perfomed not too well this semester. A C-range level performance.",
            "comment_grading": "Evaluation will be based upon written assignments (20%), class participation (5%), a mid-term (30%), and a fi\fnal exam (45%).<br /><br />Homeworks, class participations are not hard to get. You should be able to get satisfactory scores on them except HW 4, which is quite hard. <br /><br />The midterm exam is not too hard. Interesting questions, as he emphasized many times, but, the thing is: the grading is shit. He graded it very strictly. Although he said that he gave partial credits, but what he meant is actually sth like 5marks over 60 only, he said this is partial credits. It turns out that his strict marking habits has been revealed by the mean score of the midterm, which is about 50/190 only; many people falls into the range of [11, 30] over 190 marks. It's the mode range, man!!! Do you realize the risk of taking this course now? I have attached the distribution below. His instructions aren't clear too. It made us don't know what to do for some questions that involved in a lot of sub-questions. His exams are very very risky to take. Even if you attended all classes and do understand all the contents, you will just get a very low mark if you do not meet his high expectations for the answers, or if you mis-interpreted what he wants you to do. This is the worst distrbution I have seen ever seen. Although he gave out good words like &quot;I want to distinguish hardworking students&quot; or &quot;If you work hard, you will get what you want&quot;, but he obviously failed. Do you think if he suceed in doing so, the ditribution will be like this - mean is just 2X%!? Or, just ask yourself, have you seen a distribution like this before? Not at all, it's even worse than PHYS1112/MATH2033/MATH2421. <br /><br />The final is easier. That means he really did sth wrong in marking and making the midterm. If you take it next semester, how confident will you be on this professor not making similar mistakes again? Read the comments from previous years, don't just read the good ones. Is it that valuable to take such risks when there are other courses in Game Theory, like MATH4321? <br /><br />Got below mean in MT, not sure what's my final score, graded B-range. It's not a very bad grade course, but it's just not worth it. Take Pak Hung's course if you want to learn more ECON. It's much more worthy.",
            "comment_workload": "He gave us an extra work of writing an essay to help us gain more marks in the MT. That is a very very heavy burden. His requirements are super super strict. It is at an journal paper level. <br /><br />Revision and thinking are definitely needed, and it costs so much time and effort. Don't take too many other courses if you insist in testing people's comments here. Otherwise, it will be a torturing experence. Not too rewarding at all. You got other choices.&nbsp;&nbsp;Definitely not suitable for year 2 students if you liked him after his 2113. Probably no recordings in the future btw.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5v8v1JKzHX8IM6xhl1WfSiHGCSQHXYAi",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 140,
                    "name": "LIM, Woo Young",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gunther",
            "date": "Jan 23, 2019",
            "title": "",
            "comment_content": "The course is pretty difficult and conceptual, with minimum help provided for students. Even after attending the tutorials and classes, there was still quite a lot of difficulties that I encountered when it came to homework. As examples provided in class and tutorial tend to be a much much simpler versions of the homework and exam questions, but that's the most help you could get.",
            "comment_teaching": "Professor is very great and passionate about teaching. But expects students to be able to work out problems on their own and from only the notes.",
            "comment_grading": "Most people get nearly full scores on homework, so the mean is always high.",
            "comment_workload": "One assignment after 2-3 chapters. Spent a few hours on each, would say it's pretty demanding.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HFZLLmjUe8j6ckaHHiRS57TKoTKaMyFn",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1285,
                    "name": "WU, Qinggong",
                    "rating": 1
                },
                {
                    "id": 1286,
                    "name": "ZHANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "benstation",
            "date": "Jul 08, 2020",
            "title": "",
            "comment_content": "Mainly 4 parts: 1. Static games with information, 2. Static games with imperfect information, 3. Extensive games with information and 4. Extensive games with imperfect information.<br /><br />It was different from that of Professor Lim Wooyoung. The Lim one was more suitable for SBM students while this one suited students with strong mathematic or engineering background. It was similar to MATH4321. You need to have basic concept of probability and mathematics symbols.",
            "comment_teaching": "Mainland Chinese Accent.<br /><br />The Professor refered to the few cases he chose throughout the whole semester. You are better to attend the lesson to see the slight difference in the setting of those cases.<br /><br />PPT of the same topic (same name) would be kept uploading with the same topic a day right before the lesson. You could hardly know what those slides mean by simply reading.",
            "comment_grading": "Class size this semester is 43. For Homework, the highest marks were always 10. The lowest were zero. The mean was 8 and the median was higher than the mean. For midterm, the highest marks were 100. The lowest were zero. The mean was 52.6 and the median was more or less the same.<br /><br />I got a good grade since most of my homework were helped by a friend majoring in Mathematics.",
            "comment_workload": "Take-home Open-book Exam | 45%<br />In-class Close-book Midterm | 35%<br />Homework * 4 pieces | 5% * 4 = 20%<br /><br />(The University management decided on November 13, 2019 to temporarily change the mode of instruction for the remaining weeks of the Fall Term due to social unrest in the territory.)<br /><br />You usually spend a couple of days for a homework. It could be easy at first glance since all cases were in daily life. However, common sense was not always correct. You are better good at probability, mathematics sense as well as its presentation method.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "vi4UsywMBtFYOLCxOugKLfQWPH9cqLwy",
                    "name": "ECON_4124_Exam",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "B6Y7EHopZwId43vhWYHe2ERVfVGH0ejl",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 140,
                    "name": "LIM, Woo Young",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "123455",
            "date": "Jan 26, 2018",
            "title": "",
            "comment_content": "10 sets of ppt:<br />1.sequential-move Games<br />2.Simultaneous-move Game<br />3.Best-response Curve Analysis<br />4.Mixed-strategy<br />5. Games with Incomplete Information<br />6.Equilibrium Refinement<br />7.The Prisoners’ Dilemma and Repeated Game<br />8.Auction &amp; Mechanism Design<br />9.Bargaining Theory<br />10. Rationality and Bounded-rationality<br /><br />little math involved and interesting content.",
            "comment_teaching": "The reason why I give such a low score is that there are so many mistakes made by both Prof. and TA which confuse students a lot. For example, typo on notes which provides wrong information, misleading (not wrong but just so misleading) information on notes, TA teaches wrong concept and provides wrong answers...<br />All these together confuses students a lot and one regular lecture became a Q&amp;A section just because students had so many questions on the content. <br /><br />I want to give a E on teachiing originally. But then, i understand that Prof. tried his best to avoid math in the content and this made him difficult to explain the concepts clearly. Also, prof. Lim has great presentation skills and that's why i give a C.",
            "comment_grading": "Evaluation will be based upon written assignments (20%), class participation (5%), a mid-term (30%), and a final exam (45%)",
            "comment_workload": "There are 5 problem sets in total.<br />Quite difficult ,challenging and time consuming to finish them if you dont have source, but they help you a lot in understanding the materials.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "genIx41RaPOkNIGyxjPrvrrS8K1zOspn",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 140,
                    "name": "LIM, Woo Young",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tony big",
            "date": "Feb 07, 2023",
            "title": "There should not be any excuses for having a bad grade.",
            "comment_content": "A more comprehensive instruction of game theory compared with ECON 3014.<br />From pure strategy to mixed strategy<br />Different game types including bayesian nash equilibrium, signalling game, auction etc...<br /> first-order condition is basically enough for mathematics in this course.",
            "comment_teaching": "I'll say it this way, professor Lim may not be those professors that are very good at teaching, and explaining things to students. On the other hand, he is extremely kind and passionate about teaching and delivering game theory to students.<br />Through out the whole semester, I have sent numerous emails to both professor Lim and TA to help clarify stuff I don't quite understand in the class. They always respond on time, so when you decided to take this course, never hesitate to raise questions to them. Keep asking until you understand it, I am sure they will always be happy to help.",
            "comment_grading": "I took economics as my second major.<br />In that semester, econ 3014 was having a time conflict with one of my SBM required courses. After seeking advice from the econ department, I took ECON 4124 before even starting my ECON major compulsory courses.<br />My midterm result was 95/195, which is apparently not the top performer in class. To be honest, I don't think I was doing great in the midterm despite the mean being very low. Professor mentioned he expected the mean to be around 90, which I agree with because the exam would require you to think about how to apply the knowledge u acquired in class.<br /><br />All of my assignments are either full marks or a few marks deducted.<br /><br />Regarding the final exam and essay, I don't know my stats, I don't think it would be useful to compare the final, because the final is basically questions for homework. <br /><br />final grade: A( my cga is ~ 2.7 only)",
            "comment_workload": "if I say to workload is light I must be lying.<br />The workload is not light, but bearable.<br />Homework will require you many hours to think.<br />Revision after class is of course needed for a good grade.<br />The essay was a make-up plan for those who screw up in the midterm. (Yet everyone is incentivized to join)&nbsp;&nbsp;Which means there shouldn't be any essays in other semesters.<br /><br />If you want an easy leng grade course, well this is not for you.<br />If you have determination, go register for the course and dedicate your time to it.<br />I am sure if you really work hard, you will not get a disappointing grade.<br /><br />It is recommended to find other hardworking students and discuss&nbsp;&nbsp;together.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BihqHGU5Vj4PiZub1yg6JG5OkiIQBNFI",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 140,
                    "name": "LIM, Woo Young",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lks23",
            "date": "Jan 30, 2023",
            "title": "Challenging Course But Rewarding Expereience",
            "comment_content": "This course covers a wide range of game theory topics. From pure and mixed strategy Nash Equilibrium to Auction and other game Equilibrium. By taking this course, you will conceptually and mathematically understand the in-depth knowledge of game theory.",
            "comment_teaching": "Prof. Lim is an excellent teacher. He is able to illustrate theories with daily examples. However, he wants to provide the best learning experience. That means students should expect the difficulty of this course will drastically increase after the first 3-4 weeks. Thus, you should also expect he will move fast when covering easy topics after the first 3-4 weeks.",
            "comment_grading": "The grading this semester is generally loose. Perhaps the response from poor midterm score for the whole class has caused him to revise the exam difficulty and the grading as a whole.",
            "comment_workload": "The workload seems easy. An assignment every 2 weeks, 1 midterm, and 1 final exam. But you should expect that you MUST study very hard to understand all he knowledge he teaches. As he always mention, this is not an easy course. If you are looking for a course with easy workload and grading, this is not a course for you.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7KVTnr5mgdIn4LJtajVM35Qcc6sMreGP",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 140,
                    "name": "LIM, Woo Young",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "isshin",
            "date": "Jan 23, 2023",
            "title": "",
            "comment_content": "Elements of a Game, Thinking Strategically, Sequential-move Games; Simultaneous-move Games; Best-response Curve Analysis; Mixed-strategy; Games with Incomplete Information; Equilibrium Refinement; Signaling Game; Repeated Prisoners’ Dilemma; Auction &amp; Mechanism Design;<br />Ascending auction / Common-value auction; Bargaining Theory; Ultimatum Bargaining; <br /><br />(Not taught due to limited time)Rationality and Bounded-rationality– A Lecture on Behavioral Economics",
            "comment_teaching": "The professor is very passionate and humorous.&nbsp;&nbsp;He will play some games if time allowed (the exams have nothing to do with the games).",
            "comment_grading": "The professor mentioned many times he wants to differentiate those who really work hard. So he made the mid-term really hard. <br />Full mark: 190<br />High: 185 (Genius, the professor said he did not expect someone can get almost full marks) <br />Low: 0 (5 students out of 38)<br />Mean: 56.57<br />Median: 43<br /><br />You can see the result is very bad. There are students who keep complaining about it. Then he added a 100 points 5-page essay to make the full mark 290. No matter whether you write it or not, the full mark became 290. This is unfair to students who did well in the mid-term.&nbsp;&nbsp;<br /><br />He also made the final much easier with many similar questions from homework. I think the mid-term will also be easier in the future as he has learned a lesson from our bad score.<br /><br />TA gives very good grades for your homework and I got an almost full mark on homework. My mid-term is below mean, unknown about the final and the report, and finally, get a B. So I think the grading is okay if you work hard.",
            "comment_workload": "Although a 5-page report was added unexpectedly, I think it's okay. There are 5 problems set in total. Every set takes me about 2 days to finish.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eCVMsUXIoI3jXCIYnEoBBvBU431Er2NS",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 140,
                    "name": "LIM, Woo Young",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tyy⭐️",
            "date": "Dec 17, 2018",
            "title": "Strongly recommend this course ONLY to student who like the content",
            "comment_content": "The content is the biggest reason I choose to study this course. Of course you will find less interesting when you try to study it, but I think every course is the same. However, it is still very interesting. <br /><br />But, if you are not very interested in the content, don’t take this course as you will find confused later and the course become a burden for you. <br /><br />Prisonner’s dilemma is the easiest topic you are going to learn at the beginning and later it goes to more complicated games and teach you how to solve those games strategically. It include little maths but not many, but still not recommend student who don’t like maths to take this course.",
            "comment_teaching": "Professor Lim mainly working on this aspect and he always mention his university life about learning game theory. So he is very passionate on game theory and he is very willing to help. But, you cannot ask him question without self thinking as he will not answer. You need to think about it by yourself first and if you still find it confusing, he will then help you to work on it together. He seldom provide detailed solutions even in the homework solutions. Self learning is very important. <br /><br />His teaching is very interesting as he will play games in the class before starting a topic, and little payment is included in those games. Taking his lecture will be fun.<br /><br />ONE important thing is that you cannot miss any lecture and tutorials! Although no punishment is included, you will miss a lot of contents and become unable to catch up. Attending every lesson is necessary. Nearly every student will attend tutorials as it is very important and helpful for your learning and homework problems.",
            "comment_grading": "It depends. <br /><br />If you attend every lesson, and you are interested in the topic, and you work hard and finish your homework seriously, and ask questions when you find somewhere confusing, a B+ is guaranteed (I think)<br /><br />If you are not interested in the content, then don’t expect a good grade as many students are really interested and passionate in the course. Only 30+ students are in the class. If you are not the one who is passionate, it is difficult to get a A range.<br /><br />Grading:<br />Midterm30<br />Final45<br />Homework20<br />Class participation5(I always sleep in class - -<br /><br />I get 90 in midterm, mean 67 something? Homework above mean every time(5 in total), unknown marks for final, and I get A",
            "comment_workload": "5 pieces of homework, need time to deal with it. And it counts marks for the grade. Attending tutorial is helpful as many clues and hints will be given in the tutorial, and you can ask the TA.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pBOApmuyWOQnpoAIOG6tN6QwfyaDdFQV",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 140,
                    "name": "LIM, Woo Young",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kerrya",
            "date": "Aug 26, 2018",
            "title": "",
            "comment_content": "The content was not difficult. The courses only cover basic game theories which should be easy for Economics students. Some of the contents should have been taught in the introductory level of Economics class. For students majoring in Economics, a lot of the course contents should have been taught in their microeconomics class.",
            "comment_teaching": "Lim Woo Young is a nice professor, but sometimes he could explain everything clearly during class, especially when he was explaining some more complicated ideas. He probably did not spend much time preparing for the class beforehand. He could explain a lot better after class when there was no time limits.",
            "comment_grading": "Lim usually gives around 20% students A range depending on the overall performance of the class. Getting B range was easy, since he usually gives around 40 - 60% students B range.",
            "comment_workload": "There were only 5 group assignments consisted of 4-5 questions. It usually took my group a little more than 3 hours to finish all the questions individually and took one of us 15 mins to combine all the answers.&nbsp;&nbsp;The workload was very light for a 4-credit course.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}