{
    "error": false,
    "course": {
        "id": 300,
        "subject": "ECON",
        "code": "4474",
        "name": "Hong Kong's Economy",
        "description": "Hong Kong's post-war economic performance and prospects for further growth and development; analyses of key sectors; income and wealth distributions; Hong Kong, South China, and strategies for economic upgrading.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2230,
            2130,
            2030,
            1930,
            1830,
            1730,
            1610,
            1510,
            1410
        ],
        "prerequisites": "One of <a class=\"course-link\" data-subject=\"ECON\" data-code=\"2103\" href=\"/review/ECON2103\" target=\"_blank\">ECON 2103</a>, <a class=\"course-link\" data-subject=\"ECON\" data-code=\"2113\" href=\"/review/ECON2113\" target=\"_blank\">ECON 2113</a> OR <a class=\"course-link\" data-subject=\"ECON\" data-code=\"3113\" href=\"/review/ECON3113\" target=\"_blank\">ECON 3113</a>, AND <a class=\"course-link\" data-subject=\"ECON\" data-code=\"2123\" href=\"/review/ECON2123\" target=\"_blank\">ECON 2123</a> OR <a class=\"course-link\" data-subject=\"ECON\" data-code=\"3123\" href=\"/review/ECON3123\" target=\"_blank\">ECON 3123</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.5,
        "rating_teaching": 4,
        "rating_grading": 3.5,
        "rating_workload": 3.83,
        "review_count": 6,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 806,
                "name": "FAN, Yiu Kwan",
                "count": 6
            },
            {
                "id": 1398,
                "name": "WONG, Sunny",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "7L0SlDjsuct6IQMcaMOgCh7PKljWFPjz",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 806,
                    "name": "FAN, Yiu Kwan",
                    "rating": 0
                },
                {
                    "id": 1398,
                    "name": "WONG, Sunny",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "how are you",
            "date": "Jun 15, 2021",
            "title": "Do not reg this course lol",
            "comment_content": "1. Content is very broad and vague, basically you are expected to know everything about Hong Kong. It is not only limited to the HK economy, but also social issues such as housing, healthcare, etc. It would be quite hard for a non-local to catch up with the course, since there is a lot to cover within the semester. <br /><br />2. There is a heck ton of reading to complete every class, but he will not cover them during the lecture. Those are likely working papers of the government, policy address of the CE, HKMA white papers, etc.",
            "comment_teaching": "1. Classes are slow-paced and lack focus: The professor spends too much time discussing the latest news with students, instead of really teaching the course content. He is never able to cover all his lecture notes. <br /><br />2. What he covered in class does not match with the examined content. He expects us to have our own local knowledge to answer the questions in great depth and detail (i.e. percentage figures, incidents with a specific year, etc.) during exam since it is open-notes, but it is honestly quite impossible to students given the time constraint. Worse still, such expectations were not mentioned by him before exam - you will only know about it after you are penalized.<br /><br />3. He provides quite biased comments during class discussions. Often times he would insist in pro-China stances in multiple issues. He is unable to offer a balanced view when students question about economic and political issues of Hong Kong.<br /><br />4. There is a term paper to complete during the course, which both the prof and TA provide very limited support. Both of them are not very responsive on emails, and the TA does not know the requirements of the professor at all.",
            "comment_grading": "1. The grading system is not transparent at all. You will not get any breakdown of your grade (i.e. score of final exam, term paper, class participation) unless you ask for it. Even with the breakdown, the TA is unable to provide concrete information on how the scores are given. What you receive will only be three figures without any explanation and score distribution. You will not be able to know where you rank in the class, not to mention learning from your mistakes.<br /><br />2. Scores are tremendously low, particularly for the final exam. The full mark of the exam was 30, and from what the TA said, quite a number of students scored single digits. Scoring below 50% is very common. Thanks to the weighting though, the final exam only contributes 30% to your course grade.<br /><br />Overall, there is no transparency and leniency in the grading system.",
            "comment_workload": "Big. But honestly this is already the most acceptable thing of the course...",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4msTJAJ8jhQRql6rYeJhQqHcHajQZBAN",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 806,
                    "name": "FAN, Yiu Kwan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "科大劉馬車",
            "date": "Jun 14, 2023",
            "title": "",
            "comment_content": "There are 6 modules. <br />Professor will upload the notes before lesson. You better read the notes before attending the lessons, so that you can answer the question and get participation points.",
            "comment_teaching": "Interactive, different from the majority of UST course. I enjoy this learning mode very much.",
            "comment_grading": "Grading is quite fair. Idk the score of my final exam and project. I got A-",
            "comment_workload": "very light workload<br />Final exam are all open ended questions, no need to memorise anything. <br />If u have to fulfill ECON 4670, this course is definitely a good elective. You don’t need to do extra things, just finish the project and presentation the course required.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9NpwHn8fh0NukKnXFh425vFQjiLuhywT",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 806,
                    "name": "FAN, Yiu Kwan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Boeing787",
            "date": "May 26, 2022",
            "title": "Good Level 4 Economics Elective",
            "comment_content": "Syllabus:<br /><br /><br />1)\tThe Big Picture: Government Spending and Revenue<br />2)\tHuman Resources and Education<br />3)\tLand Supply and Housing Markets<br />4)\tThe Monetary System and the Financial Sector<br />5)\tIncome Distribution and the Political Economy<br />6)\tEconomic Growth and the Greater Bay Area<br /><br /><br />Readings: There is no required textbook for this course. Students should refer to lecture notes, suggested readings and their own research. <br /><br />The course content was quite interesting and I enjoyed most of the lectures. However, I wish he could spend more time teaching the course. He devoted all of the time on project presentations after the final. I feel that too much time was placed into this. I would much rather spend more time going over lecture content than listening to long presentation of other students.<br /><br />On a side note, this professor might exhibit hints of Pro-China stance in his teaching. You might be find it beneficial to include terms like &quot;Greater Bay Area&quot; in your final. Moreover, he seems to favour research projects that are related to China.",
            "comment_teaching": "Professor Fan's classes are very interactive. He expects you to read pre-class materials and will often call on people to ask their opinions regarding them. I find this method of teaching more enjoyable than conventional &quot;spoon-feeding&quot; methods. I enjoyed the class discussions. Lectures were also a good opportunity for students to ask questions. He answered my questions in detail. Overall, his teaching is pretty good to me.",
            "comment_grading": "1. Final (40%)<br />2. Individual Research Project (50%). Can be used to fulfil ECON 4670 requirement.<br />3. Class participation (10%).<br /><br />I'm not sure how the grading is as no marks have been released so far. Hopefully, things will turn out well.",
            "comment_workload": "Fairly light for a 4-credit level 4 ECON elective. There are 6 modules in this class. The professor will give his lecture notes and some pre-class readings. Although the readings can be long, you don't have to read all of the content. Browse through the reading, assimilate the important points and you're good for class discussions. <br /><br />There is a final in Mid-April, consisting of an open ended questions regarding policies to strengthen Hong Kong's economy in the medium and long run. I liked the nature of this examination. It is quite different from HKUST courses, which require rote memorization of facts. I tend to perform poorly in those examinations. His examination focuses on application of policies covered in the lectures. <br /><br />After the final, we'll have to present our research project. We have the whole semester to complete it and if you start early, it'll feel like a breeze. Overall, the workload for this course is pretty low.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cfGFAkfYBE4QwLqtuu4Je2gY5t5TJkXl",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 806,
                    "name": "FAN, Yiu Kwan",
                    "rating": 1
                },
                {
                    "id": 1398,
                    "name": "WONG, Sunny",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sbm2022",
            "date": "Jun 20, 2021",
            "title": "Dont reg if you want good grade",
            "comment_content": "Big picture of the Hong Kong economy. There are six chapters:<br /><br />1. The Big Picture: Government Spending and Revenue<br />2. Human Resources and Education<br />3. Land Supply and Housing Markets<br />4. The Monetary System and the Financial Sector<br />5. Income Distribution and the Political Economy<br />6. Economic Growth and the Greater Bay Area",
            "comment_teaching": "Professor. Fan is knowledgeable and responsive <br />Class is also interactive <br />Limited support for the paper",
            "comment_grading": "Essay:60%<br />Participation:10%<br />Midterm:30%<br /><br />Worst grading at ust<br />Most people got c range for this course",
            "comment_workload": "The essay is very demanding<br />It takes me the whole semester working without much support",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yzSM9IXVxDAEGL3RryLAEoFvxowEyX8q",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 806,
                    "name": "FAN, Yiu Kwan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "H.W.",
            "date": "Sep 01, 2020",
            "title": "Interesting Contents and nice professor (Online)",
            "comment_content": "Big picture of the Hong Kong economy. There are six chapters: <br /><br />1. The Big Picture: Government Spending and Revenue<br />2. Human Resources and Education<br />3. Land Supply and Housing Markets<br />4. The Monetary System and the Financial Sector<br />5. Income Distribution and the Political Economy<br />6. Economic Growth and the Greater Bay Area<br /><br />The paper written in this course will automatically fulfil the ECON 4670 paper requirement.",
            "comment_teaching": "Prof. Fan is a very kind and helpful professor. He teaches at a slow pace and always encourages students to ask questions or share opinions.",
            "comment_grading": "Average grade. <br />40% for a final exam<br />60% for the individual project. <br />&nbsp;&nbsp;- A research plan &amp; list of reading/ source materials 20%<br />&nbsp;&nbsp;- Draft term paper 25%<br />&nbsp;&nbsp;- Project presentation, Q&amp;A 25%<br />&nbsp;&nbsp;- The Term Paper 30%<br /><br />The grading of the final exam is vague. There is only a question in it with an essay form, asking about your viewpoint about the Hong Kong economy under &quot;one country, two systems&quot; for the short term, medium term, and long term.",
            "comment_workload": "There are a lot of readings for each lecture. It will be helpful to browse them before lectures. <br /><br />The individual project accounts most of the part of this course, as you are required to write a term paper based on original research that is related to the Hong Kong Economy. The schedule is not very tight though, you have to take your time to collect materials and work on it. <br /><br />A 15 -20 min presentation is required. Just walk through your project.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "jZymQXmHQ6ThL1vGR7h5cWIHmjhSCEUe",
                    "name": "ECON4474 Course Outline Spring 2020",
                    "format": "docx"
                }
            ]
        },
        {
            "hash": "DUnQXhwda6cLxhAXrwYgCxBaXfj4LJme",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 806,
                    "name": "FAN, Yiu Kwan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "thethuglife",
            "date": "Apr 16, 2020",
            "title": "Average Course",
            "comment_content": "Content is great, there are around six chapters only with ample reading material about Hong Kong's economy covering topics such as Economic Growth, Income Equality, Housing, Exchange Rates, etc.",
            "comment_teaching": "Very interactive classes compared to other econ classes. A lot of discussion about practical economic concepts.",
            "comment_grading": "Grading is ok, nothing too bad just like other econ courses I would say. <br />Midterm = 30%<br />Project = 60%<br />Participation = 10% (he expects you to attend most classes)",
            "comment_workload": "The workload is not too bad but his deadlines and work expectations may not work out for everyone. He expects you to turn in the first draft as the same quality as your final draft when the deadline for both submissions is like 40 days away with a presentation is in the middle.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}