{
    "error": false,
    "course": {
        "id": 3142,
        "subject": "ELEC",
        "code": "2350",
        "name": "Introduction to Computer Organization and Design",
        "description": "This is an introductory course to computer hardware and software organization. The topics covered include computing systems, computing programing, hardware-software collaboration, computer arithmetic, computer hardware organizations and operations, parallel processing, memory technologies and organization, and technology trends.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"ELEC\" data-code=\"1100\" href=\"/review/ELEC1100\" target=\"_blank\">ELEC 1100</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"2611\" href=\"/review/COMP2611\" target=\"_blank\">COMP 2611</a>, <a class=\"course-link\" data-subject=\"ELEC\" data-code=\"2300\" href=\"/review/ELEC2300\" target=\"_blank\">ELEC 2300</a>, <a class=\"course-link\" data-subject=\"ISDN\" data-code=\"4000F\" href=\"/review/ISDN4000F\" target=\"_blank\">ISDN 4000F</a>",
        "rating_content": 4.53,
        "rating_teaching": 4.63,
        "rating_grading": 3.89,
        "rating_workload": 4.32,
        "review_count": 19,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1263,
                "name": "MAN, Tsz Yin",
                "count": 9
            },
            {
                "id": 197,
                "name": "KURSUN, Volkan",
                "count": 6
            },
            {
                "id": 171,
                "name": "LEUNG, Tsung Hsien Johnny",
                "count": 2
            },
            {
                "id": 191,
                "name": "WU, Chi Hang",
                "count": 2
            },
            {
                "id": 1642,
                "name": "XIE, Zhiyao",
                "count": 2
            },
            {
                "id": 173,
                "name": "CHOI, Ricky Yiu Kee",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "ptbyAIPF9hhbEiEYCdE5qfVTZ3ZOskJx",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 197,
                    "name": "KURSUN, Volkan",
                    "rating": 1
                },
                {
                    "id": 171,
                    "name": "LEUNG, Tsung Hsien Johnny",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pking",
            "date": "Jun 06, 2020",
            "title": "",
            "comment_content": "The course content included:-<br />1) Instructions: Language of the Computer<br />2) Floating-Point Arithmetic for Computers<br />3) Integer Arithmetic for Computers<br />4) Computer Performance<br />5) Single-cycle Processor Microarchitecture<br />6) Pipelined Multi-cycle Microprocessor Microarchitecture<br /><br />This course focuses on MIPS Assembly Language and by the end of this course, you will be able to code short programs in MIPS Assembly language on MARS.<br /><br />TextBook:- Computer Organization and Design MIPS Edition: The Hardware/Software Interface<br />By David A. Patterson, John L. Hennessy<br /><br />Course Learning Objectives<br />With the successful completion of this course:<br /> 1) Students will be able to design and quantitatively analyze the performance of computer systems<br /> 2) Students&nbsp;&nbsp;will&nbsp;&nbsp;learn&nbsp;&nbsp;the&nbsp;&nbsp;principles&nbsp;&nbsp;of&nbsp;&nbsp;modern&nbsp;&nbsp;instruction&nbsp;&nbsp;set architectures <br />3) Students will learn the 32‐bit MIPS architecture<br />4) Students will have an understanding of the memory hierarchy employed for achieving high performance in&nbsp;&nbsp;&nbsp;&nbsp;modern computer systems <br />5) Students&nbsp;&nbsp;will&nbsp;&nbsp;learn&nbsp;&nbsp;how&nbsp;&nbsp;modern&nbsp;&nbsp;computer&nbsp;&nbsp;systems&nbsp;&nbsp;exploit instruction-level parallelism and pipelining to&nbsp;&nbsp;achieve higher performance computing",
            "comment_teaching": "Professor Volkan explains each topic precisely and will instil your interest in the subject. Though he took almost 2 months to finish MIPS Instructions, in the end, I think it was worth it as it was very helpful to us for the final projects.<br />The TA, Johnny is also really helpful and feel free to ask him any doubts. He was able to respond to all my questions through email well on time and his feedback was very helpful.",
            "comment_grading": "HW1:- 7.5%<br />HW2:- 17.5%<br />HW3:- 25%<br />Project 1:- 18%<br />Project 2:- 32%<br /><br />No labs this semester!",
            "comment_workload": "Due to the ongoing pandemic, the professor replaced the midterm and final by 2 small projects on MIPS Assembly Language. An option was provided to the students to either go for the projects assigned by the professor or design a presentation on any topic related to the course materials. <br />The overall workload of this course is not that much. If you are able to understand the lectures pretty well, you will be able to do the assignments quite easily.<br />The labs were also cancelled this semester!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WnQfqIScA0Ykk24c0JyoyvjlMmfZo04I",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1642,
                    "name": "XIE, Zhiyao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Markus:)",
            "date": "Jun 13, 2023",
            "title": "Nice introductory course",
            "comment_content": "Content: <br />L1 - Introduction to Computers<br />L2 - Arithmetic for Computers I<br />L3 - Instructions and Programs<br />L4 - Arithmetic for Computers II<br />L5 - Computer Performance<br />L6 - Single Cycle Processor Architecture<br />L7 - Pipelined Multi-Cycle Processor Architecture<br />L8 - Memory Architecture<br /><br />The content is very interesting &amp; gives a good introduction to how a 5-stage MIPS processor works. This is explained in a fair amount of detail &amp; can be quite overwhelming. I recommend attending the lectures as the lecture notes don't explain much. Later on, the multi-cycle and pipeline processors are explained &amp; use many of the concepts from the single-cycle processor. Overall the content isn't very difficult to understand, but there is quite a lot of content &amp; there are a lot of little things to pay attention to, i.e. if a specific calculation is signed, what addressing mode is used, etc.",
            "comment_teaching": "The prof is new but very engaging &amp; is happy to answer questions (don't ask stupid ones because he will call you out on it). He has a tendency to zoom through content only to take his time in the next lecture to go over the same content again, which allows you to figure out what you missed.<br /><br />Vivian is an amazing TA; she explains things well during the tutorials and quickly replies to emails.",
            "comment_grading": "It's fair; Vivian was more lax on the first HW compared to the 2nd one, so a lot of people lost marks because they didn't include units i.e. 0X for hex &amp; 0b for binary. Dont have access to the course page anymore so cant give any specific grades.",
            "comment_workload": "It's alright; 4 labs aren't hard but extremely tedious &amp; time-consuming. 2 HW assignments are alright &amp; a midterm and a final. For some reason, the midterm was a lot more difficult than the final, so try to get a good mark for the midterm to get ahead as the final mean was a lot higher than the midterm.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Uq6dnWqRX8Cp7qwcHHxU4ByiK2zGMZ62",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1263,
                    "name": "MAN, Tsz Yin",
                    "rating": 1
                },
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LeePresident",
            "date": "Dec 21, 2022",
            "title": "EE Required Course",
            "comment_content": "The contents of this course include arithmetic with binary, decimal and hexadecimal numbers, MIPS instructions, computer performance, and the architectures of the single-cycle, multi-cycle and pipelined processors. Some of them are quite easy but some of them require more understanding.",
            "comment_teaching": "Professor Man explains every concept with so many details loud and clear and I don't feel very sleepy because the lectures start at 9 am. He also writes lots of notes beyond the PowerPoint slides and tells us the latest development in the industry.<br /><br />TA Ricky recaps the lecture contents quite well and explains them with some examples",
            "comment_grading": "2 HW 18% (14.31%)<br />4 Labs 32% (31.36%)<br />Midterm 20% (60/100)<br />Final 30% (39.4/100)<br /><br />Only lab 1 requires you to attend the lab session physically.<br /><br />Overall 69.49%<br />Grade: B-<br /><br />I think my grade will be C+ because it is quite easy to take a high score and I perform poorly in the final but it is quite lucky for me.",
            "comment_workload": "The workload of this course is very light in many 4-credit courses.<br /><br />HW1 and HW2 are published in October and November respectively and we have 2-3 weeks to finish the HW. Some questions are straightforward but some of them require more understanding.<br /><br />One lab per two weeks<br />Only lab 1 requires us to write the MIPS instructions and it can be done before the lab session with some effort. For the remaining labs, we only need to observe the results from the generated MIPS codes and the deadline is 2 days after the lab session. You only need to speed 30-60 minutes to finish them.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "F0pEYIOBQkkw2kP8grOGcb68x8Ns5TW3",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1642,
                    "name": "XIE, Zhiyao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tttts",
            "date": "Jun 27, 2023",
            "title": "",
            "comment_content": "To be honest, for me and many of my fellows, the content in this course(or COMP2611) will never be used in the future. But basically, the course is quite interesting and it makes the CS area less abstract for me.<br />Content:<br />L1 - Introduction to Computers<br />L2 - Arithmetic for Computers I<br />L3 - Instructions and Programs<br />L4 - Arithmetic for Computers II<br />L5 - Computer Performance<br />L6 - Single Cycle Processor Architecture<br />L7 - Pipelined Multi-Cycle Processor Architecture<br />L8 - Memory Architecture",
            "comment_teaching": "Prof. XIE teaches this course for the first time, but it's generally great! He has a solid knowledge in this field and is willing and patient to answer students' questions. He explains all the knowledge in detail and spend about 20~30 min to review the content of the last class every time.&nbsp;&nbsp;But for me, he sometimes goes into details too quickly for us to follow him. At first, I'm not sure that wheter it's because I missed sth so I failed to understand the progress, but after discussing with some of my fellow students, we found all of us didn't catch up quite well.<br /><br />The TA Vivian is one of the best TA that I've ever met. She explains the knowledge points during tutorials and labs quite efficiently. Also she's such a kind person that she would email you once you've submitted a wrong hw file to the canvas！",
            "comment_grading": "Since we don't have access to the canvas page anymore, I can only write this part with my poor memory.<br />2*hw(7%+8%) mean~85 mine~full<br />4~5labs(20% in total) mean~95 mine~full<br />midterm(20%) mean~60 mine:75.2 (about +1SD)<br />final(45%)mean ~67 mine:95.5<br />final grade:A+<br />It's quite a good grade course I think. The midterm was not difficult actually, but the time was too limited for me. Also, the concepts were kind of abstract to me and I didn't fully understand part of the knowledge before the midterm. However, after learning the part after midtermm, you can find many different parts of the course can be linked together, and it's much easier to understand. Also, because final has abundnat of time, and the questions are not tricky at all, it's easy to finish all the questions in time and get a satisfactory score.",
            "comment_workload": "Light actually. <br />The lab is just copying some data from the simulation software. Actually I think making the lab more challenging and push us to think more about the content would be better for the understanding to this course.<br />And each hw has only around 5 questions, which can be e done in 2 hours~3 hours. <br />All the workload in this course comes from preparing for the exam.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 5,
            "attachments": []
        },
        {
            "hash": "zv1aaJ4OQbHahlu8igBQ2p29I0CQotFs",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1263,
                    "name": "MAN, Tsz Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ggsmnida",
            "date": "Apr 23, 2023",
            "title": "",
            "comment_content": "Total 8 Chapters<br />CH1: Introduction to Computers<br />CH2: Arithmetic for Computers - 1<br />CH3: Instructions and Programs<br />CH4: Arithmetic for Computers - 2<br />CH5: Computer Performance<br />CH6: Single-cycle Processor Architecture<br />CH7: Piplelined Multi-Cycle Processor Architecture<br />CH8: Memory Architecture",
            "comment_teaching": "Professor MAN is highly skilled in teaching this course, adeptly explaining concepts in a way that makes student easily graspable.",
            "comment_grading": "HW 1-2: 18% (two HWs only 9% each)<br />Lab 1-4: 32% (Four Labs 8% each)<br />Mid-term: 20%<br />Final: 30%",
            "comment_workload": "This course carries a credit load of 4, and I think the workload is manageable as the lab and homework assignments are relatively straightforward to complete.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1VUdRWL7J6RE25BuU6oVNXj5dF13n8xP",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1263,
                    "name": "MAN, Tsz Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jason0121",
            "date": "Apr 23, 2023",
            "title": "",
            "comment_content": "L1: Introduction to Computers<br />L2: Arithmetic for Computers - I<br />L3: Instructions and Programs<br />L4: Arithmetic for Computers - II<br />L5: Computer Performance<br />L6: Single-cycle Processor Architecture<br />L7: Piplelined Multi-Cycle Processor Architecture<br />L8: Memory Architecture",
            "comment_teaching": "Professor MAN is a good teacher. He is a local teacher and his English is down-to-earth for local students.",
            "comment_grading": "HW 1 &amp; 2: 18%<br />Lab 1,2,3,4: 32%<br />Midterm: 20%<br />Final: 30%",
            "comment_workload": "The workload is not large compared to other courses. Although it is a 4 credit course, its workload is the smallest compared to other courses. The lab is very easy and homework is not difficult.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "88IJnuhttHUpcx520rxOybI5l59PrSc2",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "hahahahhh",
            "date": "Jan 28, 2023",
            "title": "good",
            "comment_content": "1- Instructions: Language of the Computer<br />2- Floating-Point Arithmetic for Computers<br />3- Integer Arithmetic for Computers<br />4- Computer Performance<br />5- Single-cycle Processor Microarchitecture<br />6- Pipelined Multi-cycle Microprocessor Microarchitecture",
            "comment_teaching": "教授的口音清晰<br />並且對理論的解釋十分的清晰<br />教授除了PPT還有很多筆記非常的有用",
            "comment_grading": "2 HW 18% (14.31%)<br />4 實驗 32% (31.36%)<br />期中 20% (60/100)<br />期末 30% (39.4/100)",
            "comment_workload": "雖然這門課的工作量在很多4學分的課程但是對比其他4學分的課程來說算是很輕的<br /><br />我們有 2-3 週的時間來完成 HW。<br /><br />每兩週一個實驗",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "50gio262fyC5qcpdyAtqdHsbQooKdxTS",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "LIANGSTEPHEN",
            "date": "Jun 02, 2022",
            "title": "",
            "comment_content": "Course Learning Objectives<br />Objective 1: Identify key computer hardware and software components and computer technology trends<br />Objective 2: Examine core instruction set architecture and assembly programming method<br />Objective 3: Use computer arithmetic techniques to represent and process data in computers<br />Objective 4: Use a range of methods to evaluate computer performance<br />Objective 5: Use a standard computer system design flow to systematically develop single-cycle processor architectures including datapath and control for an instruction set<br />Objective 6: Systematically develop basic multi-cycle pipelined processor architectures for an instruction set and handle hazards<br />Objective 7: Classify memory hierarchies and use cache to handle temporal and spatial locality in programs",
            "comment_teaching": "The lecture powerpoint may not be enough, it will be better to read with tutorial material. The reason lecture powerpoint may not be clear enough because there're a lot of things only explained in the lecture which do not show up in the powerpoint. Dr. MAN, Scottie's teaching is clear enough, it will be better to go to the lecture.&nbsp;&nbsp;The tutorial powerpoint provided by&nbsp;&nbsp;Mr. WU, Fox is useful for me, I recommend you to read it.",
            "comment_grading": "Homework 1: 9 % (Mean: 86.75)<br />Homework 2: 9 % (Mean: 79.14)<br />Lab 1: 8 % (Mean: 99.31)<br />Lab 2: 8 % (Mean: 98.75)<br />Lab 3: 8 % (Mean: 92.74)<br />Lab 3: 8 % (Mean: 90.58)<br />Midterm: 20 % (Mean: 44.6 STD:13.9)<br />Final: 30 % (Mean: 51.6 STD:20.274)",
            "comment_workload": "Only two homework assignments, take about two hours for each assignment, not extremely hard. And four labs, except for lab 1, the things you need to do in lab 2 3 4 is to write the result of the MIPS program and observe it, which you do not need to write the program by yourselves because it has already provided for us, it is not hard. Although the task in this course may not be difficult, it does not mean that the course is easy, we still need to put some effort to fully understand the organization of computer, cause it is not like math or physic, we can learn math and physic by solving problem, but computer organization require more observation and understanding, and I think it may be the reason the professor does not give us a lot of task, cause it will be better for us to test and observe the program by ourselves.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "byDVt29kiG34ejdTXZxKKbELCRllRZ1u",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1263,
                    "name": "MAN, Tsz Yin",
                    "rating": 1
                },
                {
                    "id": 191,
                    "name": "WU, Chi Hang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cat12345",
            "date": "May 27, 2022",
            "title": "Good course",
            "comment_content": "This is an introductory course to computer organization. The topics covered include instruction set architecture, assembly programming, computer arithmetic, computer performance evaluation, single-cycle processor design, multi-cycle pipelined processor design, memory system, and typical computer design flow.<br /><br />前半部份focus MIPS assembly language，即係連接programming language同machine language嘅部份。<br />後半部份focus different processors' design，processing stages required by different instructions in different kinds of processors.",
            "comment_teaching": "Prof. Man explains concept clearly，語速同聲線都唔會令人瞓着覺（even for 9點堂）有問題佢都好樂意答你，係好prof，雖然教唔切memory architecture有啲可惜<br /><br />Fox : Best TA in ECE department，tutorial會用examples去解釋同summarise different topics，非常有用。<br /><br />因為呢科網上資源比較少（可能係我揾唔到）所以都建議去上堂，兩位都教得好好。",
            "comment_grading": "Homework 1: 10 % (Mean: 80.64)<br />Homework 2: 10 % (Mean: 81.94)<br />Lab 1: 10 % (Mean: 93.38)<br />Lab 2: 10 % (Mean: 91)<br />Lab 3: 10 % (Mean: 84.48)<br />Midterm: 20 % (Mean: 56.22 STD:16.77)<br />Final: 30 % (Mean: 64.38 STD:23.64)<br /><br />My score: Homework &amp; Lab nearly full mark<br />Midterm: 94.X Final: 98.X<br />Letter Grade : A+<br /><br />Lab基本上code is given, 抄返啲results落lab sheet就ok, 難度不大。<br />Homework就比較考驗concept，要理解及套用去different situations<br />Midterm同Final 可以話係難版homework, closed-book exam for F2F，不過MIPS reference card is given，所以唔駛背code syntax。<br /><br />個人認為內容唔算難（雖然prof Man反復強調this is not an easy course）但真係require understanding，唔係靠背/應用exam skills可以過關嘅course。Aim高分的話MIPS好重要，同ensure自己理解個logic，清楚每一步嘅input, process, output係啲咩，tutorial同hw啲題目可以做多幾次，或者自己諗啲題目然後用DrMIPS嚟verify your answer。",
            "comment_workload": "對比其他ELEC 4cred course算細，得兩份hw同3份lab，lab半個鐘搞得掂，homework耐啲但都可接受，overall係好讀嘅。",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8AvKg0JagcDAx37GnMWOo5yr6nbkT6qX",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1263,
                    "name": "MAN, Tsz Yin",
                    "rating": 1
                },
                {
                    "id": 191,
                    "name": "WU, Chi Hang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cslun",
            "date": "Feb 25, 2022",
            "title": "F2F elec2350",
            "comment_content": "Introduction of Computers<br />MIPS Instruction Set Architecture<br />Computer Arithmetic<br />Computer Performance<br />Single cycle Processor Architecture<br />Pipelined Multi Cycle Processor Architecture<br />Memory Architecture<br /><br />將 hardware architecture同埋software instruction混合<br />前半部分MIPS,arithmetic,performance比較注重理解數字<br />後半部分Processor Architecture 比較注重data flow，例如係一段instruction嘅某個stage，registers,memory同埋ALU會store住咩data或者將會pass咩data",
            "comment_teaching": "Dr. MAN 教書質素還OK<br />學生不明白嘅内容會盡量解釋，不過教MIPS教太慢結果無教Memory Architecture<br />最後Memory Architecture無放落final<br /><br />TA: Mr. WU Chi Hang (Fox)<br />Tutorial 會將lecture無咁詳細嘅地方詳細解釋多次，有例子，比起有d照slide讀嘅TA好好多。唔係好忙嘅話唔好走Tutorial",
            "comment_grading": "2份Homework:20%<br />3次Lab:30%<br />midterm:20%<br />final30%<br /><br />Overall:84/100<br />Grade: B<br />可能因爲course内容簡單，好多人拿好高分<br />midterm同埋final時間很充裕，大概一半的時間就能完成",
            "comment_workload": "Workload 算細<br />Lab 係用MIPS將段assembly code run 一次然後將result抄落去<br />再加少少問題要你解釋為何得到那些答案<br />Homework量少，sem中一份sem尾一份。不過要認真做才可以滿分，内容不太艱難",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QGi7gEsYWpPgig5F1AIyPLd5368lhcck",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1263,
                    "name": "MAN, Tsz Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": ":)))",
            "date": "Feb 02, 2022",
            "title": "ee requirement 冇得唔讀",
            "comment_content": "學assembly code同CPU嘅datapath logic flow<br />CPU點樣由assembly code轉做machine code再計個答案<br />Midterm前教binary + assembly code<br />Midterm後教processor architectures<br />就係咁少 兩句講晒<br />睇落好難 其實好易 邏輯清晰啲就非常簡單<br />&quot;Nothing Magic, just 0 and 1&quot;<br /><br />▪Introduction of Computers<br />▪MIPS Instruction Set Architecture<br />▪Computer Arithmetic<br />▪Computer Performance<br />▪Single-cycle Processor Architecture<br />▪Pipelined Multi-Cycle Processor Architecture<br />▪Memory Architecture",
            "comment_teaching": "Prof幾後生 教得非常好 每個step都清楚解釋 唔係讀powerpoint<br />TA Fox都教得好好 <br />有上堂根本可以唔溫書考<br /><br />算係我讀過咁多ee course 教得最好最有心嘅兩個人",
            "comment_grading": "Homework: 20% (2份)<br />Lab: 30% (3份)<br />Midterm: 20 % <br />Final: 30 %<br /><br />MidTerm 80/100 (Mean 56.22)<br />Final 90.5/100 (Mean 63.38)<br />咁撚樣都係得B 好癲",
            "comment_workload": "HW同LAB都超簡單 開個DrMips出嚟照抄 1個鐘就搞掂<br />Lab可以唔去 有問題問先自己去<br /><br />要你做人肉complier 寫0101<br />Midterm 得幾條問題 一條一個topic<br />Final 考得5個Lecture <br />問題同Hw一樣 <br />我Midterm後冇上過堂 考前溫下LectureNote+Hw",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "g3GgVm11WCKlgz2tsDdmDRC51g8dAh6l",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 197,
                    "name": "KURSUN, Volkan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ming0826",
            "date": "Sep 06, 2021",
            "title": "",
            "comment_content": "This is an introductory course to computer hardware and software organization. The topics covered<br />include computing systems, computing programing, hardware-software collaboration, computer<br />arithmetic, computer hardware organizations and operations, parallel processing, memory<br />technologies and organization, and technology trends.",
            "comment_teaching": "great teaching. very patient and sincere at teaching students.",
            "comment_grading": "not bad grading. as long as you finished your homework. we have project instead of a final exam and I think that helps a lot.<br />Homework 10%<br />Laboratory 20%<br />Midterm Examination 30%<br />Final Examination 40%",
            "comment_workload": "HW and the final project were not that difficult. Labs are extremely easy.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IEnYiITj1nWEWfHLZO8ZDn7zpd7sVS2g",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 197,
                    "name": "KURSUN, Volkan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Henru",
            "date": "Sep 06, 2021",
            "title": "Decent course, not too time consuming",
            "comment_content": "Teaches ARM assembly, logic, and error corrections mainly. First few tutorials are mainly teaching assembly coding, the rest is helping you understand the lectures more.",
            "comment_teaching": "The professor is very kind and passionate about the subject. He does not mind stopping every now and then to answer questions, sometimes even giving hints for the homework.",
            "comment_grading": "Decent grading, personally kind of messed up in the homework part, but overall doesn’t require a lot of effort in order to achieve a B or up.",
            "comment_workload": "Homework: not terribly difficult, and knowledge taught in assembly coding is very advantageous to completing your homework quickly and easily.<br /><br />Labs: very simple, follow the instructions and you get answers, it’s more like filling in an excel sheet with step by step instructions.<br /><br />We didn’t have final exams but two ‘projects’<br />Projects: not really a project but more of a small coding assignment. The coding is not difficult, and can be considered trivial in other programming languages such as python or c++, the harder part is doing it in assembly code. The grading of the two are not strict, you get higher marks if your code is readable, efficient, and runs.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TWUdgPmmv7nhudM4ms06Nki5AOZIpaLH",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 197,
                    "name": "KURSUN, Volkan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cvbhuj117",
            "date": "Aug 25, 2021",
            "title": "Good course",
            "comment_content": "Introduction to Computer Organization and Design using MIPS.<br />go check other review for content.<br />This course is fun if you like computer. <br />background C/C++ syntax is recommended as C++ are used to explain and compare against the assembly code taught in this course. But you will do just fine even if you don't know C++(as long as you have any programming background) <br />The programming task itself in this course is simple, but coding in low level language could be quite time consuming.<br />I myself is a year 1 student when I am talking this course, but I do not find this course challenging , so if you are a year 1 student who is interested in CPEG, you can try taking this.",
            "comment_teaching": "Volkan is a good guy, he likes to ask question and interact with student. though he also likes to complains about the network connection and the construction happening during the lesson.",
            "comment_grading": "grade is quite good<br />Volkan dislikes the whole online exam thing so he ditched all exams lol.<br />Lab:18%<br />the labs in this course is extremely easy. guided procedures and guided questions means it's almost guaranteed full mark.<br />Homework:42%<br />Homework however is not that easy. around 4 piece of homework is given and each takes like a day to finish. I am sure that you could find some of the questions and answers on chegg but I would suggest you not, as Volkan and the TAs are actively catching and Failing cheaters.<br />Project:40%<br />Two small projects are given.<br />project 1(15%) is to create a 5x5 array with numbers inside using MIPS<br />project 2(25%) is to create a simple game of guessing the coordinate of the hidden treasure. (arrays are not involved in this one. but instead you need to do a lot of looping. Trust me, looping in assembly code is a real pain in the ass)<br /> I would've finished it in like a hour or two if I were to use python or C. but it almost took me 3 days to finish both project 1 and 2.<br /><br />I got 90% in project, 100% in lab and around 75% in homework and I got an A-<br /><br />HOMEWORK IS IMPORTANT. DO REALLY SPEND MORE TIME AND BE MORE CAREFUL WHEN DOING HOMEWORK.",
            "comment_workload": "I would say the workload is quite ok?<br />you get like a week or two for each homework though they are time consuming.<br />THE REAL PROBLEM IS THE PROJECT.<br />both project have the same due date so BE SURE TO START EARLY! I almost couldn't finish as I started really late.<br />otherwise it is really fine.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "26n1738yJbFq4GNw6fhmb9iVhEYEYEHh",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 197,
                    "name": "KURSUN, Volkan",
                    "rating": 1
                },
                {
                    "id": 171,
                    "name": "LEUNG, Tsung Hsien Johnny",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "garbage",
            "date": "Jun 07, 2021",
            "title": "PLEASE BRING ELEC2200 BACK, or at least MAKE ELEC3310 AVAILABLE ALL YEAR.",
            "comment_content": "1. Introduction to computers<br />2. Computer performance<br />3. 32-bit MIPS instruction set architecture<br />4. Arithmetic for computers (not covered)<br />5. Single-cycle processor architecture<br />6. Instruction-level parallelism and pipe-lining<br /><br />The content is not too much. It would give you a fundamental sense of how computer functions when you use high-level programming languages for coding. <br /><br />Dear ECE department, I don't know how you come up with the idea of omitting ELEC2200, but:<br /><br />PLEASE BRING ELEC2200 BACK, or at least MAKE ELEC3310 AVAILABLE FOR BOTH OF THE SEMESTERS.<br /><br />PLEASE BRING ELEC2200 BACK, or at least MAKE ELEC3310 AVAILABLE FOR BOTH OF THE SEMESTERS.<br /><br />PLEASE BRING ELEC2200 BACK, or at least MAKE ELEC3310 AVAILABLE FOR BOTH OF THE SEMESTERS.<br /><br />It is ridiculous to omit digital logic course in the curriculum since that is the fundamental of this course. It is utterly inappropriate and irresponsible to just omit such an important course from the requirements.",
            "comment_teaching": "The overall teaching is satisfactory. Professor Kursun delivered the lecture pretty well and always makes sure that people can keep up with this pace. Sadly this is his last semester at UST. <br /><br />Maybe some students who are very familiar with all these before hand thin the teaching is a bit slow, but for me I think it's good as I'm new to all these. <br /><br />The TA Johnny's teaching is nice and clear. He is also very patient when you email him to ask questions.",
            "comment_grading": "42% homework (x4)<br />18% labs (x4)<br />15% project 1 and report<br />25% project 2<br />On average, the mean for homework is about 65%, the mean for lab is about 94%. <br />The mean for project 1 and report is about 77%, the mean for project 2 is about 72%. <br /><br />I got about 87% on average for the homework, 100% for the lab, 98% for project 1 and report, 99% for project 2. I would update the final grade later.<br /><br />Result: A+, very good grade",
            "comment_workload": "The workload is really low. The 2 projects and homework are not hard. <br />However, you should be careful in homework as it is easy to make mistakes, and they cost you quite some marks. <br />Try to make your code look neat for the 2 projects and write good comments.<br />Also, try to do the projects early as you already have the knowledge to finish them a month before the deadline. It would make your final period easier.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JipXec7HWR35n82QUFCijnGofBM233ck",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1263,
                    "name": "MAN, Tsz Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MLWC",
            "date": "Feb 09, 2022",
            "title": "",
            "comment_content": "學assembly code同CPU嘅datapath logic flow<br />CPU點樣由assembly code轉做machine code再計個答案<br />Midterm前教binary + assembly code<br />Midterm後教processor architectures<br />就係咁少 兩句講晒<br />睇落好難 其實好易 邏輯清晰啲就非常簡單<br />&quot;Nothing Magic, just 0 and 1&quot;<br /><br />▪Introduction of Computers<br />▪MIPS Instruction Set Architecture<br />▪Computer Arithmetic<br />▪Computer Performance<br />▪Single-cycle Processor Architecture<br />▪Pipelined Multi-Cycle Processor Architecture<br />▪Memory Architecture",
            "comment_teaching": "Prof教得非常好 每個step都清楚解釋 唔係讀powerpoint<br />TA Fox都教得好好",
            "comment_grading": "Homework: 20% (2份)<br />Lab: 30% (3份)<br />Midterm: 20 %<br />Final: 30 %<br /><br />MidTerm 86.5/100 (Mean 56.22)<br />Final 98.5/100 (Mean 63.38)<br />都係得A",
            "comment_workload": "LAB多數係開個DrMips出嚟照抄<br />Lab可以唔去 有問題問先自己去<br /><br />要你做人肉complier 寫0101",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YBEvsGKALRvpk5TvUKaV1r71qptjNyFX",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1263,
                    "name": "MAN, Tsz Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "A.H",
            "date": "Jan 05, 2021",
            "title": "interesting course",
            "comment_content": "Introduction course of computer organization. It is mainly about MIPS.<br />ch1: introduction<br />ch2: instructions and programs<br />ch3: computer arithmetic<br />ch4: computer performance evaluation<br />ch5: single-cycle processor<br />ch6: multi-cycle pipelined processor<br />ch7: memory system",
            "comment_teaching": "Prof. MAN's teaching is quite good. He explains everything clearly with different examples, so it is quite easy to follow. If you really can't understand the concepts, you can ask him questions in Cantonese after the lesson.",
            "comment_grading": "Homework 1: 8 %<br />Homework 2: 12 %<br />Lab 1: 8 % <br />Lab 2: 8 %<br />Lab 3: 12 % <br />Midterm Project: 22 %<br />Final Project: 30 % <br /><br />Due to COVID-19, both mt and final exam changed to project.",
            "comment_workload": "I think the workload is fine.<br />2 HWs are not that difficult if you can follow the lecture.<br />There is a task for each lab, so 3 tasks in total. They are not hard at all, most are copy and paste with 1-2 LQs.<br />Mt and final projects are the hardest. It took me the longest time to finish them. Both of them are coding by using MARS and Dr.MIPS to finish the task in the project description. ( To avoid cheating, the tasks given to us are not the same as each other.)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Wzaz57gN1l0lERUmXjgRskocHg0q6KOh",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1263,
                    "name": "MAN, Tsz Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Xing",
            "date": "Jan 04, 2021",
            "title": "quite interesting",
            "comment_content": "This is an introductory course to computer organization. The topics covered include instruction set architecture, assembly programming, computer arithmetic, computer performance evaluation, single-cycle processor design, multi-cycle pipelined processor design, memory system, and typical computer design flow. Mainly about MIPS. No requirement for attendance.",
            "comment_teaching": "Prof.MAN's teaches quite well. He gives many examples to illustrate a concept and the explanation is very clear. And he will explain the logic circuits and flow step by step, which means there's no difficulty in following the lecture.",
            "comment_grading": "Homework 1: 8 %&nbsp;&nbsp;&nbsp;&nbsp;76.2/100<br />Homework 2: 12 %&nbsp;&nbsp;&nbsp;&nbsp;61.2/100<br />Lab 1: 8 %&nbsp;&nbsp;&nbsp;&nbsp;mean: 95.8/100<br />Lab 2: 8 %&nbsp;&nbsp;&nbsp;&nbsp;mean:&nbsp;&nbsp;87/100<br />Lab 3: 12 %&nbsp;&nbsp;&nbsp;&nbsp;mean: 86.2/100<br />Midterm Project: 22 %&nbsp;&nbsp;&nbsp;&nbsp;mean: 72.6/100<br />Final Project: 30 %&nbsp;&nbsp;&nbsp;&nbsp;mean: 72.7/100",
            "comment_workload": "The workload is fine. HW is quite easy if you fully understand the lecture notes. The time for you to complete the project is quite long.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "G152pEVz7WPt7Ay5UtcayL68wlpugsIQ",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 197,
                    "name": "KURSUN, Volkan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ilovecatsss",
            "date": "Dec 29, 2020",
            "title": "DO NOT TAKE THIS COURSE IF YOU HAVE A CHOICE",
            "comment_content": "Something about MIPS... thats all I remember after a whole year<br />Homeworks are pretty difficult, so make sure you find source beforehand if you don't wanna fk up this course",
            "comment_teaching": "um welp no idea i skipped all lessons haha fortunately he didn't force us to attend lessons with&nbsp;&nbsp;iprs",
            "comment_grading": "HORRIBLE GRADING<br />The main reason I decided to write this after a whole semester was mainly because of this. Initially i wanted to give this course a chance, thinking that it was only me who fked up the proj and got a shit grade,&nbsp;&nbsp;but judging from goop's reaction it seems that many people got c range in 2020 fall too so I wrote this review to warn whoever is planning to take this course: you might be better off taking COMP2611. <br />Originally, when I started taking this course, I was told that it only has hw (20%), midterm (30%)&nbsp;&nbsp;and final (50%), but then one week before the midterm, the prof just suddenly decided that it was not fair to hold online exams (??????) and decide to change the grading to hw (50%) and a final project. Seriously WTF after i fked up all hws and you tell me this????? And i didnt even know what my proj scores are, and I just directly got a C in the end :)",
            "comment_workload": "The workload is fine, since I didnt put a lot of effort in this course, there are only a couple of homeworks and a final project (which looks something like a comp assignment), but since this course is new and prof likes to make last-minute arrangements, this might not be the case for other semesters. Supposedly this course should have a midterm and a final, but it was replaced by a project instead.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}