{
    "error": false,
    "course": {
        "id": 314,
        "subject": "ELEC",
        "code": "2400",
        "name": "Electronic Circuits",
        "description": "Fundamental electronic concepts for DC and AC circuits, KVL and KCL, Thevenin and Norton Theroems, linearity and superposition, nodal and mesh analyses, sinusoidal steady state and phasor, transient analysis, transfer functions and Bode plots, op-amps, diodes, MOS transistors and related circuits.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"ELEC\" data-code=\"1100\" href=\"/review/ELEC1100\" target=\"_blank\">ELEC 1100</a> AND (<a class=\"course-link\" data-subject=\"MATH\" data-code=\"1003\" href=\"/review/MATH1003\" target=\"_blank\">MATH 1003</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1014\" href=\"/review/MATH1014\" target=\"_blank\">MATH 1014</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1020\" href=\"/review/MATH1020\" target=\"_blank\">MATH 1020</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1024\" href=\"/review/MATH1024\" target=\"_blank\">MATH 1024</a>)",
        "corequisites": "<a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1114\" href=\"/review/PHYS1114\" target=\"_blank\">PHYS 1114</a> OR <a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1314\" href=\"/review/PHYS1314\" target=\"_blank\">PHYS 1314</a>",
        "exclusions": "<a class=\"course-link\" data-subject=\"ELEC\" data-code=\"2420\" href=\"/review/ELEC2420\" target=\"_blank\">ELEC 2420</a>",
        "rating_content": 4.21,
        "rating_teaching": 4.27,
        "rating_grading": 4.45,
        "rating_workload": 4.18,
        "review_count": 33,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 173,
                "name": "CHOI, Ricky Yiu Kee",
                "count": 20
            },
            {
                "id": 1241,
                "name": "CHAU, Kevin",
                "count": 11
            },
            {
                "id": 172,
                "name": "CHEN, Kevin Jing",
                "count": 6
            },
            {
                "id": 205,
                "name": "MOK, Philip Kwok Tai",
                "count": 5
            }
        ]
    },
    "reviews": [
        {
            "hash": "m2ChBLgP5Ylp9HixFMCvwGnyJLJPhQ1a",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 172,
                    "name": "CHEN, Kevin Jing",
                    "rating": 1
                },
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JYee0101",
            "date": "Jan 22, 2020",
            "title": "",
            "comment_content": "This course is about a electronic circuits and their basics. It is fundamental and it is better to study hard in this course. This course includes materials from Fundamentals, DC analysis, AC analysis, Op amp, Capacitors, Inductors, Diodes, Transistors. We will have a better picture of how circuits work and their theories.<br /><br />Midterm :<br />Fundamentals<br />DC analysis<br />Op amp<br /><br />Final : <br />Fundamentals<br />DC analysis<br />Op amp<br />AC analysis<br />Capacitors, Inductors<br />Diodes",
            "comment_teaching": "The teaching flow of the lecture is pretty sleepy. I do think that the professor is teaching pretty well, but it is just that his voice is charming and sometimes it isn't easy to focus in class. However, this is fine since it will be more than enough to just read the lecture notes.&nbsp;&nbsp;The tutorials are VERY IMPORTANT. If you are planning to get a good grade in the midterms and finals, do go to the tutorials. Ricky teaches really nice and he makes every concept clear. As long as you are going to the tutorials and concentrate in it, it will be enough for you to solve the questions during the midterm and finals. Finally, the lab. The lab isn't so hard and does not require pre-lab. (Well it requires but it is just to read through the lab material which I doubt that anyone would do) Just follow the lab materials and remember to hand in the lab sheet once your done with the lab. It does not require lab summaries for your notice.",
            "comment_grading": "Eventually I got an A on this course even though I were expecting an A+. Well I think if you are considering to get A+ in this class, you must have at least almost a full mark on your midterm and final. Maybe above 96 I guess. I think the grading is quite fair though I don't think it is considered great. It would be easy to get an A but needs some work to get an A+. The gradings include homework(15%), labs(20%), midterm(25%), final(40%). <br /><br />My grading:<br /><br />Midterm : 100/100&nbsp;&nbsp;(Mean : around 75)<br />Final : 90/100 (Mean : around 75 too)<br /><br />HW1 : 60/60<br />HW2 : 70/70<br />HW3 : 48/60<br />HW4 : 50/50<br />HW5 : 50/50<br /><br />Lab : Full Marks",
            "comment_workload": "The workload is quite little. Five homework in total and labs every week which can do not request additional time besides the assigned lab period. If your concept is good and clear, the homeworks would be a piece of cake for you. Do be reminded that the AC analysis's homework would require a little bit more patience and needs quite a bit of time to calculate the answers. Other than that I do not think this course is hard or the workload is heavy at all, considering as a four credit course",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9fxDN169sCce6WdPyEOZNeFT1ZFPWm1G",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1241,
                    "name": "CHAU, Kevin",
                    "rating": 1
                },
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "69verynice",
            "date": "Dec 30, 2021",
            "title": "",
            "comment_content": "DC ad AC stuff, transient, OP Amp, frequency response and diode.",
            "comment_teaching": "Lecture: maybe boring for fast learners. Prof Chau has a special ability to combine reading slides and explaining stuff clearly. He explain all of the example in the ppt with clear steps, so it is helpful to a certain degree..... if you manage to stay awake. Most of the students skip all of the lecture<br /><br />Tutorial: It may be one of the best tutorial I had ever attended. Ricky can explain concepts in a fast and simple way, so try not to skip them.<br /><br />Lab: Disaster. More details in the Workload section.",
            "comment_grading": "Grading is good. I screwed up 2 out of 5 of my homework and the last lab, and thought that I am going to f up this course, ended up I was overthinking it.<br /><br />HW ~85%<br />Lab ~ 90%<br />Midterm 81/100<br />Final 92.5/100<br />Grade : A<br /><br />The content covered in this course is not complicated. At the same time, the mean of exams are not high, usually around 55%, so it is easy to get B or even A range.",
            "comment_workload": "5 HW and 5 labs(Lab 1 and Lab 5 are split into two, so 7 lab section in total).<br /><br />At first the workload is quite light, but it becomes more and more heavy towards the last month of the semester(after the midterm). 3 out of 5 HW are assigned at the last month, while the first two HW are assigned in the first two months, which means that the HW were given from a rate of one per month, to one per week instantly. Each HW take around 2 to 3 hours to finish. Be confidence with your answer will save you some time. Some answer, especially in the AC part, involve some ugly numbers. It is normal, double checking is enough, don't waste your time to do extra checking.<br /><br />Revision before exam: 2 days of preparation, completing past paper provided and the textbook exercise provided is enough. Try to understand all of the HW before exam is crucial, because if you could do so, your exam cannot be f up(I think exam is even easier than HW).<br /><br />The lab section is definitely hell. It is very easy for the first 2 labs, because it is just for you to familiarize with the equipment and the simulation software. But from lab 3 onwards, it took me an afternoon to a day to prepare(Yes, it is just preparing, not completing it). You may get stuck at some strange place and make zero progress for hours. Then you ask TA or TO during the lab, no one can help at the first half, just say 'your circuit have some problem then, try to find it out'. They will try to explain how the circuit works in theory, but the problem is my circuit don't work in reality. Understanding the theory doesn't mean that it is practical, that is why there is a lab section for us to gain hands-on experience. After 1.5 hour of struggling then someone come and tell me that 'somehow this circuit cannot use low resistance resistors, try using a different one' and it works. Aha so why am I wasting all of my time to 'find my mistake'? Now it is just one of the lab, there was another lab that triggered me even more. After hours of debug, I found that the lab manual was wrong. The same circuit shown in different place were connected in a different way, and some of them were right, some were wrong. I, unluckily, chose the wrong one to follow, so I wasted hours to find my mistake. As a result, I found that my mistake was believing the lab manual instead of myself. The workload could be light if the lab is less problematic.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "807Z6oujs9iad3c8xzuQyt1ojeOUfhcT",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 172,
                    "name": "CHEN, Kevin Jing",
                    "rating": 1
                },
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tisb1234",
            "date": "Jan 27, 2017",
            "title": "",
            "comment_content": "The content is not so hard, starting from basic electronic circuits to diodes and capacitors and inductors. The calculation can get little bit hard at the end of the course but homeworks can make you understand better.",
            "comment_teaching": "It was 9 AM class in the morning and I was one of 5~10 people attending lectures. The professor waited at least 5~10 minutes for these students who attended the lecture regularly. However, in terms of teaching, he was so monotonous and as this was 9 AM class, I had to fight not to fall asleep. Understanding his pronunciation was not difficult and he actually taught quite well.",
            "comment_grading": "I got 100 in midterm and I think it was 25%.<br />I did okok in labs (there were about 7 labs in total) and decent in homework. (I failed to get full marks in homework).<br />I got 98/115 with the mean around 65, the final was 50% (TA did not tell us the mean and sd specifically. he said the mean was around 65)<br /><br />I finally got an A at the end; I was expecting an A+ though...",
            "comment_workload": "There is really nothing so much to do for this course. Just follow the lab manuals and you can finish the lab within 2 hours (where the lab session is 3 hours). The homework can get a little bit difficult if you are trying to finish it one day before the deadline. <br />The concepts are not so hard but you need to understand complex numbers clearly if you want to score good marks in the final. This chapter was where I made so many silly mistakes.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fmNc45sYtf6REDZagdddqmqH3C7QRoii",
            "semester": "2017-18 Spring",
            "instructors": [],
            "is_author": false,
            "author": "anonymousnerd",
            "date": "Sep 07, 2018",
            "title": "",
            "comment_content": "Not very difficult, only a few topics throughout the semester. There is not much need to attend the lecture but the tutorials are very helpful. No need to memorize the principles just make sure you know the methods to do the calculations. Sometimes the calculations can be tedious though.",
            "comment_teaching": "Lectures mainly explain the principles of the calculation methods and give examples, but unless you are very interested in knowing more extra knowledge on the subject otherwise tutorials should be adequate.",
            "comment_grading": "Only 6 or 7 long questions in exam and should not be difficult if you attend tutorials and finish the homework yourself.",
            "comment_workload": "5 pieces of homework in total, each containing 6 questions. Similar questions will be taught during tutorials.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KvJG9qwMjNy0VF0CNHOUEDhqxoBofISV",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1241,
                    "name": "CHAU, Kevin",
                    "rating": 1
                },
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Duppy Conqueror",
            "date": "Jun 13, 2023",
            "title": "Like this and like that because I like it",
            "comment_content": "Get yourself familiarized with midterm content. Content difficulty after midterm increases exponentially.<br /><br />1. Fundamentals<br />2. Resistive Networks and DC analysis<br />3. Op Amp<br /><br />----- Midterm contents are above this line -----<br />----- Final contents are below this line -----<br /><br />4. AC analysis<br />5. Frequency Response<br />6. Transient Analysis<br />7. Diodes",
            "comment_teaching": "Professor Chau is okay but you will likely scratch your head on homework problems rather than actually listening to his lecture. :P<br /><br />On the other hand, going to Ricky's tutorial is a MUST. Pay attention to his &quot;like this and like that&quot;. The absolute chad teaches good while appearing to not give an f- about what's going on. Jokes aside, he explains stuff well. The A in teaching goes to Ricky.",
            "comment_grading": "Grading Scheme (2023 Spring):<br />- 10% Homework (5 Assignments, 2% each)<br />- 20% Labs (5 Labs, 4% each, but labs 1 and 5 consist of two parts)<br />- 25% Midterm Exam<br />- 45% Final Exam<br /><br />Exams are hard and dreadful this semester (check out the final exam statistics). Fortunately, it's not absolute grading. Therefore, stepping on mean will likely result in a B.<br /><br />Statistics for your reference:<br /><br />Overall performance:<br />Midterm Exam (out of 100 and before any appeal):<br />Low: 0<br />Mean: 51.3<br />Median: 52.0<br />High: 100<br /><br />Final Exam (out of 100 and before any appeal, dreadful stuff coming up):<br /><br />L1 (97 students) statistics:<br />Low: 0<br />LQ: 15.5<br />Median: 29.5<br />Mean: 32.47<br />UQ: 43.5<br />High: 96<br /><br />L2 (62 students) statistics:<br />Low: 1<br />LQ: 21.5<br />Median: 36.5<br />Mean: 36.12<br />UQ: 49.75<br />High: 86.5 <br /><br />My performance:<br />Homework: ~95/100<br />Labs: ~95/100<br />Midterm Exam: 84/100<br />Final Exam: 41.5/100<br />Overall: ~68/100<br />Letter grade: A-<br /><br />My conclusion:<br />It really depends on the crowd's performance :P<br />Try scoring heavily in the midterm exam as the contents are getting dreadful after midterm X_X<br /><br />Last but not least, return your lab kit at the end of the semester or they won't release your letter grade. XD",
            "comment_workload": "In general, get yourself a crew if you are going to take this course. I will further explain down below.<br /><br />1. Homework: Start working on your assignments right at their release<br /><br />- Questions are normal to hard difficulty, that's why you have to team up and solve the problems together. Struggling with homework together can give you the feeling that you are not alone, hence reducing stress.<br /><br />- You are usually given 2 weeks to complete them. However, DO NOT deadline fight them as they are time-consuming to solve, so time-consuming that they give you a total of 5 late days in case of you not submitting any of the assignments on time. Make good use of them if you happen not to finish them on time.<br /><br />2. Lab: Always do pre-labs and as many preparations as you can<br /><br />- Similar to homework, labs are time-consuming to finish. Yet, the 3-hour lab session is fixed. Not finishing labs on time is very likely to happen if you do not prepare for the lab. So good luck.<br /><br />- In some labs (Labs 4 and 5), a groupmate is required (as the lab is too time-consuming that they came up with this arrangement this semester). This adds to the reason why you are advised to team up.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dGNMwGB5bKzmQV70Bh5zfjj8En2UqS9F",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 172,
                    "name": "CHEN, Kevin Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ton618",
            "date": "Jun 09, 2022",
            "title": "",
            "comment_content": "Basic electronic circuits stuffs, nothing special.<br />- KCL KVL<br />- Diodes<br />- DC circuit analysis<br />- AC circuit analysis<br />- Transient analysis",
            "comment_teaching": "Lectures aren't the most important part but the tutorials are. TA Ricky does a fantastic job of explaining concepts, giving out examples and guide us through homework problems. Basically the tutorials feels far more useful and practical than the lectures in my opinion.",
            "comment_grading": "Fair<br />2% * 5 HW<br />20% Lab<br />25% Midterm<br />45 % Final",
            "comment_workload": "Normal.<br />The most time consuming and tedious part is performing the lab assignments at home, however, it could be easily done since all you have to do is follow the instructions according to the video tutorials and lab manual.<br /><br />Exam questions were similar to HW questions so it is recommended that you finish the HW by yourself and try to understand them.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cH0mmkeGHW2PT9uPMzDll9DWkSidUe2J",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1241,
                    "name": "CHAU, Kevin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Matthewjai",
            "date": "Jan 26, 2022",
            "title": "",
            "comment_content": "Fundamental electronic concepts for DC and AC circuits, KVL and KCL, Thevenin and Norton Theroems, linearity and superposition, nodal and mesh analyses, sinusoidal steady state and phasor, transient analysis, transfer functions and Bode plots, op-amps, diodes, MOS transistors and related circuits.<br /><br />Key: KVL, KCL, nodal analyses, BOde plots, op-amps, diodes",
            "comment_teaching": "Boring lecture (basically no need to attend the class)<br />Useful tutorials (better understand and study the tutorial notes)<br /><br />Actually,&nbsp;&nbsp;Prof Kevin and TA Ricky are nice. They are willing to teach you patiently even the asm.",
            "comment_grading": "Midterm and final examination is similar to the assignments. Try to understand and calculate the questions in assignment. If do so, it is easy to above the mean. <br /><br />Mean= B-",
            "comment_workload": "Lab*5 : 20% (The last lab is rly hard) <br />Asm*5 : 15%<br />Midterm : 25%<br />Final : 40%",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0c0yC2vTHd0OzUvZpfUkOuKgXC0EMReN",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1241,
                    "name": "CHAU, Kevin",
                    "rating": 1
                },
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ruozhilaji",
            "date": "Dec 30, 2021",
            "title": "",
            "comment_content": "DC analysis<br />AC analysis<br />OP-AMP<br />Frequency response and transient analysis<br />Diodes<br /><br />less content than a 1000-level math course",
            "comment_teaching": "I did not go to lectures and tutorials. But I met Ricky at the paper checking session of midterm and final. I think Ricky is quite friendly and has a passion for teaching.<br /><br />However, labs are terrible and messy...Sometimes I received a wrong notification about my lab answer sheet...",
            "comment_grading": "The exams are quite direct and mainly test the ability in applying what you learned. Most of the questions are easier to calculate than the homework.<br /><br />I attach my approximate marks for you.<br />full marks for lab2,3,4,5a+b, 90% in total for lab1a+b.<br />full marks for hw2-3, 90% for hw1,4,5.<br />98.5 in midterm and 85.5 in final<br />The above leads to an A+.",
            "comment_workload": "The labs are time-consuming. Since I am not good at these engineering things, it took me about 4-5 hours to finish each lab. <br /><br />Some questions in the homework are also time-consuming. I remembered that I got 4 different answers in 5 times of calculations for one AC analysis...<br /><br />I heard the exams contain some content only discussed by Ricky in the tutorials. But I still think there is no need to go to any lecture and tutorial. Teaching yourself by calculating each example on the lecture notes is enough. The time you spend on lectures and tutorials may not let you raise your grade dramatically. <br /><br />The workload is generally light.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HtFblxydc9mAupgTwgEFoxDMZRKMVwS6",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1241,
                    "name": "CHAU, Kevin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Z",
            "date": "Dec 29, 2021",
            "title": "",
            "comment_content": "Circuit analysis techniques including<br />DC Analysis<br />AC Analysis<br />Operational Amplifier<br />Frequency Response<br />Transient Analysis<br />Diode<br />Contents are quite easy if you simply want to get correct answers for all the questions.",
            "comment_teaching": "Actually, I skipped most of the lectures, so please refer to others' reviews for the lecture.<br /><br />For the tutorial, Ricky is great. He explained everything clearly and fast. Therefore, you can only attend the tutorials every week to know how to solve the homework or exam questions.<br /><br />For the lab, TAs are approachable and friendly. If you have anything unclear, you can ask them. They may even debug your circuit and point out what is wrong for you.",
            "comment_grading": "Minor mistakes in hws and labs, 86 for midterm, 98 for final -&gt; A+<br />Be careful with the numbers. If you have a careless mistake, you may lose the score for the entire problem.",
            "comment_workload": "5 homework, each takes 2-3 hours.<br />5 labs (lab1 and lab5 are split into two halves). You can use the lab time to finish the work. Or you can finish it in advance at home. Two of them are kind of heavy to finish within the lab session.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "q5SgxbrR1wgaeuni4MDXqwBEDFjUo7Rf",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1241,
                    "name": "CHAU, Kevin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "shitMan",
            "date": "Dec 29, 2021",
            "title": "Good grade, but not a fun course",
            "comment_content": "DC analysis, AC analysis, OP-AMP, frequency response, transient, diodes. Not many...",
            "comment_teaching": "Kevin has good English. He always try to give us something more other than just the lecture notes. For example he will teach us to read the schematic... not very helpful indeed. There are quite a few people attending the lecture, but I would say if you follow the pace of the lecture, you will ace, although the explanation is sometime not very detailed which will take you some time to understand by your own...<br /><br />Ricky's tutorial is very practical, it covers a lot of things in the HWs and exams. He will answer your questions via whatsapp, which is helpful. However, the grading speed of the teaching team is super slow, a lot of HWs are graded at the end of the semester.",
            "comment_grading": "I think the grading is excellent, if you are not aiming at A+. I fucked up one lab and one HW, 85/100 in midterm and 84.5/100 in final, got an A. Not to be offensive, there are a lot of students who do not study hard and get low mark in the exam, so the means of both midterm and final are just around 50 for in fact a quite simple exam( ps. what I meant simple is that if you do proper revision, you can at least get 70/100.)<br /><br />but if you aim at A+, see others' posts. Horribly you need to get very high in everything.",
            "comment_workload": "Actually very small for a 4 credits course, just 5 HWs, each of which will give you around ten days to finish. 5 labs, the labs are time consuming, so be prepared ahead.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fO4fn5R4xiBf04ZFx6mOFCn3V1bP3khi",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1241,
                    "name": "CHAU, Kevin",
                    "rating": 0
                },
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "AceOfSpades",
            "date": "Nov 30, 2021",
            "title": "An ELEC course that tries to pop your veins throughout the entire semester",
            "comment_content": "The course covers fundamental electronic concepts for DC and AC circuits, KVL and KCL, Thevenin’s and Norton’s theorems, linearity and superposition, nodal and mesh analyses, sinusoidal steady state and phasor representation, frequency response, transfer functions and Bode plots, op amps, transient and diode circuits.<br /><br />Upon completion of the course, students are expected to understand and use simple electronic circuits as functional building blocks and tools.",
            "comment_teaching": "The head of the TA team was helpful in answering questions in lab, but the team of this course led by the lecturer in general has a questionable sense of time management and tends to work at their own pace, leading to inconvenience of both students of the TAs themselves.<br /><br />One instance of this is the return of lab kits, where students were expected to return on the final day of laboratory according to the very first lecture slides. This was honestly more preferable and efficient than having to reserve another day after the Fall term classes.<br /><br />Some mistakes were found in a few lab manuals, notably the +6V/-6V circuit in lab 5b. Some of these were fixed with a revised version, but others were not and students were left to figure it out on their own, often resulting in a lot of confusion. The instructions are also unclear, very often we were told to use a different method than the manual to complete the task on the day we attend our lab sections, for example, finding out the resistor values of an equalizer in lab 5a. Those of us who prepared outside lab ahead of time had to redo it due to the late announcement.<br /><br />In addition, scores were handed out in an untimely manner, with some of the laboratory grades released almost two months after the assignment date.<br /><br />The tutorial slides were also poorly designed, consisting only diagrams and graphs but no text. I find it difficult to refer to these slides for revision even if I had attended the tutorial classes.<br /><br />The lecturer has a tendency to read slides. Feel free to skip them and refer to tutorials.",
            "comment_grading": "Labs (4% x 5)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Homework (3% x 5)&nbsp;&nbsp;&nbsp;15%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mid-term and final exam will include some similar questions<br />Mid-term&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;25%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />Final Examination&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;40%",
            "comment_workload": "Homework is manageable, with only 5 assignments throughout the entire course.<br /><br />Lab assignments are probably the easiest of all. We are allowed to bring the lab kits back home, so you can complete the labs at home ahead of time before going to the respective lab sections. Labs 3, 4 and 5b will take a lot of time, so you will want to do some of the tasks on your own first.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "en0oZxopdIfWH0NQsuE7gt1vzBlL1S8b",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                },
                {
                    "id": 172,
                    "name": "CHEN, Kevin Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "garbage",
            "date": "Jun 02, 2021",
            "title": "Worth taking.",
            "comment_content": "DC analysis, AC analysis<br />Operational Amplifier<br />Circuits and Systems<br />Steady-state Analysis<br />Diodes<br /><br />I wouldn't say the content is not much. <br /><br />If you only focus on exams, yes, the amount of content is very little and the questions are very similar to homework (which only consists of specific types of questions). <br /><br />However, if you really go over the lecture notes, you would find that this course is trying to give you some basic ideas of circuit design which are quite interesting. It would be very beneficial to ponder and think about the designs if you want to do integrated circuit design (analog) in the future. <br /><br />(But they wouldn't test circuit design, all you need to know is the way to calculate them using KCL if you only want to get good grades with no such pursuit. )<br /><br />-----------------------------------------------------<br /><br />UPDATE: <br /><br />I think this course teaches too little, way way way too little. There is a huge gap between ELEC2400 and ELEC3400. It would be better if this course or ELEC1100 includes some more detailed introduction on BJT and MOSFETs.",
            "comment_teaching": "The professor's teaching is a bit boring, but you can tell that he definitely knows a lot about circuit design. <br /><br />Ricky's tutorials are very useful if you want to pass this course with good grades.",
            "comment_grading": "The grade has not come out yet. <br /><br />You need to be careful in midterm and final as you would lose the majority marks of the questions you do wrong. <br /><br />Midterm: 86/100 (mean: 54)<br />Final: 99/100 (mean: 64)<br /><br />Update: I got an A+.",
            "comment_workload": "The workload is not huge. The majority of the workload is brought by the labs, which are interesting but time-consuming at the same time. Better start doing the labs before-hand. Come to face-to-face labs if possible because the TAs who are in charge of the labs are SUPER NICE. They would actually help you a lot and teach some additional stuff about the lab which are very useful. You can still get a full mark even if you failed to complete the lab during your session but succeeded to complete the lab within one week after the lab session. <br /><br />For the final, I suggest doing the past papers of ELEC102. Although ELEC102 contains 3400 stuff that you do not know, the diode questions are really worth doing.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bdEEJJVkrMzEIDsAx4dV2PEQUMcLv8zv",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chungsan77",
            "date": "Sep 11, 2020",
            "title": "Good Course",
            "comment_content": "Electronic Circuits<br />Fundamental electronic concepts for DC and AC circuits, KVL and KCL, Thevenin and Norton Theorems, linearity.<br /><br />The circuit question is easy!",
            "comment_teaching": "Ricky is a good instructor, his tut must take attention.!!<br />The lecture can leave! Because the tut enough to handle the homework and exam.",
            "comment_grading": "final 91/100 above mean 1sd<br />mid tern: 6x/100 below 0.5 sd<br />HW: 15%<br />my final grade: B+<br /><br /><br />Lab 20% + Hw 15% + Midterm 25% + Final 40%<br />Carefully: the question not hard so the curve is high.",
            "comment_workload": "just some homework, not big<br />Homework also can clean your concept, so please do it",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "F89cp20fD1N0sFCUlZtFGZhALf0YDEcj",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1241,
                    "name": "CHAU, Kevin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KI1",
            "date": "Jan 27, 2023",
            "title": "",
            "comment_content": "Fundamental electronic concepts for DC and AC circuits",
            "comment_teaching": "Will provide a lot of detailed material for your learning. Professor teaching is good but boring. He is enthusiasm to answer student questions. Lab and tutorial TAs also have good teaching.",
            "comment_grading": "Not difficult to get high score. <br />20% labs, 10% Homework, 25% midterm, 45% final.<br />Hard to get high grade. The overall mean range is about 60 to 65. I got 94.6% and only have A.",
            "comment_workload": "5 homework. It is easy to finish to acquire the knowledge. And 7 labs to do. The labs need to spend more time. It is not hard to do the labs assignment but it does not need the knowledge&nbsp;&nbsp;to take the midterm and final. Overall, workload is acceptable.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Piiej3vAgHhDbNGeg2IOAjOf0WnQTGpE",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1241,
                    "name": "CHAU, Kevin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KHK",
            "date": "Jan 22, 2022",
            "title": "",
            "comment_content": "Fundamental electronic concepts for DC and AC circuits, KVL and KCL, Thevenin and Norton Theroems, linearity and superposition, nodal and mesh analyses, sinusoidal steady state and phasor, transient analysis, transfer functions and Bode plots, op-amps, diodes, MOS transistors and related circuits.",
            "comment_teaching": "lectures are useless<br />tutorials are better<br />study by yourselves is the best way<br />you can find some Indian youtuber to save you on youtube",
            "comment_grading": "above mean is not difficult",
            "comment_workload": "lab every week (have to pre lab)<br />5 assignments (not difficult if you attend the tutorials)<br />mid term <br />final exam",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "E6Sm6aPCToymjBJP3NAPwCEaPVHhso8A",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1241,
                    "name": "CHAU, Kevin",
                    "rating": 1
                },
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "高海千歌",
            "date": "Dec 29, 2021",
            "title": "Not very difficult course, but lab requires improvement",
            "comment_content": "1. Introduction (Basic concepts such as voltage, current, power, etc.)<br />2. DC analysis<br />3. AC analysis<br />4. Operation amplifier (opamp)<br />5. Frequency response<br />6. Transient analysis<br />7. Diode<br /><br />Basically, the whole course is again teaching you how to calculate voltage and current from looking at a circuit diagram, but with some new circuit components (opamp, diode, etc.) or concepts (transient analysis). However, those concept are not very difficult at all. Even though you got lost in ELEC1100, you can catch up here if you work hard. Moreover, the difficulties are not as horrible as PHYS1114 so don't afraid even though you screw up that.<br /><br />Better remember KCL and KVL by heart and master them because no matter what new concepts or components are added, you will use these two things always. When you see a &quot;T&quot; crossroads or &quot;+&quot; crossroads in the circuit diagram, applying KCL at there always helps you to proceed.<br /><br />I think the most challenging part of this course is not the content. Instead, it is the lack of confidence on your answers. It is not uncommon to encounter a situation that even yourself are doubted on your own answers, especially when you see a lot of ugly numbers or lengthy expression. When you are checking answers with others, you will discover that 10 people will have 10 different answers and you will become afraid. Therefore, try to put more confidence so that you can do exams calmly and won't freak out. That may rather give you better result.<br /><br />Another thing is CAREFULNESS. Since the topic is not really hard, you may become less alerted. Here are some examples (DON'T do them)<br />1. Overlook / Reverted a +ve / -ve sign (very often and severe for students)<br />2. Overlook 5k as 5<br />3. 1/(10i) = -10i (i = imaginary number)<br /><br />Please pay extremely attention when you are solving questions, ESPECIALLY THE +VE / -VE SIGN. For this course, the +ve / -ve sign is even more fatal than the number itself. Careless mistakes may cost you one subgrade.",
            "comment_teaching": "Prof. Chau's teaching is somewhat good. The accent is not heavy and explanation is clear. However, the teaching pace is slow. If you do not have strong absorbing power like me, then you will feel appropriate. However, if you are average UST student who has strong absorbing power and big brain, you may find it is too slow and you want to skip class.<br /><br />Nevertheless, Prof. Chau is nice and he is very willing to answer our questions. I remember once we keep asking him questions and he is late for a meeting XD. Therefore if you meet any confusion feel free to ask him.<br /><br />The TA Ricky is excellent. He extracts all information which is required for the exam. He also teaches may skills and tactics for dealing with exams (Such as how to distinguish +ve / -ve voltage or whether two components are in series and parallel). Sometimes he will also discuss the homework problem. Although it looks exam-oriented, I think this is what tutorial should do so I highly appreciate it. If you want to perform well in exam, then you must attend the tutorial.<br /><br />However, the thing which need to be criticized is the lab. Just like another comment suggested, the lab arrangement is somewhat messy. It looks like there lacks coordination between prof and TAs. Once after class prof Chau ask us about lab, he looks like knowing nothing and I need to explain the flow of the lab to him. Moreover, some lab TA seems don't know what is going on and give unclear instruction. Also it looks like the TA personnel is not enough for the lab as many student don't know what is going on <br />(yeah everyone don't know what is going on) and keep asking question.<br /><br />Then, the lab manual occasionally appear flaws or mistakes. The one that mostly impacts me is that in lab 5b, the circuit assembly on different pages are inconsistent. I follow the manual and make a short circuit accidentally. WHAT? When I take out the battery, I found it is extremely hot and I burn my hand momentarily. I think I nearly burn my house because of this lab manual. <br /><br />Last thing is that the workload of different labs are not very stable. Some are very easy and you can finish it in like 1 hour. But for some it is very troublesome and many students cannot finish it within the 3 hours. For lab 5b, the workload is like 1.5x to 2x of other labs and I screw it up very well. To be honest, lab 5b is a complete disaster for me (The mean of lab 5b is a disaster as well) <br /><br />In conclusion, I an satisfied with the prof and TA teaching (this part I can give a A) but I am dissatisfied with the lab (I will give a D, but on average I still give B as I still appreciate the effort of prof Chau in lecture and Ricky in tutorial). I think the lab needs more improvement",
            "comment_grading": "Grading is good. The mean is not very high (like around 50%~60%) even though the difficulties is on average (If this is a COMP course, I think the mean will be at least 80%...).<br /><br />Grading scheme:<br />Labs (4% x 5)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Homework (3% x 5)&nbsp;&nbsp;&nbsp;15%&nbsp;&nbsp;&nbsp;<br />Mid-term&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;25%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />Final Examination&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;40%<br /><br />Prof. closed the canvas and I cannot check the mean and my grade specifically... If it is available later I will update. <br /><br />Roughly speaking, <br />1. Homework : ~95%<br />2. Lab : ~90% (fk lab 5b)<br />3. Midterm : 80/100<br />4. Final : 87.5/100<br /><br />Final grade : A<br /><br />I think it is not that hard to get A range, but it is another story for A+. Anyway, this course has a high cost-effectiveness so try to put more effort in it.",
            "comment_workload": "Workload is moderate for a 4 cred course.<br /><br />1. Homework<br />5 homework in total. It is not very difficult since the questions are straightforward. However, sometimes it may become tedious (especially when dealing with AC) so try to start doing it earlier and double-check before submitting it. <br /><br />Moreover, try to form small groups or at least find a friend to do it together so that you can enhance efficiency and check answer<br /><br />One advice : Try to make everything in the homework clear because exams will ask similar things.<br /><br />2. Lab<br />Problematic part<br /><br />At the beginning of the semester, everyone will get a set of lab kit (EVERYONE so no group and freeride. You can form group externally to do together though). The lab kit needs to be returned at the end of the semester so don't lost it or destroy it. <br /><br />During the lab, you need to finish all the tasks specified on the lab manual. Do demo to the TA and fill in a lab summary sheet. Things look easy but sometimes is not. Therefore, one advice is that try to do pre-lab or even finish some tasks at home first so that you won't be that stressful during the lab period<br /><br />3. Midterm &amp; Final exam<br />In short, PRACTICE MAKES PERFECT<br /><br />The exam in this course is nothing tricky. All questions are asking you to calculate V and I, which is similar to homework and straightforward. Therefore, try to do as much exercise as you can. Make sure you can solve the homework problem or past papers by your own quickly and accurately. <br />Prof. will provide you a few sets of past paper (For me is 2 mt and 2 final), PLEASE DO THEM as I really found out that they reuse some questions. If you can master the exercise problem then you won't have problem. The remaining thing is being calm and careful in the exam.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "8vpfHNrKUyz498CYMIoc8unAivcZx9fu",
                    "name": "midterm_stat",
                    "format": "jpg"
                }
            ]
        },
        {
            "hash": "advBRmti4SQodGRdYZtGz5z1pomicC6l",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DrainGang",
            "date": "Jun 01, 2021",
            "title": "Not Bad",
            "comment_content": "1. Fundamental concepts<br />2. DC analysis<br />3. AC analysis<br />4. Operational Amplifiers<br />5. Frequency response<br />6. Transient Analysis<br />7. Diodes<br /><br />Most of the chapters are quite easy, chapter 5-6 are slightly more difficult compared to other chapters. The math involved in this course is VERY simple, the point is that you need to know what numbers to use.",
            "comment_teaching": "Lectures: mediocre, professor just repeats what is said on the powerpoints, the powerpoints are decently made with many examples, but steps are sometimes skipped making it confusing to understand, but it is doable. Teaching quality is poor on some chapters, particularly chapter 5 and 6, due to a lack of visualization.<br /><br />Tutorials: MUST ATTEND! Ricky is an incredible tutor and explains concepts extremely well, if you are taking this course you must attend his tutorials, he teaches at a very fast pace, however so you need to pay attention, but it is 100% worth your time, one of the best tutors I've ever met in UST, he even prepared a 2 hour long tutorial before the final, absolutely incredible.",
            "comment_grading": "20% Labs<br />Follow the instructions and build the circuits at home (quite fun actually!).<br /><br />10% Homework<br />5 homeworks, all are VERY similar to exam questions, make sure you try to do them and understand the questions as they are good practice for both the midterm and exams.<br /><br />25% Midterm<br />consists of numerical, computational questions, covers the first 3 chapters, if you have went to Ricky's tutorials and did the homework it should be manageable. Mean: 56/100<br /><br />45% Finals<br />Similar to midterm, computational questions, covers all chapters. Mean: 65/100<br /><br />Overall I got 5% higher than mean, got a B, not particularly good, but at least its not a B-.",
            "comment_workload": "Light especially for a 4 credit course.<br /><br />Labs only take around 1-2 hours for you to complete before the lab, and you just need to demo the circuits during the lab, does not take a lot of time and 90% of the lab is just following the manual, for numerical answers you should cross reference with your classmates.<br /><br />Homework is also quite simple, you should absolutely do them yourself, since the questions on the homework are VERY similar to what you will see in the exams. It is also recommended that you cross reference with your classmates to ensure you didn't have any careless mistakes.<br /><br />Take some time to do questions to prepare for the midterm, just studying the lecture notes is not effective.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xUZrLhnnKiVUYX1wod7pe0TRwwoRIhP9",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1241,
                    "name": "CHAU, Kevin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "xixixi",
            "date": "Apr 21, 2021",
            "title": "Requirement of EE students",
            "comment_content": "Basic hardware knowledge:<br />DC &amp; AC circuit / op amp / transient analysis / diode / frequency response.<br />Lab content is not that relevant to what you have learned in lectures but you may learn something about hardware following the lab manual.",
            "comment_teaching": "Great teaching but you may go through exercises and solutions on lectures by yourself. By the way, a great tutorial given by Ricky, highly recommend you to attend his tutorial session.",
            "comment_grading": "Lab 20%<br />Homework 15%<br />Midterm 25%<br />Final 40%<br />Great grading for my not quite good final score",
            "comment_workload": "Average workload: a lab every week, you need to prepare in advance, 1 homework per 2-3 weeks, and a midterm and final exam, not that heavy.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "h1me7AtERawgIFyFvndDTWDuGrNT4IK8",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "節瓜",
            "date": "Jan 21, 2021",
            "title": "good course",
            "comment_content": "學基礎電路<br />KCL，KVL同Thevenin and Norton Theorems還有其他，<br />但總體難度不大，只要有基本的電路分析能力，呢個course系非常易學",
            "comment_teaching": "Ricky好好人，教得通俗易明，只要問就一定會講解，而且講得好清楚，一點就通，上tutor都唔會悶，氣氛好。",
            "comment_grading": "mid tern: 6x/100 above mean 1 sd<br />final: 唔記得左，系正mean<br />my final grade: B<br />Lab 20% + Hw 15% + Midterm 25% + Final 40%",
            "comment_workload": "5HW,5Lab<br />唔算多，而且題目的內容會同mid tern， final 類似，所以功課要認真做，考試就容易過，清concept一流！",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UXP6QnItmMW6TuH290JOKzicgPlLk069",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                },
                {
                    "id": 172,
                    "name": "CHEN, Kevin Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "shadowtungtung",
            "date": "Aug 13, 2020",
            "title": "Ricky is the fun and good!",
            "comment_content": "1.Fundamental concepts<br />2.Basic Circuit Theorems and Nodal analysis<br />3.Mesh analysis and DC Equivalent circuit<br />4.DC Dependent circuit &amp; Operational Amplifier<br />5.Operational Amplifier<br />6.AC Circuit<br />7.Transient Analysis<br />8.Diode Circuit<br />9.Semiconductor and Transistors",
            "comment_teaching": "The lectures are quite boring. If you have already taken DSE physics or 111x lv physics, you will find it easy at the beginning of the semester. <br /><br />The tutorials are useful and fun! If you listen carefully and understand what he taught, then you can do a good job. You need to be familiar with the questions in tutorials like the basic concept of DC and AC circuits, KVL and KCL, Thevenin and Norton Theorems, linearity and superposition, nodal and mesh analyses, transient analysis, transfer functions and Bod plots, op-amps, diodes, MOS transistors and related circuits.",
            "comment_grading": "I don't remember the exactly scores of the mean. Both means in Midterm and Final are around 75-80. <br />I get both around 85-90 in midterm and final.<br />Finally, I got a B+.",
            "comment_workload": "The workload is not heavy.<br /><br />There are around 5 Assignments. The assignments are a little bit hard and you cannot find a beautiful answer in AC circuit homework. The assignments are helping you to clear your concept. If you know how to do the homework, you will find that midterm and final are not very hard. <br /><br />The labs are quite fun. The concept of the labs is based on the lectures. Finally, you can build a car and test it with a light source, then the car will do the turning movement. If you have anything not clear during the lab time, just ask the TA, they explained quite clear and patient. Good!",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FAkjByiUsqC6g14ab3hqnsh1qmgazl9C",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                },
                {
                    "id": 205,
                    "name": "MOK, Philip Kwok Tai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kelvin Y",
            "date": "Jul 28, 2020",
            "title": "Listen to Ricky. He is the man.",
            "comment_content": "Basic stuff about circuits like the diode, op amp, inductor, capacitor.",
            "comment_teaching": "Honestly I fell asleep quite a bit in the lectures, and I didn't find them as helpful as the tutorials. <br /><br />RICKY CHOI THE TA IS A BEAST!!! He talks really fast so it was hard to keep up sometimes, but he teaches well. Make sure you understand everything he teaches, if you do then you will do well.",
            "comment_grading": "I did pretty well, well above mean in midterm and final. I forgot the numbers but I know I did well.<br /><br />Final grade was A-",
            "comment_workload": "Labs were related to the lectures more than the tutorials. I didn't listen much in the lectures so I didn't do so well but with some googling and help from friends and TAs I did ok.<br /><br />Assignments test you on the concepts taught in the tutorials, they are good practice.<br /><br />Midterm and final is based on knowledge from the tutorials so use the assignments to help you study.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IpT7PsLRQoV2pIqFdRQovXRdfmLSvjOk",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JLee",
            "date": "Jun 01, 2020",
            "title": "work hard play hard",
            "comment_content": "This course is about a electronic circuits and their basics. It is fundamental and it is better to study hard in this course. This course includes materials from Fundamentals, DC analysis, AC analysis, Op amp, Capacitors, Inductors, Diodes, Transistors. We will have a better picture of how circuits work and their theories.<br /><br />Midterm :<br />Fundamentals<br />DC analysis<br />Op amp<br /><br />Final :<br />Fundamentals<br />DC analysis<br />Op amp<br />AC analysis<br />Capacitors, Inductors<br />Diodes",
            "comment_teaching": "The teaching flow of the lecture is pretty sleepy. I do think that the professor is teaching pretty well, but it is just that his voice is charming and sometimes it isn't easy to focus in class. However, this is fine since it will be more than enough to just read the lecture notes.&nbsp;&nbsp;The tutorials are VERY IMPORTANT. If you are planning to get a good grade in the midterms and finals, do go to the tutorials. Ricky teaches really nice and he makes every concept clear. As long as you are going to the tutorials and concentrate in it, it will be enough for you to solve the questions during the midterm and finals. Finally, the lab. The lab isn't so hard and does not require pre-lab. (Well it requires but it is just to read through the lab material which I doubt that anyone would do) Just follow the lab materials and remember to hand in the lab sheet once your done with the lab. It does not require lab summaries for your notice.",
            "comment_grading": "Eventually I got an A on this course even though I were expecting an A+. Well I think if you are considering to get A+ in this class, you must have at least almost a full mark on your midterm and final. Maybe above 96 I guess. I think the grading is quite fair though I don't think it is considered great. It would be easy to get an A but needs some work to get an A+. The gradings include homework(15%), labs(20%), midterm(25%), final(40%).",
            "comment_workload": "The workload is quite little. Five homework in total and labs every week which can do not request additional time besides the assigned lab period. If your concept is good and clear, the homeworks would be a piece of cake for you. Do be reminded that the AC analysis's homework would require a little bit more patience and needs quite a bit of time to calculate the answers. Other than that I do not think this course is hard or the workload is heavy at all, considering as a four credit course",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6P1N8cAvhuxRVAF3Q4RKf8o8LmXAyiCP",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "smallpotato tom",
            "date": "May 30, 2019",
            "title": "",
            "comment_content": "Course Description:<br />The course covers fundamental electronic concepts for DC and AC circuits, KVL and KCL, Thevenin’s and Norton’s theorems, superposition, nodal analyses, phasor, transient analysis, transfer functions and Bode plots, op amps, diodes, and related circuits. Upon completion of the course, students are expected to understand and use simple<br />electronic circuits as functional building blocks and tools.<br /><br />Chapters:<br />Before Midterm<br />1. DC Analysis<br />2. Op Amp<br />After Midterm<br />3. AC Analysis<br />4. Transient Analysis<br />5. Diodes<br />6. Transistors",
            "comment_teaching": "No comment for the lecture.<br /><br />Tutorial is much more important than lecture because those homework and exams are taught in the tutorial class.",
            "comment_grading": "Labs 20%<br />Homework 15% <br />Midterm 25%<br />Final Examination 40%<br /><br />Midterm: Mean or Median 70/100<br />Final: Mean or Median 39/100<br /><br />I got a score above mean about 0.4 sd in midterm and a score above mean about 0.6 sd in final, and nearly full marks in other stuff, B+ was given.<br /><br />TA said that mean is about B to B-.",
            "comment_workload": "5 sets of homework and Labs consumed a lot of my time. But there are enough sources or references for assistance. Homework is important for revision because those questions are quite similar to those in exams.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2pdhtIcGlvW7ohCkxaNyaK9CDSAh5IHk",
            "semester": "2016-17 Spring",
            "instructors": [],
            "is_author": false,
            "author": "EdisonCHAN",
            "date": "Dec 13, 2017",
            "title": "",
            "comment_content": "The content is simple before midterm. Starting from Midterm, the content was getting a little bit harder.",
            "comment_teaching": "The lecture teaching is quit boring.(I nearly skipped all the lectures.)<br />However, the tutorial is quite interesting and useful for HW and exam. If you want to get a fair grade, you should attend it.",
            "comment_grading": "The Grading is good if you put more effort on it. However,if you make careless mistakes, you may obtain B+ only.(just like me..)<br /><br />The lab mark and homework are easy to get nearly full mark.<br />Midterm is not difficult but it is easy to make careless mistake.<br />Final is fine if you understand the concept and do some ex. on it.",
            "comment_workload": "WORKLOAD is quite fair since we only have the lab once every two weeks. But if you have other course that also have lab, that will be tough.<br /><br />The HW is not that difficult because the tutor will explain some key concepts during the tutorial.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "c5kKgjGCqtHoefdbBogO3iKlFjOe2jeA",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 172,
                    "name": "CHEN, Kevin Jing",
                    "rating": 1
                },
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "EJY",
            "date": "Jan 20, 2017",
            "title": "Not a hard one",
            "comment_content": "The content is quite basic. Starting from Ohm's Law, the course teaches essential parts of electronic circuits. After finishing this course, we should be able to understand the construction of the components and their function.",
            "comment_teaching": "Professor CHEN can speak English quite well with almost no accent. To be honest, his oral English can be the most enjoyable one compared to other mainland professors'. However, when talking about teaching, I would like to say that it was quite boring. The professor would just read the lines on the ppt. In addition, since it was a 9 a.m. class, there were only 3 people attended the lecture when it approaches the end of the semester.<br />Ricky was an enthusiastic TA. He's knowledgeable and passionate all the time. He's also responsible for the course. If there's a time conflict between your schedule and his tutorial, he would like to offer you an individual one as long as you ask him to do this favor. Meanwhile, he also arranged the review sessions before midterm and final exams. He's a lovely guy. :)",
            "comment_grading": "The grading is quite good. Getting full marks in the midterm won't be challenging. However, the final exam would be harder and you need to prepare it well.",
            "comment_workload": "The workload is quite light. Although it's a 4-credit course as ELEC 2200, the time required is less than ELEC 2200. There won't be lab session every week although it's shown in the schedule. The homework will be covered in the tutorials after Ricky finished the basic stuff. Just follow the professor and Ricky and you'll find that it's not a big deal.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "maVe2JERcmck15MIVhhYxHzE7S0qBuUb",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 205,
                    "name": "MOK, Philip Kwok Tai",
                    "rating": 1
                },
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tony JI",
            "date": "May 31, 2016",
            "title": "",
            "comment_content": "Laws for solving electronic circuits:<br />KCL, KVL, Thevenin and Norton Theroems, superposition, nodal and nash analysis, Opamp, ac, transient analysis, transfer function, diodes, transistors,",
            "comment_teaching": "Attending only tutorials is enough to pass all the exams for this course, while letures are more about extension and implementations of the circuits. Ricky teaches with passion and will let you understand every key concept. The exam only focus on calculating, and everything other than calculating seems useless to learn in this course. <br />Being familiar with the calculator will be a plus when taking the exams. Use a 100$ casio calculator to deal with the comlex numbers will be a lot faster than searching in google or wolfram.",
            "comment_grading": "5%HW + 20%Lab + 25%Mid + 50%Final.<br />A range is really easy to attain,<br />Mid+0.63SD; Final+1.2SD &gt;&gt; A<br />HW solutions probably can be attained via pspice.",
            "comment_workload": "Sometimes the HW will be difficult, for example, complex numbers took me a lot of time but still every check gives me a different number. Reviewing doesn't take a lot of time, thus the total workload is light.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JP8xzr9gKPvluooQwxiNAj7VTl9uCnbW",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 205,
                    "name": "MOK, Philip Kwok Tai",
                    "rating": 1
                },
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Aye",
            "date": "May 31, 2016",
            "title": "",
            "comment_content": "How to do exercises about circuits.",
            "comment_teaching": "Go to tutorials and they will be enough for exams.<br />For me, labs themselves are difficult if you want to understand them entirely. But finishing them is not difficult unless you meet with annoying bugs (I have met several times. But they allow late submission without penalty).",
            "comment_grading": "Labs (4% x 5)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Homework (1% x 5)&nbsp;&nbsp;&nbsp;&nbsp;5%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />Mid-term (1)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;25%&nbsp;&nbsp;&nbsp;&nbsp;<br />Examination&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;50% <br /><br />Before taking this course, I just knew that, in order to get A+, one should get nearly full marks. So now i will provide some statistics and hope this will help you to get a clearer idea about the grading.<br /><br />Almost 100% Lab(except one of them 79/80)+100% Homework+97/100 Midterm+109/115 Final =&gt; A+ <br /><br />Midterm: average =67.7/100, std=29<br />Final: average=67.6/115, std=26.9",
            "comment_workload": "5 homeworks which are very helpful for exams. Please ensure correct answers.<br />A calculator which can calculate with complex numbers will be very helpful for homeworks and exams.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "r9iSt6YbP6wT4rg1Lspsl4cq9rz8Y09C",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 205,
                    "name": "MOK, Philip Kwok Tai",
                    "rating": 1
                },
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Fiona",
            "date": "Aug 17, 2015",
            "title": "",
            "comment_content": "This course is just about the basic analysis of circuit. One midterm, one final.",
            "comment_teaching": "The instructor's English is pretty nice, just a bit dull. Yet he did not spend a minute on useless things, basically just going through example after example. <br /><br />For exam, just follow Ricky(TA), then you will be fine. The coverage of the lecture is a lot wider than required in the exams. <br />For lab, just follow the instruction ,pretty standard.",
            "comment_grading": "The grade is alright. As the material is not that hard, you would probably need a near full mark to get an A+.",
            "comment_workload": "Just like other ELEC courses, it has some regular homework. It is pretty basic, nicely fitted for the exams. Not a lot of workload.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H76hoK40qHvXeSggb2QceW1xdgojmKuF",
            "semester": "2022-23 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Djonathan",
            "date": "May 25, 2023",
            "title": "",
            "comment_content": "First half of the semester is about DC analysis. You are recommended to really pay attention during this time as it's going to be used until the end of semester. The second half of the semester is all about AC analysis, which is very similar to DC analysis. If you have sufficient knowledge about DC analysis, then AC analysis would not be a problem.",
            "comment_teaching": "The tutorial by Ricky is very useful. You can skip the lecture and still get a pretty nice grade (above mean is possible).",
            "comment_grading": "Overall the grading is fair.",
            "comment_workload": "The workload is acceptable. There would be homework every 2 weeks and lab in every week. It's possible to do the lab at home and it's recommended to do so.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VpG8rfszNnKnZ9fSYUGjCo9W0R0Io3Zo",
            "semester": "2020-21 Spring",
            "instructors": [],
            "is_author": false,
            "author": "hinjaiii",
            "date": "Nov 07, 2021",
            "title": "",
            "comment_content": "quite boring, professor teaching very boring. Just attending Ricky's tutorial is enough. Also, the tutorial will be teaching how to do homework.<br /><br />DC analysis, AC analysis<br />Operational Amplifier<br />Circuits and Systems<br />Steady-state Analysis<br />Diodes",
            "comment_teaching": "Ricky's teaching is very good",
            "comment_grading": "good grade, midterm below, final slightly above mean,get grade B",
            "comment_workload": "5 labs in total, but ta is very helpful<br />4 homework, but it is easy to handle after attending the tutorial.<br />1 mid term<br />1 final<br />I think most of the workload is from the 5 lab,some of them are very difficult",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H4LVGmiRkROr30lsPR6AHmqc8D9Nf7UM",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 205,
                    "name": "MOK, Philip Kwok Tai",
                    "rating": 1
                },
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ken",
            "date": "Aug 08, 2015",
            "title": "",
            "comment_content": "這科比較其他2字頭course簡單, 主要是教KVL and KCL, Thevenin and Norton Theroems, superposition和op amp. <br /><br /><br />Ps:準備一個能算複數的計算器",
            "comment_teaching": "唔上 Lecture 都得, tutorial TA ricky 教得更容易明白. Ricky 教學更生趣",
            "comment_grading": "",
            "comment_workload": "Workload不太大, 有5次homework ,midterm 1個同1個final . Tutorial 會教晒你做homework既 方法, 返屋企2個鐘到就做到完.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "orKtgygG1eYtdoTp10bz2iOnKBtfBKin",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 173,
                    "name": "CHOI, Ricky Yiu Kee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ben少",
            "date": "Jan 21, 2021",
            "title": "",
            "comment_content": "學基礎電路<br />KCL，KVL同Thevenin and Norton Theorems還有其他，<br />但總體難度不大，只要有基本的電路分析能力，呢個course系非常易學",
            "comment_teaching": "Ricky好好人，教得通俗易明，只要問就一定會講解，而且講得好清楚，一點就通，上tutor都唔會悶，氣氛好。",
            "comment_grading": "mid tern: 6x/100 above mean 1 sd<br />final: 唔記得左，系正mean<br />my final grade: B<br />Lab 20% + Hw 15% + Midterm 25% + Final 40%",
            "comment_workload": "5HW,5Lab<br />唔算多，而且題目的內容會同mid tern， final 類似，所以功課要認真做，考試就容易過，清concept一流！",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XJOvRkVt40ncpucLhBFDamGVEx5cwsTh",
            "semester": "2021-22 Winter",
            "instructors": [],
            "is_author": false,
            "author": "存勖",
            "date": "Aug 20, 2022",
            "title": "",
            "comment_content": "Fundamental electronic concepts. Need to take lab.",
            "comment_teaching": "A detailed lecture. Give enough materials for you to learn. What appeared in the exam is always what you have learned in class. It's not difficult to understand the course. Lecture notes is detailed.",
            "comment_grading": "The exam is not difficult but a high score is needed to get a good grade.",
            "comment_workload": "The amount of homework is just enough for you to master the subject not hard to finish it. The lab really need some time. You need to get ready for any unexpected problems.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}