{
    "error": false,
    "course": {
        "id": 1370,
        "subject": "ELEC",
        "code": "4320",
        "name": "FPGA-based Design: From Theory to Practice",
        "description": "This course introduces the basic theory and design skills for FPGA-based design.  The course aims to equip the students with enough knowledge and skills for the real world engineering using FPGA devices. Major topics include introduction to reconfigurable computing, hardware description language, FPGA device, and mapping flow. Students will gain hands-on experiences of the complete FPGA-based design cycle, from design specification, synthesis, implementation and simulation in this course.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1710,
            1610,
            1510
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"ELEC\" data-code=\"2300\" href=\"/review/ELEC2300\" target=\"_blank\">ELEC 2300</a> OR <a class=\"course-link\" data-subject=\"ELEC\" data-code=\"2350\" href=\"/review/ELEC2350\" target=\"_blank\">ELEC 2350</a> OR <a class=\"course-link\" data-subject=\"ISDN\" data-code=\"4000F\" href=\"/review/ISDN4000F\" target=\"_blank\">ISDN 4000F</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.8,
        "rating_teaching": 4.6,
        "rating_grading": 4.4,
        "rating_workload": 4.4,
        "review_count": 5,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 198,
                "name": "ZHANG, Wei",
                "count": 4
            }
        ]
    },
    "reviews": [
        {
            "hash": "1ykCOd84Ak15Vek9xPReYcXEc3AlXTxQ",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 198,
                    "name": "ZHANG, Wei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kenbyuen",
            "date": "Jan 22, 2020",
            "title": "",
            "comment_content": "4 Labs + 3 HWs + Midterm(cancelled for this semester) + Project<br /><br />The labs require students to fill in Verilog code in the given files. It gets quite difficult in the last two labs.<br /><br />Students need to select a projects from a given list at the end of the course. A proposal and report needed to be submitted.",
            "comment_teaching": "The course has no tutorials with only lectures and lab sessions.<br /><br />The lecture is little bit boring as Prof. Zhang spend quite a bit of time on a single slide. But she will kindly answer your questions so I don't think she is bad. You will learn most of the content during lab sessions if you have a little bit of knowledge about FPGA.",
            "comment_grading": "Typical grading of a ELEC course. The mean is around B. Not a bad grading course.",
            "comment_workload": "You need to spend quite a bit of time finishing the lab if you are not familiar with Verilog. The homeworks are not super easy except the first one so quite a bit of time is spent finishing it. And there is a project report. So if you don't mind spending some time learning verilog and debugging. It is not that bad.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "e2ndlLsL88CqA5X4PSmMWgpws4WvDjb5",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 198,
                    "name": "ZHANG, Wei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gdhdsv",
            "date": "Jan 01, 2023",
            "title": "",
            "comment_content": "An introductory course to FPGA programming and digital hardware design using Verilog.<br /><br />lecture involves:<br />Basic Verilog<br />FPGA IP Blocks/resources<br />mapping, routing, placement, implementation algorithms<br />high level synthesis(HLS)<br /><br />4 Labs:<br />1. get familiar with fpga board and Verilog and Vivado.<br />2. digital piano<br />3. basic processor design and K-means algorithm engine<br />4. pipeline matrix multiplication engine and HLS<br /><br />and a mini project.<br /><br />Overall, I learnt some basic Verilog and how fpga works. It is an interesting course for those who are very into hardware and want to work on the hardware industry, especially digital hardware design, because you can learn Verilog, which is the basic requirement of that area.<br /><br />The labs let you to design a hardware from templates given. Those labs are interesting and let you to gain some actual experience on hardware design. The topics are interesting too.<br /><br />The mini project let you to build a hardware module from none unlike labs. You can really put that on your cv if you finish that. The topics are interesting too.<br /><br />You need to have good understanding of digital circuit before taking this course. For example, you took elec 3310 / elec 2200. The official requirement elec 2350 is related to this course but it didn't teach much about digital circuit. On the other hand, if you took elec3310 and did well in that course, you would find this course very easy.",
            "comment_teaching": "Prof. Zhang teaches clearly. She is also knowledgeable in this area. <br /><br />But there are only one 2-hour lecture per week, so maybe she really doesn't have time to teach many things. She basically repeats the lecture notes and adds some additional examples on the whiteboard. <br /><br />Therefore, the lectures aren't really that important if you understand the lecture notes.",
            "comment_grading": "hw 20%, I got 17.9%<br />lab 20%, I got 18.75%<br />midterm 30%, I got 25.8%<br />team project 30%, I got 30%<br /><br />Overall I got 92.45%, the mean is around 85% I guess.<br />and I got A-.<br /><br />Fair grading, not super good but not bad as well.",
            "comment_workload": "If you know Verilog or related HDL well, the workload of labs and project can be easy and low for you. <br />Else, you may find it very difficult and confusing for you. You should find a clever partner then.<br /><br />HW will be easy if you understand the lecture notes well. You can find the same type of questions and examples in the lecture notes. <br /><br />Midterm is open book. Therefore, if you understand the lecture notes well, it is like the HWs.<br /><br />Overall, the workload is higher than average 3-credit courses.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JUxeaPb9dBYU0LB3GQxAllE9YvRlxNaU",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 198,
                    "name": "ZHANG, Wei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wwwwwwwwww",
            "date": "Feb 14, 2023",
            "title": "A useful course",
            "comment_content": "L1 Introduction to Reconfigurable Computing/Logic Design Background<br />L2 Verilog Programming-I<br />L3 Verilog Programming-II/Xilinx Synthesis Tool<br />L4 Reconfigurable Devices – I<br />L5 Reconfigurable Devices – II<br />L6 Reconfigurable Devices – III<br />L7 Mapping Flow and Algorithm<br />L8 High-level Synthesis - I<br />L9 High-level Synthesis - II<br />L10 Design with other tools <br />L11 Processor-Based Design<br />L12 Design Case Study",
            "comment_teaching": "The content is well selected and well explained, but the lab's progress is always faster than the lecture.",
            "comment_grading": "Homework – Total 3 (Total 20%)<br />Laboratory and Reports (Total 20%)<br />Midterm (30%)<br />Term Project (30%)<br />◦ 15-20 minutes demonstration",
            "comment_workload": "The workload is quite heavy, but the laboratory and homework always help me to understand the topics. The instruction of the lab is not very clear, you may need to ask TA so many times to know what you are doing. The final project also requires time and effort to finish.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "S2L8GfCg5uaYHT99DlK3o4puIIKkRWLG",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 198,
                    "name": "ZHANG, Wei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Fuzhengyu",
            "date": "Jan 30, 2023",
            "title": "You have to learn by yourself",
            "comment_content": "Basic FPGA concepts from hardware description language to hardware synthesis.",
            "comment_teaching": "Teaching is horrible!!!! The instructor tried her best to read every word on the slides clearly. The only thing you could get from attending the lectures was the current teaching progress.",
            "comment_grading": "Grading is pretty good, actually. I was slightly above for all written assignments and did pretty well on the final project. I got A+ for this course.",
            "comment_workload": "The final project is everything. Anything can go wrong except the final project. The good news is that the final project topics are fixed every year; there are a lot of examples from previous semesters that you can take a look at. It took me 2 hours to finish every assignment on average. And I spent only 2 days on the final project. I am quite skillful in this field. But I believe even for an average ECE student, the workload is fair and even a bit light for a 4000-level course.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Dak4SftEc4tHSJAGBKvGla6yu7jRm1g1",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "我愛樓主",
            "date": "Jun 07, 2022",
            "title": "A useful course for you to find a job",
            "comment_content": "Lec:<br />Week 1 Introduction of reconfigurable computing concept and basic synthesis<br />flow on FPGA<br />Week 2 Introduction of Verilog language and basic Verilog syntax<br />Week 3 More syntax and semantics on Verilog using design examples<br />Week 4 Reconfigurable device about simple and complex programmable<br />logic devices (PLDs)<br />Week 5 Introduce FPGA overall structure; Detailed discussion on<br />configurable logic blocks<br />Week 6 FPGA interconnect architecture and on-chip coarse-grain resources<br />including BRAM, DSP, clock control, etc.<br />Week 7 Mapping flow for FPGA implementation; Introduce technology<br />mapping algorithm<br />Week 8 Introduce the placement and routing algorithms for FPGA<br />implementation<br />Week 9 Design flow for the design using system generator and Matlab<br />Simulink<br />Week 10 Design flow for high-level synthesis, using C as input language and<br />Vivado synthesis tool<br />Week 11 In-class Midterm Exam<br />Week 12 Design flow for system-level design with embedded hard/soft<br />processor core together with FPGA co-processor<br />Week 13 Case study of some representative design <br /><br />Lab:<br />1. Xilinx FPGA – Introductory Lab<br />2. XIlinx FPGA – Digital piano<br />3. Xilinx FPGA – Simple Microprocessor<br />4. XIlinx FPGA - Matrix multiplication in high level synthesis",
            "comment_teaching": "The lecture is a little bit boring. You will learn most of the content during lab sessions if you have a little bit of knowledge about FPGA.",
            "comment_grading": "3hw<br />4lab<br />1mid term<br />1project<br />no exam<br />Good grading of an ELEC course. The mean is around B to B+. Not a bad grading course. If you study hard in the Mid term and project you will get a good grade.",
            "comment_workload": "The Lab can finish within an hour but the project needs more time to do.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 3,
            "attachments": []
        }
    ],
    "composer": []
}