{
    "error": false,
    "course": {
        "id": 306,
        "subject": "ELEC",
        "code": "1020",
        "name": "Media Production: Technology and Design",
        "description": "The course focuses on both the high level design concepts for creative multimedia marketing, as well as equipping the students with the necessary tools to manipulate digital media. The course covers theories such as strategy formulation, company branding, human perceptions, as well as fundamental implementation skills such as audio data processing, special image effects, and video handling techniques.",
        "categories": [],
        "website": "http://course.ee.ust.hk/elec1020",
        "credits": 3,
        "semesters": [
            1830,
            1730,
            1630,
            1530,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"ELEC\" data-code=\"4170\" href=\"/review/ELEC4170\" target=\"_blank\">ELEC 4170</a>",
        "rating_content": 3.81,
        "rating_teaching": 3.81,
        "rating_grading": 4.06,
        "rating_workload": 2.69,
        "review_count": 16,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 158,
                "name": "SHE, James",
                "count": 12
            }
        ]
    },
    "reviews": [
        {
            "hash": "bMw8Pzpx46kevW5WMmfHqoXjJHrkYYHe",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 158,
                    "name": "SHE, James",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wyiLe",
            "date": "Aug 21, 2018",
            "title": "Learn to create your own contents",
            "comment_content": "In the lectures, everything Prof She taught us surrounded the topic of media in nowadays. Techniques of using different media production softwares will be taught in tutorials instead of the lectures. Prof She will only be teaching how these are used in the &quot;media&quot;, and the actual hands on experience rely on the tutorials. You will at least learn the very basic skills to use many of the popular production software like Photoshop, Premiere, After Effects, and Audition.",
            "comment_teaching": "There are not a lot of people in the class, so you will get to learn a lot regarding learning how to use the softwares - Photoshop, Premiere, After Effects, and Audition. You will be spending maximum of 2 Turorials on each of the softwares, you can actually learn quite a lot from that. Really useful if you are into producing contents of your own.",
            "comment_grading": "Grading will depend on your final group project, your assignments (which will be done and handed in during tutorials), and a mid-term exam. Grading is generally really good as long as you do everything assigned to you. <br />The final group project is basically a task where you will have to combine all knowledge you learnt through this course, and work with a group of 4, and create a short film.<br /> There will be a real short presentation for your final project.",
            "comment_workload": "It depends on you, if you enjoy working with those softwares, it will not be that hard for you. But if you are not too interested, it might be a pain in the a** for you, since for the whole semester, you will have to be working with them (the softwares).You will be assigned an assignment each tutorial, which it acts as a consolidation of your knowledge after the tutorial, basically you will just have to apply what you have learnt in the class, and add a bit of your creativity to complete the tasks.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4JWaU4vFSNvDvk2p2fr0WN4ZzyRsuJ5w",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 158,
                    "name": "SHE, James",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sparkler",
            "date": "Aug 10, 2017",
            "title": "Most Creative Course in UST",
            "comment_content": "The course content is very useful if you love creation. Adobe photoshop, affect effect, audition, Google web designer<br /><br />They taught many software and you can use it in the future.",
            "comment_teaching": "James is a hongkonger. He is friendly only his voice is a little bit boring.",
            "comment_grading": "I had experience in designing and eventually got B range. <br />I dont know whether it is good grade or not as they didnt provide mean and SD of the midterm project and final project.<br /><br />There is no exam. One-paged open book midterm and 2 project,<br />One individual one group.",
            "comment_workload": "A bit heavy if you dont have any background of those software.<br />The lab will have weekly homework and the midterm project is individual. Setting up a interactive CV using web designer. Many CS ppl will come and they seem know everything. <br /><br />Final project is a group of 5-6 which is to shoot a 30s video which needs technique.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "on6ygiXQIzVNo8ThRNpG4Il8DYS7RLQd",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 158,
                    "name": "SHE, James",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mayx95",
            "date": "Jan 25, 2016",
            "title": "Mixture of innovative ideas and technical skills.",
            "comment_content": "Course content included: basic concepts and skills in Adobe Photoshop, Adobe Audition, HTML5 animations, Android App development, video making, and so on. Labs and lectures consisted of different aspects of the mentioned topics, both of which were interesting to me. The skills taught were carefully designed so that it was not too hard for students with no background (which also means it was a little boring for students with background).",
            "comment_teaching": "James was a great professor with lots of energy and passion in what he taught, and he taught the course quite well. With slides, examples and guest speakers, the lectures were pretty interesting.",
            "comment_grading": "I got an A+ in the course, but please notice that I got quite strong backgrounds in the topics of the course. That being said, as far as I know the grading was overall satisfactory. James did not grade the assignments and project based solely on how fancy the techniques were, but focus more on how innovative the ideas were and how much efforts the students put in designing their works.",
            "comment_workload": "There were several assignments which were fairly easy if you follow what the TA said in the tutorials. There was a short midterm exam, and it was just a test on how you understood the lectures, so not a hard one as well. The harder parts are the midterm project and the final project. Midterm project was an individual project on HTML5 animation, it took some time for me to make and took even more time to design. The final project was a group project that required students to design and produce a multimedia advertisement for one of the several given campaigns of NGOs, it again took time to do well. So overall, the workload is on average level, if you are a person like me who enjoys all these multimedia productions and designs, it would be worthwhile to put in some efforts and enjoy the pleasure of creation.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0yIgDRMUKrvJMQ4UBFJgdZIy6DPPEnvd",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 158,
                    "name": "SHE, James",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jameslyuen",
            "date": "Sep 04, 2019",
            "title": "",
            "comment_content": "Great balance of design and technology concepts. Well suited for business students who are more interested towards marketing.",
            "comment_teaching": "Concepts delivered clearly and at a suitable pace. Both the professor and TAs are supportive and open for help.",
            "comment_grading": "Generous grading. A lot of feedback given throughout the course for students to improve their grades. Also there are a wide range of tasks for improving grades.",
            "comment_workload": "Two major projects that involve video editing. The workload will feel fine if the student is interested in video editing. Lab sessions are compulsory as each session have required tasks that count as a part of a student's grade.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "djm6RV9hcbSZT2NjwWWp7yHWydZQR7Tm",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 158,
                    "name": "SHE, James",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bloody",
            "date": "Jun 25, 2019",
            "title": "",
            "comment_content": "FUCK THE FACEBOOK PAGE DLLM IT IS GODDAMN 21 CENTURY AND WE USE THE FUCKING FACEBOOK SUBMITTING HW AND EVEN MIDTERM AND FINAL THEY DONT EVEN BOTHER USING GROUP INSTEAD THEY SET THE PAGE TO PUBLIC CLS<br /><br />Actually, nothing useful taught in lecture. It teaches you knowledge about adobe software. But in lab TAs will teach you exactly how you use and how you make a product. Lab is more important than lecture.",
            "comment_teaching": "The professor is a nice guy, but weird too. He loves Zach King.<br /><br />Beware of this video https://www.youtube.com/watch?v=SzP0R_4vhd8",
            "comment_grading": "I have no idea what the fuck is going on<br /><br />Pretty easy to get a beautiful grade. But dont have a clear system showing grades. Lab is a must. There are a midterm exam but it allows you taking notes and using laptop so it is actually not a problem. No final exam but have a midterm and final project. Midterm project is individual while final project is group project. Cause you many time to finish it so prepare for it 2 weeks ago.",
            "comment_workload": "2 assignments per week. One basic task and one creative task. You must finish the basic task during lab session. It is super easy to finish while there are TAs helping you out. The real problem is the creative task. There is no way you can finish both tasks during lab session after the first few times. You have to finish it before tmr's 12:00noon. People who don't have premiere pro in your computer must finish the project in lab or lc. Especially when most of them are videos it took you so may time to finish it. Strongly suggest you free up your time after the lab so you can continue your work. The lab is opened until night.<br /><br />Some assignments is group work so find some good teammates and work together on final project. Dont worry the professor concern whether you can make frds more than you do.<br /><br />Submitting all your work, including midterm and final project in a MOTHERFUCKING PUBLIC FACEBOOK PAGE. So you will need a fake account.",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "N5g2fF9atMjrtFx7l1qGGECC1cJfoneW",
            "semester": "2017-18 Spring",
            "instructors": [],
            "is_author": false,
            "author": "InfiniteThanos",
            "date": "Feb 16, 2019",
            "title": "Very good course but really hands on",
            "comment_content": "Basic technological concepts related to media production (e.g., concepts on digital image, video, and audio) are taught in brief but down to point manner. Furthermore, the course incorporate less technical subjects, such as storytelling, into the discussion, which made the course more manageable.",
            "comment_teaching": "Lectures are interesting and well prepared. Weekly lab sessions are offered to develop hands-on skills as well as deepen the theoretical understanding that was not fully mature just from the lecture.",
            "comment_grading": "Very good. The course claims that they give 30% of the A-range. The distribution shows that the median will be around B+ to A-",
            "comment_workload": "Tough but it can pay off with an A.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ibm9B9Y29ijsH0ehnivnD2Hjz6bbYA9p",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 158,
                    "name": "SHE, James",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gimme_lenggrade",
            "date": "Aug 20, 2018",
            "title": "",
            "comment_content": "cover a lot of adobe clouds thing but because too much so cant learn one reli deep <br />but i think it's a good 入門 course <br />Will learn story boarding too <br />But i think learning the google design application is a waste of time",
            "comment_teaching": "Professor is very nice and willing to help <br />Not boring <br />Lots of videos to watch <br />TAs are very nice and smart and helpful <br /><br />PEOPLE IN THIS CLASS IS AWESOMEEEE",
            "comment_grading": "Okay lah <br />If you dont have bg and not much art sense dont expect a very good good grade coz some people reli smart and have sense <br />Do all work and go all lab should be okay to leng grade",
            "comment_workload": "workload is crazy though <br />please do not overload and take this course you are suiciding <br />But it is a great course to take if you wanna learn about adobe and like to do productions <br />very good training",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "L2CdlflybRJn3bn1q1UdjLDkH0rHzcMV",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 158,
                    "name": "SHE, James",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tommy kong",
            "date": "Jun 30, 2018",
            "title": "努力不一定和成果成正比",
            "comment_content": "学多媒体 / 广告设计之类的东西<br />- Adobe Photoshop<br />- Adobe Audition <br />- Adobe Premiere<br />- Adobe After Effect<br />-Google Web Designer<br />（很basic的東西）",
            "comment_teaching": "教學方式是會有點悶，因為用lecture hall，空調強但少人上课，但如果用心聽還是有用的，有時會播一些youtube上的廣告讓我們參考。TA呢。。。。。。呃。。。。。。。有些TA是真的會讓你很無言，你有問題找他后他二話不說就去找另外一個TA幫你，然后有時TA給的意見不像意見，反而是一種“你媽媽是個女人”這種理所當然的話。",
            "comment_grading": "- In Class Activity-8%<br />- One page Midterm Exam-12%<br />- Lab-30%<br />- Midterm Project-25%<br />- Final Project-25%<br />-midterm你要做什麼都行，除了交談<br />-非常主觀的一科，你的分數全憑TA如何詮釋你的作品。所以就算你花了3天3夜來做你終於滿意的作品，可是最后分數卻不怎麼樣﹔而有些人只是花了幾小時就能做出和你一樣分數的作品。",
            "comment_workload": "如果你其他課都是有assignments的話，那麼這門課絕對是非常地chur...今天傍晚給的lab assignment，隔天中午就要呈交。分數要好看，我想重點是作品設計要干淨（不要很亂，耍花槍），簡單美觀（如果要用一些比較高水准而課堂上沒教的技巧去做的话，可是不要留瑕疵）",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BS50ZTRsOQnhIWP7naDADDHWaz2phCIK",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 158,
                    "name": "SHE, James",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yy0234",
            "date": "Nov 05, 2017",
            "title": "",
            "comment_content": "1. Image Processing - Adobe Photoshop<br />2. Audio Processing - Adobe Audition<br />3. Google Web Designer<br />4. Video Editing - Adobe Premiere Pro<br />5. Adobe After Effect<br /><br />The content is quite interesting and I have learnt lots of adobe software in this course.",
            "comment_teaching": "The teaching is quite well. Lots of TA with specific ability will take part in different lab session. But sometime, there have some technical problem in the lab each as the link provided in the lab is broken so we cannot get the material. This make me feel the TA did not prepared well before the lab session. <br /><br />The teaching of Prof.SHE is quite clear, but the concept teach in the&nbsp;&nbsp;lecture is quite easy. The mid-term exam is open book and student can bring their own computer or device to search the answer of the question. After the mid-term, many people skip the lesson because this course did not contain final examination.",
            "comment_grading": "In- and Out-of-Class Activity\t8 %<br />One-page Midterm Exam\t10 %<br />Mid-term Project\t25 %<br />Final Project\t25 %<br />Laboratory\t32 %<br /><br />I have attended all the lab and pay lots of effort in the lab exercise.<br /><br />If you have pay effort on all project and lab exercise, the grade is quite good and I got an A- finally.<br /><br />But the grade in this course is very depend on the TA's subjective option. Although you pay lots of effort sometime, the grade may not as good as your expectation.",
            "comment_workload": "Actually, the workload is quite heavy because there are one lab exercise each week and the mid-term and final project took us lots of time to prepare.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yX5yFwi5GdBkLXCZrL46qfvFfFtbhHe7",
            "semester": "2016-17 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Esther Tang",
            "date": "Sep 11, 2017",
            "title": "Chur...",
            "comment_content": "Content 都係教D幾無用既Design Theory..<br />Tutorial一定要上, 教實用Adobe既野 係幾有用<br />點Key圖個D 整Sound track個D<br />都唔In-depth 點下水咁",
            "comment_teaching": "Professor幾有Passion 係HK人<br />Tutor有好多 都好好人",
            "comment_grading": "我無咩點上堂所以不能作準 個Grade麻麻地<br />但好似係幾靚grade的",
            "comment_workload": "我覺得好Heavy<br />每星期上完一堂都要第日交一個Assignment<br />上完Tutorial之後 又要即刻組隊第日交一個Assignment <br />tutorial裡面又要交Assignment 真係好！CHUR！！！！<br />仲要Assume哂全部人屋企買左Adobe咁 <br />Expect人可以係屋企做",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DAtaEkeH2EKXICoXrMuTsrtV58MfGPtC",
            "semester": "2016-17 Spring",
            "instructors": [],
            "is_author": false,
            "author": "JChan",
            "date": "Aug 21, 2017",
            "title": "",
            "comment_content": "Personally, I am extremely interested with Media topics and this course&nbsp;&nbsp;can fulfill and reach my expectation. However this course teaches the basic things from pixels concepts to how to film a short video to sell products. I thing its quite interesting but it is very difficult&nbsp;&nbsp;to find a good groupmate, which is extremely important, as most homework are in group form and it is very frequent to meet some freeriders,",
            "comment_teaching": "The tutors in the lab session is not enough&nbsp;&nbsp;for teaching alll students ,as most students will meet problems in the lab session and raise up their hands to ask them.&nbsp;&nbsp;It is also very frequent for waiting so long for tutors to come to answer you and teach you personally.",
            "comment_grading": "The grading system is quite a subjective thing, as they just judge it themselves and no voting system for students at all. No matter you paid lots or less effort, they will just decide your grade through the final product or video you sent to them, As such, having a good groupmate is extremely important.",
            "comment_workload": "Every lesson you will get works and the homework must hand in the next day before 11:00 am (something like that).",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UVHJixvdGgbJJkKOpTzqW8B7sQxisWry",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 158,
                    "name": "SHE, James",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ap83821",
            "date": "Aug 20, 2017",
            "title": "Worst Course Ever",
            "comment_content": "Lecture materials include some design principles and basic knowledge of digital file format (graphic/sound/vdo etc). Mainly for the 10% midterm and that's it. I personally think the content taught don't deserve 3hr per week. Lecture won't cover the technical skills on the design softwares which occupy 90% grading of the course.<br /><br />Lab sessions cover several design softwares (Photoshop, Google Web designer etc). Very basic skills taught.",
            "comment_teaching": "Even the TAs don't know well how to use those software.........",
            "comment_grading": "Give out 40% A range, but if I would definitely earn an A range from any other course if I spent as many hours as on this course! <br />8 labs (including attendance+ 2 design tasks)=32%<br />Midterm quiz=10%<br />Midterm project=25%<br />Final project(vdo making)=25%<br />Class activities=8%",
            "comment_workload": "6credit workload, totally not worth it.<br />Two design task every week with 24-48hr time limit which is extremely challenging especially for those who never used those software before. Non-sense workload",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ssGQs4A2MkrYfYUQaYrxnVcoPoDoiMs0",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 158,
                    "name": "SHE, James",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "takecare",
            "date": "Jun 11, 2017",
            "title": "Materials are practical but grading is subjective...",
            "comment_content": "Besides design principles and other digital media knowledge, it teaches you the basics of <br /><br />1. Image Processing - Adobe Photoshop<br />2. Audio Processing - Adobe Audition<br />3. Google Web Designer<br />4. Video Editing - Adobe Premiere Pro<br />5. Adobe After Effect<br /><br />Even if you are not a media technician guy, you will find yourself capable when you would like to deliver a digital media product after this course.",
            "comment_teaching": "Overall not bad. Clear concept but the pace is slow. Many people skip classes.",
            "comment_grading": "In- and Out-of-Class Activity\t8 %<br />One-page Midterm Exam\t10 %<br />Mid-term Project\t25 %<br />Final Project\t25 %<br />Laboratory\t32 %<br /><br />The midterm exam is normal, not very hard but tricky. Cramming with lecture notes without understanding will not help.<br /><br />Although all the scores are posted online, you have no idea how the projects and labs are graded. I can just say it is not wholly scientific; your fate depends on how the TAs view on your work since they give the marks and you cannot argue.",
            "comment_workload": "The workload is high. It keeps you busy every week for labs and group projects. It tries to force you to form groups with other people. Think twice before enrollment if you prefer individual work or you do not have friends to take the course with you.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iZK7xtZFSWGamSepNaRQLxbPjleC1Tak",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 158,
                    "name": "SHE, James",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tania",
            "date": "Jun 29, 2016",
            "title": "",
            "comment_content": "The lectures are pretty interesting, gives you a deeper understanding to how media and technology compensate each other.",
            "comment_teaching": "Prof She is an amazing professor, very engaging. The lab sessions is however not taught by him - not that engaging or interesting. It's very hard to follow through labs.",
            "comment_grading": "Very confused about how it is graded - very subjected because you're graded regarding &quot;creativity&quot;. The amount of time spent has no co relations with the end result.",
            "comment_workload": "Way. too. much. for. a. common. core. Too much. There's a weekly lab (basic task + creative task), inclass activities, out-of-class activities, midterm exam, midterm project and final project. The only thing that's nice is that there's no final exam. The weekly lab workload is quite a lot. Basic task can be finished in lab time, creative task usually needs to be done over the weekend. Midterm project was assigned before midterm break (during midterm period) and has to be finished the day after midterm break ends. Midterm exam is open book, but it's not all that easy.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "787JJR9lAhIqkWPpvIGTgcUVFjRxYBiI",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 158,
                    "name": "SHE, James",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "耶耶托尼",
            "date": "Jun 19, 2016",
            "title": "Practical &amp; useful course",
            "comment_content": "This course is mainly for students without any background in design and using softwares to create masterpieces in line with some requirements. For students who are familiarized with such topic, the course content may sound stupid and boring.<br />For media production, key topics include: creating animation and mini webpage using Google Web Designer,&nbsp;&nbsp;image, video and audio editing through Adobe Photoshop, Premiere and Audition. Some basics about Adobe After Effects will also be covered.<br /><br />For media knowledge, key topics include color in computers, pixel, chroma keying, different types of image storage format, sound wave etc.",
            "comment_teaching": "Similar to many other courses, there are both lecture(2hrs) &amp; lab sessions(2hrs) in ELEC1020. Lecture sessions cover media knowledge, the professor is passionate in teaching, keen to answer questions and raise student's interest over the course material. However, the professor's speaking tone is somehow robotic and there is much room of improvement for his oral English. Many students just use their own laptop/mobile during lecture and seldom pay attention to class.<br />The lab sessions are taught by current PG students(Teaching assistants) and cover the media production part which is partially mentioned in the previous lecture. The teaching style of different TAs varies, but you are still free to ask the TAs any questions, there are usually more than 3 of them standby to clear student's doubts and they are always helpful throughout the entire lab session.",
            "comment_grading": "Around one-third of students can get A range. Majority of students usually get B. Very few C range.<br />10%in lecture activity(participate as much lecture as you can, you can ask someone to help you answer questions in class), 30% lab session(depends on quality of final product), 10% 1-page midterm test(covering lecture content, mostly common sense), 25% INDIVIDUAL midterm project(create a webpage introducing the course which everyone can browse), 25% GROUP final project(create a video introducing a future invention). Most projects and courseworks are graded by TAs. <br />You may notice that lecture content is not important at all, how the products designed by you can persuade TAs to give you higher marks than others is the main point.<br />Even though I am still not very familiar with the applications introduced in lecture and only get an average score in midterm/labworks), I still got A- :-) [score of final project will not show]",
            "comment_workload": "As there is no final exam in this course, the workload may be quite troublesome especially before deadlines midterm &amp; final project where you need to spend a few FULL days to work day and night. Moreover everyweekend there is also some work waiting for you to complete. <br /><br />1 basic task(finished within lab session, just follow the sample to create) and 1 creative task per week(1-2 days limit, creating your own product outside lab sessions [mostly groupwork]). Sometimes there are some very easy homework for you to do(but the questions are only mentioned in lecture, not on canvas :-( )",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "R79Pbcm06NSrDCXnCVm07l8uNPkf4YlY",
            "semester": "2017-18 Spring",
            "instructors": [],
            "is_author": false,
            "author": "kkkluuuy",
            "date": "Jan 21, 2019",
            "title": "Terrible people terrible lecture terrible tutorial",
            "comment_content": "The content is good.<br />The content is good.<br />The content is good.<br />The content is good.<br />The content is good.<br />The content is good.<br />The content is good.<br />The content is good.<br />.. this is a lie",
            "comment_teaching": "The teaching is interesting.<br />The teaching is interesting.<br />The teaching is interesting.<br />The teaching is interesting.<br />The teaching is interesting.<br />The teaching is interesting.<br />The teaching is interesting.<br />The teaching is interesting.<br />The teaching is interesting.<br />The teaching is interesting.<br />The teaching is interesting.<br />The teaching is interesting.<br />.. this is a lie",
            "comment_grading": "The grading is fair.<br />The grading is fair.<br />The grading is fair.<br />The grading is fair.<br />The grading is fair.<br />The grading is fair.<br />The grading is fair.<br />The grading is fair.<br />The grading is fair.<br />The grading is fair.<br />.. this is a lie",
            "comment_workload": "The workload is light.<br />The workload is light.<br />The workload is light.<br />The workload is light.<br />The workload is light.<br />The workload is light.<br />The workload is light.<br />The workload is light.<br />The workload is light.<br />The workload is light.<br />The workload is light.<br />The workload is light.<br />.. this is a lie",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}