{
    "error": false,
    "course": {
        "id": 308,
        "subject": "ELEC",
        "code": "1200",
        "name": "A System View of Communications: from Signals to Packets",
        "description": "Have you ever wondered what technologies go into your mobile phone or a WiFi hotspot?  Through hands on work with a simple but fully functional wireless communication system, you will understand the basic engineering tools used and tradeoffs encountered in the design of these systems.  This course is centered on weekly laboratories, each designed to introduce an important concept in the design of these systems.  The lab sessions are supported by two one-hour lectures and a tutorial that introduce the concepts for the next laboratory, as well as reviewing and expanding the concepts learned in the previous laboratory.",
        "categories": [],
        "website": "http://course.ee.ust.hk/elec1200",
        "credits": 4,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "",
        "corequisites": "(<a class=\"course-link\" data-subject=\"COMP\" data-code=\"1021\" href=\"/review/COMP1021\" target=\"_blank\">COMP 1021</a> OR <a class=\"course-link\" data-subject=\"COMP\" data-code=\"1022P\" href=\"/review/COMP1022P\" target=\"_blank\">COMP 1022P</a>) AND (<a class=\"course-link\" data-subject=\"MATH\" data-code=\"1003\" href=\"/review/MATH1003\" target=\"_blank\">MATH 1003</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1014\" href=\"/review/MATH1014\" target=\"_blank\">MATH 1014</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1020\" href=\"/review/MATH1020\" target=\"_blank\">MATH 1020</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1024\" href=\"/review/MATH1024\" target=\"_blank\">MATH 1024</a>)",
        "exclusions": "",
        "rating_content": 4.31,
        "rating_teaching": 4.4,
        "rating_grading": 4.3,
        "rating_workload": 3.72,
        "review_count": 81,
        "single_review": false,
        "enrollment_status": 4,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 200,
                "name": "MURCH, Ross",
                "count": 32
            },
            {
                "id": 1047,
                "name": "CHOW, Cupid",
                "count": 29
            },
            {
                "id": 1189,
                "name": "BEN LETAIEF, Khaled",
                "count": 18
            },
            {
                "id": 178,
                "name": "SHI, Bertram Emil",
                "count": 16
            },
            {
                "id": 164,
                "name": "MOW, Wai Ho",
                "count": 7
            },
            {
                "id": 187,
                "name": "TSANG, Danny Hin Kwok",
                "count": 7
            },
            {
                "id": 206,
                "name": "ZHANG, Jun",
                "count": 3
            },
            {
                "id": 163,
                "name": "LUO, Shuangyu",
                "count": 1
            },
            {
                "id": 165,
                "name": "TANG, Yimeng",
                "count": 1
            },
            {
                "id": 166,
                "name": "WONG, Kai Sun Albert",
                "count": 1
            },
            {
                "id": 1495,
                "name": "LI, Xiaomeng",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "7DyoxBttIVTuFtv8VRy7qDqnGNTzdCvy",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Srijan",
            "date": "May 02, 2020",
            "title": "",
            "comment_content": "This is essentially a crash course into the systems communications aspect of computer science.<br />The course is divided into 3 parts:<br />1. Channel Transmission: This part focuses on how bits are transmitted through a channel and how errors can be minimised using channel coding, framing, equalizing etc.<br />2. Sharing of channels: This part focuses on how a channel/frequency is shared among multiple communications using different types of modulation and filtering<br />3. Layers of Communications: This part explores different layers of communication (Physical, Data Link, Network, Transport, Application etc.) and popular protocols associated with each.<br /><br />All these ideas are reinforced during labs where these principles are applied by coding a physical transmitter using MATLAB. The content is not too difficult as long as you pay attention in labs and tutorials",
            "comment_teaching": "Prof. Ross is really good. He is passionate about the subject and thus teaches accordingly. Most content is explained pretty well and doubts are resolved promptly.<br />Cupid is an amazing TA as well. She takes time to explain every type of question step by step and is always available for doubts.",
            "comment_grading": "Grading weightage:<br />Lab - 25%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Checkpoints - 10%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Post-lab quiz - 15%<br />Homework - 10%<br />Midterm - 25%<br />Final - 40%",
            "comment_workload": "Decent for a 4cr course.<br />There are only 3 100pt Homeworks throughout the course that you have weeks to complete and dont take more than a few hours.<br />There is a 3-hour lab every week along with a post-lab quiz. The labwork and quiz finish in like an hour and then you can leave. The quiz is a 5-minute 5pt open book canvas quiz which basically covers questions from the previous tutorial.<br />Apart from that the only workload is actually studying for the exams which is fine as long as you attend and focus in each class and tutorial.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9z8D8WsK2s3u2kFR9zRIyEODRQOVX7Sl",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 206,
                    "name": "ZHANG, Jun",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mark_",
            "date": "Jun 02, 2022",
            "title": "Good course overall with interesting content and nice grading. This review would have given a perfect score! But...",
            "comment_content": "The content is quite approachable.<br /><br />- Signals and effects of the channel<br />- LTI systems<br />- Transmitting data<br />- Noise<br />- Error correcting codes<br />- Time domain / frequency domain analysis<br />- Signal transmission, frequency division multiplexing<br />- Networking (OSI model)<br /><br />To be honest it was quite an interesting course. I would recommend even aspiring CS majors to take this.",
            "comment_teaching": "This section *would* have been given an A if it were not for what happened to a friend of mine after exams finished.<br /><br />Let's get through the positives first. Professor Zhang is nice and explains concepts clearly. He is open to questions after class and via. email. The IA, Cupid CHOW, is also very nice and organises most things for the course. During tutorials, she explains questions step by step to make sure you understand. She is also very reachable by email and is open to help. (Only concern is she types everything in Comic Sans for some reason, including the exams. :P)<br /><br />However...<br /><br />Near the end of semester, my friend ended up getting a 0 for their project code as it was unable to be run. Why? They tested their code thoroughly, and it ran without issue.<br /><br />It was because they downloaded an older version of the project template the teaching team released a day before the project briefing. The teaching team had actually reuploaded a new version of the project template with a completely different structure, but did not tell anyone after doing so! My friend was essentially working on an older version of the project, so of course their code failed when it was run by the teaching team.<br /><br />This level of irresponsibility baffles me, especially because this is for a course component worth 20% of the final grade. There was no way they could have known about the change without downloading the project again.<br /><br />Nothing personal against the teaching team; I think they are great people... but I cannot let something like this slide.<br /><br />UPDATE: My friend got their marks back after using a whole evening on investigating and writing an appeal. I've given the teaching a B since the instructors handled it reasonably and quickly.",
            "comment_grading": "Grading policy:<br /><br />Lab [Total: 15%]:<br />&nbsp;&nbsp;&nbsp;&nbsp;Lab check-off points [5%]<br />&nbsp;&nbsp;&nbsp;&nbsp;Post-lab quiz [10%]<br />Online homework [10%]<br />Midterm [25%]<br />Project [20%]<br />Final [30%]<br /><br />---<br />LABS<br /><br />Lab check-points are easy. Just read the labs and do them, and you can get the check points without much problem.<br /><br />The post-lab quizzes on the other hand are quite difficult and stressful. You need to really revise the content and pay attention in the tutorial to get a good score on them. They are all 5 minutes long with 5 MCQ or text entry questions.<br /><br />There are 7 labs in total, 6 of which are graded. The first one is a trial lab you get you familiar with the procedures. You must attend at least 5 labs to pass.<br /><br />Mean (check-off points): 21.67/24<br />Mean (post-lab quiz): 16.29/29<br /><br />---<br />HOMEWORK<br /><br />The homework is not too bad. Just read the lecture slides and you should be able to do them. But, don't do them the day they're due - many of my classmates ended up not finishing on time due to them leaving it till the last minute.<br /><br />There are 3 homeworks in total, and combined, they are worth 120 marks. Depending on how well you understand the content, they can take between an hour and a few days to do.<br /><br />Mean: 99.83/120<br /><br />---<br />PROJECT<br /><br />The project this semester was creating a transmitter and receiver to reliably transmit a sequence of bits over a fairly noisy channel while conserving as much power as possible. Due to it being an online semester, you do the project in Matlab and transmit over a virtual channel.<br /><br />But, I think just the content from the course is not enough to get full marks. Accounting for variations in the given channel (everyone's channel has different noise), I think I had one of the lowest power usages of anyone I knew, but I still lost a point for the power consumption part. In fact, nobody in my session got full marks for power consumption.<br /><br />In addition to writing the Matlab code, you have to write a report detailing any experiments you did and how you got the result that you did.<br /><br />(Update: I asked about the grading for this part. They create a sub-optimal reference solution using a simple noise reduction technique and a greedy search. They then compare your solution to theirs, and only if your solution uses less power will you get full marks.)<br /><br />The report is worth 8 marks, your code is worth 5, and the power consumption is worth 7. It is overall worth 20 marks.<br /><br />Mean: 10.6/20 SD 4.5<br /><br />---<br />EXAMS<br /><br />The exams are like a combination of the post-lab quizzes and the homeworks. It starts with a few homework style short answer questions. Then, there are a bunch of multiple-choice/text entry questions, not unlike what you would find in the post-lab quiz.<br /><br />The long questions are similar in difficulty to the homework, but of course there is a time limit.<br /><br />The rest of the questions are similar to the post-lab quizzes. However you get 2 minutes per question compared to the 1 minute per question you get in the actual post-lab quizzes. So, you have more time to do them.<br /><br />Overall, I think the exams are not too bad. They are fairly doable if you revise the content and practice. (They are open-book, open-calculator this semester).<br /><br />Mean (midterm): 27/36 SD 6<br />Mean (final): 31.3/50 SD 9.4<br /><br />---<br />OVERALL<br /><br />The overall mean is 66.58.<br /><br />This semester, one can get A+ with 93% and A- with 79% (exact boundaries unknown). So, it seems the A range is fairly wide.",
            "comment_workload": "Every week, you must attend the lab and do the post-lab quiz. This will eat up about 1-2 hours of your time each week.<br /><br />You will also have to do the homeworks.<br /><br />Near the end of semester, you will also have to do the project. For me, this took about 15 hours of work in total, including the report.<br /><br />Apart from that, there is not much else you have to do. I think the workload is fair for a 4-credit course.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "3wlw834rN4ujiVPPrUoEX2JcKEa1nKeE",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 206,
                    "name": "ZHANG, Jun",
                    "rating": 0
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wiktor",
            "date": "Jun 30, 2022",
            "title": "",
            "comment_content": "This course is a great introduction to communication systems, it covers everything from basic bit signals to how the Internet works.<br />Course content:<br />- Encoding information with bits<br />- Continuous vs discrete-time waveforms<br />- Discrete-time bit waveforms<br />- Discrete-time channel<br />- Effects of the channel<br />- Linear Time-Invariant Systems<br />- Modelling the channel<br />- Decoding bits<br />- Asynchronous serial communication<br />- Intersymbol interference<br />- Eye diagrams<br />- Recursive channel model<br />- Equaliser<br />- Noise<br />- Gaussian Probability Density Function of noise<br />- Q-function and the Bit Error Rate<br />- Channel coding<br />- Fourier Series Expansion<br />- Filter types<br />- Time-frequency analysis<br />- Source coding/data compression<br />- Signal transmission<br />- Duplex communications<br />- Channel sharing or multiplexing/demultiplexing<br />- Modulation and demodulation<br />- Hierarchy of networks<br />- Network structure and layering<br />- Multiple access protocols<br />- Forwarding and routing",
            "comment_teaching": "In my opinion, professor ZHANG, Jun is very bad at explaining the course content, he rarely read the chat and his explanations were extremely confusing.",
            "comment_grading": "Labs 15%:<br />- Check-off points 10% - mandatory 5 labs out of 7 to pass the course<br />- Post-lab quiz 5%<br />Homework 10%<br />- 3 sets of exercises on Canvas<br />Midterm 25%<br />Final 30%<br />Project 20%",
            "comment_workload": "The workload is rather light, although you should prepare for the post-lab quizzes very thoroughly - there are a lot of questions that require you to be fluent in the course material up to that point. The homework is somewhat based on the material covered in the lectures but most often than not, you will have to discuss the problems with your classmates to get an idea of what to do. The project is fun, it is just graded tinkering in MATLAB.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GCZED3sngwJvhSGUkbNqA4vnrkV67XSG",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "timn",
            "date": "Mar 23, 2022",
            "title": "",
            "comment_content": "i yoink it from others so here they are<br />(skip to the end for tl;dr)<br /><br />L01: Course Introduction<br />Metrics for communication systems, the digital abstraction, basic recipes for transmitting information<br /><br />L02: Signals<br />Point-to-Point Digital Links, discrete time waveform<br /><br />L03: Real World Channels<br />Representing discrete time bit waveforms, effects of the channel<br /><br />L04: Linear Time Invariant Systems<br />Exponential Step Response<br /><br />L05: Transmitting Data<br />Communication protocols, decoding bits, asynchronous serial communication<br /><br />L06: Inter-symbol Interference and Eye Diagram<br /><br />L07: Feedback Model of the Channel<br /><br />L08: Channel Equalization<br /><br />L09: Noise<br />Noise, noise PDF, additive noise, BER of the binary channel<br /><br />L10: Noise<br />BER examples, Gaussian PDF<br /><br />L11: Noise<br />Q-function, BER and SNR<br /><br />L12:&nbsp;&nbsp;Error Correcting Codes<br />Hamming distance, block codes, error detection vs. correction, repetition codes<br /><br />(HW1 Due)<br /><br />L13: Error Correcting Codes<br />(n,k,d) Block codes, (8,4,3) &amp; (9,4,4) block codes<br /><br />(Midterm Exam - covering L01-L13, tutorials, HW1)<br /><br />L14: The Frequency Domain<br />Representing signals as sums of sinusoids<br /><br />L15: Filters and Frequency Response<br /><br />L16: Signal Transmission – Modulation<br /><br />L17: Signal Transmission – Demodulation<br /><br />L18: I-Q Transmission<br /><br />L19: Introduction to Networks<br /><br />L20: Link Layer<br /><br />L21: Network &amp; Transport Layers<br /><br />(HW2 Due)<br /><br />L22: Transport &amp; Application Layers<br /><br />L23: Course Review<br /><br />(HW3 Due)<br /><br />(Final Project Due)<br /><br />tl;dr: learn how you transmit a message, first transform the text into binary, package the binaries according to a given rule, then electric waveform to represent 1 and 0, send the waveform through a noisy tunnel, retrieve the waveform with noise, noise cancellation, get the original message back. (sounds complicated but if you understand the concept behind it, it is a piece of cake)<br /><br />second half start to talk about the frequency domain, some network stuff, all that only appeared in homework and nowhere else, so i didnt even read them",
            "comment_teaching": "You can basically learn everything you need by reading powerpoint.<br /><br />Professor is willing to answer questions, no matter how obscure it is.<br />In general good professor.<br /><br />remember go to tutorial, not for the lab explanation part, but for its sample questions part, those questions are basically what you gonna get in post-lab quiz and in midterm",
            "comment_grading": "yoinking framework from others again <br />Lab (30%)<br />Homework (10%)<br />Midterm Exam (30%)<br />Final Project (30%)<br /><br />First, and most importantly, you will need to have some basic idea for programming, not any language, just the concepts like (if, for loop, while, array and such), because MATLAB would be used throughout the entire course.<br /><br />Lab is just whatever, copy the instruction, and if you are on pace with the normal lecture flow, you would be able to answer the logic behind it. Also you will be paired up with another guy (It was on campus back then, not online teaching)<br />The post-lab quiz is also just really basic stuff, as long as you read the powerpoint, you will be fine.<br /><br />Homework you can find formula from powerpoint, or ask other people.<br /><br />Midterm is also just testing the concepts behind how packaging and unpacking data.<br /><br />For my semester, basically from L19 and onward, all those stuff are not tested (except in homework, which im sure you can find a way to do it), so i just skipped the last 5 lectures.<br /><br />Final project could cause some issue though, we were asked to design a simple voice recognition program to differentiate between 2 words, and simulating an entire sentence being trasmitted, before retreiving the sentence back. Also, theres a written report, but that is basically free mark.<br /><br />It is hard not because of the programming, but because of how inconsistent the entire thing is, my program worked completely fine on my end, but since the demo is performed on campus, my voice recognition program was not working properly.<br /><br />Heres what i got:<br />Lab: all lab checks done, post lab quiz either full mark or above mean.<br />Midterm: 32/40 (mean 26.91)<br />Homework: no mean given but i think i was just about mean<br />Final project: <br />MATLAB code: 4/4<br />Written report: 6/6<br />Project demo: 17/20 (mean 12.47)<br /><br />Grade: A+",
            "comment_workload": "homework draw diagram is an absolute nightmare if you use computer to draw, dont be me.<br /><br />almost lab every week, just follow the guide (ta will help you for any questions)<br /><br />midterm, there is like 1 given past paper only, do that, its gonna come in handy, also remember to attend the tutorial (or at least look at the recording)<br /><br />i did my final project in 1 day so i guess it is not that much of a workload",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "S3fdot3tNLtkCb2ry2PFuWeVKaiSGcwl",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 164,
                    "name": "MOW, Wai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DrainGang",
            "date": "May 22, 2021",
            "title": "Decent, but exams are hard.",
            "comment_content": "Basic introduction to communications, for details, refer to other guides, the content is actually quite interesting, even for a CPEG student like me.<br /><br />The materials for the course are quite simple, but be aware that the difficulty spikes during the last 1/3 of the course, and the last 2-3 lectures have a lot of memorization involved, would be challenging to study (unless you still have online exams by the time you read this)",
            "comment_teaching": "Lectures: quite boring, just repeating what is on the powerpoint, no attendance required so you can just look at them yourself at your own pace.<br /><br />Tutorials: no attendance required, but you MUST go (even if the mainland TAs have an extremely heavy accent that makes it almost impossible to listen to) because the questions explained in the tutorial will be THE SAME as the ones in the post-lab quiz, if you want to do good in the post-lab quizzes, you have to attend the tutorials. The tutorials also go over the lab, which could help you out when you are stuck.<br /><br />Labs: All instructions are on CANVAS, you just follow them to finish the lab, the lab check-points are also on CANVAS, so even if you are stuck on matlab it really doesn't matter.",
            "comment_grading": "10% check points: basic MATLAB programming<br /><br />15% Post-Lab Quiz: has NO RELATION TO LECTURE MATERIALS, make sure you attend and study the tutorial materials and you would do alright.<br /><br />10% Homework: 3 homeworks, all are quite easy as well, averages are high and you should start working on homework 2 as soon as possible because homework 3 is released RIGHT AFTER homework 2.<br /><br />25% Midterm: Covers the first 10 lectures, 2 halves, first half MC/fill in the blanks/True or False, second half text-entry questions. The first half is quite simple, if you studied you would know the answers, the second half is quite difficult as the calculations are much more difficult compared to what you will see in the lectures and tutorials, the questions are time consuming as well, averages are low (32.6/60)<br /><br />40% Final: Covers the entire course, the same thing as midterm, challenging calculations, even more time consuming questions, make sure you finish them as quickly as possible. ALSO: inputting equations in CANVAS is a major annoyance because you CANNOT copy and paste what you have typed, you MUST input every equation by hand or the website WILL CRASH.<br /><br />Final grade: 8% above mean overall, B+, acceptable grading.",
            "comment_workload": "Quite light for a 4-credit course.<br /><br />Labs take at most 1-2 hours per week, and preparing for the post-lab quiz takes half an hour or so, so overall you don't have to spend that much time on this course. <br /><br />As for the homework, they are quite short and easy, so again does not take that much time, but since they are easy you may make careless mistakes, so double check your answers with a friend to make sure you did the questions right.<br /><br />Exams: doesn't take very long to understand the concepts, but as I have said, calculations are difficult in the exam and there is only ONE past paper given, so make you do look at the homework and the 1 past paper otherwise you have no way of studying for the exams.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 3,
            "attachments": []
        },
        {
            "hash": "Awn8R6bXs5aCSn4Mf92Ao6VFIpSSmu9g",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LSLlsl",
            "date": "Jan 20, 2021",
            "title": "",
            "comment_content": "L01: Course Introduction<br />Metrics for communication systems, the digital abstraction, basic recipes for transmitting information<br /><br />L02: Signals<br />Point-to-Point Digital Links, discrete time waveform<br /><br />L03: Real World Channels<br />Representing discrete time bit waveforms, effects of the channel<br /><br />L04: Linear Time Invariant Systems<br />Exponential Step Response<br /><br />L05: Transmitting Data<br />Communication protocols, decoding bits, asynchronous serial communication<br /><br />L06: Inter-symbol Interference and Eye Diagram<br /><br />L07: Feedback Model of the Channel<br /><br />L08: Channel Equalization<br /><br />L09: Noise<br />Noise, noise PDF, additive noise, BER of the binary channel<br /><br />L10: Noise<br />BER examples, Gaussian PDF<br /><br />L11: Noise<br />Q-function, BER and SNR<br /><br />L12:&nbsp;&nbsp;Error Correcting Codes<br />Hamming distance, block codes, error detection vs. correction, repetition codes<br /><br />(HW1 Due)<br /><br />L13: Error Correcting Codes<br />(n,k,d) Block codes, (8,4,3) &amp; (9,4,4) block codes<br /><br />(Midterm Exam - covering L01-L13, tutorials, HW1)<br /><br />L14: The Frequency Domain<br />Representing signals as sums of sinusoids<br /><br />L15: Filters and Frequency Response<br /><br />L16: Signal Transmission – Modulation<br /><br />L17: Signal Transmission – Demodulation<br /><br />L18: I-Q Transmission<br /><br />L19: Introduction to Networks<br /><br />L20: Link Layer<br /><br />L21: Network &amp; Transport Layers<br /><br />(HW2 Due)<br /><br />L22: Transport &amp; Application Layers<br /><br />L23: Course Review<br /><br />(HW3 Due)<br /><br />(Final Project Due)",
            "comment_teaching": "There are reviews and introductions at the beginning of each lecture, and reviews at the end of each lecture.&nbsp;&nbsp;Tutorials provide more examples and introduce the coming lab. Meanwhile, labs provide practices to help to consolidate knowledge.<br /><br />Time for lectures is ample for its contents. Prof Murch is passionate and he always asks students to raise questions if any. Apart from that, he repeats important ideas so as to make sure everybody understands.<br /><br />TA Cupid holds tutorials and labs. Even though different students have asked on the same question and she has answered before, she would still explain them patiently.",
            "comment_grading": "Grading policy:<br />- 7 Labs (MATLAB simulations) 30%<br />-- Lab Check-off Points (15%)<br />-- Post-lab Quiz (15%)<br />- 3 HWs 10%<br />- Midterm Exam (30%)<br />- Final Project (30%)<br /><br />Labs:<br />MATLAB is used for simulations in the labs. MATLAB codes are given and minor additions and amendments are needed. Completed codes are not needed for submission but will be useful in the final project. Lab instructions and lab check-off points are released around a week before the scheduled lab time. Both check-off points and quizzes cover the content of surrounding lectures and that lab.<br /><br />Attendance of labs is not mandatory, but lab check-off points (5 questions per lab) have to be completed before the post-lab quizzes (5 questions per lab), and the quizzes are only available in the last 10 minutes of the scheduled lab time.<br /><br />Midterm Exam:<br />Closed book<br />MCs (20 mins) (16% of course grade)<br />Short Questions (30 mins) (14% of course grade)<br /><br />Final Project:<br />5 short questions (In which 3 are like lab - modifying MATLAB codes, 2 requires more of MATLAB programming)<br />5 questions on decoding data and addresses at the receiver (write MATLAB codes from scratch to decode data streams in different scenarios (including noise, channel coding, intersymbol interference))",
            "comment_workload": "The workload is quite low for most of the time. However, towards the end of the semester, the workload starts to rise. HW3 is released right after HW2. The final project wouldn't be that hard once you understand the course content thoroughly.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "de8co2n31YEI5BUQfWrjGUS3oK5sWsvA",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 164,
                    "name": "MOW, Wai Ho",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Andiiiiiii",
            "date": "Aug 23, 2019",
            "title": "",
            "comment_content": "L01: Course Introduction<br />Metrics for communication systems, the digital abstraction, basic recipes for transmitting information<br /><br />L02: Signals<br />Point-to-Point Digital Links, discrete time waveform<br /><br />L03: Real World Channels<br />Representing discrete time bit waveforms, effects of the channel<br /><br />L04: Linear Time Invariant Systems<br />Exponential Step Response<br /><br />L05: Transmitting Data<br />Communication protocols, decoding bits, asynchronous serial communication<br /><br />L06: Inter-symbol Interference and Eye Diagram<br /><br />L07: Feedback Model of the Channel<br /><br />L08: Channel Equalization<br /><br />L09: Noise<br />Noise, power, binary channel model, BER of the binary channel<br /><br />L10: Noise<br />Modeling noise, Gaussian PDF, BER of AWGN channel<br /><br />L11: Error Correcting Codes<br />Hamming distance, (n,k) block codes, error detection vs. correction, repetition codes, (8,4) codes<br /><br />L12:&nbsp;&nbsp;Error Correcting Codes<br />(n,k,d) Block codes, (9,4,4) block codes.<br /><br />L13: The Frequency Domain<br />Representing signals as sums of sinusoids, Euler’s identity<br /><br />L14: Discrete Fourier Transform/Frequency Response<br /><br />L15: Lossless &amp; Lossy Source Coding<br /><br />L16: Signal Transmission – Modulation<br /><br />L17: Signal Transmission – Demodulation<br /><br />L18: I-Q Modulation<br /><br />L19: Introduction to Networks<br /><br />L20: Link Layer <br /><br />L21: Network and Transport Layers <br /><br />L22: Transport and Application Layers<br /><br />L23: Course Review",
            "comment_teaching": "淨係上過第一堂lecture,之後都係睇video,啲video有時遲成個禮拜先有<br /><br />Tutorial就上哂,會講吓前幾堂lecture教咗啲乜,再舉幾個例題同寫step,最後就會講嚟緊個lab嘅task有咩值得留意嘅位同埋比啲hint<br /><br />lab啲TA有時見你唔識做或者做得慢會主動過嚟幫手",
            "comment_grading": "Homework: 10%<br />Lab: 25%<br />&nbsp;&nbsp;lab tasks: 10%<br />&nbsp;&nbsp;post-lab quizzes: 15% (每次lab有5分鐘做5題)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;quiz有啲就mc問concept,有啲就要計數,不過啲題目同 <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;tutorial入面嘅例題好似,有睇過tutorial就識做<br />Midterm: 25%<br />Final: 40%<br /><br />cut-off唔清楚<br /><br />Homework: 287/300 mean: 255<br />Lab: 22.3/25 mean:20.2<br />去齊lab嘅話lab task都會係10/10<br />Midterm: 47/50 mean: 37.8<br />Final: 96/100 mean:78.7<br />Grade:A+",
            "comment_workload": "lab雖然寫就3個鐘,但係好多人做半個鐘到一個鐘就走咗,不過啲電腦真係好慢,開個matlab同download個lab.zip都要成10分鐘<br />3份assignment都有啲長,有啲題目唔識就諗一晚都唔會識做,可以預早啲時間喺lab問<br />post-lab quiz係open book嘅,所以可以抄定tutorial入面嘅例題條formula,到時做post-lab quiz照住條formula撳機<br />做quiz嘅5分鐘其實好短,見到mc唔識做就撞啦,如果唔係做唔切後面啲題目仲唔抵<br />mid-term同final嘅題目同review question and assignment好似,明咗點做就冇咩太大問題",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7xzuwtXe5NBVGO31miFAbGLXoyiDqPad",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Harold Kwan",
            "date": "Aug 21, 2023",
            "title": "",
            "comment_content": "Covers bit responses, linear time invariant channels, noise PDFs, multiplexing, fourier analysis, and networks.<br /><br />Pace is pretty slow before half term, but becomes a bit faster towards finals.",
            "comment_teaching": "Professor is not boring when presenting content, lectures are not too boring.<br /><br />Instructional assistant was helpful answering my questions after class.",
            "comment_grading": "Lab - 15% (checkpoints 5%, post lab quiz 10%)<br />Homework - 10%<br />Midterm - 25%<br />Individual Project - 20%<br />Final - 30%",
            "comment_workload": "Lectures are not very important in my opinion, most can be self-learned by just reading the notes and doing some googling. You also become more familiar with the content when you do the homework.<br /><br />Labs are compulsory. The lab time slot is 3 hours, but I completed all the labs within an hour (the post lab quiz is 5 minutes).<br /><br />About 1 piece of homework every 2 weeks, and each completed in about 1 to 2 hours.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PX8U5Hgc5ateb4BPfcvUAZWmLiUY5Rhz",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Dark Silence",
            "date": "Jun 30, 2023",
            "title": "A good course for people who have studied ICT before",
            "comment_content": "This course is talking about some information about signal transmission. It is quite interesting and easy to learn.<br />Course review:<br />L01: Course Introduction<br />L02: Signals<br />L03: Real World Channels<br />L04: Linear Time Invariant Systems<br />L05: Transmitting Data<br />L06: Inter-symbol Interference and Eye Diagram<br />L07: Feedback Model of the Channel<br />L08: Channel Equalization<br />L09: Noise<br />L10: Noise<br />L11: Noise<br />L12:  Error Correcting Codes<br />L13: Error Correcting Codes<br />L14: The Frequency Domain<br />L15: Filters and Frequency Response<br />L16: Time-Frequency Analysis / Source Coding<br />L17: Signal Transmission – Multiplexing<br />L18: Signal Transmission – Demultiplexing<br />L19: Introduction to Networks<br />L20: Transport Layer<br />L21: Link Layer<br />L22: Network Layer<br />L23: Application Layer<br />L24: Course Review",
            "comment_teaching": "Professor has spent a lot of time giving example to explain the lecture he has taught. It was really interesting and explained clearly. Moreover, his assistance has also provided some times for student to ask. I often ask and understand more from it.",
            "comment_grading": "Grading Policy <br />Lab<br /><br />15%<br /><br />Lab Check-off Points<br /><br />(5%)<br /><br />Post-lab quiz<br />Five minutes quiz. No lab report is required.<br /><br />(10%)<br /><br />Homework<br /><br />Submit online <br /><br />10%<br /><br />Midterm Exam<br /><br />Date: 24 March 2023 (Fri)<br /><br />Time: 10:30 - 11:20 (lecture time)<br /><br />It covers the course material L01 - L11<br /><br />25%<br /><br />Project<br /><br />20%<br /><br />Final Exam<br /><br />30%",
            "comment_workload": "The workload of this course is not really high. The only thing you have to do is 3 homework exercises and about 6 lab programming. However, they use MatLab to write code. Matlab coding system is quite different from other language before so need to pay more attention on it. There is also a project that you have to it urself. Make sure you read through all the content given so you will not get failed.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DeJoMk5uXXYKIPQFxzLVaqYzllGzxAYj",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sheepy",
            "date": "Jun 29, 2023",
            "title": "",
            "comment_content": "See others for the detail.<br />Not much to learn but the content after midterm is quite hard to handle, such as networks and frequency domain. Some concepts were introduced in comp1001/core1231/<br /><br />Labs are easy as the tasks are often just fixing tiny mistakes in the codes. <br /><br />The project is just finding the lowest (average) energy per bit. It is not required to do extra coding in matlab but including them in report might be a better choice.",
            "comment_teaching": "The professor's accent is really good and you don't really want to sleep in his class. His videos on the topics covered are also interesting to watch.<br />Cupid (TA) is a really nice person and you can see queues waiting to talk to her about the HW or labs.",
            "comment_grading": "Grading is fair. <br /><br />The midterm and final are mostly based on the HW. So, if you have worked out the answers or understood the suggested one, you are good to go. You cannot use calculators in exams so you can expect easy calculation.<br /><br />The project grading is kind of weird as I did not try extra coding in matlab.<br /><br />Got a B+ as I did not do well in the project.",
            "comment_workload": "Low workload.<br />Only 3 HW per semester. But HW2 and HW3 are kind of hard and their deadlines often collide with others so better do them ASAP as you need figures generated from matlab.<br />Post-lab MC is not hard if you read through your lab results and the descriptions of the tasks.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "l0hGFIKkqDwHF9sT03ArO8JstMe4rYih",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Larry128",
            "date": "May 25, 2023",
            "title": "Good Course Good Professor Good TA",
            "comment_content": "For the content, I think the syllabus this semester has cut many contents, like the BPSK, I/Q modulation, burst error corrections, etc.<br /><br />Basically, some basic concepts in communication. It would help if you take ICT in high school.",
            "comment_teaching": "Prof. Bertram Shi is a very good teacher and he is very willing to answer questions. Also, he always makes jokes to make the lectures not so boring.<br /><br />For the instructional assistant Cupid Chow, she is a very kind person and willing to answer students' questions. Also, if u get any question on the homework, u are welcomed to email her to seek help.",
            "comment_grading": "The grading for me is pretty great, for your reference:<br /><br />Homeworks (10%):<br />HW1 19.5/20<br />HW2 20/20<br />HW3 18/20<br /><br />Post Lab Quizzes (10%):<br />Lab 1: 3/4 (not graded)<br />Lab 2: 3/4<br />Lab 3: 4/4<br />Lab 4: 4/4<br />Lab 5: 4/4<br />Lab 6: 2.5/4<br />Lab 7: 2/4<br /><br />Lab checkpoint (5% all obtained as long as u go to the lab normally)<br /><br />Individual Project (20%) :<br />Matlab code: 3/4<br />Written report: 8/10<br />Energy Per Bit: 4/6<br /><br />Midterm Exam (25%): 39/40<br /><br />Final Exam (30%): 46/50<br /><br />My overall grade: A+",
            "comment_workload": "There are midterm, final exams, an individual project, and 3 sets of Homework this semester. I think it is reasonable for a 4-credit course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1gtbbAs9QPUdAeKL7uV4GmpxSvNSUYBn",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Toson",
            "date": "May 19, 2023",
            "title": "",
            "comment_content": "This is essentially a crash course into the systems communications aspect of computer science.<br />The course is divided into 3 parts:<br />1. Channel Transmission: This part focuses on how bits are transmitted through a channel and how errors can be minimised using channel coding, framing, equalizing etc.<br />2. Sharing of channels: This part focuses on how a channel/frequency is shared among multiple communications using different types of modulation and filtering<br />3. Layers of Communications: This part explores different layers of communication (Physical, Data Link, Network, Transport, Application etc.) and popular protocols associated with each.<br /><br />All these ideas are reinforced during labs where these principles are applied by coding a physical transmitter using MATLAB. The content is not too difficult as long as you pay attention in labs and tutorials",
            "comment_teaching": "Professor can explain the hard topic and make it much easier to understand than reading the lecture material yourself. This is a hard course. The detail of BJT model and MOSFET is very frustrating when it comes to calculation. Therefore, remember to attend the last few lecture and review the course with professor before midterm and final exam.<br /><br />TAs are welling to answer most of the questions when you ask them. If you struggling with the homework, try your best and ask the TAs after the tutorial. They will help you a lot.",
            "comment_grading": "A hard course. But always someone can get almost full marks in midterm and final exam. Both of them are open book, but only printed material. It is a good chance to review. Remember to pay attention on the homework. Some of them are similar to exam questions.",
            "comment_workload": "Need quiz after lab every time. quiz is quite hard, all lab can get a full mark",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "omrnAjQGGZ1H9JuhIJUyqpMQKQTcHSGM",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "clyde",
            "date": "Mar 22, 2023",
            "title": "ELEC 1200",
            "comment_content": "It is about signals.",
            "comment_teaching": "The professors teach very well and in good detail. They are eager to receive students' questions during lectures.",
            "comment_grading": "This course is graded based upon homework, lab quizzes, one exam and a final project. <br /><br />The final project is worth 30%, so you should consider spending some time on it.<br /><br />The exam only covers content until midterm, and this content is fairly easy compared to the content after the exam. <br /><br />The grading is lenient in my opinion as I got an A+.",
            "comment_workload": "Only 3 homework throughout the term, only workload is revision basically.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AR6XdL8sEJU1NY06klvAbdRkRaZx2Egt",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "liviahsuwl",
            "date": "Jan 25, 2023",
            "title": "",
            "comment_content": "Learn about channels and signals, the communication stuffs<br />Learn about how to use matlab which is pretty useful<br />Better take comp1021 before attending this course as it requires a bit programming skills",
            "comment_teaching": "TA is very nice and willing to answer questions during lab<br />Even you have no idea how to finish the lab is fine as they will guide you<br />There is a quiz after each lab, you better try hard and try to gain as high mark as you can...",
            "comment_grading": "forgot about the grading, but the grade for quiz for me is pretty low as i didnt study.<br />From my friends opinion, if you study the tutorial notes and try hard in the lab quiz will be fine.",
            "comment_workload": "The workload is not that high... just 3 assignments and one exam and one individual project. The project is very hard though... Good luck",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tW9V9cNExvZ9vhhpfqjvad2MHcqqowwa",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Leolyw",
            "date": "Feb 11, 2022",
            "title": "",
            "comment_content": "The topics discussed is quite interesting if you want to find out how signal is transmitted between devices. However, the difficulty of lectures drastically increases starting from L10 where you will start to do some math about error rate and signal multiplexing modem. It's important to do past papers and ask Cupid for unclear concepts if you want a good grade.<br /><br />L01: Course Introduction<br /><br />L02: Signals<br /><br />L03: Channels<br /><br />L04: Linear Time-Invariant Systems (LTI)<br /><br />L05: Transmitting Data<br /><br />L06: Inter-symbol Interference (ISI) and Eye Diagram<br /><br />L07: Feedback Model of the Channel<br /><br />L08: Channel Equalization<br /><br />L09: Noise - Channel<br /><br />L10: Noise - BER calculation<br /><br />L11: Noise - Q-function<br /><br />L12: Error-Correcting Codes - (n, 1, n) code<br /><br />L13: Error-Correcting Codes - (8, 4, 3) (9, 4, 4) code<br /><br />(Midterm Exam - covering L01-L13, tutorials T1-T5, HW1)<br /><br />L14: The Frequency Domain<br /><br />L15: Filters and Frequency Response<br /><br />L16: Signal Transmission – Modulation<br /><br />L17: Signal Transmission – Demodulation<br /><br />L18: I-Q Transmission<br /><br />L19: Introduction to Networks<br /><br />L20: Link Layer<br /><br />L21: Network &amp; Transport Layers<br /><br />L22: Transport &amp; Application Layers<br /><br />L23: Course Review<br /><br />Total 8 labs. For each lab, there're 4 MATLAB checkpoints and a 5min open-book post-lab quiz. But the first lab doesn't count towards final grade. Usually lab can be finished in an hour despite the time reserved on the timetable.<br /><br />Total 3 pieces of homework. The first one is due before midterm while the last 2 is due about two weeks before final exam period.<br /><br />Final project consists of two parts, both parts requires MATLAB coding. First part is about distinguishing the sound between two simple single-syllable English word. Second part is about signal transmission through an unknown channel (with noise and delay).",
            "comment_teaching": "Lectures: Prof. Ross is good, he can answer your question clearly if you got one and some stay behind to ask him questions.<br /><br />Tutorials: It depends on the tutor as TAs will take turns to give tutorials. Most explains the topics with examples questions. You have to study the tutorial notes in order to have good post-lab quizzes. Cupid is nice and always available for questions at any time in the tutorial and during office hours.",
            "comment_grading": "Grading policy:<br />- 7 Labs (MATLAB simulations) 30%<br />- Lab Check-off Points 15%<br />- Post-lab Quiz 15%<br />- 3 HWs 10%<br />- Midterm Exam 30%<br />- Final Project total 30%<br />&nbsp;&nbsp;-&gt; MATLAB code 4%<br />&nbsp;&nbsp;-&gt; Written report 6%<br />&nbsp;&nbsp;-&gt; Demonstration 20%<br /><br />Midterm: 34/40 (mean: 26.91)<br />Lab checkpoints: 28/28<br />Post-lab quiz: 25.25/35 (mean 21.08)<br />HW: 60/60 36/48 34/34<br />Final project: 27/30 (mean 20.78)<br />Overall grade: A+",
            "comment_workload": "Decent for a 4 credit course.<br /><br />There are only 3 pieces of homework throughout the semester and each of them has more than 1 week to finish. But be aware that the third homework is released right after the second homework. So mind the due day of the homework.<br /><br />Each lab usually takes around 1 to 1.5 hours to finish. You can ask TAs for hints if you are stuck on a certain task.<br /><br />Midterm is a little bit intense. It's reasonable as long as you study for all calculations in tutorial and homework. Remember to do past papers to familiarize yourself with the questions because some of them are not that intuitive.<br /><br />For the final project, you can use the code (including the precompiled .p file) you used in labs. It is not that hard if you understand the concepts thoroughly. The demonstration is carried out in the room you have labs with a pre-assigned time slot. It is quite difficult to get full marks in the first part of the project as you can't test with the mic they use beforehand.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BoFZJXILHDUQZBITZAMwiyup2Vc3crAW",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                },
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "MissSomebody",
            "date": "Jan 25, 2022",
            "title": "Good Grade Course",
            "comment_content": "Lecture 1: <br />• Basic communication system<br />Lecture 2: <br />• Encoding Information with Bits<br />• Continuous vs Discrete-time waveforms<br />• Discrete-time bit waveforms<br />Lecture 3:<br />• The Discrete-Time Channel<br />• Effects of the Channel<br />Lecture 4:<br />Modeling the Channel<br />•&nbsp;&nbsp;Exponential Step Response<br />•&nbsp;&nbsp;Response to a single bit<br />•&nbsp;&nbsp;Response to general input<br />Lecture 5:<br />• Protocols in Data Communication Systems<br />• Decoding Bits<br />• Asynchronous serial communication<br />Lecture 6:<br />• LTI channel response to bit sequences<br />• Intersymbol interference<br />• Eye diagrams",
            "comment_teaching": "The tutorial is useful while the lecture is useless.<br /><br />Prof Khaled always comes late and quits early. Actually, He is just reading the ppt, which means reading the lecture notes yourself is fine.<br /><br />Cupid is very nice. When you face troubles in the lab, feel free to ask her.",
            "comment_grading": "Lab (30%)<br />Homework (10%)<br />Midterm Exam (30%)<br />Final Project (30%)<br /><br />The mid-term is somehow ridiculous, solving quadratic equations with an infinite decimal numerical answer and no calculator is allowed.<br /><br />Lab: ~ mean<br />Asm: ~full mark<br />Mid-term below mean 1 mark.<br />Final project: Full mark<br />Final grade: A",
            "comment_workload": "The workload is ok. The most important thing is to do revision before every lab(lab quiz).<br /><br /><br />The final project is easy if you can acquire the knowledge in the lab.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JZGjmoCIdytdmPwYaAijAS3hCeKYcge5",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LeePresident",
            "date": "Jan 03, 2022",
            "title": "Don't choose it if you are not required to take this",
            "comment_content": "The course is about the basic knowledge of signals and transmission. The mathematics inside this course is not complicated. However, it needs you to think and revise more as you may think that the content is easy in lectures but it would become difficult in the midterm.",
            "comment_teaching": "The professor encouraged us to ask the questions and he usually explained a little bit more on some topics if the time was sufficient. The TA and IA were quite helpful with good explanations during the tutorials and the labs.",
            "comment_grading": "10% Homework<br />15% Task Completion of Labs<br />15% Post-lab Quizzes<br />30% Midterm<br />30% Individual Final Project<br /><br />The final grade was C as I performed not so well in both midterm and project.",
            "comment_workload": "The workload in this semester is quite heavy as it is a 4-credit course.<br />The lectures and the tutorials did not take attendance but all 8 labs did that. The lab consisted of 4 tasks using Matlab to solve and a straightforward post-lab quiz.<br />However, the midterm and the final project were quite difficult and time-consuming.<br />There are also 3 homework assignments related to lectures, tutorials and labs and they were not so difficult.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9q2Xasu4fMADYtlAq1yL5cTLvmr9bmIl",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "isonngky",
            "date": "Dec 29, 2021",
            "title": "",
            "comment_content": "The course covers basically the fundamental background knowledge of signals. It helps you develop a step-by-step understanding of the system communication through lectures and lab sessions. <br /><br />There are in total 8 lab sessions using MATLAB to learn and try on signals/messages transmission, with each session covering a different focus taught on previous lectures.<br /><br />All the materials taught in this course are quite easy to follow. It does not require a strong mathematical background like other engineering courses, but the understanding of concepts behind it. In another word, you don't have to know why the formulae work, just to understand the reason we use them and then apply them.",
            "comment_teaching": "I would suggest f2f instead of online. Prof always spends time on lessons answering students' questions. All concepts taught are clearly explained with examples. He is very nice so don't hesitate to ask if you don't understand some of the concepts.<br /><br />The TAs are helpful too. The tutorials are very important as it covers all the concepts taught on the previous topics and some hints for the upcoming lab session. Though they are not going to teach you directly how you should do.",
            "comment_grading": "I think this course gives a fairly good grade.<br />Lab+quiz: 30%<br />Homework: 10%<br />Midterm: 30%<br />Project: 30%<br />Not hard for a B range. If you perform well in midterm then basically an A range. Given that your assignments and quizzes are not doing bad of course.<br />I performed well in the midterm but not in the project. Turns out still in the A range so the midterm is quite important.",
            "comment_workload": "The workload is on the average level.<br />This is a 4-cred course so it does have a certain workload.<br />About a lab session and two lectures a week. A following post-lab quiz after every lab session. In total 3 online assignments. A midterm and a final project. That's all.<br />If you really pay attention during lectures and tutorials, you don't need much extra time for revision. The post-lab quizzes are very straightforward, if you are doing all the stuff in the lab on your own then you shouldn't find them hard.<br />The midterm is quite hard tbh, so you need to have a full understanding of the topics covered.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "S0ryofuDI5Wr2ztrTQlo959CCtqjyHCF",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rayson",
            "date": "Dec 22, 2021",
            "title": "",
            "comment_content": "This course teaches a lot of basic knowledge of communication. The content is simple and we don't need to use complicated mathematic skills. However, I think I need to spend some time understanding the content which covers many topics.",
            "comment_teaching": "Professor is very nice. He always likes students to ask him questions. He will explain it again if there is extra time in the lesson. However, I think you need to do some revision after the lessons. Sometimes you may think the content is very easy in the lesson, but you may not know how to do when you do the homework or mid-term exam.",
            "comment_grading": "I think the grading is very good. I just only get the mean in my post-lab quiz, mid-term exam and homework. I get the full mark on the project. Finally, I get A grade in this course.",
            "comment_workload": "This course has no final exam, so the workload is quite large. First, there are labs every week and I need to do a post-lab quiz after the labs. Also, there is three homework and one mid-term exam. Finally, I need to do a project. I think every part is very important. If you pay some effort you can get a nice grade.<br />Lab check-off points (15%)<br />Post-lab quiz (5 mins) (15%)<br />Homework (10%)<br />Midterm exam (30%)<br />Final project (30%)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WxEdR4fJHB55mpK0jLUVc2fkoHyuWkmB",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                },
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CM14.1",
            "date": "Oct 28, 2021",
            "title": "Nice Course Nice Grade(maybe not now)",
            "comment_content": "Introductory course to communication and signal process. Basic concepts like step response, modulation and error correction are covered. Also offer entry level MATLAB knowledge and basic programming techniques, plus, a taste of algorithm like Dijkstra.",
            "comment_teaching": "Nice teaching! Due to some special reasons my session was taught by two professors, they are all great.<br />The teaching assistant (and lab assistant) Cupid CHOW is helpful. She offered rapid response to questions from students.",
            "comment_grading": "This section may not apply to offline semesters.<br />Quiz is in online mode and has a LOW Avr. and HIGH SD. If you understand the concepts, it is fairly easy.<br /><br />I remember they are open-booked, that's strange.<br /><br />Midterm is similar, VERY LOW Avr. and EXTREMELY HIGH SD. Get yourself prepared and obtain a good score.<br />Final project is not the same case. The average is fairly high. Regarding the difficulty, I think it is normal.",
            "comment_workload": "Light workload. <br />The lab workload is comparable to COMP1022P/2011.If u have a coding background, it will be easy. Post-lab quiz may be tricky and need preparation.<br />Make good use of your lab materials, especially programs, to solve problems in homework.<br />Final project is still fairly easy even u do not have a coding background. Lab work will provide u with enough practice.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "K5pijnSWg2ECqthbnJykG26IrpvL6ETl",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chlll",
            "date": "May 04, 2021",
            "title": "",
            "comment_content": "Good grade if the professor is professional, but the TA did not. <br /><br />Post-lab quizzes are easy. <br />Midterm is hard. add oil<br />final is the only project. (good grade)",
            "comment_teaching": "never attend the tutorial sessions. (no attendance)<br />the lecturer is professional in Matlab. (the project is easy)",
            "comment_grading": "good among all ELEC courses in 1000 lvl.<br /><br />easy to get B range. <br /><br />If you want A range, you need to pay more effort and get above mean in midterm",
            "comment_workload": "only need to do post lab<br />hw is too easy<br />midterm<br />final project<br /><br />TA said everything is so easy hehehe... and i also agree",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VgmZB8B0yW68fJEpjM3ixE2RMXrpQAVg",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "GreenTeaMarco",
            "date": "Jan 19, 2021",
            "title": "",
            "comment_content": "L01: Course Introduction<br />Metrics for communication systems, the digital abstraction, basic recipes for transmitting information<br /><br />L02: Signals<br />Point-to-Point Digital Links, discrete-time waveform<br /><br />L03: Real-World Channels<br />Representing discrete-time bit waveforms, effects of the channel<br /><br />L04: Linear Time-Invariant Systems<br />Exponential Step Response<br /><br />L05: Transmitting Data<br />Communication protocols, decoding bits, asynchronous serial communication<br /><br />L06: Inter-symbol Interference and Eye Diagram<br /><br />L07: Feedback Model of the Channel<br /><br />L08: Channel Equalization<br /><br />L09: Noise<br />Noise, power, binary channel model, BER of the binary channel<br /><br />L10: Noise<br />Modeling noise, Gaussian PDF, BER of AWGN channel<br /><br />L11: Error-Correcting Codes<br />Hamming distance, (n,k) block codes, error detection vs. correction, repetition codes, (8,4) codes<br /><br />L12:&nbsp;&nbsp;Error Correcting Codes<br />(n,k,d) Block codes, (9,4,4) block codes.<br /><br />L13: The Frequency Domain<br />Representing signals as sums of sinusoids, Euler’s identity<br /><br />L14: Discrete Fourier Transform/Frequency Response<br /><br />L15: Lossless &amp; Lossy Source Coding<br /><br />L16: Signal Transmission – Modulation<br /><br />L17: Signal Transmission – Demodulation<br /><br />L18: I-Q Modulation<br /><br />L19: Introduction to Networks<br /><br />L20: Link Layer<br /><br />L21: Network and Transport Layers<br /><br />L22: Transport and Application Layers<br /><br />L23: Course Review",
            "comment_teaching": "I skipped all the lesson after week 4<br />But Prof. Ross is good.",
            "comment_grading": "Homework - 10%<br />Lab - 30%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Checkpoints - 15%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Post-lab quiz - 15%<br />Midterm - 30%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mean: 42.7/60&nbsp;&nbsp;SD: 10.4<br />Final Project - 30%&nbsp;&nbsp;&nbsp;Mean 19.6/30&nbsp;&nbsp;&nbsp;&nbsp;SD: 8.5<br /><br />HW1 77/100<br />HW2 85/100<br />HW3 50/60<br />Midterm 49/60<br />final project 20/30<br />Grade B+",
            "comment_workload": "at the end of the semester will be will a bit harsh. HW3 will be released immediately after HW2. But most of the time, there wasn't much to do.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2rYeCiBVmFa447kBeaBYLwtor2U2jc8s",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Seanpan",
            "date": "Jan 18, 2021",
            "title": "",
            "comment_content": "Standard introduction to communication technology, the concepts were new to me but I don't find them difficult.",
            "comment_teaching": "Professor Murch is great. The pace of his teaching is nice, and the thing I respected most was that he never ends the meeting until everyone finishes asking questions. Cupid(assistant professor) was also a great help throughout the semester.",
            "comment_grading": "I would say the grading is quite nice.<br /><br />Midterm: 58/60 (~1sd above mean)<br />Hw1: 91/100<br />Hw2: 6x/100 (messed up this one)<br />Hw3: 58/60 (the assistant professor was nice enough to make this hw easier so that we had more time to study for the finals)<br />Final project: 28/30<br /><br />Expected an A(messed up one of the assignment) but got an A+ in the end",
            "comment_workload": "Three assignments, took me an hour or two to finish each.<br />One lab every week, with a 5-minute post lab quiz at the end of every lab session.<br />The professor gave us one month to work on the final project. I started working on it until the last week, and got it done within around three days.<br />Overall, nothing crazy for a 4-credit course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "92k51honj84yhL52qW54jhwTfSDP8zCO",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Durian",
            "date": "Jan 18, 2021",
            "title": "",
            "comment_content": "L01: Course Introduction<br />Metrics for communication systems, the digital abstraction, basic recipes for transmitting information<br /><br />L02: Signals<br />Point-to-Point Digital Links, discrete time waveform<br /><br />L03: Real World Channels<br />Representing discrete time bit waveforms, effects of the channel<br /><br />L04: Linear Time Invariant Systems<br />Exponential Step Response<br /><br />L05: Transmitting Data<br />Communication protocols, decoding bits, asynchronous serial communication<br /><br />L06: Inter-symbol Interference and Eye Diagram<br /><br />L07: Feedback Model of the Channel<br /><br />L08: Channel Equalization<br /><br />L09: Noise<br />Noise, power, binary channel model, BER of the binary channel<br /><br />L10: Noise<br />Modeling noise, Gaussian PDF, BER of AWGN channel<br /><br />L11: Error Correcting Codes<br />Hamming distance, (n,k) block codes, error detection vs. correction, repetition codes, (8,4) codes<br /><br />L12:&nbsp;&nbsp;Error Correcting Codes<br />(n,k,d) Block codes, (9,4,4) block codes.<br /><br />L13: The Frequency Domain<br />Representing signals as sums of sinusoids, Euler’s identity<br /><br />L14: Discrete Fourier Transform/Frequency Response<br /><br />L15: Lossless &amp; Lossy Source Coding<br /><br />L16: Signal Transmission – Modulation<br /><br />L17: Signal Transmission – Demodulation<br /><br />L18: I-Q Modulation<br /><br />L19: Introduction to Networks<br /><br />L20: Link Layer<br /><br />L21: Network and Transport Layers<br /><br />L22: Transport and Application Layers<br /><br />L23: Course Review<br /><br />Content takes sometime to understand, but its totally worth 4 credit :D<br />Final exam is replaced by final project. If you have trouble with coding in MATLAB, you might find yourself to be a bit lost with all the functions and all those stuff (Thats the case for me xD).",
            "comment_teaching": "Overall, the lectures are quite good with easy to read and understand pdf slides. Lab and tutorial are there to strengthen the understanding about the course. Some might find it difficult to do the post-lab quiz since its only 5 minutes to answer 5 question. For me, I struggle a lot for the post-lab quizes, but do pay attention to the tutorial, because some question might be on the quiz :)))",
            "comment_grading": "Homework - 10% <br />Lab - 30%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Checkpoints - 15%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Post-lab quiz - 15%<br />Midterm - 30%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mean: 42.7/60&nbsp;&nbsp;SD: 10.4<br />Final Project - 30%&nbsp;&nbsp;&nbsp;Mean 19.6/30&nbsp;&nbsp;&nbsp;&nbsp;SD: 8.5",
            "comment_workload": "In total, 3 homework need to be submitted. Each of them is quite tricky so pay close attention to the question. If you have any question, feel free to ask the TA. The TA is very good at explaining and is willing to explain the homework with similar question.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7sXEOCgdPzZSSGT8o4GnPzxZX1TM0NhA",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                },
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anthony Siu",
            "date": "Jan 04, 2021",
            "title": "",
            "comment_content": "This class teaches communication protocols and transmission. During labs, we use MATLAB to simulate such situations and use MATLAB coding to complete the task.",
            "comment_teaching": "Professor Letaief taught us for a few weeks, but he was sick so Professor Murch took over to teach us. Both professors taught the course material very well and answered most of our questions. During the lab sessions and tutorial, Cupid explained all the concepts clearly (even if we always complain the post lab quiz is too hard).",
            "comment_grading": "Grading weightage:<br />Lab - 25%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Checkpoints - 10%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Post-lab quiz - 15%<br />Homework - 10%<br />Midterm - 25%<br />Final - 40%",
            "comment_workload": "There wasn't much to do. There were 3 homework, a lab every week (have to attend tutorial to understand everything), and a final project.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xSRwf2BEub5Fp8DWtu8jCyuVkjIzgtDd",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nickname1242",
            "date": "Jan 04, 2021",
            "title": "",
            "comment_content": "Before I attend the class, many students say Cupid is very great and willing to answer questions. But every time we ask questions, she will only call us to watch notes.",
            "comment_teaching": "Originally is Ben's lecture, but he disappeared in the whole semester. The voice of Murch Ross was too soft and clear.",
            "comment_grading": "3 hw 10%<br />1 mid term 30%<br />weekly quiz 15%<br />tutorial 15%<br />final project 30%<br /><br />I got almost 80%, b+",
            "comment_workload": "This is the first-semester use final project, the project does not have too many hints. You have to learn Matlab yourself. Because the tutorial only teaches Matlab briefly, and you will only focus on the post-lab quiz.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MSjgXSSvTSnI4LznhXUrURPfHFfnOgeE",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "明溢大愚",
            "date": "Jan 02, 2021",
            "title": "Great Course, only if you are into Signals",
            "comment_content": "The content was easy to understand most of the time, except after signal modulation. (Week 9, L16; Read other reviews for the course outline, not going to post again). The parts for modulating signals are very math-based, but high school math is enough to tackle all that. Used a lot of trigonometries and continuous functions. Dijkstra algorithm in the latter part of the course might be tricky for some.<br /><br />In terms of coding, MATLAB is used, some efforts need to be paid. It wasn't something super complex, and coding involves correcting basic mistakes, manipulating arithmetic and arrays, making histograms and charts. More complex items would be modifying codes inside pre-written models.",
            "comment_teaching": "Prof Murch and Cupid were very friendly. Lectures weren't boring, he answered questions swiftly and explained everything clearly. PPTs were easy to navigate and had a maximum of 30 pages per lecture.<br /><br />Tutorials were a great compliment to the lectures and usually gives a kickstart towards the labs. You will have plenty of time to complete labs during",
            "comment_grading": "Grading Policy:<br />Labs: 30% (Lab Check-off Points: 15%, Post-lab Quiz: 15%)<br />3 Assignments: 10%<br />Midterm Exam: 30%<br />Final Project: 30%<br /><br />Statistics:<br />Homework 1: Mean 77.6/100<br />Homework 2: Mean 68.5/100<br />Homework 3: Mean 53.1/60<br />Midterm Exam: Mean 42.7/60, SD 10.4<br />Final Project: Mean 19.6/30, SD 8.5",
            "comment_workload": "A typical 4-credit course workload.<br /><br />Lab checkpoints were easy to do, some were too easy that they could be completed with common sense, and not fair to hardworking students as no reports were required and many can guess the checkpoints without doing the coding. Post lab quiz opens at the last 10 mins and gives 5 mins to complete, be sure to listen to hints during tutorials and labs. 5 questions, cannot return to previous questions, have some calculations to do, so they require some familiarity with the lectures.<br /><br />Make sure you do the math quick and have clear concepts in midterm exam. In this way, going at least mean+sd can be easy. It sucked when you cannot return to the previous question and have time pressure on you.<br /><br />Not a big deal for the assignments, referring to course notes alone can get you most of the answers. Some further understanding and intelligence required to get the rest. Time was more than enough to complete them.<br /><br />Final exam was substituted by a Project this semester, should be more than enough time to do given that there's a month for completion. It was in 2 parts, each with 5 3-point blocks. Pay some efforts into it and it's easy to secure the first 15 points. It was more challenging than labs as we had to start from scratch for many parts, even when we were allowed to reuse some lab codes. Second part was interesting and demanding to work out.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qTDLekVqIw6xO81u7cbMT5Z0I9TakIr9",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SAITAMA",
            "date": "Dec 23, 2020",
            "title": "",
            "comment_content": "cover the concept of communications, each of them is not difficult, but implementations can be quite complicated, would rather spend more time on doing past papers.",
            "comment_teaching": "both Ross and Khaled teach very thoroughly throughout for every complicated part of each course.",
            "comment_grading": "Homework 10%<br />Lab Check &amp; Post Lab Quiz 30%<br />Mid-term 30%<br />Final Project 30% (matlab coding)<br /><br />homework and final project are over mean, but my midterm is below mean, overall i still get B+.",
            "comment_workload": "lab have to do matlab, dont have good coding background, have to spend a lot of time working on the matlab syntax... there is no solution for each matlab..... spent so much time working on the final project....<br /> homework is reasonably adequate.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AlSpMeyGzJStCdKbTI1K2R6W7nu5smDy",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yaboi",
            "date": "Dec 23, 2020",
            "title": "Decent course, decent grades, good TA",
            "comment_content": "A lot of boring stuff tbh. <br />L01: Course Introduction<br />Metrics for communication systems, the digital abstraction, basic recipes for transmitting information<br /><br />L02: Signals<br />Point-to-Point Digital Links, discrete time waveform<br /><br />L03: Real World Channels<br />Representing discrete time bit waveforms, effects of the channel<br /><br />L04: Linear Time Invariant Systems<br />Exponential Step Response<br /><br />L05: Transmitting Data<br />Communication protocols, decoding bits, asynchronous serial communication<br /><br />L06: Inter-symbol Interference and Eye Diagram<br /><br />L07: Feedback Model of the Channel<br /><br />L08: Channel Equalization<br /><br />L09: Noise<br />Noise, power, binary channel model, BER of the binary channel<br /><br />L10: Noise<br />Modeling noise, Gaussian PDF, BER of AWGN channel<br /><br />L11: Error Correcting Codes<br />Hamming distance, (n,k) block codes, error detection vs. correction, repetition codes, (8,4) codes<br /><br />L12:&nbsp;&nbsp;Error Correcting Codes<br />(n,k,d) Block codes, (9,4,4) block codes.<br /><br />L13: The Frequency Domain<br />Representing signals as sums of sinusoids, Euler’s identity<br /><br />L14: Discrete Fourier Transform/Frequency Response<br /><br />L15: Lossless &amp; Lossy Source Coding<br /><br />L16: Signal Transmission – Modulation<br /><br />L17: Signal Transmission – Demodulation<br /><br />L18: I-Q Modulation<br /><br />L19: Introduction to Networks<br /><br />L20: Link Layer<br /><br />L21: Network and Transport Layers<br /><br />L22: Transport and Application Layers<br /><br />L23: Course Review",
            "comment_teaching": "Prof Khaled only taught us for a few weeks but then he fell sick. I hope he's doing well now. He taught well. Class was boring but he encouraged questions and answered them very well.<br /><br />Same with Prof Ross. He's a good teacher but the content itself is so boring, not much he can do to make it interesting.<br /><br />Cupid is a great TA. Super helpful and nice during labs and tutorials.",
            "comment_grading": "Grading weightage:<br />Lab - 25%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Checkpoints - 10%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Post-lab quiz - 15%<br />Homework - 10%<br />Midterm - 25%<br />Final - 40%<br /><br />What I got:<br />Lab: basically at mean. This shit was one of the most annoying things ever. Don't even need to do the MATLAB stuff to do the checkpoint questions. What sucks is that the questions aren't always connected to the MATLAB task. The postlab quiz is another beast. 5 minutes, 5 questions, cant go back to a previous question. I understood the course materials well but holy crap, I could never do well in these but somehow the means were pretty high.<br /><br />Homework: again, basically mean.<br /><br />Midterm: +0.9sd<br />Final: 28/30, mean was 21/30. The final was actually a MATLAB project. I lost 2 marks because of some MATLAB autosave error that removed like 3 characters from my submitted code, which made the entire code fail. Cupid is nice but she was unrelenting in giving me those 2 points even though I explained the error. Sucks&nbsp;&nbsp;a lot.<br /><br />Final grade: B+, really wanted an A but the labs really pulled me down.",
            "comment_workload": "It's a 4cr course, so expect 4 cr workloads. <br /><br />The 3 homeworks take a few hours to complete. Really pay attention when you do them or else you'll lose marks.<br /><br />The weekly labs were just MATLAB tasks and they're basically optional. If you understand the course content, you won't need to do them to get the post-lab quiz and lab checkpoints.<br /><br />Make sure you study for the midterm. The mean was pretty low, so it was pretty hard.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EOKlvTyDiADy808E7DnF432nrZ9vl8Rw",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Vegetable",
            "date": "Dec 16, 2020",
            "title": "AWESOME PROF AND IA!",
            "comment_content": "Cover some basic concepts of communication. Each of them is&nbsp;&nbsp;not hard, but the prof. might go through them very quick, especially after mid-term. If you are willing to spend about 1 hour per week after class, you can handle them easily.",
            "comment_teaching": "Prof. MURCH is very passionate on teaching, and willing to answer every question you have. The English accent of him is very comfortable to follow, and he is also very handsome!<br /><br />SPECIAL CREDIT to Ms. Cupid Chow!!!! She is the best IA I have ever met in my student life! She can anwer every question as long as it is legal in a very short time. The expected time of her email reply is in 10 min!",
            "comment_grading": "Homework 10%<br />Lab Check &amp; Post Lab Quiz 30%<br />Mid-term 30%<br />Final Project 30%<br /><br />I got ~95%, should be A+",
            "comment_workload": "Very low. Take some time to prepare for the post lab quiz, and everthing will be fine. There are three homeworks in total, each taking about 2 hours. Remember to do the final project as soon as possible after it is released, which will significantly relieve your finalp pressure!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OuAhfAYPRblywBB9M7FWP6nRYBmdt4kO",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 164,
                    "name": "MOW, Wai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "XIA YUNLEI",
            "date": "Aug 20, 2019",
            "title": "Be careful of your quiz",
            "comment_content": "From this course, you can learn the following things.<br />1. Examine a voice communication system to identify the practical context of key theoretical concepts in ECE.<br />2. Identify typical problems and tradeoffs encountered in electronic and computer engineering systems.<br />3. Analyze simple approaches to address a range of problems and tradeoffs.<br />4. Use software tools, such as MATLAB, to investigate potential solutions to problems and tradeoffs in order to validate an analysis, and to handle cases not amenable to simple analysis.<br />5. Work in a cooperative setting on real hardware where the simplifying assumptions used in the theoretical analysis may be violated, and assess the benefits and limitations of such analysis.",
            "comment_teaching": "The lecture was boring, and you can learn by yourself with the ppt.<br />However, the tutorial was quite useful, you can learn many practical problem solving approach and the TA was nice.<br />The lab was quite easy too, you just need read the materials before the lab and TA will help you with all your problems.But be careful of the quiz, it may be very difficult.",
            "comment_grading": "The grading policy is Lab Check-off Points 10%; Quiz 15%; Homework 10%; Midterm 25%; Final 40%.<br />As a result, if you performed well in your daily study and understand most of the contents, you'll get a good grade.",
            "comment_workload": "The workload of this course was not so heavy.<br />In fact, you can just go to the tutorial and the lab, the lecture is not necessary, the quiz should be prepared well and the exam will be much easier than the quiz. There were only three homeworks with the basic questions and you may find out later that some exam questions are the same as the homeworks'.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9zRgHiR6Hf1eUPb4XJR3TDpiyXnz9wDo",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 164,
                    "name": "MOW, Wai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "aNShk",
            "date": "Jul 02, 2019",
            "title": "",
            "comment_content": "Content is interesting. It covers topics like linear time invariant system, loseless and lossy compression and network etc.",
            "comment_teaching": "Professor Mow teaches well, he manages to cover a set of slides in a limited time period. Sometimes, he will talk faster near the end of lesson as he need to finish the topic off but you can always watch the lecture video if you miss something. <br />The tutorial section is very informative and just ask the TA whatever questions you have, they explain well.",
            "comment_grading": "Lab 25%<br />Homework 10%<br />Midterm 25%<br />Final 40%",
            "comment_workload": "Only attendance in lab is needed and there are 4 homeworks. The lab quiz are pretty easy but make sure to revise the tutorial notes and what you did in that lab. <br />For the homeworks, some questions need more thinking and are not that straight forward but the lecture slides definitely helps.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YPDEeRqfEe1OsSCC7lfVkJO2NlmJgVti",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "樹大有枯枝",
            "date": "Jun 27, 2019",
            "title": "",
            "comment_content": "Three parts:<br />Signal transmission in time domain: bit sequences, sampling, protocols, step response and recursive models, equalizer, noise, error correction codes. Covered before mid-term.<br /><br />Signal transmission in frequency domain: most abstract part of the course. sinusoidal waves, amplitude spectrum, frequency response, time-frequency analysis, modulation, demodulation, filters.<br /><br />Networks: internet, the functions and protocols of each layer in OSI model",
            "comment_teaching": "Professor Murch explains the abstract concepts quite clearly to prepare you for the much harder assignments and exams.<br /><br />Cupid knows the content very well (probably she prepared all the lecture notes, assignments and lab contents) and is very nice.&nbsp;&nbsp;She goes through the paper with you all over in paper-checking and is very willing to answer your questions any time you come to her office (in Cantonese, if you wish).<br /><br />The lab assistants are quite helpful and friendly and sometimes can also answer your questions regarding the concepts.",
            "comment_grading": "Lab (25%): completion (10%), lab quizzes (15%)<br />Homework (10%)<br />Mid-term (25%)<br />Final (40%)",
            "comment_workload": "Workload is light, only 3 assignments which are probably ok if you check answers with your friends.<br /><br />The labs last 3 hours starting at 9, but can be completed within an hour (you just need to change a few lines of code in each of the 4 tasks, and the changes are explained clearly in the tutorials), so I've always wondered why they can't start later.<br />The lab quizzes are nearly identical to the questions in the tutorials.<br />(The answers to the quizzes are not released, but you can check them with Cupid)<br /><br />The mid-terms and exams are quite similar to the assignments and the review questions. No calculators, get ready to memorize sin cos values of common angles and product-to-sum formulas.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "56suhor82FZu6YjTkqQ4ywTw7PKoOyni",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": ":):):):)",
            "date": "Jun 05, 2019",
            "title": "",
            "comment_content": "Basically it is introducing some basic ideas about how 'wireless communication work'. It goes from <br /><br />1. how to represent data using 0 and 1 <br />2. how to convert the 010001001... sequence into wave form (carrier of the data)<br />(Transmit the wave form in the transmission channel [Transmitter&lt;--------------&gt;Destination]<br />3. *modelling* the response of the transmission channel (air) i.e. input vs output<br />4. How to perform data correction when the wave form is modified by noise during transmission?<br />5. how to do modulation i.e. transmit different message at same time using same channel (air) without crush<br />6. some network concepts<br /><br /><br />It is fun to know how transmission work!!! It gives you ideas about how engineer viewing the world! But for deeper understanding, then you need to go to higher level course.",
            "comment_teaching": "The professor and TA are helpful in answering the questions. I email them once I got some points unclear and get fast reply.",
            "comment_grading": "I dun have many statistics. Below is a reference:<br /><br />me: total ~95%<br />=&gt;A+",
            "comment_workload": "Have lab every week which is quite tired, through it is not hard. It is a motivation for you to start study the course earlier. Therefore, you dun have to deadline fight before the exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zWhGq255EQprOnceDveYOYtVqj7gO03M",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Never Social",
            "date": "May 28, 2019",
            "title": "Well designed course, extremely low workload (for 4cr course)",
            "comment_content": "Please refer to other posts for the generals.<br /><br />&quot;ELEC majors told me this course is a good foundation for advanced courses.&quot; (Murch, 2019)<br /><br />Assignments * 3<br />Nothing hard. Just collaborate with someone to ensure accuracy.<br />Weekly labs/ post-lab quiz<br />The difficulty of the lab over time is quadratic, which peaked at the middle. Group mate who came in prepared makes lives easy.<br />You better have someone who's decent in reading codes or else its hell.<br />Post-lab quiz almost directly correspond to tutorial materials, easy.",
            "comment_teaching": "Lectures<br />Ross is charismatic, it is almost certain that there existed a queue of confused students post-class yet he answered them one by one..<br /><br />Tutorials<br />Cupid talks to herself in tutorials cuz its 0900 and no one is awake but she still give good explanation in tutorials/ labs<br /><br />Labs<br />Lab assistants are responsive. Sadly I can't go deeper as my group barely need any help.<br />Computers are faster then human my ass.<br />👌👌 10 minute to load fn Matlab<br />👌👌 5 minute to load Chrome<br />👌👌 2.5 to download lab code<br />👌👌 2.5 to load lab code<br />👌👌 2019 gottem",
            "comment_grading": "Lab: 25% * 24.63/25<br />Homework: 10% * 298/300<br />MT: 25% * 49/50<br />Final: 40% * 88.75/100 (haha was w0ke 22hrs when I started zzZ)<br /><br />Grade: A+",
            "comment_workload": "LMFAO. Almost non-existant.<br /><br />Weekly time allocation:<br />2hrs lectures, 1hr tutorial (I skipped in the second half)<br />1-3hr lab (~45minutes if fully prepped)<br /><br />Literally took 3hrs to prep final<br />Literally took 45+hrs to prep COMP2711, another 4cr course.<br /><br />Take this course lol SENG yr1s.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KUpGDmNv3ONQPs6k4sEEaYGAHvTDd0Co",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 164,
                    "name": "MOW, Wai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CS水泡",
            "date": "May 28, 2019",
            "title": "",
            "comment_content": "A basic introduction of signal and communication from the low level(bits, signal processing, error detection and correction) to higher network infrastructure(network layers, routing, protocols)<br /><br />Just an overview of digital communication on multiple levels, nothing in depth but it does cover a lot of content. Easy grades if you know a little about networking, bits, etc but it is not necessary.",
            "comment_teaching": "The professor is good at teaching the content. As long as you attend the lectures and pay some attention, the content itself isn't difficult. His response to questions is also very helpful for the understanding of the content.<br /><br />There are two parts of teaching. The lectures talk about the theoretical aspects with respect to communication, whereas the tutorials and lab session let you experiment with implementation using MATLAB. They cover different aspects and tutorials are advised to attend<br /><br />Tutorials are very important and Cupid teaches well.",
            "comment_grading": "Lab: 25%<br />&nbsp;&nbsp;&nbsp;&nbsp;lab tasks: 10%<br />&nbsp;&nbsp;&nbsp;&nbsp;lab quizzes: 15% (5 minutes, 5 questions)<br />Homework: 10%<br />Midterm: 25%<br />Final: 40%<br /><br />*It will be an auto-fail if you skip the labs for more than twice.<br /><br />Midterm: <br />&nbsp;&nbsp;&nbsp;&nbsp;Average: 36.7/52<br />&nbsp;&nbsp;&nbsp;&nbsp;SD: 8.9<br />Final:<br />&nbsp;&nbsp;&nbsp;&nbsp;Average: 75.85/100<br />&nbsp;&nbsp;&nbsp;&nbsp;SD: 17.1<br /><br />The labs and homework are just finishing checklists, easy to get near full mark. Midterm may seem to have a strict time constraint but it is rather manageable since they don't give you time-consuming questions.",
            "comment_workload": "The workload is relatively light considering the lectures don't take attendance and you can usually finish the labs within half of the 3 hours given. The tutorials are useful to speed up your labs and they provide near identical example questions for the lab quizzes.<br /><br />Besides regular class and labs, there is a midterm, a final and three homework. Not much memorization is needed for the written exams as they are mainly testing your concepts. Lab quizzes are open notes, meaning no phones but you can use your laptop to review the lecture and tutorial notes.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZKQcX2QZgaqFNNxjJRJTMf6ABjBoOt3D",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nussun54",
            "date": "Mar 25, 2019",
            "title": "A System View of Communications: from Signals to Packets",
            "comment_content": "1. Examine a voice communication system to identify the practical context of key theoretical concepts in ECE.<br />2. Identify typical problems and tradeoffs encountered in electronic and computer engineering systems.<br />3. Analyze simple approaches to address a range of problems and tradeoffs.<br />4. Use software tools, such as MATLAB, to investigate potential solutions to problems and tradeoffs in order to validate an analysis, and to handle cases not amenable to simple analysis.<br />5. Work in a cooperative setting on real hardware where the simplifying assumptions used in theoretical analysis may be violated, and assess the benefits and limitations of such analysis.<br /><br />The majority of this course focuses on how we transmit signals from a machine to machine basis, then the last quarter focuses on a bigger picture, on how the entirety of networks, internet etc. works and functions although this part was very brief and rather rushed.",
            "comment_teaching": "Professor Ben Letaief was good, thought he really emphasised the overall uses and importance of signal transmission in real life applications rather than content that might be examined. For those who are more grade-focused rather than just interested in the topic might struggle with his lectures as he sometimes goes through some important content rather quickly but focuses on &quot;non-exam&quot; content e.g. real life applications a lot more than needed, wasting a lot of the 50 minute lecture time. Really important to understand the lectures from the start to ensure you know what is happening later on as it is very much linked together. Some might struggle at the start with the content if there isn't a good background of signals. If there is any confusion, ask Cupid, she was really helpful and willing to solve any problems that you may have. She also teaches the tutorials which are important for lab work and some review of lecture content. Lecture videos are also provided.",
            "comment_grading": "Lab (25%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Check-off Points (10%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Post-lab quiz (15%)<br />Homework (10%)<br />Midterm Exam (25%)<br />Final Exam (40%)<br /><br />I did slightly above average in midterm. Many people got very high grades I thought I was gonna get an average grade in the end. But the final exam was much easier than expected and I did a lot better (97.5%). The 10% check-off point from labs is essentially attendance but the 15% post lab quiz probably requires more attention than I initially thought. I did struggle through the initial quizzes and it is good to review some notes before taking the quiz as there is also a time limit (5 minutes). I ended up with an A+ which I didn't expect until I did my final exam. I thought grading was fair.<br /><br />Midterms: Mean = 37.5/50; S.D. = 7.8<br />Finals: Mean = 74.8/100; S.D. = 18.1",
            "comment_workload": "2 hour of lecture time per week<br />1 hour of tutorial per week <br />&quot;3 hours&quot; lab work per week<br /><br />Lecture is rather short so it is key that you listen carefully. <br />Tutorial is extremely key to the lab (especially if you do not understand) as Cupid essentially goes through how to conduct the lab.<br />3 hours of lab time is given but could be finished in 30-45 mins if capable in MATLAB (The first lab is teaching you how to use MATLAB). I suggest spending some time to reading notes after your lab work to prepare for the 5 minute quiz. Overall should not exceed 1 hour and&nbsp;&nbsp;30 minutes maximum. (I always finished the lab work and quiz within an hour as I also had a decent lab partner)<br />3 homework which were fair in length, not extremely hard.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gQkq1roGvNidg96B0klMs3x3H2vBAmJ4",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kus",
            "date": "Jan 25, 2019",
            "title": "Quite good course if you are willing to work",
            "comment_content": "Weekly Class Schedule:<br /><br />L01: Course Introduction<br />L02: Signals<br />L03: Real World Channels<br />L04: Transmitting Data<br />L05: Intersymbol Interference and Eye Diagram<br />L06: Feedback Model of the Channel<br />L07: Channel Equalization<br />L08: Noise<br />L09: Noise<br />L10: Error Correcting Codes<br />L11: Error Correcting Codes<br />---------------------------------------------------------<br />MID-TERM<br />---------------------------------------------------------<br />L12: The Frequency Domain<br />L13: Discrete Fourier Transform/Frequency Response<br />L14: Signal Transmission – Modulation<br />L15: Signal Transmission – Demodulation<br />L16: I-Q Modulation<br />L17: Lossy Source Coding<br />L18: Introduction to Networking<br />\t\t-circuit switching v.s. packet switching<br />\t\t-layering\t\t<br />L19: Link Layer<br />\t\t-Multiple Access Protocol (MAC)<br />\t\t-Random Access Protocol (RAC)<br />\t\t\t*ALOHA<br />L20: Network Layer<br />\t\t-Internet Protocol (IP)<br />L21: Network Layer II<br />\t\t-Routing (Dijkstra’s algorithm)<br />L22: Transport Layer<br />\t\t-TCP vs UDP<br />\t\t-timeout<br />L23: Application Layer<br />L24:&nbsp;&nbsp;Course Review<br />---------------------------------------------------------",
            "comment_teaching": "Good prof. , willing to answer your question<br />while the TA in lab section depends on your luck",
            "comment_grading": "Be aware of the pro-lab quiz, although it's very easy, it only provides you with 5mins to ans 5 questions without correction. Sometime it is hard to finished properly, especially if you're a time-sensitive person.",
            "comment_workload": "3 Asginments<br />1 Mid-term<br />1 Final<br />Lab section every week and a pro-lab quiz<br />------------------------------------------------------------<br />It's a 4 crds course after all.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yJoVnh4Trgs8ByHOZZSefc8nuDWgt6Dr",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YUENSC",
            "date": "Jan 02, 2019",
            "title": "Hard course",
            "comment_content": "A basic introduction of signal processing (point to point) and internet hierarchy<br /><br />Have you ever wondered what technologies go into your mobile phone or a WiFi hotspot? Through hands on work with a simple but fully functional wireless communication system, you will understand the basic engineering tools used and tradeoffs encountered in the design of these systems. This course is centered on weekly laboratories, each designed to introduce an important concept in the design of these systems. The lab sessions are supported by two one-hour lectures and a tutorial that introduce the concepts for the next laboratory, as well as reviewing and expanding the concepts learned in the previous laboratory.",
            "comment_teaching": "Clear but not that interesting, always asking for question from students.",
            "comment_grading": "Good enough.<br /><br />HW1: 14.4/20<br />HW2: 89.5/100<br />HW3: 78.5/100<br />lab: 20.83/25<br />MT: 49/50&nbsp;&nbsp;&nbsp;&nbsp;Ave: 37.5/50&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;SD: 7.8<br />Final: 94.5 /100 Ave: 74.8/100&nbsp;&nbsp;&nbsp;&nbsp;SD: 18.1<br /><br />Please refer to other post for the distribution<br />I forgot.<br /><br />Letter grade: A+",
            "comment_workload": "Some hw, lab per week, <br />lab require some programming and understanding of recent lectures., not straightforward<br /><br />Final is great&nbsp;&nbsp;as a lot of stuff I memorized is given in the paper. <br />All long questions.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "u37HFBwYzTrLA6wVsUD5YIGjaSZlKGp8",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "***",
            "date": "Jul 04, 2018",
            "title": "Elec 1200",
            "comment_content": "The content is mainly divided into three parts. <br />There is homework after each topic which consists of a few questions regarding the taught topic. The homework is included in the final grade.<br />There are no attendance requirement for the lectures but for the lab sessions you can not be absent for more the 2?(not sure) sessions or you will fail the course.",
            "comment_teaching": "The professor is extremely good at explaining the content. Even without any prior knowledge, you are able to score high marks.<br /><br />The teaching is divided into mainly two parts. The professor gives the lectures and there are additional lab sessions which you have to use MATLAB to complete the lab work.",
            "comment_grading": "You need a bit of time to get used to the grading because a lot of people score high grades on the midterms and finals. Even with high midterm and final grades, you are not guaranteed a high overall grade.",
            "comment_workload": "There is not a lot of workload in terms of homework or assessments. There are three assessments after each big topics which you have to hand in online. Other than that there are only midterms and finals.<br />The completion of the lab sessions and the post lab quizzes are also graded. The labwork is somewhat difficult for people who are new to MATLAB and it take a bit of time to get used to all the functions. Although you are given three hours to complete the lab, previewing the content before the lab sessions is extremely helpful and will make it possible for you to finish early.<br />There are mandatory lab quizzes after each lab which is also counted towards your grade. The quizzes are not that difficult since it is purely based on the lab work done on that day.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DCXWSjYlA7ejVlFoB5lZZdxAiOBEZR3P",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "陈润洲",
            "date": "Jul 01, 2018",
            "title": "",
            "comment_content": "The stuffs in course are generally related to life and 啊are useful. Contents are neither too simple nor difficult to understand. You can learn a lot about communication in ELEC 1200.",
            "comment_teaching": "Ross taught well in general, he will leave around 5 mins for Q&amp;A in each course though sometimes no one ask him. But for some particular parts which we are not familiar with, he might not explain in detail all the time and you should spend some time on them after class.",
            "comment_grading": "It's not difficult to get an A but if you want a plus, then do work really hard.",
            "comment_workload": "The largest workload course I had this semester but it's a 4 credits course so that makes sense. You should spend several hours on the materials and labs quiz course aside the courses. There will be 3 homework.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FLc0a35NleJQ6wlqMKAQ4HPUpPxVGfSa",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 187,
                    "name": "TSANG, Danny Hin Kwok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Brian123",
            "date": "Jan 24, 2018",
            "title": "",
            "comment_content": "signal transfer, Network",
            "comment_teaching": "上堂有D悶, Lecturer 幾有心機教, 你肯問佢肯答, 講簡單英文, 不過有時成日指住個screen 去this this this, 如果岩岩瞓醒, 要follow返佢進度都有D難, 語調有D單一, 令到我上堂有時會瞓著<br /><br />Tutorial 係lab 既introduction, 有PRS, 唔知係咪計attendence",
            "comment_grading": "ok既<br />我mid-term, exam below mean都有C+",
            "comment_workload": "4份assignment, 每星期一個lab, assignments 同 lab 有source跟住做其實唔難, 有某D topic我都覺幾有趣<br />完lab會有online short quiz",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OUIpcO1DGkXQySaWBbdcsbssg1DFZlmv",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 163,
                    "name": "LUO, Shuangyu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "butter New fly",
            "date": "Jun 16, 2017",
            "title": "Good course",
            "comment_content": "This course is about basic communication system, with first 2/3 of the course focusing on precise communication between two points and last 1/3 on communication networks. Last 1/3 requires some memorization.",
            "comment_teaching": "Prof Murch is very passionate and explains things in a clear way and uploads class video in time on canvas. He also constantly encourages us to answer questions. But since it's 9:30am class, sometimes I'm a bit sleepy. The TAs Allie and Cupid are very helpful and friendly during lab sessions.",
            "comment_grading": "Grading policy: <br />Lab check-off points&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />post lab interview&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;15%<br />Homework(three in total) 10%<br />Midterm&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;25%<br />Final&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;40%<br /><br />Everyone could get similar points for lab ranging from 22%-24%. Midterm has many questions the same as pastpaper and was very easy, some statistics: total=82; mean=64.3; SD=13.9. Final has some tricky questions, but overall it's also easy, some statistics: total=100, mean=64.91, SD= 20.12. <br />To be honest, if you understand all the homework and sample questions, midterm and final shouldn't be a problem. I got 95.5% and an A+.",
            "comment_workload": "Workload is the only thing that is not very perfect about this course. There are 10 labs in total, and each lab requires at least an hour beforehand to look over the lab manual.Many of the labs use matlab which is not very easy at the beginning. But matlab is very useful. Homeworks can be a bit tricky as well.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jdLhUxqWyySSnAivZGgmPqqgSKrbQajP",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 187,
                    "name": "TSANG, Danny Hin Kwok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tisb1234",
            "date": "Jan 27, 2017",
            "title": "",
            "comment_content": "The amount of content is not that big. There are a lot of chapters in this course, however as this is 1000 level course, the course does not go so into complex concepts. You can basically learn a lot of creative things.",
            "comment_teaching": "The way professor tries to teach is pretty good. He tries to relate all the concepts to real life problems so that students could easily understand. However, after the mid-term as content got little bit difficult, I had tough time understanding the concept. I had to watch youtube videos to understand clearly.",
            "comment_grading": "I think grading is decent. I got 98/100 in mid term. For final, I got low 80s - I think it was around 1.5 sd above. I got nearly full marks in homeworks(10% in total), average 9 in pre-lab(10%) and okok in post lab interviews (which accounts for 10%). I got an A+ in the end.",
            "comment_workload": "I think workload for this course is too much. There are labs every week and you need to prepare post-lab interviews while finishing and submitting pre-labs every week. I took 1~1.5 hour finishing pre-lab (sometimes 30 minutes). For 4 credit course and comparing other 4 credit elec courses, I think workload is quite heavy.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qk915jlIk2wgmDEd8myT7BJv4ia84W24",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 187,
                    "name": "TSANG, Danny Hin Kwok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cheung",
            "date": "Jan 25, 2017",
            "title": "nice course to start communication technology",
            "comment_content": "a lot of different areas like Internet layers and MATLAB information transfer. it is based on the same introduction course of ELEC in MIT, so the content is good and well organised.",
            "comment_teaching": "OK but the instructor encourage students to seat in the front and he seldom uses microphone. after midterm, the content became more and he always run out of time at around 3-5 minutes which is acceptable.",
            "comment_grading": "it is ok and the A range is slight larger than average in UST, even not full mark in post-lab interview but 1SD higher in midterm and final can get good grade. 2SD is able to get A or A+",
            "comment_workload": "as a introduction course in ECE, not a lot to calculate but a lot to remember, so we need to remember things particularly after midterm, workload is slightly higher than MATH course.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BCR5GiqlTk2mIMP9jidgvEMmPN0utL9t",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nangyo",
            "date": "Dec 16, 2016",
            "title": "",
            "comment_content": "Introductory course for communication system. Starting with understanding of bit sequence, this course analyses aspects of different communication levels.",
            "comment_teaching": "Very interesting, clear, and focused.",
            "comment_grading": "Fair grading. Midterms and finals are basically the most important factor deciding the grade.",
            "comment_workload": "Work load for this course is s pretty large for 1st year student. Especially, lab materials including pre labs consumes time way more than expected. For a student who have little knowledge on coding might be difficult to work on MATLAB. There are three homework assignments as well, which are not too difficult.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JFiRvYQKX0PD1HsuBiMbDec7kpDMRvJC",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 187,
                    "name": "TSANG, Danny Hin Kwok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mike suen",
            "date": "Sep 12, 2016",
            "title": "",
            "comment_content": "elec對signaling的入門course. 難道並不大. lecture的ppt中的內容十分顯淺易明. lab的進度和教學內容同步並需要有對ppt的良好理解. 總括而言是一門好grade科",
            "comment_teaching": "基本上堂上也大多照ppt講, 但不會太沉悶, 上上堂也無妨.",
            "comment_grading": "因為比較容易, mean比較高.",
            "comment_workload": "workload並不大, 大約每個禮拜1個lab. homework就只有3份. 需要比較用心去做pre-lab, 因為prelab都計分既.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "S2a0Gme2Ij6eqMgG8RqViZ5oFNjibqLK",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lcs",
            "date": "Aug 20, 2016",
            "title": "Nice course",
            "comment_content": "This course mainly talk about the communication in computer network. It will focus on five of the seven layers of the OSI model. The lab on each week focus on the knowledge you learn on previous week and will definitely help your understanding. There would be a post-lab interview which would ask you about the things you just done in the lab, so make sure you know what you are doing in the lab rather than just following the instructions without thinking. Tutorial covers the upcoming lab and the pre-lab exercise, so register a time slot that is before the lab session. If you are confident enough, you could skip the tutorial and read the lab manual and ppt on your own.",
            "comment_teaching": "Prof. SHI is very good at teaching. He has a nice accent and his in-depth explanation makes no difficulty in understanding. He is also very nice and willing to answer most of the questions. The lecture notes are good in general except the comic sans...<br />But many of the TAs have bad pronunciation and sometimes difficult to understand, so be careful when choosing TA to do the post-lab interview.",
            "comment_grading": "Grading is good<br />mid-term +1SD<br />final +0.5SD<br />homework 7.5/10 10/10 9.5/10<br />pre-lab, lab, post-lab interview almost all full mark and I got A-",
            "comment_workload": "Workload is somehow heavier than other courses since you have to attend the lab every week and do the pre-lab exercises. There are only three homeworks throughout the semester and it is quite simple. The pre-lab exercises are easy also but sometimes it could be time-consuming. You could get full mark with ease on pre-lab and homework. Mid-term and final are similar to that of other courses, nothing special.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bp9UWlr8tbnTnA9WhHnLjELFdvcA3XE1",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Edwardtpl",
            "date": "Jan 26, 2016",
            "title": "Good course to learn the basic",
            "comment_content": "50% calculation<br />50% data content<br />not very hard calculation just simple<br />need to memorize the content",
            "comment_teaching": "normal, not too bored<br />murch quite nice<br />willing answer question",
            "comment_grading": "infinite B range<br />midterm: below 0.7SD<br />Final: Below 1SD<br />LAB all done<br />Pre-lab<br />Homework all done<br />Finally getting a B",
            "comment_workload": "one lab per week<br />need to hand in pre-lab exercise before the lab start<br />have post-lab interview which TA will ask question about the linkage between lab and lecture<br />3 homework in 1 semester (mainly calculation and drawing chart)<br />midterm quite easy<br />Final cover all the materials in lesson cumulatively",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BQepn9hNxv09jWumajm2XO8CPhGCQurz",
            "semester": "2015-16 Fall",
            "instructors": [],
            "is_author": false,
            "author": "manselrian",
            "date": "Dec 24, 2015",
            "title": "Informative course",
            "comment_content": "Interesting introduction to signal transmission.&nbsp;&nbsp;It covers difficulties in wirless communication, baisic signal processing, error correction, data transfer methods, protocols, layers, etc.",
            "comment_teaching": "Professors and TAs are fluent in English, nice and helpful in answering enquires.&nbsp;&nbsp;Lecture notes, tutorial notes and lab manuals are well prepared and informative.&nbsp;&nbsp;This course has the best&nbsp;&nbsp;teaching in my opinion.",
            "comment_grading": "The grading is good from what I know.&nbsp;&nbsp;<br />Midterm+prelab nearly full marks<br />Missed one homework<br />Lab full marks <br />Final +0.5SD --&gt; A",
            "comment_workload": "Homework+Prelab+Lab+Post lab interview+Midterm+Final, <br />2 hrs lecture<br />1 hr tutorial<br />3 hr lab <br />6 hrs per week in total.<br />Workload is a bit much for a 4 credit course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vT6VOWRDdQZTD8FtSqTkSLkppRD7UNCH",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sgargaa",
            "date": "Dec 21, 2015",
            "title": "Fun and interesting",
            "comment_content": "The content is pretty interesting and gives a great amount of information on various topics basically covering everything about the transmission, communication and reception of a signal.",
            "comment_teaching": "The professor is great and he takes initiative to meet you after class and often comes to the labs just to inquire about your course progress and actively asks for feedback on his teaching, and about the course. He has a great accent and I personally loved the way he taught in class. Even if you meet him outside the class, in the corridor, he would greet you if he remembers your face from the class. Even the TA, Cupid Chow, was pretty cheerful, and the notes that she prepared were pretty great. You will not mind going to classes for this reason. Apart from that, both, the lectures and tutorials are only 50 minutes long. Hence, it should not be a problem.",
            "comment_grading": "Prelab exercises 10% and these have to be handed in at the start of the lab every week.<br />Lab Check-off Points 5% that is what you do during the labs. This makes attendance during class necessary.<br />Post-lab interview 10% which is a mini interview at the end of each lab, and you need to be thorough with the course notes and lab answers for this. The marking here is pretty lenient though.<br />Each lab group must have 2 students which you usually declare by the end of the second week. Please make sure your partner is hard-working.<br />Homework (3 of them) 10%<br />Midterm exam\t25%<br />Final exam 40%",
            "comment_workload": "I personally believe that you should take this course only if it is compulsory for your major requirements. Do not take this course unnecessarily as the amount of workload for this course is pretty high, with regular submissions of assignments and prelabs. There is a bit of cramming work that is required towards the end of the course, so I would suggest you start studying a few days in advance.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ljftphi0culNEbOJ80BR8Qt6GsfqG66o",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                },
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ayymiami",
            "date": "Aug 31, 2015",
            "title": "Decent introduction signals course",
            "comment_content": "Basic wireless communication theory, signal processing and error correction in the first half of the course, and the second half covering internet protocols and data transfer methodologies. This course feels like the first step before taking ELEC2100.",
            "comment_teaching": "Both the professors have very fluent English and teach well, but the course easily gets boring when there is no interactivity between lecturer and students. More than a few times, the professor would ask simple questions in class but no student would bother answering even if they knew the answers, making it clearly frustrating for the professors and even less interesting for the class.",
            "comment_grading": "This course requires you to learn many new concepts and once you are able to get acquainted with them, it becomes easy to do well. This is clearly one of those courses where the more you study, the higher marks you will probably get. The problem is that if you're not one to study much, you will be left far behind.",
            "comment_workload": "Each week you need to complete 1-2 pages worth of pre-lab assignment that often includes MATLAB scripting and plotting graphs. Since most students can't afford to have it on their personal computers, you're forced to work at the barn or library. Labs are conducted in pairs but these are to be done separately. There are also post-lab interviews where the TAs ask you questions based on the lab tasks(which are often hard to understand). Apart from this there were also a couple of written assignments&nbsp;&nbsp;that take a few hours to complete at the very least. I suggest having some friends also in the class and discuss material with each other often",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WHv5v4APbGAzANhqxWthv1vhlQ4HBU23",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 164,
                    "name": "MOW, Wai Ho",
                    "rating": 1
                },
                {
                    "id": 165,
                    "name": "TANG, Yimeng",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CC",
            "date": "Aug 22, 2015",
            "title": "A lot to learn",
            "comment_content": "Covers basic ideas of communication systems. Some of them are quite in-depth and challenging. The topics range from software to hardware. It uses MATLAB for coding.",
            "comment_teaching": "This A is definitely for Yimeng. She is amazing. She replies email very promptly. She explains things clearly and patiently. She is also very organized and responsible. Thumbs up!",
            "comment_grading": "Homework<br />a combination of maths and logic<br /><br />Lab<br />pre-lab + lab tasks + post lab interview<br />2 students in a group to do about 5 tasks every lab.<br />for post-lab interview, the TAs would ask you question about the theory behind the lab tasks. I just threw anything I remember from the lectures at them, which sometimes work.<br /><br />Exam<br />Mid-term + Final<br />a MUCH harder version of homework questions<br /><br />All the hard work pays off. This course gives good grades!",
            "comment_workload": "All basic MATLAB functions are taught in the first lab session. There is quite a lot to take in for the first few labs. For slow learners like me, it was a lot to take in for EVERY week. <br />Pre-lab, lab tasks and post-lab interview are all required. One of the later pre-lab took me so long that I almost gave up. <br />There is a LOT to do every week.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oWxavt9jnijZvdGY109VxVQgWR52RlHF",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Aarav",
            "date": "Jun 22, 2023",
            "title": "Would Recommend It (A very straightforward course)",
            "comment_content": "The content was very simple, straightforward, and not very big. It mostly taught the basics of communication and bits streaming to provide students with a fundamental understanding of the above.",
            "comment_teaching": "While many courses in HKUST have satisfactory teaching, this course does not fall under that case. Professor Shi is an excellent professor who can proficiently answer student's queries along with Assistant Professor Chow who always went out of her way to ensure everyone understood the concept and was always willing to meet students outside classes to help them.",
            "comment_grading": "The Grading was very lenient, with both exams being pretty easy. This semester the top 30 percentile got an A range. <br /><br />I was mean in the Midterm exam and upper quartile in finals while the lab's post-quiz were roughly 8.7/10 and lab checks were 5/5, the project was 17/20 and full in all HWs. My overall grade was A- (don't worry, everything was easy, just required a decent amount of work in)",
            "comment_workload": "The Workload was adequate with lab every week (except for a few). Although the official time for labs was 3 hours, most students were able to complete them in half the time. <br /><br />HWs were not time-consuming and mostly straightforward with some tricky parts. <br /><br />There were 2 classes every week but attendance was not mandatory (Although I recommend going to classes, especially after midterm).",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sNYJtrKDNqSGfM5DWhsakYFv8PWNQbZG",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AuTomatocTi",
            "date": "May 28, 2023",
            "title": "good course but cover too few things in our semester",
            "comment_content": "**This course has mainly focused on how the signal transmitted from one device to another and mainly divided into 2 parts: the character of a channel play, and how the sender(receiver) needs to do to overcome the limit of the channel<br /><br />(details):<br />Lecture:<br />- discrete-time waveforms &amp; sampling<br />-# bit rate &amp; SPB<br />-# unit step function<br />-# effect of channel(attenuation,delay,offset &amp;blurring)<br />- introduction of the concept of communication channel and LTI system<br />-# exponential step response model<br />- training sequence &amp; framing<br />- Intersymbol interference (ISI), settling time, eye diagram<br />-# equalizer &amp; recursive model<br /><br />-# BER and noise(AWGN)<br />-# Gaussian PDF &amp; Q-function<br />-# transmit power,threshold, signal-to-noise ratio(SNR)<br />-# coding &amp; decoding of error correction code(ECE)<br />- code rate, gross bitrate, net bitrate<br />- Hamming distance, error-correction &amp; detection ability of an ECE<br />- repetition code, (8,4,3) code, (9,4,4) code<br /><br />- sinusoidal/frequency response model of signals (continuous time &amp; discrete time)<br />-# Fourier series(transform) &amp; amplitude spectrum<br />-# filter<br />- spectrogram, quantization bits<br />- auditory coding(psycho-acoustics, masking effects, non-uniform quantization)<br />- compression (lossless, lossy)<br />- data rate<br /><br />-# frequency division multiplexing &amp; demultiplexing<br />- transmission bandwidth<br />- analog modulation(circuit-switching) &amp; digital modulation(packet-switching)<br /><br />-Internet layer<br />- 5 laying of the internet (application, transport, network, datalink, physical)<br />- (datalink layer)MAC address, TDMA, FDMA, #slotted ALOHA<br />- (network layer)routing &amp;forwarding, #Dijkstra's algorithm, IP address &amp; sub-mask of IP<br />- (transport layer) throughput, #TCP<br />-(application layer) client-sever &amp; P2P structure, HTTP, DNS<br /><br />#exam mainly focuses on<br /><br />Lab:<br />&nbsp;&nbsp;&nbsp;&nbsp;&gt;lab1: Introduction to MATLAB<br />&nbsp;&nbsp;&nbsp;&nbsp;&gt;lab2: Characterizing and modelling a channel<br />&nbsp;&nbsp;&nbsp;&nbsp;&gt;lab3: Communication protocol and BER<br />&nbsp;&nbsp;&nbsp;&nbsp;&gt;lab4: Eye diagram and equalization<br />&nbsp;&nbsp;&nbsp;&nbsp;&gt;lab5: Bit errors and SNR<br />&nbsp;&nbsp;&nbsp;&nbsp;&gt;lab6: Time-frequency analysis<br />&nbsp;&nbsp;&nbsp;&nbsp;&gt;lab7: Frequency division multiplexing<br /><br /><br />Project:<br />*- aim: minimize the energy per bit of signal transmission in a channel with unknown properties<br />&nbsp;&nbsp;&nbsp;&gt; mat lab code: encoding, decoding, and basic setting(threshold e.t.c)<br />&nbsp;&nbsp;&gt; report: 1000 words<br />**projects in a different semester can have large difference<br /><br />*some concept that may covered(but didn't covered in our semester):<br />- Q/I modulation<br />- BPSK/ QPSK<br />- constellation diagram<br />- Huffman encoding compression<br />- Hamming code(7,4,3)<br />- Brust error",
            "comment_teaching": "professor and IA(Cupid CHOW) will ans your question and mark the paper quickly<br />also, I like how he uses marks in Canvas to represent seat no in the exam",
            "comment_grading": "quite a good grading<br />as most of the marks can easily get<br />*(it is not difficult to get ~80% marks in midterm and final if you had studied and didn't miss the lectures)<br />*(try do the hw and project together with your friends for double check to reduce careless mistakes, getting full marks in hw is not difficult at all)<br /><br />my grade:<br />assignment(10%)<br />Hw1:30/30<br />Hw2:30/30<br />Hw3:30/30<br /><br />lab check-off(5%): 24/24<br />post-lab quiz(10%): 22/24<br />*1st lab doesn't count<br />*pots-lab quiz is accessible after completing all check-off point, each quiz have 5 min to complete 4 questions <br /><br />project(20%)<br />project code: 4/4 *(can get all 4 marks if your code can run properly)<br />project result: 6/6 *(depends on your result of the code)<br />project report: 7/10<br /><br />midterm(25%): 35.5/40<br />final(30%): 49/50<br /><br />grade: 92.75/100(A+)<br />*cutoff: around 91% can get A+<br />&gt;85% probably can get A-range",
            "comment_workload": "not too heavy workload:<br />- 3 assignment<br />&nbsp;&nbsp;&nbsp;&nbsp;- each has 3 questions<br />- lab<br />&nbsp;&nbsp;&nbsp;&nbsp;- lab check-off (4 per lab)<br />&nbsp;&nbsp;&nbsp;&nbsp;- lab quiz (4 questions per lab)<br />- project<br />&nbsp;&nbsp;&nbsp;- Matlab code <br />&nbsp;&nbsp;&nbsp;- report(max 1000 words)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mwTgQbo32AK9w9J61SeczQSRbx1y5kju",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Zhijie",
            "date": "Apr 11, 2023",
            "title": "A System View of Communications: from Signals to Packets",
            "comment_content": "Examine a voice communication system to identify the practical context of key theoretical concepts in ECE.<br />Identify typical problems and tradeoffs encountered in electronic and computer engineering systems.<br />Analyze simple approaches to address a range of problems and tradeoffs.<br />Use software tools, such as MATLAB, to investigate potential solutions to problems and tradeoffs in order to validate an analysis, and to handle cases not amenable to simple analysis.<br />Work in a cooperative setting on real hardware or by simulations where the simplifying assumptions used in theoretical analysis may be violated, and assess the benefits and limitations of such analysis.",
            "comment_teaching": "Professor Ross speaks English very clearly, like the voice actor of some documentary films. And he is very patient, always willing to answer any question. The content is useful too.",
            "comment_grading": "Lab Check-off Points(15%)<br />Post-lab quiz<br />Five minutes quiz. No lab report is required.<br />(15%)<br /><br />Homework<br />Submit online <br />10%<br /><br />Midterm Exam<br />Time: 20:00 - 20:50<br />30%<br /><br />Final Project<br />30%",
            "comment_workload": "not very much compared to other 4 credits courses. The project doesn't involve any Fourier transform so it's relatively easy. each homework can be done within an hour if you are familiar with the content. The lab quiz can be a little annoying but still acceptable, and the lab check is given to you if you finish the Matlab code. A lot of people just preview the material and leave the lab within 15 minutes.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vGeQiFCf02itcgekJayxRFDLmI4DwlcD",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 206,
                    "name": "ZHANG, Jun",
                    "rating": 0
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "FrostyP4nc4kes",
            "date": "Jun 10, 2022",
            "title": "If online, avoid at all costs.",
            "comment_content": "we spend 11/24 lectures on the basics of sending bits through a channel, looking at a received output, doing some equalising, and dealing with noise, which is very annoying. You have to draw two triangles, trapezoids, and rectangles, find where they intersect, and then find the area of the shared region. It's easy, but my goodness, it takes a long time, and it is very easy for you to choke under pressure. <br /><br />the rest of the lectures were <br />- error correcting codes,<br />- frequency domain (fourier transform and series) &lt;- i really enjoyed this because we used eulers identity to make life easier<br />- Last part of the course was networks, and all the layers in a communication network. <br /><br />The last part is very interesting but very very fact-heavy, and memorisation heavy. Also my prof kinda just didn't really explain everything that well so I had to google a lot.",
            "comment_teaching": "Prof Zhang was a decent enough teacher for the most part. But i wouldn't count on being able to ask him to explain things. It was so frustrating trying to understand hamming distance. which was actually so very easy, but he just couldn't explain it in a way that would make sense.<br /><br />The good news is you have Cupid. She is life saver. She will explain hard concepts for you :) also she will give you hw help :)",
            "comment_grading": "Trash. I hate the way that the exams were done, and how things were graded. <br /><br />The HW is graded, so do your best: 10%<br /><br />Midterm 25%: <br />online format ruined the exam. YOU COULDNT GO BACK AND FORTH ON MCQ. so yeah either you get yourself together and do the question immediately, or you die. <br />ALSO for the FRQ, it was so frustrating not being able to go back and forth, because i made a few mistakes and realised too late and couldn't go back. On the next question i spent 5 minutes doing the question and 10 minutes being salty that i couldn't fix the previous question: <br /><br />MEAN: 25.78/36 idk sd<br />Me: 26.5<br /><br />Final: same as midterm basically... not fun at all. 30%<br />Mean: 31.3 SD:9.4<br />Me: 39.5<br /><br />Project: They basically compare the results of your code to the results of a code that the teachers do.... but like the teachers are literal pros at this so it's quite unfair. 20%<br /><br />Mean: 10.6/20 SD: 4.5<br />Me: 13<br /><br />Labs: so so so so so annoying. You have to do a post lab quiz: 5 minutes, 5 questions(they like trick questions, and they like algebraically annoying questions &gt;:( )<br />i got above mean for 4 of them, and below mean for 2 of them. 15%, (5% completion, 10% annoying post lab quiz)<br /><br />In the end, got a B+ <br /><br /><br />TLDR: better grade if in person :)",
            "comment_workload": "I think I'll count labs in this part because well... 4 hours a week on labs that require you to use a degenerate software known as matlab. don't get me wrong, matlab is useful and very cool... when it works. But my goodness me it is so frustrating to code in matlab. <br /><br />The HW is doable, i usually can do it all in the last day. But NOT the last minute. <br /><br />for some reason, we were also forced to do both a final project AND a final exam. So yeah that was a lot of work. &gt;:(",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XyyKcBY6i2iuI9AFeR5YCGBpogXquNT6",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ricecrackie",
            "date": "Mar 15, 2022",
            "title": "so far so bad",
            "comment_content": "Refer to others' reviews for the syllabus.<br />So far, I found various things in this course fucked up. I hope it's not only me facing these problems.<br />First of all, the inconsistency of lab quizzes site on canvas. They separated lecture and lab as two courses on canvas. The post-lab quiz for lab1 is posted on lecture course while the subsequent labs quizzes are posted on lab course. I lost about 3 minutes for my lab2 post-lab quiz to look for the quiz.<br />Secondly, the post-lab quiz has very little correlation with the lab. Finishing the lab is not enough for you to get full marks in the quiz. You need to be really familiar with matlab and course content to get a good score.<br />Now HW1 is asking us to draw graphs of step responses without any hints on how to implement them in matlab. The lab is just&nbsp;&nbsp;a joke. It provides very little help on training matlab skills.",
            "comment_teaching": "The teaching is not bad.<br />Prof Shi and Cupid tried their best to explain the materials. Both of them speak very clearly and are very helpful.",
            "comment_grading": "Lab 15% (checkpoints 5% + 5 minutes post-lab quiz 10%)<br />Homework 10%<br />midterm 25%<br />project 20%<br />final exam 30%",
            "comment_workload": "If you are only aiming a passing grade, it's low. All you have to do is remember to finish the post-lab quiz for attendance and submit something for assignments and project.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JMc5vxNgpMiiWD98RvaMdfE2WJfCGwiV",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Spade",
            "date": "Feb 17, 2022",
            "title": "",
            "comment_content": "Have you ever wondered what technologies go into your 5G mobile phone. an Internet of Things (IoT) network or a WiFi hotspot? Through hands on work with a simple but fully functional wireless communication system, you will understand the basic engineering tools used and tradeoffs encountered in the design of these systems.&nbsp;&nbsp;This course is centered on weekly laboratories, each designed to introduce an important concept in the design of these systems. The lab sessions are supported by two one hour lectures and a tutorial that introduces the concepts for the next laboratory, as well as reviewing and expanding the concepts learned in the previous laboratory.<br /><br />Co-requisite(s): (COMP 1021 OR COMP 1022P) AND (MATH 1003 OR MATH 1014 OR MATH 1020 OR MATH 1024)",
            "comment_teaching": "Professor Letaief is very kind, wiling to listen students'questions and&nbsp;&nbsp;help students. His course won't make you feel hard to follow, and it's not boring.",
            "comment_grading": "Lab 30%<br />&nbsp;&nbsp;&nbsp;Lab Check-off Points (15%)<br />&nbsp;&nbsp;&nbsp;Post-lab quiz(Five minutes quiz. No lab report is required.)(15%)<br />Homework(Submit online) 10%<br />Midterm Exam (It covers the course material (L01 - L13)) 30%<br />Final Project 30%<br /><br />My example grading:<br />Although I'm bad at project, with good performance in homework and Midterm, I still get A in this course.<br /><br />Lab <br />&nbsp;&nbsp;&nbsp;Lab Check-off Points : 28/28<br />&nbsp;&nbsp;&nbsp;Post-lab quiz(Five minutes quiz. No lab report is required.):<br />&nbsp;&nbsp;&nbsp;29.33/35<br />Homework(Submit online) 10%:&nbsp;&nbsp;Can't find my grade on canvas, but remember it's higher than average about 10-20 scorses.<br />Midterm Exam (It covers the course material (L01 - L13)):<br /> 34/40 (Ave:26.64, High:35)<br />Final Project: 22/30(Ave:21.75)",
            "comment_workload": "The workload is very low, only 3 homework and one project to finish. And have 7 labs.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1mfW8We0iNAQco9CxATVNsCLnyJ4tH2E",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 166,
                    "name": "WONG, Kai Sun Albert",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sirius981",
            "date": "May 04, 2021",
            "title": "",
            "comment_content": "You need to watch the lecture video before attending the class, which you need to put a lot of time into this subject.<br /><br />Suggest finish the lab before the lab session since the lab is quite challenging and the lab session time only has one hour, so you don't have enough time to finish if you start doing the lab in the lab session.",
            "comment_teaching": "The TA is good and very helpful. The lecture is just doing an in-class quiz and explain the question.",
            "comment_grading": "Grade: B-",
            "comment_workload": "Very heavy workload. You have to watch the lecture video before class and do the in-class quiz. 4 assignments in total. In-class quiz every lecture. This subject needs a mid-term exam and final exam.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "twciBSdkubhLMETc8xH5jFz1B3mOu5sZ",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Alex Du",
            "date": "Dec 23, 2020",
            "title": "A good course",
            "comment_content": "Content is stated in many of the former reviews. If you would like to see a full list, please go and find them in 2019 reviews, since they are mostly the same.<br />The course introduces basic concepts of electronics and signal processing. It is very well designed. If you take a look at MIT 6.002, you will find that they are delivered with similar content &amp; material, while ELEC 1200 is less complicated.",
            "comment_teaching": "Prof Murch is himself an expert in the field. In 2018, his paper were the global top 10 cited in the field of communication. But for the questions which bothered me a lot but definitely seems very obvious to him, he would do quite a lot to help me understand. In addition to question answering, his lectures are also good and steady, with every content well explained and well demonstrated.<br /><br />Cupid CHOW is the very best IA. She responses to emails very quickly and she is a very nice person. She does not get mad or irrigated even though one may ask the same question again and again. She even answers to my asking things like &quot;I got bad in post lab quizzes, could you give me some advice?&quot; Also, a cute thing is she apologizes when marks are deducted from my homework hahaha...",
            "comment_grading": "Grading is good. I can give you the following statistics.<br /><br />10% homework. I got 9.5/10. Mean approximately 7.8/10.<br />30% lab, I got 26.5/30, while he mean is approximately 22/30.<br />30% midterm, I got 27/30, while the mean is 21/30. High 1.2 sd.<br />30% final project, I got 29/30, while the mean is 20/30. High 2 sd.<br /><br />Total 92%, and finally got an A+. The A range is really wide for this course. In fact I never expected an A+, as I thought an A is already fair. But, well, things are beyond my expectation.",
            "comment_workload": "I would say workload is appropriate for a 4 credit course. <br />The homework have traps inside, so if you do not work with an equally hardworking friend, it is hard to get full marks. You have to study and review every week in order to deal with the post lab quizzes.&nbsp;&nbsp;The labs are not hard, but if you do not treat them seriously, your final project would be doomed.<br />Please be very aware of the post lab quizzes. They are EXTREMELY hard to handle. 5 questions in 5 minutes, and no previewing before submission of one question and no reviewing after submission of one question, so basically you must work out the math very quickly and memorize the concepts very well. I got many 3/5 in post lab quizzes.<br />Final project is individual work, and answers are different so you cannot help each other. Half of it is not challenging, while the other half is quite difficult. You must start early and work hard to attain a high mark in final project.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4ZM0E5xJ6ZIUgpROj6ydmXIUJLGJu3XE",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                },
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "BrownBoi17",
            "date": "Nov 09, 2020",
            "title": "Amazing Course for those interested in Communications",
            "comment_content": "L01: Course Introduction<br />Metrics for communication systems, the digital abstraction, basic recipes for transmitting information<br /><br />L02: Signals<br />Point-to-Point Digital Links, discrete time waveform<br /><br />L03: Real World Channels<br />Representing discrete time bit waveforms, effects of the channel<br /><br />L04: Linear Time Invariant Systems<br />Exponential Step Response<br /><br />L05: Transmitting Data<br />Communication protocols, decoding bits, asynchronous serial communication<br /><br />L06: Inter-symbol Interference and Eye Diagram<br /><br />L07: Feedback Model of the Channel<br /><br />L08: Channel Equalization<br /><br />L09: Noise<br />Noise, power, binary channel model, BER of the binary channel<br /><br />L10: Noise<br />Modeling noise, Gaussian PDF, BER of AWGN channel<br /><br />L11: Error Correcting Codes<br />Hamming distance, (n,k) block codes, error detection vs. correction, repetition codes, (8,4) codes<br /><br />L12:&nbsp;&nbsp;Error Correcting Codes<br />(n,k,d) Block codes, (9,4,4) block codes.<br /><br />L13: The Frequency Domain<br />Representing signals as sums of sinusoids, Euler’s identity<br /><br />L14: Discrete Fourier Transform/Frequency Response<br /><br />L15: Lossless &amp; Lossy Source Coding<br /><br />L16: Signal Transmission – Modulation<br /><br />L17: Signal Transmission – Demodulation<br /><br />L18: I-Q Modulation<br /><br />L19: Introduction to Networks<br /><br />L20: Link Layer<br /><br />L21: Network and Transport Layers<br /><br />L22: Transport and Application Layers<br /><br />L23: Course Review",
            "comment_teaching": "Prof. Letaief was my lecturer for the first few weeks but unfortunately due to some illness was unable to teach the remaining lectures. He is enthusiastic about the content and always entertains doubts during lectures to clear concepts. There is no way you can walk away from his lectures without grasping the basic concepts.<br />Prof. Murch taught the remaining lectures and also made the lectures very interesting - by relating the course content to real life situations. This also reinforced the concepts.<br />Cupid Chow was the TA for the entire course and handled all the lab assignments. She also cleared all doubts during the lectures. She is very responsive and takes the time to help you out.",
            "comment_grading": "Grading weightage:<br />Homework - 10%<br />Lab - 30%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Checkpoints - 15%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Post-lab quiz - 15%<br />Midterm - 30%<br />Final Project - 30%",
            "comment_workload": "The workload is not too much for a 4 point course but still includes includes Weekly Labs, Homework Assignments and a Final Project.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hlYboSjgArUEypP76qxc8cdzAD6cU0bo",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Birth moon",
            "date": "Jun 22, 2020",
            "title": "Good grade and nice TA",
            "comment_content": "This cource introduce basically how the wireless communication system works.<br />Outcomes:<br />·Examine a voice communication system to identify the practical context of key theoretical concepts in ECE.<br />·Identify typical problems and tradeoffs encountered in electronic and computer engineering systems.<br />·Analyze simple approaches to address a range of problems and tradeoffs.<br />·Use software tools, such as MATLAB, to investigate potential solutions to problems and tradeoffs in order to validate an analysis, and to handle cases not amenable to simple analysis.<br />·Work in a cooperative setting via simulations where the simplifying assumptions used in theoretical analysis may be violated, and assess the benefits and limitations of such analysis.",
            "comment_teaching": "Pro. Khaled explained every content clearly and answered every questions that were asked. Cupid is friendly and helpful, even I miss the post lab quiz because of having a nap she still allowed me to take&nbsp;&nbsp;a make up one.",
            "comment_grading": "Lab check points 10%<br />Post lab quiz 15%<br />Homework(Submit online in one PDF file) 10%<br />Midterm 25%<br />Final 40%<br />Got 9/10 in lab check point <br />12/15 in post lab quiz<br />10/10 in homework<br />20/25 in midterm <br />30/40 in final <br />Open book exam. The exam problems were not that difficult, but time is quiet limited. <br />A-",
            "comment_workload": "workload is not heavy<br />8 labs (Need to do pre-lab) each with a 5 minutes postlab quiz in the last 10 minutes (time limited) If your internet is lag then you are game over <br />3 homework each with 4 easy questions (about 3-4 pages)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jy8Lwm2WALrU40MOWVrqZ2T9o9udZZGP",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chanmark",
            "date": "Jan 17, 2020",
            "title": "",
            "comment_content": "1. Examine a voice communication system to identify the practical context of key theoretical concepts in ECE.<br />2. Identify typical problems and tradeoffs encountered in electronic and computer engineering systems.<br />3. Analyze simple approaches to address a range of problems and tradeoffs.<br />4. Use software tools, such as MATLAB, to investigate potential solutions to problems and tradeoffs in order to validate an analysis, and to handle cases not amenable to simple analysis.<br />5. Work in a cooperative setting on real hardware where the simplifying assumptions used in theoretical analysis may be violated, and assess the benefits and limitations of such analysis.",
            "comment_teaching": "Prof. Ross is very nice, whenever he went through a difficult topic/concept, he would try his best to make sure we understand the content.<br /><br />When someone raised a question, Cupid explained in a very detail way.",
            "comment_grading": "Homework (10%)<br />Lab(10% lab task + 15% post-lab quiz = 25%)<br />Midterm (25%)<br />Fianl(40%)<br /><br />Homework 271/300<br />Lab: 22.54/25 mean: 20.6<br />Midterm: 46/50 mean: 35.1 sd: 9.6<br />Final: 86/100 mean: 69/100&nbsp;&nbsp;sd: 18.8<br />Grade: A",
            "comment_workload": "Not too many workloads. Only homework2 (talking about IQ-modulation) is quite difficult to finish. The post-lab quiz usually contains one to two questions about the lab content, the remaining was the topics you learned in that week.<br /><br />Midterm and final are quite easy if you are fully understanding the material.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BOBv2lwK8oyRBc1zsLGjUS6uudSWvs5o",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kikikiki",
            "date": "Nov 21, 2019",
            "title": "",
            "comment_content": "Course arranges to discuss how to transmit information wirelessly in three parts: point-to-point, sharing a channel and network.<br /><br />The course content quit interesting.<br /><br />Pay more attention on post-lab quiz and homework, it’s good for understanding knowledge and set for the exam.",
            "comment_teaching": "Prof. Ross MURCH has good teaching with clear and understandable English. He always encourages us to ask more questions and he will explain to us patiently.",
            "comment_grading": "1. Lab(25%)<br />&nbsp;&nbsp;&nbsp;&nbsp;- Check-off Points(10%)<br />&nbsp;&nbsp;&nbsp;&nbsp;- Post-lab quiz(15%)<br />2. Homework(10%)<br />3. Midterm exam(25%)<br />4. Final exam(40%)",
            "comment_workload": "I always completed the weekly lab tasks and quiz within 1 hour.<br /><br />And the homework is quiet easy if you have thorough understanding of it.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZXibauAFUCiBR5KQdJyd1SOV7FumcNEJ",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ho Ka Ying",
            "date": "Aug 19, 2019",
            "title": "Very informative, Great Course!",
            "comment_content": "About communication system. It answers almost all questions about communication system, explains it from scratch. Really recommend it if you are curious of how internet or telephone works, even if you are not an ELEC student.&nbsp;&nbsp;<br /><br />The design of course and lab are great. You will end up learning a lot!<br /><br />Useful and informative.",
            "comment_teaching": "Prof. Murch is a great professor. He can explain things well, and interact with us. It is comfortable to ask questions even in the midst of his lecture (no one feels strange about that), and ask thousands of questions after lecture. He is very friendly and experienced, and seems like understanding what we do not understand. That's why we like asking him as he really can answer. And he always smiles.<br /><br />Our TA Cupid is great as well! Very cheerful and helpful! She has office hour especially before exam.",
            "comment_grading": "Good grade as long as you understand the concepts.",
            "comment_workload": "OK workload. As long as you follow the lecture and lab well, and understand the stuff, with some practice (review of past paper), you will be prepared for the exams.<br /><br />There are 3-4 assignments, mid term and final.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RzGdATAqfrSn0yb1v3ChefhCj5ZrlJIp",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Riceky",
            "date": "Jan 31, 2019",
            "title": "好grade科",
            "comment_content": "講下signal點樣應用係我地生活<br />點樣計/畫圖",
            "comment_teaching": "Lecturer講得好快 可能以為我地有備課先上堂<br />所以有時間可以備下課<br /><br />Tutor一定要上 好重要 講既野係關lab同功課事 會同你review下D題目<br /><br />Cupid教得幾好",
            "comment_grading": "Lab 15%<br />功課 10%<br />Final 40%<br />Mid term 35%",
            "comment_workload": "冇咩做<br />一個mid term 一個final 3份功課<br />Lab一定要去 post lab quiz通常同你個lab既content有關 lab既內容同做法上tutor會講",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5ZjftHSNlJXGBt79NgIDu1YavDOx3a1L",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Umanilliti",
            "date": "Jan 25, 2019",
            "title": "",
            "comment_content": "It's just an intro-course. There wouldn't be anything quite useful, to be honest. But it would be quite useful to understand what you are going to learn in the next few years if you want to take signaling stream in ELEC courses.",
            "comment_teaching": "I didn't listen at all since the content is very easy. But I would say the accent of Prof. BEN LETAIEF is sometimes quite hard to understand. But if you have any doubt, you could ask him or Cupid. Both of them would explain the things you don't understand in detailed.",
            "comment_grading": "Midterm: 88%<br />Final: 90%+(?<br />Final Grade: A+<br />Didn't do that well in Midterm.",
            "comment_workload": "Lab every week, two~three assignment, one MT and FE. The lab will take attendance. Just attend all of them since there will be a quiz at the end of the lab in which will count towards your final grade. Just take all of them. The quizzes are open book, so just bring all the tutorial and notes. (They will quiz if you have listened to the tutorial, and whether you had read the lab manual carefully. Since all of those will be on the quiz.)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lwK43xMrc4JLwSWf2KlGj2QheVzy2YzC",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Yoonseo Han",
            "date": "Dec 22, 2018",
            "title": "",
            "comment_content": "- Basic bits and communication<br />- Noise<br />- Modulation and demodulation<br />- I/Q modulation<br />- Networking<br />- Layering",
            "comment_teaching": "Professor was good as he tried to allow as many questions to be asked as possible. his languages were generally all clear and his ppt slides were clear. Various calculation methods were instructed step b step and therefore I was able to follow the step and build my understanding",
            "comment_grading": "Grading is quite ok<br />There are mainly 4 sections that are graded : <br />1st : Lab -&nbsp;&nbsp;Mainly determined on whether you were able to complete the 5 tasks that are given and also the post-lab quiz at the end of the session. The post-lab quiz is not that hard but needs some amount of concentration in able to score over 4<br />2nd : Homework -&nbsp;&nbsp;3 homework are given and it is not hard to score high scores. It is basically a general review of over the 8~9 lectures that was taught<br />3rd : Midterm - Is about the first 8~9lectures taught and is not hard to get over mean however it is essential to have deep understanding of the calculation concepts<br />4th : Final - Is about the whole course and is quite hard. It deals with various topics and it is essential for students to remember some important facts. Calculation part is quite decent.",
            "comment_workload": "The workload is reasonable. Every week you have to go to a lab and complete approximately 4~5 tasks based on the things we have learnt last week. It is basically just MATLAB coding which is generally explained during your tutorials, therefore, it is important to attend tutorials and understand the concept. <br /><br />There are mainly 3 homework to do every 8~9 lectures which is basically a summary of all the concepts. It is not that hard and therefore students would be able to finish the homework with not much dificulty and not spending much time on it.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fkHKdtBTvt8xas2WRXxbvfSIjVz2RMqp",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Dog23",
            "date": "Aug 18, 2018",
            "title": "",
            "comment_content": "Elec 1200 consists of three main parts.<br />Signal errors, how a signal or a message is transmitted, and layers in networking.<br />Most of the content is easy to follow and can be understood without any knowledge related.",
            "comment_teaching": "It's quite good. Involved examples using MATLAB to demonstrate the topics during lectures, making it easier to follow. The lecturer tried various methods other than just reading the lecture pages for easier understanding. And there are video lectures.",
            "comment_grading": "quite reasonable. Revision pays off.",
            "comment_workload": "There's a lab every week but the tutorial usually covers a lot of information about the labs, making it easy to handle. But there's a short quiz after each lab, but it's easy as it is open book. It'll be better if you're familiar with the topic.<br />For homework, there's 3 in total, one for each section.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tsrOA4xpM2xrRzuTLoIj3Npqp0vumKgL",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                },
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ptrknow",
            "date": "Jun 04, 2018",
            "title": "An Okay Course",
            "comment_content": "Refer to other comments for details of course contents.<br />Whether or not the contents are interesting mainly depends on yourself.<br />I would say the contents fit me well. Some parts of the contents (like IQ modulation, coding) are really intriguing.<br />Basically, this course covers a lot of ground of many engineering principles, introducing their conceptual intuition, application of maths, and handling of tradeoffs.",
            "comment_teaching": "MURCH, Ross:<br />+ intuitive explanation on many concepts<br />+ providing other subtle details related to the concepts (not written in notes, nor tested in the exam), which are fun to hear<br />+ standard English, easy to hear and understand<br />+ passionate, always encouraging us to raise questions (and able to answer questions clearly and with details)<br /><br />- His explanation on mathematics is not detailed enough. This isn't a big problem. In case you really don't understand, just ask him for more details.<br /><br />SHI, Bertram Emil (edX video):<br />+ Very detailed and &quot;vivid&quot; explanations<br />+ Because you are watching video, you can control the pace on your own<br />+ understandable English<br /><br />+/- Talking quite speedily. For me, I really need the subtitle when watching his video.",
            "comment_grading": "Should be okay. Here's the reference:<br /><br />Lab (25%): Mean 19.9 / 25 (High:23 Low: 12.8)<br />Homework (10%): Mean ~7.56 / 10<br />Midterm (25%): Mean 79.6/100 SD 16.9<br />Final (40%): Mean 84.2/120 SD 23.52<br /><br />My data<br />Lab: 22.67/25<br />Homework: 9/10<br />Midterm: 91/100<br />Final: 105/120<br />Overall: ~89%<br />Grade: A<br /><br />Labs:<br />There is a post-lab quiz every week, constituting 15% of the overall grade (another 10% is basically your completion of the lab).<br />Some (small parts) of the quizzes are tricky and difficult, really requiring you to have a full understanding of what you are doing in the lab (and what the lecture is talking about).<br />Out of 45 question in total (each quiz has 5 questions), I get 38 right.<br /><br />Homeworks:<br />Most questions are new. Don't expect the source can help you much (do help a little bit though).<br />Questions can be tricky (one or two of them may be difficult).<br />Think twice about each question!<br /><br />Exams:<br />Basically easier than homework and review questions.<br />Make sure you are familiar with and understand the homework and the review questions. Doing this, you should have no big problem in the exam. (Also be careful !)<br />For the final exam, you need to memorize key points from the notes as well (mostly for the network part). The final exam is just a memory contest, with guidings to help you recall.",
            "comment_workload": "Weekly labs (10 in total, the first one can be skipped)<br />3 Homeworks<br />Midterm and Final<br /><br />Workload should be moderate (because labs are greatly simplified! Unlike before, there are no prelab questions and postlab interviews. Lab tasks are also not tedious, although requiring you to think a lot.)<br />A hint for you: try to prepare every lab beforehand. You can then probably leave the lab very early. Attending tutorials is not really necessary (I skip all of them lol).<br /><br />As for the exams - <br />There is quite much stuff to remember: formulas (first two parts of the course) and points (third part of the course, many advantages, disadvantages, why doing this, why doing that, why not brabrabra). Note that the third part also has formulas (we need to derive those formulas again in the final exam, which is already done in the lecture notes!).<br />But memorizing is not really difficult, as long as you pay attention to the lectures beforehand.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "V9RB1Uu6HKhWv4cckD9CNPjnomhGvWnD",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 187,
                    "name": "TSANG, Danny Hin Kwok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Waikei",
            "date": "Jan 24, 2018",
            "title": "elec1200",
            "comment_content": "signal transfer",
            "comment_teaching": "quite good , the professor teach clearly and not boring",
            "comment_grading": "fair, do all the homework , midterm and final below mean a little bit got a C",
            "comment_workload": "4 homeworks ,one midterm and one final and need to attend about 10 labs but all the labs have source to follow so it is not very difficult, but every labs have after lab online quiz and its about 5 mc questions . You need to understand the lab content clearly so you can ans them correctly and the mean of the quiz is quite high.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aN5eEST58gDImuMPqkGTqppiFzanfE6X",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 187,
                    "name": "TSANG, Danny Hin Kwok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "abcab_123",
            "date": "Jan 04, 2018",
            "title": "",
            "comment_content": "Representing Bit Sequences<br />Discrete Time Channel<br />Data Communication Protocols<br />Intersymbol Interference<br />Recursive Channel Model<br />Equalization<br />Noise<br />Bit Errors<br />Channel Coding<br />Parity Bit Codes<br />Lossless Source Coding: Huffman Codes<br />The Frequency Domain<br />Lossy Source Coding<br />Filters and the Frequency Reponse<br />The Discrete Fourier Transform<br />Signal Transmission - Modulation<br />Signal Transmission - Demodulation<br />IQ Modulation<br />The Link Layer<br />The Network Layer<br />The Transport Layer<br />The Application Layer<br />內容同edx elec1200一模一樣<br /><br />今年post lab interview改左做online quiz大部份MC少量填充<br />有prelab但唔會計分",
            "comment_teaching": "走晒堂唔知",
            "comment_grading": "Lab Check-off Points (10%)<br />Post-lab interviews (15%)<br />Homework (10%)<br />Midterm Exam (25%)<br />Final Exam (40%)<br /><br />midterm 77/82 mean 61.37<br />final 73.5/100 mean 57.4<br />兩個都~1SD above<br />overall 81%<br />最後A-",
            "comment_workload": "每星期都有lab大部份用matlab 2個人做<br />lab partner剩係上左2次lab就唔知去左邊所以次次都單機做<br />lab之後有online quiz 5題<br />prelab唔洗晒時間做唔識到時問TA就得",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uJDBZJz9LQOWNuRxIsjlWNAwtR01MXrw",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "柱",
            "date": "Aug 25, 2017",
            "title": "need to hard work",
            "comment_content": "The amount of content is not that big. There are a lot of chapters this course is covering, however as this is 1000 level course, they do not go into deep levels. You can basically learn a lot of creative things. Once more, the concept is not hard but a lot.",
            "comment_teaching": "TEACHING<br />The way professor tries to teach is pretty good. He tries to relate all the concepts to real life problems so that students could easily understand. However, after the mid-term as content got little bit difficult, I had tough time understanding the concept. I had to watch youtube videos to understand clearly.",
            "comment_grading": "GRADING<br />I think grading is really good comparing to other courses in UST. I got 98/100 in mid term( 98.5 was max). For final, I got low 80s (I cannot remember this clearly) - I think it was somewhere 1.5 sd above. I got nearly full marks in homeworks(10% in total), average 9 in pre-lab(10%) and okok in post lab interviews (which accounts for 10%). I luckily got an A+ and do not know how :D",
            "comment_workload": "WORKLOAD<br />I think workload for this course is too much. There are labs every week and you need to prepare post-lab interviews while finishing and submitting pre-labs every week. I took 1~1.5 hour finishing pre-lab (sometimes 30 minutes). For 4 credit course and comparing other 4 credit elec courses, I think workload is too heavy.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SHACjU1ul8RBnnV2xD3hJN25CxRQKZRq",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Froggy&Cat",
            "date": "Aug 09, 2016",
            "title": "有趣的好課",
            "comment_content": "主要在講通訊方面，幾乎每周都要去lab 把課堂上學到的操作一遍，對於了解課程內容很有幫助，尤其lab不計bonus所以不需要趕時間急著完成lab。(只要完成分都是一樣的)lab做完後會有interview, ta此時問的問題也對於了解課程內容滿有幫助的，所以建議大家即便當下答不出來還是要事後問清楚。課程最後一個部分再講各層的通訊，內容比較雜，推薦大家上edx看bert拍的影片，其中有一些動畫能幫助理解。總而言之是一門好課，推薦大家上!",
            "comment_teaching": "教授的英文很好，上起課來很舒服。每次都會留一點時間給大家問問題，有不懂的這個時候提出來教授都會很好的跟你講解。還有因為通訊有些時候比較抽象，教授會舉一些生活中的例子幫助大家了解。是位很用心的教授!",
            "comment_grading": "ece的課似乎給分都滿好的，這門課是完全出乎我意料之外。<br />midterm 只高了mean0.5分好像<br />final 高一個sd 100/110 (sd 20 mean 80 ....)<br />homework 10/10 10/10 9.2/10<br />prelab,lab,interview 都是滿分<br /><br />最後拿了A",
            "comment_workload": "因為每週都有lab (不能翹課)跟pre-lab 所以比起一般工院的課會比較累，但總體上還可以接受，作業也是滿簡單的",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "htOEs1opjksqmzPvZWNXpVsRJFv4G4Gx",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Abby",
            "date": "Jul 31, 2016",
            "title": "Give you a view of communication and signal",
            "comment_content": "If you have no previous knowledge about network or signals, it will be an ideal course to have an overview for them. The course content compared to 1100 is kind of boring as there is not enough practical experience. The lab is useful and even if you miss the lecture, the video clips are pellucid.",
            "comment_teaching": "The professor basically follows the notes slide by slide and I recommend watching the video clips to study the content. Feel free to ask any questions in the class.",
            "comment_grading": "Do not take the course in spring. My midterm is above mean, and final is mean+sd. Unlike other elec courses, I got A instead of A+.",
            "comment_workload": "The lab manuals take a lot of time to understand but the workload is not heavy. The final has a lot of content to memorize.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oO5mFj3AO8gsrIdhyw2TgiIpF3Gf54Go",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 187,
                    "name": "TSANG, Danny Hin Kwok",
                    "rating": 1
                },
                {
                    "id": 164,
                    "name": "MOW, Wai Ho",
                    "rating": 1
                },
                {
                    "id": 178,
                    "name": "SHI, Bertram Emil",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jonas",
            "date": "Jun 03, 2016",
            "title": "Attention: Don't take this course in Spring",
            "comment_content": "All of the stuffs are boring.<br />If you do not require to take this course, don't take it.<br />If you study this course in fall semester, even you got below mean in both mid term and final exam, you can still get a B+",
            "comment_teaching": "Normal",
            "comment_grading": "Pre-lab exercises 10%<br />Lab Check-off Points 5%<br />Post-lab interview 10%<br />Homework 10% <br />Midterm Exam 25%<br />Final Exam 40%<br /><br />overall marks:8x% ---&gt;B",
            "comment_workload": "Highest workload course I have ever seen in HKUST. You need to do prelab ex. and lab every single week. And homeworks every 2 weeks.",
            "rating_content": 1,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kBDCzdT5vzcHAyl5G5zA3nBiEbsTN3TJ",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chanz",
            "date": "Jan 27, 2022",
            "title": "",
            "comment_content": "Course introduce fundamental concepts of communication system<br />L01: Course Introduction<br />L02: Signals<br />L03: Real World Channels<br />L04: Linear Time Invariant Systems<br />L05: Transmitting Data<br />L06: Inter-symbol Interference and Eye Diagram<br />L07: Feedback Model of the Channel<br />L08: Channel Equalization<br />L09: Noise, noise PDF, additive noise, BER of the binary channel<br />L10: Noise BER examples, Gaussian PDF<br />L11: Noise Q-function, BER and SNR<br />L12, L13:&nbsp;&nbsp;Error Correcting Codes<br />L14: The Frequency Domain<br />L15: Filters and Frequency Response<br />L16: Time-Frequency Analysis / Source Coding<br />L17: Signal Transmission – Modulation<br />L18: Signal Transmission – Demodulation<br />L19: I-Q Transmission<br />L20: Introduction to Networks<br />L21: Link Layer<br />L22: Network &amp; Transport Layers<br />L23:&nbsp;&nbsp;Transport &amp; Application Layers",
            "comment_teaching": "The professor is friendly.",
            "comment_grading": "Lab<br />30%<br />Lab Check-off Points<br />(15%)<br />Post-lab quiz<br />Five minutes quiz. No lab report is required.<br />(15%)<br /><br />Homework<br />Submit online <br />10%<br /><br />Midterm Exam<br />30%<br /><br />Final Project<br />30%",
            "comment_workload": "workload is ok, 3 homework, each were given about two weeks to work on.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "F7J3Dc1w3MZhj2z4tvO3izY8M56VW5TV",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 0
                },
                {
                    "id": 200,
                    "name": "MURCH, Ross",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "BenJohn",
            "date": "Dec 29, 2021",
            "title": "learn Matlab in 3 hours",
            "comment_content": "Teach how to translate signal, basic calculation of the probability of noise, and some basic knowledge on network layer. <br /><br />There are lecture, tutorial, and laboratory. The laboratory must be attended. And there are lab quizzes in each laboratory.<br /><br />In laboratory, you will learn the Matlab in first lab. Then you need to use Matlab to solve the question in following laboratory. The final project is difficult, and it is Matlab programme. The project has two parts, the first part is making a simple speech recognition programme; the second prat is making a transmitter and receiver. You need to prepare a lot of time on this programme.",
            "comment_teaching": "They will not give you the Matlab answer. So please remember to take a photo when you finish your Lab.",
            "comment_grading": "15% of Lab quiz<br />15% of Lab attendance<br />10% of Assignment<br />30% of Mid-term<br />30% of Final Project",
            "comment_workload": "You need to prepare the lab quiz every week. The final project is quite difficult. There are three assignments only.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zLg19njDk41ljNeMJobIVK0zexCIQ1gD",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1495,
                    "name": "LI, Xiaomeng",
                    "rating": 1
                },
                {
                    "id": 1047,
                    "name": "CHOW, Cupid",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GUO,JR",
            "date": "Sep 13, 2021",
            "title": "Good Course",
            "comment_content": "I think the content is very basic for an EE student. It is similar to a MIT course and it is very basic.",
            "comment_teaching": "Professor. Li give us very clear explanation in the lecture and she would like to answer all the question you give to her. And TA Cupid also give us very clear explanation at the tutorial.",
            "comment_grading": "nearly full point in homework.<br />+2sd at midterm.<br />+1.5sd at final<br /><br />I got an A+ at last for FOUR CREDIT.",
            "comment_workload": "workload is light. and you only need to attend the tutorial session you can get the result of quiz and lab session is useless. you can do the matlab at home or just at the virtual barn.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CWPBvghMF6pnfylSJWhXYInSKQzG7lqQ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1189,
                    "name": "BEN LETAIEF, Khaled",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "timhkust",
            "date": "Sep 19, 2018",
            "title": "",
            "comment_content": "Ben is good teaching",
            "comment_teaching": "good teaching",
            "comment_grading": "good",
            "comment_workload": "Packets<br />Have you ever wondered what technologies go into your mobile phone or a WiFi hotspot? Through hands on work with a simple but fully functional wireless communication system, you will understand the basic engineering tools used and tradeoffs encountered in the design of these systems. This course is centered on weekly laboratories, each designed to introduce an important concept in the design of these systems. The lab sessions are supported by two one-hour lectures and a tutorial that introduce the concepts for the next laboratory, as well as reviewing and expanding the concepts learned in the previous laboratory.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}