{
    "error": false,
    "course": {
        "id": 1249,
        "subject": "ENGG",
        "code": "2900B",
        "name": "Community Services Project: Innovative Trolley Design for the Elderly",
        "description": "In this course, students need to participate in teams to design and develop an innovative trolley for the elderly. This course aims to increase students' involvement in community services and provide them learning opportunities through the social services programs. Under the supervision of the School, students will gain experience from developing a plan, marketing through implementation of projects with a group of professional civil engineers. Students must obtain prior approval from course coordinator for enrolling in the course. ILOs of this course are:- 1.Introduction to Corporate Social Responsibility (CSR) and community services issues from a social point of view; 2.Introduction to mechanical, eletro-mechanical, production and costing aspects of trolley design, with the aim of helping elderly people collecting cardboard from the streets; 3.Integrate students' knowledge and technical skills into a comprehensive design project; 4.Involve students actively in the planning and design of a realistic engineering project; 5.Foster teamwork and multi-disciplinary coordination towards solving open-ended design problems; 6.Provide students with exposure to real-life engineering experiences via site visits and meetings with engineers from a prominent engineering company. Students must obtain prior approval from course coordinator for enrolling in the course. May be repeated for credits, if different topics are taken. Graded P or F. May be graded PP.",
        "categories": [],
        "website": null,
        "credits": 2,
        "semesters": [
            1510,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 0,
        "rating_teaching": 0,
        "rating_grading": 0,
        "rating_workload": 0,
        "review_count": 0,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [],
    "composer": []
}