{
    "error": false,
    "course": {
        "id": 374,
        "subject": "ENGG",
        "code": "1130",
        "name": "The Impact and Value of Technology Innovation",
        "description": "The focus is the impact of the current technological evolution on the creation of value in the global economy, society in general, and personal lives. Students will study how science and technology developments have been transformed into innovative products and services. Case studies and examples will be drawn from well-known successes and failures of technology companies in Silicon Valley and Asia. Business issues such as marketing of disruptive innovations and ethics will be explored. Special emphasis will be given to intellectual property issues. Students will do extensive research to understand future as well as existing technology innovations.\nFrom the course material, the students will find inspiration, greater clarity and personal sense of purpose. This will help them create choices for themselves and their lives in this world of accelerated technology development.",
        "categories": [
            "Common Core (SSC-S&T)",
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2030,
            1910,
            1830,
            1810,
            1730,
            1610,
            1540,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.08,
        "rating_teaching": 2.92,
        "rating_grading": 4,
        "rating_workload": 3,
        "review_count": 13,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 213,
                "name": "YUEN, Matthew Ming Fai",
                "count": 12
            },
            {
                "id": 211,
                "name": "WU, Po Chi",
                "count": 3
            },
            {
                "id": 212,
                "name": "TSUI, Chi Ying",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "R7WpddI1tXArbRy7ECErVUIrsmvvwY87",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 213,
                    "name": "YUEN, Matthew Ming Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GOD",
            "date": "Apr 21, 2021",
            "title": "Non sense course",
            "comment_content": "It is talking about 6G while people are still talking about 5G. So you got it.",
            "comment_teaching": "There is no teaching as professor just read out the notes.",
            "comment_grading": "If you want a better grading, remember to select a better topic and also define your topic. Ask the ta what they want you to present and do not think twice of dropping the course if you are not familiar with the topic introduced.",
            "comment_workload": "Two individual presentations. Two debates. One individual report less than 2000 words. <br /><br />The presentations required your &quot;own&quot; view from his &quot; broad&quot; topic. but interestingly they will comment you miss out some parts that &quot;they&quot; actually want to hear from. So the instruction is totally bullshit. everything is about good luck. <br /><br />I am pretty sure they are not listening carefully enough to know what you are saying in the presentation or in your debate. So luck is require in this course.<br /><br />In the debate, they use Oxford-style debate voting to decide the winning in a voting of&nbsp;&nbsp;32 people and you better call your friends get in a different&nbsp;&nbsp;group to help you as the winner can get a 2 point bonus. The full mark of debate is just 15.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YUwJj0JO5pzuJkW51MaPEabIBMPwrbKY",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 213,
                    "name": "YUEN, Matthew Ming Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "boc",
            "date": "Aug 18, 2021",
            "title": "",
            "comment_content": "The course is about smart cities with lots of case studies.<br />–ICT and IoT, Data Analytics &amp; Data Security<br />–Mobility and Logistics<br />–Energy, Environment and Smart Living<br />–Healthcare<br />–Education, Learning and Innovation<br />–Government &amp; People",
            "comment_teaching": "Boring lessons. Matthew would read all the words on the ppt and ask questions. He would have his own opinions but you can just refer the notes. TA would call out the student's names if no one answer the questions. <br /><br />But, Matthew is a very kind and nice professor. You can ask him any questions on your assignments with emails. If you have asked many questions on email, he would like to have the zoom meeting for having a clear explanation to you.",
            "comment_grading": "-Class attendance and participation (supported by iPRS) – 11%<br />-Presentation 1 – 7%*<br />-Presentation 2 – 7%<br />-Debate 1 – 20% (Prize for Best Debate Team)<br />-Debate 2 – 20% (Prize for Best Debate Team)<br />-Final Course Report – 35%<br /><br />*5% instructor grading, 2% classmate grading<br /><br />If you want to have the better grade, please remember to select a better topic and also define your topic. Also, ask TA or prof. for what they need on the presentation. For the debates, they expected you can have more out-class idea and knowledge for presentations.<br /><br />Final grade:B-",
            "comment_workload": "The workload is high. There are two 6-mins ppt presentations with Q&amp;A sessions and two group debates. Also, there is a final report for &gt;2000 words. <br />The debate adopts the oxford-style voting to decide the winning. But it is unfair because it just counts on the percentage changing in both sides by comparing the beginning vote and the final vote instead of which side has more votes. For example, 22 ppl voted the against motion and 10 ppl voted the for the motion at the beginning. When the final votes, there are 19 ppl voted the against motion and 13 ppl voted the for the motion. The the for the motion would win. According the result of all groups debates, usually, Against the Motion would win the debates. Thus, strong recommendation for calling more friends to join this course with you so you can have better group mates for debating and also get in a different group to help you as the winner can get a 2 point bonus.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "dsSimUUUURJTrXmWAgB4jDBiEzVCt4ED",
                    "name": "ENGG1130 Individual Final Report (1)",
                    "format": "docx"
                },
                {
                    "key": "6asBqybaIPI5d4t120eEc65eWhy3DbHY",
                    "name": "Course Overview 2020S R1",
                    "format": "pptx"
                },
                {
                    "key": "mEz5xqqkbeHEgYRcL87Ezlea8dy4J78n",
                    "name": "ENGG 1130 Debate 2020-21 Spring",
                    "format": "docx"
                }
            ]
        },
        {
            "hash": "ipM9mOKd8JYLDHIUzseUUvMJdX6DwEaa",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 213,
                    "name": "YUEN, Matthew Ming Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Orangeee",
            "date": "Jun 07, 2021",
            "title": "",
            "comment_content": "The course is about smart cities with lots of case studies.<br />–ICT and IoT, Data Analytics &amp; Data Security<br />–Mobility and Logistics<br />–Energy, Environment and Smart Living<br />–Healthcare<br />–Education, Learning and Innovation<br />–Government &amp; People",
            "comment_teaching": "Boring lessons. Matthew just reads all the words on the PowerPoint and asks questions sometimes.&nbsp;&nbsp;However, he is very nice and approachable. You can ask him any questions you have in regard to your assessments. <br /><br />You can never predict his expectation of the assessments correctly so you are recommended to consult him before any coursework.",
            "comment_grading": "The grading is good. As long as you pay effort, you will get good grades. It's a great course for non-IT students since you just need to &quot;blow water&quot; all the way.<br /><br />-Class attendance and participation (supported by iPRS) – 11%<br />-Presentation 1 – 7%*<br />-Presentation 2 – 7% <br />-Debate 1 – 20%#<br />-Debate 2 – 20% <br />-Final Course Report – 35%<br /><br />*5% instructor grading, 2% classmate grading<br />#12% debate (instructor grading), 3% debate (classmate grading), 2% winning the debate, 3% questioning (instructor grading)",
            "comment_workload": "Very high. You have presentations or debates nearly every two weeks. You can choose your own groupmates so you are suggested to study with friends.<br /><br />The debate adopts the oxford-style voting to decide the winning. Better ask your friends in other groups to help you to be the winner to get the bonus points.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RZkrv3Vn8oZSPg4FKfUVKhxVtDUyoJfA",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 213,
                    "name": "YUEN, Matthew Ming Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gd",
            "date": "Jan 03, 2019",
            "title": "Good course good lecturer good TA",
            "comment_content": "All about the smart city! Will go much deeper than just theoretical stuff like IoT, what is the technology behind than that! Quiet boring for me, and luckily there is no final exam and midterm, so you don't have to memorize and understand the content! It just giving help for your final essay and mid-term report.",
            "comment_teaching": "I can say it's super boring but Matthew is a very nice professor! The content is too technical and he basically just read through the stuff on ppt slides. Also, Matthew is encouraged the open discussion! If no one answer, he will randomly select ppl and TA can remember all the student's name! <br />They are very supportive of your assignment! A compulsory consultation is arranged for all the assignment.&nbsp;&nbsp;U can feel free to ask them all the questions.",
            "comment_grading": "I can say grading s super good! I personally got A+ even I didn't speak up many for the in-class discussion. I think Attendence is also important? coz many of them will skip lessons after they finish their presentation. But TA will count the attendance as well as doing the iPRS! I think these also contributed to the final grade?<br /><br />As long as u paid effort for the assignment and go to lessons. I am pretty sure u will have A range!!!",
            "comment_workload": "The workload is quite heavy but luckily I have met good groupmates and it's super help for the heavy workload. (Groupmate is randomly assigned and u need to work with them for all the group work)<br />1 group project with assigned topic, it's just counted 10% but still important! coz the info u searched is related to your final report and poster <br />Midterm report: quite easy to handle, as long as you paid efforts for researching, the grading will be good.( I got A- for the report)<br />Poster session: create a A0 poster with the topic u did! It helps a lot if your group members know photoshop or AI. <br />Final Essay: Partly groupwork and individual work. Refer to the poster session content! It's quite easy if you have done good research for the poster session.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2mCM7Y9GInRnVkfS8oiMPm20xxC2EThC",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 212,
                    "name": "TSUI, Chi Ying",
                    "rating": 1
                },
                {
                    "id": 213,
                    "name": "YUEN, Matthew Ming Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Miro",
            "date": "Aug 03, 2018",
            "title": "Interesting course about 'smart' city",
            "comment_content": "The course was quite innovative and interesting. We had a lot of topics around 'SMART', like smart city, smart economy, smart energy and so on. If you are a tech person, you will like this course. The content are not difficult to understand as it is just an introduction course. If you expect to learn something more deeply, this might not be the course for you.",
            "comment_teaching": "The instructors take turns to give lectures. Both of them are very knowledgeable. They encourage a lot for discussion during the class. The TAs were also very nice to us. <br /><br />Every Thursday we started the lecture with a presentation from the group on the course topic we were going to learn later. They present around 10 minutes and we discuss together for 30 minutes.",
            "comment_grading": "The grading is quite good compare to other course with such workload. As long as you word hard, you will get a good grade. It is important to present your idea and not just copy from the lecture notes. Our team got the best poster prize with $200 Starbucks coupon. I personally got A+. But do not think it is very easy. I got the highest mark in midterm report and we really put a lot of effort for the poster.<br /><br />p.s. they take attendance every class. If you skip class, the TA will send a email to everyone in the course. So DO NOT SKIP CLASS.",
            "comment_workload": "We got one presentation, one midterm report, one final report and a final project for poster design. <br /><br />For the midterm report, we can choose 2 topic to write with. It is an individual report. Originally, it was 800 words. But if you think it is too few, up to 1000 words are still acceptable. <br /><br />For final report, it is based on the final poster project. You need to write the part you did in the project in detail. Your group need to write introduction and conclusion together, but it is still mainly an individual assignment and it is individually graded base on your part.<br /><br />For the poster, you need to write and design for a specific topic in a group.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1W33agiogMhsi9BCU4bSjtryO20vBZBw",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 213,
                    "name": "YUEN, Matthew Ming Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "avo",
            "date": "Feb 16, 2017",
            "title": "",
            "comment_content": "Useful as it provides a good overview on the cutting edge technology and concerns of different areas, in different geographical regions.&nbsp;&nbsp;Content can be technical but it is not necessary to understand everything.",
            "comment_teaching": "Very knowledgeable teacher but it takes some effort to stay awake and digest everything.",
            "comment_grading": "You won't be disappointed with the grading as long as you paid effort.&nbsp;&nbsp;More than half of the class got A range.",
            "comment_workload": "Two essays (800 and 1500 words?), and one poster.&nbsp;&nbsp;No midterms or finals.&nbsp;&nbsp;Very easy to pass, not hard to get good grade.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6ANh5XaFNTp9KKI6BNL34j7VImzAOR94",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 213,
                    "name": "YUEN, Matthew Ming Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "impreza",
            "date": "Jan 26, 2017",
            "title": "",
            "comment_content": "Interesting contents. Covers latest information in Big data and Smart City developments. Easy for beginners like me.",
            "comment_teaching": "Encourages class discussion. Be ready to discuss with others. iPRS surveys every lesson, used for taking attendance.",
            "comment_grading": "Missed 2 iPRS. Handed in all assignments and the final poster. A range at last.<br />Many students got A range.",
            "comment_workload": "One ppt assignemnt per week, no need to present, contents can be found easily in google. The final poster is required to be handed in in the last lesson, generally very limited amount of workload.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "J1ttMc8uIwadoz0F7RfQj8uEZTjY5xMK",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 213,
                    "name": "YUEN, Matthew Ming Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "klchungad",
            "date": "Jan 22, 2017",
            "title": "GOOD GRADE",
            "comment_content": "So much content",
            "comment_teaching": "Boring",
            "comment_grading": "Good grade<br />Actually you just have to finish all the assessments, then you should have a good grade<br />For me, I finished all, and sometimes tried to make some effort<br />Though some of the assessments were below mean, (as Matthew mentioned) the score wont represent your grade, and my grade turned out to be an &quot;A&quot;",
            "comment_workload": "3 assignments which require you to do research and comment<br />one midterm report which is individual<br />one poster (group)<br />one final report, which is relevant to your midterm report<br />PRS every lecture (not sure if he would treat it as attendance)",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OBdq7T6U7EZccugZ0xmQ0ODA4IO0ufDl",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 213,
                    "name": "YUEN, Matthew Ming Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KrisC",
            "date": "Jan 16, 2017",
            "title": "",
            "comment_content": "Course description from lecture materials:<br />''Impact of the current technological evolution: creation of value in the global economy, society in general, and personal lives. <br />Science &amp; technology innovations: products and services. <br />Case studies: successes &amp; failure of technology companies; disruptive innovations; intellectual property<br />Smart city: application of technology innovations to enhance humanity, quality of life……. ''",
            "comment_teaching": "Classes are very boring, attendance will be recorded from PRS questions.",
            "comment_grading": "The grade was good, the grades range from A+ to B-.",
            "comment_workload": "4 research reports 20% <br />1 mid term report 35%<br />1 final report 35%<br />1 poster presentation (group project, group assigned by TA) 10%",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pSErYLyTDxOBGKPZcBihKpOFzGYKQWwZ",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 213,
                    "name": "YUEN, Matthew Ming Fai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ChingChongCheng",
            "date": "Jan 05, 2017",
            "title": "It's OK",
            "comment_content": "Content is mostly about Smart IOT, Smart Hong Kong, everything is about how the technology is changing the world. It really is just common sense. Honestly not sure whether people are interested in this topic or people are just taking it because it is part of SSC S&amp;T.",
            "comment_teaching": "Very boring style, he just reads it off the powerpoint and the words are so small on powerpoint. Honestly half the students are there doing their own thing. He is a nice guy nonetheless and has a passion for teaching, it's just the course which isn't very interesting. <br /><br />One thing that I just want to point out is the TA, Paul David Lavinge. Literally the worst TA I have ever had at HKUST, never replies to email, doesn't do anything, I don't even know why he is a TA. Try and avoid him at all cost, he is hopeless. He is in charge of marking the assignments and one of my friend's quality is definitely higher than everyone else yet he got below mean when someone's assignment was literally just 3 bullet points on each slide. Ridiculous TA and I have never seen anyone worse than him. <br /><br />Having said that, this course is easy enough for you to get good grade, plus you don't really need to listen in class and there is no final or mid-term, so I guess it's not too bad as long as you don't need to contact that TA for whatever reason.",
            "comment_grading": "Grading, to be honest, is pretty good (for me at least). <br /><br />20% - 3 assignments (5% each) &amp; Attendance (PRS, 5%) <br />10% - Final Poster <br />35% - Mid term report<br />35% - Final report <br /><br />My grade: <br />1) Assignments - I scored 5 out of 5 in all of them, means are 4/5, 4.3/5 &amp; 4.7/5. As you can see, the mean is really high, so try and get full marks, it's not very hard if you put in the effort (it's just 12 slides of PPT anyways). <br /><br />2) Attendance - I am not sure but I am sure I was close to full marks as I have always answered PRS questions, make sure you do that too, I think that was what made the difference for my final grade. There are 37 students enrolled but very often only around 20 people answered PRS questions. It will definitely shift a sub-grade for you. <br /><br />3) Poster - 8/10, mean was 8.4/10 (low: 7 &amp; high: 9). I call BS on this one as my poster was voted one of the best posters, so I don't know what the TA is thinking. <br /><br />4) Mid term report - 27/35 (mean: 28.1, low: 20, high: 34). Was below mean again, not sure how he grades it but whatever. <br /><br />5) Final report - 31/35 (don't have any stats apart from low: 20/35) <br /><br />Final grade: A<br /><br />As you can see, I got below mean in a lot of things but still managed to get an A, I think your attendance and the professor's impression of you is quite important.",
            "comment_workload": "Workload is alright I will say, assignments typically takes around 1 to 2 hours to finish (3 hours maximum if you need more additional research, which the TA doesn't care). <br /><br />Mid-term and final report takes more time, but they have a word limit of 2,000 words so it's not too bad either. Just make sure you put in plenty of examples he used in his slides then he will give you good grade lol.<br /><br />Poster takes more time because I am not good at visual stuff, so your teammates might be an important factor. Overall, relatively light workload, especially when you don't even have to go to class.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "x8CIEwYNvNQ3Zt1qU5PMoe0qpKjhTJf4",
                    "name": "Course Syllabus ENGG 1130 Fall 2016",
                    "format": "docx"
                }
            ]
        },
        {
            "hash": "k0grDGWO2pRTFvVq4cSEvkjxevpEuRM2",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 211,
                    "name": "WU, Po Chi",
                    "rating": 1
                },
                {
                    "id": 213,
                    "name": "YUEN, Matthew Ming Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kitty Leung",
            "date": "Jul 07, 2016",
            "title": "",
            "comment_content": "Content about current technological products, methods and technology around the world. Invited two guest speaker to talk about the Lantau Island development to provide more information to work on the final report. Arranged 1 field trip to Lantau Island few most important spots.",
            "comment_teaching": "Very boring, with one professor having too simple and boring powerpoint and the other professor having too comprehensive and wordy powerpoint",
            "comment_grading": "Quite good grade, but quite uncertain because only the mid-term and final paper grade and marks are shown",
            "comment_workload": "5 individual and group reports (in the form of either word or powerpoint slides), 1 individual mid-term and 1 individual final report, 1 poster sharing session (A0-size poster), 1 field trip PRS participation",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TvWyyL16R14OJ9lip8l2pPGaLeqfzC4e",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 211,
                    "name": "WU, Po Chi",
                    "rating": 1
                },
                {
                    "id": 213,
                    "name": "YUEN, Matthew Ming Fai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Samo",
            "date": "Jan 28, 2016",
            "title": "Interesting Experiences",
            "comment_content": "The content for the entire course is quite basic, but in my opinion, not planned too well.<br /><br />1st Half: Very focused on the idea of fostering entrepreneurship, what is required to sustain it, how is it structure, what the ecosystem is like, etc.<br /><br />2nd Half: Straight jump into entrepreneurship technology in a smart city, from the aspects of healthcare, economy, mobility, etc.",
            "comment_teaching": "Teaching style is very, very varied.<br /><br />1st Half: Very idealistic viewpoint taken towards the world, little engagement with the class, hardly any discussions unless you begin to ask questions, and try to stir something up.<br /><br />2nd Half: Very technical, prof will read from his PowerPoint slides, and open up reports, and show you that things are being written about technologies he is talking about. Tries to make the class engaging, but I remember one morning class where there were only 4 people in the class, because most didn't appreciate his style of teaching.",
            "comment_grading": "Grading is pretty lenient, but attendance matters.<br />Most people in the class received B-range grades, but attendance can shift you up/down a couple of subgrades easily.<br /><br />15% Participation/Homework<br />35% Midterm Report<br />50% Final Report<br /><br />No exams",
            "comment_workload": "Not that much workload, if you work constantly, and without saving everything till the last day.<br /><br />The homework assigned involves a good amount of research, and putting the work in at that point will make your midterm report writing a lot easier. <br /><br />Final report, when I took the course, involved looking at Kowloon East and suggesting Smart City developments.<br /><br />It is critical to pick a good, and effective group, because the homework &amp; final report involves groups. Moreover, with the homework, if the group puts in a decent level of effort, then the entire course is quite a breeze.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AAsu0b9jYNjV9o1jKgeqdCIQcV1kwOyT",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 211,
                    "name": "WU, Po Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bbg",
            "date": "Aug 01, 2015",
            "title": "",
            "comment_content": "content方面其實啲野好LS，完全用common sense就識。主要係關於科技點樣融入我地生活，同'smart city'有咩關係，只不過佢會詳細啲列舉例子，好似舉啲跨國企業同最新科技咁。<br />我覺得以上既野其實全部都可以吹出黎，如果你本身寫野既叻、幾吹得既話咁呢個course都幾岩你。",
            "comment_teaching": "其實呢個course我覺得同teaching冇乜關係，因為個professor實在太悶，而且佢講啲野只係assist你份assignment/final essay，基本上你自己上網google仲好啦。堂上個professor 鼓勵學生發問，不過多數得某幾個non local會回應。",
            "comment_grading": "no midterm no final，不過要交兩篇essay＋一份最少10頁既final report<br />計attendance 同participation<br />weekly assignment 都好似計少少<br />不過我唔太sure比重，而且我只知道其中一份essay個grade。<br />我就覺得grade一般啦，雖然最後有B+不過我每份essay都好比心機做。如果要A range應該要上堂非常積極<br />btw班上好多non local 英文麻麻都唔好reg啦",
            "comment_workload": "雖然冇mt final 不過workload絕對唔少。<br />每個禮拜要交一份關於research進度既功課，我本來都好有心機做，不過到後來hea比佢就算（要做咩詳見attachment）<br />同埋要交兩篇essay ＋report",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "ijIe6tmu7X61puNWvW8mdsMiTykCbz47",
                    "name": "ENGG1130+HOMEWORK+Fall+2014-2",
                    "format": "docx"
                }
            ]
        }
    ],
    "composer": []
}