{
    "error": false,
    "course": {
        "id": 2951,
        "subject": "ENGG",
        "code": "1300",
        "name": "Design Thinking for Health Innovation",
        "description": "A project‐based, experiential course that exposes students to the design thinking process for health innovation to address the real‐world unmet needs in the society. The goal of this course is to develop students’ communication, interpersonal, teamwork, analytical, design and project management skills through a multi‐disciplinary, team‐based design experience. The design thinking process modules: empathize, define, ideate, prototype and test, will be introduced and the students will learn experientially by applying these process modules to solve the health unmet needs they observe in real life. The students are required to report their progress throughout the semester. At the end of the course, they will showcase their prototype in a roadshow and submit their project report and reflection on their design journey. It is a common core course for students from different schools who have no background in design thinking or are looking for practical experience in design thinking.",
        "categories": [
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4,
        "rating_teaching": 4,
        "rating_grading": 4.17,
        "rating_workload": 2.83,
        "review_count": 6,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1191,
                "name": "ABEYNAYAKE, H.I. Malinda M.",
                "count": 6
            }
        ]
    },
    "reviews": [
        {
            "hash": "T4yb0R37LIOrk3Ebp2LsM1IHtdyU4uf6",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1191,
                    "name": "ABEYNAYAKE, H.I. Malinda M.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hjkjhjk",
            "date": "Jan 06, 2022",
            "title": "A project-based design thinking course",
            "comment_content": "Teaching is not important in this course. The aim is to let students think out of the box and think of some innovative ideas and apply it to the project. For this semester, it was divided into two projects in which you will have two different team formations. <br /><br />Project 1: Improving the user space of the HKUST innolab (32.5%)<br />Project 2: Solving problems related to living space (67.5%)<br /><br />Besides, some tutorials and regular presentations, instructors will always provide us with many team building fun games to play with. Suitable for those who love to learn in a chill environment.",
            "comment_teaching": "Although the project guidelines are quite vague. But always do no hesitate to ask the instructors and TAs. They were super super super nice! Throughout the whole course, they were willing to help students to solve the problem together and always provide us suggestions for improving the prototypes and ideas.",
            "comment_grading": "Grading scheme:<br />Marketing Research presentation (x2)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;15%<br />1st Prototype presentation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;15%<br />2nd Prototype presentation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;15%<br />Final Project Pitch: 3rd Prototype presentation&nbsp;&nbsp;&nbsp;20%<br />Project Report / video record on 3rd prototype&nbsp;&nbsp;15%<br />Peer Evaluation (x2)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20% <br /><br />I got everything above mean and highest for a few presentation, the grades for the final report and final project pitch aren't released<br /><br />I would say the grading is fair, as long as you contribute and show your hard work to the instructor, they will give you good grades :)<br /><br />Final Grade: A",
            "comment_workload": "As a common core course, I would say the workload is quite high. Basically, you have to do a presentation and make a prototype at the same time for every two weeks. I almost spent most of the time in this course throughout the semester, and used many time on building the prototypes and making the powerpoint for presentation. In total, you will have to do 5 presentations throughout the semester, and sometimes instructor will ask you to do a mini-presentation regarding your ideas and share it to the class. The course maybe easy for engineering students as those prototypes basically test how innovative you are.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KpVNeQ06nebKq5rJ64qvzAyrJCfvohbL",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1191,
                    "name": "ABEYNAYAKE, H.I. Malinda M.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "grizelyt",
            "date": "Jan 05, 2023",
            "title": "Pretty heavy workload but a fruitful course",
            "comment_content": "This year's topic is about helping dementia patients and their caregivers, not a really interesting topic but still okay as there are many resources out there. There were site visits and hands-on workshops as well, quite rare for a UST course.<br /><br />The course was conducted in workshop format and pretty fun actually. You get to meet new people for the first few weeks and get along to form your own team, then the second group would be formed by tutors, good luck to you. <br /><br />Most fruitful part of this course is you get to really work on user research, prototyping like 3D modellings, and learn some practical skills in design thinking. Yet, the content is not very deep, quite nice for an introductory course!",
            "comment_teaching": "The tutors were very helpful and willing to answer your questions. The classes were very interactive, so get prepared to get asked a lot of questions as well.",
            "comment_grading": "Presentation: User/Market Research &amp; Initial Ideas (Week 04)15%<br />Team presentation: 1st Prototype (Week 08) 15 %<br />Final Project Pitch: 2nd Prototype (Week 12) 20%<br />Group Design Report 15%<br />Personal Miro-board 15%<br />Peer Evaluation (x3) 20%<br /><br />Most of the marks were not released, I got a bit below the mean for the first team present, but overall the grading is a bit lenient. I got A.",
            "comment_workload": "Pretty heavy actually, but only depends on how much you want to achieve from this course. Thankfully I got really good teammates to carry me, if you get a friend from ISD major, surely you could get a light workload project as they are so sophisticated in working with prototyping.<br /><br />If you are good at presentations, drawing diagrams or coming up with new ideas, this course is definitely your best choice!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "q5qz04PBwXkfYQuRTPd2ZSSTDg7o4bC1",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1191,
                    "name": "ABEYNAYAKE, H.I. Malinda M.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MmmM",
            "date": "Jan 25, 2022",
            "title": "Great course for creatives!",
            "comment_content": "This course is great for anyone who is interested in using their own creative abilities and coming up with solutions to social problems. There is a lot of freedom in the course, and the instructors are willing to provide any resources and materials you may want/need to bring your ideas to life. The instructors are extremely helpful throughout the process, and also try to incorporate fun activities and tutorials throughout the course. I would say that if you want to do well in this course, you may need to spend extra time out of class to meet with your teammates and work on prototypes. If you enjoy creative thinking and building things, I think this is a very fun and valuable course to take.",
            "comment_teaching": "This is more so a project-based course where you're required to present your progress/idea to your peers bi-weekly, and have a final presentation pitch at the end of the course. With the interactive activities and feedback from peers, you get to truly engage with classmates and get to know them personally. The teaching in this course is mainly the guidance and tips you get from the instructors. They also hold workshops on the weeks in between presentations, such as sketching, cardboard prototyping, 3D printing, wood sawing, and Figma workshops. The instructors also like to add in some games, and always come up with fresh ideas that make every lesson quite exciting. We even have guest speakers who talk about their designing processes and such.",
            "comment_grading": "I think the grading is fair, just put in the effort and enjoy the process. Instructors like it when students have new ideas, and they aren't too strict on how a task should be completed so there is a lot of freedom involved.",
            "comment_workload": "The workload may be considered high since it requires time outside of class to work on prototypes and prepare presentations. But, I'd say it's fun if you enjoy working on physical projects and sharing your ideas. It's a plus if you have prior presentation public speaking experience since you will need to speak in front of the class multiple times.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yBl0f4ksJ68c0njWBlCVBSl5TiQF9JNA",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1191,
                    "name": "ABEYNAYAKE, H.I. Malinda M.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "NeveruseB4",
            "date": "Aug 28, 2021",
            "title": "Large workload",
            "comment_content": "First two weeks will have some ice-breaking game. Then, you will be form in groups. <br /><br />Week3 You need to find out a group and present what you have find out on the topic of improving PPE (Personal Protection Equipment). You need to brainstorm on this moment. And you need to present every week. The teaching content is basically how to use the tool to make the prototype, which to have some improvement of PPE.",
            "comment_teaching": "The teaching is basically not teaching.<br />The tutor will give you time to discuss the project<br />Basically it is a project-base subject<br />The accent of the tutor can hardly let people to listen what he say",
            "comment_grading": "Basically each present contain some scores<br />The grading system is bad<br />Although there is some criteria of grading<br />But it can hardly get good grades in this course<br />If you want to try, you can play sight camp first!<br />you will get the exactly same experience without credit",
            "comment_workload": "Basically you need to present every week<br />although it doesn’t contain any exam<br />I do feel that it is a Big workload course",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "e91fNFTDJxXVRVSltSv1MSfPnDZABwVJ",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1191,
                    "name": "ABEYNAYAKE, H.I. Malinda M.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SaveTheTurtles",
            "date": "Aug 27, 2021",
            "title": "High workload for non-engineering students",
            "comment_content": "Theme of the course (and subsequently the final project) varies for each semester. The theme for this semester was to design and improve user experience of wearable, including PPE's under the pandemic, as it is particularly relevant during the fight against COVID-19. <br /><br />The course includes a series of guest speeches and workshops on Design Thinking and Prototyping. The course is of a comprehensive structure serving to create a well-rounded practice for design thinking.<br /><br />Week 01: Ice Breaking and Team Building Activities<br />Week 02: Guest Talk and Group Formation for 1st Project <br />Week 03: Team presentation on Market/User Research<br />Week 04: Workshop: Introduction to Design Thinking<br />Week 05: Prototyping Workshop: Initial prototyping with basic materials<br />Week 06: 1st Prototype Presentation and Guest Talk <br />Week 07: Advanced Prototyping Workshop: 3D Printing, 3D Modelling and Laser Cutter<br />Week 08: Prototyping Workshop: Mobile App Development<br />Week 09: 2nd Prototype Presentation<br />Week 10: Guest Talk on idea illustration and storytelling<br />Week 11: Final Prototype Testing and Team Time<br />Week 12: Final Prototype Pitch: III Prototype Evaluation<br />Week 13: Course De-briefing",
            "comment_teaching": "As a project based course, we mostly self-researched a lot of the related knowledge and mostly the principle and methodology of design thinking was taught, aside from the hands on skillsets such as 3D printing and Laser cutting.<br /><br />The professor and teaching assistant were both helpful and gave quite constructive criticisms upon reviewing our prototypes. Definitely a friendly environment to be collaboratively work in.",
            "comment_grading": "Presentation: User/Market Research&nbsp;&nbsp;15%<br />Team Presentation: 1st Prototype&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />Team Presentation: II Prototype&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;15%<br />Final Project Pitch: III Prototype&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Project Report:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Peer Evaluation (2x)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br /><br />Lenient Grading and fair evaluation of the project prototypes.<br /><br />Timely evaluations of the project progress helps shape the direction of your design but the evaluations came a bit too quick in the progress. For example, the evaluation on market research, which takes up 15% of the course grading was too early in the initial stage of the project where team building had not been established and the direction was quite unclear at that stage to make a well-developed market research.",
            "comment_workload": "The workload is high for non-engineering students since a lot of the prototyping relies on engineering knowledge. From basic prototyping the physics of the PPE, to creating electronic prototypes or applications, to start from zero isn't to say impossible but would be a high workload to take on yourself as a non-engineering student.<br /><br />However, this can be solved by grouping with students of diverse backgrounds in group projects.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lqa32MAFRejhV6tb6zJ76Ftbvgb2pIdn",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1191,
                    "name": "ABEYNAYAKE, H.I. Malinda M.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JackyJackson",
            "date": "Jan 19, 2021",
            "title": "Do beyond the class requirement",
            "comment_content": "Most likely a project-based course. The course does not have much instruction for what they want for the prototype, you may feel confused sometimes for the project direction and good teammates are important for having a complete report and presentation.<br />Figma and fashion 360 will be introduced briefly.<br />If your teammate has past experience on 3D object design will be a big advantage.",
            "comment_teaching": "Some times may be difficult to understand due to pronunciation. Since it's s a project-based course. Teaching not that important.",
            "comment_grading": "Assessment procedurePercentagePresentation: User/Market Research (Week 03)15%<br />Team presentation: 1st Prototype (Week 06)10 %<br />Team Presentation: II Prototype (Week 09)15 %<br />Final Project Pitch: III Prototype (Week 12)20%<br />Project report (Week 13)20%<br />Peer evaluation (Week 06 &amp; 13)20%<br />Maximum of A- in our sem for the top 20%<br />You won't able to know your final report score if you don't ask.",
            "comment_workload": "Relatively high for group meeting and presentation preparation every week.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}