{
    "error": false,
    "course": {
        "id": 2626,
        "subject": "ENVR",
        "code": "1150",
        "name": "Climate Change Impacts and Extreme Weather Events",
        "description": "As the extreme weather events emerge as one of the most prominent global risks, climate change and the accompanying natural disasters are no longer a side agenda, but play a critical role in maintaining sustainable societies and economies. This course aims to inspire students to take a broader perspective on environmental issues, in addition to advancing the scientific knowledge of climate change and extreme weather. To effectively achieve this purpose, the course introduces the case studies that emphasize the huge implications of extreme events (e.g. drought, flood, heat waves, typhoon) and their linkage with the warming due to greenhouse gases. This course also assesses the potential impacts of climate changes and extremes on social, economic and environmental sustainability through a multidisciplinary approach.",
        "categories": [
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.4,
        "rating_teaching": 4.5,
        "rating_grading": 4.4,
        "rating_workload": 2.8,
        "review_count": 10,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 973,
                "name": "IM, Eun Soon",
                "count": 10
            }
        ]
    },
    "reviews": [
        {
            "hash": "Uj3VNAKNPhmDgNWwCcUydxjA4y8kvVAL",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "PoisonNoMajorJJ",
            "date": "Jan 16, 2020",
            "title": "Geography course",
            "comment_content": "All those climate change stuff.<br />Global warming, extreme events, RCP scenarios, projections.<br />May require some level of data analysis when doing a mini individual research.<br />May also need to memorise for the midterm and final.<br />Some geography like.<br />I don't think the content is overwhelming.",
            "comment_teaching": "She has a heavy Korean accent. Sometimes I may not get what she has said if she does not repeat her words.<br />Other than that it's all fine. <br />She does not go through the topics too fast.",
            "comment_grading": "Assignment 1 slightly below mean.<br />Assignment 2 undisclosed. (I guess around mean)<br />Midterm mean -1.5SD <br />Final undisclosed. (I guess -2.5SD)<br /><br />Managed a C+.",
            "comment_workload": "Quite a lot of workload for a 1000-level common core. <br />Assignment 1 requires you to analyse temperature data from 9 cities. Thats ten thousand numbers. Then give out a conclusion on whether which cities suffer the most from climate change.<br />Assignment 2 tells you to draw conclusion and take a stance on TedTalks given by 2 speakers. <br />As the Assignment has very little word limit, you need to prepare and plan for a long time.<br /><br />Midterm and final was fair.<br /><br />She won't take attendance, but she will go through some important points, which are not shown on powerpoint but will be examined. She won't have her lesson recorded to be sure to attend her lesson, ON TIME. She usually go through those important stuff at the very beginning of the class.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gT3pPfXF1S4UPY8FsPsLnDk6sSmHDFYz",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "bWHnane",
            "date": "Oct 25, 2021",
            "title": "Horrible course to register",
            "comment_content": "Content handles the basics of Climate change, like some graphs and charts showing the cause of global warming and climate change.",
            "comment_teaching": "Purely heavy Korean accent, other than that, she is a pretty decent teacher, provides good teaching with good examples.",
            "comment_grading": "This course is horrible. <br />The hardest questions ever, and everyone came out saying what even were the purposes of each question that were provided. <br /><br />No notes for every exam.",
            "comment_workload": "Insane workload, one of the reasons that this course is not recommended. 1 mid-term and 1 final, 2 reports. those 2 reports are the possibly most complicated reports you will ever face in common core of 1---.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pCkuozG07JdL6mcrzbUbYBTU58RyUvn6",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "from OST",
            "date": "Jan 18, 2021",
            "title": "Good Grading if u attend all lessons",
            "comment_content": "focus on IPCC report <br />- global warming<br />- natural hazards related to climate change<br /><br />If u have studied geography, it may raise your interest.<br />I think the content is interesting and it is related so easy to understand.<br />Actually, the content is very less.",
            "comment_teaching": "She is quit passion.<br />I feel tired to attend her lesson since she has a heavy Korean accent.<br />However, if u don't attend the live lesson, u will not motivate to watch the videos.<br />But she is very willing to answer questions and she gives hints about quiz and reports.<br />Remember to ask her if u do not understand her English or the topics otherwise, she thinks u understand it and does not explain more eg the wet-bulb temperature.<br /><br />Most of the lessons have the review question help u understand and prepare for the quiz.",
            "comment_grading": "I would say not hard to get b range but need to work harder to get A<br /><br />quiz 1-3:10%<br />quiz 4,5: 15%<br />report 1: 30%<br />report 2: 10%<br /><br />Quiz 1: I got 73.8&nbsp;&nbsp;(mean: 61.2)<br />Quiz 2: 90.1 (67.1)<br />Quiz 3: 92.3 (76.5)<br />Quiz 4: 86.5 (71)<br />Quiz 5: 87.9 (76.67)<br />Report 1: 90 (70.4)<br />Report 2: did not release <br /><br />I finally got A-",
            "comment_workload": "Not heavy, acceptable and there do not have midterm and exam<br />Prepare the quiz is not hard, jot a note about all videos she played is really helpful for u to answer the questions in the quiz.<br /><br />Report 1 is a little bit hard since u need to due with a lot of data using excel ( TA will teach), it causes lots of time. Also, only can use 4 pages of ppt, important to design the formate well, the visual part is one of the marking criteria.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cQ953tXon6BHA2cHVnl2vRYhI1Of3wq8",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "_NattU_",
            "date": "Dec 31, 2020",
            "title": "",
            "comment_content": "I think the other reviews cover this part. It's simply a load of climate change stuff and stuff. Here's a breakdown of the course grading scheme (I'll talk more about my scores and grade in the grading section)<br />- 5&nbsp;&nbsp;open-book quizzes in total (60%). Initially, this was supposed to be a pop-up meaning she would take quizzes on random classes without any prior announcement.. Because of heavy backlash from all of us after the first quiz, she decided to fix the dates. They not necessarily hard as long as you revise the ppts and gain a good understanding of the materials. But many of us struggled with the time so you guys better prep! <br />Quiz 1,2,3&nbsp;&nbsp;were worth 10% each.<br />Quiz 4,5 were worth 15% each<br /><br />-Report I. Excel project (30%): Prof gives you a long ass excel file full of data on precipitation and temperature anomalies for 7 different locations. We are tasked to analyze the uncertainty, create graphical representations, and pick 2 out of the 7 cities we deem to be highly vulnerable to climate change. All of this must be presented into a 4-page ppt. Sounds tough but most of the concepts are covered extensively in class and there are also TA sessions for excel tutorials. Making the project file takes a long time though.&nbsp;&nbsp;Give it a minimum of 2 full days if you wanna come up with anything appropriate. If you're aiming for the top and you have some innovative ideas, you'll probably need to invest more time. Students are grouped as excellent/very good/good.. so on and the prof gives you a score based on that (100/90/80....). Only 2 students got excellent fyi<br /><br />-Report II. Written assignment(10%) : You are given two different TED talks with opposing views on a certain topic mostly related to climate change, and you need to choose to support/oppose one of these in your report. 250 words limit. Rubric for assesment is 40% for clarity (meaning you make it clear who you're supporting), 30% logical flow and 30% objectivity. Students are grouped as excellent/very good/good.. so on and the prof gives you a score based on that (100/90/80....)",
            "comment_teaching": "I think she teaches pretty well. She emphasizes the important stuff during her lectures and she's willing to take questions after class. The only reason I gave her a B is because of her heavy Korean accent. I personally don't find it hard to understand but I know a lot of my classmates struggled early on so just tryna give y'all a heads up on this.",
            "comment_grading": "Alright fellas, time for the main portion. (TLDR: I got an A with a 90.57% overall) <br /><br />Each score is scaled in proportion to the highest raw mark achieved by a student. So if the highest score was 80/100 and your score was 60/100, your scaled score would (60/80)*100=75. Here are the SCALED scores for my quizzes and&nbsp;&nbsp;the corresponding mean for each section. They're all out of a 100 and if it wasn't already obvious, the highest for each is a 100.<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;My score&nbsp;&nbsp;| Mean<br />Quiz 1: 95.1 | 61.2<br />Quiz 2: 90.7 |&nbsp;&nbsp;67.1<br />Quiz3:&nbsp;&nbsp;100 | 76.5<br />Quiz4:&nbsp;&nbsp;84.4 | 71<br />Quiz5:&nbsp;&nbsp;102.2 | 76.7<br />ReportI: 80 |&nbsp;&nbsp;70.4<br />ReportII:&nbsp;&nbsp;100 | No data<br />Quiz 5 probably requires some explanation. My initial score was 90-smth but we later uncovered a grading mistake so my actual raw score was higher than the original highest. Instead of rescaling the scores(and probably killing everyone else in the process lol) she decided to give me this and considered the additional scores under the same weighting.<br /><br />My overall score on this course was 90.57%. Threshold for A+ was 91.7. I was ranked fourth in the class fyi. I got an A. top 4 out of a class of 86 people lol. Sounds harsh for anyone aiming for A+. Not sure how the lower echelons of grading look lol no offense to some of ya!",
            "comment_workload": "The quizzes and report II don't necessarily take too much time. But the excel project holy crap! The main problem is its timing coincides with a lot of the midterm dates (happened to me so I had very little time to do this).&nbsp;&nbsp;Leave out a few full days just for this project",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PyawWs703HKQVJnyDTCXafro7LxFXDod",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yhys",
            "date": "Feb 20, 2020",
            "title": "",
            "comment_content": "A lot of geography stuff.<br />Mainly focus on extreme weather events, such as heat wave, flooding and drought. Although I had no geography background before, I found the content was not difficult to understand.",
            "comment_teaching": "She has a strong Korean accent. It was difficult to understand what she said in the first two weeks. It would be fine afterwards. She is a nice lecturer as she explained the content in detail. If you want to get high marks in exams, it is necessary to attend the lectures. More details were only explained in the lesson, but were not appearing on the ppt slides.",
            "comment_grading": "The grading is fair. The mean of midterm is not high. I got slightly above the mean in midterm and full mark in report 1. The marks of report 2 and final exam were not released. Overall, I got A-.<br /><br />Mid-term Exam 30%<br />Final Exam 40%<br />Project Report (Data Analysis) 22%<br />Short Essay (Critical Thinking) 8%",
            "comment_workload": "Quit a lot of workload. The data analysis is the most difficult part of the course. Various measures are required to use to find the most vulnerable three places under heat waves. In this semester, she showed&nbsp;&nbsp;some high score reports to us&nbsp;&nbsp;before the submission date of the first report. Those reports would give you some ideas on how to do your own report. Just spend some days on doing the data analysis. The word limit of the essay (report 2) is 300 words. It is easy to do.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "acFw73wf37hLdEtX3U6bLjIq24BcV2cN",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "galaxydust",
            "date": "Jan 23, 2020",
            "title": "Choose it if you are interested in environmental-related stuff",
            "comment_content": "As a person who dropped Geography in F.5, I found the content pretty easy to understand. Eg. Global warming, RCP scenario etc. Memorization is needed for midterm and final as it is mainly T/F questions and short questions.",
            "comment_teaching": "Although she has a very heavy Korean accent, you will get used to it after couple of lessons, so that's totally fine! She is also a very nice lecturer and willing to answer student's question so feel free to ask her any questions after class.<br /><br />The most IMPORTANT thing is that answers of the T/F questions use for revision are only available during class, which means you need to attend every single lecture to get all the answers.",
            "comment_grading": "Managed an A so that's a pretty decent grade for me!",
            "comment_workload": "I would say that the workload is quite manageable. Assignment 1 is a report which requires you to analyse temperature data from 9 cities, then conclude which cities suffer the most from heat wave. Assignment 2 tells you to take a stance on TedTalks and write a short passage.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SNthOjfBIVyTe0bpxARlQATCfFEsecUk",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tyhxd",
            "date": "Jan 20, 2020",
            "title": "",
            "comment_content": "Lots of geographic stuff which I think is quite a struggle for people like me who never study geography before. Although attendance is not taken, simply looking at the PowerPoint is not enough to understand the lectures.",
            "comment_teaching": "Accent kind of difficult to understand at times, but there is video of lectures so that students can review them at home.",
            "comment_grading": "Grading is fair, not too harsh and reflects fairly on the effort plus quality of the assignments.",
            "comment_workload": "Workload is quite huge due to the complexity of the geographic stuff. However, attendance is not taken which is a good part about the course. There is project but is done on an individual basis.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wfn45wgdEEL2qKv403jZ3PF3bPq6AGWA",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jeremy Chung",
            "date": "Aug 12, 2019",
            "title": "Review on ENVR 1150",
            "comment_content": "Content are well organise, covering the impact of climate change and provide insight on climate modelling.<br /><br />The concepts and phenomenons taught are not far off from DSE geography, so if you have took geography in high school, you should be familiar with maybe 30% of what was taught. The contents will only go into more details and specifics.",
            "comment_teaching": "Her Korean accent is hard to deal with initially, but after a few weeks of it, you will eventually learn to listen to it. <br /><br />Also she is genuinely a very nice professor who wants her students to do well.",
            "comment_grading": "Quite loose considering its a new course, but you really need to work hard for it.",
            "comment_workload": "Workload is a bit stressful considering the fact that you need to organise and analyse a bunch of data on temperature and humidity to figure out the most impacted area in the world. <br /><br />In my class, we had to figure out which three city would heatwave impact the most through analysing the data.<br /><br />However apart from the first report, the second report and the mid-term and finals is alright",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8sDL4uM8ZIFKxOm4wKJLnS15OuhPNHST",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kandiceli",
            "date": "Jan 20, 2019",
            "title": "",
            "comment_content": "Everything was base on the IPCC reports.<br />The whole theme was about the impacts on different aspects of the world due to climate change (global warming in specific)<br />There was no clear syllabus, but her teaching included:<br />- climate modelling<br />- extreme weather events (causes, impacts, and measurements)<br />- impact analysis<br />...<br />A bit similar to HKDSE Geography, but the content was more in-depth.",
            "comment_teaching": "She was very nice and explained whatever questions patiently. She welcomed anyone to find her after class or through email.",
            "comment_grading": "She gave clear instructions on how to get &quot;good grades&quot; in the mid-term, assignments, and final. <br />The mid-term and final had Ture or False and short answer questions. Everything that was tested was based on the powerpoint she used in lessons (would be uploaded to canvas) and she explanation in class (MUST attend lessons!).<br /><br />As long as you study and listen in class, you would be fine.",
            "comment_workload": "Two assignments + mid-term + final.<br />All needed a bit of effort but manageable.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wQe99du9G8X4D9ScjaAVSEq4nRyU1K8U",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "whotne",
            "date": "Oct 24, 2019",
            "title": "",
            "comment_content": "Interesting content, fairly large quantity. If you have no geography background you may need to put a bit more effort than someone who does. According to a senior, it's a watered down version of ENVR 4000O but you don't have to make your own climate model. However, as this was the first year of the course, the content may have changed since I took it.<br /><br />Pay attention to the true/false questions she uses as review at the start of class as they may appear on the exams, and make sure you understand what the graphs and diagrams are trying to say. Sometimes she will specify which things she will test on the exams.<br /><br />Main topics covered include: climate modelling, natural disasters, and IPCC reports/scenarios on climate change.",
            "comment_teaching": "Prof. Im's accent is difficult to understand at first. Ever since learning how to understand her, no other professor's accent has challenged me. If you listen in class, you will understand her more gradually until at midterm you realise just how much your English comprehension has improved.<br /><br />She's a very passionate professor and she does her best!!!!! Even if you can't understand at first listen carefully - she's super nice, will answer your questions. Don't hurt her!",
            "comment_grading": "It seems very fair. Assignments are moderated, exam grade curve appears not heavily skewed.<br /><br />Aside from exams are the assignments. With the report, she will force all the top marks to present their report so you can feel your self-esteem going down or at least understand why your grade is not that great in comparison. (Non-top marks do not need to present.)<br /><br />Midterm: 30%<br />Data analysis report: 20%<br />Short essay: 10%<br />Final: 40%",
            "comment_workload": "Considering it is a 1000 level common core, it is somewhat difficult. Exams are just exams, but the data analysis will challenge you if you've never done anything like it:<br /><br />Short essay - as the title suggests. Only 300 words to give commentary comparing two selected TED talks. Should be no stress.<br /><br />Data analysis report - this is what challenged a lot of people. She will give A LOT of data - I'll say that again, A LOT OF DATA. Task is to analyse the data however you choose (so people don't know what to do) and justify which locations will be most heavily hit by heat waves.<br /><br />The key here is you have to decide what you want to do with your data. My advice would be to think of a criteria to judge how bad the heat wave (or whatever) would be, and then score or rank the locations based on your criteria, like grading scores. Then explain why. <br /><br />Actually, I'm writing this review because someone taking the course this year complained to someone who took the course with me last year that they had too much data for the report. Last year we had 16 pages of excel sheets in 8 columns and 400 rows each, covering RCP 2.6, 4.5 and 8.5, plus historical data for each location. Prof has already heavily reduced the data since last year by over 75% and done the wet bulb calculation for the students this year, so the main challenge is just in deciding what to do with the data and not calculating wet bulb as well.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}