{
    "error": false,
    "course": {
        "id": 1481,
        "subject": "ENVR",
        "code": "3010C",
        "name": "Circular and Sharing Economy: Principles, Practices and Prospects in Hong Kong",
        "description": "Rising population, growing affluence and materials consumption all conspire to drive up humanities’ impacts such as anthropogenic climate change, resources and water scarcity etc. on the environment. According to the latest data, Hong Kong people are living beyond the Earth’s limits. 3.1 Earths are needed if everyone lived the lifestyle of Hong Kong people. What could be done to prevent continual overdraft of our Earth’s provision and yet maintain our quality of life? This experimental course explores several potential alternative production and consumption models which could contribute to the slowing down and lessening of such originated environment impacts. A circular production model emphasizes reuse, remanufacture and recycle of materials at the supplier side; while a sharing consumption model generally refers to physical, underutilized resources are shared between individuals, at the user sides, with the aids of an online platform and marketplace. What are the promises and prospects of these models? How Green are They? Beyond the Environmental Realm, Do These Models Build Social Capital or Are They a Race to the Bottom? Through guest lectures, site visits, case studies and textbook materials, students conceptualize and apply the principles and practices of such models and form teams to hands-on develop a strategy or venture in Hong Kong demonstrating such emerging models as a course final deliverable. Student-led learning emphasized. (Limited to 12 students and Open to all UG students upon instructors’ consents)",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            1530
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 0,
        "rating_teaching": 0,
        "rating_grading": 0,
        "rating_workload": 0,
        "review_count": 0,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [],
    "composer": []
}