{
    "error": false,
    "course": {
        "id": 433,
        "subject": "FINA",
        "code": "3504",
        "name": "Management of Financial Institutions",
        "description": "Management of commercial and investment banks, and insurance companies; regulatory issues; management of financial risk.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            1510,
            1430
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"FINA\" data-code=\"3104\" href=\"/review/FINA3104\" target=\"_blank\">FINA 3104</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4,
        "rating_teaching": 4.5,
        "rating_grading": 3.5,
        "rating_workload": 2.5,
        "review_count": 2,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 251,
                "name": "KUO, Allen Chung",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "gPHjfdaU69E32vwdRCDuWSEKOsmLQqxn",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 251,
                    "name": "KUO, Allen Chung",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Zeta",
            "date": "Dec 28, 2015",
            "title": "適合想加入fina industry既人讀; 全sem~1489頁PPT",
            "comment_content": "FINA3504係會令你長知識既一個elective course，最適合將來想加入銀行、ibank、AMC、保險etc各類金融業既同學take，但好可惜小弟唔係其中一個，我只係想求其fulfill FINA major既credit requirement先take。<br /><br />標題為management，實質教既係risk management，所以成個course最重要係明白乜野係risk。<br /><br />個course一開始先會極詳細咁介各種financial institution (FI)，就係包括以上我講果d。然後會進入risk mgmt部分，討論FI普遍會面對既四大風險，包括Interest rate risk, Market risk, Credit Risk, Liquidity Risk。每種risk都會討論埋下公司可以點樣measure同control佢地，再加上提及regulators對呢種risk既處理有咩要求 e.g. minimum capital requirement, liquidity ratio etc.<br /><br />FINA3504 is a course which would definitely enrich your knowledge. It fits most with those students who want to get into the finance industry like traditional banks, ibanks, AMCs, insurance companies. But I'm not one of those; I just took it for my FINA major fulfillment.<br /><br />The course is all about risk management, though its titling with &quot;management&quot;. Therefore, understanding the concept of &quot;risk&quot; is of most importance throughout the semester.<br /><br />It started with detailed introduction for various types of financial institutions (FIs), including those I mentioned above. Then it moved to the part of risk management. The course discussed the main 4 types of risk that typical FIs would face, namely, Interest rate risk, Market risk, Credit risk and Liquidity risk. For each type of risk, we discussed the methods to quantify, measure and control it, plus mentioning requirements from the regulators on that risk e.g. Minimum capital requirement, liquidity ratio etc.",
            "comment_teaching": "Allen其實係教得好的，佢英文講得超好聽，呢方面實力同Darwin不相百仲。但有時ppt用既英文terms會深到睇唔明。而且佢講書好聽到一個點係我每次都會想訓著，好難集中，可能因為我冇其他同學咁熱心要加入finance industry啦。<br /><br />佢個人有好豐富既finance industry實戰經驗，做過好多次fund manager，又係銀行、AMC、hedge fund做過 (BlackRock佢都做過)，呢一點令到個course更加有價值，因為佢既經驗令到佢唔止會跟書講，而係會成日分享佢第一身既insights，係一d只有經歷過先會講得出既道理。<br /><br />Allen係一個會認得學生同會關心學生情況既prof。佢會大概記得你平時表現係點，就算你冇講過野。<br /><br />Actually Allen was fairly good in teaching. His spoken English is excellent and I think is as good as Darwin. But just that sometimes his wordings in the slides were too rare to appear and so were not understandable. Nonetheless his delivery tongue was too soft, that I slept almost in every lecture. Perhaps that's because I wasn't that passionate to enter the finance industry comparing with other students.<br /><br />Allen has real and rich personal experiences in the finance industry. He had been a fund manager, had been hired by banks, AMCs, hedge funds. Even BlackRock is his old employer. This factor further made the course valuable, as he did not just follow the text to teach, but also frequently shared his first-hand insights to us, which could only be learned from authentic&nbsp;&nbsp;experiences.<br /><br />Allen is a professor who cares about his students. Probably he knows how well you follow and participate in the lectures, even you didn't speak a word.",
            "comment_grading": "Homework x 9&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Test 1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Test 2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Final&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;40%<br /><br />據prof講法，B+最低分要有總分81。<br />我HW above mean，test 1 大約mean，test 2 above半個sd以上，final唔知成績，總分80，拎B。<br />感覺grade真係麻麻。<br /><br />According to Allen KUO, the minimum total score for getting a B+ is 81. I got above mean score for HW, around mean for test 1, above a half of s.d. for test 2, and don't know the score of Final exam. My total score was 80, resulting in a B.<br />I felt that the grading is not that good.",
            "comment_workload": "大約每星期都要做一份功課，好麻煩 (就算你有partner) 而且time consuming，加上佢set答案係跟佢自己教既logic，而唔係跟書既model ans，所以有機會就算你網上搵到答案，照copy都係錯。<br /><br />呢個course既一個亮點係Powerpoint。由於Allen當本ref book真係純reference，基本上佢自己寫既ppt先係你要睇既&quot;書&quot;，佢既ppt先係真理。好了，但ppt平均一個就~115頁 (每頁字數都唔係特別少)，每個lecture都教六十幾版，全sem加埋有1489頁ppt，呢個數量應該冇咩course可以做到。Tests淨係考幾個chapter已經會睇到你死，但Final係cummulative，即係1489頁既material你都要識晒，係一件好絕望既事，你亦都冇可能係考之前頁頁都認真睇晒。<br />我本人對ppt既安排係好唔滿意。<br /><br />Approximately one homework for every week. The HWs are annoying and time consuming (even if you have a partner). Allen set those answers for the HW questions according and only according to his knowledge. That means even if you copy some suggested solutions online, they turn out might be wrong.<br /><br />One point which I must criticize in this course is about the Powerpoint slides. Since Allen really treated the reference textbook as a pure reference, basically his ppt will be the &quot;truth&quot; you should follow. However, the average number of slides for one ppt is ~115; ~64 slides on average taught each lecture; and finally 1489 slides for the whole semester. Honestly, I don't think there will be another course which can break this record. The tests cover a few chapters each time and are tough enough already. But FINAL EXAM IS CUMULATIVE. Then you are required to review the 1489 slides and are supposed to handle all these well. Completing this task will be impossible and unrealistic.<br />Personally I am very unsatisfied with the arrangement in ppt slides.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": [
                {
                    "key": "auMAxhjmblBQZEtQKC0Y302oNGgucfBV",
                    "name": "FINA3504_syllabus_201509",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "pyDQoyQSKYuwdC9GE5XqGoEh2MRHEQGT",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 251,
                    "name": "KUO, Allen Chung",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jpjp",
            "date": "Jan 28, 2016",
            "title": "",
            "comment_content": "Lots of content to remember, but its quite useful for learning about the nowadays compliance in financial sector.",
            "comment_teaching": "He accent is good, but quite hard to pay full attention as content can be quite clumsy and boring.",
            "comment_grading": "not too bad.<br />2 midterms <br />9 assignment<br />1 final <br /><br />basically u need to get full mark for assignments, they are mostly exercise from the textbook.<br />first midterm above mean 0.5 sd and second midterm below mean 0.5 sd.<br />Final above mean. <br />got B- at last.",
            "comment_workload": "His grading scheme does not require classes attendance. However, there is assignment almost every single week, and it can be quite difficult sometimes, plus it is a two man group assignment. So I would say it is quite demanding but still within acceptable range. Just get prepared for homework every week then you will be fine.<br />:)",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}