{
    "error": false,
    "course": {
        "id": 457,
        "subject": "GBUS",
        "code": "3030",
        "name": "Global Business Case Studies",
        "description": "This is an advanced case studies course that develops students' proficiency in conducting business problem solving and presentations under conditions simulating real business settings. For GBUS students or students with consent from the instructor.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 5,
        "rating_workload": 3.4,
        "review_count": 5,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 266,
                "name": "DORAN, Christopher",
                "count": 5
            }
        ]
    },
    "reviews": [
        {
            "hash": "uu6HRQFMb5IRO5LQzW2KICMkjFdIEucG",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 266,
                    "name": "DORAN, Christopher",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "T_T",
            "date": "Jan 11, 2019",
            "title": "",
            "comment_content": "Case-based, with themes ranging from retail &amp; consumer goods, manufacturing, startup, NPO, M&amp;A, private equity, etc. You'll be dealing with roughly 13 different cases throughout the semester.<br />Though having a very strong business focus, the course is designed to hone your problem solving and presentation skills.",
            "comment_teaching": "Teaching is one of a kind. This is probably the most insightful course UST has to offer.<br />The learning comes from two major categories-- bi-weekly (or weekly) presentation and Professor's prepared materials. I personally felt that you learn the most during those presentation sessions (usually lasting for one hour) where you are grilled by Chris' questions. As you can't really get away with any bullshit on the spot, you need to make sure the preparation is sufficient and well-rounded.",
            "comment_grading": "Quite good in general. To ace the course, though, requires absolute hard work to prove yourself capable.",
            "comment_workload": "Manageable. Meeting time for assignments/ presentations are mostly to gather facts and derive insights. There are two cases that are designed to be heavy in data modelling, in which team will spend a considerable amount of time crunching numbers just to get to a decent level to start with. Apart from these two cases, the others are more standardized where you brainstorm innovative recommendations and build an intact storyboard that is logically sound.<br />There are instances where you deal with a limited prep time e.g. within 24 hour. In those scenarios, the very day will be super intensive but won't be spilled over to other days.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H06lzKpFEhjbYKwe9avWKQnzkSMHfmch",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 266,
                    "name": "DORAN, Christopher",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "NONAMEGUY",
            "date": "Dec 21, 2018",
            "title": "",
            "comment_content": "",
            "comment_teaching": "Wonderful!",
            "comment_grading": "According to Chris Doran:<br />A-&nbsp;&nbsp;= satisfying level<br />A&nbsp;&nbsp;&nbsp;= McKinsey level<br />A+ = Chris Doran level<br /><br />come to test test which level you're in hahahaa",
            "comment_workload": "My feelings for the other parts are quite similar..So.. forgive me for my laziness...<br />Just one simple takeaway here: the workload isn't that crazy. I survived with 17 credits this semester.<br />The previous comment about taking less than 12 creds was really scary to me and it took me a loooong time to decide whether to take this course or not.<br />But my workload turned out to be acceptable(though most of my weekends are gone). The pressure of heavy workload pushed me to plan my time carefully and finish things more efficiently.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xRoa3agwXJtWs80xacUcO9vQ7ZaQCo2O",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 266,
                    "name": "DORAN, Christopher",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ChingChongCheng",
            "date": "Dec 29, 2016",
            "title": "GBUS3030 - More Demanding Than Typical GBUS Course",
            "comment_content": "This course is extremely useful and teaches you some of the most practical skills. There will be a case every week and you will probably present every other week or two weeks in a row. Each case is from different industries, spanning from retail to healthcare, VC to IoT, NPO to PE Buyout etc etc. Non-presenting teams will have alternative assignments which are much easier. <br /><br />No mid-term or final (replaced with a 24 hours Final Case Competition). Apart from presentations, the team also needs to design a website introducing one industry. Furthermore, attendance is compulsory.",
            "comment_teaching": "The professor himself is hands down the best professor I have ever had. He is extremely knowledgable and is very passionate about the course. There is no one single lecture when you are not able to learn new things (which also means that the learning curve is extremely steep). <br /><br />He is also willing to spend a lot of time after lectures to give you feedback; the lectures typically finishes around 1.5 to 2 hours after the normal lecture hours because he is willing to spend THAT much time to give you feedback, both individually and team-wise. As long as you are willing to listen, you will learn.",
            "comment_grading": "Team - Case Presentations (50%) <br />Team - Industry Website (10%)<br />Individual - Team Contribution, i.e. Peer Evaluation (20%) <br />Individual - Class Participation (20%) <br /><br />The grading structure is fairly simple, with presentations taking up majority of it. Just be aware that it is almost impossible to get an A+ from the professor as he has very high expectation. However, if you are willing to put in the effort, A- or A should not be a very hard task.",
            "comment_workload": "During presentation weeks, you can honestly expect to spend at least a few nights in the LC, as well as your weekends. Since I knew this course has a heavy workload, I made sure other courses were relatively light in workload for this semester so I was able to survive through it. However, I would really advise you to take less course (i.e. &lt;12 credits) if you are planning on taking this course; otherwise you will find yourself dying from the lack of sleep, especially during mid-terms and final assignment deadlines. <br /><br />Good luck, the course is definitely the course that I have come to the university for, and I believe it will be yours too! Enjoy it.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "HPAfqdnvxcufpeOjTNp66vNfuuwVfoWo",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 266,
                    "name": "DORAN, Christopher",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "然廷",
            "date": "Jan 24, 2016",
            "title": "Best course I took in UST",
            "comment_content": "Cases, cases, cases, ... and cases.<br />Same format as the first half of GBUS2010 (but with much more interesting and challenging cases).<br /><br />Content is adaptable; you'll receive a survey in the first week inquiring what concepts you'd like to cover (ex: financial modelling), or on from what industry do you want your cases.<br /><br />Team allocation is assigned by the instructor but thought through, not random.<br /><br />High attendance is required: you're not allowed to miss more than three classes.",
            "comment_teaching": "About 75% of the time goes to presenting and getting feedback.<br />About 25% is allocated to high quality explanations of consulting concepts illustrated by C.Doran's past experiences (loved it, raw logical business thinking free from the usual bullshit)",
            "comment_grading": "Very demanding course + highly motivated student =&gt; high grades awarded<br />(I'd assume the average grade is A or A-)",
            "comment_workload": "Most demanding course I took in UST. A case a week but you'll only present every two weeks. You'll spend nights and nights working in the LC with your teammates, and not sleep at all during the two 24h cases.<br /><br />Your business sense and presentation skills will receive an enormous boost - totally worth it if you're interested in the consulting industry or want to improve your business thinking and presentation skills. Personally, it's the best class I took in UST.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "r6mSP5O0GSU4wOz7iP8oywD1qRaabYQU",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 266,
                    "name": "DORAN, Christopher",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "PeggyHui",
            "date": "Jan 31, 2023",
            "title": "Good course",
            "comment_content": "This course is designed to teach you how to solve business problems and communicate your<br />recommendations. These skills will help you succeed in your first job. You will also find these skills<br />helpful for your participation in international case competitions.<br />This will be a demanding case-based course where you will learn the tools, skills and approaches<br />adopted in leading management consultancies.<br />Approval from course instructor is required prior to enrolling in the course<br /><br />Upon completion of the course, students will be able to:<br />1. Apply a structured approach to problem-solving, as used in top management consulting<br />companies<br />2. Prepare clear, fact-based business recommendations in Powerpoint, with a robust storyline and<br />high quality charts;<br />3. Present professionally, improving skills through peer and instructor feedback<br />4. Work more effectively in a team setting;<br />5. Apply business judgment to new situations",
            "comment_teaching": "CD is a very professional and enthusiastic teacher. I love his British humor, always make the lecture fun. Though it is a 3hour course, you would not feel bored.<br />Also, he is very generous when you need some personal advice on your own entrepreneurial projects. <br /><br />The TA is very cute and responsive. Always allow people to change PPT at the last minute. (Soooooo kind)<br /><br />In general, love the vibe and everyone there, the prof, TA and classmates.",
            "comment_grading": "very good grading<br />try to be active and participate <br />Classmates and teachers are lovely <br />A+ for a 4 credit course",
            "comment_workload": "Very low workload as a 4 credit course in my opinion<br />Tho one case per week, i think it is ok as one has done quite some cases before and know the framework.<br /><br />Certainly a course you can have fun with and learn a lot while pulling up your GPA. Definitely my favorite course in UST.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}