{
    "error": false,
    "course": {
        "id": 488,
        "subject": "HART",
        "code": "1030",
        "name": "Introduction to Chinese Painting in the Past Century",
        "description": "Traditional Chinese painters learned to paint mainly through apprenticeship and copying masters’ works, and regarded painting as a medium of self-expression. The unique painting style of each artist often reflects his/her artistic lineage and knowledge, as well as personal temperament, value and taste. This course gives a brief introduction to the development of Chinese Painting in the past century. While inheriting the traditional model of Chinese Painting, new presentation styles and contents reflecting ordinary lives and society in that period were also explored and created in numerous paintings in response to the dramatic social and political change since the turn of the 20th century. This course focuses on introducing students to the painting styles of a few Chinese painters of the past century, teaching them to appreciate the artists’ artistic perceptions and social roles embodied in their works. Through copying and imitating their styles, students will have hands-on practice of the painting principles and skills of Chinese Painting.\n傳統中國繪畫透過師徒傳承學習，畫家視繪畫為表達個人志趣的媒介，繪畫作品的風格往往反映了畫家的師承，性情，品味與學養。十九世紀末以來的中國繪畫，一方面繼承了傳統繪畫學習與表現的模式，一方面因應時代的變革，開發出許多創新的技法與反映當下民生社會的題材。本課程將以近百年中國畫家為切入點，引導學生學習不同繪畫風格，並了解畫者所處時代的社會角色。透過臨摹名家畫作，讓學生研習中國繪畫之畫理與技法等特點。",
        "categories": [
            "Common Core (Arts)"
        ],
        "website": null,
        "credits": 1,
        "semesters": [
            1940,
            1740,
            1540,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"HART\" data-code=\"1042\" href=\"/review/HART1042\" target=\"_blank\">HART 1042</a>",
        "rating_content": 4.33,
        "rating_teaching": 4.67,
        "rating_grading": 4.33,
        "rating_workload": 4.33,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 284,
                "name": "PAU, Mo Ching",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "IJY07ZMPcMPU5pxSfdSHZfFzlr3JO4J9",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 284,
                    "name": "PAU, Mo Ching",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yookyobotina",
            "date": "Sep 08, 2020",
            "title": "",
            "comment_content": "It is very clear and can learn many different chinese painting skills in this class.",
            "comment_teaching": "Miss Pau's teaching is quite fun and interesting. She gives many comments to your artwork whenever you ask. She appreciates any creative ideas so students can feel free to present new ideas.",
            "comment_grading": "I got 3.38/5 in both of my painting assignments and got full attendance mark and 4.5/5 for participation mark. The allocation of marks is 25% for first assignment, 50% for second assignment, 10% for attendance and 15% for course participation. Attendance and course participation marks are quite easy to get so I would say it is a quite good grade course.",
            "comment_workload": "The first assignment is a piece of chinese painting and the second assignment is two pieces. Students can do it on class so it does not create too much workload out of class.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vuAwfZn4MMyo3RBekGSEQFzDEnO0UELC",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 284,
                    "name": "PAU, Mo Ching",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anchor",
            "date": "Aug 07, 2016",
            "title": "just one cred and deserve a try",
            "comment_content": "mainly about the basic technique of Chinese painting <br />the background and history of the Chinese painting somehow is also included <br />the skills taught have color mix, how to draw and paint different flowers, how to draw a cock",
            "comment_teaching": "quite polite and friendly <br />patient enough to provide adequate advice to let us know how to improve <br />each time when we start a new topic, she would firstly demonstrate to show us the techniques and the things we need to pay attention <br />overall is satisfactory",
            "comment_grading": "somehow art is very subjective <br />we cannot expect to have full mark or guarantee a high grade <br />but your effort definitely can be seen by yourself",
            "comment_workload": "total three assignments in one semester <br />but we need to do our painting and drawing every lesson<br />so we have to bring our pens and other equipment each time<br />for the student not interested in painting and drawing, the workload definitely not small <br />but for students who love it just like me, I just have all fun in the lesson, even at home, I still have my enjoyable time to do the assignment, simply no burden to me",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JPIXRebmLQO1QbIs2qJNoqrdVcDsdiCo",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 284,
                    "name": "PAU, Mo Ching",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CindyXing",
            "date": "Jan 09, 2021",
            "title": "想接触国画可以选这个入门",
            "comment_content": "完全入门课，老师不会对工具要求太多，总课时也很短，内容不多也不深（甚至没有办法完成最初的课程大纲），绝大部分时间用来看老师画以及自己实操。给B的原因是学的内容不够多，所以真的只是入门课。<br /><br />整个课程一开始是学些最基础的工具分别，例如羊毫狼毫的区别和不同毛笔尺寸的效果。接着老师示范临摹花鸟画和山水画，穿插示范花、树、鸟、山之类的经典国画元素。<br /><br />详细地，每堂课开始老师会逐一评价每个同学的临摹作品，然后开始讲新的内容，随后示范临摹一张新作品（其中穿插详细解释，有点致困），示范完之后给同学半个到一个小时当堂临摹作品，接着给评价。下课后把堂上没完成的作品补完，然后上交到canvas。",
            "comment_teaching": "老师很温柔，讲课很细致（非常适合新手），想到哪里讲哪里（到最后放飞自我，大纲都不跟了）。<br />一节课时间实在太长，从中午到下午一共两三个小时，吃不到午饭不说，长时间坐着看老师画画实在太致困。",
            "comment_grading": "grade不错，我作为一个完全没有接触过国画的新手拿了A-，我交的作业都贴在attachment里，供大家参考。<br /><br />只要认真听老师的建议（笔触、铺排等等），作品就差不到哪里去。",
            "comment_workload": "低负担，交作业只交画画作品就行（大部分都是临摹），一共画五幅左右。",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "GzTaiMUSJlprSJarX2DI1LD3qNRMjSbn",
                    "name": "荔枝",
                    "format": "jpg"
                },
                {
                    "key": "nO1ZkcSCVqlUd4PN1ibN9olG8SlO0kVE",
                    "name": "芭蕉树",
                    "format": "jpg"
                },
                {
                    "key": "Y4jxj5xE8VK56x0Z7nYBwUc3u6jiHtKz",
                    "name": "江",
                    "format": "jpg"
                },
                {
                    "key": "hLeezvUp9tcIqItTUsCmT1IFclvX37aI",
                    "name": "冬瓜",
                    "format": "jpg"
                },
                {
                    "key": "T3GqN2bAUrgYP3PZRnJE891R500UTHR8",
                    "name": "向日葵",
                    "format": "jpg"
                }
            ]
        }
    ],
    "composer": []
}