{
    "error": false,
    "course": {
        "id": 485,
        "subject": "HART",
        "code": "1027",
        "name": "Fundamental Techniques in Stage Movement",
        "description": "This course introduces students to the theories and physical practices of stage movement and the development of non-verbal communication skills. Through a multitude of exercises, students will learn to explore movement and their own body in a group context, and realize how movement is generated from emotion and reflects emotion. Students will also learn how to relate movement with space, use their imagination to explore movement, and the techniques to utilize the body for effective communication. The course also focuses on continuous training on flexibility, coordination and physical strength, so that the body is physically and mentally fit for sustaining performances.",
        "categories": [
            "Common Core (Arts)"
        ],
        "website": null,
        "credits": 1,
        "semesters": [
            1810,
            1630,
            1530
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.33,
        "rating_teaching": 4.67,
        "rating_grading": 4.67,
        "rating_workload": 4.33,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 277,
                "name": "TANG, Cheong Wai",
                "count": 1
            },
            {
                "id": 278,
                "name": "LAM, Yin",
                "count": 1
            },
            {
                "id": 953,
                "name": "NG, Shiu Hei Larry",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "bdjSuv3t550SrYPrMPKILxjecm3EdQeh",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 277,
                    "name": "TANG, Cheong Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kaye",
            "date": "May 12, 2019",
            "title": "",
            "comment_content": "Contents are quite interesting, which covers the masterpieces of physical theatre and some fundamental technique to express emotion and narrative with physical movement.",
            "comment_teaching": "The instructor is a very experienced actor in this field and very passionate about what he was doing. Adequate help and encouragement were provided basically in the class.",
            "comment_grading": "The grading is ok. <br />Participation and final project are very important.<br />Keep interacting with and giving feedback to your classmate and the instructor can mean a lot. And also, DO work on your final piece because it will be video recorded could be a sweet memory (and sure it matters a lot to the final grade).",
            "comment_workload": "The workload is acceptable.<br />You don't need to read extra material or prepare a lot before every course. Just relax and enjoy! The final essay is also not very difficult.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9wIhzvA6re9DipRONiT72fVUel6OEpiC",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 953,
                    "name": "NG, Shiu Hei Larry",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Singh",
            "date": "Aug 22, 2018",
            "title": "Relaxing along with a credit",
            "comment_content": "You touch on basics every lesson and practice on movements during the lesson. <br />There are readings every week but you can just quickly skim through them if you are really interested in them.",
            "comment_teaching": "There are very few people who are actually interested in the subject but you just have to listen to the professor on what he has to say and follow the steps to practice your movement in a conscious manner.",
            "comment_grading": "Class Participation and attendance (15%); Attendance matters so try to attend all.<br />Weekly Class‐based Exercises (20%); Show that you understand what the professor is teaching through your movements during the practices in class.<br />Critical Commentary (30%); Write an essay over what you learnt technically and reflect on your learning progress throughout the semester.<br />Short Movement Performance (35%); Prepare a performance (of just about anything) to show that you have included the techniques taught <br />in class",
            "comment_workload": "Very light<br />Pretty much can come to the class totally chilled; the only thing to worry about is the commentary but it's not tough as long as you listen and observe in class.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hx7OfaVGmkWs1akwTypLT62C4G9obrbW",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 278,
                    "name": "LAM, Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JGatsby",
            "date": "Feb 07, 2017",
            "title": "Light and Stress relieving",
            "comment_content": "The class takes shape much like a generic drama class, with a focus on practically trying out stuff. As it is just a 1 credit course, it just briefly touches upon a lot of ideas about drama an stage movement but doesn't explore them in any depth.<br />Attendance is pretty much mandatory and ties directly to your grade.",
            "comment_teaching": "Excellent. She has a very hands on approach to teaching the class, and really promotes interaction between classmates. With the casual atmosphere maintained in class, it feels like you are just hanging out with friends rather than taking a course.",
            "comment_grading": "Relatively easy to score well. Attendance and class participation make up the lion's share of the grade. There is also an essay and a presentation. The essay is in the form of a reflection and is graded based on content rather than writing.",
            "comment_workload": "A bit more than one would expect from a 1 credit course. There is an essay and a final group presentation. The presentation is in the form of a mini skit and would require you to meet up with your group outside of class at least once to practice.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}