{
    "error": false,
    "course": {
        "id": 493,
        "subject": "HART",
        "code": "1036",
        "name": "Introduction to Graphic Design",
        "description": "Graphic design is the art of communication through the combination of images and words into a unified form to convey a clear message to an audience. Common uses of graphic design include logos, signs, publications, posters, print advertisements, product packaging and web sites, etc. This course aims to introduce students to what graphic design is and the design process. The basic elements, principles and process of graphic design will be explored and illustrated by works of famous graphic designers. Through the problem-solving approach, students will learn how to apply the design basics to create graphic design solutions. Although the course is focused on printed matter, design for the screen such as web sites will be discussed. Class time is devoted to lectures, exercises, and critiques where students are asked to evaluate each other’s work. Such evaluations are very important in the development of analytical thinking and communication proficiency.",
        "categories": [
            "Common Core (Arts)"
        ],
        "website": null,
        "credits": 1,
        "semesters": [
            2130,
            2040,
            2030,
            2010,
            1940,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"ISDN\" data-code=\"3200\" href=\"/review/ISDN3200\" target=\"_blank\">ISDN 3200</a>",
        "rating_content": 4,
        "rating_teaching": 3.67,
        "rating_grading": 3.67,
        "rating_workload": 2.67,
        "review_count": 6,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 285,
                "name": "LO CHOI, Yuet-ngor Alice",
                "count": 3
            },
            {
                "id": 1301,
                "name": "LAU, Brian Yee Huan",
                "count": 2
            },
            {
                "id": 813,
                "name": "CHOI, Yuet Ngor",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "s3TgiZ6HrG00f2oOX9omtjOTOyHDZiJ5",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 1301,
                    "name": "LAU, Brian Yee Huan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "charmingfishust",
            "date": "Aug 30, 2020",
            "title": "係真心睇佢鐘唔鐘意你啲style",
            "comment_content": "幾正。學好多線條/字型(typography)/ pattern野。我呢個sem係zoom上嘅, 所以好多堂上exercise都係網上share screen出黎比大家睇。<br />佢會就住每個人嘅exercise比comment, 甚至會即時比啲類似designer嘅名比大家參考同埋自己做下research~ <br />每堂嘅ppt唔會太多，以inspire大家嘅project idea為主",
            "comment_teaching": "成日笑同埋好friendly。問咩問題都樂意答你, 係一個幾chill 嘅 instructor。<br /><br />每個element都好詳細咁講，有時會用自己design嘅作品解釋添 ～",
            "comment_grading": "其實應該係subjective架 <br /><br />我頭幾堂直程無上到 因為唔知自己成功reg左 (嗰時知道左仲好頭痕 因為有intern番緊但又要顧埋呢度 好想drop -.-) 好啦 之後一join已經係講哂大部分design elements,自己就睇番lecture vid咁 <br />佢地已經講緊project 1st idea, 所以一去到 我第一次講野就係present project idea, 當然唔完善 因為好多野太簡陋 (佢唔鐘意電腦standard哂嘅字體 因為比人感覺重覆好悶) <br /><br />之後我跟住佢講嘅去改 research哂佢比我嘅designer 用左好多佢地啲element <br />畫的野都唔係好designer嗰隻 反而係幅野玩直接啲 真心唔係artistic路線 (班上都好多artistic的international大大 係好勁的 ) 可能因為畫風構圖特別怪異 佢又幾buy 於是定左final design 之後幾次present/comment session 佢都無太多野想我執 <br />唔知其他人咩grading 但睇得出大家都比心機做呢份 project<br />利申 最後 a-",
            "comment_workload": "幾次堂上exercise, not compulsory i think,<br /><br />每堂attendance compulsory 遲join早走會mark低扣分 <br /><br />project (1 poster about social issue OR Lp cover OR book cover+ 1 content page)<br /><br />project report (submit after present)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AzDM0g7pJFZj8AeWxiZuoRMh3viQCmwH",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 285,
                    "name": "LO CHOI, Yuet-ngor Alice",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "soy",
            "date": "Sep 10, 2019",
            "title": "quite heavy workload but interesting class",
            "comment_content": "(唔想睇英文geh 下面有Google translate 中文版)<br /><br />Interesting content<br />You will learn graphic design and create a poster in the end for the HKUST library.<br /><br />First few lesson is about:<br />Basic technique of Graphic design, including <br />1. Components: line, shape, space, etc.<br />2. Technique: Contrast, illusion, etc.<br /><br />有趣的內容<br />您將學習平面設計，並最終為香港科技大學圖書館製作一張海報。<br /><br />前幾課是關於：<br />平面設計的基本技術，包括<br />1.組件：線條，形狀，空間等<br />2.技巧：對比，幻覺等",
            "comment_teaching": "(唔想睇英文geh 下面有Google translate 中文版)<br /><br />She is a nice teacher, willing to answer all your questions. <br /><br />For the assignment part, she will let you try to do the assignment first. She will give you comments on the second lesson after the hw is given. Then, you will know what exactly she want you to do. Then, you make a edited one (new ver. of your work) and keep it in the lab log will be fine.<br /><br />她是一位好老師，願意回答你的所有問題。<br /><br />對於作業部分，她會讓你先嘗試做作業。 在給出hw之後，她會給你關於第二課的評論。 然後，你會知道她到底想要你做什麼。 然後，您製作一個已編輯的（您的工作的新版本）並將其保存在實驗室日誌中就可以了。",
            "comment_grading": "I think the B range is infinitely large.<br /><br />B range 無限大。",
            "comment_workload": "1. Participation marks (+ impression marks):<br />one small assignment per week eg. drawing different kinds of lines, designing a small logo, making a business card, etc.<br /><br />2. ***Most essential***:<br />You will have to hand in the lag log with all your work so far at the end of the course. You have to add comments/ what you have learnt from the class into the lag log.<br />（The earlier you start to do, the easier it is. ）<br /><br />3. Group project: making a poster for the HKUST library<br />You will have about 4-6 lessons for the poster so you have plenty of time.<br /><br />1.參與分（＋印象分）：<br />你必須交出一個小任務，比如繪製不同類型的線條，設計小徽標，製作名片等。<br /><br />2. ***最重要的***：<br />到目前為止，在課程結束時，您將不得不提交所有工作整合的日誌，將從課程中學到的內容添加其中。<br />（越早開始做，越容易）<br /><br />3. 小組項目：為科大圖書館製作海報<br />你將有大約4-6課的海報，所以你有足夠的時間。",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qCJ5xUl3BHyooW6bL0cuKQ1VRf7EuPFz",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 1301,
                    "name": "LAU, Brian Yee Huan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "katie hei",
            "date": "May 16, 2021",
            "title": "Introduction to graphic design",
            "comment_content": "Not much content to be taught actually, half of the lessons are critiques.",
            "comment_teaching": "The teaching style can still be improved, I often cannot catch main points or receive very constructive feedbacks from this instructor.",
            "comment_grading": "I got a B in the class and I think it's quite fair because I didn't work as much comparing to some other students in the class.",
            "comment_workload": "The workload depends on your self-motivation. If you do little, the instructor will not force you to do more. He just gives you comments regarding to the work you handed in",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NlzeSAvgos2EvhJ36xmvYY689xlFGKSB",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 285,
                    "name": "LO CHOI, Yuet-ngor Alice",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "zoeyingso",
            "date": "Jun 01, 2018",
            "title": "Very bad grading",
            "comment_content": "It was fun, to be pretty honest. <br /><br />Presentation<br />Group Projects<br />Exercise<br />Attendance<br />Essay (1000+ words)<br />Lablog (documenting all the exercises and written reflections are required for every lesson as well)",
            "comment_teaching": "The Lecturer was really subjective and you will not be able to know and understand her standards.",
            "comment_grading": "NO ONE in this course got A Range in this semester as proven by the TAs!<br /><br />It is WORTHLESS to attend all of the classes! <br /><br />Just try to pretend and answer a lot of questions then you can get better grades, I have attended all classes, signed up for all classes, yet, the participation mark was only 50%. It was undoubtedly, worthless since I have emailed the TAs, and they said the attendance was only used as the references. Frankly speaking, I was not very active in answering questions in class, but I have taken up the role of presenting the group projects, completed all exercises, answered several questions in class, I do not believe that this have been ruining the grades. <br /><br />Really furious.",
            "comment_workload": "As a one credit course the time spent one that was even more than a four credit course. Weekly, there will be at lease 1 exercise that demands hours of time to work on it, I was really intrigued by the content and have spent more than 3 hours per week for the exercises. <br /><br />Every class, presentation of your design is required and the attendance will be recorded. However,",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "32qsLbPVeDO25EJrjE1R9w522eubfGfA",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 813,
                    "name": "CHOI, Yuet Ngor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "iamwildcat",
            "date": "Apr 12, 2017",
            "title": "Easy intro to Graphic Design",
            "comment_content": "Basic Graphic Design principles.<br />Usage of points, lines, shapes, colours etc<br />Elements of contrast, focus, repetition &amp; spacing.<br />Small introduction to typography and layout design.<br />Final project to implement all that you've learned into a poster design for a campaign (you'll need to present your initial idea, progress presentation, make the poster itself, submit a group project report and record all you've done in a logbook)<br />Also includes software workshop on Photoshop and Illustrator, not compulsory if you already know them.<br />There is also a lesson where a guest speaker, who is himself a graphic designer, came and shared his experience in working in the field, giving us a glimpse of how graphic design works in real life.",
            "comment_teaching": "Alice is a very nice tutor. Her tone is comfortable and at the same time encouraging to students.<br />She is very experienced in the field of Design Education and has been affiliated to HKPU Design School for quite some time.<br />Since the class is small, she is always willing to give us useful comments on our draft designs. Some may find it critical and nitpicking, but in the field of Design, taking critics is a major part of your job, so get used to it.",
            "comment_grading": "Easiest A range in my life.<br />Mind you, I do possess drawing and design background,<br />and I do have a passion in pursuing graphic design as a career.<br />Spend more time polishing your products and it will be worth it.<br />Final Grade: A+",
            "comment_workload": "This should have been a 3-credit course, that's all I'm going to say.<br />Every week we have a small assignment, namely information research, typography design, poster revamp, name cards etc.<br />You'll have to present your drawing in front of class every week.<br />And put them into a logbook.<br />The logbook is essentially all things you've done in the course, plus personal reflections and comments.<br />The group project accounts for a huge part of the course and grades. Things you'll need to do<br />- Initial idea generation.<br />- Present ideas in mind map (specific form)<br />- Progress presentation<br />- Make the poster itself<br />- Presentation on final poster<br />- Give comments on other's poster<br />- Submit a group project report<br />- Record all stuff you've done on to logbook<br />**TAKES A LOT OF TIME***",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oIka3KC2ZT9315T0vXoPV5IBfWDptIYh",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 285,
                    "name": "LO CHOI, Yuet-ngor Alice",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Charmian",
            "date": "Aug 23, 2015",
            "title": "Pretty interesting course but a little bit of a let-down",
            "comment_content": "I entered this course because I thought I would have been able to learn more computer-related design skills such as Adobe Photoshop and other design tools. Surprisingly, it was mostly about theories in graphic design and the only time we got to learn design programs (Adobe Photoshop and Illustrator) were in 3 supplementary workshops after the classes. So if you are looking for a class to learn more about design programs, this probably isn't the course for you.",
            "comment_teaching": "Alice overall is an okay instructor, but be prepared to jot down notes in this class, because her slides are picture-heavy and thus she says she cannot give it to us due to the pictures' copyrights.<br /><br />Personally I feel she's a little forceful on opinions when this is supposed to be a more 'creative' class and that she might be prejudiced to those who can draw reasonably well. She does tend to miss people out during discussions and end discussions so it's probably better to be more proactive in discussions as it seems to affect class participation grades greatly.",
            "comment_grading": "Grading is based on class participation, your logbook, weekly assignments and of course, the group project. Heavy percentage on the group project and weekly assignments.",
            "comment_workload": "There's always a take-home assignment after class every week, which is graded and is normally used for class discussion. <br /><br />A logbook is also required in this class, where you chart down your design ideas, reflections and assignments as well as project progress. This does take some time to do so it's recommended that you update it weekly.<br /><br />There is also the class project, in which when I took it was to design a poster to encourage more reading in the UST library. This will be done over the entire semester in groups of 3-4 people. <br /><br />So it's considerably pretty heavy workload although no midterms or finals for a 1-credit course.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}