{
    "error": false,
    "course": {
        "id": 557,
        "subject": "HUMA",
        "code": "2280",
        "name": "Identity Goes Global: From Border Crossing to Boundary Remaking",
        "description": "In this increasing global and transient world where people from different cultures and nationalities interact on a more rapid and frequent basis, how is one's \"identity\" affected and renegotiated, and what factors affect its formation, re-formation as well as transformation? When one's identity is no longer confined by one single bloodline, race, ethnicity, nationality, language or culture, how can one make sense of the multiple facets within his/her cultural, national or linguistic identity? Is there such a thing called \"global identity\" and how can one understand it with a more comprehensive and creative approach? To answer these questions, this course will introduce key theories, discourses and writings on the physical experiences of \"border crossing\" and the academic \"clearing\" and \"remaking\" of boundaries in the study of identity across different disciplines. Through these texts, this course will not only bring to light the complexity of hybrid identities in an age of globalization but also encourage students to think critically about the factors that have influenced and will continue to affect the nature their own identity.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            1830,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 3,
        "rating_workload": 1,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 306,
                "name": "SHAW, May-yi",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "JgyR844FvF2eGY1Or7iZHYhSYoDcQYYb",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 306,
                    "name": "SHAW, May-yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HANKSU",
            "date": "May 07, 2019",
            "title": "Workload is heavy but Worth it",
            "comment_content": "covers a lot of topic regarding identity. like nation states, globalization, gender, culture, religion, language, age, etc.",
            "comment_teaching": "Professor Shaw is a good facilitator in class. Her English is also quite good.",
            "comment_grading": "haven't finished class yet. wish me luck.",
            "comment_workload": "1.need to catch up on the readings.<br />basically, I spent 1 hour on every working day to read the materials<br />2. 4 journal entries throughout the semester and 1 final paper, so there's a lot of writing to do as well.<br />3. pop quiz on class forces you to understand all the readings.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}