{
    "error": false,
    "course": {
        "id": 507,
        "subject": "HUMA",
        "code": "1100",
        "name": "Music of the World",
        "description": "This course surveys various folk and traditional musics of the non-Western world using an ethnomusicological perspective which involves studying how people make, perform and consume music in their respective cultural contexts. Music cultures will be discussed individually in turn, while maintaining a cross-cultural or cross-regional perspective so as to discern underlying themes and processes common to many of them as well as differences and points of divergence that make each one unique.",
        "categories": [
            "Common Core (H)",
            "Common Core (Arts)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.8,
        "rating_teaching": 3.87,
        "rating_grading": 3.67,
        "rating_workload": 3.26,
        "review_count": 61,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 304,
                "name": "DROSCHA, Isaac David",
                "count": 44
            },
            {
                "id": 1650,
                "name": "DUJUNCO, Mercedes Maria",
                "count": 8
            },
            {
                "id": 1305,
                "name": "PAGE, Timothy Markham",
                "count": 6
            }
        ]
    },
    "reviews": [
        {
            "hash": "EzL69Kprxd3GvkspDGBxFqhLNJ8dR7fM",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1650,
                    "name": "DUJUNCO, Mercedes Maria",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "hatsunemiku",
            "date": "Oct 18, 2022",
            "title": "Stay away from this teacher. Isaac is much better than her.",
            "comment_content": "Music of the world. Music 10%, world 90%.<br />I think it is better to name this course GEOG1100,<br />if it introduces the worldwide map, reciting historical readings from different countries rather than saying something more related to music.<br />You will learn nothing about music, but it may be perhaps interesting to geography students.",
            "comment_teaching": "Boring and she tries to mock students if they can't answer her questions.<br />How come she spends more than half of a lesson randomly asking students questions, without introducing new stuff? Am I attending a high school geography class?",
            "comment_grading": "Suppose to be poor grading, the grading scheme is not transparent and clear. I regret taking this course and even the midterm.<br /><br />Attendance, shitty strict attendance. She uses the iPRS system to record attendance, at 9 am sharp. You will only have one minute to take attendance. If you arrive at 9:01...ummm sorry you missed the access code, please arrive more early next time! Remember not to go to the toilet before taking the attendance.",
            "comment_workload": "Assignments per week but don't count towards the final score.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 11,
            "vote_count": 13,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "yUiT0Warq6scqIX1JezZQx2EnuHfw3Fj",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1650,
                    "name": "DUJUNCO, Mercedes Maria",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Bael",
            "date": "Dec 30, 2022",
            "title": "Useless course content + terrible instructor",
            "comment_content": "1. Introduction<br />2. Music of Islam<br />3. Music of India<br />4. Music of Bali<br />--midterm<br />5. Asian Zither<br />6. Music of Africa<br />7. Music of Argentina<br />8. Music of Brazil<br />9. Music of Ireland<br /><br />All topics are not related to each other. All of them are just about memorization with most of the words being foreign words carrying unknown meanings that you will forget within 24 hours.<br /><br />The only useful part is the introduction which talks about the classification of instruments.<br /><br />I feel like the instructor put WHATEVER was in her mind into the course. If she likes playing Chinese Zither, then we need to learn all the Zithers within Asia and all the different play styles in China.<br /><br />You have to not only remember all the music-related things which are all so specialized and not related to each other like: All the styles of Islam music and their characteristics such as the one single person who is famous for playing one of that styles. <br /><br />But also MOST of the non-music-related things like EVERY country's names AND their geographical condition NEAR the focused country which include: South Asia, South-East Asia, East Asia(Vietnam is culturally in it according to her), Middle-East, and South America. AND all the history of all those focused countries. All of them are inside the beginning of each ppt with a world map and an essay about the history which no one cares about. If she thinks it is common sense for her, it will appear in the Exam like: Name 3 cities in the US that have the most South American people, 3 European countries colonies in South America, dance-style-related things in South America, etc. (hints: US and Euro are not near the focus country at all)<br /><br />Midterm focus more on geographical questions with no historical question while Final focus more on historical questions with no geographical question just because she likes. They account for 20% of each exam.<br /><br />Not to mention that we have to remember all the instrument names and their characteristics and their appearances.<br /><br />You have to also remember the exact specific soundtrack used in the ppt for the listening questions. <br /><br />Please learn all those languages used in every country in this course before taking this course to make the memorization less painful.",
            "comment_teaching": "&quot;She improved at the end of the semester after the HUMA&nbsp;&nbsp;division communicated with her.&quot;<br /><br />The WORST instructor I have ever seen in my entire life, and I think she is new to HKUST. She is from the Philippines and gets around the world to learn about the music culture there. However, I don't think she knows how to respect people.<br /><br />She is really BAD at teaching and EVEN WORST dealing with students. <br /><br />Always talks trash about students during the lecture only based on her own imagination like students are lazy and playing video games 24/7 even during lectures.<br /><br />Always mentions &quot;grade&quot;, &quot;attendance&quot;, and &quot;Fail&quot; every 20 mins during each lecture to give students as much stress as possible.<br /><br />If you send her an email, she will reply to you with some random stuff that makes no sense to turn you away like &quot;your quarantine order starts on the next day&quot;, the further reply will get more non-sense replies and get mad at you and said &quot;you are giving me more things to do and remember&quot; and ask some aggressive rhetorical questions with &quot;??&quot; in it which of course only based on her own imagination.<br /><br />Although she always mentions students are lazy, she did everything badly and late. <br />1. Late twice, 5 mins late at one lecture and 10 mins late at the final exam (She give a 5 mins speech before to tell us not to be late).&nbsp;&nbsp;<br />2. Return everything lately.<br />3. PPT poorly made, full of words on every page and even think she is doing well<br />4. Offer no help to students and think she being kind to us by providing us with useless materials. A list with only foreign words inside for midterm and a review table which hides most of the things and tells us to fill in the blanks, making it more useless.<br />5. The question that she prepares for the participation point is all about memorizing the course material in the previous lecture which I don’t think is aimed to encourage thinking, I think it encourages students to give up the course or to jump mushroom when she gets mad sometime when someone she picked doesn’t memorize everything before each lecture.<br />6. Professionals in not knowing how to use iPRS and do not try to learn how to use it. She has tried to use the iPRS to conduct the Q&amp;A, which I think is a great idea, but failed and has not tried again.<br />7. Good luck downloading PPT before the lecture as she will keep adding new things to them every lecture and will NOT upload them before the lecture. ~3 GB each PPT.<br />8. The grading weight on Canvas was outdated from the very beginning. You will get the correct one after the final exam.<br /><br />Some &quot;wise sayings&quot; by her:<br />1. “for those who don’t even bring a pen to class, what are you going to do? Typing in your phone? Typing will not help you remember it!”<br />2. &quot; &quot;Oh this is a music course easy pass&quot; not gonna work&quot;<br />3. &quot;This course is harder than computer science because computer science is only about coding&quot;<br />4. “those who got low grades didn’t even attend the class”<br />5. &quot;try to sleep before 12 and stop playing video games at night or texting others&quot;<br />6. &quot;Stop looking at Facebook&quot;<br />7. &quot;I am very busy and your job is only to study&quot;<br />8. “You know your grade”<br />9. &quot;Are you listening?&quot;<br />10. &quot;It is all on the PPT, there is no reason not to review them&quot;<br />11. &quot;You are giving me more things to do and remember, especially considering there are so many of you and only 1 of me.&quot;",
            "comment_grading": "Class attendance &amp; active participation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;15%<br />Written assignments&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />Midterm exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;25%<br />Concert Review&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;25%<br />Final exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;25%<br />Absolute grading<br /><br />You will only get a good grade when you are able to memorise all the foreign words and everything in the course for the exam.<br /><br />Answering more questions during lectures will give the student a grade boost according to her but nobody knows how it is work. She will give you active participation points when she likes. No point will be given most of the time if you answer the question by actively raising your hand.<br /><br />Written assignments are easy to do and everyone can get full marks.<br /><br />Concert Review has an unknown grading scheme<br /><br />I don't think she has an attendance record at all when some people didn't attend most of the lectures and the lowest attendance score is still 90/100. Where are those students that she mentioned that &quot;is in trouble&quot; during the lecture???",
            "comment_workload": "Very high workload<br /><br />Attending her lesson is mental suffering, turns out that she does not have the correct attendance record at all.<br /><br />Two required concerts are suddenly announced half weeks before the actual event and they are held just before the midterm period.<br /><br />Not to mention that some other CC courses only have one essay or only exams",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 3,
            "attachments": []
        },
        {
            "hash": "39uFQYvFBQIUa6ZEX7VcwSHQpyfKhGfI",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1650,
                    "name": "DUJUNCO, Mercedes Maria",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "天音かなた",
            "date": "Oct 27, 2022",
            "title": "Weird Course",
            "comment_content": "It covers Islamic, South Asian, Southeast Asian etc. music. It covers some cultural background of music genres and why music have developed a certain way in a region. It also introduced some elements of music that are unique to that culture like Raga, as well as instruments of that culture. There is an emphasis on classifying instruments which I don't find necessary given that the course discusses culture a lot. There might be too much &quot;facts&quot; given for musical genres that you have to remember for exams.<br />I have interest in culture and music but I still find this course quite lacking! The instructor is from South Asia and there is quite some bias in content. Previous semesters seem to have covered music of people of colour which I looked forward to when I registered! Also the instructor want to cover a lot of cultures and end up giving a bit of information for you to memorize for exams that are completely unrelated to everything else. It is almost like I am learning foreign vocabulary.<br />There can also be some modern-er music covered. All the music genres covered are like a millennia old. Me and the other guy who reviewed this course would appreciate some vocaloid history. People should know that Yonezu Kenshi is Hachi instead of some Burmese music.",
            "comment_teaching": "While I respect the instructor for her research and hard work in ethnomusicology, she is not a great teacher. She seems to want students to be interested in course materials such that she reacts rather hostilely to students who do not show interest. To get students &quot;interested&quot; in the course she ended up picking people and asking them about lecture content (graded) before commencing with the lecture. As another review mentioned, she does not respect students who fails to answer her questions.<br />In terms of how a lecture goes, it starts with question time, then some lecture and playing some music. Sometimes there are some singing and clapping when learning scales and rhythmic patterns.",
            "comment_grading": "There is:<br />Participation<br />Small Assignments<br />Concert Review<br />Midterm<br />Final<br /><br />There is no indication of the weighting of each task!<br /><br />Participation includes attendance and the aforementioned random quizzing.<br /><br />The small assignments are literally impromptu. The instructor might suddenly go &quot;a-ha&quot; and announce an assignment out of the blue, but those are easy.<br /><br />The midterm is pure content memorization. My score is not bad but I attended every class and actually needed to reviewed lectures.<br /><br />The concert review is for you to show that you listened in class. Instructions are quite clear. Score should be good if you follow instructions and use some terms taught in class.",
            "comment_workload": "Workload is quite high for a common core course. I guess most students who registered for this course only for a good timetable and CC credits are shitting themselves. As mentioned there are graded random quizzing, the midterm is basically memorization, and there is also a concert review. Not to mention the IPRS attendance. Don't take this course if you just want CC credits.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZrCYlFde0ZIvwRkc1aCNdhhWMAYIdJi9",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "angelayyt726",
            "date": "Jan 14, 2018",
            "title": "Good grade course as long as you work hard",
            "comment_content": "Music of the world including Africa, Black America, Arab, Latin, India, China. And also some basic music knowledge. Not hard even for those who are not familiar with music. You need to know the characteristics of the music in those region and apply them to the listening track.",
            "comment_teaching": "Quite good. Although the content is somehow boring, the professor tried very hard to make it more interesting. He will ask questions and say some jokes. The best thing is that he will always extend the deadlines of the assignments and quizzes when somebody tells him that more time is needed.",
            "comment_grading": "Absolute grading. You need to work hard for the mid-term and final in order to get a very good grade. <br /><br />A+&nbsp;&nbsp;&nbsp;&nbsp;&gt;98<br />A&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;93-97<br />A-&nbsp;&nbsp;&nbsp;&nbsp;90-92<br />B+&nbsp;&nbsp;&nbsp;87-89<br />B&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;83-86<br />B-&nbsp;&nbsp;&nbsp;&nbsp;80-82<br />C+&nbsp;&nbsp;&nbsp;77-79<br />C&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;73-76<br />C-&nbsp;&nbsp;&nbsp;&nbsp;70-72<br />D&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;58-69<br />F&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;58<br /><br />I got 64/70 in mid-term and 91.5/109 in final. I got an A-.",
            "comment_workload": "Quite heavy I will say. You need to hand in a 1500 words case study and a 750 words concert report. However you only need to follow the samples given and check your grammar. The professor will give you high marks for the two assignments as long as you fulfil the requirements, accurate in grammar, and with a pretty design for the document you handed in. You will also have 5 quizzes through out the course. Try to get full marks.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9Dk6yIG4jYrHmlqTlQb5ndup7kE9UJzd",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1650,
                    "name": "DUJUNCO, Mercedes Maria",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "klblee",
            "date": "Jan 05, 2023",
            "title": "",
            "comment_content": "Course modules:<br />1. Fundamental issues<br />2. Aural analysis<br />3. Music in the Islamic world<br />4. Classical music of India<br />5. Gamelan music of Bali<br />6. Southeast Asian Gong-chime cultures<br />7. East Asian Zither Traditions<br />8. Music of sub-Saharan Africa<br />9. The Argentine Tango<br />10. Music of Brazil<br />11. Irish Music<br /><br />This course introduces a lot of music cultures around the world. It also introduces the background as well as the musical instruments of the culture. However, it mainly focuses on the memorisation of the musical instruments which I found it quite useless. <br /><br />Overall, I dont recommend this course unless you are very good at&nbsp;&nbsp;memorising.",
            "comment_teaching": "The professor is very knowledgeable about different music cultures. But most of the lectures are very boring as she provided way too much information in every lecture. Also, she started with asking students a lot of questions about materials in last lectures so you need to spend some time to study.",
            "comment_grading": "Class attendance &amp; active participation (IPRS)15%<br />Written assignments&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />Midterm exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;25%<br />Concert Review&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;25%<br />Final exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;25%",
            "comment_workload": "workload is quite high for the preparation of the exams as you need to memorise a lot of musical instruments and listen to different music so that you can identify them in the exam.<br /><br />For the assignments, there are only 3 assignments that are very easy in the whole semester. <br /><br />In the middle of the semester, you have to attend a workshop and watch a concert. After that, you need to write a 3-page concert review. Make sure you send a draft review to the prof.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BwgUUJOFeDlgqPwnQ4rDuk3kXfX4ZtE0",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1650,
                    "name": "DUJUNCO, Mercedes Maria",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "//Snow.",
            "date": "Dec 17, 2022",
            "title": "Average course, toxic prof",
            "comment_content": "&quot;This course surveys various folk and traditional music of the non-Western world.&quot;: funny enough, you will mainly recite instruments' names and geographical information such as the country's name, not much music is seen in this part.<br /><br />Course modules:<br />1. Fundamental issues<br />2. Aural analysis<br />3. Music in the Islamic world<br />4. Classical music in India<br />5. Gamelan music in Bali<br />6. SE Asian Gong-chime cultures<br />7. East Asian Zither Traditions<br />8. Music of sub-Saharan Africa<br />9. Argentine Tango<br />10. Music of Brazil<br />11. Irish Music<br /><br />If you love to recite non-English words, go for this course",
            "comment_teaching": "I appreciate her knowledge and preparation for the lesson, but she loves to mock students when they cannot answer her questions. She also expects us to love the course as much as she does and hope we devote most of our time to it, yet students actually have other courses and shits to deal with :/",
            "comment_grading": "Attendance 15% (IPRS)<br />Pop quiz 10%<br />Midterm 25%<br />Concert review 25%<br />Final 25%<br /><br />Attendance is strict af, if you are late for 5-10 min you may have lost that attendance. o yea no toilet before or during when she take attendance, she may mock u<br />Quiz time at the start of each lesson, shes gonna call your name, may cause you to feel nervous or stressed when she stares at you if you cannot answer the questions, not gonna mention on how toxic she will be when you cant satisfy her :)<br />Midterm and final is a recitation quiz, if u rmb foreign instruments' names and their classification, u r gonna get grades ard mean<br />The concert review is an essay, you jus review on what you have listened with guidelines, but the concert u listen to is Gamelan, so gdluck on that",
            "comment_workload": "not much, but you better prep for the next lesson as she may pick you to answer her questions.<br />the concert review may be a headache as you have to think of some random bs to get to 3 pages lmao",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Jnp1TR3YO8lmFgoPBVM0YPFb9HbkcnnU",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1650,
                    "name": "DUJUNCO, Mercedes Maria",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Lu Baseio",
            "date": "Feb 14, 2023",
            "title": "Not a horrible class but HORRIBLE professor",
            "comment_content": "To be honest this course seemed heavily focused on music rather than humanities. It was very memorization heavy including memorizing instruments, music, and countries (although this was not a geography class).",
            "comment_teaching": "Much like other reviews have stated she is a HORRIBLE professor. Although very knowledgeable about the content and clearly very well educated and well travelled, she does not know how to teach a class full of college students. She always had a permanently condescending tone and constantly scrutinized and scolded students for a multitude of reasons, sometimes just petty reasons such as going to the bathroom during class, but often times she would respond very harshly to students who could not answer her questions, and even treated local students as though their English fluency was inferior to hers. To put simply, she appeared as though she hated her job every single day and decided to take it out on her students. She called on a handful of students every class to answer questions about the previous lecture and was very harsh when they got the wrong answer. Her power points are terrible, filled top to bottom with heavy paragraphs and she never made it clear what information would be tested on and then right before the exam we would be forced to read paragraphs on paragraphs trying to memorize all of the content.",
            "comment_grading": "The professor was very detail-oriented and always wanted very specific answers, thus a very harsh grader. The professor took attendance very seriously, although did not always allow enough time for students to fill out the iPRS attendance question.",
            "comment_workload": "Not a lot of out-of-class work other than studying and memorizing a bunch of songs and instruments.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eTQNuqkdlaS7mWHYKM16zrFGq7foNZ2v",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "helloust12345",
            "date": "Jun 30, 2021",
            "title": "Quite heavy workload for a CC but grading was ok",
            "comment_content": "Basically teaches music culture in different parts of the world, China, Africa, Arab etc.. What kind of instruments they use, characteristics of their music culture...<br />Everything is pretty straightforward and easy to understand, but could be confusing if you're not familiar with the content,",
            "comment_teaching": "The professor is quite nice. He uses a lot of videos, music recordings and stories to help you understand the content better, which could be nice if you're genuinely interested in the topic. But personally I just watched the recordings before the exam, which helps me understand everything better.",
            "comment_grading": "Attendance 10/10 (Mean:8.84)&nbsp;&nbsp;&nbsp;&nbsp;10%<br />it says the attendance score is calculated based on zoom logs and in class participation. You can miss 3 classes at most. In the beginning of the sem, a lot of people turned on the cams. But many didn't after some time. I wasn't super active throughout the sem, probably answered a few questions throughout, sometimes i just type something random in the chatbox lol<br /><br />Quiz (5 quizzes, 20 MCs each) 98/100&nbsp;&nbsp;&nbsp;10%<br />The quizzes are generally quite easy, you can pretty much get all of the answers from the slides even if you didnt listen in class<br /><br />Discussion (5 discussions, 2 marks each) 10/10&nbsp;&nbsp;&nbsp;&nbsp;10%<br />You just have to type a short discussion post and also post a 30-50(?) words reply. It's pretty easy, you get the marks as long as you complete it, doesn't matter what you type lol<br /><br />Case study&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Proposal 9/10<br />Actual case study 47/50<br />Basically you have to choose a particular music culture/topic you're interested in. Then you have to submit a very simple 1-2 page proposal . And by the end of the sem you have to submit a 10 min video introducing that topic. You will also have to submit sth called a listening guide, where you basically include a recording and note down certain musical characteristics at different parts of the song. The proposal should have very little effect on your final grade but im not sure about the exact percentage. <br />Overall i feel like its a pretty complicated task(?). You have to choose a topic thats easy to research for. It also helps if its sth youre genuinely interested in. It used to be a 1500 word essay in the past but the prof wanted to do videos this year lol. In the end i think it took me around 3 days to complete the video.<br /><br />Midterm 68/70 (mean:60.94)&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Midterm was open book and quite easy in my opinion. Pretty much everything was taught in class / from the slides. I watched through all the videos before mt and that also helped.<br /><br />Final exam&nbsp;&nbsp;&nbsp;&nbsp;30%<br />Part 1 MC 38/40<br />Part 2 fill in the blank 40/40<br />part 3 listening 26/28<br />Part 4 essay 18/20<br />Total 122/128 (mean 106.81)<br />Final was a bit harder than the mt and also open book. I also went through all the recordings before the exam and I think it really helps if you try to summarize the characteristics of each music culture on your own. It can be quite confusing sometimes. It also makes it easier for you to look up for answers.<br /><br />final grade A",
            "comment_workload": "Overall workload is acceptable but considerably heavy for a cc. I took this cuz I didnt have any other choice and all the popular huma courses were full. There were many different tasks to be done (quiz, online discussion, case study...) and i think its expecting a bit too much",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rTa2kRFBbv2L979Xh6KUNLvzel5Mr4ZL",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1305,
                    "name": "PAGE, Timothy Markham",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lllllam",
            "date": "Jan 16, 2020",
            "title": "",
            "comment_content": "A literal course about music from different parts of the world. A variety of styles, culture and histories can be learnt in this courses from different parts of the world",
            "comment_teaching": "The professor teaches relatively well, loves to ask and answer questions, and really eager to teach students",
            "comment_grading": "The grading is ok, the professor does give grades correspond to students' hardworks and understandings towards certain topics and assignments. And some suggestions and feedback are given to students.",
            "comment_workload": "Workload is a little too much, with quizzes, concert report, music case study and 2 exams",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5EMGtafMFsfHcBpLHtXAaEGJnvEzhB9x",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Veronica Chow",
            "date": "Jan 19, 2018",
            "title": "Intersting, deep course",
            "comment_content": "Talks about music from different cultures. Each topic covers history (brief), the instruments, musical characteristics, cultural implications, example musicians and songs.<br />The course really helped me understand different music concepts and appreciate other cultures.<br />You better have some basic musical knowledge (e.g. basic musical theory) and a rather sensitive ear. Need to memorise TONS of stuff, esp. foreign words. I wrote 76 A4 pages of notes for this course.<br /><br /><br /><br />Introduction to music culture<br />- what's music / how to define music<br />- terms for music culture<br />- basic music theory &amp; music terminology (e.g. beat, tempo, pitch, ornamentation)<br /><br />Africa<br />- Agbekor / Ewe<br />- Dagbonli<br />- Mande<br />- Shona<br />- BaAka<br /><br />Black North America<br />- Black Secular music<br />- Black church<br />- work songs<br />- blues &amp; their variations (e.g. soul, rock 'n roll)<br /><br />South America<br />- Nueva Canción &amp; musicians<br /><br />Latin America<br />- Kallawaya<br />- Quichua<br />- Chota River Valley<br />- Afro-Peruvian music<br />- Ecuador<br /><br />India<br />- South &amp; North Indian classical music (extremely complex &amp; long, so many words to memorise)<br /><br />The Arab World<br />- prayer calling<br />- the Maghrib:<br />&nbsp;&nbsp;&nbsp;&nbsp;- Ladino<br />&nbsp;&nbsp;&nbsp;&nbsp;- Morocco<br />&nbsp;&nbsp;&nbsp;&nbsp;- Levant<br />&nbsp;&nbsp;&nbsp;&nbsp;- Bendouin &amp; epic poetry<br /><br />China<br />- general traditional music<br />- Sizhu ensemble<br />- Beiguan<br />- folk songs:<br />&nbsp;&nbsp;&nbsp;&nbsp;- ceremonial<br />&nbsp;&nbsp;&nbsp;&nbsp;- work song<br />&nbsp;&nbsp;&nbsp;&nbsp;- opera<br />&nbsp;&nbsp;&nbsp;&nbsp;- Suzhou Tanci (蘇州彈詞)<br />&nbsp;&nbsp;&nbsp;&nbsp;- Shidaiqu (時代曲)<br />&nbsp;&nbsp;&nbsp;&nbsp;- Cantopop",
            "comment_teaching": "Great professor with a sense of humour.<br />I love how he talks about music and its culture, e.g. a lot of characteristics in Chinese music link to the emphasis on balance and morals in Chinese culture. He also talks about cultural homogenisation and ethnocentrism.<br />Always encourages in-class discussions, e.g. how we define music, what makes one culture more superior than another. Really gets you thinking.<br />Extremely flexible with deadlines &amp; course grades. I asked for an exntension for the deadline of the case study without difficulty.<br />Gives you a lot of guidance for all graded stuff, but still depends a lot on your efforts.",
            "comment_grading": "- random attendance taking<br />- 5 quizzes + 1 bonus quiz [MC]<br /> (takes highest 5 scores)<br />- 1 concert report<br />- 1 case study<br />- 1 mid-term [70 MC]<br />- 1 final [70+ MC + 1X short Qs]<br /><br />Final:<br />- Mean = 70%, s.d. = 16<br />- 67% of the class within 1 s.d., <br />94% within 2 s.d.<br />- Highest = 96%<br /><br />Final grades:<br />A: 90-92, 93-97, 98+<br />B: 80-82, 83-86, 87-89<br />C: 70-72, 73-76, 77-79<br />D: 58-69<br />F: &lt;58<br /><br />For mid-term &amp; final, 3-6 songs from class will be played, and there'll be questions about the song's style, culture, instrument, composition, etc. Mid-term had about 10 songs to memorise, final had 14-15.<br />I've had a lot of musical experience, so the course was easy for me. It was the foreign words that got me a bit. I'm Chinese, so it didn't take much effort for the Chinese music module. Final grade = A.",
            "comment_workload": "2 lectures every week, with 1X pages of textbook reading after each lecture. I skipped all reading and was perfectly okay.<br />The course covers tons of stuff, so it was a bit overwhelming to memorise everything. Put some time into memorising stuff.<br />My secondary school had compulsory music lessons, and each year we must complete 2 concert reports, so the concert report was very easy for me. Those who haven't had experience writing about music should definitely search for music critics online / in newspapers.<br />The concert report's minimum requirement was 2-3 pages, and the case study10-12 pages, but my inner perfectionist pushed me to write 7 pages and 43 pages respectively. Got full marks for both. But you can 1000000000% definitely get the same grade within the recommended page count. The samples provided by Droscha was well within range and still got full marks.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Op13O7Rcw5mbaAxpL7kJ0jcREoMIqSDM",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1650,
                    "name": "DUJUNCO, Mercedes Maria",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bella488484v",
            "date": "Jan 30, 2023",
            "title": "DO NOT TAKE",
            "comment_content": "Content would have been ok if we had a better professor. I honestly found the class's content interesting, but because she is such a bad teacher, I couldn't enjoy learning.",
            "comment_teaching": "HORRIBLE!!!! she made me hate music. Dont take her class, switch if can a different professor. Her negative attitude overwhelms the content she's teaching.",
            "comment_grading": "Grading was fair. A good chunk of the grade depends on a simple concert review which doesnt take long.",
            "comment_workload": "She does not assign a lot of work but the class is very content heavy and you will have to memorize various random facts about instruments. Some days she would randomly pick on people and expect extremely detailed answers otherwise she would ridicule you. Extremely unprofessional.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Is639CfjKYTVZb2wI0B0EgT5Ka0fLYAh",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "7vinBB",
            "date": "Aug 31, 2020",
            "title": "",
            "comment_content": "World Music including Africa, Black America, Arab, India, China. <br />Do not need a musical background. <br />Contents are full so many different contents will be included in the examination.<br /><br />Have midterm, final, quizzes and a case study. <br />Every section will have a quiz. Content finish one country will have one quiz. The quiz has 20 mc questions. <br /><br />The midterm is all mc and also with listening mc.<br />Final has mc, fill in the blank, listening and small essay writing. <br />The case study needs you to write an essay about specific music culture and apply the knowledge learned in the lecture.",
            "comment_teaching": "Good but there are many contents and some contents may be boring. <br /><br />Explain the ideas listed in the lecture notes. <br />Listening to the music track which will be included in the examination. <br />Always raise questions and sometimes some jokes(?) <br /><br />Have attendance marks so need to attend every lecture.",
            "comment_grading": "Absolute grading. Need to work hard for the mid-term and final for a very good grade.<br /><br />A+&nbsp;&nbsp;&nbsp;&nbsp;&gt;98<br />A&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;93-97<br />A-&nbsp;&nbsp;&nbsp;&nbsp;90-92<br />B+&nbsp;&nbsp;&nbsp;87-89<br />B&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;83-86<br />B-&nbsp;&nbsp;&nbsp;&nbsp;80-82<br />C+&nbsp;&nbsp;&nbsp;77-79<br />C&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;73-76<br />C-&nbsp;&nbsp;&nbsp;&nbsp;70-72<br />D&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;58-69<br />F&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;58<br /><br />QUIZZES\t10%<br />Discussions\t10%<br />ATTENDANCE\t10%<br />CASE STUDY PROPOSAL\t1%<br />CASE STUDY\t19%<br />MIDTERM EXAM\t20%<br />FINAL EXAM\t30%<br />Total: \t100%<br /><br />I got 69/70 in mid-term and 114/128 in final. I got an A.",
            "comment_workload": "Heavy. <br />5 quizzes in total + 1 bonus quiz. I need to revise the 2-3 set of ppt (30 - 50 pages) slides every time before the quiz. Although they are all mc, you still need to work hard for these quizzes.<br />Midterm has 60 mc (? if I remember correctly). The structure is similar to the quizzes but there will have 4 listening track with 4 mc questions each so there is nearly 16 mc about listening. The listening tracks are taken in the lecture notes. But don't worry, there will have a revision list before exam and there will have the list of the listening track. Therefore, you just need to be familiar with the listening track in the revision list is enough.<br /><br />The case study needs you to pay efforts to fully understand a music culture. For me, I am writing a Progressive House Music Culture. The content needs to be specific and grammar needs to be good in this case study. Grammar! Grammar! Grammar!<br /><br />Final is difficult for the listening mc part and essay writing part. MC part and fill in the blank part need you to memorise a lot of things. But if you memorise all these, this part will be easy. Listening mc part I don't have enough time to finish but they are still all mc. Essay writing, I don't have enough time to write so I finish writing at the last 5 seconds. Therefore, a reminder for essay writing, you need to write faster.<br /><br />To have a good grade, you need to memorise many things. Although it is an open book exam this year, you still need to revise hard for this course. <br />The workload is heavy.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wDdhyxYAoOR417HptuqDca0B1SxNPjtC",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mhmemon",
            "date": "Jan 26, 2018",
            "title": "Interesting course",
            "comment_content": "Content included listening and analyzing the music and music cultures of different parts of the world (Africa, North America, South America, Middle East, China). Overall, I found the content to be quite interesting.",
            "comment_teaching": "The professor keeps the class interesting by mixing teaching with his own singing/instrument playing. Also encourages discussion in class. Easily approachable in person/on email.",
            "comment_grading": "Attendance (Randomly taken), Quizzes, Mid term exam, Case Study, Concert Report, Final Exam.<br /><br />The exams are quite straightforward (MCQs and fill in the blanks). Absolute grading.<br /><br />I ended up with about 92% which was A-",
            "comment_workload": "Case study only took a few days. Quizzes took around 10 minutes each. Concert report was quite short as well (around 2 pages). The professor is also willing to extend deadlines for us. Overall, the workload was average, not too heavy in my opinion.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CSVaPHQQx8wiwg738PHm2NzwWzV8El2W",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TheBestReview",
            "date": "Jan 22, 2017",
            "title": "Memorization",
            "comment_content": "Exactly, &quot;Music of the world&quot;.<br />The content is very broad, includes Africa, Latin, Arab, India and China etc. Since there are only a semester to teach, you can expect the music features won't be taught in a very deep level. However, there are tons of the terms such as instrument names to be remembered. If you can remember them all, you will be fine.",
            "comment_teaching": "Friendly professor. He is very nice and willing to discuss with students after class or via email. He is sometimes funny but in terms of teaching, he often just read from his notes. There are many typos in his notes and since there are many terms to be taught, his slides are lengthy. One good thing to mention is he always play piano for better delivery and to interact with students. For me, his lectures are not boring.",
            "comment_grading": "Exams are not hard if u can remember most of the things in the lecture notes. The mean is not really very high but I guess the grading may really be absolute. <br /><br />Mid-term Exam: 20%<br />The mean was 50/70, I got 65, SD was around 10.<br />Final Exam: 30%<br />The mean was 76/109, I got 103. <br />Quiz: 10%<br />The mean was almost full mark since it's on canvas.<br />Attendance: 10%<br />You can skip 3 lectures, attendance counted randomly.<br />Concert report: 10%<br />Attend a concert and write a short report, prof gives everyone high marks so it's not important, just do it.<br />Case Study: 20%<br />Grammar counts a lot. Contents are also not so crucial.<br /><br />My overall score was 93.9%, and I got an A. <br />I knew one student got A+ who got above/around 95% overall. Probably the mean would be around 80% and resulted in a B-. Therefore, the grading distribution was actually fair but the overall mean was high. Be careful on this. I have music background but in fact it doesn't help a lot, basically just MEMORIZE everything......",
            "comment_workload": "As what I mentioned in the Grading. I would say the workload is above average of the common cores.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iMXaEkmgqSAVzn9OfhoU1wq7h1SGwhqV",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "poisonous",
            "date": "Dec 16, 2016",
            "title": "easy course for students with music background",
            "comment_content": "Music from different cultural groups, quite interesting. Brought new perspective of looking at music and music culture.<br />有music background既人會輕鬆啲,有啲theory野,但冇都唔太大影響,exam都係背野多。",
            "comment_teaching": "Professor好熱心教,講書唔悶,聽佢講野係有得着既。同埋佢本身音樂造詣好高,有音樂背景既人上佢堂一定唔會悶同埋學到野。上堂成日搞笑但唔係個個會比反應。",
            "comment_grading": "online quiz送分,attendace用prs計既,midterm同final有溫過吓書都唔會太差。assignment方面有一個concert report同case study,比分唔太緊，唯獨對grammer要求幾高。",
            "comment_workload": "concert report寫500字,輕鬆既,係case study要花多少少時間,但整體workload唔算大",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "S5JUa1cjNbrawmxng8j3vCyKxHTVnB0i",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "s",
            "date": "Jan 27, 2016",
            "title": "",
            "comment_content": "The course introduces different music cultures around the world. Even if you have zero knowledge of music theory, you will be able to understand not less than 85% of the lectures.",
            "comment_teaching": "The content of the lectures are kind of boring. He did try his best to make the lecture funnier, but not much could be changed. You might find it awkward if you go to the lectures alone because he often tells you to talk to the people next to you as a way to &quot;take a short break&quot;.&nbsp;&nbsp;If you find standing up in the middle of the lecture to act like a jerk is unbearable, then you might just as well skip the lessons or not take this course.",
            "comment_grading": "The grade is moderate. I got everything around the mean/1-2 marks below the mean, and I got a C+. I skipped the lessons a lot though, so if I got full participation marks then I might have gotten a B-.",
            "comment_workload": "To me, not too heavy. There were readings every week, but I didn't read them. The case study and concert report required quite a few of efforts, each of them cost me one night. Two assignments with unlimited attempts, so getting full marks is a no-brainer. Study real hard before the midterm and final exam, then you are good to go.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OF8LUzCTJApax5HLjHpNkRSy3k6m6hcG",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1650,
                    "name": "DUJUNCO, Mercedes Maria",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HU-HT",
            "date": "Jul 17, 2023",
            "title": "Moved from CORE 1631 just in case the CORE code is removed",
            "comment_content": "Before Mid-term Break:<br />(1) Fundamental Issues<br />- What is Music?<br />- Ethnocentrism<br />(2) Aural Analysis<br />- Timbre, pitch, rhythm, dynamics<br />- Sachs-Hornbostel System (Very important!)<br />1. Aerophone<br />2. Chordophone<br />3. Idiophone<br />4. Membranophone<br />5. Electrophone (Not taught)<br />(3) Irish Music<br />(4) The Argentine Tango<br />(5) The Music of Brazil<br />(6) Silk and Bamboo music of Southern China<br />1. Guangdong yinyue<br />2. Jiangnan sizhu<br />3. Chaozhou xianshi<br />4. Kejia hanyue (Not taught)<br />5. Fujian nanyin (Not taught)<br />After Mid-term Break:<br />(7) Hindustani Music<br />(8) Music in the Islamic World<br />(9) Southern Asian Gong-Chime Cultures<br />1. Gamelan<br />2. Kulintang<br />3. Piphat (Not taught)<br /><br />10% Geography<br />40% Instruments (need to use Sachs-Hornbostel System)<br />50% Vocal or Dance Cultures<br />Before Mid-term Break, professor first taught cultures that are more familiar to us (Western traditional music + Chinese music)<br />After Mid-term Break, the topics taught are those that we may never have experienced before.<br />It is like learning a different language.<br />Attendance of lecture is required.",
            "comment_teaching": "Her teaching was fine, and she had shown to be knowledgeable.<br />She also occasionally picked someone and asked questions, and gave some pop quizzes too. So, make sure you review the PowerPoints after every lecture.<br />From the reviews from last semester (2022-23 Fall), people seemed to think her teaching was absolutely terrible. In my experience, she is not that bad. I assume someone complained to her and she had a change in attitude.<br />(Edit: I think she regret for allowing the course to be too &quot;relaxing&quot;. So, hopefully the next semester won't be her being like before again.)",
            "comment_grading": "Absolute grading, meaning you need a very high score in order to get A range.<br /><br />7.5% Attendance<br />7.5% Pop quizzes and online discussion<br />10% Assignments<br />25% Concert Review<br />25% Mid-term Exam<br />25% Final Exam<br /><br />My results:<br />Attendance: 100/100<br />Pop quizzes: 12/17 in total<br />Discussion: 10/10<br />Assignment 1: 39/40<br />Assignment 2: 25/25<br />Assignment 3: 10/10<br />Concert review: 94/100<br />Mid-term exam: 89.5/100 (Mean is meaningless because too few people)<br />Final exam: 97.5/100 (Mean is meaningless because too few people)<br />Grade: A<br /><br />Don't know how pop quizzes and discussion contribute to overall score.<br />Attendance is better than before now. If you missed the iPRS attendance, TA would also give you the attendance sheet to record your attendance. (The lecture is also at 3pm, so you don't need to wake up early like fall term :) )<br />The marking of the concert review is very lenient. She gave me 94 even though I made tons of mistakes in the review to the point that I was very embarrassed on giving this terrible concert review to her after I looked back my review.<br />The highest mark you can get in mid-term exam and final exam is actually 105/100 because there are 5 bonus marks.",
            "comment_workload": "There was only 1 online discussion needed to participate, and it was after one of the first few lectures. <br />3 assignments were given. Those were relatively easy to do if you follow the instructions and review the PowerPoint carefully.<br />For concert review, I needed to write more than 1500 words (Used to be 2000 words, but other students complained). She gave me 3 weeks after the concert to write. She also provided some reading materials and videos to help us write the review. Remember to send the draft to the professor so that you know what to improve.<br />Since there were pop quizzes and occasional questions during the lecture, reviewing PowerPoint is important. Although it may be annoying, at least you wouldn't need to review them just before the exam like someone who just learnt the topics.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4PrHzNcnyYfuV0rHrUcrg9IVHN1LhB0Z",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "JohnIsHere",
            "date": "Feb 02, 2023",
            "title": "",
            "comment_content": "The content is alright but don't come into the course thinking you will ace it just because you have some prior music knowledge; You will not.<br />Half of the course covers culture.",
            "comment_teaching": "Choose Isaac David only, run if you see anyone else teaching this course.",
            "comment_grading": "Do your HW, and your concert review but most importantly, study for your mid-term and finals. They are going to be the main thing deciding your grade.",
            "comment_workload": "One thing I gotta say about this course is its workload can be very light, excluding your preparation for mid-term and finals of course.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CHmcBsrO0ZZahZsjizBz1q9ZA3q9pWLJ",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Matthew Hosea",
            "date": "Jan 23, 2022",
            "title": "",
            "comment_content": "HUMA1100 is a course about different music cultures around the world and the influence music plays in each of the cultures. Over the course of the semester the lectures focused on music cultures from different geographic regions for a few weeks at a time. These included music cultures from Africa, African-American music from North America, music from the Arab world, music from India, and music from China. Throughout the course different musical concepts such as tempo, rhythm, pitch, and timbre are also covered. As such, it is still possible to do well in the course without a musical background, although having a musical background does help a lot.",
            "comment_teaching": "The professor's delivery of the course content in lectures is clear and easy to understand. The professor also frequently asks questions to the class that are engaging and get students to think.",
            "comment_grading": "A+ : 98 and above , A : 93-97 , A- : 90-92<br />B+ : 87-89 , B : 83-86 , B- : 80-82<br />C+ : 77-79 , C : 73-76 , C- : 70-72<br />D : 58-69<br />F : 57 and below<br /><br />This course uses an absolute grading system with the grade ranges shown above.",
            "comment_workload": "Each week there are 2 1.5-hour lectures. For every geographic region mentioned in the content section there is a Canvas quiz on the content of the lectures pertaining to the region, and a Canvas discussion related to a musical topic mentioned during the lecture.<br /><br />The midterm contained 3 sections: a multiple-choice section, a fill-in-the-blanks section, and a listening section. The final contained 4 sections: the same 3 sections as the midterm followed by a 600 word essay written within a 1-hour time limit.<br /><br />Early on in the semester the course project is introduced: a case study on a music culture of your choosing. Around 2 months are given to complete the case study. The submission&nbsp;&nbsp;is in the form of a 10+-1 minute video essay that must be submitted alongside a 1500+-100 word voiceover script, and full recordings of songs referenced inside the video essay through audio snippets.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qQB4qpQnunH1kesFxufIrZtzDMACHDf6",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HelloWorld123",
            "date": "Aug 24, 2021",
            "title": "",
            "comment_content": "This course mainly talk about the music culture in different places, and how is the music is related to different people’s lives, religions, and work.",
            "comment_teaching": "Professor was very nice, and his teaching was vivid. He always showed some videos to let us know how different music cultures look like. He also shared some websites regarding the music theories to us.",
            "comment_grading": "I have got A-, which was under my expectation. I got above mean in my final and midterm exam, and 45/50 in video paper. Overall the tasks were quite easy.",
            "comment_workload": "Workload was a little bit heavy, including video paper,&nbsp;&nbsp;quizzes, and discussions. Mid-term and final exams were open booked and quite easy. Students also had to attend two concerts in order to get participation mark.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TyCXblSSPvFGnDILLe3j4mxclrED5jag",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1305,
                    "name": "PAGE, Timothy Markham",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rexllll",
            "date": "Jul 02, 2021",
            "title": "Really Good Course if you are into Cultural History and Music",
            "comment_content": "1. Terminology and Elements of Music<br />2. African Music<br />3. Middle Eastern Music<br />--- Midterm ---<br />4. Indian Music<br />5. North America / Black America Music<br />6. Modern and Traditional Chinese Music",
            "comment_teaching": "Excellent Teaching !!!<br />They way prof. Page explains the development of music and how music and culture influences each other makes the entire lecture seems more like a story telling time. I absolutely had fun during the lecture.<br />This is one of the only few lectures that I actually look forward to attending.",
            "comment_grading": "Attendance 10%<br />5 Quizes 10%<br />Midterm 20%<br />Final Exam 20%<br />Concert/Recording Review 10%<br />Case Study 30% <br /><br />I got full marks in all the quizzes except the last one, because I forgot about it.<br /><br />Got about 90% in all the Midterm, Final, Report and Case Study.&nbsp;&nbsp;<br /><br />I got an A in the end.",
            "comment_workload": "The workload is not light if you are not used to reading or not into history.<br /><br />You will have to go through a 3 to 5 page reading material after every lecture, plus briefly analyse 2 tracks of music.<br /><br />Prof. Page will randomly pick students and ask them about the previous lectures and reading materials. <br /><br />There is also a concert and recording report which is quite easy to me, but not so much for my friend.<br /><br />I typed up the case study in less than 6 hours, ending up with 93%, so I guess it's quite easy as well.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "m93tC372kdCxtrpIsRqDJPawxmauIobv",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1305,
                    "name": "PAGE, Timothy Markham",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ohchimmy",
            "date": "Aug 27, 2020",
            "title": "Don't recomment",
            "comment_content": "Basically music around the world, we learnt some basic knowledge of music, Indian music, Arab music, Chinese music etc. Some part of it is difficult for example Indian music because I never understood how the beat works lol, maybe it is only me though. If you have some music background it would be easier for you",
            "comment_teaching": "He tries to interact with students and get the class more interesting, which is good since I personally did not really like studying music and felt quite bored. He plays the recording of music tracks as well, sometimes he plays the piano himself. All in all, I enjoyed the lectures most of the time.",
            "comment_grading": "I did not do great in this course but it could be because I skipped some lectures, since this course count in attendance. Attendance is really important please do not miss the course.",
            "comment_workload": "The workload is fine, not too heavy. There is only a mid-term and a final exam and a project to do. There are no specific limited topics for the project so you can basically research any topics you find interesting. I did Cantonese music for my project. I quite enjoy the process of doing the project because I chose a topic that I enjoyed to do, you would not have a hard time doing it if you choose a topic you really like. For the MT and final, they are all MCs, personally I find the questions that require listening quite difficult, maybe it is only for me.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8vuxPzwMtgSzBWkmWDNzHHObO804FGfS",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Stellar123",
            "date": "Jun 04, 2020",
            "title": "Nice course about world music and culture",
            "comment_content": "Mainly about music culture around the world in various places.&nbsp;&nbsp;Not difficult to understand, even for those who doesn’t have much prior knowledge in music.",
            "comment_teaching": "Professor tries to make the class as interactive as possible by initiating class discussions.",
            "comment_grading": "Absolute grading applies.&nbsp;&nbsp;It is not hard to get A range grades if you listen attentively in class, jot some notes and remember all the stuff in the PowerPoint.&nbsp;&nbsp;Better take notes on various songs he covered in class as these may appear in the midterm/final exam in the form of questions on their analysis.&nbsp;&nbsp;Attendance will be taken.&nbsp;&nbsp;<br />Grading: <br />Attendance 10% <br />Canvas discussions*5 10%<br />Midterm 20%<br />Final 30%<br />Case study 20% (1% for the case study proposal, 19% for the study) <br />Quizzes (best 5 out of 6) 10%",
            "comment_workload": "The workload for the music case study report can be heavy, depending on the topic you are covering and your knowledge about it.&nbsp;&nbsp;I ended up spending 2 whole days to complete mine.&nbsp;&nbsp;&nbsp;The workload for 6 quizzes(only 5 counted), midterm and final is manageable and considerably light in my opinion.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VxBVsLxNw6wy0K0o177S6jmVkQHza69e",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1305,
                    "name": "PAGE, Timothy Markham",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "RegiQ",
            "date": "Jan 19, 2020",
            "title": "",
            "comment_content": "This course is mainly about the music and culture in different parts of the world. The teacher will talk about the music in Africa, middle east, India, China, etc. and he will relate the style of music to the local culture.<br /><br />The content is quite abundant and it may take a lot of time or students to remember some important points, but you can really learn something new through this course.<br /><br />If you have learned music before and have some basic music knowledge in how to read the music notes or how to listen the beat, it will be a little easier for you to understand some content. But it is totally okay even if you didn't learn music before because most of the content does not require music knowledge.",
            "comment_teaching": "It is the first time for the teacher to teach in HKUST and he basically teaches according to the PPT. Sometimes he will play some instruments in the class and may also ask the students to interact with him. <br />Personally, I think the teaching is not very attractive and interesting, he just uses very normal way of teaching.",
            "comment_grading": "Absolutely grading.<br />Attendance of lectures, participation in discussion 10% <br />* PRS is used<br />5 graded online reviews 10% <br />Midterm 20% <br />Final Exam 20% <br />Concert review 10% <br />Case Study 30% <br /><br />I think the grading is quite fair but it is not easy to get very good grade such as A or A+. Definitely, you have to pay effort and follow the instructions of the professor to get a good grade. <br /><br />For me, I attended every lecture. I got almost high in both mid-term and final exam, and the quiz score is a little above the mean. I didn't reach mean in the concert report but got a score higher than mean in the case study. Finally I got an A-.",
            "comment_workload": "The workload is really heavy since you have to complete many things and do many reading in this course.<br /><br />I think reading is the largest part of the workload because you need to read about 15-25 pages after each class and this takes lots of time. You should not skip this part if you want a good grade because almost all the answers in the exam can be found in the book.<br /><br />For the concert report, student need to listen to a concert and write a report in both musical and cultural aspect. The report should be about 500-word long.<br /><br />The case study is about 1500 words and you should study and discuss several aspects of a music culture by yourself. This essay needs large amount of research and may take a lot of time to prepare.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5QaCZCuYzMmC8A0E73zVqv6kpkcSKPbr",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1305,
                    "name": "PAGE, Timothy Markham",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "eggyy",
            "date": "Jan 16, 2020",
            "title": "Take this course if you are good at memorizing",
            "comment_content": "1. Music-Culture and “World Music”&nbsp;&nbsp;<br />•\tWhat is “World Music?” – What is “Traditional Music?” - What is “Music,” for that matter? <br />•\tMusic Cultures<br />•\tMusic as embodying a way of life. <br />•\tDo we hear “World music” in our daily life? <br />2. Elements of Music <br />•\tMusic as a technology: Scales, interval, temperament, texture, form, notation, etc. <br />3. Africa <br />•\tFeatures of traditional West African musics<br />•\tFrom Africa to the Americas and back – Afrojazz, Juju, Highlife<br />4. Middle East&nbsp;&nbsp;<br />•\tMusic of the Maghrib <br />•\tMusic of Levant <br />•\tInfluence on traditions elsewhere<br />5. Europe<br />•\tThe Balkans – folk music and totalitarianism<br />•\t European Art Music (aka “Classical Music”) as an “ethnic music.”&nbsp;&nbsp;<br />6. North America/Black America&nbsp;&nbsp;<br />•\tSpiritual, Gospel, Blues<br />•\tJazz<br />•\tHip Hop<br />7. Latin America <br />•\tTraditional Latin &amp; South American music<br />8. India <br />•\tAesthetics of Indian music<br />•\tRaga and Tala - Scales and Rhythmic pattern of Northern Indian and Southern Indian music<br />•\tIndian instruments: Sitar and Tabla – Veena and Mridangam <br />9. East and Southeast Asia <br />•\tGamelan<br />•\tJapanese Gagaku<br /><br />I believe he added something about Chinese music culture as we are in Hong Kong.",
            "comment_teaching": "It is his first time teaching in UST. He is a composer and very knowledgeable. He is willing to answer questions in class and sometimes call a random student to answer a question. There are also some in class exercise like singing or clapping a rhythm together, you can see that he tries to engage the class. He shows a lot of listening examples and videos to help us understand the culture better.<br />He always changes the deadlines of our assignments and assessments that most of the dates on the syllabus aren't correct.",
            "comment_grading": "Absolute grading.<br />It is not difficult to get high scores in assignments as long as you hand in on time, follow the instructions and fulfill all his requirements. <br /><br />I requested pass/fail so I don't know much about the grading, but he gave us a few assignments to earn credits for boosting our grades by the end of semester as most of us did poorly in midterm.<br /><br /><br />Attendance of lectures, participation in discussion (10%) <br />5 graded online reviews 10% (Mostly M.C.) <br />Midterm 20% (Mostly M.C.)<br />Final Exam 20% (Mostly M.C.) <br />Concert review 10% <br />Case Study 30%",
            "comment_workload": "Quite heavy for common core.<br /><br />He gives us readings before every class, but there was once when no one in the lecture had done the reading before going to class and he found that out when he asked some questions about the reading.<br /><br />He also takes attendance. If you know his pattern then you can attend class only once a week.<br /><br />You will have to review all the listenings he played in class before assessments. Also, memorizing all those vocabulary is difficult as it is not in English most of the time.<br /><br />The live music event report which replaced the concert review is only 500 words and there are free concerts in UST.<br /><br />The case study is &gt;1500 words and make sure you are truly interested in your topic, or you will suffer a lot.<br /><br />Unless you are really interested in music around the world, if not don't take this course. The terminology and content will kill you.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "lPUrPrXiVeDLDuPiQrnm6Wn08wt0E3AS",
                    "name": "Page - HUMA1100 Fall 2019 - Syllabus",
                    "format": "docx"
                }
            ]
        },
        {
            "hash": "JhWiFSLQqLsvLRU3CgjHOPNJAearZj8C",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1305,
                    "name": "PAGE, Timothy Markham",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JHLI",
            "date": "Jan 03, 2020",
            "title": "",
            "comment_content": "The content is quite boring I'd say as it's basically traditional music around the world. But even you don't have a musical background you will still understand.<br /><br />1. Music-Culture and “World Music”&nbsp;&nbsp;<br />•\tWhat is “World Music?” – What is “Traditional Music?” - What is “Music,” for that matter? <br />•\tMusic Cultures<br />•\tMusic as embodying a way of life. <br />•\tDo we hear “World music” in our daily life? <br />2. Elements of Music <br />•\tMusic as a technology: Scales, interval, temperament, texture, form, notation, etc. <br />3. Africa <br />•\tFeatures of traditional West African musics<br />•\tFrom Africa to the Americas and back – Afrojazz, Juju, Highlife<br />4. Middle East&nbsp;&nbsp;<br />•\tMusic of the Maghrib <br />•\tMusic of Levant <br />•\tInfluence on traditions elsewhere<br />5. Europe<br />•\tThe Balkans – folk music and totalitarianism<br />•\t European Art Music (aka “Classical Music”) as an “ethnic music.”&nbsp;&nbsp;<br />6. North America/Black America&nbsp;&nbsp;<br />•\tSpiritual, Gospel, Blues<br />•\tJazz<br />•\tHip Hop<br />7. Latin America <br />•\tTraditional Latin &amp; South American music<br />8. India <br />•\tAesthetics of Indian music<br />•\tRaga and Tala - Scales and Rhythmic pattern of Northern Indian and Southern Indian music<br />•\tIndian instruments: Sitar and Tabla – Veena and Mridangam <br />9. East and Southeast Asia <br />•\tGamelan<br />•\tJapanese Gagaku",
            "comment_teaching": "Tim is a nice professor who is willing to answer questions. He also likes to ask questions in class and calls students randomly to answer the questions. His teaching is quite good as he can explain the musical terms clearly using a lot of listening examples.",
            "comment_grading": "Absolute grading.<br /><br />Attendance of lectures, participation in discussion (10%) <br />5 graded online quizzes (10%)<br />Midterm (20%) <br />Final Exam (20%)<br />Concert review (10%) <br />Case Study (30%)<br /><br />You will get a good grade as long as you study hard and memorize the terms in the ppt.",
            "comment_workload": "Tim will post listening and reading materials on Canvas before every lesson for us to prepare. The readings are hella long so I usually skip parts of it. But listening to the examples are fun and important as they will appear in the exams, so make sure to listen to them. For the online quiz, midterm and final, you just need to study the ppt and revise the listening examples and you will be fine. It's hard to memorize the musical terms though, especially the terms in foreign languages.<br /><br />The concert review requires you to attend a live concert and write some opinions on the music and its culture. It's only 500 words so it's not really hard to do.<br /><br />The heaviest workload is from the case study, which requires 2000 words. Make sure you choose a subject that you're interested in, otherwise you will find it frustrating to write that long for it.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xeTL0f31iDhjUrJnFL734nqyE804Q39H",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Renee",
            "date": "Sep 09, 2019",
            "title": "",
            "comment_content": "Learning the music culture of south east asia and the america by understanding the history and music instrument of that particular places.",
            "comment_teaching": "You can feel he is really passionate in teaching the course. He will play the piano and sometimes write his own songs during class. He always invites the students to clap the rhythm to make sure the students understand the feature of the music of different culture.",
            "comment_grading": "Absolute grading. <br /><br />Attendance is taken almost every class. He would take attendance in the beginning or the end of the lecture so you could not just take attendance then leave. <br /><br />Everyone gets similar grade for the report, but make sure you have your grammer correct as it takes a high proportion. <br /><br />Midterms and exams are all about memorization. Most of them are MCs on the characteristics of the music culture. Short questions require you to spell the names of the music instruments.",
            "comment_workload": "Workload is quite high. Quiz every week and has limited time to finish it. I suggest you to finish it with friends so that you have time to check the ppt when you are working on the quiz. You also have to finish a report by introducing a type of music.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4TiQ7BuHViV6ibe4HIrc4PU3Dr1DUayQ",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hcy",
            "date": "Sep 03, 2019",
            "title": "Good grade course",
            "comment_content": "Cultures and characteristics of world music (Africa, Black America, Arab, Latin, India and China music). We need to apply the knowledge and concepts to distinguish the music tracks come from which part of the world and what instruments are used.",
            "comment_teaching": "A friendly and easy going professor who provides many guidelines and examples helping students to finish assignments, and he is willing to talk to students and extend the deadlines as long as you tell him. The content might be boring, but he tried to make it more interesting. Some of his opinions and understanding to music can really help you think deeper.",
            "comment_grading": "Absolute grading. The mean of quiz (open book done at home), mid term (all MC) and final (MC and fill in the blanks) are quite high about 89% but he said he was surprised, maybe in other semesters are not that high?! All the questions are strict forward but need to distinguish the instruments through pictures and there are some listening. Random attendance would be counted using iprs. Two assignments include concert report and case study.<br />I did not read the textbook but did work hard in all exams and assignments, however, I forgot to do one part of the case study. So ending up case study and final slightly lower than mean and got a B+.",
            "comment_workload": "Maybe because I learnt some music theories and I play musical instruments, I don't think the content are very hard but need a lot of memorization. This course is about memorizing the ppt and I don't think reading the textbook will help a lot more. There are quizzes from time to time but can be done within an hour including the time revising before doing it (there are time limits for the quizzes). The assignments just need to follow the guidelines and he provided lots of time for us to finish. Case study may need more time about a week to finish while the concert report can be finished in one day. If you love music, this will be a quite easy and good grade course for you.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "w0CTVumqmjQM1d4tUdMlIAUbsinQTIAD",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wula",
            "date": "Aug 17, 2019",
            "title": "",
            "comment_content": "The content covers many cultures around the world. It will talk about the history of the song culture in different regions, including Africa, China and America for example.",
            "comment_teaching": "Teaching is quite good as the lecturer will provide a lot of in-class activity to encourage your participation in the learning process. Moreover, many songs around the world will be played during lectures. You will not feel bored even you attend them all.",
            "comment_grading": "This course's grading is quite good for students who do not have enough time to study, since it only contains MC question in both midterm and final exams, it is easier to achieve satisfactory results. However, it requires attendance recording using IPRS so make sure you do not skip too much lessons.",
            "comment_workload": "The workload is quite light for this course, as it only requires students to complete a midterm exam , a final exam and one assignment which need to attend a school-organized concert and its workshops. However, the assignment is very easy to finish as it only requires you to write your feelings about this concert.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gvgAv6YHsi7CmKEGB6Rw7K2vyY5gn8qn",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jupsham",
            "date": "Jun 22, 2019",
            "title": "Good instructor, easy content, but workload is a bit heavy",
            "comment_content": "Interesting content, understanding music in cultural and historical contexts. Exams and tests are quite easy if you can associate and remember new vocabularies and terms quickly.",
            "comment_teaching": "Very easy going instructor, tried his best to make the course content. Always understanding if you need to extend the deadlines.",
            "comment_grading": "Absolute grading, in general people get pretty good grades though.",
            "comment_workload": "Online quiz after every topic (every two weeks), one paper on analyzing the music culture that you choose, one midterm, one final. Quizzes and exam is quite easy. Paper not so but it is fine as you can do the topic you are interested in although it requires some research. What I find a bit troubling is that all students are required to join the Intimacy of Creativity concerts and discussion. It is a music festival that is held in ust, it is quite interesting since in discussion you can take part in giving comments on the music composition. However, you will need to take time out of lesson to attend the events, especially that concerts are only held on weekends. Mostly for the attendance, afterwards a short review on the event is required to be handed in.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eY1rSizj1mXQTlE2WFNqRi5i2AqQLcAU",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YuxinTang",
            "date": "Jan 29, 2019",
            "title": "Interesting, easy to get good grade but quite demanding",
            "comment_content": "This is a introductory course exploring music cultures outside classical European traditions. It's indeed eye-opening as you will dig deep into music from Africa, India, the Arab world, China etc. . Isaac will also equip you with basic knowledge of music concepts and theories that are quite useful(and will be tested) and enhance your understanding of music from a technical perspective. Intensive listening and reading are also quite help when it comes to building up your musical sense. But the focus is still more about culture, such as the context under which certain music has developed. You can really learn a lot of interesting stuff about the distinct and unique lifestyles, traditions, values of cultures around the globe.",
            "comment_teaching": "Isaac is really a wonderful teacher. He is very humorous and friendly; you can literally feel that he cares for his students. As for the course itself, he is a professional opera artist and has very deep personal understanding of both music and culture that offers inspiring insights into the way you inspect and understand the two. Attending his lectures is very enjoyable.",
            "comment_grading": "Absolute grade; easy to get grade as long as you work hard as this course is a bit demanding",
            "comment_workload": "a bit demanding<br />Attendance(10%)<br />5 quiz(10%, about 20 MCs every time)+ 1 bonus quiz<br />Case Study(20%,1500+ words, require a journal)<br />Concert Report(10%, 500+words, must enclose the ticket; Isaac offers many free tickets for the class so there is no need to worry, you can also attend one of your own interest)<br />Midterm(20%, all MCs)<br />Final(30%, MCs + fill-in-blanks)<br />Midterm and Final are easy as long as you recite the slides and listen to the required audio files. But reciting is relatively difficult as you have to remember some strange words like the names of African drums.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LpNOr6Saml22c0pzA4WhWQ2KOgb1F3Wd",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Athena Chan",
            "date": "Jan 25, 2019",
            "title": "",
            "comment_content": "The content is fun. It introduces music around the world, from African to China. If you have no music background, you can still take this course.",
            "comment_teaching": "The instructor is highly approachable. He is nice and helpful.",
            "comment_grading": "Try to get full mark in all quizzes.<br />I get near full mark in all quizzes and case study, but ended up with a C+.",
            "comment_workload": "Each quizzes only takes less than 20 minutes. You can do it with your notes opened. <br />For case study, it is not a difficult work if you choose a topic that you are really interested in.<br />The concert report is not a big problem, coz you can choose any type of concert as you like.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IUTqdcUs4qHwitnVbmG3NwuQxW731B7h",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wilbert caine",
            "date": "Dec 28, 2018",
            "title": "plenty of slides yet interesting and enjoyable",
            "comment_content": "midterm topic: Africa, Black America, and Latin America<br />final topic: India, Arab, and China<br /><br />Textbook: Titon, Jeff Todd. An Introduction to the Music of the World's Peoples. Published by: Cengage Learning. ISBN-13: 9780534595395. ISBN-10: 0534595391<br /><br />There will be readings from the above book, which is also available for reserve at library, for each lecture. However, grades of A range is still achievable if you skip them. Professor will teach the background of each music culture and give you hints for the quizzes and exams.<br /><br />Attendance will be taken randomly 13 times throughout the semester.From the 13 days, you may miss three classes without penalty, but starting from you fourth absence, one percent will be deducted for each absence (10% maximum deduction). <br /><br />Concert Report and Case Study do not have to be relevant with the course materials, but you need to apply terms learned from the course and follow the guidelines.",
            "comment_teaching": "Professor Droscha always plays an instrumental song from YouTube in the beginning of each lecture. Sometimes during the lecture, he seeks participation by asking questions and setting up discussion. He even guided us to work on our own short blues songs and perform it live in the class.",
            "comment_grading": "&gt; Attendance of Lectures 10% *PRS will be used<br />&gt; 5 graded online Quizzes 10% (Mostly M.C.) + 1 bonus quiz<br />&gt; Midterm 20%<br />&gt; Final Exam 30%<br />&gt; Concert Report 10%<br />&gt; Case Study 20%<br /><br />A: 90-92, 93-97, 98+<br />B: 80-82, 83-86, 87-89<br />C: 70-72, 73-76, 77-79<br />D: 58-69<br />F: &lt;58",
            "comment_workload": "Overall, the workload is bearable for anyone with or without music background. Professor is lenient when it comes to deadlines, you could just request for an extension if you can not find your free time to do the quizzes. Review guide, lecture notes, readings, lecture videos, and sample essays will be uploaded to canvas.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0lf7uxZC1OUOnFykIb1YCtP9VCAmJpAb",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rickochei",
            "date": "Dec 23, 2018",
            "title": "",
            "comment_content": "Pretty easy for someone who is familiar with music, especially the first half of the term. The second half is more memorization.",
            "comment_teaching": "Very easy to follow, but can get a little boring at times. If you listen attentively during class, you should have no problem on the midterm and final exams.",
            "comment_grading": "I think he is pretty generous about grading. He also gives extensions to assignments, so if you tell him you need more time, he will grant it to you.",
            "comment_workload": "There are a lot of quizzes, papers, midterm, and final, which can get pretty intensive, but not too bad. I think the quizzes helped for studying for the midterm and final. <br /><br />There is a case study paper where you pick a topic and basically write about it by applying the stuff we learned in class. I will suggest to start on that earlier because it requires a little more thinking to organize and write the paper strategically. Make sure you choose a good topic or else you will have to change it last minute like I did.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EJOtlR7IQxGlsXCDyUcsmuTkYreZLVZc",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lolllllllllll",
            "date": "Dec 21, 2018",
            "title": "This course is goooood",
            "comment_content": "This course is obviously about music from different parts of the world. I would say that the content is quite boring if you just looked at the slides, yet if you attend lectures and actually listen to what Isaac said, it is quite fun indeed. It mainly covers music from Africa, America, India, Arab and China. Actually I have zero music background, trust me that doesn't really matter.",
            "comment_teaching": "isaac is good :D",
            "comment_grading": "This course used absolute grading.<br />My grades<br />[10%]online quizzes x 5 (99/100)<br />[10%]attendance (10/10) (use iprs only you can ask your friends to send you codes lol)<br />[20%] case study (96/100)<br />[10%] concert report (19/20)<br />[20%] Mid term (63/66)<br />[30%] Final (96/101)<br /><br />Final grade: A",
            "comment_workload": "I spent majority of time doing my case study and I realize that majority of the students end up with high marks soooo...<br />Just study the exam review guide, that will be fine.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WFt6BjZEBuHMjgNjQCXEte8eOeOxcyZR",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ausunghei",
            "date": "Aug 25, 2018",
            "title": "huma 1100",
            "comment_content": "teach history more than music<br />you will learn the music history of different countries around the world, such as Irab, China, Black america, african<br /><br />the instruments and features of those kind of music<br />quite interesting. you have to memorize those songs for the exams",
            "comment_teaching": "Professor teaches lively, he always tells jokes <br />always play youtube video, and play the piano during lessons<br />he wants students to be interactive, such as clapping hands according to the beat, or answering some questions",
            "comment_grading": "attendence 10% <br />online canvas quiz 10% (5 normal quiz, 1 bonus quiz, answers can be found on lecture powerpoints)<br />case study( just about music may do)<br />mid term<br />final<br />10% listening concert and write concert review<br />it uses absolute grading, so dont think you can get an A even you are much higher than the mean",
            "comment_workload": "light<br />study for 30 min before every online quiz helps you revise<br />spend 2-3 days before midterm and final<br />spend one week for doing the case study<br />spend half day finish the concert review<br />i got a B+ with this kind of effort<br />if you want higher grade, u have to work harder",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "d05Ba2xHapuILiuD1G9GlJnFZsVEVClz",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Leah Engman",
            "date": "Aug 20, 2018",
            "title": "Super interesting!",
            "comment_content": "Music of the world including Africa, Black America, Arab, Latin, India, China. And also some basic music knowledge. Not hard even for those who are not familiar with music. You need to know the characteristics of the music in those region and apply them to the listening track.",
            "comment_teaching": "Quite good. Although the content is somehow boring, the professor tried very hard to make it more interesting. He will ask questions and say some jokes. The best thing is that he will always extend the deadlines of the assignments and quizzes when somebody tells him that more time is needed.",
            "comment_grading": "Absolute grading. You need to work hard for the mid-term and final in order to get a very good grade. <br /><br />A+&nbsp;&nbsp;&nbsp;&nbsp;&gt;98<br />A&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;93-97<br />A-&nbsp;&nbsp;&nbsp;&nbsp;90-92<br />B+&nbsp;&nbsp;&nbsp;87-89<br />B&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;83-86<br />B-&nbsp;&nbsp;&nbsp;&nbsp;80-82<br />C+&nbsp;&nbsp;&nbsp;77-79<br />C&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;73-76<br />C-&nbsp;&nbsp;&nbsp;&nbsp;70-72<br />D&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;58-69<br />F&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;58",
            "comment_workload": "Quite heavy I will say. You need to hand in a 1500 words case study and a 750 words concert report. However you only need to follow the samples given and check your grammar. The professor will give you high marks for the two assignments as long as you fullfil the requirements, accurate in grammar, and with a pretty design for the document you handed in. You will also have 5 quizzes through out the course. Try to get full marks.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "10PHHFZFnON5qWXPnjbQcyC0n9d42gSk",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "whalewhalewhale",
            "date": "Feb 01, 2018",
            "title": "",
            "comment_content": "The course teaches you about music cultures in different continents/ countries. It mainly focuses on African music, and also covers music from China, India and the Middle East. Very interesting course if you're interested in learning about different genres of music, rather than Western classical music. You don't require prior knowledge related to music, as they also cover the basic music concepts, and will teach you how to apply it through listening tracks.",
            "comment_teaching": "The professor engages students in a very interesting way, and always tries to encourage students to participate in class discussions. He would also make jokes during the class, and show a lot of music clips instead of only relying on the PowerPoint. For those who are absent, he also uploads a video of the lecture onto Canvas for those to refer to.",
            "comment_grading": "Attendance is taken randomly 13 times. You can be absent for 4 of these random attendance checks, as the first four times of absence are not counted to your grade.<br />The grading is absolute. The professor does not give an A+ (which is a grade of 98% or higher). <br />Quizzes are open book and are done on Canvas, so usually students would only have 1-2 marks off from the full mark.<br />The exams are straightforward and only consists of MCs. There will also be a listening section. The professor will give a list of recordings that may appear in the exams, as well as a list of key words that you may have to know. The final exams, however, have additional fill-in-the-blank questions, and also has a section where you have to name the instruments.",
            "comment_workload": "Quite heavy workload, as the course includes a case study of around 1500 words, and a concert report of 500 words.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "X9l75WnDyD7cRzZEqLo6deFKrCyWnie9",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ds",
            "date": "Jan 09, 2018",
            "title": "",
            "comment_content": "Music of:<br />Africa<br />Black America<br />Arab<br />China<br />India<br />Latin<br /><br />Just memorize everything and you can do the test. The listening part is quite hard for people with no music background.",
            "comment_teaching": "He's fun but kinda scary when he's angry. He take random attendance. It's not that boring if you understand the lecture and you are interested in music of the world.",
            "comment_grading": "absolute grading.<br />A+ &gt;98<br />A 93-97<br />A- 90-92<br />B+ 87-89<br />B 83-86<br />B-80-82<br />C+ 77-79<br />C 73-76<br />C-70-72<br />D 58-69<br />F &lt;58<br /><br />Got full mark for all my quizzes, midterm and finals above mean, and essays are above 80. final score is a B.<br />The mean is really low but the grading is absolute.",
            "comment_workload": "Assignments are weighted by group:<br />Group\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Weight<br />ATTENDANCE\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />QUIZZES(on canvas)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />CASE STUDY PROPOSAL\t1%<br />CASE STUDY\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;19%<br />CONCERT REPORT\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />MIDTERM EXAM\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />FINAL EXAM\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;30%<br />Total\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;100%<br /><br />Very light workload although the final exam is pretty hard.<br />1 essay (1500 words min)<br />1 case study about any type of music except classical<br />5 outside class quizzes (you can find the answers on the ppt)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yj0r79ZHILmXLoRwXZxu9SU1W70y7t1Z",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tung_tung",
            "date": "Dec 23, 2017",
            "title": "",
            "comment_content": "Midterm:<br />Africa, Black America, Latin<br />After midterm:<br />India, Arab World, China<br /><br />The Africa part is quite boring and the African drum music is annoying but others are nice.<br />You can really know more about the relationship between different culture and music.",
            "comment_teaching": "Professor comes from the US so he has a nice English accent.<br />Although the ppt is full of words and typo, I learn many different new vocabs. I think this course is more efficient to learn English than the lang course.<br />Professor tried to make the class interesting and let the class stand up and sing together. He even made a traditional African instrument during the lecture.",
            "comment_grading": "This class uses absolute grading under the following breakdown:<br />A+ &gt;98<br />A 93-97<br />A- 90-92<br />B+ 87-89<br />B 83-86<br />B-80-82<br />C+ 77-79<br />C 73-76<br />C-70-72<br />D 58-69<br />F &lt;58<br />You can predict your grade very quickly as the marking of the final exam is so efficient that it released few hours after the exam.<br /><br />Just recite all the things in the ppt and you can get a high mark in midterm(just MC) and final exam(most of them are MC and some fill-in-the-blank)<br />For the fill-in-the-blank questions, you need to remember how to spell the name of the musical instruments (the picture of musical instrument will be provided) and some of the musical terms.<br />It's easy to get above B if you just follow the marking rubric provided by the professor, but you need to work very hard for an A.",
            "comment_workload": "Assignments are weighted by group:<br />Group\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Weight<br />ATTENDANCE\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />QUIZZES(on canvas)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />CASE STUDY PROPOSAL\t1%<br />CASE STUDY\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;19%<br />CONCERT REPORT\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />MIDTERM EXAM\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />FINAL EXAM\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;30%<br />Total\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;100%<br /><br />Just mind the grammar for the case study and concert report!!!<br />Every single mark is important! Try not to skip the lecture, especially the attendance was taken frequently when it was near the final exam. You should get full mark for all the online canvas quiz, the answers are all in the ppt.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cJVGRvPscREYEI9FOdgIedKSZ8mrzzNs",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sanbir",
            "date": "Dec 23, 2017",
            "title": "Music of the World",
            "comment_content": "The content is pretty straightforward, mostly about details of the music cultures studied. You will have to be able to identify instruments, features of a culture and recognize the musical features of the songs studied like the texture, the rhythm and instruments. As long as you pay attention in the lectures, you will most likely understand and remember a lot of it. It is also very interesting and if you want to learn about some music history and how the music came to be, I recommend this course.",
            "comment_teaching": "The teaching is very interactive as the professor will ask loads of questions and try get answers out of you. Other than that, lots of examples are given and you will most likely retain a lot of the information because the professor makes it fun to learn and makes the lecture very interesting",
            "comment_grading": "Absolute grading and you will get an A if you get 93 or above. The assignments are also graded very leniently and you will get a high mark for both the case study and concert report if you follow the samples and apply what you learn in the lectures.",
            "comment_workload": "There are 2 major assignments and 1 quiz after every section. They are pretty straight forward and you will most likely get high marks as long as you pay attention. There is a mid term and final which isn't cumulative so that makes it somewhat easier. But overall, the workload isn't too heavy if you manage your time well.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0fcIEqqFEUjVcZah9iyXeaCo3EePde9w",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "harry0636",
            "date": "Oct 22, 2017",
            "title": "",
            "comment_content": "This course is about music of the world, including african, Latin American, Chinese..... Generally not interesting at all. There's a lot of specific terms that you have to memorize, which may be totally irrelevant to music theory, so it may be boring to someone who want to learn music from this course.",
            "comment_teaching": "He is trying to make those boring materials interesting. He gets well-prepared before the lesson so that if you pay attention to his teaching, you may find this lesson funny.",
            "comment_grading": "Absolute grading. The professor mentioned that at least 90% required to get an A, which may be quite difficult. Concert report as well as case study is subjective, which you can difficult to get a high score from this. You may have to work very hard to study mid-term and final in order to get a good result.",
            "comment_workload": "Quite heavy workload.<br />There are frequent online quiz that you have to complete, although you can just simply find the answers from powerpoint.<br />Moreover, the concert report as well as the case study will also cost a lot of time to finish.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RgCC3VmGClEcTeMO6jeBDxC4X3bmJmZ0",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JonathanY",
            "date": "Oct 21, 2017",
            "title": "",
            "comment_content": "Studying music of the world, eg. africa, arab, china etc. Any music background are welcome, but it only help a little even if u have some music knowledge. Most of the content is about the instrument and music culture of different places, and also why and how they exist.",
            "comment_teaching": "He is really nice and excellent opera singer. Not like other boring lecture, he will sing and play piano during teaching. Sometimes will invite all students to try to sing or play some rhythms&nbsp;&nbsp;together. Quite interesting.",
            "comment_grading": "Not Bad. SD and Mean means nothing. But the sub-grade has very narrow range. No A+ will be given.<br />A: &gt;93<br />A-: 90-92<br />B+: 87-89<br />B: 83-86<br />B-: 80-82<br />C+: 77-79<br />C: 73-76<br />C-: 70-72<br />D: 58-69<br />F: &lt;57<br /><br />Can easily get high marks in the quiz in canvas with lecture notes and google. Concert Report and Case study can get pretty good marks if you are not hea do it. The most important is the midterm and final have to recite the content, otherwise you cannot get good marks.",
            "comment_workload": "Quiz after every topic(eg. music from the country). Can easily get high marks in the quiz in canvas with lecture notes and google.<br />Concert Report and Case study need more time to be done. Just try to use the knowledge you learn from the lecture and use more example and comparison, and you can get quite good marks.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jy6GcdwyNxd5GvEn33jZMZTpi5emwICP",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bianca",
            "date": "Aug 22, 2017",
            "title": "",
            "comment_content": "好多嘢讀，讀除左歐洲古典音樂意外嘅其他音樂例如中國、印度、拉丁美洲嘅音樂等等。好多阿拉伯文非洲文樂器要記，上堂PPT成版都喺字，睇得好辛苦。",
            "comment_teaching": "個Pro try to make it fun. 上堂take attendance, 有時靜喺會對住ppt講，midterm 同 final會比份guideline，上面有成百幾二百個term，話如果你知曬喺咩來就會靠高分。",
            "comment_grading": "absolute grading.兩三分一個sub grade. 85% Above 1 sd got a B.",
            "comment_workload": "勁多嘢做，有online quiz 有case study 有concert review有midterm 有final.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9zZgQ36vbmtYS2vsyJQP63nXQmMI2WLg",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lilykam",
            "date": "Jan 29, 2017",
            "title": "",
            "comment_content": "從非洲到中國的音樂都有教,唯獨是樂理部分太淺了,學不到應用的知識。",
            "comment_teaching": "Quite interesting. Prof會唱歌給大家醒醒腦",
            "comment_grading": "很多人會拿高分, 就算學過音樂的人也未必能進來刷grade",
            "comment_workload": "Assignment不算多, QUIZ也普遍能拿高分,只是很多專業名詞要背(非洲文什麼的)",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sQYwUbukMJEyCB51Y50tgdWb0ZOpCBdY",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "non ono",
            "date": "Jan 12, 2017",
            "title": "",
            "comment_content": "Cover a lot of content and pretty detailed. All MC in Midterm and MC + fill in the blanks in final, around 100 questions. Discuss so much more than only music itself but also involves a lot of cultural material. Always good to have some music background but doesn't help much in this course.",
            "comment_teaching": "Great. Interesting teaching. Do a lot of listening and some singing in class.",
            "comment_grading": "Quiz+Midterm+Final+Case study+Concert Review+Attendance.",
            "comment_workload": "Super heavy workload for a 1- course. You need to memorise everything in the lecture notes and also familiar with the listening soundtrack. The case study is the worst, takes up all your time.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qKWBItNi6i5DbqjCRnHEKI2K1r4ql99N",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CHEN WEILI",
            "date": "Feb 16, 2016",
            "title": "Music of the world",
            "comment_content": "i thought it was about some beautiful pieces like Mozart or something but what a pity, i...was...wrong. Anyway it had nothing to do with those classical pieces, but all about musical cultures around the world, which was African, North American, Indian music... I have to say that the pieces were not so pleasant, sometimes annoying, and the exams focused&nbsp;&nbsp;mostly on its history and cultural backgrounds, anyway it's a HUMA class...",
            "comment_teaching": "the professor was quite humorous, not bad i think, although there're always some little spelling mistakes in the lecture notes hhh. his english was excellent but the vocabulary was quite professional.",
            "comment_grading": "my grade was B, which was not good I think. A range was not large, about 14%? My mid-term was totally mess, so make sure you do remember all the items in ppt, not just in the reviewing list he gives you.",
            "comment_workload": "there's a mid-term, a final, a case study which you need an essay of 1500-1800 words, and a concert report of about 600 words, as well as two simpler quizzes.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CmJ47zIS200dNZo43WgqgbtXIxsNXSQo",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "C666",
            "date": "Jan 26, 2016",
            "title": "suitable for ppl who love music",
            "comment_content": "For people who don't like music, it would be super boring. But for me, I think it is acceptable. Basically you just have to rmb all the notes and songs are ok. Easy level.",
            "comment_teaching": "He is a good teacher in lesson he always wants to make our class interesting but it is still boring in fact. All the locals are very quiet in class.",
            "comment_grading": "Standard grading, very bad.<br />He said he would not give out any A+.<br />For me , total 88.8% &gt; only B+<br />my case study : 92/100 (mean 87)<br />concert report: 90/ 100&nbsp;&nbsp;(mean 89)<br />midterm : 79/ 100 (mean 71)<br />final: 85/100 (mean 70)<br />Case study and concert report don't matter,<br />so work hard on the midterm and finals.<br />For participation, you can skip 3 lessons.",
            "comment_workload": "Heavy workload. A lot of songs to recite in exams.<br />I spent many nights on my case study (over 3000 words tgt with evidence, log, pictures and videos) but the mark is still low.&nbsp;&nbsp;<br />There are also 2 quiz but you have one day to finish and almost everybody got full marks.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LIa99krDsZ5dip5zap7dgL6hLQusAca2",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "pjj",
            "date": "Jan 24, 2016",
            "title": "Huma Music",
            "comment_content": "it is comprehensive and suitable for anyone who wants to have shallow but wide knowledge of music. The professor also requires us to buy a book but it is not necessary for preparing for exams. You can look at the powerpoints to pass the exams. Overall its pretty good in terms of content.",
            "comment_teaching": "It is a bit boring because the lecture hall is big and easy to lose focus when people on the back are talking. Some people leave the lecture hall after they take the PRS so it is tempting to go out during middle of the class.",
            "comment_grading": "The grading is pretty bad. I got A's in two reports and participation, B's in one midterm and final. Overall I got a B",
            "comment_workload": "The workload is not heavy. You just have to take close look at the powerpoints before exams.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RWkwIrgY2R2N0W4R182e7vL3ST6Vqf3N",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sylvester",
            "date": "Jan 21, 2016",
            "title": "Average course",
            "comment_content": "Dont have a lot to add on the contents of the course, most of them have pretty much been mentioned by previous reviews. But remember you do not necessarily need to have a strong music background (or even a single knowkledge on music) in order to survive or get good grades in this course. You can treat this as a history course instead of a music course.",
            "comment_teaching": "The professor teaches well, even with occasional jokes. He is patient to students' questions, no matter in-class or through emails.",
            "comment_grading": "The professor has indicated clearly that he rarely gives out A+ and he gives A- or A to the top 1x% students. I personally got about 91% of the overall course mark and ended up getting an A-. In overall, this is in fact not a course with particularly good grades.",
            "comment_workload": "The workload is not that heavy in fact. The professor will assign 3x pages of readings after every lesson but usually the exams wont cover those contents so no worries.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TfnuMQjLkFtiDU7dwTzuaFPa7dKJsGKO",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "VL",
            "date": "Dec 30, 2015",
            "title": "POOR Course",
            "comment_content": "Study about African Music, South American Music, Latin American Music, Arabic World Music, Indian Music and Chinese Music. Contains a lot of new words to memorize, and need spend much time for studying.",
            "comment_teaching": "Quite boring, though there are a lot of listening in class, and professor tried to cheer us up, but the overall atmosphere was not good.",
            "comment_grading": "Poor, very narrow grading range, my friend got a B for overall 81%, I got a C for 77%. Need to do well in mid term and finals. Concert report and case study proposal don't matter.",
            "comment_workload": "1%Case study proposal<br />19%Case study<br />10%Pre quiz 1+2<br />10%Concert Report<br />10%Attendance<br />20%Mid term<br />30%Final",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "m2DZYqmUovJ5h89W7NVRsNw1za3hvyAO",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gossipgirl",
            "date": "Dec 21, 2015",
            "title": "",
            "comment_content": "The content is pretty nice. Discusses 6 cultures. <br />Africa, North America, Latin America, Arab World, India and China. Introduces music music terminology and relates them to these cultures. <br />Exams are pretty much based on the notes.",
            "comment_teaching": "He is a really good professor. Gives nice examples and explains well. Attendance will definitely make your work easier.",
            "comment_grading": "Grading is nice if you satisfy all the course requirements well. Its slightly different from other courses. A mix of absolute and relative grading.<br /><br />Need a 97% + to get A+. <br />Not hard to get, but narrow margins can change your grade very easily",
            "comment_workload": "The main issue with the course is workload. Although the course is interesting and fun, doesn't mean we don't have any other courses. <br />Attendance - 10%<br />Case Study - 20%<br />Concert Report - 10%<br />Midterm - 20%<br />Final - 30%<br />2 Quizzes - 10%<br /><br />Its not very difficult to do everything, but can be a bit tiring.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sR0fXrwi5acGXaGW55LpDFLHVENnomkY",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "John Ma",
            "date": "Dec 15, 2015",
            "title": "Meaningless Race to Who Can Memorize the Most African/Arabic Words",
            "comment_content": "The title says it all. As a common core HUMA course, the name 'Music of the World' can trick you to think it is a rather easy course. NO. See the workload and teaching.",
            "comment_teaching": "The lectures are boring as hell because Isaac has a bad sense of humour although he tries his best to engage the students by asking us to stand and do stretches in the middle of the class.<br /><br />[Worst lecture notes]<br />Not concise. Very messy. Expects us to find the definitions of word lists on our own. (he gives a word list every midterm/final and says those words will be examed, however no definitions are give and we have to find them ourselves)<br /><br />He also tries to invite a guest speaker to talk about Chinese music but the speaker was also very boring and we were just given clips of the speaker playing the Sanxian.",
            "comment_grading": "The grading is rather fine because as long as you can write reasonable reports and reason well. Although the Canvas quizzes are pretty stupid, it took us hell a lot of time to get full marks.",
            "comment_workload": "Very heavy. This is just a 3-credit course and the workload can match a 5-cred course.<br /><br />Midterm+Final (MCQ plus map questions plus fill-in-the-blanks)<br /><br />2 Reports (Case Study + Concert Report): both have to be around 1000 words.<br /><br />2 Quizzes (stupid Canvas quizzes)<br /><br />PRS (every lesson, 3-4 buffers before you get mark deduction)",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Y1wqF2prVxLpvPPAxsy9FW78OPRIzPQG",
            "semester": "2013-14 Spring",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kaz Stephen",
            "date": "Aug 28, 2015",
            "title": "Short Review",
            "comment_content": "讀一D世界各地(eg.非洲, 美洲, 歐洲)既音樂同歷史 上堂會聽下唔同音樂同睇片 一D平時大家見到既樂器就會少見D",
            "comment_teaching": "個Instructor係好有心機教既 佢既英文都叫易聽 上堂都幾輕鬆既 不時會有一D互動 Send Email問佢都會好快就覆 真係對音樂有興趣既同學應該會同佢好好傾",
            "comment_grading": "都幾好Grade 全班冇乜人Fail/D 最多既係B range 可能一班多人上掛",
            "comment_workload": "基本上要背晒佢既Notes同記熟唔同音樂category既melody 有冇音樂底其實唔係真係太關事 最多係一開始jargon會令有音樂底既人有advantage",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oagCuNd3QzvQ9oeR31bvFOHK5bCQljVt",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "N",
            "date": "Aug 23, 2015",
            "title": "有音樂底子的人會更好GRADE",
            "comment_content": "學到世界各地音樂文化, 歷史, 樂器等等, 絕對唔止平時接觸到既西樂/中樂, 但都幾多notes",
            "comment_teaching": "上堂有些少悶, 但有好多音樂聽, 有互動遊戲, Professor其實好有HEART教書,但可能D學生聽唔明比唔到反應, 希望學過音樂/有底子既人會上下佢堂, 其實唔差",
            "comment_grading": "唔拉CURVE, Absolute grading<br /> 因為MC其實算易, 如果<br />1) 背得夠熟<br />2) 有音樂底子 (optional)<br />3) 上堂有聽書/就算唔聽都有睇返VIDEO<br />Take attendance有用",
            "comment_workload": "有LMES QUIZ但係屋企做,當溫書,送分<br />1 midterm, 1 final exam<br />有2份Assignment, 一份長文,自訂題目, 一份係聽音樂會既feedback, 其實有好多時間prepare, 對音樂其他方面有興趣既人應該會更易上手, 中意research寫文既人都無難度",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cvIij23yr48cKBTDUmTIpQoAcX9VvmUB",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gwamba101",
            "date": "Jan 26, 2022",
            "title": "",
            "comment_content": "COURSE OUTLINE:<br /><br />This course is a survey of selected world music outside the Western European tradition. Students will learn to understand world music through aspects of culture and society.<br /><br />INTENDED LEARNING OUTCOMES:<br /><br />On completion of the course, students should:<br /><br />have developed an interest towards world music<br />be able to comprehend basic ethnomusicological terms and concepts and the background information of each studied culture<br />be able to identify aurally the characteristics of the world music studied and discussed<br />be able to demonstrate an understanding of the relationship between music and culture",
            "comment_teaching": "His teaching style was appreciated. While the content sometimes got quite boring or text/fact heavy, he tried to mix it up by including examples when necessary. For example, he would show music videos or audio clips and even once created a song to help make the class more interactive.",
            "comment_grading": "Attendance of Lectures 10%<br /><br />5 graded online reviews 10% (Mostly M.C.)<br /><br />Midterm 20% (Mostly M.C.) <br />Final Exam 30% <br /><br />Understanding of the relationship between music and culture and the creation of music.<br /><br />Discussion posts 10%<br /><br />Case Study 20%",
            "comment_workload": "The workload is not super light, but also not the worst. There is usually one timed quiz every week or every two weeks, but they are quite easily and open book/note. The information can be found on his powerpoints, which he posts on the canvas. There is also a final project which takes quite long to plan, film, and edit, but still can be done in a few days if you procrastinate.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "T0207etzcRPupYMJIXVcajOequ09xMTr",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "hi_hello",
            "date": "Jan 14, 2018",
            "title": "",
            "comment_content": "This course is literally about the music of the world. Students learn about the music and the culture behind places like Africa, India, and China. If you have interest in learning about history, culture and any other information related to memorizing instrument names, you should take the course. Otherwise, I advise you not to take it. The professor gives us reading assignments, but I did not do them.",
            "comment_teaching": "The professor is nice. He usually sings in class. He also often plays the piano. He also brings strange instruments in class for us to observe.",
            "comment_grading": "It is absolute grading. Attendance, case study, concert review, mid term, final and quizzes are all part of the grade.",
            "comment_workload": "You have to write 5000 word essay about a music culture of your choice. A lot of things to do. I do not recommend people to take the course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xQG04nilYIcRsY5VG8sFi3hXDVPuvGgL",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sableye",
            "date": "Dec 06, 2016",
            "title": "Worst course I have taken in 4 years of my study",
            "comment_content": "Like what the other reviews have mentioned, this course is basically all about reciting. You are required to know many languages/cultures like Indian, Middle East, Chinese, Black, South American etc. There is nothing useful about this course, and I would not remember a single thing from this course a two days after the exam, except that I would probably remember this is the worst course of my life.",
            "comment_teaching": "At least the professor is nice. But he doesn't even proofread his materials, which have a lot of low-level grammatical errors. Even a student with bad English like me could spot like 5 errors every powerpoint, which makes me think that the professor doesn't really care about language when he has to grade people based on &quot;grammar and spellings&quot;. Jokes.",
            "comment_grading": "Semi absolute grading. Very unfair deadlines. Yeah true the professor is nice and he always extends the deadlines and stuff, but I worked my ass off to meet the deadline, and after the deadline he told everyone that the deadline is extended so everyone can be able to have a longer time for the quiz/assignment. thank you so much for wasting my precious time.",
            "comment_workload": "Extremely heavy workload, as mentioned by other . Heavier than my major courses at 4000-level. <br /><br />Case study, concert report, attendance every lesson, quiz every other week. All pointless.",
            "rating_content": 1,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8v4qgMRZMQdpGtM0MJcSvmgpFpZI9ulH",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "timothio",
            "date": "Aug 23, 2016",
            "title": "Register if you are a reciting machine",
            "comment_content": "the content is all about different cultures and their music.&nbsp;&nbsp;It is certainly fun to learn about the interments in Africa and how people in Arab make music. If you are interested in music, you will definitely find this course entertaining, BUT entertaining doesn't mean you are having a great time studying it.",
            "comment_teaching": "The teaching style is straight up reading powerpoints.&nbsp;&nbsp;Nice guy, easily get annoyed by crowd chatting.&nbsp;&nbsp;Nothing special, just common uni professors.",
            "comment_grading": "The grade is pretty poor. As people are very good at reciting content in the powerpoint slides, you can expect the mean to be very high.&nbsp;&nbsp;Making careless mistakes in MC questions will definitely give you a bad grade.&nbsp;&nbsp;<br /><br />One thing to mention, the final exam requires you to remember the name of the instruments in other languages and fill in the blanks.&nbsp;&nbsp;No idea how it helps to learn music.",
            "comment_workload": "The workload is pretty heavy to be honest.&nbsp;&nbsp;Reciting large amount of content and remember the names and instruments in a foreign language is pretty tedious and time consuming.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "L7lQFvp7BPVubnYzxL8gB9nBkFU1uKjt",
            "semester": "2015-16 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Johnny Deep",
            "date": "Jan 11, 2016",
            "title": "HUMA1100",
            "comment_content": "Same as the course code. You will basically learn some basic concepts about every music style in the world.",
            "comment_teaching": "He teaches well. Plenty of music examples are given. For those who are not interested in music may find the lecture boring but to be frank, I think he is doing a good job that you will appreciate.",
            "comment_grading": "If you spend enough time to study the notes good enough, you should have done well in the exam. <br />The more you pay, the more you gain, I would say.",
            "comment_workload": "Reasonable. You can simply study the notes just before exam and spend a day or two doing those reports. Again, The more you pay, the more you gain.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6EPbSGc8iTfJH4Yj6QyQcCNRmkdUpgCb",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 304,
                    "name": "DROSCHA, Isaac David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "luke_lu",
            "date": "Jan 06, 2022",
            "title": "Travel with music",
            "comment_content": "Music of: <br />Africa, Black America(pre- and post-slavery), Arab, Latin, India, China<br /><br />This course will introduce each musical culture with examples, relevant history, instruments. (you will need to memorize all of them!)<br /><br />you will learn a lot about non-mainstream music. Interesting class if you like music in general. Also good CC",
            "comment_teaching": "Prof is a funny person. He goes through slides and example videos in class.",
            "comment_grading": "QUIZZES 10% (20 MC, timed, open book)<br />Discussions 10% (just write whatever)<br />ATTENDANCE 10% (random)<br />CASE STUDY PROPOSAL 1%<br />CASE STUDY\t19% (12min video)<br />MIDTERM EXAM\t20% (MC +fill in the blank + listening)<br />FINAL EXAM\t30%&nbsp;&nbsp;(MC +fill in the blank + listening +Essay)<br /><br />Absolute grading<br />90%+ A range<br />80%+ B range<br />etc,<br />Pretty easy to get A",
            "comment_workload": "Luckily online open book exams and quizzes this term. There are many terms to memorize.<br />For more about the final exam see the attachment <br /><br />Most of the in-term workload is from the Case study. You will need to do a 12 min video about any (non-western) musical culture. Could be any culture no matter big or small. (I did Vocaloid culture lol)<br />You can(should) start working on it early.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "1yIMlfDLgSubjOFip9KVdGcOhqGjkgwl",
                    "name": "Review Guide for HUMA1100- for final exam FALL 2021",
                    "format": "docx"
                }
            ]
        }
    ],
    "composer": []
}