{
    "error": false,
    "course": {
        "id": 558,
        "subject": "HUMA",
        "code": "2300",
        "name": "Traditional Chinese Poetry: Early Chinese Poetry",
        "description": "A study of the origins and early development of classical Chinese poetry. Shijing, Chuci, folk songs, and major poets from the Han and the Six Dynasties are examined.",
        "categories": [
            "Common Core (H)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2030,
            1840,
            1740,
            1540,
            1440
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.56,
        "rating_teaching": 4.22,
        "rating_grading": 4.44,
        "rating_workload": 4.56,
        "review_count": 9,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 898,
                "name": "LI, Siya",
                "count": 8
            },
            {
                "id": 683,
                "name": "WONG, Wai Ho",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "PpGRGXmqiTPmUwTyvSEcC0uKt8nBD9aW",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 898,
                    "name": "LI, Siya",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AnsonChengacac",
            "date": "Dec 28, 2022",
            "title": "If you are interested in Chinese Poetry",
            "comment_content": "see other's comment, i write comment becuz long time no one update this course content loll<br /><br />content-wise, can learn some famous early poetry geh<br /><br />*But one thing changed is that no need to memorize poem in final (more tips in workload session",
            "comment_teaching": "professor spent quite a lot of time to encourage students or speak some principles for how to be a good person (aka 雞湯/大道理)...someone like someone dislike this kinda teaching style, but good thing is u can late for ard 10 minutes cuz usually he will speak for quite a while at the first session of the lesson... bad thing is prof can't taught all content, missed around 20slides at the last lesson i guess<br /><br />in terms of teaching, he focuses on the understanding of the poem itself but not the ancient word in the poem, this is quite good",
            "comment_grading": "umm..same as previous semesters<br />80% final<br />10% assignment<br />10% participation<br /><br />participation is based on your performance in final, so u may consider final takes 90%, noted that final is on the last lesson in the semester instead of the exam period.<br /><br />grading is all unknown, idk my score for my final and assignment, but this professor will mark your submission sequence when submitting the final paper (e.g. u are the 10th person to submit the paper), so it might be a criterion for grading?(earlier submit hv better grade?)<br />anyway, i got an A...",
            "comment_workload": "very low workload, just one final and an assignment<br /><br />assignment can be any creative work that related to the course, i just wrote a poem, quite easy, just spent me half an hour<br /><br />for final, it has two sessions, one is fill in the blanks and second session is long questions.<br /><br />it is open book quiz, so u don't need to memorize the poem but memorize which poem is taught and its content in the semester.<br />1) fill in the blanks<br />e.g. i saw peach blossom and thought of someone have a good marriage, then u should answer 桃花夭夭..sth like that la<br />strongly encourage u write a list of poems and write some keywords to remind u, very useful to save time<br />2)long questions, two questions<br />2.1 about the ideal marriage relationship<br />sth related to 關睢<br />jot notes on prof comments on this poem plus your understanding, not just the meaning of the poem itself<br />2.2 how poetry describe time to convey message/sentiment<br />quite complex question, u hv to differentiate different styles of poetry to describe time<br />e.g. direct describe - time flies<br />indirect describe - flower wilts, i afraid i become old<br />sentiment change (same content, but time different got different sentiment)<br />internal change (internal thought memorize past sth, but suddenly change to describe external things to describe current thing eg子衿)<br />that's my answer la, fyr",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WRq6FCt3kBRqArwWctzNAoWgeREnZKpO",
            "semester": "2022-23 Summer",
            "instructors": [
                {
                    "id": 898,
                    "name": "LI, Siya",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JasonYTC",
            "date": "Aug 21, 2023",
            "title": "Chill common core course",
            "comment_content": "詩經,<br />楚辭,<br />漢樂府,<br />古詩十九首<br /><br />Each ppt slide has 200+ page, 2 lesson per each ppt.<br /><br />Prof LI will simply just explain the surface meaning of these poets.<br />each poet is not diffcult, just some story telling, most of them is about love.<br />(some have 3 paragrah of long sentence but those paragraph has the same meaning, just soem words or terms changed, so don't be scare)",
            "comment_teaching": "As other student commented,Prof LI mixed the poet with some &quot;chicken soup&quot;. If you are insterest you could listen to his philosopy speech. Else you could do your own stuff during some course unrelated stuff. (I didn't mind that much as i attend this course just to achieve common core requirement.)<br />Prof Li is also welcomed to let students poet topics with him, you are free to express your opinion if you are interest in poetry.",
            "comment_grading": "20% Assignment<br />80% final<br />they didn't realease any score but i got a B+ which is not bad for students who choose this course just for a common core course ( I am just an engineering major)",
            "comment_workload": "As a student who is not good in 文言文(Lv3 in dse), the course is still a chill course for me.<br /><br />For assignment, you need to sing a poetry and create some work related to the course, i use some given poets from the course and reworte them, mainly about the news and stories around my own life. I wrote 3 in total. Not hard.<br /><br />For exam in first part, you need to use a sentence in poet to fill in the blanks, not so diffcult if you know the things related to the sentence like the tree, anilmals or the place.<br /><br />For second part, it is 2 long question, love and time, you could see other comments for details.<br />Professor already list some hints for you.<br /><br />Tips: try to sythersis the love and time conveyed in all poets and group them, draw mind map about these topic, how many and what are their characteristics? What are the example?. It took me 2 hours to prepare these reference.<br />I worte around a page full in each question",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3ulhvODrnV13Z1ZNXAmHXnJIigoIYfJg",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 898,
                    "name": "LI, Siya",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "francy l",
            "date": "Aug 19, 2019",
            "title": "A rather good choice for huma ccc",
            "comment_content": "This course mainly talks about typical ancient Chinese literature, and the time span is from the Spring and Autumn Period to the early Han Dynasty. <br />The professor usually spent 2-3 courses to introduce one typical book/poem selections. First, the background and the content of this work were introduced, the following classes would talk about some pieces of work selected from the book.",
            "comment_teaching": "Professor LI likes to share his thoughts about life or some incidents while teaching those poems, along with his personal experiences, which are quite fun. As for the textual explanation, it was kinda boring, since he can't explain the work and perfectly convey emotion to students, but still the contents are worth learning.<br />He is willing to hear advice about the teaching from students and quite patient.",
            "comment_grading": "10% participation <br />10% self-create work<br />80% final<br /><br />-professor said in class that usually the participation mark would be 10%, unless you did very bad in your final, under this situation he would directly give 0% in your participation.<br /><br />-Though you will not get your scores at last, it still can be inferred that there's no much difference between participation mark and your self-creation, final is what you have to be ready about.<br /><br />-final usually have (20/80)&nbsp;&nbsp;poetry dictation<br />（60/80）long questions",
            "comment_workload": "The workload is rather low compared to other human courses, but still you have something to read and memorise in order to get through your final.<br /><br />-memorising 20 poems is compulsory, and if you want to get higher marks, you have to recite more.<br /><br />-after every class there's a reading material for you, similarly, you can choose whether to read them or not, but they are more or less related to your final.<br /><br />-self-create work is easy since there no format restriction, you can hand in whatever you like, as long as it's related to the courses.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "w3V68BEqeBYVzNogQSPwWoJsaNmrg0fe",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 898,
                    "name": "LI, Siya",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nick_W",
            "date": "Aug 18, 2019",
            "title": "",
            "comment_content": "The content of the course is quite flexible. Some content that Prof mentioned in class are not cover in neither lecture notes or exams, but are quite interesting. Furthermore, there are some reading materials provided which are even more comprehensive than the lecture notes and can be super helpful.",
            "comment_teaching": "Most of the time Prof didn't just cover the content in the lecture notes, but also some background story or related knowledge, which can be fun.",
            "comment_grading": "No midterm exam or quiz.<br />Final exam 80%<br />Attendance 10% <br />Project 10%",
            "comment_workload": "No homework or assignment, but you have to remember those poems.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HbAlP9kSqL6kmXSPN4gCDM3kJfsh6MXQ",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 898,
                    "name": "LI, Siya",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "數學研究生",
            "date": "Aug 07, 2019",
            "title": "If you love Chinese poems, this is a great course for you to explore",
            "comment_content": "Since this is a summer course, there are only a few poems and chuci required to remember.<br /><br />For this semester, only 20 poems and chis required to memorize.<br />Six Dynasties in ShiJing: Feng, Ya, Song, Fu, Bi, Xing.<br /><br />ChiCi: Li Sao and Shan Gui",
            "comment_teaching": "Professor Li is a great instructor not just taught you the content of this course. He discussed the value of humanity and how we should face our lives during lessons.<br /><br />He let us read the poets in the lesson together and asked some of the students to spell in class. Quite interesting.",
            "comment_grading": "By comparing to other huma courses, I think the grading in this course is much better than others.<br /><br />Participation: 10%<br />Creative Assignment: 10%<br />Final Exam: 80% (20% for memorizing poets, 60% are short questions and a long essay)<br /><br />Marks are unknown, but it should be fine if you put enough time for studying.",
            "comment_workload": "Memorize 20 poets and ChuCi, it takes time but some of them should be covered in high school.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Qsv6ZoEPPRYjME55suP8sNAHeYJAM8z3",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 898,
                    "name": "LI, Siya",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "llllllamy",
            "date": "Feb 23, 2020",
            "title": "Traditional Chinese Poetry: Early Chinese Poetry",
            "comment_content": "This is a course about Chinese early poetry. Overall, I think the course is quite plentiful because the teacher teaches more than 50 poetries in a month including several long poetries. It is taught in Mandarin thus most students are from mainland while still some students are local. I am interesting in Chinese poetry but I feel boring most of the time in class.",
            "comment_teaching": "I think teaching is good. If you have questions you can ask whenever in the class and there are also interactions between teachers and students. <br />The teacher teaches in a flat tone so sometimes you may feel sleepy and boring in the class. <br />The teaching is fast so it is better to attend every class in order to memorize the poetries easily in the end.",
            "comment_grading": "I think the grading is quite fair and good. <br />10% assignment<br />10% participation<br />80% final<br /><br />For the assignment you can do anything you like as long as it is related to the material that is mentioned in the class. It is handed in at the end of the summer semester just after final exam. The forms includes writing, composition, drawing, etc. <br /><br />For the participation, it is assessed according to the final exam grade. Teacher says that as long as you get a good grade in final you can get full marks in participation. So the final actually accounts for 90%.<br /><br />For the final exam, actually you don't need to worry about the quite large portion of the whole grading. Final mainly tests you how well you memorize all the poetries in the class as well as some understanding and poetry parsing of the poetries taught in the class. You need to write a lot in the exam so it would be better if you try to memorize as much as possible to give examples in the final exam.<br /><br />I think A range is not difficult. I don't know the final grade but I get an A. And a local student sit next to me get an A+. That's why I think grading is good. :)",
            "comment_workload": "I think the workload is moderate. <br />There is about 10 reading materials which are long and difficult to read. Teacher will recommend you to read some of them for the final exam. Actually I didn't read most of them but it didn't affect the final grade.<br />And you also need to memorize all the required poetries, some of which are long and difficult to pronounce but there are some poetries that are already learnt in high school of mainland.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "di2UtN8D4cQX0QuQygbBWddLYHPyw4DU",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 898,
                    "name": "LI, Siya",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fishfish",
            "date": "Aug 21, 2019",
            "title": "such a good grade course",
            "comment_content": "I am interested in traditional Chinese poems so I enjoy the content very much.<br /><br />The content includes:<br />《詩經》, 《離騷》,《九歌》,漢樂府, 古詩十九首",
            "comment_teaching": "The course is taught in Putonghua as the professor comes from mainland china. As a local student, I still can listen clearly and well during the lessons. Sometimes it was quite boring while explaining the textual content. However, the professor likes to share his personal stories/ experiences and then grab my attention back.",
            "comment_grading": "80% final:<br />20% will be dictation of selected poems, 60% will be 4 shorts questions and 1 long question (the professor will give tips for the final exam)<br /><br />10% participation: (did not take attendance, officially)<br />the participation score actually depends on how you do in your final exam. If you do well, then you will get full 10% of participation. It is because the professor believes that students will do well in their finals if they attend lessons. (Though I think showing up in classes does matter, at least he can recognize you)<br /><br />10% art work: (the art work will need to be related to things taught in the class) this is so subjective. If the professor thinks your art work is nice, then he will give you high marks on it. 7% will be scored if your art work performs averagely. The professor normally will not give you a very low mark unless your art work is really a piece of shxt.<br /><br />*I got a A-range*",
            "comment_workload": "I personally think the workload is low. All you have to do is to attend classes, do well in the exam, and make a piece of art work.<br /><br />The final exam will get quite a lot to memorize. You will need to memorize 20 poems for the dictation in the final. If you want to get a better score in the final, you will need to memorize more. Just memorizing the 20 selected poems and use them in the short and long questions, you will just get a passing mark (maybe a C).<br /><br />I did not really read every reading material. I just read a few which the professor reminded us to read. So I don't think the reading materials are that important. Just choose some to read will be fine.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aXskdQcUiQCMdx7Q0JhCQ7D3Vo1shHk4",
            "semester": "2022-23 Summer",
            "instructors": [
                {
                    "id": 898,
                    "name": "LI, Siya",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "黄子恒",
            "date": "Jul 17, 2023",
            "title": "",
            "comment_content": "all the content is interesting for sure. really help you to know things about early poetry. although the ppt is talking more thing about the exam. learning more is not a bad idea.",
            "comment_teaching": "if you like chatting and knowledge about Chinese history go ahead.<br />lsy is a knowledgeable professor. he knows tons of things about Chinese culture. <br />but if you are just a cga fighter or don't like this kind of thing, then you have to think twice. LSY's attitude about things including science is kind of shocking to students like me who study technology<br />(I like the way he teaches but do not like the opinion he has. but you guys need to have your own mind and not just follow others' recommendations including me and Li Siya)<br /><br />(but tbh I only attend 3 classes and all other classes are done by video)",
            "comment_grading": "so far idk yet. but the exam is divided into two parts first in writing. with a background dialogue and require you to write poetry.<br />the second part is a question-answer part. he will give you two long questions and want you to answer. <br /><br />the long question will be told during classes so maybe you need to attend the classes(however I don't )<br /><br />plus part 1 is kind of difficult if u don't attend classes (I go over all video at least 3 times so kind of easy)",
            "comment_workload": "very very small.<br />only workload is to make your own poetry and record one song which he will give you an example mp3. just listen to mp3 with earphones on the computer and record it on your phone really EZ",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "flvgypGP30CGmnl1upIDoD1kXDfUK1iB",
            "semester": "2017-18 Summer",
            "instructors": [
                {
                    "id": 683,
                    "name": "WONG, Wai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "哎呀",
            "date": "Aug 18, 2018",
            "title": "嘉树下成蹊，东园桃与李",
            "comment_content": "课程讲述早期中国诗歌，从先秦直至隋朝，最后一堂又补充介绍了唐诗对早期诗歌的继承。每堂三小时，最后一小时为小组汇报，三到五个同学一组，自由结合，包含以下诗歌：关雎、离骚、陌上桑、孔雀东南飞、古诗十九首、赠白马王彪、七哀诗、归园田居、拟咏怀诗、何逊及阴铿、昔昔盐。课程用普通话授课，最后两堂讲诗歌音律的时候间或使用广东话。每堂课补充很多非常有趣的东西，比如登幽州台歌是不是陈子昂写的，当堂播放两段电影录像让大家讨论哪个更接近曹操短歌行的真实场景，隋炀帝“不欲人出其右”等等，每堂课上完之后都收获满满，而且下课之后还可抓住教授探讨其它有趣的问题。",
            "comment_teaching": "手不释卷，目不暇接。热爱古代诗歌的同学实在不容错过！",
            "comment_grading": "出勤10%，中期考试20%，小组报告20%，学期论文50%。教授同时负责讲授HUMA2310课程，评分标准大致相似。<br />在下期中考试表现不佳，不过自认其它方面表现尚可。",
            "comment_workload": "因人而异。除课堂教授的知识以外，也可以尝试创作近体诗，电邮往来或课下探讨时教授会给出很细致的指导，是学习提高诗歌创作水平的好机会。教授也会在堂上展示自己创作的律诗。",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}