{
    "error": false,
    "course": {
        "id": 2967,
        "subject": "HUMA",
        "code": "1000E",
        "name": "Cultures and Values: Freedom, Justice, and the Good",
        "description": "This course focuses on conceptions of the “good life” and justice in relation to questions of human and environmental flourishing. We will consider issues such as the practices and values that are involved in a good life and a just society; whether ethics is universal or particular and what we owe our nations and humanity; the reality of conflict and how conflicts might be resolved or managed; the morality of human nature; environmental and animal ethics; the ethics of war and peace; utilitarian, deontological, virtue and existential ethics. These issues will allow students to reflect upon a range of values in both their personal and public lives involving the nature of goodness, rightness, justice and the common good in modern social-political conditions.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2110,
            1910
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.44,
        "rating_teaching": 4.22,
        "rating_grading": 4.61,
        "rating_workload": 4.5,
        "review_count": 18,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 326,
                "name": "NELSON, Eric S",
                "count": 17
            },
            {
                "id": 422,
                "name": "TANG, Kin Hun",
                "count": 4
            },
            {
                "id": 1147,
                "name": "LAW, Chun Yin",
                "count": 4
            },
            {
                "id": 302,
                "name": "HO, Susanna Pui San",
                "count": 2
            },
            {
                "id": 443,
                "name": "MAK, Linda Yeung Oi",
                "count": 1
            },
            {
                "id": 1304,
                "name": "LAU, Chun Hong",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "tDjM9trum1upz2KJnQKz9FOCVwbDTy0T",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Chl523",
            "date": "Jan 19, 2020",
            "title": "",
            "comment_content": "Philosophy on justice, the good, and freedom <br /><br />Module 1: Socrates, Plato and the good <br />Week 1: Why be moral and what is the good<br />Week 2: Do will and belief or should the good have priority?<br />Week 3: What is the best life worth living?<br />Week 4: Should we obey the state’s judgments?<br /><br />Module 2: Freedom and Power (Hobbes, Rousseau, Kant, and Mill)<br />Week&nbsp;&nbsp;5:&nbsp;&nbsp;Are humans only self-interested and a strong state must control them?<br />Week 7: Are inequality and hierarchy natural?<br />Week 8: Is humanity striving for social-political Enlightenment and progress?<br />Week 9: What are the roles of liberty and government in society?<br /><br />Module 3: Good and Justice<br />Week 10: Hannah Arendt on banality and conscience<br />Week 11:&nbsp;&nbsp;Should we commit to cosmopolitanism or nationalism?<br />Week 12: Liberal, Republican, and Deliberative Government",
            "comment_teaching": "His teaching is quite detailed but at a slow pace. I would recommend watching his lecture videos at 1.5 x speed.",
            "comment_grading": "Both quizzes above mean.<br />The mark of the final essay were unknown<br />At last, got an A.",
            "comment_workload": "The workload is normal as we only need to attend the writing workshop bi-weekly. No preparation work is needed before attending the workshops. Online assignments need to be completed every week but it's easy.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "l1MdntzZjln9OP0eWX3Vk3fUFihYIqYa",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                },
                {
                    "id": 1147,
                    "name": "LAW, Chun Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ashypothesis",
            "date": "Apr 23, 2022",
            "title": "Great philosophy common-core",
            "comment_content": "Examine basic questions regarding ethics and politics in “Western” Philosophical Traditions.<br />1. The Good: Ancient Greek Origins: Socrates, Plato, and Questions of the Good and the Good Life.<br />2. Freedom and Justice: Modern and Contemporary Liberal and Anti-Liberal Political Philosophy.<br /><br />Required reading: <br />- Thomas Hobbes, Jean-Jacques Rousseau, Immanuel Kant, Karl Marx and Friedrich Engels, John Stuart Mill, Rosa Luxemburg, Hannah Arendt, Jürgen Habermas, Isaiah Berlin, Rahel Jaeggi<br /><br />For each lecture one philosopher is discussed. Quite good breakdown for those who get started with philosophy concepts.",
            "comment_teaching": "The contents are well-organized. Prof Nelson gives in-depth explanation of the concepts. He didn't put everything on the slide so you need to listen to the lectures to have better understanding. He talks bit slow but has a great pronunciation.",
            "comment_grading": "2 Lecture quizzes - 20%<br />Online discussion - 10%<br />Online activities - 10%<br />Writing workshops - 10% (attendance count)<br />Final essay - 50%<br /><br />Lecture quizzes are closed-book. I think the difficulty is fair, as long as you study the slides and listen to lectures.<br />The online activities have no time limit and unlimited attempts. Basically, free marks.<br />Writing workshops teaches you how to write an essay. There are some homework assignments for the workshop (essay-related, good way to track essay progress)<br />Strongly suggest take part in online discussion actively. One post per one discussion won't help the grade. <br /><br />For the final essay, make sure to meet all structure requirements (especially reference). They will give you feedback in the workshops before final submission.<br /><br />Overall good grading.",
            "comment_workload": "Average workload.<br />Attend workshops weekly + complete all tasks in time. <br />No attendance for lectures so watch recordings is acceptable. Personally I found lecture discussions quite interesting and worth a go.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WS7nILGRVsEFcEDc0tGOQl47UZ2RpPC1",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jwc",
            "date": "Apr 04, 2022",
            "title": "Good choice for CC",
            "comment_content": "Split into different philosophers and their perspectives on freedom and justice (Hobbes, Kant, Karl Marx, Habermas, etc.)<br /><br />Has philosophers from different cultural backgrounds, content overall quite interesting.",
            "comment_teaching": "Professor's teaching is quite good. The materials are really hard to understand, can't understand if just read the readings. But understand much better after he teaches the concepts.<br /><br />He will give you the background before talking about each philosopher, what is happening during that period in the philosopher's country.",
            "comment_grading": "Fair grading<br />Depending on the essay-50% of total grade (make sure to ask about the essay draft in the tutorial and how can improve)",
            "comment_workload": "Average workload.<br />2 in-class quizzes (20 MCQs), close book<br />- Questions are straightforward and ask about the concept and main argument of each philosopher<br /><br />Essay<br />Has only 5 writing workshops (only 5 tutorials instead of one every week)<br />Canvas online discussions and need to finish some tasks before each tutorial",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "mNQdVLGzRKP8DW189Kkb1byP3R2Yt8dz",
                    "name": "HUMA1000E Course Outline (Fall 2021) 2021-9-18",
                    "format": "docx"
                }
            ]
        },
        {
            "hash": "rQ8hmXLW2duGWWOsURyP1DiyJ4Y7gkKH",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                },
                {
                    "id": 1147,
                    "name": "LAW, Chun Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Shady",
            "date": "Dec 30, 2021",
            "title": "Very Good Common Core Course",
            "comment_content": "The content is exceptional. It is a good introduction to political philosophy. Every week we analysed the thoughts and work of a thinker/thinkers of the past.<br /><br />Thomas Hobbes<br />Jean Jacques Rousseau<br />Immanuel Kant<br />Karl Marx<br />John Stuart Mill<br />Lenin and Rosa Luxembourg<br />Hannah Ardent<br />The New Confucians<br />Jürgen Habermas<br />Friedrich Hayek<br />Rahel Jaeggi<br /><br />Through understanding the works of the above mentioned thinkers, we analyse concepts such as Republicanism, Liberalism, Communism, Capitalism, Enlightenment and Confucianism.<br /><br />Great content overall. Lots to think about and understand",
            "comment_teaching": "The teaching is alright<br /><br />The tutorials are quite poor and unhelpful. They do not go into details on how to draft a good essay. Besides, they only happen 5 times across the entire semester. The lecturer, professor Nelson is good but the lectures take place for nearly 2 hours.",
            "comment_grading": "The grading is quite diverse<br /><br />There is a final essay for 1000 words on one of three topics that we can choose. The essay can be challenging so my recommendation is to begin early. It is worth 50% of the final grade.<br /><br />There are also 2 20 mark quizzes each worth 10% of the total grade.<br /><br />There are 3 discussion topics that will be posted on canvas. Based on the tutorial group, satisfactory write ups must be posted. This is worth 10%.<br /><br />5 tutorials. There are activities and attendance is compulsory. It is totally worth 10%<br /><br />There are other online activities worth 10% also. These include quizzes on canvas and such.",
            "comment_workload": "The workload is manageable but not very light. The discussions require time and effort and so one must go through the lecture numerous times and understand its contents before posting.<br /><br />The quizzes also require a fair amount of preparation. The essay is tough and can take some time to write as well. <br /><br />The canvas online activities add to the workload, though they are light themselves.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1XB2eDlxyuTyguOCtOEFx7pbYxD4e16l",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LLLEE",
            "date": "Dec 30, 2021",
            "title": "I found non-locals enjoy the classes most",
            "comment_content": "Covered philosophical theories from Western to Chinese philosophers, learnt about the core belief of communism, liberalism, republicanism etc. Very brief introduction to the world's political beliefs.",
            "comment_teaching": "I have trouble listening to Professor's American accents but my listening skill gets better after training for half of the semester.<br />Every lecture you can just listen to his speech and understand what is going on, I gave up marking notes for later lectures. As long as you know what each philosopher believes in, catch the key concepts in lectures (some are not written in notes, that's tricky, you have to listen to prof's explanation), then is enough. Find your friends who can explain and discuss with you and complement each other.",
            "comment_grading": "Very good grade <br />Overall: A-<br />Attendance: Full<br />Quiz 1: ard mean, mean is 13.xx (14/20)<br />Quiz 2: above mean 2-3 marks (16/20)<br />Essay: not released, but 25% of it is based on responding to draft essay feedback, shd be full for this part as long as you handed in the draft essay.<br />Online Exercise: Full<br />Canvas Discussion: not released, I participated in all 3 discussions with &gt;2-3 comments each time, no need to be super lengthy (ard 6-8 lines is enough)",
            "comment_workload": "Light if you don't read the weekly readings.<br />Recommend completing all the online exercises for the writing workshop at the start of the semester because there are unlimited trials and you can adjust your answer to get full marks easily.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "esOHEscxPIcbz8DmIItrQLqEA1oFiL4W",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                },
                {
                    "id": 1147,
                    "name": "LAW, Chun Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "/",
            "date": "Dec 28, 2021",
            "title": "Great course in philosophy",
            "comment_content": "Have a look at the syllabus attached below.<br /><br />Contents are mostly based on political philosophy, in which each week students are introduced to a philosopher and some general points in his/her school of thought.<br /><br />To be honest, I found the course really interesting, as most difficult concepts are broken down and explained clearly by the prof, and students are able to demonstrate how they can apply those concepts into discussions and essays. Some lectures might be a bit boring and make you feel sleepy, but overall the experience is great and you will feel mind-blown every week as you explore a new topic. If you are not scared of dealing with philosophy and reasoning, this course will really intrigue you.",
            "comment_teaching": "Prof Nelson's slides are sometimes a bit hard to read but he explains them in great details in class. He is also willing to answer advanced questions from students.<br /><br />The writing workshops were not as good, maybe because I joined them through Zoom. The bad sound quality really affects the whole experience. The teacher also gave feedbacks which are slow and not really detailed.",
            "comment_grading": "Quizzes: 20% (2 quizzes, 10% each)<br />Canvas discussions (3 discussions scattered throughout the term): 10%<br />Online quizzes: 10%<br />Writing workshop assignments: 10%<br />Final essay: 50%<br /><br />Attendance is not recorded in lectures but is recorded in the writing workshops.<br /><br />Quizzes: 20 MCs each, covers content in the lectures, mostly tests basic concepts (but with lots of traps). Do review the slides and recordings, since you can never fully concentrate during a 2-hour lecture.<br /><br />Discussion: 3 Canvas discussions scattered throughout the term. You will need to express your view regarding a claim or an opinion from a philosopher explored in class. Try to put more effort in this part since many people does produce very thoughtful inputs, albeit most of the discussion posts are often merely repeating each other with paraphrasing.<br /><br />Online quizzes: Have to be done before going to a writing workshop. Quite easy, unlimited attempts, so try to get full 10%.<br /><br />Writing workshop assignments: Each assignment is basically a step for you to complete your final essay. As long as you submit acceptable writings, full marks are given.<br /><br />Final essay: Choose 1 out of 3 topics published at the beginning of the term and write a 900-1100 words essay. As most of the work was done thanks to the previous assignments, this one was not difficult for me.<br /><br />My grades:<br />Quiz 1: 17 (mean 13.46)<br />Quiz 2: 18 (mean 12.73)<br />Online quizzes and writing workshop assignments: 20 (mean is about 19, I think)<br />Discussion: not published<br />Final essay: not published<br />Grade: A",
            "comment_workload": "Doing the required readings every week was a bit tough. Actually that was not required, though. Elsewhere, not much extra work to be done, except for remembering to do the quizzes/assignments/discussion/essay on time.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "tpJP2kJEVME8rtqoA1KtNtowyNa8iWLb",
                    "name": "HUMA1000E Course Outline (Fall 2021) 2021-9-18",
                    "format": "docx"
                }
            ]
        },
        {
            "hash": "HJQqya69HJeCZYf3pfU4OEwwX60Q1GKX",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hellomyfriend",
            "date": "Jan 18, 2021",
            "title": "Good intro course to some philosophy",
            "comment_content": "Mainly separated into three main part<br />Freedom, Justice and the Good.<br /><br />Include many philosophers, but it is just an intro course so not hard to understand, <br />If you wanna know more, just read the reading the prof sent and it is easier to catch up during the lecture. <br /><br />Some famous philosopher like Socrates, Plato, Hobbes are included. <br />Social contracts Law, The harm theory and some other. The course is actually quite interesting if u like to think.",
            "comment_teaching": "The teaching is OK, the ppt and the presentation is nice.<br /><br />Not sure if it is the atmosphere of LTA, still wanna sleep lollll. But the content is actually not boring. <br /><br />The teacher in writing workshop is nice too, it is like a lang course but more informative and specific, the attendance is required btw.",
            "comment_grading": "Grading is quite fair and nice. <br />Since the paper count for 50% if I rub correct, put more effort on the paper. <br /><br />Also have a 10% on the discussion on Canvas, people are quite serious about it and usually put great effort on it. Some of the opinions are actually very thought-provoking and good to read. Just participate in it and it could help u understand more about the content taught. <br /><br />Others are not quite hard, just put some effort on the paper and prepare for the long paper. Then it should be OK to have B range or above! Good Luck!",
            "comment_workload": "Workload is reasonable, <br />three quizzes and only count the best two.<br />One Paper with word limits of 1000 words. <br />Would not be difficult as the writing workshop guides you how to write.<br />Five lessons of writing workshop and teach you write about the introduction, thesis, main argument, Counter argument, conclusion and etc. It is easy if you follow what the lecturer said. <br /><br />For the lectures, you don’t have to attend all of them as usual, no attendance required but be aware of the quizzes date lol. <br /><br />The ppt is well said, and professor is happy to answer any questions!",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aEpz5WL8XtK6z2PzXqxLLIxqymFZNpzm",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 302,
                    "name": "HO, Susanna Pui San",
                    "rating": 0
                },
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "神月 godmoon",
            "date": "Mar 06, 2020",
            "title": "",
            "comment_content": "Module 1: Socrates, Plato and the good<br />Week 1: Why be moral and what is the good<br />Week 2: Do will and belief or should the good have priority?<br />Week 3: What is the best life worth living?<br />Week 4: Should we obey the state’s judgments?<br /><br />Module 2: Freedom and Power (Hobbes, Rousseau, Kant, and Mill)<br />Week&nbsp;&nbsp;5:&nbsp;&nbsp;Are humans only self-interested and a strong state must control them?<br />Week 7: Are inequality and hierarchy natural?<br />Week 8: Is humanity striving for social-political Enlightenment and progress?<br />Week 9: What are the roles of liberty and government in society?<br /><br />Module 3: Good and Justice<br />Week 10: Hannah Arendt on banality and conscience<br />Week 11:&nbsp;&nbsp;Should we commit to cosmopolitanism or nationalism?<br />Week 12: Liberal, Republican, and Deliberative Government",
            "comment_teaching": "Professor Nelson taught interestingly while the tutor is the worst.",
            "comment_grading": "Quiz:10/12<br />Essay: not released<br />Attendance:full<br />I don't think it is as good as other comments. The quiz is quite difficult and the grading of the essay is quite subjective.<br />Grade:A-",
            "comment_workload": "Light workload. All you need to do is just finishing the online workshop,quiz and the essay submission. However, you have to work hard in order to get a good grade in essay",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AfmWmTImRVbt3LCGedIva6xyPGvEVZYu",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                },
                {
                    "id": 422,
                    "name": "TANG, Kin Hun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fishfillett",
            "date": "Jan 31, 2020",
            "title": "Informative course for those who are interested in philosophy",
            "comment_content": "Personally speaking, the course is quite interesting as it offers new perspectives to view ordinary things. You would be introduced to different philosophers and their views in every lesson, and the content is divided into three sections: <br /><br />1. Good, 2. Freedom, 3. Justice.<br /><br />The three final essay prompts would be based on these three sections.",
            "comment_teaching": "Eric's teaching is quite informative and in-depth, however, his pace is a little slow, and classes are up to almost 2 hours long, so I would easily lose interest. It is advised to watch recorded lecture videos and uploaded notes on Canvas, but be warned that the TA sometimes does not upload it on time. <br /><br />As for my tutorial instructor Tang Kin Hun, he is very passionate and makes classes interesting. Tutorials are conducted in small groups, so there were a lot of interactions and he took care of everyone's needs.",
            "comment_grading": "Grades are based purely on quizzes, attendance of tutorials, and your final essay. If you have good skills in comprehension and writing, passing or even getting a good grade in this course should not be too hard. It is important to communicate with your tutorial teacher though, as he or she would give you invaluable information and ways to improve your essay draft.",
            "comment_workload": "You have to finish an assignment before each tutorial class. The content of the assignment should be already covered in the previous tutorial class, hence it would be fairly straight-forward and takes little time to complete. If a draft of an introduction/body paragraph is required, there would usually be more time for you to complete, so the workload is manageable.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZoB4kd2jsaLXsERgtsELbwP5wGX7yL3v",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                },
                {
                    "id": 422,
                    "name": "TANG, Kin Hun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cly__",
            "date": "Jan 23, 2020",
            "title": "Good Grade Course!!",
            "comment_content": "3 sections for the course:<br />1) Socrates, Plato, and the Good<br />2) Freedom and Power in Modern European Philosophy<br />3) Questions of the Good and Justice<br /><br />The course is quite interesting, and not as difficult as it seems. By relating those theories taught to political events/ news around the world, you can easily understand the concepts and main points of each ppt/ lecture.",
            "comment_teaching": "Professor Nelson teaches pretty well and explains the concepts clearly.",
            "comment_grading": "In-Class Quiz - 20%<br />Online Discussion - 10% <br />Writing workshop – online content (Canvas) - 10% <br />Writing workshop – classroom sessions - 10%<br />Final Essay - 50%<br /><br />It is VERY VERY VERY IMPORTANT to submit the first draft of the term essay, or else you will get an F in the part &quot;Response to Feedback&quot; of the final essay. <br /><br />Got an A at last with two quizzes above mean (Term essay - unknown)",
            "comment_workload": "Normal workload. You will be fine as long as you do all the readings &amp; understand the concepts.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "m6kd4pWwrdrEx72onexvaWZKcHyW0RSv",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                },
                {
                    "id": 302,
                    "name": "HO, Susanna Pui San",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "trust.my.review",
            "date": "Jan 23, 2020",
            "title": "",
            "comment_content": "I. Socrates, Plato, and the Good <br />II. Freedom and Power in Modern European Philosophy <br />III. Questions of the Good and Justice",
            "comment_teaching": "Prof. Nelson speaks a bit slow. Although the content is interesting, I dont suggest morning classes as you might fall asleep :)<br /><br />Prof. Susanna is very nice, and always encouraged us to participate in class. Her tutorials are very useful to help you write the term essay;",
            "comment_grading": "- 20% In-class quizzes: 2 best out of 3<br /><br />- 10% Canvas online discussion: Peer exchange forum on questions and issues pertinent to lectures &amp; weekly readings (originally 3, but the last one was cancelled)<br /><br />- 10% Writing workshop on Canvas: Viewing online content and completion of all tasks embedded in the online content (multiple trials on canvas, so it is granted marks.<br /><br />- 10% Writing workshop-classroom sessions: Attending all five writing workshops on time.<br /><br />- 50% Term essay: persuasive essay of 1000 words, show evidence of response to feedback on your first draft.<br /><br />Overall, it is an easy A-range course.",
            "comment_workload": "- Weekly readings, but not really necessary. <br />- Biweekly tutorial sessions&nbsp;&nbsp;(attendance)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jegWgluML5uDyqOCM9jeb3sWHv5Np89I",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "uha",
            "date": "Jan 22, 2020",
            "title": "Normal",
            "comment_content": "Content. <br /><br />The course is divided into 3 different sections. I'm not sure about the order but 1. Good 2. Freedom 3. Justice. <br /><br />The professor introduces different perspectives of different philosophers regarding the mentioned subjects. <br /><br />You have to attend lectures and tutorial once 2 weeks. The tutorial is mandatory but lectures are not. The attendance of tutorial counts as your grade so it is better to attend the tutorial. (+at the end of each chapter/section, there is quiz. 2 best scores out of 3 count and you must attend the lectures when there is a quiz) <br /><br />Each lecture, he introduces 1 philosopher. Each section is comprised of 3~5 week materials, meaning you learn about 3~5 different philosophers. Some contents are overlapping so it gets confused sometime.",
            "comment_teaching": "His teaching was pretty good. Everything was well organized in the presentation. Lecture videos are also uploaded on the website. Also it is pretty much difficult to pay attention during the lecture, as I watch videos I really thought his teaching is not bad. (It doesn't mean it's good)",
            "comment_grading": "The grading includes your essay, online discussion, online assignment(really easy, you can try as any time as you want), tutorial attendance, and quizzes. I think most people get B. For the essay, 50% of the grade is decided by your grammar and structure of the essay. If you are a good essay writer, you probably can get at least B+. My essay thesis was pretty much BS as I started writing the day before the deadline, but I still got B. So yep.",
            "comment_workload": "He gives you reading to do every lecture. I only read at the start of the semester. You really don't need to read it unless you really don't have any idea/background about philosophy. As a person who already learnt this in high school the workload was not that much at all. You just need to study contents for like 3~4 hours for the quiz, the online assignment doesn't even take an hour.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3ZPHnExHixv43QSafIDOMoF0z5cqjs5E",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                },
                {
                    "id": 1304,
                    "name": "LAU, Chun Hong",
                    "rating": 1
                },
                {
                    "id": 443,
                    "name": "MAK, Linda Yeung Oi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ci_5z2",
            "date": "Jan 05, 2020",
            "title": "",
            "comment_content": "A summary of ancient to modern thinking of the good, freedom and justice, which is quite inspiring.<br />Module 1: Socrates, Plato and the good<br />Week 1: Why be moral and what is the good<br />Week 2: Do will and belief or should the good have priority?<br />Week 3: What is the best life worth living?<br />Week 4: Should we obey the state’s judgments?<br /><br />Module 2: Freedom and Power (Hobbes, Rousseau, Kant, and Mill)<br />Week&nbsp;&nbsp;5:&nbsp;&nbsp;Are humans only self-interested and a strong state must control them?<br />Week 7: Are inequality and hierarchy natural?<br />Week 8: Is humanity striving for social-political Enlightenment and progress?<br />Week 9: What are the roles of liberty and government in society?<br /><br />Module 3: Good and Justice<br />Week 10: Hannah Arendt on banality and conscience<br />Week 11:&nbsp;&nbsp;Should we commit to cosmopolitanism or nationalism?<br />Week 12: Liberal, Republican, and Deliberative Government",
            "comment_teaching": "His teaching is conducted at a slow pace, but with a good analysis of the readings and discussion about related topics.<br />Although he is justing following the ppt, he will give out extra info. for students who are interested in the items or terms inside the ppt.",
            "comment_grading": "(10%) Online discussions (1 out of 3 canceled)<br />(20%) In-class quizzes<br />&nbsp;&nbsp;Quiz 1: Mean 9.6/12<br />&nbsp;&nbsp;Quiz 2: Mean 6/12<br />&nbsp;&nbsp;(take the highest among the 2 and double it)<br />(20%) Writing workshop attendance (Online + Classroom)<br />(50%) Final Essay<br /><br />Essay: 41.665/50<br />Workshop Online: 10/10<br />Workshop Classroom: 10/10<br />Quiz: 16.66667/20<br />Discussion: 7.5/10<br />Total: 85.832/100<br />Final grade: A<br />I have asked the TA for the grading details. I think it is a very good grade course among all the CC course!",
            "comment_workload": "A normal 3-credit course workload, without a final exam. As no attendance recorded, you don't need to be physically appearing in the lecture hall!<br />I have only attended 3 or 4 lectures out of 11.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZDWic6FOmqtmNQ30BQCzOLOj2ayDlqFp",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Jacky0413",
            "date": "Aug 07, 2022",
            "title": "",
            "comment_content": "This course is about human freedom. The requirement is only attending the TA session and 2 MC quizzes.",
            "comment_teaching": "The lecture is very academic. So I didn't attend the classes. All knowledge can be found on the website and in notes. TA will teach you how to write the essay. They are also very nice.",
            "comment_grading": "Good grading. The mean of two quizzes would be very high. But what decides your grade is still your essay.",
            "comment_workload": "The workload is not heavy. You just need to write an essay for the whole semester.<br />Two MC quizzes should be OK if you study the lecture notes. You can have good grading if you write the essay seriously. Good luck!",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "uH5VbbrslU2MrWh9LKVYbhEAkatXSw38",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                },
                {
                    "id": 1147,
                    "name": "LAW, Chun Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jasa",
            "date": "Dec 30, 2021",
            "title": "",
            "comment_content": "See Others.<br /><br />Personally, I think the topic is much more interesting/ meaningful than 1000A/B language culture stuff.",
            "comment_teaching": "Quite good. The prof is truly kind and passionate about teaching.&nbsp;&nbsp;He also answered my questions regarding my essay.<br /><br />The TA is also helpful. He approved my swap in tutorial timeslots when I got things to do.",
            "comment_grading": "Quite Good.<br /><br />For quizzes, I got mid-10/20, not the best but above average. <br /><br />For the essay, I dun know the score. <br /><br />Reading material really helps. I picked Mill for my essay topic, and my arguments are based on the related reading material (not detailed in the lecture)",
            "comment_workload": "For 2 lecture quizzes, I spent 1.5 days in advance to watch back lecture video and study (I skipped all lectures).<br /><br />For the Essay, I spent 3 days reading and writing the first draft, 2 days finalizing after comments. So essay costs around 1 week time if you want a good result.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "g6OSiHeiWK2T8JizqWX6lNJj8LiBou2g",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tinayzy",
            "date": "Sep 13, 2021",
            "title": "",
            "comment_content": "Freedom , justice and Good<br />Topics don’t change much so look at other responses should be substantial.",
            "comment_teaching": "Teaching is pretty clear. The Professor has really good pronunciation and easy to comprehend. PowerPoints pretty much include all the contents.",
            "comment_grading": "Grading is good since there are many free marks given, including online quizzes on Canvas and attendance (as long as you attend every class). For the quizzes, you can try multiple times under unlimited time. Therefore, getting full score in this component should be super easy.",
            "comment_workload": "Pretty low workload. Not much homework assigned. Also not many readings. By the way, since the workshop does not take place each week and only takes 50 minutes, workload is really low.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "u51lAqDMezRqCS525Fp7EQtK3E8Tvp9E",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                },
                {
                    "id": 422,
                    "name": "TANG, Kin Hun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "科大薯仔",
            "date": "Jan 04, 2020",
            "title": "A course with light workload",
            "comment_content": "To a beginner, philosophy might be difficult initially, but after a few lectures, you would find those theories interesting.This course mainly focus on justice, freedom and the good.Theories between different philosophers were compared, including Rousseau and Hobbes. <br /><br />In the writing workshops, you will learn how to write academic essays and several techniques will be taught. The content was quite useful to a year one student like me, as the skills are applicable to other courses.",
            "comment_teaching": "Professor Nelson is a good professor. As there are 400 students in this course, what he had to do is to teach us the theories and read out the slides, so his teaching was just same as other professors.<br /><br />For Kin Tang, he was a perfect instructor. In writing workshops, as there were only 10 students in each session, there were lots of interactions. After finishing every parts of essays, he gave us constructive comments on our work individually, which better improve the quality of our essays.",
            "comment_grading": "Just look at the others’ comments if you would like to know the distribution of marks!<br /><br />The grading was not bad. I got 8.5 out of 12 in the first quiz, which was slightly below the mean. As the third quiz was cancelled. The best score was double counted. You also have to attend all workshops to get marks. Aside from that, you have to join the online discussion actively to receive score. <br /><br />Undoubtedly, essay counts the largest part of the grade. Eventually, I got B+. That’s fair, as I didn’t attend most lectures!",
            "comment_workload": "The workload was light compared to other courses. You just need to join the online discussions and prepare for the mc quiz beforehand. <br /><br />For the essay, the workload would be light if you follow tightly to the schedule of writing workshop. There are assigned dates for you to submit your introductory , body paragraphs and your draft essays. Just submit it and correct your essay according to the feedback from the instructor.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3StTRVJN48G4VxnFRc1b0hzoDTR85N0F",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                },
                {
                    "id": 422,
                    "name": "TANG, Kin Hun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nandi",
            "date": "Jan 02, 2020",
            "title": "",
            "comment_content": "a basic introduction to philosophy and ideas of justice and good. <br /><br />Module 1: Socrates, Plato and the good <br />Week 1: Why be moral and what is the good<br />Week 2: Do will and belief or should the good have priority?<br />Week 3: What is the best life worth living?<br />Week 4: Should we obey the state’s judgments?<br /><br />Module 2: Freedom and Power (Hobbes, Rousseau, Kant, and Mill)<br />Week&nbsp;&nbsp;5:&nbsp;&nbsp;Are humans only self-interested and a strong state must control them?<br />Week 7: Are inequality and hierarchy natural?<br />Week 8: Is humanity striving for social-political Enlightenment and progress?<br />Week 9: What are the roles of liberty and government in society?<br /><br />Module 3: Good and Justice<br />Week 10: Hannah Arendt on banality and conscience<br />Week 11:&nbsp;&nbsp;Should we commit to cosmopolitanism or nationalism?<br />Week 12: Liberal, Republican, and Deliberative Government",
            "comment_teaching": "Eric's teaching in alright. He talks quite slow, but he tries to explain the content as best as he can. You don't really need to attend the lecture physically, instead, you can watch the lecture recordings at 1.5x speed. Either way, watch the lecture since a lot of the quiz questions are based on things he says in class.&nbsp;&nbsp;<br /><br />Kin's writing workshops are really helpful. He gives good advice on aspects of your essay.",
            "comment_grading": "You can get an A-range grade without being in the class physically.<br /><br />3 online discussions <br />3 in class quizzes <br />&nbsp;&nbsp;Quiz 1: Mean 9.6/12<br />&nbsp;&nbsp;Quiz 2: Mean 6/12<br />&nbsp;&nbsp;Quiz 3: Cancelled <br />&nbsp;&nbsp;(normally best of 2 quiz scores is taken)<br />Writing workshop attendance<br />Final Essay - 50%",
            "comment_workload": "Readings on a weekly basis. I just skimmed through the readings since Eric explains the readings in detail in class. The quizzes are NOT based on the readings. <br /><br />There is a pre-workshop task every alternate week but it doesn't take more than 10 minutes. Just don't forget to do it.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}