{
    "error": false,
    "course": {
        "id": 525,
        "subject": "HUMA",
        "code": "1550",
        "name": "Europe and the World in the 20th Century",
        "description": "This course surveys politics, society, and culture in Europe from 1890 until the present, with a special focus on the interactions between European societies and the non-European world. Topics to be covered will include imperialism, the advent of mass politics, World War I, interwar dictatorships, World War II, the welfare state, the USA and the USSR as forces in European politics, decolonization, the global 1960s, détente, the collapse of Communism, and globalization.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4,
        "rating_teaching": 4,
        "rating_grading": 3,
        "rating_workload": 5,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 314,
                "name": "DERMAN, Joshua",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "N3tBbLGJjL3f5M7cnkDK96mGACCtRd5V",
            "semester": "2012-13 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sadness",
            "date": "Aug 30, 2015",
            "title": "",
            "comment_content": "History of Europe from the turn of the 20th century to the present.<br />European politics, society, culture as well as interactions between European societies and the non-European world<br /><br />Imperialism, the advent of mass politics, World War I, interwar dictatorships, World War II<br />USA and USSR as forces in European politics, decolonization, European integration, détente, the collapse of Communism, and globalization.",
            "comment_teaching": "The prof. is confident in transferring the knowledge through verbal language, lecture notes are extremely brief, you might have to listen what the prof. said carefully and take notes very quickly.<br /><br />The voice of the prof. is very soft, you might easily fall asleep. For local students, you might not be able to follow the prof. throughout the whole lecture as his pace is relatively fast.",
            "comment_grading": "2 quizzes weighs 15% each<br />midterm weighs 30%<br />final exam weighs 40%<br /><br />There are a lot of vocabulary and technical terms you have to remember, students who are not good in English should be aware. Although this course is not for students have background of European history, there are a lot of students who have studied the course material in high school would enroll in this course<br /><br />Not good grade, mean of the quizzes, midterm and final exam are around 70%",
            "comment_workload": "Workload is extremely light<br />No HW<br />two quizzes<br />1 midterm<br />1 final exam<br /><br />All assessments are multiple-choices questions",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}