{
    "error": false,
    "course": {
        "id": 3668,
        "subject": "HUMA",
        "code": "3060",
        "name": "Language and Migration",
        "description": "This course aims to stimulate students' thinking and broaden their knowledge about language in relation to migration in the contemporary multilingual world. This is a world which is a product of mobility of people, information and products across physical and virtual boundaries. Languages themselves are changed through migration. Within a context of linguistic diversity, language is central to the organization of institutions, access to information, the exchange of goods and the ability to communicate. Students will investigate how language is used by migrants in areas including health, education, the law and employment. They will explore how language practices are shaped by face-to-face and mediated encounters and by the constraints of political and institutional contexts. Key questions are: What languages and forms of communication get used, when, why and where? What linguistic factors enable and limit access for migrants to services and resources? What are the consequences for migrants?",
        "categories": [
            "Common Core (H)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2130
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 5,
        "rating_workload": 5,
        "review_count": 2,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1592,
                "name": "SIMPSON, James Edward Barbour",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "lkh8CLkPU21UVLgYfpdIFFJNFKuSj3D6",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1592,
                    "name": "SIMPSON, James Edward Barbour",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TerryWu",
            "date": "Dec 30, 2022",
            "title": "Good course with nice and knowledgeable professor",
            "comment_content": "As the course title shows, it covers several topics regarding the fields of language and migration, and the overall content is structured well. <br /><br />Theme 1: Basic concepts {<br />Week 1: Language and migration<br />Week 2: The sociolinguistics of mobility <br />Week 3: Linguistic superdiversity and ideology<br />}<br /><br />Theme 2: Space and Place {<br />Week 4: Diasporic spaces, multilingual landscapes <br />Week 5: Transnationalism and virtual space<br />Week 6: Displacement, asylum and immigration<br />}<br /><br />Theme 3: Contexts {<br />Week 7: Migration, language and the law<br />Week 8: Work, enterprise and (un)skilled migration<br />Week 9: Health and services<br />Week 10: Education<br />}<br /><br />Theme 4: Approaches {<br />Week 11: Ethnography, narrative and interactional sociolinguistics<br />Week 12: Literacy and critical discourse analysis<br />}<br /><br />Week 13: Review + Assignment Q&amp;A session<br /><br />There are 3 lectures offered by guest speakers + 1 simple presentation lecture (not graded) in total. No attendance is required.<br /><br />From my perspective, this course has offered lots of interesting insights regarding language and migration. For example, it seems that language has nothing to do with the healthcare service but you will find out indeed they are closely related, especially during the pandemic. As more topics are covered, you will also find out that all the seemingly separate topics are indeed closely related. <br /><br />I have learned a lot in this course. This nice course deserves much more attention!",
            "comment_teaching": "教授超讚<br /><br />As the title says, professor James is very nice and knowledgeable. He always prepared lots of materials for every lesson; I believe he can answer all your questions regarding the course content i.e. his profession. <br /><br />Professor James usually starts the lecture with a quick group discussion based on the reading materials. The lecture overall is quite casual as there will be many discussions going on. The course pace is moderate and I didn't encounter any difficulties throughout the whole semester. Most of the lecture concepts were supported with practical examples, research, and the professor's personal experience so you would not feel bored at all. <br /><br />Starting at 9 am is the only thing I didn't like about this course. What a nice course eh!",
            "comment_grading": "Good grading!<br /><br />As another review said, it seems like professor James grades every student individually. In this course, you will not be compared with the other students. All the comments and grades are fully dependent on your work and how much effort you put into the assignments.<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br />Grading Scheme:<br />30%: Personal Reflection<br />60%: Written Assignment <br />10%: Participation<br /><br />Personal Reflection (30%):<br />Following weeks 3, 6 and 10, you will write a personal reflection of 500 words in the form of an asynchronous discussion forum post on one of the topics addressed in the <br />lectures. <br /><br />Written Assignment (60%):<br />Choose a setting familiar to you, e.g. an institution, a classroom, a city space, a workplace, an online space.&nbsp;&nbsp;<br />• How has migration shaped language use in this setting? <br />• What factors allow or constrain language use in this setting, and why? <br />• How does this promote or inhibit social justice in the setting? (2500 words). <br /><br />Participation (10%): Class and online discussion.<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br />All grades were given in letters (A+, A, A-, B+, ...) with comments from professor and TA rather than numerical grading, which is quite reasonable for a HUMA course.<br /><br />As I found the course content quite interesting, I always sat in the first row and talked a lot during the course. The final grade of participation was not released but I guess my participation score should be high.<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br />Personal reflections: B, B, B<br />Written assignment: Good comments from the professor and he directly mentioned my overall grade for the course (A-)<br />Participation: Unknown<br /><br />Final grade: A-<br />I am not a SHSS student. Thank you professor James for my first A-range HUMA course!",
            "comment_workload": "Fair workload.<br /><br />Recall the grading scheme:<br />30%: Personal Reflection<br />60%: Written Assignment <br />10%: Participation<br /><br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br />Personal reflections (30%):<br />If you attend the course and review the content regularly, 500 words shouldn't be a big deal for you. Try not to cover too many topics and be specific to a single one will help you get better grades.<br /><br />On top of submitting the reflection, you are also required to discuss your topic on the canvas discussion page based on your reflection. The performance of your discussion goes to participation (10%) and it shouldn't be a big deal either.<br /><br />Written Assignment (60%):<br />The 2500 words essay apparently takes the heaviest workload. Before you submit the final essay, you can submit your essay outline (optional) to professor James for his feedback. Try to be specific and use your own experience will be my suggestions to tackle the final essay easily.<br /><br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br />As a HUMA course, there are of course weekly reading materials. Probably since I took another SOSC course this semester, the workload for reading materials for this course appeared to be relatively light for me.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "f9EXx4H5C34in8091zlMZHEgpSZWKnlR",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1592,
                    "name": "SIMPSON, James Edward Barbour",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "John Snow",
            "date": "Jun 18, 2022",
            "title": "Good intro course for language and migration",
            "comment_content": "Course content is the following:<br />1 Concepts I Migration and superdiversity <br />2 Concepts II The sociolinguistics of mobility <br />3 Concepts III Ideology and discourse<br />4 Space and Place I Diasporic spaces, multilingual landscapes <br />5 Space and Place II Transnationalism and virtual space<br />6 Space and Place III Displacement, asylum and immigration<br />7 Contexts I Migration, language and the law <br />8 Contexts II Work, enterprise and (un)skilled migration <br />9 Contexts III Health and services<br />10 Contexts IV Education<br />11 Approaches I Ethnography, narrative and interactional sociolinguistics<br />12 Approaches II Literacy and critical discourse analysis<br />13 Review Review; looking ahead, preparation for the assignment<br /><br />I don't have a HUMA background and take it as a common course.<br />In general, not many new concepts. You don't need to learn multiple languages for this course, because most content in this course is translated into English. It is suitable for people without a background.<br /><br />It is very suitable for people from a diverse cultural background or who can speak multiple languages/dialects/variances. You will find or even experience some examples like a family language broker. Your personal experience can be used for your assignments to prove your understanding of course content.",
            "comment_teaching": "Professor Simpson is new to UST. However, he can teach very well. You can understand his teaching easily.<br /><br />This is 2022 spring and we have Zoom classes. Before each lesson, an activity sheet is provided in Canvas. During the lesson, we will be grouped to talk about questions. Professor or TA will get into groups to listen and comment on your discussion. Sometimes no one wants to say anything and it can be a bit awkward.<br /><br />Before assignment 2, we can provide an outline of 2 pages to professor, and reserve a session to talk with him and see how can the essay be improved.<br /><br />In general, he is very patient and nice to us.",
            "comment_grading": "Very nice. It seems that each student is graded independently. The final grade is graded on the weighted scores of each assignment. The score of each assignment is graded from A to D.&nbsp;&nbsp;<br /><br />I have no background in languages but get an A in this course.",
            "comment_workload": "Very light workload.<br /><br />(10% x3) assignment 1: 3 online discussions, each post needs 400 words<br />(60%) assignment 2: one essay of 2500 words including reference<br />(10%) participation<br /><br />For each discussion, you need to post a short essay of 400 words on Canvas. You only need to relate your personal experience or findings to course content and reply to others. You may provide some references to prove your statements.<br /><br />For assignment 2, you need to explain your understanding of concepts by providing examples under a setting. It is not a LANG essay and you just need to focus on your understanding of the concepts and provide good examples/references/personal experiences.<br /><br />There is a presentation during the lecture. Before that day, make sure to get the email address of your group coz they randomly assign you to a group. You may need to get the PowerPoint ready before the lecture. This counts to the participation score.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        }
    ],
    "composer": []
}