{
    "error": false,
    "course": {
        "id": 3987,
        "subject": "HUMA",
        "code": "2330",
        "name": "Anime",
        "description": "With the rise of digital culture since the late 1980s, Japanese animation, widely known as anime, has become a global phenomenon. Given its sweeping impact worldwide, we can no longer dismiss it as mere pop culture and entertainment. Indeed, anime has gradually emerged as a new field of research, dominating film histories and theories in the academia. This course offers an overview of anime by examining its histories, techniques and technologies, medium, genres, and conceptual issues. It will track anime’s early years, development, industrialization, globalization, and explosive boom in the digital age. Focusing on cinema features and TV series, this course will explore a variety of overlapping (sub)genres, such as Robot, Mecha, Cyberpunk, Apocalypse, Adventure, Supernatural, Shōjo, and Tragedy. Conceptual issues like cuteness, gender, sexuality, race, nation, environment, human-machine interaction, AI and posthumanism will be examined closely. Japanese language and knowledge are welcome but not required for this course.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4,
        "rating_teaching": 5,
        "rating_grading": 5,
        "rating_workload": 5,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 340,
                "name": "DU, Daisy Yan",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "s3PZZoFQA6jDDQ1a43heA9xrhAqrcqFt",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 340,
                    "name": "DU, Daisy Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JW1223",
            "date": "May 29, 2023",
            "title": "An easy and enjoyable common core course for those interested in anime(non-SHSS students please refer to CORE2606)",
            "comment_content": "This was essentially a literature course offered by the Division of Humanities. It covers and studies the notion of anime in academia, from film portraying techniques to the stories and issues behind anime.<br /><br />Most of the anime chosen was quite diverted from our understanding of anime in terms of timeliness (from the 1950s to the early 2000s), but those chosen topics were definitely the classics and had importance in academia, e.g. Doraemon, Eva, multiple Miyazaki's films, etc.)<br /><br />For typical anime fans, I think this course might not be the best for you if you are not interested or reluctant to watch older anime or films, e.g. Astro Boy/ many of the Miyazaki classics, since you would need to watch those films or at least have an idea about the plot then coming to the class for discussion.<br /><br />If you find out that you are really interested in the topic of anime and decide to pursue further studies regarding this field, you should take the opportunity to participate in the seminar and discussion, as well as read the course readings and talk to the professor.",
            "comment_teaching": "Prof. Du's teaching was great in general; she listened and responded to students' ideas and thoughts with some great insights, her speaking was clear and easy to understand, and the lectures will not be too dull even if they covered a lot of academic topics, she can usually explain those concepts even you did not have such backgrounds.<br /><br />Usually, the three-hour lectures started with students sharing thoughts after the required films of the week or sharing anime toys. Then it would be followed by a discussion of the anime history and issues for two hours, with two 10-minute breaks in the middle.<br /><br />TA Muyang was the one who was responsible for taking attendance, answering students' questions, giving students' feedback and others' course coordinating work; one of the lectures was actually given by the TA, and his teaching was definitely above the standard and he was professional. A tutorial session was held to answer students' questions, and you can send him a draft for feedback. However, Muyang was a final year PhD student, so it was unlikely that he would be the TA if this course were offered again. Still, you can see the division of work between the professor and the TA.",
            "comment_grading": "• Attendance: 15% or F <br />• Participation: 10%<br />• Weekly quiz: 15%<br />• Final paper (800 words): 60% <br />Extra credits: 3 seminar (optional)<br /><br />Attendance is strict; each absence of class will deduct 5% from your total grade, and three times of absences will result in an F grade, eight or more times of participation throughout the semester would grant you a max score in participation, and you would need a laptop/ other devices to raise hands in zoom session and participate by speaking up in the lecture hall. Quizzes are just to check if you have watched the films, one simple question each week. <br /><br />Initially, the proportion of attendance and participation was higher (25% each and 25 times for participation to get full marks); after negotiation, this was lowered to the more acceptable proportion with a higher proportion towards the final paper.<br /><br />The scores of the final paper were unavailable, but I believe if you follow the guidelines and take reference to the grading rubrics, you can write a decent paper after all.<br /><br />I received an A+ from this course; however, the distribution and the scores were not transparent, so I cannot determine whether this is those so-called 'good grade' courses. Still, from my experience, if you did all the basics (attendance &amp; participation) and did some readings, you can easily outperform your classmates with that extra knowledge. As mentioned by the TA Muyang, most of the students had trouble writing a comprehendible/basic standard essay.",
            "comment_workload": "There is virtually no workload if you choose not to read any readings. However, I strongly recommend you choose some topics or films you like to read for the benefit of your learning, and it helped a lot in participation and writing your final papers. The readings are easy to read and quite interesting in my opinion.<br /><br />Attendance is strict, so do not skip any class unless you have medical proof or other legitimate reasons.<br /><br />Just go to class each week and enjoy the lectures, all in all, the only workload is the 800-word essay by the end of the semester.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}