{
    "error": false,
    "course": {
        "id": 2818,
        "subject": "HUMA",
        "code": "2596",
        "name": "History of Biology and Medicine",
        "description": "This course explores the past 200 years of history of biology and medicine. It is designed as an introductory course for students who have no background in the subject. Topics will include case studies from both the 19th Century and the 20th Century, with an emphasis on how the past has influenced the present. Classes will mix lectures with discussions, and students will prepare an in-depth final research presentation as well as an extended review essay of a book in the history of biology or medicine of their choosing.",
        "categories": [
            "Common Core (H)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2110,
            1930,
            1830
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4,
        "rating_teaching": 3.9,
        "rating_grading": 3.6,
        "rating_workload": 2.5,
        "review_count": 10,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1020,
                "name": "SMITH, Jenny Leigh",
                "count": 10
            }
        ]
    },
    "reviews": [
        {
            "hash": "0R3XKOSpILTTAGx3g9AoIpw4asgPK8oA",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 1020,
                    "name": "SMITH, Jenny Leigh",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gazelle",
            "date": "May 29, 2019",
            "title": "Don't expect too much for your grade. B/B+ suffices.",
            "comment_content": "The content itself is quite interesting, especially if you are a science major. You can get to understand history &amp; development of science, scientific revolution, paradigm shift, medical modernization, &amp; things like that. Do take the course if those things fascinate you.<br /><br />Below are the topics covered:<br /><br />1. Introduction to History of Science<br />2. Disease &amp; Hygiene in the 19th Century<br />3. Evolution &amp; Eugenics<br />4. Modernization of Medicine<br />5. The rise of Field Sciences<br />6. Laboratory Life<br />7. The history of pharmaceuticals<br />8. The ownership of life",
            "comment_teaching": "Every lecture seems mind-blowing -- the professor speaks very fast and bombards you with lots of information. You have to jot down as many information as you can. If you miss some of them, you will be in trouble in exams. Every detail counts!!<br /><br />The good thing is every time some students are invited to give a summary on the key concepts taught. By listening to them, you can better organize your notes.",
            "comment_grading": "My performance for reference:<br /><br />Midterm exam: 6/10 (mean: 7.5/10)<br />Final exam: 16.3/20 (mean: 15.6/20)<br />Book review: 23/25 (mean: 21.7/25)<br />Presentation: 23/25 (mean: 22.1/25)<br />Course participation: 16/20 (mean: 16.9/20)<br /><br />Total score: 84.3%<br /><br />Letter grade: B<br /><br /><br />Full attendance &amp; speaking regularly for summary as lecture begins does not give you full participation. Only those few who stand outside giving impromptu presentations during discussion sessions could earn the highest. However, I myself am not comfortable doing unprepared speech, which prevents me from earning higher participation points.<br /><br />If I had performed better in midterm &amp; been more proactive to earn a little higher participation, I could have gotten a B+. An A- requires &gt;90% though. I am not sure whether the professor gives out A+ or not.<br /><br />**Clarification: As we have a small class (merely 26 students), only the 1st in class could get an A+. Other top students would mostly receive an A/A-, depending on their total scores.",
            "comment_workload": "Quite intense. Even if you skip all the readings &amp; just focus on the content covered in lecture, it still takes you hours a week to organize the content and search for supplementary information. The good thing is study guides are provided before exams to better structure the lecture materials.<br /><br />The workload becomes significant before exams -- you have to carefully organize everything (tremendous!!) based on the study guide and recite them one by one. <br /><br />The workload for the two assignments is rather low, except that you have to be well-prepared for the presentation.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hFOdYyGX5ZmX8gOtWf9YIu2eQe9aGmWJ",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1020,
                    "name": "SMITH, Jenny Leigh",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ust_student",
            "date": "Feb 02, 2022",
            "title": "",
            "comment_content": "Module I: Alchemy<br />Module II: Navigation<br />Module III: Microbes<br />Module IV: Fossils<br />Module V: Inheritance <br />Module VI: Institutions &amp; Cures",
            "comment_teaching": "Professor Smith is great teacher but she does not give out notes during lecture time so you have to make sure to note down what she is saying or you can rewatch the lecture recordings. In general her lectures are engaging and she is quite funny.",
            "comment_grading": "Course Participation (20%), There will a question at the beginning of the lecture which you can choose to answer in class or you can choose to answer it though canvas later that day. You will have to answer at least 10 of these question. It's not that difficult.<br />&nbsp;&nbsp;Quizzes (30%, 10% for 1 quiz):&nbsp;&nbsp;There will be 3 quizzes, so more difficult than the other. Make sure to review the zoom recordings and watch the videos and do the readings before the quiz<br />&nbsp;&nbsp;Group Presentation (15%) The professor will give a few topics that you can choose from or you can pick your own topic be sure to be through with your presentation cause there will be questions afterwards.<br />&nbsp;&nbsp;Book Review (15%) The professor will give you a list of books from which you can pick one. You have to write a draft and a final version.<br />&nbsp;&nbsp;Final Timeline Assignment (20%) Pick an event that happened sometime in history that is somewhat connected to what she had taught and make a timeline about that topic.",
            "comment_workload": "I would say the workload is quite heavy. There is a lot of readings that will be assigned and there will also be videos that needs to watched and these will also be included in the quizzes. Professor Smith is quite forgetful and she may not give details about the assignments until there's like a week or 2 left.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9lvTAkztoxwv87xZcD9M3eriGG6JRp7q",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1020,
                    "name": "SMITH, Jenny Leigh",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gcp",
            "date": "Jan 24, 2022",
            "title": "",
            "comment_content": "This is a course that shouldn't be judged by its name. It really isn't limited to just 'biology and medicine', but here's a quick rundown of what we covered:<br /><br />Module I: Alchemy<br />Module II: Navigation<br />Module III: Microbes<br />Module IV: Fossils<br />Module V: Genes<br />Module VI: Institutions and Cures<br /><br />They might sound pretty bio-like, but we did cover a little physics (The Manhattan Project) and science in general (astronomy &amp; navigation). If you're into history, you'd find it interesting though. I personally enjoyed the content because as it turns out, history is pretty wacky. Most of the content is from the 18th-20th century, besides the first two modules.<br /><br />Also, if you're used to the concept of memorising facts and figures for history, that won't be very relevant to this course because there is a significant focus on historical concepts, rather than the dates and people involved (though there are several notable people whose names need to be remembered, obviously).",
            "comment_teaching": "I personally found Professor Smith to be very entertaining. She gives lots of examples and anecdotes, which I found to be quite helpful. And she can be quite funny as well, depending on your sense of humour. She's willing to answer questions during/after class, but is terrible at technology so unless it's urgent, I don't recommend emailing her because she might miss it. The class was held in hybrid mode so you could opt to attend physically or via Zoom, and all the lectures were uploaded to Canvas so you could rewatch them. Slides are not uploaded, but they're also mostly just pictures rather than points.",
            "comment_grading": "Prof and TA weren't too strict with grading, but the margins for each grade were very small, so unless you're consistently scoring above mean for everything, you would probably end up around a B.<br /><br />Grading consisted of quizzes, participation (question of the day), a book review, presentation and timeline assignment.<br /><br />We had three quizzes, each covering two modules and were worth 10% each (so 30% in total). Homework will be included, so if you're looking for a good grade, remember to keep up with those because professor will not remind you about them.<br /><br />Participation took up 20% and was very easy to complete. There would be a QOTD every lesson and you would have to answer at least 10 in total to get full credit. Though she lets people answer in class, you can answer on Canvas as well. They're only available on the day of the lesson (until midnight) so you'll have to remember to answer those too. Also, the QOTD is only revealed during the lecture and not on Canvas, so you'll have to attend to get the question.<br /><br />Book review (15%) highly depends on the book you choose. She does provide a list for you to choose from, but I'd suggest picking one with good reviews or about something you like. The review should be around 600-800 words and you'll have to submit a draft a week beforehand.<br /><br />The (group) presentation (15%) can be done in groups of 1-3, so you can opt to do it alone. You'll have to schedule a slot with professor outside of class and you'll only be presenting to professor and/or the TA. There will be questions afterwards, so make sure you know what you're presenting.<br /><br />Timeline assignment (20%) was a bit of a pain because the website (Sutori) isn't super user-friendly, but professor was willing to take a look at your timeline and give suggestions a few days before the deadline.",
            "comment_workload": "There's no midterm or final, but workload is fairly heavy, especially towards the end of the semester when the presentation and timeline are due about a week apart. Assigned homework can also get quite heavy, but she tries to keep them a mix of videos and articles, and can be quite interesting themselves. Again, if you're looking for a better grade, do the homework, because they will be quizzed. <br /><br />Overall, I enjoyed the course. And if you like history, I'd say it's worth taking.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4ZkZ3UDPfCRKSkkq6psSw0sif8CYeVHb",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1020,
                    "name": "SMITH, Jenny Leigh",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bass",
            "date": "Dec 28, 2021",
            "title": "",
            "comment_content": "Content might not be as you’d expect for a history of medicine and biology. She has mentioned before that this course was supposed to cover all sciences but didn’t have enough physics to call it that. So there would be topics like the Manhattan project covered alongside genetics for example. So if the connection between the content and what’s considered medicine and biology is weak then it would be because of that reason. It’s quite enjoyable if you’re interested in history. If you don’t enjoy history then I wouldn’t recommend this course. Topics are less explaining and more examples and anecdotes that you’d have to remember. Even though a lot of dates are mentioned you don’t need to remember them.",
            "comment_teaching": "The prof teaches well and has nice articulation so it’s nice to listen to her but she often doesn’t start with the main point, which makes taking notes quite hard. She also often starts with one point but doesn’t finish it because she got distracted with another point. But there are recorded lectures available so you can go back and listen to it properly. She’s funny and unironic so the way she talks about the topics are entertaining.<br />Since there’s covid there are live zooms that you can join if you can’t make the class in person.",
            "comment_grading": "Grading is lenient but the margin where most marks fall in is very small. So it is fairly competitive. The only place where distribution is relatively wide are the quizzes so if you want to do well, focus on those.<br /><br />There are:<br />3 quizzes (10% each -&gt; 30%)<br />If you’ve studied well enough and covered the lectures and pre-readings&nbsp;&nbsp;(or get lucky that the questions are on what you studied) then it’s easy to get high marks since the questions are easy but you’d only know the answer if you’ve gone through the content.<br /><br />1 book review (15%)<br />You have to choose a book out of a list and read and give a review on it. Make sure to choose one you like or at least one with less pages if you don’t like reading or don’t much have time. You have to submit a draft a week before. <br /><br />1 final timeline assignment (20%)<br />You have to choose a topic from the lecture and make a timeline out of it on Sutori. It is fairly simple. The prof was willing to review our timelines before submission day and give suggestions/improvements etc.<br /><br />1 presentation<br />You choose a topic out of a list and you can choose to do it alone or with people. Make sure to know what you’re talking about since she asks questions afterwards.<br /><br />Question of the day (20%)<br />Every lecture there is a question of the day that will be given at the beginning of the class that you’d either get to answer in person (if she picks you) or otherwise post on canvas. TA handles these and you just need to make sure your answer is not the same as those that were given in class. You have to answer 10 times to get the full marks.<br /><br />Good thing about this course is that there are no midterms or finals.<br /><br />I got 89% and got A-",
            "comment_workload": "It’s quite high considering the amount of content you have to cover for the quiz. It personally takes me a whole weekend to go through all the content properly (ended up getting 8/10 or 9/10 in these quizzes). The timeline doesn’t take long (maybe 2 days), and obviously you’d need to read the book for the book review. The presentation takes about a week with people. And you have to remember to do the question of the day, which takes about 10 min to do.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eZ41NxFuGZcqNMTwoGsanZMQ5x40fErV",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1020,
                    "name": "SMITH, Jenny Leigh",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "/",
            "date": "Dec 28, 2021",
            "title": "A bit heavy workload, unorthodox style of teaching, but interesting",
            "comment_content": "Similar to another previous review, I also feel that the HUMA department gives the prof liberty in deciding what to teach so she just includes everything she wants. But still very interesting and worth the time listening.<br /><br />This is actually more like a history course, as the topics given in the syllabus (attached file) are not that closely related to biology and medicine.",
            "comment_teaching": "Prof Smith's style is quite unorthodox. Her ppt only contains images and very few info, as most of the main contents are delivered verbally. So, taking notes carefully or reviewing the recordings is a must since there's no way you can concentrate fully during the whole lecture.<br /><br />Her delivery is sometimes also confusing, as she literally speaks out what she remembers at that time, so topics may get mixed up. There are even times when she didn't prepare the contents beforehand, so when she ran out of available contents, she even ends the lecture early. But she tried to include a lot of anecdotes, comparisons and personal comments, sometimes ironic or satirical remarks (e.g. her famous catchphrase &quot;dead white guys&quot;), which really lights up the class atmosphere.<br /><br />And even though it is a history course, you don't really have to memorize the dates and events like in high school. The prof encourages students to understand only the basic stuff underlining each historical event and the ability to analyze those stuff. It is the funnier side, the more &quot;trivial&quot; side of history that is covered in this class.<br /><br />P/S: Prof seems to be quite low-tech and she often messes up things on Canvas, e.g. forgetting to post the assignments/recordings on time.",
            "comment_grading": "Class participation: 20%<br />Quizzes: 30% (3 quizzes, 10% each)<br />Presentation: 15%<br />Book review: 15%<br />Final timeline assignment: 20%<br /><br />Class participation: Each lecture she has a &quot;question of the day&quot; (QOTD), e.g. what is the difference between alchemy and chemistry, what do you know about the history of skulls. If you don't have a chance to answer in class, you can submit your answer on Canvas until 11:59pm that night (though prof usually forgets to open the assignment for us to submit on time so the deadline is often extended). You have to answer 10 times during the term, 2% each, to get a full 20%.<br /><br />Quizzes: 5 questions, 2 points each in each quiz. Grading is lenient, only short answers needed, and as long as you touches on the basic concepts that prof mentioned in class, you will get points.<br /><br />Presentation: You can choose to do it on your own or in groups of 2 or 3. Not difficult, but if you want to get above average, try to include more subtle contents that are not in wikipedia, study carefully the details of your topic, and also show to the prof that you have the ability to analyze history instead of merely recalling historical facts. <br /><br />Book review: You choose a book about 1-2 months in advance. You have to submit a draft about 1-2 weeks beforehand, as prof also says that having 50% of your work done 1 week ahead will be better when you enter November with lots of works from other courses.<br /><br />Final timeline assignment: Make a timeline of events (with photos and personal comments) in a topic that is related to the course topics. You will do it on a platform called Sutori.<br /><br />IMPORTANT: Grades are very competitive, since many students' scores are often concentrated in a small range (e.g. for the presentation, most scores are in the range of 11 - 14.5). So if you really needs a high GPA and you don't have time to follow the high workload, consider a different course.<br /><br />My grades:<br />Participation: 20 (mean 18.22)<br />Quiz 1: 10 (mean 8.11)<br />Quiz 2: 9 (mean 6.24)<br />Quiz 3: 8 (mean 6.76)<br />Presentation: 14.5 (mean 13.36)<br />Book review: 13 (mean 13.03)<br />Final timeline assignment: 18.67 (mean 16.48)<br />Total: 93.17<br />Grade: A",
            "comment_workload": "Generally quite high, especially the assigned readings/videos and the book review. But I would say it's worth the effort.<br /><br />QOTD: Spend some time searching on Google and you are good to go. Only short answers are needed, and as long as prof and TA understands the most basic things you are trying to mention, you get full points.<br /><br />Quizzes: Quite demanding since you have to revise what you've learned in previous lectures, either through your notes or through the recordings which are often updated very late, sometimes weeks after the lecture took place. Remember to do the assigned readings and videos, since some questions will come from those materials.<br /><br />Presentation: It's important to have a good teammate. Preparing a week in advance should be okay as long as you are not busy in that week.<br /><br />Book review: Do it as soon as possible. You will be swamped with deadlines when November comes. Remember to have a look at how long the book is before finalizing your choice, since I didn't and ended up choosing the longest book :D<br /><br />Final timeline assignment: A week should be enough.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "dqnLBU5UUtyUHCxGRVDpqaYy48OdvzaW",
                    "name": "Syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "eZqSc5tFtVtHYmftIeqj2EJfF6bbJDIR",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1020,
                    "name": "SMITH, Jenny Leigh",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Mildred",
            "date": "Dec 28, 2021",
            "title": "",
            "comment_content": "The content is fun itself, however, her slides are not reader-friendly, since many of her slides are just with one picture without any explanation. This forces you to go back to rewatch the lecture video every time.",
            "comment_teaching": "She sometimes forgot about the teaching content or even did not prepare the lecture slides for some parts. <br />Also, she did not handle the uploading of document well. She sometimes forget about opening the assignment or Question of the Day on canvas. She also forgot to upload the lecture videos and slides on canvas too.",
            "comment_grading": "Her grading was not bad. However, it really depends on your language skills.",
            "comment_workload": "Heavy workload. Lots of reading materials and extra video / podcast required. If you cannot handle tons of reading, do not take this course.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YpePUl61oOFsqAIOAMslPloI4z4Q2cOw",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1020,
                    "name": "SMITH, Jenny Leigh",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "3ub",
            "date": "Nov 26, 2021",
            "title": "Rlly enjoyable but have quite a workload (but easy)",
            "comment_content": "Module1: Alchemy<br />Module2: Navigation<br />Module3: Microbes <br />Module4: Fossils <br />Module5: Genes<br />Module6: Institutions and Cures",
            "comment_teaching": "One of the few class that was worth listening. <br />Not so deep on science, but more about the fun aspect. Even though I hate history, the professor provides fun anecdote to link with the topic. The class was very fun for me (not a big fan of studying...just an average student). <br /><br />She tends to forget some stuff for class, but is more easy going than other strict professors.",
            "comment_grading": "Not bad. <br />The prof accepts wide range of answers in quizzes (written form). Even though you write poopy stuff, she says ok if it makes sense LOL.. <br /><br />Honestly speaking, if you are quite good in english, you will get at least a B+ or higher without deep effort.",
            "comment_workload": "There is considerable amount of workload but not so hard. <br /><br />Question of the day ==&gt; answering easy open ended questions every class <br /><br />3 quizzes ==&gt; I didn't memorize a thing and just listened to the lecture but got 90% and 100% for the three test. <br /><br />group assignment ==&gt; easy one assignment about a topic with one presentation (did it in 2 days lol) <br /><br />individual assignment 1 ==&gt; book review, reading a book and writing a book review (need draft and final version) <br /><br />individual assignment 2 ==&gt; making timeline about a topic of your choice related to the lecture. <br /><br />I know it is considerate amount of workload since there is also additional reading / video for some classes, but it is really helpful to me in general in building some basic knowledges and somewhat scientific.<br /><br />I listened to 18 credits this sem, and it was tough for me, but I don't regret taking the course as it was so fun. Even though the syllabus looks tough and boring BUT professor makes everything so fun!!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1VSTCIFX0KOxhmjwQ7QnVuxmtdedhd7j",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1020,
                    "name": "SMITH, Jenny Leigh",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "grizelyt",
            "date": "Jun 11, 2020",
            "title": "large workload",
            "comment_content": "This semester focused 5 modules including:<br />1.Introduction to the History of Science and Medicine<br />2.Evolution &amp; Eugenics<br />3.Clinics, Institutes and Laboratories<br />4.Pharmaceutical Industry<br />5.Instruments <br /><br />Content is interesting and sometimes you find many meme-able historical drawings which are fun to see.",
            "comment_teaching": "Professor usually finished her lectures less than an hour and the content was well-delivered.",
            "comment_grading": "Course Participation (20%), answer all the 'the question of the day' (similar to an open-ended sharing session,e.g sharing your thoughts on how biotechnology help humans?) then you will have a good mark, try to speak up during lessons. However, the questions would only be mentioned during lessons and you need to answer them before 11:59 pm on the same day of lectures.<br /><br /><br />Quizzes (40%): Four quizzes in total, students only need to answer with the knowledge they gained during lessons and the readings provided, clear logic should be presented, language fluency isn't a matter I would say.<br /><br />quiz 1: 7/10 (mean 6.8/10)<br />quiz 2: 9.2/10 (7.5/10) <br />quiz 3: 8.5/10 (7/10)<br />quiz4: 8/10 (7/10)<br />Final Presentation (25%) you can either choose to have a group presentation or a solo one, topics are provided by the professor or you can suggest one yourself. <br />sample topics: History of forensic science /History of cancer treatments/History of Japanese robotics<br />there would be a Q&amp;A session after your presentation and questions are not that hard, the professor will ask them according to your content of ppt.<br />mark: 22/25 (21.6/25)<br /><br />Book Review (15%) Students will be asked to read and write a review on a book of their choice. Booklist would be provided by the professor. Drafts of book review would be graded also.<br />mark: 13/15 (mean: 12.1/15)<br /><br />Overall, it is very hard to get an A-range.<br />B+ cut-off grade is 89.0-89.99 <br />A- is around 90 sth<br />A is 94 sth<br />I got B because I only got 87.7…",
            "comment_workload": "There were tons of materials provided (e.g documentaries around 30min, 15-30 pages selected from books per reading, research papers, radio program etc), if you are not a big fan of having finals and midterms, this is a wise choice for you, daily performances contributed to your grade and frankly speaking, this course is only for the ones who are willing to read a lot. However, your efforts would definitely be rewarded.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "70cpDjc77w1H0z7aeKShys4IR7x5YJ31",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1020,
                    "name": "SMITH, Jenny Leigh",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "C8H9NO2",
            "date": "Jun 11, 2020",
            "title": "",
            "comment_content": "Module One - Introduction to the History of Science and Medicine<br />Module Two - Evolution &amp; Eugenics<br />Module Three - Clinics, Institutes and Laboratories<br />Module Four - Pharmaceutical Industry<br />Module Five - Instruments <br /><br />I personally enjoyed the course content and found them interesting. If you are doing a chemistry or life science major, this course may be suitable for you.",
            "comment_teaching": "I'm not a huge fan of her teaching style but overall the lectures are interesting. She normally doesn't share her slides with students so you'll need to take notes by yourself. However, due to the online-teaching mode, lecture videos were available this semester, which were really helpful for review.",
            "comment_grading": "Grading scheme:<br />- Course Participation (20%)<br />- Quizzes (40%): 4 quizzes<br />- Final Presentation (25%)<br />- Book Review (15%) <br /><br />Grading wasn't particularly good, but not as bad as people said. I got 94.3 in total and ended up with an A. The class was in small size so you'll need to perform well in every assessment to get an A range grade.",
            "comment_workload": "The workload was as heavy as expected. There were pre-class readings or videos and a few long articles to read for each module. It highly recommended to go through most of the assigned reading so that you can perform well in the quizzes. <br /><br />Everyone in the class was required to write an individual book review. For presentation, this semester she allowed solo or group presentation. Topic was chosen from a given list. It wasn't a very tricky one, comparing to many other courses.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SZoEIu6JJsBcpaClqyHX5VjpgBmUVuRl",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1020,
                    "name": "SMITH, Jenny Leigh",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Y.T.",
            "date": "May 14, 2020",
            "title": "Huma 2596",
            "comment_content": "Don't think u are interested in medicine and biology stuff and this course will be easy for u. This course is talking about tones of history stuff and also talking about all the things that scientists invented.",
            "comment_teaching": "the tutor seems like she doesn't know what she is teaching and she is also confused by her own teaching material",
            "comment_grading": "The grading is completely harsh and it is really hard to attain an above mean score in the quizzes.",
            "comment_workload": "The course is so terrible like every week there are tones of readings to do. If you are not a book-person or a native reader, I strongly recommend you to drop or not add this course into ur list of course.<br /><br />We have 4 quizzes, 1 presentation and 1 book review to do and I personally study very hard and do all the readings within this semester and still below mean in the two quizzes.",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}