{
    "error": false,
    "course": {
        "id": 570,
        "subject": "HUMA",
        "code": "2589",
        "name": "Mussolini, Stalin, Hitler: Dictators and their Regimes",
        "description": "This course provides undergraduate students with an overview of three definitive political and social movements of modern Europe: Fascism, National Socialism and Stalinism. It emphasizes the comparative analysis of politics, ideology and everyday life; the close reading of primary sources; and theoretical perspectives.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            1710,
            1510,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.27,
        "rating_teaching": 4.27,
        "rating_grading": 3.45,
        "rating_workload": 3,
        "review_count": 11,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 314,
                "name": "DERMAN, Joshua",
                "count": 10
            }
        ]
    },
    "reviews": [
        {
            "hash": "pGOzHsD3xbjBRsDe0LiAJwVFMairFXI7",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "diudiu",
            "date": "Dec 29, 2015",
            "title": "杜哲士真男神!",
            "comment_content": "Covers European history from 1914 to 1945, but centered around Germany, Italy and Russia, and their respective dictators - how Hitler, Mussolini and Stalin rose to power, what political happenstances enabled their rise, their regimes etc.<br />Includes ample intriguing bits of history as well as deep insights into the intricate politics of the interwar era through the extensive readings.<br /><br />Since the course content jumps from one country to another in mere weeks, and many of the historical events happened in intertwining manners, one may find writing up timelines useful.",
            "comment_teaching": "Professor Joshua Derman is a very nice professor who knows his course materials well. He is easily approachable and almost always answers should you have any questions concerning particular details, however irrelevant or unimportant they may be. If you met any troubles with the course, be sure to approach him.<br />However, he often had too much to cover in a lecture and could not finish all the lectures before study break (well to be fair he did miss two lectures due to family matters).<br />I gave teaching a B because he often spoke too fast and you will have to take notes at law school speed; moreover, most of his sentences end unintelligible because he spoke in decrescendo every sentence.",
            "comment_grading": "The mean grade is around B, and since the quizzes and exams are pretty straight forward, expect a pretty high mean score for the course. (~80%)<br />You need to score ~90 to get A range. I got an A+ here averaging ~96%<br /><br />Grading Policy: 20% quizzes (two quizzes, 10% each)<br />35% midterm<br />45% final",
            "comment_workload": "To get a good grade, it's alright to just memorise all the powerpoint slides.<br />However, to truly learn and guarantee an A range, one should always read the texts recommended by the instructor. There are usually about 20 to 40 pages of readings per lecture. Two textbooks are also mandated by the course, Stanley Payne's &quot;A History of Fascism, 1914 - 1945&quot; and Sheila Fitzpatrick's &quot;The Russian Revolution&quot;.<br />FYI, you need to dedicate about 5 hours of study for each lecture (for readings and post-lecture notes), and will have to type ~1000 words for each lecture.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6sFgFfFA74tB5R9FOmJ8i3ndUnxSZkul",
            "semester": "2013-14 Spring",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "NightShade",
            "date": "Aug 25, 2015",
            "title": "Extensive reading, but enjoyable",
            "comment_content": "Extensive reading materials (two books) with ppt and notes (listen in class to fill up the blanks). Enjoyable and informative. Analytical, but exam focuses on memorization<br /><br />HELP:<br />https://mypresentation4urop.wordpress.com/",
            "comment_teaching": "Amazing professor. Knows&nbsp;&nbsp;his material. Interactive classroom. May get boring if you suffer from information overload near the exam-time.",
            "comment_grading": "2 quizzes - 20%<br />midterm - 35%<br />final - 45%<br /><br />Fair grading; B range near the mean(7X%).",
            "comment_workload": "Depends on your power of memorization and interest in history. But if you decide to read the textbooks, it will become heavy.<br /><br />HERE:<br />http://www.huma.ust.hk/teaching_learning/files/2014spring/HUMA2589.pdf",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "L9jkrob2VCNR0DWDLVQqijc2x4pzWzpQ",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mew~",
            "date": "Jan 23, 2018",
            "title": "Great class for people who are truly interested in history",
            "comment_content": "The content is what you would expect from the title of this class. The course is divided into three parts: Hitler's Nazi Germany, Mussolini's Fascist Italy, and Stalin's Soviet Union. The time period spans from the eve of WWI to the defeat of Axis in the WWII. <br />Each lecture contains about 20 to 30 pages of PPT that would be tested on the exam.",
            "comment_teaching": "The teaching is beyond perfection. In fact, this is the best course I have ever taken at HKUST. The professor knew his materials extremely well, and the contents were delivered in a very organized fashion. I would highly recommend anyone who is interested in history to take this class, as the teaching by itself is just fascinating.",
            "comment_grading": "DISCLAIMER: DO NOT TAKE THIS CLASS IF YOU ARE NOT INTERESTED IN HISTORY!<br /><br />The grade is just OK. <br />I got significantly above mean on every single exam, but ended up only getting an A, so I would imagine the grade would be unsatisfactory for most students. <br />However, if you were truly passionate about history, it is almost effortless to obtain a good grade.",
            "comment_workload": "The professor gave assigned readings, but none of their contents were tested on the exam. So if you just wanted a good grade, attending classes is more than enough.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gjiOICg2b0qGs7NrRagZH9KRHl5kmcOB",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "catarina",
            "date": "Dec 29, 2017",
            "title": "DO NOT DO NOT",
            "comment_content": "Content is ok I guess. Not bad. The course focuses on Hitler, Stalin and Mussolini but it's honestly not particularly interesting. It's literally learning about their entire lives starting from when they were born so there isn't much time to learn about the interesting stuff that we all wanna know. <br /><br />If you're interested in learning a lot about the Holocaust and stuff like that, NOT THIS COURSE. BARELY TOUCHES IT.",
            "comment_teaching": "He's pretty boring not gonna lie. It's very &quot;lecture-styled&quot;, aka he talks for the entire class and you copy notes. His voice is pretty monotonous but he'll sneak a joke in here and there.",
            "comment_grading": "TERRIBLE. 20% quizzes (2 quizzes, 10% each), 35% midterm, 45% final <br />Quiz 1: above mean<br />Quiz 2: below mean<br />Midterm: above mean<br />Final: idk but i think i was around mean <br />Grade: C+ <br />RUN FROM THIS COURSE TERRIBLE GRADING. btw if you don't memorize the entire course - like every detail - the tests are impossible. He'll actually ask things like &quot;what was the percentage of votes that the NSDAP gained in 1928&quot;. INSANELY SPECIFIC.",
            "comment_workload": "AWFUL. On top of weekly textbook readings, there are also weekly &quot;supplementary readings&quot;. It starts off ok like 5 pages but that's a lie. After midterm all of the readings are AT LEAST 30 pages. they go up to 100 pages. WEEKLY. MORE THAN ONE READING WEEKLY. Of course you could ignore the readings. But be prepared for an awful grade.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iPpSSndnm6tPRPwYYqXpZPDK5MX0Yz0S",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nimisha",
            "date": "Aug 05, 2016",
            "title": "Awesome course for History buffs",
            "comment_content": "The content is well organised and presented. It contains the political regimes and social life during the reign of Mussolini, Stalin and Hitler; and less content about wars etc.",
            "comment_teaching": "Teaching is great. The professor is engaging and makes the lectures interesting.",
            "comment_grading": "Grading is okay. The papers contain both MCQs and long answer questions; and they are not too difficult to score in.",
            "comment_workload": "The only workload was reading assignments. But there were 2 quizzes and a midterm exam and a final exam which we had to study for. (And again, the reading assignments are not completely necessary to score good marks).",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "t3LsELH0QyAtFsbLXalgoONtGlEFVx2d",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "brndnng",
            "date": "Feb 01, 2016",
            "title": "",
            "comment_content": "2 1.5-hour lectures per week. No attendance requirement. Lectures are video-taped with the condition that there is satisfactory class attendance. Covers background events leading to the rise of the three dictators and compares them.",
            "comment_teaching": "Fast-paced teaching. Covers more content than in the powerpoints. Likes to ask students for their views on the topic.",
            "comment_grading": "10% each Quiz 1 and 2 (MCs, Map Questions)<br />35% Midterm (MCs, Map Questions, Short Identification Questions)<br />45% Final Exam (MCs, Map Questions, Short Identification Questions, Essay questions)<br /><br />Questions are easy overall, requiring only common historical sense and memorisation. Try your best to present as many relevant views in essay questions.<br />Normally no A+'s are given, unless it's a different lecturer.",
            "comment_workload": "20-30 pages of readings per lecture that will be assessed. No assignments. Two quizzes in between a midterm exam and final exa,.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jdhoXrE5BAyxOr4TqrUIvjdPWpaU0LjQ",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "udaygovil",
            "date": "Jan 27, 2016",
            "title": "",
            "comment_content": "The content of the course is super interesting if you're interested in European history, and the world war period.",
            "comment_teaching": "Prof. Joshua is very good. Keeps the class interactive and is very responsive to queries.",
            "comment_grading": "Grading isn't too strict. Easy to get a decent grade if you keep up with the course content.",
            "comment_workload": "Workload isn't a lot. Weekly readings are assigned, though they aren't compulsory, they are recommended for a better understanding for the course. 2 quizzes which were pretty straightforward, along with a mid term and final which are moderately tough.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LefRNXmkpuRsFgOtwv3cSphWmAZsuOsj",
            "semester": "2014-15 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Marz",
            "date": "Jan 27, 2016",
            "title": "",
            "comment_content": "The content is really comprehensive and interesting throughout the course. It explores not only the history facts but also the backgrounds, people that causes the event.",
            "comment_teaching": "The instructor is keen at explaining and clear and concise. He stress not only on the key facts but the regimes of the three dictators, their philosophies and how different people's role, cultural factors which is quite thought-provoking.",
            "comment_grading": "The grading was fair though I thought I deserve more for the handwork i put into the course.There are 2 mc quizzes which are not that challenging. I haven't taken any human courses before and had a bit confuse at what exactly is wanted for the essay questions in the final.",
            "comment_workload": "The workload is fair with assigned readings for every lesson which give us a more in-depth background of the things going to be discussed. There is no extra homework but two mc quizzes which you should do well if you pay attention to the class.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1Vu9WMLvMRA4kLjTxatBpdZmvQow5liK",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nasty",
            "date": "Jan 23, 2016",
            "title": "The Joy of Learning",
            "comment_content": "Although I had studied about these dictators before, I learnt a lot of new stuff through his course. It really changed my perspective about the two world wars and the cold war. This course helped me see Stalin in a new light.",
            "comment_teaching": "Definitely one of the best professors at HKUST.",
            "comment_grading": "I think I got 83% in this course, but I still got a B.",
            "comment_workload": "2 quizzes that count for 10% I think, a midterm and a final. So you have to work for it regularly or you'll have too much to study in one night.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mTKhkgBSPxjqHr0DBi8Rc2zEGWrL7W37",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "EdogawaC",
            "date": "May 04, 2017",
            "title": "The single most stupid decision I made was to take this course",
            "comment_content": "Endless boring contents, I took this course believing that I would learn interesting developments in the two world wars, but instead ended up learning about the background of the leaders. Well blame it on my not understanding the course objective or whatever, but it was such a dull uninteresting course.",
            "comment_teaching": "His teachings were alright, but the monotonous voice and boring ppt contents put me to sleep after the first few lessons. Almost 3 hour class twice in a week certainly doesn't help.",
            "comment_grading": "Did terrible, have no idea how grading curve was like since it was my freshman year. Studying for the finals was hell, and the questions asked were mostly essay-type if i am not mistaken, and I sincerely don't understand how you are supposed to answer those questions without memorizing every single ppt contents of his class.",
            "comment_workload": "Just soooo many reading materials, I tried my best to read them all before class but the contents persuaded me to spend my time doing something more constructive. And since I gave up reading them after mid term, the ppt contents became even more mysterious, and my time in the class turned into even more misery. I think there were quizzes as well, but I am not entirely sure.",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bBkyzNXCbvazGADJrMqWpOifI3FuTNBb",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Shash",
            "date": "Jan 25, 2016",
            "title": "Hitler Stalin Mussolini",
            "comment_content": "This course is indepth and really interesting. The instructor is amazing.&nbsp;&nbsp;Its important to go to every class though, and take notes but most students would probably reallly want to go to class as the subject itself is so interesting and mesmerising.",
            "comment_teaching": "Joshua is a great instructor and the follow of the class isn't dull in my opinion. He will also upload lecture videos by the end of term which is really helpful.",
            "comment_grading": "Grading is okay. I did above mean in every test but only got an A-.",
            "comment_workload": "There are 2 mcq tests, a midterm and a final so the course load is okay.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}