{
    "error": false,
    "course": {
        "id": 618,
        "subject": "HUMA",
        "code": "3900",
        "name": "Philosophical Inquiry into the Modern World",
        "description": "This intermediate course will introduce students to basic philosophical methods and concepts in order to help them to explore the nature of philosophical inquiry and survey various important fields, problems and issues in the discipline. The change from the Aristotelian world-view, to the Copernican Revolution, and the present Darwinian Revolution, i.e., from a religious and teleological (purposive) view to a non-teleological view, is outlined in the class.",
        "categories": [
            "Common Core (H)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2130,
            1930,
            1730,
            1610,
            1440
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.5,
        "rating_teaching": 4.5,
        "rating_grading": 4,
        "rating_workload": 4.5,
        "review_count": 2,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 326,
                "name": "NELSON, Eric S",
                "count": 1
            },
            {
                "id": 1732,
                "name": "PROOI, Dennis",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "bXpL7I9seekIY9PI5bzLB1vzmJxapYE3",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 326,
                    "name": "NELSON, Eric S",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "販冰兵",
            "date": "Jun 08, 2020",
            "title": "A good introduction to western philosophy ideas",
            "comment_content": "Course Outline<br />1.\tIntroduction: February 20 (TH)<br />•\tIntroduction to the Course and introduction to Galileo, the Copernican Revolution, and the Emergence of the New Sciences<br /><br />I.\tKnowledge and Nature in Early Modern Philosophy<br />2-4.\tKnowledge, God, and the Self: A New Paradigm? February 25, 27, March 3 (TU, TH, TU)<br />•\tA close reading of: René Descartes, Meditations<br />5. \tNature, Power, and the State: March 5 (TH)<br />•\tThomas Hobbes, Leviathan (chapters 12 and 13)<br />6.\tPersonal Identity: Am I the same person over the course of my life? March 10 (TU)<br />•\tJohn Locke, An Essay Concerning Human Understanding (chapter 27)<br />7. \tIs this the Best of all Possible Worlds? Theodicy, Nature, and Natural Theology: March 12 (TH)<br />•\tG.W. Leibniz, Discourse on Metaphysics•\t<br />Assignment One (Descartes to Locke): March 15 (SU)<br />at home writing assignment one due<br />8-10.\tThe Paradoxes of Knowledge and the Problem of Skepticism:<br />March 17, 19, 24 (TU, TH, TU)<br />•\tA close reading: David Hume, An Enquiry Concerning Human Understanding<br />11.\tA New Copernican Revolution? Enlightenment and Critique: March 26 (TH)<br />•\tImmanuel Kant, Prolegomena and Critique of Pure Reason (selections)<br />\tProbably will be cancelled<br />March 27 (FRI) or March 30 (MON) (details tba)<br />Guest Lecture by Jos de Mul (Erasmus University of Rotterdam),<br />“Polycentricity and poly(ex)centricity: new levels of positionality? On telerobots, craniopagus twins and global brains”<br /><br />II.\tThe Nineteenth-Century<br />12. \tOn Nothingness and Suffering: March 31 (TU)<br />•\tArthur Schopenhauer, World as Will and Representation (selection)<br />•\tG. W. F. Hegel, Science of Logic (selection)<br />13-15.\tEquality and/or Liberty? April 2, 7, and 9 (TH, TU, TH)<br />•\tKarl Marx and Friedrich Engels, The Communist Manifesto<br />•\tJohn Stuart Mill, On Liberty<br />16-17.\tWorldview, Science, and Philosophy: April 14 and 16 (TU, TH)<br />•\tWilhelm Dilthey, The Essence of Philosophy<br />•\tWilhelm Dilthey, The Types of World-View and Their Development<br />in Metaphysical Systems<br />Assignment Two (Hume to Dilthey): April 19<br />at home writing assignment two due<br /><br />III.\tKnowledge, Metaphysics, and Politics<br />18.\tGuest Lecture: April 21 (TU)<br />Martin Yu Ting Lee: Heidegger and the “we”<br />•\tMartin Heidegger, Being and Time (selection)<br />19-20.\tA Debate over Metaphysics and Nothingness: April 23 and 28 (TH, TU)<br />•\tMartin Heidegger, What is Metaphysics?<br />•\tRudolf Carnap, The Elimination of Metaphysics through the Logical Analysis of Language<br />No Class: April 30 (TH) <br />Buddha’s Birthday Holiday<br />21.\tA Debate over Certainty and Skepticism: May 5 (TU)<br />•\tG. E. Moore, Proof of an External World<br />•\tLudwig Wittgenstein, On Certainty (selections)<br />22.\tThe “Second Sex” and Existential Feminism: May 7 (TH)<br />•\tSimone de Beauvoir, The Second Sex (selections)<br />23.\tPhilosophy after Auschwitz: May 12 (TU)<br />•\tHannah Arendt, Origins of Totalitarianism and Eichmann in Jerusalem (selections)<br />24.\tCommunicative Rationality and Democracy: May 14 (TH)<br />•\tJürgen Habermas, Three Normative Models of Democracy",
            "comment_teaching": "ESN is a nice prof that is always willing to answer students' lengthy questions. He also explains those philosophy ideas pretty clearly. But sometimes when he explain topics that are not quite interesting (For me it is metaphysics), u might easily fall asleep in his lectures. But afterall this is a philosophy class so what can u say.",
            "comment_grading": "Assessment Tasks:<br />1.Three At Home Paper Assignments\t\t\t\t\t\t80%<br />2.Participation online canvas discussions(or in-class):\t20%<br /><br />I got 26.7/26.7 (A) for paper 1, 23.763/26.7 (B+) for paper 2, 23.763/26.7 (B+) for paper 3, and 17.8/20 for discussion and participation. Ended up with a B+. I would say he is a bit lenient with gradings so the mean is pretty high.",
            "comment_workload": "The workload is light. Only three short philosophy paper (4-5 pages each) throughout and a weekly online canvas discussions.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ky2cz6t4f5vCBcXT1qukUyvEdrXTf4oJ",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1732,
                    "name": "PROOI, Dennis",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DrainGang",
            "date": "Jun 06, 2023",
            "title": "A fantastic course, ONLY if you like philosophy. (NOTE: COURSE IS ALSO NAMED CORE3574.)",
            "comment_content": "Philosophers covered:<br /><br />Habermas<br />Plato<br />Aristotle<br />Descrates<br />Hobbes<br />Spinoza<br />Conway<br />Leibniz<br />Hume<br />Kant (For 3 lectures in a row)<br />Hegel<br />Gunderrode<br />Marx and Engels<br />Schopenhauer<br />Nietzsche<br />Horkheimer and Adorno<br />Beauvoir<br />Foucault<br />Said<br /><br />Introduction to western philosophy, spending a short while on every philosopher mentioned above (even with 3 lectures on Kant, not everything is covered), the content is much more rigorous than say a HUMA1000X course, so register only if you are interested, which I am!",
            "comment_teaching": "Great!<br /><br />Every lecture was clearly prepared and Dennis goes over the lecture materials in an easy to understand way, providing good examples for the more abstract concepts (i.e. him throwing his water bottle on the ground). If you are still puzzled after the lecture, he is very willing to answer, or even discuss further about the lecture contents. (I would know.)<br /><br />And for those that aren't as attentive, the powerpoints are well made and one could learn everything needed from the powerpoints alone.",
            "comment_grading": "Midterm (30%): Given 5 questions on explaining different concepts from the philosophers discussed in class, choose 4 to answer. They test you on your understanding of the theories, instead of just memorizing, for example there would be questions asking for similarities between 2 philosophers, and you would have to compare them.<br /><br />Final (30%): Same as midterm, covers all content after the midterm.<br /><br />Reflection Essay (20%): Write about any philosopher covered in the class, in under 1000 words.<br /><br />Participation (20%): 8 CANVAS discussion posts, write about 200 words discussing the lecture contents.<br /><br />OPTIONAL THINGS: A presentation that would replace the lowest score question in the final exam, and being a commentator in those presentations would give a full mark for 2 of the CANVAS posts.<br /><br />Average grade is close to a B, seems good! A+ requires a 97/100% or so, which I didn't get since I was going through some stuff and didn't have the mental to do the bonus things.",
            "comment_workload": "For a common core course, not the lightest.<br /><br />The readings (Which I think are necessary) are quite rigorous, and at points incomprehensible depending on the style of writing (Kant and Hegel are very hard to understand). Most would take 2 hours or so, and there's a new reading EVERY lecture, so that is quite a lot of time investment.<br /><br />The exams are quite basic, and if you have understood the lecture clearly, it does not take much time to read through the powerpoints and memorize them.<br /><br />As for the paper, since its less than 1000 words, it could be finished in a day or so, once you have selected your own topic.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}