{
    "error": false,
    "course": {
        "id": 3170,
        "subject": "HUMA",
        "code": "1000F",
        "name": "Cultures and Values: Individualism, Family Values, and Social Responsibilities",
        "description": "This course will explore three core concepts of individualism, family values, and social responsibilities, including the individual self's emotional well-being, ethical and socially responsible citizenship, and the possibility of a fulfilled life. Centering around the self's relationship with family and the society, the course will address the following issues as reflected in a range of readings of Western and Chinese writings, literature, film and cultural texts: conceptions of the self; universal and culturally particular aspects of ethics and human nature; different conceptions of individual emotions (romantic love in particular); as well as the appreciation of beauty and art. Students will be introduced to key concepts concerning individual morality, feelings and social responsibilities, and to the ways in which nationality, family, the society, and other affiliations have been constructed in modern narratives of identity and selfhood. This introductory humanities course aims to develop students' critical thinking and writing skills, while cultivating their moral sensibilities and abilities to become well-rounded individuals.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2130,
            1930
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.4,
        "rating_teaching": 4.2,
        "rating_grading": 4.3,
        "rating_workload": 3.9,
        "review_count": 10,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 328,
                "name": "WU, Shengqing",
                "count": 10
            },
            {
                "id": 327,
                "name": "TSANG, Perseus",
                "count": 3
            },
            {
                "id": 1147,
                "name": "LAW, Chun Yin",
                "count": 3
            },
            {
                "id": 458,
                "name": "LI, Po Lung",
                "count": 2
            },
            {
                "id": 300,
                "name": "LI, Angie Eugenia",
                "count": 1
            },
            {
                "id": 411,
                "name": "MEGAN, Melissa Jane",
                "count": 1
            },
            {
                "id": 466,
                "name": "ENGLAND, Graham James Fisher",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "FBtlHyI4g7i3ubj50nIwYTaKIlGxY43B",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 328,
                    "name": "WU, Shengqing",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                },
                {
                    "id": 300,
                    "name": "LI, Angie Eugenia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AceOfSpades",
            "date": "May 31, 2020",
            "title": "One of the few good courses in HKUST, especially online",
            "comment_content": "To be honest this course is one of the few with a relevant description:<br /><br />This course will explore three core concepts of individualism, family values, and social responsibilities, including the individual self's emotional well-being, ethical and socially responsible citizenship, and the possibility of a fulfilled life. Centering around the self's relationship with family and the society, the course will address the following issues as reflected in a range of readings of Western and Chinese writings, literature, film and cultural texts: conceptions of the self; universal and culturally particular aspects of ethics and human nature; different conceptions of individual emotions (romantic love in particular); as well as the appreciation of beauty and art. Students will be introduced to key concepts concerning individual morality, feelings and social responsibilities, and to the ways in which nationality, family, the society, and other affiliations have been constructed in modern narratives of identity and selfhood. This introductory humanities course aims to develop students' critical thinking and writing skills, while cultivating their moral sensibilities and abilities to become well-rounded individuals.<br /><br />In Week 9, there was a guest lecture conducted by Prof. Eric Nelson, focusing on Utopia and Dystopia.",
            "comment_teaching": "It is an online course and is very engaging. Students are free to discuss about related topics while professor is talking, with Mr. Tsang acting as a chat moderator. Even if you don't understand about the philosophy, don't worry, because the online exam is open-book.<br /><br />Angie is an excellent instructor. She gave very concise and precise feedback one-on-one after each writing assignment, so you know exactly how to improve. Keep in mind attendance is recorded for tutorials.<br /><br />As long as you completed everything, it is a guaranteed pass on this course.",
            "comment_grading": "Quiz (Final Exam): 20%<br />Canvas Online Discussion x 3: 10%<br />Writing Workshops x 5 (Online + Online Classroom): 20%<br />Final Essay: 50%<br /><br />I'm grateful that the professor is considerate and doesn't make any far-fetched arrangements regarding the online exams. The time limit for the exam is 45 minutes, and you have unlimited attempts, meaning if you have completed once, feel free to try again if you are confident. Referring to selected readings, there are MCs and long questions, which require you to explain ideas of a philosopher.<br /><br />Showing your face is not required for the exam. Just make sure you're awake and go online!<br /><br />Grades are not yet released at this time of writing.",
            "comment_workload": "The workload of this course is very light. Make sure you have completed the online workshops before the tutorial. You can even complete them very early without needing to understand, because it has unlimited attempts.<br /><br />Like other HUMA1000 courses, there are writing workshops aimed to help improve your writing to prepare your final essay. There are 5 tutorials you need to attend out of all in total. Each time the tutor will focus on explaining each part of the essay and discuss how you can do better.<br /><br />There are only 3 discussions. My advice for it is the early you write, the more advantageous you are. These are the topics for reference:<br /><br />1. View the classical factory scene from the film Modern Times (1936). Discuss the positive and negative impacts of assembly lines, machines, and technology on human bodies, emotions, and interpersonal relationships in modern societies. One of you has made a thoughtful comment in class, suggesting that we are becoming slaves to modern technology. Are we human beings masters of, or slaves to, modern technology?<br /><br />2. How do you understand negative emotions (pain, suffering, fear, etc.) in romantic love? You can examine this topic from a range of perspectives, including the definitions of romantic love in different cultures, studies of emotions or psychology, morality, and individual’s familial and societal responsibilities.<br /><br />To think of one concrete scenario in which your beloved family members are adamant in their disapproval of your possible life-time partner for whatever reasons, when you believe you have found true love. Under these circumstances, would you break up with him/her or not? How do you reconcile your negative emotions in this process of breaking up with him/her or in challenging the authority of your family through disobeying them? You can also analyze other examples from literature or film (whether discussed in class or not) or social media to illustrate your points*.<br /><br />3. In face of current global environment crises, please list a few ecological degradations that you have encountered or observed in your own life, discuss humanity’s options in response to these crises, and your own personal ideas and endeavors toward a sustainable future. Furthermore, will the protection of animal rights, their equality or welfare, be in conflict with human interests? If so, how can humans strike a balance between their own and animal life? Please offer some concrete examples to illustrate your points.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "x3oCG3n9MyO61udvMxLEMgPQgm41RWsC",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                },
                {
                    "id": 328,
                    "name": "WU, Shengqing",
                    "rating": 1
                },
                {
                    "id": 466,
                    "name": "ENGLAND, Graham James Fisher",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DrainGang",
            "date": "Jun 10, 2020",
            "title": "Decent",
            "comment_content": "Description of the course gives a pretty good sense of what is taught: This course will explore three core concepts of individualism, family values, and social responsibilities, including the individual self's emotional well-being, ethical and socially responsible citizenship, and the possibility of a fulfilled life. Centering around the self's relationship with family and the society, the course will address the following issues as reflected in a range of readings of Western and Chinese writings, literature, film and cultural texts: conceptions of the self; universal and culturally particular aspects of ethics and human nature; different conceptions of individual emotions (romantic love in particular); as well as the appreciation of beauty and art. Students will be introduced to key concepts concerning individual morality, feelings and social responsibilities, and to the ways in which nationality, family, the society, and other affiliations have been constructed in modern narratives of identity and selfhood. This introductory humanities course aims to develop students' critical thinking and writing skills, while cultivating their moral sensibilities and abilities to become well-rounded individuals.<br /><br />In simpler terms, it focuses on basic philosophy and talks about different theories around things like technology, love, beauty, emotions, and more. It is pretty interesting if you are interested in this area, and if you aren't, don't worry, as nothing is really taught in depth.",
            "comment_teaching": "Teaching was OK, attendance was not required and was pretty useless since the professor repeat what is said in the powerpoints, feel free to attend but don't worry if you miss classes. <br /><br />Online writing workshops were good, Graham gave me very good feedback on my essay and helped me to figure out what to improve, he was also very friendly and would answer your questions on your essay.",
            "comment_grading": "20% Quiz:<br />Online and open book due to the coronavirus, 10 MCs and 2 short questions. Very simple if you have read the readings, even if you barely remember what is on them. Only SOME of the answers can be found in the powerpoints.<br /><br />10% Online Discussions:<br />3 online discussions, asks for your opinions on different parts of the course, such as technology, love and animal rights. Post your reply and then reply to other people's reply. Somewhat difficult as you need to spend time reading and then replying to other people (around 300 words) and also writing your original reply (around 600 words)<br /><br />10% Writing Workshop Classroom Activities:<br />Finish parts of your essay and hand it in on time to get all 10%.<br /><br />10% Writing Workshop Online Activities<br />Do the online assignments to get the full 10%, the assignments are incredibly easy and takes less than 20 minutes to complete.<br /> <br />50% Final Essay:<br />900-1200 word essay on one of 3 prompts. Graded by 1. Task fulfillment, 2. Organization, 3. Language and 4. Feedback. First three are self-explanatory, feedback refers to how you respond to feedback given on your essay by the TA.<br /><br />In the end despite getting more than 1.6 SD above mean I did not get an A+, only an A, but as the mean is a B and the median a B+, grading is good.",
            "comment_workload": "Workload was somewhat heavy.<br /><br />The essay takes quite a lot of time to write (900-1200 words), and the readings were actually needed for the quiz as the powerpoint does not cover all the points made by the readings, with 1 reading per week, you need to spend around 2 hours reading them. Not very nice since they are often quite boring.<br /><br />The online discussions take a bit of effort too, because to get a good score I believe you have to answer all of the questions asked in the discussion. Writing the replies takes quite a while too as you need to read what others wrote, which could be difficult as not everyone answers all of the questions, so you may not be able to find something meaningful to reply to...",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NQeh6GRRPXxhCGm7uFLQnDiVCmfqLVpr",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 328,
                    "name": "WU, Shengqing",
                    "rating": 1
                },
                {
                    "id": 1147,
                    "name": "LAW, Chun Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "leon czolgosz",
            "date": "May 05, 2022",
            "title": "Hidden gem in UST",
            "comment_content": "1. Introduction<br />2. The Moral Instinct<br />3. Destructive Emotions<br />4. Technology<br />5. Romantic Love 1<br />6. Romantic Love 2<br />7. Beauty<br />8. Concept of Nature<br />9. Cosmopolitanism<br />10. Utopia<br />There are required and supplementary readings for each topic, but since they're difficult, you only have to know what the PowerPoint says. And the PowerPoints are pretty good *cough* unlike Mech 1905 *cough*<br /><br />Warning: the author is a literature, theatre and history nerd that thinks way too much about stuff with very passionate feelings that border on obsession. (see username. google it.) They seriously considered being an English major in this economy. This review is most likely biased. But this course is really good.<br /><br /> I was genuinely interested in the subjects even though it was a 9am class. This is the first time I wanted a course to be longer. I don't understand why this course is the least popular out of all the HUMA 1000 courses. Maybe it's because the themes are more abstract. PS: you get to watch In the Mood for Love by Wong Kar-wai and it is amazing",
            "comment_teaching": "Professor Wu gives insightful comments on the topics discussed. The lectures are two hours long but they're not very boring. She invites students to discuss questions on the topic, and surprisingly (maybe because of the bonus marks, but I'm too shy to answer) a lot of people actively participated. She gives valuable feedback to each student. <br /><br />Instructional Assistant Yin is really nice. I forgot to do the quizzes before the writing workshop. I emailed him and he let me finish them. Thanks.<br /><br />My writing instructor is Martha Ng. She gives good writing advice on essay structure and a lot of feedback on my essay.&nbsp;&nbsp;She's also quick to answer all my many, many questions.",
            "comment_grading": "Final Essay 50%<br />One 900-1100 word academic argumentative essay based on one of three prompts given that are related to the lecture topics. The prompts are different every year. The workshops will teach you how to write it. Submitted a week after workshop 5.<br /><br />Online activities 10%<br />Remember to do them before 9am on the day of the workshop. Unlimited attempts.<br /><br />Writing workshop attendance ~2.2%<br />Attend all 5 writing workshops.<br /><br />Homework ~7.8%<br />They're related to the essay. You write parts of the essay each time. The last one is the draft of the final essay. But you only have a week to do them. Luckily you just have to make a 'meaningful submission' and you will get full marks. Remember to submit the draft essay or else you will lose marks for the final essay.<br /><br />Quiz 20%<br />1 hour quiz based on all lecture content and the required reading content included in the PowerPoint. Just study everything on the PowerPoint. You can change your answer anytime and it's open book (unlike Mech 1905)<br />MC, True/False, 2 short questions.<br /><br />3 Canvas Discussions 10%<br />2 weeks time to discuss a topic with your classmates in your tutorial group. Remember to back up your stance with examples and interact with others. Also post over the two weeks because they want 'regular and frequent contributions and productive exchange of ideas'. <br /><br />They give you plenty of opportunities to get marks. Ultimately it all comes down to the final essay.",
            "comment_workload": "You have to do assignments frequently, but they're mostly spread out, except the writing workshop homework and the essay. To their credit, they acknowledge 'meaningful contributions' to your homework as full marks. But you really have to spend time researching and revising your essay if you want a good grade.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "UxZUY3XUCN2MH115aCiZHUPX2liWlger",
                    "name": "HUMA1000F Essay Prompts (Spring 2022)",
                    "format": "docx"
                }
            ]
        },
        {
            "hash": "ABfk9lKsIX1ND8B8DudnPocMHuud1Pih",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 328,
                    "name": "WU, Shengqing",
                    "rating": 1
                },
                {
                    "id": 1147,
                    "name": "LAW, Chun Yin",
                    "rating": 1
                },
                {
                    "id": 458,
                    "name": "LI, Po Lung",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wkwkwkkwkw",
            "date": "Jun 08, 2022",
            "title": "Great course!",
            "comment_content": "The course description:<br /><br />This course will explore three core concepts of individualism, family values, and social responsibilities, including the individual self's emotional well-being, ethical and socially responsible citizenship, and the possibility of a fulfilled life. Centering around the self's relationship with family and the society, the course will address the following issues as reflected in a range of readings of Western and Chinese writings, literature, film and cultural texts: conceptions of the self; universal and culturally particular aspects of ethics and human nature; different conceptions of individual emotions (romantic love in particular); as well as the appreciation of beauty and art. Students will be introduced to key concepts concerning individual morality, feelings and social responsibilities, and to the ways in which nationality, family, the society, and other affiliations have been constructed in modern narratives of identity and selfhood. This introductory humanities course aims to develop students' critical thinking and writing skills, while cultivating their moral sensibilities and abilities to become well-rounded individuals.<br /><br />Week 1: Introduction<br />Week 2: The Moral Instinct<br />Week 3: Destructive Emotions<br />Week 4: Technology<br />Week 5: Romantic Love 1<br />Week 6: Romantic Love 2<br />Week 7: Beauty<br />Week 8: Concept of Nature<br />Week 9: Cosmopolitanism <br />Week 10: Utopia<br /><br />This course is definitely the most enjoyable one for me so far in HKUST. The topics taught are very interesting, I never once felt bored whenever I attended the 2 hour lectures.",
            "comment_teaching": "Professor Wu is a great professor. She motivates students to speak up and talk about their respective views regarding the topic being taught. This is the first course I've seen where the students willingly unmuted themselves and talked about their opinions. The concepts taught in this course is quite complex but she was able to explain it in a way that allowed us to understand it.<br /><br />My workshop instructor was Dr. Polung Li. He is a very friendly guy and did very well in teaching us the essay writing techniques. He provides very good feedback and is very approachable.",
            "comment_grading": "10% Online Activities (quizzes to be completed before writing workshops)<br />10% Writing Workshops (2.2% Attendance and 7.8% Homework)<br />10% Canvas Discussion <br />20% Final Quiz<br />50% Final Essay<br /><br />Online Activities:<br />You'll have to watch the videos uploaded on Canvas regarding essay writing techniques and do the online quizzes afterwards. Definitely do not skip these quizzes as they are free marks. Unlimited attempts.<br /><br />Writing Workshops:<br />Basically a tutorial session. Your instructor will teach you essay writing techniques and assign you homework afterwards. You'll be required to write bits and pieces of your final essay as homework. Week 1 HW: Write thesis statement for your essay, Week 2: Write introductory paragraph, Week 3: Body paragraph, Week 4: Essay draft.<br /><br />Canvas Discussions:<br />There will be three of these discussions. First discussion will be about technology, second will be about love and final one will be environment related if I'm not mistaken. You are required to contribute and discuss with your classmates regularly for two weeks. Frequent contribution will give you good marks so don't think that you could just spam your arguments a day before the submission date.<br /><br />Final Essay:<br />Definitely the hardest part of this course. DON'T procrastinate like I did. The essay prompts for this course were definitely difficult in my opinion which is why you should start as early as possible.<br /><br />My stats:<br />Online activities: Full<br />Workshop: Full<br />Canvas Discussion: Not released<br />Final quiz: 18/20<br />Final essay: Not released<br /><br />Final grade: A",
            "comment_workload": "Quite heavy. <br /><br />The writing workshops definitely made the workload lighter as they kinda force you to start your essay as early as possible. But you'll still need to spend a lot of time studying for the final quiz, completing the homework and participating in the canvas discussion. Definitely not an easy credits course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7WSYnDeBMk5HpKJgzIPzAdPUQ6sTkgTy",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 328,
                    "name": "WU, Shengqing",
                    "rating": 1
                },
                {
                    "id": 411,
                    "name": "MEGAN, Melissa Jane",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tys",
            "date": "Aug 21, 2022",
            "title": "",
            "comment_content": "- The Moral Instinct<br />- Destructive Emotions<br />- Technology<br />- Romantic Love <br />- Beauty<br />- Concept of Nature<br />- Cosmopolitanism<br />- Utopia",
            "comment_teaching": "It's obvious that Professor Wu knows and cares a lot about the subject matter, so her teaching is enthusiastic. she elaborates more than what is on the slides, so i would recommend attending the lectures if the topic genuinely interests you. she spends some time (around 10-15 mins) letting students share their opinions/questions and also gives meaningful answers to them.<br /><br />The writing workshops were incredibly helpful for clearing up any confusion and knowing more about how to structure the essay + developing your own ideas. Each workshop includes time to discuss with your classmates and also the language instructor, who gave us constructive guidance and was quick with grading and commenting on our assignments.",
            "comment_grading": "Good grading, it should be alright as long as you complete all the assigned work and show effort<br /><br />canvas discussion (10%): based on participation in the discussion, post your own thoughts and reply to others<br /><br />writing workshop online activities (10%): attendance of workshop, submitting assignments on time<br /><br />writing workshop classroom activities (10%): view online content and complete all quizzes on canvas before deadline<br /><br />final quiz (20%, all MC): all questions are on content that has been covered in the ppt/required readings<br /><br />final essay (50%): final essay on 1 out of 3 essay prompts, chosen by the student. the essay prompts are given at the beginning of the semester so there's enough time to polish the essay",
            "comment_workload": "Alright workload<br />- required reading for each new topic<br />- 3 topics for canvas discussion board posting that each last 2 weeks<br />- biweekly writing workshop assignment (may be a bit tedious at first but helps you build up and develop your essay so it's easier to finish your final essay)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ax2DFxpN0zThA6tu3prxBotFvooZc45Z",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 328,
                    "name": "WU, Shengqing",
                    "rating": 1
                },
                {
                    "id": 1147,
                    "name": "LAW, Chun Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "沐青",
            "date": "Jun 11, 2022",
            "title": "",
            "comment_content": "The three main topics are technology, love, and beauty. And also talk about nature, cosmopolitanism, and Utopia.<br />Week 1: Introduction<br />Week 2: Self and Morality<br />Week 3: Self and Emotions<br />Week 4: Self and Technology<br />Week 5: Self, Love, and Responsibilities<br />Week 6: Self, Love, and Responsibilities<br />Week 7: Self and Appreciation of Beauty<br />Week 8: Self, Nature, and Animals<br />Week 9: Self, Nation, and the world<br />Week 10: Self, Hope, and a Better World<br />The writing workshops will teach you how to write a convincing essay, such as how to write your thesis statement and how to write argument and rebuttal.",
            "comment_teaching": "In the lecture, the professor explains abstract concepts first and then gives polling questions or discussing questions for us to share our thoughts with the class. If you follow the lecture, it isn't tough to understand those concepts.<br />In the writing workshops, the instructor will give feedback on your homework assignment and you will be sent into breakout room to exchange peer feedback.",
            "comment_grading": "Final quiz: 20%<br />Canvas online discussions: 10%<br />Writing workshops (Online activities): 10%<br />Writing workshops (Classroom sessions): 10% (Attendance ~2.2%; Homework assignments ~7.8%)<br />Final Essay: 50%",
            "comment_workload": "The overall workload is acceptable.<br />Every week will have one required reading material corresponding to the topic in the lecture. Every week will also have supplementary reading material or a movie. It is OK to finish the required reading before every week's lesson. And the final quiz is mainly based on these required readings except for specific supplementary reading mentioned in the class.<br />Sometimes may need to post your reply on the online discussion board before the deadline.<br />The writing workshops are once every two weeks. Need to watch some videos and take short quizzes before each workshop and finish homework assignments after each workshop.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "v6PueB1lOnMRDhPFFRn03JTx1LmhvLa8",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 328,
                    "name": "WU, Shengqing",
                    "rating": 1
                },
                {
                    "id": 458,
                    "name": "LI, Po Lung",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "An225 Mriya",
            "date": "Jun 09, 2022",
            "title": "",
            "comment_content": "As an HUMA SSC course, HUMA1000F included a variety of philosophical topics, which are listed below. Each topic involved a reading material that have variable length:<br /><br />Week 1: Introduction<br />Week 2: Morality<br />Week 3: Emotions<br />Week 4: Technology<br />Week 5: Romantic Love 1<br />Week 6: Romantic Love 2<br />Week 7: Beauty<br />Week 8: Concept of Nature<br />Week 9: Cosmopolitanism<br />Week 10: Utopia<br /><br />Unlike previous HUMA or SOSC common core courses, there are no default main theme for the content of HUMA1000F. As a comparison of what I've taken before, the concept of democracy evolved throughout history was taught in SOSC1700, or the different aspects of Chinese culture through an anthropological aspect as mentioned in HUMA2632. <br /><br />As you generally only need to cite 2 to 3 reading materials in order to finish your essay, thanks to the course's fragmented contents, skipping lectures is possible without causing further confusions as long as you can review everything before the lecture quiz.",
            "comment_teaching": "While I'm not sure whether this is the style of the typical HUMA lecturers, but during teaching, Professor Wu may flood a lot of information that may or may not directly related to the topic taught, and the points shown on Powerpoint were only briefly mentioned. This means if you didn't pay sufficient attention, you could easily find yourself stranded at the middle of confusion, a situation somehow similar to Professor Cheung in last year's HUMA2632.<br /><br />That said, I did enjoy her lecture's open discussion near the end of the lectures, usually asking us opinions about extended questions relating to that day's topic. Answering these questions brought you some bonus points. If you have burning opinions, do try to raise your hand and answer the questions.<br /><br />My TA is Dr. Polung Li, who was friendly and willing to answer his student's confusion on time. Even though his job was to remind and review the methods and formats of academic essays, he did make his class interactive and joyful. In fact if he was responsible for LANG1002/1003, their reviews would have been much better than what they're.",
            "comment_grading": "Online activities:10% <br />Writing workshops:10% <br />&nbsp;&nbsp;&nbsp;&nbsp;Attendance: 2.2% <br />&nbsp;&nbsp;&nbsp;&nbsp;Post-workshop assignments: 7.8% <br />Canvas discussion: 10% (Never released)<br />Final quiz: 20% (17.5/20, Mean 14.44/20)<br />Final essay: 50% (Never released but should be sufficiently good)<br />*Extra 2 points for lecture participation<br /><br />The online activities only counted completion, so it was entirely possible for you to grab these free grades even if you got 0 marks for all online activities.<br /><br />For the final quiz, straightforward MC and T/F questions were the mainstay. The remaining 2 questions were equally straightforward short answer questions. The time limit is 1 hour, and it's open book. Efficient location of course contents in lecture notes should help you a lot during the final quiz. Thanks to such difficulty, the mean is rather high.<br /><br />Speaking of the big essay, there were 3 essay prompts relating to the morality of technology, conflict of individual and collective concerns and universality of beauty. The word limit was 900 to 1100 words. My advice is that you may want to choose a topic that you're most familiar with and allows you to maximize the scope of citations. Early drafting may help, but I actually only used 1 week to formulate all 3 points in my essay.<br /><br />At the end I get an A for this course, which seems fair to my effort. Such grading is also on par with the grading of other common core courses.",
            "comment_workload": "Technically it's possible to attend lectures without reading your reading materials, but you may have significant issues in understanding lecture contents. Reading them at the last minute may not help much, as useful contents are generally buried in less important paragraphs.<br /><br />Compulsory writing workshops that lasted for 1 hour were held on a bi-weekly basis, in which the TA will review the methods and formats of academic essays to us. It was basically a reincarceration of LANG1002 in terms of its content. Before the writing workshops, there were online activities that required us to watch videos and answer MC questions. They were generally simple, and can be done even without watching the videos. The post-workshop assignments required us to write short paragraphs for your future essay, and was also graded pass/fail. Your TA would give feedback about your submissions.<br /><br />There were also 3 Canvas discussions that (each) lasted for 2 weeks related to lecture contents. You were required to make continuous inputs into the discussion board, so deadline fighters would have a bad time. That said, you don't need to make daily comments. Spreading your inputs throughout the 2 weeks should be OK to the instructors.<br /><br />As a result, the workload mainly came from drafting your essay during the study break and preparing for the final quiz. When compared to other engineering courses that includes nearly weekly assignments, I think this course's workload is rather low.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "X1Mx1MtDaNKLyPg5z7MIrcnH9WBaTwE7",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 328,
                    "name": "WU, Shengqing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Samanctcha",
            "date": "Nov 30, 2020",
            "title": "Quite easy and good grade course",
            "comment_content": "Honestly, I never attend any lecture so I will base on the essay question and its powerpoint to rate this. The syllabus can be divided to mainly three part, one is technology, one is love, and one is beauty. For the essay question, I think technology that one would be the easiest.",
            "comment_teaching": "Can’t rate because I skipped all the lectures. But the tutorial is quite good and I suggest all to attend. As the tutor will read your work and tell you what to improve.",
            "comment_grading": "It graded base on a final quiz and a final essay. The course suggest student at least got straight level 4 in hkdse or unless have finished that 2 year1 lang courses to take this course. And I wasn’t fulfilling both when I take this course. And got a B. The mean is B or B-. I think is a quite good grade course.",
            "comment_workload": "Every two week need to submit a progress of your final essay. It might seems a lot of work but actually it has made writing the final essay much more easier. That’s why I think the workload is fair.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eMIgaShI383irb1KkJm5xsz48gBQ5Pw3",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 328,
                    "name": "WU, Shengqing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bonbonchocolat",
            "date": "Dec 07, 2022",
            "title": "",
            "comment_content": "Can only attend the tutorial sessions. Lectures are not really useful as it will only appear in the final quiz. Need to at least read all the reading materials and lecture slides in oder to get a pass for the quiz.",
            "comment_teaching": "Didn't attend lectures. But the tutorial session is useful. The TA teaches many skills to improve language and organisation.",
            "comment_grading": "The grading is fair. Attend all the tutorials and hand in your homework on time. The mean of the quiz is not that high. Just read through all the materials including the additional reading materials.",
            "comment_workload": "Workload is not that heavy when compared to LANG courses. It only requires writing some short paragraphs for brainstorming and some content rewriting every 2 weeks.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5KjCsKepZNy0joVVCWIUOAZzKzMiTCpW",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 328,
                    "name": "WU, Shengqing",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tungcc",
            "date": "Sep 10, 2020",
            "title": "普普通通的course",
            "comment_content": "新開嘅course。用spring sem reg科嘅情況講，1000A最多人reg，1000F最少人reg。個人覺得唔算太差。<br />每個禮拜唔同topic，主要關於個人、家庭、社會。有lectures、tutorial（只係要上4-5次）。最後要交一篇文同做一個quiz，平時就要online discussion. content大致上同其他1000course一樣",
            "comment_teaching": "umm其實幾悶，加上佢啲大陸口音好難聽，講下err下咁。至於個TA⋯⋯最深刻印象係有次有人喺zoom chatroom叫人投校董代表，個TA話don’t promote this here（類似嘅嘢），個人認為佢幾愛國",
            "comment_grading": "有啲嚴格。認真做essay+online discussion都得B-，個mean around B/B+",
            "comment_workload": "唔算大workload，每次上tutorial之前要做canvas quiz，不過unlimited attempt+submit完記低答案再submit都得。一定要做完先可以上tutorial。<br />online sem比起f2f一定會少workload，因為tutorial唔使個個禮拜上，而喺嗰兩個鐘裡面只係需要attend20-30mins",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}