{
    "error": false,
    "course": {
        "id": 2283,
        "subject": "HUMA",
        "code": "1000B",
        "name": "Cultures and Values: Righteousness, Destiny and Well-being",
        "description": "Lectures and readings will be mainly built upon selected texts of Chinese classics. Through studying the texts, students will reflect and explore the deep meanings and relationship between the concepts of righteousness, destiny and well-being, which demonstrates the dialectical characteristic of philosophy of life in both Classical Confucianism and Classical Daoism.",
        "categories": [
            "Common Core (SSC-H)",
            "Common Core (H)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.23,
        "rating_teaching": 4.3,
        "rating_grading": 4.47,
        "rating_workload": 3.94,
        "review_count": 77,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 765,
                "name": "NAM, Sai Lok",
                "count": 70
            },
            {
                "id": 327,
                "name": "TSANG, Perseus",
                "count": 24
            },
            {
                "id": 302,
                "name": "HO, Susanna Pui San",
                "count": 4
            },
            {
                "id": 1231,
                "name": "SAMPSON, Nicholas",
                "count": 4
            },
            {
                "id": 1303,
                "name": "CHAN, Thomas Anthony Chun Hun",
                "count": 3
            },
            {
                "id": 293,
                "name": "FREEMAN, Danyal Jonathan",
                "count": 2
            },
            {
                "id": 1049,
                "name": "CHEUNG, Colin",
                "count": 2
            },
            {
                "id": 424,
                "name": "YU, Anna Po Shan",
                "count": 1
            },
            {
                "id": 876,
                "name": "SIU, Chi Ming Anthony",
                "count": 1
            },
            {
                "id": 1123,
                "name": "WONG, Ka Sin",
                "count": 1
            },
            {
                "id": 1417,
                "name": "CHEUNG, Anisa",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "sw8lVtAC9SDyUOm3tH52xPhj6UEIh7Zk",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 1049,
                    "name": "CHEUNG, Colin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Smashgod",
            "date": "Dec 15, 2021",
            "title": "This is a course worth taking even if it's compulsory! (experience from an Year 1 student)",
            "comment_content": "Since this is a SSC common core, you may have to take it even if you are not interested. However, I chose HUMA1000B over the other HUMA courses since these topics appeal the most to me. They are pretty interesting and are good discussion material. We usually predict how a certain philosopher will answer the 'trolley problem' and other similar questions. It is a nice choice if you like discussing, debating, and persuading people (no debate involved so don't worry) <br /><br />Topics:<br />1: Introduction: General overview of the course and topics to be covered, with brief mention of the assessments and expectations.<br />2a: Moral Conflict in Western Ethics I: Principle of Utility in Utilitarianism<br />2b: Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />2c: Moral Conflict in Chinese Philosophy I: Moral Feeling in Confucianism<br />2d: Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />3: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />4a: Destiny I: The Concept of Tian and Ming<br />4b: Destiny II: The Distinction between Righteousness and Destiny in the Mencius<br />5: Well-being: Self-establishment and Detachment in the Zhuangzi<br /><br />The tutorials (called writing workshops for HUMA1000B) are for preparing students for the final essay we have to write in HUMA1000B. We learn by analyzing examples and discussing them, as well as identifying crucial items of an argumentative essay.<br /><br />The course is mostly taken by Year 3-4s because of the course registration sequence. I was extremely fortunate to be in the course in Year 1. I was alone but it didn't matter too much for this course. However, you really should find some partners (especially your tutorial groupmates) for the open-discussion quizzes.",
            "comment_teaching": "Dr. Nam is a friendly and humorous local professor. He encourages interaction by asking some open-ended questions for students to think about in lectures and also uses the iPRS function to carry out in-class polls to see what decision we will make under some theoretical situations (not graded; just for fun). <br />We had 1 lecture on Wednesdays from 11:00-12:50. He starts at 11:05 to give students enough time to get to lecture theater A and also gives a 5-min toilet break midway.<br />Before we submit our final essay, he gave all students a 15-minute individual consultation session to see what suggestions he can give to our essay writing. He is very dedicated and is one of the markers of all the essays, the other being our respective tutorial instructors.<br />Lessons are completely optional apart from the first one. Zoom meetings and recordings can be accessed freely. Dr. Nam claims that Karma exists if you don't attend in person though (lol)<br />I had no problem understanding Dr. Nam's English, but if you are a non-local student, be prepared for some heavy local accent. He may occasionally read some words wrongly.<br /><br />We have a tutorial (called a writing workshop) biweekly and my instructor was Mr. Colin Cheung. Colin speaks native English (I think). He does not teach exceptionally well but is satisfactory for what we have to learn in the workshops. In short, average.",
            "comment_grading": "Claimed to be a 'leng grade' course (easy to get a decent grade) and I think it is. It is easy to get a decent score as long as you complete and submit everything on time and attend all writing workshops. The two quizzes are open-book and open-discussion for my semester so you should find partners to take the quiz with you. The key to online discussions is submitting asap, writing seriously, and replying seriously. There is no final exam so be serious about the final essay. I got an A- at last. We don't know the score of our final essay.<br /><br />Assessment:<br />1: Two quizzes (20%)<br />Multiple choice questions<br />Mean for 1st quiz: 13.82/20<br />Mean for 2nd quiz: 17.52/20<br />I got 14/20 in the first quiz and 19/20 in the second one. The first quiz was exceptionally tricky.<br /><br />2: Canvas online discussions (10%)<br />Ø&nbsp;&nbsp;Peer exchange forum on questions posted by the faculty regarding the weekly readings and lectures; <br />Ø&nbsp;&nbsp;Three deadlines over the process of the discussion; topics given by each would be closed afterwards – see “Rubric for Canvas Peer Exchanges” for details. <br /><br />3(a)<br />Writing workshops: Online activities (10%)<br /> Viewing online content and completion of all tasks embedded in the online content.<br /><br />3(b)<br />Writing workshop: Classroom sessions (10%)<br />Ø&nbsp;&nbsp;Attendance: Attending all five writing workshops on time. Any absence will be penalized if without justifiable proof(s).<br />Punctuality: You will be marked absent if late for more than 15 minutes. <br />Ø&nbsp;&nbsp;Complete all Homework on Canvas including draft essay<br /><br />4<br />Final essay (including revision efforts) (50%)<br />Ø&nbsp;&nbsp;Write a persuasive essay of 1000 words;<br />Ø&nbsp;&nbsp;Which is revised at least once; <br />Ø&nbsp;&nbsp;Show evidence of response to feedback on your first draft.",
            "comment_workload": "Pretty light and satisfactory. There is usually one week for you to finish an assignment for the previous writing workshop and another week for you to watch videos and take simple quizzes (unlimited attempts and probably not graded) to do pre-study for the next workshop (compulsory but biweekly). There are 3 online discussions in total and we have sufficient time to do them. There really isn't any homework given in lectures.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "E0ARbDHzObyqaxMjCtgyDVyKxMbTXJx9",
                    "name": "Grade scheme for Canvas discussion (2021-2022)",
                    "format": "docx"
                },
                {
                    "key": "YoDCjLc4LOMqZyiiTU5f2plXVdTps6gl",
                    "name": "Grade Scheme for Essays (2021-22)",
                    "format": "pdf"
                },
                {
                    "key": "kSEsGul6S4umNDrzKdIBvX0Mmn4qVuZk",
                    "name": "HUMA1000B Fall 2021-22 Syllabus",
                    "format": "docx"
                }
            ]
        },
        {
            "hash": "vpmLqvn7oE1axb5nyMUVkLS8sdAYg47S",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 1303,
                    "name": "CHAN, Thomas Anthony Chun Hun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "holam",
            "date": "Jan 04, 2021",
            "title": "HUMA 1000B",
            "comment_content": "Totally rubbish and meaningless, I learn nothing from this course<br /><br />Friends are very important in this course.<br />1. Friends can give answers for the weekly quiz<br />2. Friends can share the canvas discussion from other tutorial sessions<br />3. It is absolute grading, so don't worry your clever friends will make the curve higher!",
            "comment_teaching": "I skipped all lecture and appear in tutorial only.<br />I have never read any ppt/watch any video, except for the concept (utiliaraisim) i used in the essay",
            "comment_grading": "Absolute grading<br />&gt;95 --&gt; A+<br />&gt;90 --&gt; A<br />&gt;85 --&gt; A- and so far so forth<br /><br />Weekly Quizzes: 13.2/14<br />There are 7 weekly quiz in total, 5 MC questions each. Everyone has the exactly same questions. So simply ask your trustable friends for answer. Done in 1 min. <br /><br />Note: The quiz become unavailable after the submission, as I predict that those questions are going to be reused next semester. If you know who I am, pm me for those questions and answers.<br /><br />Weekly Activities: 7/7<br />There are 7 weekly activities. Each one has 4 questions. It only counts your submission. Type 'yes' and then it is finished. Whole processes spent you 1 min.<br /><br />Canvas Discussions: 10/10<br />3 Canvas discussion in total. Each tutorial session forms a discussion group. You need to type initial response with &gt; 500 words and reply others with each &gt; 200 words<br /><br />Tip 1: Make your post early, and try to reply every day, as one of the criteria is continuous participation <br />2. your friends are important: you can rewrite the posts from other tutorial sessions. Make sure your wordings are all changed so that turnitin cannot identify. But you can copy the idea!<br />3. Do you think the tutors can go through all 3 discussions, each with 400 people? Definitely they will not. So, Quantity is much more important than quality. I got 10/10 even if some of the points are rubbish<br /><br />Online Workshop Activities: 10/10<br />There are canvas quiz about the essay. Please complete it at the first day of semester, as there are unlimited attempt. Just trial and error. Whole 10% can be finished in 30 minutes. Then you no need to worry about the deadline.<br /><br />Classroom Workshop Activities: 10/10<br />Submit all the writing tasks on time. They are due one week after your tutorial session.<br /><br />Essay: 42.708/50 (82/96)<br />Please appear in all the bi-weekly tutorial sessions. It is just 10-min Q&amp;A. It is very important to know what your tutor wants and fits their ideas. The tutor is marker of your essay. Also, I know the lecturer also read and grade all 400 essays. So please make the appointment with him.<br /><br />Total: 92.908/100 <br />Final letter grade: A",
            "comment_workload": "Very light",
            "rating_content": 1,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 13,
            "vote_count": 21,
            "voted": false,
            "is_upvote": false,
            "comment_count": 9,
            "attachments": []
        },
        {
            "hash": "zDKuMwJehdSxo8bjrcZJ8kzu9xP8FJgT",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                },
                {
                    "id": 293,
                    "name": "FREEMAN, Danyal Jonathan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tschanag",
            "date": "Dec 22, 2020",
            "title": "",
            "comment_content": "Same content for years<br />Not gonna repeat",
            "comment_teaching": "Dr. Nam tried very hard to make the class engaging. Didnt attend any lectures though. But I did skim through lecture videos before in-class quizzes.",
            "comment_grading": "Very Generous Grading<br />Above ~1sd in both quizes<br />Never missed discussion but missed several online quizzes<br />Be mindful of deadline on Canvas then you should be fine<br /><br />I followed what Danyal suggested in tutor but he gave a C+ for essay. Dr. Nam saved my grade as he gave me an A. And he had the final say on the final grade.<br /><br />If you would like a good grade while being beginner to philosophy like me. Always go for Dr. Nam's class.",
            "comment_workload": "Rather light if you don't hate writing as much as I do<br /><br />Weekly online quizzes on Canvas<br />Weekly discussion board<br />Two in-class quizzes<br />One essay<br /><br />And that's all",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "O3fBgL0BJvec8L2wzs3Y1GdZhe5vy7NF",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jimmy Ki",
            "date": "Jun 07, 2019",
            "title": "You can still get A range even skip ALL classes PHYSICALLY",
            "comment_content": "Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian (天) and Ming (命)<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi<br />(But some of the content will not be covered in the quiz)",
            "comment_teaching": "The lecture is somehow boring and tutorial is somehow useless. <br />Why I skip ALL classes but I still know the teaching in class is boring? It is because I watch all the lecture videos by myself lol.<br />But I recommend you to find the tutor more as he/she will help you a lot to finish your final essay.<br />Moreover, I have attained the extra lessons once, and I found it useless...So, if you are interested to see how useless it is to help you understand the course materials, then you can go for that, lol.",
            "comment_grading": "THREE ONLINE DISCUSSION 10% each<br />WRITING WORKSHOP (ONLINE + CLASSROOM) 20%<br />FINAL ESSAY 50%<br /><br />My Grade: <br />*Quiz (20%) : 19.5/20 (14/16 &amp; 12/16, so finally 26/27)<br />Classroom (10%) : 10/10<br />Online Quiz (10%) : 10/10<br />Essay: 43.75/50 (need to send email to ask)<br />Discussion: 10/10 (need to send email to ask)<br /><br />Final Grade: A (For me, it is an extremely good grade, because I have skipped ALL classes!)<br />(My final grade is 93.25/100 while Cut-off for A+ this semester is 96.5/100)<br /><br />*Quiz only count for 27 marks out of total 32, so if you score 27 marks in total for the 2 quizzes, you already get 20%.",
            "comment_workload": "Huge during the semester only.<br />Need to attend 5 writing workshops, do a lot of quizzes before the workshops<br />Participate in 3 discussions (write at least 500 words for each discussion to aim for full mark for this part, but some of your crazy classmates will write for ~1000 words! Personally, I really want to know their grades...I don't think writing that much in a simple discussion is good, but just increasing burdens or other ppl...= =) <br />Write a 1000-word essay as final, as no final and midterm exams during the course but only 2 quizzes, which are not very easy!<br />I recommend you put more effort into the first quiz since the second one is very difficult!",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yGvcdcSeixDEGMY8b33fDWbilxKBsI9N",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "soy",
            "date": "Jan 23, 2020",
            "title": "香港人geh感受",
            "comment_content": "HUMA course裡面我覺得算有趣，學下d唔同人geh思考方式去解決一個問題，例如<br />兩條鐵軌geh矛盾問題，你應該救多數人定正確geh人？<br /><br />後面教下中國學說geh基本理論，例如孝呀 人性本善 呢d耳熟能長geh 比較易學",
            "comment_teaching": "藍世樂<br />我覺得第二三個最好geh professor，用心答問題，從不求奇，只要勇敢問！<br />上堂教得清楚有自信，令你信服同記得內容（有上堂會好易記得佢講邊d係重點），最好問下以前有讀geh人考咩，因為都係考番個d。<br /><br />例如trolly problem 係想說明邊個理論<br />例如記得係 The **2nd** statement of C.I.: 記一記某d用字<br />“Act so that you treat humanity, whether in your own person or in that of another, always as an end and never as a means only. ”<br />記下1st statement",
            "comment_grading": "B-<br />SSC一定要讀黎講算係咁啦",
            "comment_workload": "最煩係要上tutorial同約時間傾essay<br />essay is the &quot;difficult-to-get-high-marks&quot; part<br /><br />考試易d 唯有努力d",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KLpyWR2TXWWO8uVC3v80sqmFZqriz61j",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Smelt123",
            "date": "Mar 22, 2019",
            "title": "Pretty chill course if you follow the deadlines tightly.",
            "comment_content": "First 4 chapters covers&nbsp;&nbsp;briefly the 4 moral views, which includes Utilitarianism, Kantianism, Confucianism and Mohism.<br />The latter half of the semester focuses on more abstract stuff, such as Righteousness, Destiny, Concept of Tian and Ming, Self-establishment, Detachment among other things.<br />I would argue that contents covered in the first half of the semester is more important than the second half by virtue of the fact that you need to use the moral views in both your final essays and discussion posts.<br />The second half is more confusing in my opinion as it deals with very vague concepts, all which are alien to my primitive mind.",
            "comment_teaching": "Dr. Nam's casual teaching does put the students at ease during his class, and even attempted to crack a few jokes (though most fall flat).<br />He does put me to sleep in his lecture, not from the content, but from his somewhat calm demeanor. You can always rewatch the lecture video if required.<br />He does cover each topic well enough for us the grasp the basic concept, but I did need additional materials online to fully understand the topic.",
            "comment_grading": "Basically, most of your scores comes from the essay, whose criteria for a good mark is listed on Canvas. You do need some level of mastery over the English Language for a satisfactory marks though.<br />There is 3 discussion posts which relates to the topic covered. It isn't too hard, but you will have tryhards flexing their vocabularies here. Pay no heed and just write your part.<br />The rest of the marks comes from attendance during tutorial sessions which require little effort, and from pre-tutorial videos, which again, isn't demanding.",
            "comment_workload": "Workload is less than I thought.<br />There is an essay with around 1000 words, but you have the whole semester to write it.<br />3 discussion topic on Canvas requires some thoughts and works to put into it, but it isn't a monumental task to complete.<br />There are some lecture videos to watch before tutorial classes, but those are a breeze to go through.<br />Best part is easily the quiz, where you do not have to score full marks for a perfect score (scoring 27/32 would net you the full percent).<br />All in all, pretty manageable.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qnKTGZlryntIpWMjNCfsrqgDzocKSzlZ",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CyrusL",
            "date": "Aug 04, 2018",
            "title": "",
            "comment_content": "Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian (天) and Ming (命)<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi<br /><br />Pretty self-explanatory, the course covers the basics of both Western moral ethics and Chinese philosophy. I found the content quite interesting: it made me reflect on my personal life and changed how I judge other people. If you are not interested in moral philosophy, however, then you should take one of the other sub-courses of HUMA 1000.",
            "comment_teaching": "Dr. Nam always manages to keep the mood up during his lectures, engaging the students with various classroom activities (including iPRS, no attendance though). He does not rely too much on the PowerPoint, so it is recommended that you attend the lectures to get a better picture of what is being taught: the lecture materials on Canvas are very brief and insufficient by themselves.<br /><br />Reading materials are optional but helpful in achieving A-range in quizzes.<br /><br />Dr. Tsang actively engages the students in the writing workshops and is more than happy to answer any of our questions. His feedback on our essays is valuable and helped us improve them considerably.",
            "comment_grading": "ONLINE DISCUSSION 10%<br />3 discussion topics were given sequentially over the semester, we had to put forward our opinions and actively contribute to the discussion using Canvas. The number of discussion topics has decreased over the years, so in the future, there may only be 2 discussion topics, who knows?<br /><br />WRITING WORKSHOP (ONLINE + CLASSROOM) 20%<br />The writing workshop is designed to help you complete your essay. There are 5 workshops in total, each with an online and a classroom component. The online section comprises of short videos and quizzes on Canvas. The classroom section essentially recaps the online content, with the opportunity to receive feedback from the instructor and critique other students' essay-in-progress. The online mark can be earned by completing quizzes and submitting assignments on-time, while the classroom mark is earned simply by attending the workshop (held every two weeks).<br /><br />ESSAY 50%<br />3 essay prompts (topics) will be released at the start of the semester. Choose 1 and write approximately 1,000 words. If you complete all of the writing workshop assignments on-time, the workload will be spread more evenly across the semester, as these assignments are basically part of your essay. One of the four marking criteria for the essay is how well you respond to the feedback from the writing workshop instructor. If you do this properly (which is relatively easy), 12.5% of the course grade will be yours.<br /><br />QUIZZES 20%<br />2 multiple-choice quizzes: the first one covers Module 2a, 2b and 2c, while the second one covers Module 2d, 4a, 4b and 5a. This semester, a different system was used: each quiz had 16 questions, with a correct answer yielding 0.75%, meaning that we only had to answer 27 questions correctly out of 32 to get the full 20%.<br /><br />MY GRADE<br />Online Discussion | Unknown<br />Workshop | Full marks<br />Essay | Unknown<br />Quizzes | 19.5/20 (Mean: 17.8)<br />Grade | A-<br /><br />Grading was rather opaque, with over 50% of the course grade being unknown.",
            "comment_workload": "If your English proficiency is mediocre (HKDSE: any sub-score &lt; 4; IELTS: any sub-score &lt; 6; ELPA: level &lt; 4), you should refrain from taking this course until you have passed LANG 1002 and 1003 with at least a C-range grade, otherwise the essay will weigh on you heavily.<br /><br />Contrary to what the grading suggests, the 1,000-word essay is not the major workload source; rather, it is the online discussion that will take the most time to complete. For each discussion topic, you are expected to post an initial comment regarding your stance (~300 words), and respond to other people (~100 words each). If you're aiming for A-range, you'll end up writing around 1,000 words. For most people, this is simply not worth the effort, so they only write around 600 words.<br /><br />As for the writing workshop, each online section takes 30-60 minutes to complete, while the assignments gradually increase in time spent from 15 minutes to multiple hours; recall that they can be incorporated into your essay, however.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CUMpmrLY0rZA2ZHqsrJJhUaOkrAuWzR7",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kykyw",
            "date": "Jun 10, 2023",
            "title": "",
            "comment_content": "第一次小測：功利主義、康德、儒家、墨家<br />第二次小測：孟子、莊子、列子等對天命嘅睇法<br /><br />溫第一次小測嘅時候都尚算聽得明<br />但係溫第二次小測嘅時候，真係有種唔知睇咗啲咩嘅感覺",
            "comment_teaching": "佢好嘅地方就係在於佢會開一個專門講廣東話或者普通話嘅網上補課<br />我無上佢嘅lecture <br />我淨係上嗰個網上補課<br />始終係母語會容易啲吸收<br />但係要留意嘅係佢quiz嘅內容係考lecture嘅例子",
            "comment_grading": "My grade: A<br /><br />1 Quiz x2 (20%)<br />Quiz 1: 13/16<br />Quiz 2: 14/16<br />兩次都係mean<br />我見到有好多人都有past paper<br />所以好容易俾人屈grade<br /><br />2 canvas online discussion x 3 (10%)<br />因為內容唔可以重複<br />再加上我冇咩創意<br />所以最好做第一個答<br />另一個好處就係你set咗個標準<br />之後啲人答都係跟返你呢個長度<br />我自己都係寫大概二百幾字左右<br />然之後再加埋reference <br /><br />3 writing workshops online activities (10%)<br />係上workshop之前係canvas做到滿分就得<br />佢可以無限次作答<br />基本上人人都滿分<br /><br />4 writing workshop classroom session (10%)<br />基本上準時同埋有去就會滿分<br />都係一樣基本上人人都滿分<br /><br /><br />5 Final essay (50%)<br />我睇返之前幾個sem 啲題目好似易啲<br />今個sem 啲題目好似難少少咁<br />所以我做嘅時候寫來寫去都好似覺得唔啱咁<br />仲有就係呢個course嘅essay同一般嘅並唔一樣<br />我幾次都俾我嗰個instructor 話points同thesis 之間聯繫唔大<br />我覺得呢個係呢一篇essay比較上麻煩嘅地方",
            "comment_workload": "除咗quiz 之外，基本上可以話係0",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4G9aqoXTNTXICHAXhV8Egw2B8gOz752D",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "satsumaa",
            "date": "May 27, 2023",
            "title": "",
            "comment_content": "There are quite a few philosophical topics that the class goes over. While entertaining, sometimes the course slides can be confusing if you don't attend class.",
            "comment_teaching": "Professor Nam is a dedicated lecturer who is open to different opinions and thoughts. He is very kind and it feels like he genuinely enjoys teaching and helping students. <br /><br />Regarding the workshops, my tutor (Christie Law) was very patient and helpful. She explained writing strategies well and gives useful feedback on homework assignments.",
            "comment_grading": "Grading wise this course is not super harsh--however, there are weekly workshops (consisting of &quot;quizzes&quot; on canvas that you can take over and over again until you get a full score) and homework assignments that must be completed, or else resulting in a 0. No late submissions either makes it easy to lower your grade.",
            "comment_workload": "There is not that much workload, just workshop modules that are due every other week and homework assignments (writing a paragraph, draft, etc.) due on the weeks without workshops. There are also discussion posts that you must work on that are easy to forget. A final essay is due at the end of the course, but you write paragraphs and drafts for it throughout the course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Y0HbDueRKrlZyXCuxaxUlh10rLLRTHvL",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yching",
            "date": "Jan 24, 2022",
            "title": "Good grade",
            "comment_content": "Both Western and Chinese moral theory.<br />It's quite hard to understand the Chinese theory even I am Chinese...",
            "comment_teaching": "Prof. Nam is quite funny. Always make jokes and use daily life examples during the class. The ppt also has some memes so is less boring to read. He held a Chinese review session, both Cantonese and putonghua, after each topic which is very helpful for understanding.",
            "comment_grading": "(10%) Quiz 1: 17/20 (mean: 13.82)<br />(10%) Quiz 2: 19/20 (mean: 17.52)<br />(50%) Essay: unknown<br />(20%) Online activity &amp; Tutorial attendance: all done<br />(10%) Discussion: unknown<br /><br />Final grade: A",
            "comment_workload": "2 quizzes, an essay, 3 canvas discussions, and biweekly tutorial. <br />Both quizzes are open book and open discussion. All you need is a reliable friend to work together.<br />Canvas discussion is a bit annoying as you need to keep replying to others' comments. Some may write so long but it only counts 10% of the final grade...<br />As long as you attend and follow the pace of the tutorial, the 1000 essay can be finished easily. It is good for procrastinating people as it forces you to do different parts.<br />There are some pre-tutorial quizzes and videos but it is multiple attempts so you can do them again until getting full marks.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fFjPjOXUrnPQQiNNkIdy6A8ruISGv6Tn",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yoyo Lam",
            "date": "Jan 12, 2022",
            "title": "",
            "comment_content": "There are certain topics, Utilitarianism, Kantianism, Confucianism, Mohism, and Daoism. It basically talks about the idea or rules for each topic. Some of them maybe quite interesting and good for discussion.<br /><br />You need to attend a writing workshop every two weeks. The tutor taught you the basic structure and mechanics of an argumentative essay.",
            "comment_teaching": "Actually, I think he is good enough, gives out a lot of examples, sometimes talks some jokes. The mood is quite good, much better than many professors in the engineering school.",
            "comment_grading": "20% two quizzes (all multiple choices)<br />10% Canvas discussion (total 3)<br />10% writing workshop online activities<br />10% writing workshop homework and attendance<br />50% final essay<br /><br />For mine:<br />1st quiz 12/20(mean 13.82/20)&nbsp;&nbsp;2nd quiz 18/20(mean 17.52/20)<br />Canvas discussion full marks<br />writing workshop online activities full marks<br />writing workshop homework and attendance full marks<br />final essay no idea, they didn't give out any marks or feedback<br /><br />final grade: B",
            "comment_workload": "I think the workload is quite low.<br />The two quizzes are all multiple choices, open-book and open-discussion. Just read through the PowerPoint before the quiz is alright. The questions are straightforward.<br />There are totally 3 canvas discussions. There are no words limit or requirements, just writing out your thought to the questions is alright. Some people may write quite long like 1000 words, but you don't need to suffer due to them. I didn't write that long and still get full marks anyway.<br />Three prompts would be given for the final essay, you just need to choose one of them, apply different topics to write a 1000 words essay.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BabFeqfG0BcoT5Z1h1yKBEeZgLxa4ZQZ",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yayx14",
            "date": "Jan 05, 2022",
            "title": "NAM Sai Lok is the BEST instructor forever.",
            "comment_content": "Same",
            "comment_teaching": "NAM Sai Lok is goooood, he repeated all lectures in 3 languages (Eng, Cantonese, Mandarin)! He also answered every question from students. <br />All lectures are recorded and saved in zoom drive.",
            "comment_grading": "No attendance for lecture.<br />But attendance is a must for workshop!! (every 2 weeks have one workshop)<br />Quiz 1 -10%: 15/20 (mean:13.82/20)<br />Quiz 2 -10%: 20/20 (mean:17.52/20)<br />Canvas Online Discussion -10%: unknown<br />Online Activities -10%: full marks for completion<br />Writing Workshop -10%: full marks for attending all workshops<br />Final Essay -50%: unknown<br /><br />Grade: B+",
            "comment_workload": "There will be 3 Canvas Online Discussions, participate as much as you can. Try to be the first who comment and reply all comments you received. Actually not a big workload for online discussion.<br /><br />For the quiz, rmb to watch the lecture video before quiz. Quiz question could be about view of Dr. Nam. <br /><br />For the final essay, you will complete the draft much earlier than the final one. So you have plenty of time to adjust it. RMB listen to your workshop tutor clearly and adjust acc. to his opinion.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QNjsjLol5NlVzXVW1fzBrJ3mScKno38K",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 1303,
                    "name": "CHAN, Thomas Anthony Chun Hun",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "M.J.",
            "date": "Feb 14, 2021",
            "title": "A relatively good grade course",
            "comment_content": "This course covers some philosophical theories in ancient China and western countries, including Confucianism, Kantianism and Utilitarianism, etc. It is generally interesting for me. As it is just an introductory course, the level of difficulty of this course is low. Even though you do not have a background in philosophy, you can still understand the concepts covered easily.",
            "comment_teaching": "The instructor, Dr. Nam, speaks English with a strong accent. If you do not understand Cantonese, you may not understand what he is talking about. <br /><br />But there are Chinese recap sessions, including Mandarin and Cantonese sessions to help you understand the concepts and theories in this course more easily. And the live session of the instructor is just for you to ask questions. If you do not have any question, then you do not even need to attend the live sessions, but just watch videos on Canvas to learn the concepts and theories of this course.<br /><br />Dr. Nam is a really nice instructor! You can send emails to ask him questions. He will reply to your emails soon with detailed explanation!",
            "comment_grading": "The grading scheme of this course is abosolute-grading. But I do not know the cut-off scores of it. Even if I sent an email to ask the TA, he did not give me the exact number. In this semester, the mean of the overall scores is around 76, with the corresponding grade &quot;B&quot;. Generally, the grading scheme of this course is lenient. <br /><br />But you must post your thoughts with several hundred words EARLY in the discussions and reply to other students' comments FREQUENTLY. Some people tell you on USTSPACE that you only need to write around 500 words in each discussion and then you can get full marks. That's wrong!!!!!!!!!!!!!! I wrote around 600 words in the first two discussions. As I did not have enough time to write more, I just post my thoughts without replying to other students' posts. In the third discussion, I had enough time <br />to post my comments and repy to others' posts, which were around 2000 words in total. But I only got around 6.6 marks (out of 10) in the discussions. I sent an email to the TA and he replied I had not replied to others in the first two discussions and had replied late in the last discussion. So, remember to write as many words as you can in the discussion, if you have enough time! Otherwise, you grade will be lowered by a sub-grade!!!!!!",
            "comment_workload": "Workload is generally not heavy, with one 1000-word essay and quizzes throughout the semester. But there are numerous deadlines for you to meet. Remember to finish all of them.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vGmZcqUpjnLd4Vfyt1D2DkW8xYj1LwCp",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Spring Ho",
            "date": "Aug 31, 2020",
            "title": "good grade if you got good eyesight",
            "comment_content": "Let's be real, you come to read reviews not because of you want to know what you are gonna learn, just because you want to find out if this is a trap. Let me tell you this: When I was taking it, I only knew two terms, Utilitarianism and Kantism, and they carried me all the way to a B+, I dont even know what Kantism is.<br /><br />It's not that B+ is very good, but you get the idea.<br /><br />If you can bullshit your way through the essay, like how they trained us in high school LS and Chinese speaking, you would be absolutely fine, I bullshitted my way through the whole course. Of course there are certain things that you gotta know to have a foundation to talk useless crap, but it really requires zero effort.<br /><br />content wise, some moral dilemma he mentioned was actually quite fun to think about.",
            "comment_teaching": "Quite funny, makes fun of himself a lot, that makes him kind of relatable in a course that is quite abstract. Let's be honest, these are some boring stuff, it's not easy to make it fun, and he tried his best so respect for him.",
            "comment_grading": "As I said, if you can fill your essays and discussions with bloated crap and make it sound pro, you will do fine.<br /><br />Remember, extremely important to pay attention who you sit next to in the two quizzes, of course that is under the assumption of&nbsp;&nbsp;you not knowing jack shit like me, and also that you picked geniuses to sit next to, I have good eyesight so that is a big advantage, and I was willing to gamble on my neighbor being smart. if your eyes sucks and you are a pussy, then rip, study hard.",
            "comment_workload": "there is nothing demanding, only thing kind of annoying is you have to attend the workshops. The discussions are kind of fun to think and write about, you can see other people's response so keep reading them and absorb the content(I did NOT copy anything AT ALL) <br /><br />and the quizzes, just cheat, pick someone who looks smart to sit next to, just be smart and you will cruise through this course with ease.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WC8jkZUE9QOQ1h0XYHB0nzbOKMjfsetM",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ryan Wan",
            "date": "Aug 28, 2020",
            "title": "",
            "comment_content": "Content covers a broad range of moral values. It is quite interesting, but hard to understand in English, as the concepts are in Chinese. Translation is strange and quite hard to follow sometimes.",
            "comment_teaching": "Did not attend a single lecture. Because of online learning, tutorials are also only 10 minute catch up with the TA. There is no discussion, the TA only reviews the essay progress. I found it very hard to learn about the subject with online learning, but it is all about preference.",
            "comment_grading": "Grading is very fair compared to the input. I got A range with by focusing more on the essay. There is no exam, just weekly quizzes and discussion boards.",
            "comment_workload": "Workload is relatively light, with an essay, weekly quizzes and pre-reading. If you are good at English and writing essays, a big chunk of the grade will be in the bag.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CWqVesqPpqESQbGfni2JVetY8patNHzT",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 876,
                    "name": "SIU, Chi Ming Anthony",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "etyt",
            "date": "Aug 16, 2020",
            "title": "Quite a good course",
            "comment_content": "The course introduces some ethical concepts mostly from the East and two from the West.<br /><br />(Module 1: Introduction)<br />Module 2A: Principle of Utility (Utilitarianism)<br />Module 2B: Categorical Imperative (Kantianism)<br />Module 2C: Confucian Ethics (Confucianism)<br />Module 2D: Inclusive care (Mohism)<br /><br />Module 3: Rationale of Dissolving Moral Conflicts<br />Module 4A: The Concept of Tian and Ming<br />Module 4B: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5: Self-establishment and Detachment \u000bof Zhuangzi <br /><br />Module 2A-D are the most important as you have to include at least one of the moral theories in your essay.",
            "comment_teaching": "Dr. Nam teaches quite well. He explains those ethical theories quite clearly and provides adequate support for your learning in the course. He also provides sessions explaining his lectures in Cantonese and Putonghua.",
            "comment_grading": "Just for this semester only.<br /><br />Weekly Quizzes\t\t\t14%<br /> -Answer 5 super easy MCs in the weeks that have <br />&nbsp;&nbsp;the lecture. Remember to read the lecture ppt <br />&nbsp;&nbsp;before doing the quiz.<br /><br />Weekly Activities\t\t\t7%<br />-Response to 4 questions for every module by <br /> the end of the semester.<br /><br />Canvas Online Discussion \t10%<br />-Participate in 3 online discussions.<br /><br />Writing Workshops \t\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />-Finish some online tasks and attend the online <br /> workshop biweekly.<br /><br />Essay\t\t\t\t\t50%<br />-Write a 1000-word essay, you will be given 3 topics to choose from.<br /><br />I applied P/F so I don't know my grade. The mean is B.",
            "comment_workload": "The workload of the course is not high. You just have to join 3 peer discussions during the semester and hand in a 1000-word essay at the end of the semester. <br />Frankly speaking, I don't like the peer discussion because people in my group were quite &quot;long air&quot;, which takes me some time to read and digest their ideas. Remember don't make your first reply so lately so as to give some time for your peers to write a response.<br />For the essay, just chill. What you have to do is to make sure that you always stick with the requirements and make good use of the consultation time provided by the essay instructor and Dr. Nam.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6E7OH1qBA7sZ2022VeXwRGgOUrxD8UQR",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Grace Chan",
            "date": "Aug 13, 2020",
            "title": "",
            "comment_content": "The concepts are actually quite related, as quite many daily life examples are provided.<br />Not hard to understand and not much to memorise, but takes time to distinguish the main ideas and the differences from concepts to concepts.",
            "comment_teaching": "Dr. Nam teaches quite well, especially as a local professor. He tries quite hard to make the whole thing relatable and interesting, having local jokes quite often lol<br />There are some recap sessions before quizzes, those are really good for revision and that really helps for understanding.<br />My TA for the workshop is Anna, and she's quite nice. I don't think she suggested a lot for my essay, but she is willing to discuss and answer my questions.",
            "comment_grading": "A range without reaching the nice passing point of quizzes set by Dr.Nam. Got fair results /just pass the discussion part. I just put my efforts into the essay and that helps a lot for the grading.",
            "comment_workload": "A bit tough for the discussion part, but should be normal to light as a HUMA course.<br />TBH I appreciate the workshops to help us breakdown the essay parts, with evaluations from time to time. This helps me to finish my essay on time. <br />The lecture before quizzes have a quick recap session for the quiz which does help for a quick revision (which I just look thru those slides lol)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MbG9jtfniOOHsuH8Um3ud2nclR4idx6A",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jerson",
            "date": "Jun 19, 2020",
            "title": "篇essay好重要",
            "comment_content": "1. introduction<br />2a. principle of utility in utilitarianism<br />2b. categorical imperative in kantianism<br />2c. more feeling in confucianism<br />3. rationale of dissolving moral conflict in the thought of Taoism<br />4a. the concept of tian and ming<br />4b. the distinction between righteousness and destiny in the thought of Mencius<br />5. self-establishment and detachment of zhuangzi<br />其實內容都幾得意",
            "comment_teaching": "PowerPoint 同教嘅野其實一早已經upload曬上canvas自己睇，睇完唔明嘅先再係lecture時間同Prof Nam 一齊討論。",
            "comment_grading": "fair<br />最重要係篇文，要比心機寫,最大比重係篇文到<br />其他quiz要做齊<br />有分 普通quiz同 weekly quiz<br />online discussion 分3次做",
            "comment_workload": "還算可以，唔係真係好多。<br />係去到大家完mid term 個陣online discussion 同essay draft同步黎會chur少少。<br />canvas 普通quiz可以一次過做曬(無限attempt)，weekly quiz 就冇得睇答案，1 attempt only",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5Rz0M8sptTskmbcq7FarAl3ECuyTeCyz",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 0
                },
                {
                    "id": 293,
                    "name": "FREEMAN, Danyal Jonathan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jenny Wang",
            "date": "Jan 23, 2020",
            "title": "Easy but troublesome",
            "comment_content": "Content Outline:<br />Utility in utilitarianism<br />Categorical Imperative in Kantianism <br />Uprightness in Confucianism<br />Impartiality in Mohism<br />Rationale of dissolving moral conflict in the thought of Daoism <br />The Concept of Tian (天) and the Concept Ming (命) in Zhuangzi <br />The Distinction between Righteousness and Destiny in the Thought of Mencius <br />Self-establishment and Detachment of Zhuangzi",
            "comment_teaching": "NAM's lectures are not boring but not useful, you can understand the contents in an easier way by searching them online.<br /><br />FREEMAN gives brief comments in workshops, which are good for writing your essay.",
            "comment_grading": "not good, B",
            "comment_workload": "easy (don't have to think) but a lot in numbers",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Rcl6v1w4O0xxQOqgWCd7mUMN07CLSfg8",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 1231,
                    "name": "SAMPSON, Nicholas",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yanchan",
            "date": "Jan 20, 2020",
            "title": "",
            "comment_content": "Module 1: Introduction<br /><br />Module 2: Moral Conflict: Western Ethics/ Chinese Philosophy<br />(Utility in Utilitarianism, Categorical Imperative in Kantianism, Uprightness in Confucianism, Impartiality in Mohism)<br /><br />Quiz 1<br /><br />Module 3: Dissolving the Moral Conflict<br /><br />Module 4:Destiny ( The Concept of Tian (天) and the Concept Ming (命) in Zhuangzi, The Distinction between Righteousness and Destiny in the Thought of Mencius)<br /><br />Module 5: Well-being (Self-establishment and Detachment of Zhuangzi, The Life of a Man of Virtue)<br /><br />Quiz2",
            "comment_teaching": "lecture冇attendance又有lecture video，但tutorial有attendance. Dr. Nam 會整 iprs增加參與度，同埋會用例子去解釋。quiz前一堂會有一兩題sample question，quiz到有機會會考返。<br /><br />個人覺得tutorial幫得比較多，會提你essay應該點寫要包含D咩，每堂之前要寫一段仔essay，tutor會幫你睇一轉同比意見你有咩要改。我個tutor係Sampson，好nice教得都清楚，essay有咩唔明都可以問tutor.",
            "comment_grading": "Two in-class quizzes （16MC questions）10%<br />Canvas online discussions 10%<br />Assignment 10%<br />tutorial attendance 10%<br />Term essay (including revision efforts) 50%<br /><br />我quiz1=mean，今年停課所以quiz只係考左一次，直接計20%,<br />assignment同tutor attendance分攞曬,<br />discussion 同 term essay分冇公開,<br />最後A-,<br />essay佔50%所以essay真係好重要。",
            "comment_workload": "quiz16題MC都幾straight forward。<br />discussion比較麻煩要定時定候覆其他人但都唔會用太多時間。<br />assignment係canvas到做，冇時間限制無限次attemp只要deadline前搞點就攞足。<br />attendance都係得5次，頭3次返唔到都可以做返make-up task<br />essay只要每次返之前認真做，最後唔難搞點。而且tutor會幫手check一次。<br />如果英文底比較好會有幫助，assignment雖然容易但deadline比較多唔記清楚好容易會miss。",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Y5fufPSuf4wKSNtsbU1dHXQAMDsRnUg7",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                },
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 1231,
                    "name": "SAMPSON, Nicholas",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "16y39y",
            "date": "Jan 05, 2020",
            "title": "i love dr nam",
            "comment_content": "Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian (天) and Ming (命)<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi<br /><br />Lectures are on western and Chinese moral theories. The first half is quite straightforward and easy to understand, while the later half is a bit hard to grasp. Tutorials (or what they call workshops) are run by the CLE, you can expect them to be like English language lessons which teach you how to write argumentative essays.<br /><br />I personally think the contents are very suitable for a&nbsp;&nbsp;introductory HUMA course, especially for someone like me with no background in humanities. I'm not particularly passionate about humanities, but I really enjoyed the course because it prompted me to think and reflect on morals.",
            "comment_teaching": "Professor Nam (HUMA) speaks with a Cantonese accent, but his English is generally fluent and easy to follow. He always tries to make his lectures funny and interactive, which was especially helpful since the lectures were held early in the morning. He always uses real-life, relatable examples to explain concepts, which really help make the abstract concepts a lot easier to understand. I also appreciate that he never pushes his own moral values and opinions on us, instead he welcomes all sorts of views and gives plenty of chances for students to share their thoughts. <br /><br />He is also very willing to help outside class. He always stays behind to answer students' questions and is willing to open extra Cantonese and Mandarin recap sessions for those who need it. I also sent him my essay for comment really late but he was still willing to read it for me. I was so touched omg<br /><br />Nick (CLE) is generally helpful and gives useful, constructive advice on essay writing, although he is not too familiar with the moral theories. His writing workshops are pretty chill and sometimes sends friendly emails to check on us. Having a language instructor to check my drafts at different stages helped me feel more confident about my essay.",
            "comment_grading": "50% Final Essay [mean 35.75 sd 6.59]<br />20% Quiz<br />10% Online Discussion [mean 6.6 sd 2.83]<br />10% Writing Workshop (Online)<br />10% Writing Workshop (Classroom Attendance)<br /><br />Pretty good grade course, especially around the B to lower A range (I personally feel so). The mean is B, which is pretty good. Not hard to get a decent grade as long as you put in reasonable effort and follow the deadlines. You can get full 20% from the writing workshops as long as you show up and complete your online tasks on time (can attempt unlimited times until you get it all correct).<br /><br />The term essay only requires you to apply the first half of the course, so if you are very hardworking you can start early to reduce your suffering near the semester end, where workload builds up.<br /><br />There are usually two quizzes, not difficult if you bother to read the powerpoints and watch lecture videos (I attended all lectures). This semester, one was cancelled so the first quiz was double counted, or we could write an optional extra task to substitute the second quiz. Not sure about discussion grading.<br /><br />I got full in discussions and attendance, 17.5/20 for quiz, 45.8/50 for essay, overall 91.025 and finally got an A. Generally sensible grading.",
            "comment_workload": "Quite heavy. Many random tasks throughout the semester. The 1000-word final essay is not actually the main source of workload. Quiz doesn't take too long to study for either.<br /><br />Main workload comes from online workshops and discussions. Almost every week, there are online exercises and submissions required on canvas (sometimes it is reading an essay and analyzing it, other times you need to draft parts of your essay). While lecture attendance is not counted, attendance is counted for bi-weekly writing workshops.<br /><br />Online discussions are easily the worst part of the workload. There are three online discussion topics throughout the course. The discussions are especially stressful because your peers (in your tutorial group) keep posting long (hundreds of words) comments in the discussion and it is very tiring to read them. Near the deadline, I received 4 Canvas discussion notifications in the short duration of my shower. Ruin my mood omg<br /><br />The essay is pretty fine since it's just 1000 words and you have close to 2 months to do it. The writing workshops also make you submit parts of it at different stages in advance, so you don't have to work from scratch all at once near the deadline.<br /><br />I think the workload is worth it as most of it guarantees a decent grade.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "U09jlaIIjtk03FpMefBboszOPJ02SgTP",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "哇哇哇哇",
            "date": "Apr 25, 2019",
            "title": "Quite good",
            "comment_content": "Before midterm:<br />Utilitarianism, Kantianism, Confucianism and Mohism<br />After midterm:<br />Daoism, the concept of Tian and Ming, Mencius and Zhuangzi",
            "comment_teaching": "For lectures, it is clear enough to understand the lecture content, the powerpoint slides are also easy to follow. Actually, I think it is not a must to attend the lectures but if you are interested in the topics, I encourage you to attend the lectures for better understanding.<br />For the writing workshops, the teaching is similar to LANG1002 and 1003 courses, it depends on your tutor. To me, it is quite boring.",
            "comment_grading": "1.In-Class Quizzes x 2 (20%)<br />2.Canvas Online Discussions x 3 (10%)<br />3.Writing Workshops x 5 (Online+ ClassroomSessions) (20%)<br />4.Final Essay (50%)",
            "comment_workload": "Huge.<br />Need to attend 5 writing workshops, do quizzes before the workshops, engage in 3 discussions (write ~500 words for each discussion) and finally write a 1000-words essay.<br />No final and midterm exams, only 2 quizzes.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "af8OP0pVmhKhsh5DUavmhn6PT4ndtdVn",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                },
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cruise",
            "date": "Jan 22, 2019",
            "title": "Not bad if your English is good",
            "comment_content": "The content is divided into two general sections. The first half of the semester will be focusing on morality, i.e. How to reconcile the fact that there is unjustness in the world.<br /><br />The second half will be about the concepts of Destiny.<br /><br />Module 1: Introduction<br />Module 2: Utilitarianism<br />Module 3: Kantianism<br />Module 4: Confucianism<br />Module 5: Mohism<br />Module 6: Daoism<br />Module 7: Destiny, Concept of Tian and Ming.<br />Module 8: Righteousness and Destiny from Mencius<br />Module 9: Well-being of Zhuangzi.",
            "comment_teaching": "Dr Nam tries really hard to make his lectures interesting. He includes quite a few memes or recently trendy images in his lectures, and generally tries hard to make philosophy sound not boring. He's also fun to talk with after class (if you speak Cantonese), but his English is about average for a Hong Kong person.",
            "comment_grading": "COURSE ASSESSMENT (Total of 100%)<br /><br />1. In-class quizzes. There will be two, 1/3rd of the way in the semester and 2/3rd of the semester. There will be 16 Multiple-choice questions per quiz. What is most important however, is your combined score. I.e. Getting 27/32 right in both quizzes is equal to full marks, 20% of the grade and Dr Nam gives answers for 3 questions in the lecture before the quiz. (20% of Grade)<br /><br />2.Canvas Online Discussions. There will be 3 topics posted regularly on Canvas. Just post first with some decent length and you should do fine, since it's a holistic assessment. (10% of Grade)<br /><br />3. Part of this course includes 5 Writing Workshops. Each workshop requires you to do an online portion beforehand, and you will be graded on online quizzes. However you have unlimited attempts and only the highest grade is counted, so just do them on time. Also attend all the workshops within 5 minutes of the class starting, to get full marks for this section. (15% of Grade)<br /><br />4. Final Essay. This is worth 50% of your grade. In the first lecture he should reveal the 3 possible topics you can write a 1000-word essay about. If you cannot write about any 3, you can drop the course. Otherwise, you will write a little bit every writing workshop, and you can consult Dr Nam for further specifications about this part. You are required to also include 1 philosophical concept from the course, but you can just pick the first one (Utilitarianism) and fulfill the requirement in the 2nd Week. (50% of Grade)<br /><br />My final grade was an A.",
            "comment_workload": "Workload is relatively easy. Just remember to complete all of the online writing workshops and attend on time. The final essay will be slowly completed over the semester so it's spread out. You can also tailor the essay so that you complete it at the start of the term when there's less stress, especially if you decide to write your essay on the first lecture topic.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RWhMfDEm4d9yFHK7V8Ry7n0xbSeHx24t",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "IamJas",
            "date": "Aug 21, 2023",
            "title": "",
            "comment_content": "1<br />Introduction: General overview of the course and topics to be covered, with brief mention of the assessments and expectations.<br /><br />2a<br />Moral Conflict in Western Ethics I: Principle of Utility in Utilitarianism<br /><br />2b<br />Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br /><br />2c<br />Moral Conflict in Chinese Philosophy I: Moral Feeling in Confucianism<br /><br />2d<br />Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br /><br />3<br />Rationale of Dissolving Moral Conflict in the Thought of Daoism<br /><br />4a<br />Destiny I: The Concept of Tian and Ming<br /><br />4b<br />Destiny II: The Distinction between Righteousness and Destiny in the Mencius<br /><br />5<br />Well-being: Self-establishment and Detachment in the Zhuangzi<br /><br />Personally, I do find these topics not that interesting.",
            "comment_teaching": "Dr Nam is kind of humorous and has definitely shown enthusiasm in teaching. He is a friendly and easy-going instructor. Although the topics are not that interesting to me, I am not bored during his lectures.",
            "comment_grading": "Two quizzes: Multiple choice questions 20%<br />Canvas online discussions; 10%<br />Writing workshops (Tutorial): Online activities, assignment and attendance: 20%<br />Final essay: 50%",
            "comment_workload": "Medium. You have to complete some online activities on Canvas before each tutorial session and the assignment after the tutorial. There are 3 discussion forums in total in which you have to post your opinion on 3 moral topics. There are 2 quiz on the lecture notes. There is also a 1000 words final essay.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ntyMixry2JCQZuHvvRXzzh392BQGSDrJ",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Karly",
            "date": "Aug 04, 2023",
            "title": "",
            "comment_content": "Interesting content. <br />It might be hard to read the ppt on your own so make sure to watch the Cantonese/Mandarin recap.",
            "comment_teaching": "Really good Professor who provides lesson recap in Cantonese/Mandarin. <br />Provide lots of easy to understand examples during lesson.",
            "comment_grading": "Very good grading if you manage to hand in the final essay in a good quality. <br /><br />No mid-term or final examinations. <br />2 quizzes are held, usually 10-15/16 MCs. Not hard.",
            "comment_workload": "Only few quizzes which you can easily find sources, online discussion and a final essay. <br /><br />Make sure you have to REPLY to others comment, reply to others' reply on your own comment and comment your ideas. <br /><br />The interaction is affecting the grading &gt; content.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CKGCCfUzFmMNK9xxvb40OzgYg7NetjWf",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jackie Wong",
            "date": "May 15, 2023",
            "title": "Good Course",
            "comment_content": "Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian (天) and Ming (命)<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi",
            "comment_teaching": "Dr.Lam's teaching is funny, although the teaching material may not be attractive.",
            "comment_grading": "two quizzes: 20%<br />canvas online discussion: 10%<br />Online activities: 10%<br />Writing workshop attendance: 10%<br />Final essay (including revision efforts): 50%",
            "comment_workload": "the overall workload is light.<br />two quiz&nbsp;&nbsp;zes<br />one essay doing in one sem, there are 3 topics to choose <br />attend 5 compulsory writing workshops which help you to write the essay<br />three discussions from the discussion forum",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RZ0gSJqAeJNH0tOK2gZ3MGFp7R8BHnd4",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nathan.t",
            "date": "Dec 23, 2022",
            "title": "good grade",
            "comment_content": "ethics staff, need to attend lecture in order to understand the theories, so you could write better essay and forum discussions<br /><br />Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian (天) and Ming (命)<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi",
            "comment_teaching": "dr nam is fun!",
            "comment_grading": "good grade, got A<br /><br />Two quizzes  Multiple choice questions (each quiz accounts for 10%) 20% <br /> <br />2 <br /> <br /> <br />Canvas online <br />discussions <br /> <br /> Peer exchange forum on questions posted by the faculty regarding <br />the weekly readings and lectures;&nbsp;&nbsp;<br /> Three deadlines over the process of the discussion; topics given by <br />each would be closed afterwards – see “Rubric for Canvas Peer <br />Exchanges” for details.&nbsp;&nbsp;<br />10% <br />3(a) <br />Writing workshops:<br />Online activities <br /> Viewing online content and completion of all tasks embedded in the <br />online content. 10% <br />3(b) Writing workshop: <br />Classroom sessions <br /> Attendance: Attending all five writing workshops on time. Any <br />absence will be penalized if without justifiable proof(s). <br />Punctuality: You will be marked absent if late for more than 15 <br />minutes.&nbsp;&nbsp;<br /> Complete all Homework on Canvas including draft essay <br />10% <br />3 <br /> <br />4 Final essay (including <br />revision efforts) <br /> Write a persuasive essay of 1000 words; <br /> Which is revised at least once;&nbsp;&nbsp;<br /> Show evidence of response to feedback on your first draft.&nbsp;&nbsp;<br />50%",
            "comment_workload": "need to attend writing workshops which are boring.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "s3pJDwjuRzQNRPg0mqasmkN53pw8JQfC",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hellike",
            "date": "Sep 04, 2022",
            "title": "",
            "comment_content": "Topics are similar. You can check what other have said.",
            "comment_teaching": "Although the course is about moral philosophy, Dr. Nam made the class engaging and interesting by giving some of his &quot;unique&quot; thoughts and daily life situation (Also did some polling). One problem is that Dr. Nam's accent is a bit heavy, but I think you could understand what he said since there is not many terminologies used in this course. Or you can ask him question directly, which is quite helpful.<br /><br />There were also one mandarin and one cantonese lecture recap for each topics when Dr. Nam has finish it.",
            "comment_grading": "two quizzes: 20%<br />canvas online disscussion: 10%<br />Online activities: 10%<br />Writing workshop attendance: 10%<br />Final essay (including revision efforts): 50%<br /><br />Statistics of this semester:<br />Mean: 79.65 (Course grade: B)<br />Median: 81.59 (Course grade: B)<br />S.D.: 10.14",
            "comment_workload": "I would say the workload is between light - moderate for me. <br />-There was 3 online discussion, which you needed to share your ideas on three topics based on the moral theory you had learnt in class. And you also needed to discuss with other students.<br />-a couple of extreme short quizzes before each workshop and 1 online activities after each workshop (5 workshops)<br />-a 1000 persuasive essay, 3 topics to choose from. The essay will be revised by the workshop tutor once, and you need to respond to the feedback from your tutor.<br />-two mc quizzes, beware some of the questions are based on the what Dr. Name have mentioned in class",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1CzWvqxkbR7SkaQdvhd14YzZOlsGD7eo",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 1417,
                    "name": "CHEUNG, Anisa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "dllmpopo",
            "date": "Jul 20, 2022",
            "title": "Prof Nam was hella good",
            "comment_content": "Mainly focusing on the Chinese and&nbsp;&nbsp;Western philosophers which I found out they were quite interesting, and aspired you to think critically.<br /><br />Nam is a good professor with a sense of humour, he offered lessons in bilingual channels (mainly Canto and English), for people to have a better understanding on the theories he explained during lessons, so no worries for people who are not good in English, you can always review lectures in your own suitable channel.",
            "comment_teaching": "Dr. Nam and Anisa are both great who are willing to clear your doubts and answering your questions.",
            "comment_grading": "1. There are many little quizzes to test your understandings, but they all have unlimited attempts, and they will show you the right answers right afterwards, so you just have to spend a little time on it and get it all done. (10%)<br /><br />2. 2 lecture quizzes, all in open-book format, so you can team up with your friends or just directly go to discuss answers with Prof Nam, he will answers your doubts. (20%)<br />&nbsp;&nbsp;&nbsp;&nbsp;<br />Quiz 1: 15/20<br />Quiz 2: 20/20<br /><br />3. Attendance is not required for lectures, but is required for writing workshops, forgot to wake up one time and lost 2% of my marks. A total of 10% will be counted toward your final grade. And the tutors will help you check your essay progress during tutorials and discuss it with your peers. I also forgot to submit one of them big it was no big deal to be honest. (10%)<br /><br />4. Online discussion forums (10%)<br /><br />5. The final essay grade won't be shown if you haven't asked your tutor, but after following the guidelines in all your homework, it should be quite easy to get it done, got 72/96 at last. (50%) <br /><br />Final grade: B+",
            "comment_workload": "The grading is pretty good, as a student who always skipped morning lectures, I still got a pretty decent grade. So this lesson is quite chill if you wanted to get a good grade and learn something from it at the same time.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "URr6POAF43SmSYToX9lSvBn81isKltrV",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Selwyn",
            "date": "Feb 16, 2022",
            "title": "",
            "comment_content": "The contents are a little bit abstract. If you pursue a good grade in this course, you have to make sure you really understand the theory and concept.",
            "comment_teaching": "He made a good explanation on each topic, especially for the locals. He was funny in class and tried to make the class less boring with those topics. It's okay that you don't understand the topics at once since he was patient to explain each of them after classes or individual consultation.",
            "comment_grading": "I think as long as you don't miss any quizzes and small tasks, understand the topics to a certain level for your essay, it is a good grade course.",
            "comment_workload": "There are quizzes for every topic every week. You have to spare some time to get well-prepared for your essay. As a whole, I think the workload as a common core is fair.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eKDeVMX5IZLC20Wt9oK6OV6ltldYNs7R",
            "semester": "2020-21 Spring",
            "instructors": [],
            "is_author": false,
            "author": "DBB",
            "date": "Jan 25, 2022",
            "title": "",
            "comment_content": "- Utilitarianism<br />- Kantianism<br />- Confucianism<br />- Mohism<br />- Daoism<br />- Tian &amp; Ming<br />- Zhuangzi",
            "comment_teaching": "It will be quite easy to follow the real-time lecture(the professor called it a live discussion) if you have watched all the videos uploaded in the canvas before the live discussion. The professor went through the important contents of each chapter by asking some questions or by reviewing the quiz answers.",
            "comment_grading": "- Weekly activities 7%<br />- Canvas online discussions 10%<br />- Weekly quizzes 14% <br />- Online writing workshops 20%<br />- Essay (1000 words) 50%",
            "comment_workload": "Not too much.<br />Don't forget to finish weekly quizzes and weekly activities. <br />It will be better for you to work on those as soon as you took the lecture so that you can remind the contents of the lecture more clearly. Also participating in online discussions regularly will allow you a good grade. <br />However, the most important part out of all of these is the essay which you can write up to 1000 words. If you put much effort into the essay and refer to TA's comments, you could get a satisfactory grade in this course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VxpvhgCKo0eCcJ3zU2gsfTAKxhlagO04",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 1049,
                    "name": "CHEUNG, Colin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bon*2",
            "date": "Sep 20, 2021",
            "title": "Good grade course with light workload",
            "comment_content": "Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian (天) and Ming (命)<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi<br />-- Not all content will be covered in the quiz. Just make sure you go through the topics included only before you do the quizzes",
            "comment_teaching": "No attendance for the lecture. Professor will prepare all videos on the canvas. Lectures are just for live discussions. Sai Lok will briefly go through the main points of the learning chapter and the quiz answers at the very beginning of every class.",
            "comment_grading": "Canvas online discussions 10%<br />(Peer exchanges)<br /><br />Essay (1000 words) 50%<br /><br />Online writing workshops 20%<br />(Online assignments)<br /><br />Weekly quizzes 14% &amp; Weekly activities 7%<br /> (Lectures &amp; educational videos)",
            "comment_workload": "Very light workload! Just remember to finish weekly quizzes and weekly activities. You can finish all weekly activities by just typing yes or no so better finish it at the beginning of the semester. Better noted that different tutorials will have different deadlines for the online writing workshops. <br />You need to participate in online discussion REGULARLY, just post on the beginning day and choose one peer’s post to reply in the middle of the period then will be enough.<br />Remember to discuss your essay outline with Sai Lok if you wanna get an A. Sai Lok will help you clarify your organisation and some points of your essay. He may refer some references for your essay too!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TRYGuQLmNDTP4zpBCOYgCzTva5oxZEDR",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "william_35",
            "date": "Aug 16, 2021",
            "title": "",
            "comment_content": "Canvas online discussions 10% (Peer exchanges)<br />Essay (1000 words) 50%<br />Online writing workshops 20%(Online assignments)<br />Weekly quizzes 14% &amp; Weekly activities 7% (Lectures &amp; educational videos)<br /><br />Module<br />Topics<br />1<br />Introduction: General overview of the course and topics to be covered, with brief mention of the assessments and expectations.<br /><br />2a<br />Moral Conflict in Western Ethics I: Principle of Utility in Utilitarianism<br /><br />2b<br />Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br /><br />2c<br />Moral Conflict in Chinese Philosophy I: Moral Feeling in Confucianism<br /><br />2d<br />Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br /><br />3<br />Rationale of Dissolving Moral Conflict in the Thought of Daoism<br /><br />4a<br />Destiny I: The Concept of Tian and Ming<br /><br />4b<br />Destiny II: The Distinction between Righteousness and Destiny in the Mencius<br /><br />5<br />Well-being: Self-establishment and Detachment in the Zhuangzi",
            "comment_teaching": "Dr Nam is a considerable lecturer and he always try hard to make the lesson engaging. He cares all the students, scheduling Cantonese, Mandarin and English zoom and students are free to join. Plus, ppt are embedded with audio recording and script are provided as well.<br /><br />I skipped almost all the lectures. During lectures, he shared student's thoughts on the weekly activities (there's weekly question on canvas, you can scored even if you just put a &quot;yes&quot; on canvas&quot;).<br /><br />Overall, he's energetic and recommended.",
            "comment_grading": "Huge weighting on final essay. (Mean: 78.318 Median: 80.229)<br />I participated actively on online discussion.<br />Weekly quizzes 13.6/14<br /><br />Overall, B+",
            "comment_workload": "Personally, it is reasonable. <br /><br />Essay and online online discussion.<br />More then 2months to prepare a 1000words essay.<br />There are three online discussion, you have to give response and share your thoughts on canvas. Honestly, it is quite annoying. If you want score a higher grade on that part (10% of overall syllabus), you have to give comment on every classmate's work. <br /><br />Weekly quiz: 4-5 question per month.<br />Weekly activities: unlimited chances to correct your answer. You can try as much as you want to make your answer perfect.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eDprswcmhKUUS9lrnU8dZxdHryetPxch",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "belowmeanguy",
            "date": "Jun 30, 2021",
            "title": "In Nam Sai Lok we trust!!!",
            "comment_content": "Quite interesting.<br /><br />- Principle of Utility in Utilitarianism<br />- Categorical Imperative in Kantianism<br />- Moral Feeling in Confucianism<br />- Inclusive Care in Mohism<br />- Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />- The Concept of Tian (天) and Ming (命)<br />- The Distinction between Righteousness and Destiny in the Thought of Mencius<br />- Self-establishment and Detachment of Zhuangzi",
            "comment_teaching": "No lecture!!!!!! Just watch online videos on Canvas and complete the easy questions. Each question contributes 0.25 points (you would receive 0.25 points even if you just type yes/no).<br /><br />Then Prof would discuss about students' answers or any misunderstanding raised by students during lecture time. Attendance is really not required.<br /><br />Three times of online discussion. Prof would announce a topic and students are required to go and post different opinions on the Discussion page regularly. Idk how are these graded but there are a lot of ambitious UST students typing essays every day lmao.",
            "comment_grading": "Very easy to achieve a good grade.<br /><br />- Complete the 0.25 point questions before deadline<br />- Complete regular quizzes (just 5 MCs)<br />- Complete hw for tutorial (for your essay)<br />- Regular discussions<br />- Submit essay draft (don't do it perfectly lmao because:)<br />- Correct the final essay based on their feedback on your draft <br /><br />That's it. Basically just do little work regularly. Probably spent &lt;1 hour every week on this course. Got an A at last.",
            "comment_workload": "I wouldn't say the workload for this course is very easy, but it certainly is easy to achieve an A range, comparing to other courses. Just spend some time on this course regularly and you should have a good grade.<br /><br />I finished the essay very early, which is also what I would suggest others to do, then you can leave this course behind.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DWlMlsSSoCohUvRazcOjiF9CfYRmwjow",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mathis So",
            "date": "Jun 12, 2021",
            "title": "A Relatively good grading SSC Course",
            "comment_content": "Talk about morality from different aspect (Utilitarianism, Kantianism, Confucianism, Mohism, Daoism)<br /><br />Destiny and Well-being(The concept of Tian and Ming, Mencius and Zhuangzi)<br /><br />These content are interesting to me.<br /><br />A important point from course description: Since this is not an English language course, your English proficiency alone will not determine how well you do in this course. However, poor English proficiency may affect your performance because you will be assessed on the ideas and the argument in your essay. Your English proficiency affects how well you can express these ideas and construct an argument. If you are a first year student from Hong Kong and you obtained only a level 3 pass at HKDSE or a level 4 pass with any sub-score lower than 4, our experience suggests you will find it difficult to do well in the course at the moment. We recommend that you wait and take HUMA 1000 after you have completed and passed LANG 1002 and LANG 1003 with at least a grade C-.<br /><br />My personal suggestion : If you are weak at English, maybe year 2or3 is a better timing for taking this course.",
            "comment_teaching": "Dr. Nam is a good professor. <br />He is willing to answer your questions. And he even have Cantonese and Mandarin recap of different topic (It is optional and you can feel free to join if you don't understand the concept of certain thoughts)<br /><br />Lectures don't take attendance, Dr.Nam will not teach any course content in lecture, he will discuss the feedback of those interacting questions instead. You can skip it if you like.<br /><br />You are required to watch the video provided by Dr.Nam. <br /><br />BTW, everything is online this semester.",
            "comment_grading": "Absolute grading scheme <br />Canvas online discussions 10%<br />Essay (1000 words) 50%<br />Online writing workshops 20%<br />Weekly quizzes 14% &amp; Weekly activities(questions) 7%<br /><br />Passing the course should not be a problem.<br />If you want to get a grade in A range , i recommend you to put more effort in online discussions and Essay. Essay is the most important part.",
            "comment_workload": "No Midterm and Fianl exam <br /><br />You have 3 online discussion and an 1000 words essay. (These are the main workload)<br /><br />Total 7 short quizzes (test your understanding on the course content) (All are simple and you can find answers directly in the course material)<br /><br />4 exercises that needs to be done before the first 4 workshop<br /><br />Some questions about dilemma and your feeling (you can just answer Yes/No to get the points)(minimum requirement is 1word)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EjILS4sb3mHOpQJDwRBG15a6pDjdIOaF",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Garyli",
            "date": "Jan 20, 2021",
            "title": "",
            "comment_content": "Writing Workshop&nbsp;&nbsp;一共五個workshop 可去可不去 主要講解個essay點寫（比如可能第一個workshop叫你寫thesis statment，第二個 寫intro）<br /><br />Online discussions&nbsp;&nbsp;係canvas上面回應一條題目並同各位同學battle下，要用course material。 最後會搞到好似軍備競賽一樣，見人寫多你就寫多，其實我覺得一般3個應該夠。<br /><br />Final essay 比你三個題目，叫你用course material去作出答案<br /><br />workshop activity and quiz （略）",
            "comment_teaching": "對唔係好識講廣東話嘅同學 可能難聽明D <br /><br />Online mode lecture 其實唔太需要你上堂 基本都有 video 可能一個module 四個video 每個3-10分鐘<br /><br />比想象中教得生動一D",
            "comment_grading": "只要你平時分執嗮， final essay 正常D 都有 B+<br /><br />Remember to attend the first class. Remember to attend the first class. Remember to attend the first class.&nbsp;&nbsp;You will have adequate concept of what this class will teach and grade your work.",
            "comment_workload": "比正常workload&nbsp;&nbsp;多小小<br /><br />基本上你嘅essay 攤開成個sem去寫。 Essay 要寫大約1000字",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "w9CHPwEHAygLgcCu3PvN38CO52WK5Swi",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Peachy",
            "date": "Jan 05, 2021",
            "title": "Great course with great professor",
            "comment_content": "It is mainly about different theories ranging from western idea to Chinese philosopher. Some concept maybe a bit abstract to understand, you may need to really concentrate to the video or discuss with your friends. However, the overall content is easy to handle if you pay attention to the content.",
            "comment_teaching": "Although Prof Nam's pronunciation may not be easily understood by foreign students, he is still an interesting and patient teacher to try his best to explain different concept.",
            "comment_grading": "As long as you try your best to read all the materials carefully and follow the instructor's advice to amend your final essay, the grade will be very good. <br />For your reference, the mean grade of this course is B which is the best grading course I have ever seen in UST. <br /><br />Weekly quizzes &amp; activities 21%<br />Canvas online discussions 10%<br />Online writing workshops (Canvas) 20%<br />Term essay (including revision efforts) 50%",
            "comment_workload": "The workload is light. We are only required to watch the video every week and answer 5 MC questions related to that video; write a final essay and participate in three discussion.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rURYMFTax5kL7OoszEPfMZx3NGxWTuTv",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1303,
                    "name": "CHAN, Thomas Anthony Chun Hun",
                    "rating": 1
                },
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sbm2022",
            "date": "Jan 05, 2021",
            "title": "Huma 1000B",
            "comment_content": "Utilitarianism, Kantianism , Mohism, Tian and Ming.......<br /><br />(Module 1: Introduction)<br />Module 2A: Principle of Utility (Utilitarianism)<br />Module 2B: Categorical Imperative (Kantianism)<br />Module 2C: Confucian Ethics (Confucianism)<br />Module 2D: Inclusive care (Mohism)<br /><br />Module 3: Rationale of Dissolving Moral Conflicts<br />Module 4A: The Concept of Tian and Ming<br />Module 4B: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5: Self-establishment and Detachment \u000bof Zhuangzi",
            "comment_teaching": "Dr Nam's Chinese lecture is way better than his English version. If you are for knowledge, go for his Chinese recap<br /><br />TA Thomas is really helpful and kind, he gave useful and detailed comments. Truly thankful to have him!",
            "comment_grading": "Difficult to get A+<br /><br />Quiz (12.8/14)<br />-7 Quizzes in total <br />- 5 MCs each<br />-Quiz 1 is the hardest, lost 0.8 <br /><br />Online discussion(9.5/10)<br />-1 post and 3~4 replies <br />-around 1000 words per discussion<br /><br />Online workshop activities(10/10)<br /><br />Class workshop and activities(10/10)<br /><br />Essay (44.972/50)<br />-TA's comment is useful, try to follow their suggestion as much as you could<br /><br /><br />Toal:94.092-&gt; A<br /><br />To get A+, you have to score full mark in quizzes",
            "comment_workload": "light but make sure you don't miss any deadline!<br />hundreds of deadlines",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "8WXsitx7wbTewTlb9o8BTYFkzCldKlcM",
            "semester": "2019-20 Spring",
            "instructors": [],
            "is_author": false,
            "author": "竹",
            "date": "Sep 01, 2020",
            "title": "",
            "comment_content": "內容幾有趣，要聽/要記嘅嘢唔多。黎黎去去都係嗰幾個基本理論，google can help。",
            "comment_teaching": "幾乎無上過堂。上過一兩次，instructor比我嘅印象係幾funny，都會吹下水，但主要都係講下ppt，幾個鐘堂就真係不了，因為呢個course唔使上堂都識，基本上上網search下距主要focus嘅幾個中外理論，好快就follow到距地教緊乜同篇essay應該點打，所以teaching對我黎講真係可有可無。",
            "comment_grading": "essay 50%<br />writing workshop 20%（homework就係要你隔一排就寫少少咁，慢慢砌成篇essay。至於workshop就計attendance，都係同你講翻你份嘢有咩問題之類，再問下你有無問題問翻距，15分鐘就hea過）<br />quizzes 14% （一個禮拜一份，每份5條mc，答案基本可以係lecture個ppt搵到）<br />canvas discussion 10% （canvas group文字討論）",
            "comment_workload": "基本上除左每個禮拜quiz嗰5條mc同essay之外，全部都係9答（unlimited summit answer）最大嘅workload就係essay，但係一個sem時間分晒part同你做，仲比埋suggestions你，好低workload。",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Cxvu0RXdeyFZ1udlKIOSvTO0zgMxef5R",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lclok",
            "date": "Jan 22, 2020",
            "title": "No need to attend lectures physically",
            "comment_content": "The course is divided into two parts. The first half is related to the first quiz and the final essay while the second half is only related to the second quiz. The first half is about 4 types of ethical principles including Utilitarianism, Kantianism, Confucianism and Mohism. The second half seems to even vaguer as it is about destiny like Tian Ming (天命) in Chinese culture.<br />Whether you like the content or not truly depends as some may find such vague concepts very boring while others really enjoy them. As I have mentioned that the content is about vague concepts like ethics and destiny, it tends to be harder to understand the content thoroughly comparing to other &quot;quantitative&quot; courses.<br /><br />*You have to attend all tutorials (once every 2 weeks) to get full participation.",
            "comment_teaching": "Dr. NAM delivers all lectures in English in Hong Kong accent. Local students may find it quite easy to follow. His pace is a bit slow but as all lectures will be recorded, you can in fact skip all the lectures and watch the lecture videos in 1.25x or 1.5x to find the pace that suits you.<br />There are also remedial lectures which are delivered in Cantonese and Mandarin. Students who get lost in lectures can attend those remedial lectures to deepen their understanding of the topic taught that week. (Remedial lectures will also be recorded)",
            "comment_grading": "Mean should be B/B+<br />Quiz 1:14/16 (Mean around 11)<br />Quiz 2: 14/16<br />Final Essay: Not announced<br />Tutorials: Attended all<br />3 Online Discussions: 1 original post and about 5-7 responses for every topic.<br />Turns out A",
            "comment_workload": "A bit heavy if you are a perfectionist. <br />Lectures: 2 In-class quizzes (notes content), 3 Online Discussions and 1 piece of Final Essay (choose 1 among 3 essay prompts and MUST apply ethical principles taught in lectures).<br />**Assigned readings will not be tested in quizzes. Only as additional materials and supporting reference for final essay.<br />Tutorials: Pre-class and post-class assignments on Canvas for every tutorial.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "co1GjKj6YbAXBx3mSMORpFlCBlFYB2wA",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Kelvin_cheng",
            "date": "Jan 22, 2020",
            "title": "",
            "comment_content": "Introduction: General overview of the course and topics to<br />be covered, with brief mention of the assessments and expectations.<br /><br />2a Moral Conflict:<br />Western Ethics I Utility in Utilitarianism<br />2b Moral Conflict:<br />Western Ethics II Categorical Imperative in Kantianism<br />2c Moral Conflict:<br />Chinese Philosophy I Moral Feeling in Confucianism<br />2d Moral Conflict:<br />Chinese Philosophy II Inclusive Care in Mohism<br /><br />3 Week 5 or 6<br />Dissolving the Moral<br />Conflict Rationale of dissolving moral conflict in the <br />thought of Daoism<br /><br />4a Destiny I<br />The Concept of Tian (天) and the Concept Ming (命)<br /><br />4b Destiny II The Distinction between Righteousness and<br />Destiny in the Thought of Mencius<br /><br />5a Well-being I Self-establishment and Detachment of<br />Zhuangzi<br /><br />5b Well-being II Well-being II: The Life of a Man of Virtue",
            "comment_teaching": "You will find the course interesting if you are not resist to learn difficult chinese culture concepts, or if you already knew those concepts.",
            "comment_grading": "The grading heavily depends on the performance of the final essay, which counts 50% of the course grade. Also, about 30% of the minor assessments are related to the final essay. So it is rational to say 80% of your course grade is base on your writing skill.<br />The quiz counts for 20% and it is easy if you attend all the lectures.",
            "comment_workload": "The workload is light, all you need is to finish the online discussion on time and attend all the workshops. Good luck with your final essay.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0SIuY3y6Zl9L4AQfmvx6WLjab7udZ9fu",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                },
                {
                    "id": 1231,
                    "name": "SAMPSON, Nicholas",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ampmma",
            "date": "Jan 15, 2020",
            "title": "",
            "comment_content": "Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian (天) and Ming (命)<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi",
            "comment_teaching": "Skipped all lectures but Mr Sampson is extremely nice. He gave a lot of useful comment on the essay writing.",
            "comment_grading": "I skipped about half of the online sections (I didn't know before) and I skipped one discussion as well. But i got a B- so I guess it's pretty nice",
            "comment_workload": "The workload is quite heavy. A lot of online assignments and discussion as well as in-class quiz. Also, the course required full attendance for the tutorial and have to prepare beforehand.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "py4ljjDvE0OHwtH1QUUSnKjIc1NEC8Zz",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "raylam",
            "date": "Aug 22, 2019",
            "title": "",
            "comment_content": "The main topic is morality.<br />Not very difficult.<br />You don't really need to attend lecture since there are lecture videos and it does not count attendance.<br />But you must watch the videos or attend the lectures since some questions in the quizzes are based on the lecture content.",
            "comment_teaching": "Actually the tutorial is useless and boring but it does count attendance, so you must attend.<br />And the lecture is quite interesting, but I have just attended the first lecture as there are lecture videos.",
            "comment_grading": "fair enough. <br />Not as good as people said.<br />I got 0.7sd above the mean in both quizzes.<br />Grade of the writing is unknown.<br />And I got a B.",
            "comment_workload": "Not very large.<br />You can easily deal with it if you can mange your time well. Only two quizzes and 1 writing which requires 1000 words.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YavcZao2IVQ6LK0Xu2Eoow5tQ2hpiIt4",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hito",
            "date": "Aug 22, 2019",
            "title": "",
            "comment_content": "I think most of the contents are common sense and easy to understand.",
            "comment_teaching": "Dr Nam is a humorous professor who loves to make a job. He loves to explain the concept with a lots of examples.",
            "comment_grading": "The grading is good. I attend all the writing workshops and finish all the online discussion, ends up with A-. Do take some time to finish your essay writing because it contributes 50% of your final grade.",
            "comment_workload": "The workload is a bit heavy comapring with another common course. You need to finish a 900-words essay. There are also writing workshops, online discussion and assignment and two quizzes.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IzuTrvyqtiRRKw41xW9q4Dec937TJyOv",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anniemichelle",
            "date": "Aug 21, 2019",
            "title": "",
            "comment_content": "Quite understandable, talks about different deep meanings and relationship between the concepts of righteousness, destiny and well-being, which demonstrates the dialectical characteristic of philosophy of life in both Classical Confucianism and Classical Daoism.",
            "comment_teaching": "Did not attend lecture, but it provides lecture videos.<br />Dr Nam is very nice and willing to help, you can contact him for suggestions on essay.",
            "comment_grading": "Quite good, got full mark in quizzes and full attendance, normal essay I guess, turns out is A.",
            "comment_workload": "Two quizzes, remember must attend tutorials as one lesson worth for 2% of whole course grade. Workload is not heavy but you have to be on time and check the schedule frequently. Essay is very important so make sure your essay matches with your tutor's taste.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eGWTXYJnaiaILoYYtTTff8yrMnz8YGKe",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                },
                {
                    "id": 1231,
                    "name": "SAMPSON, Nicholas",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kg",
            "date": "Aug 20, 2019",
            "title": "",
            "comment_content": "Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian and Ming<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi",
            "comment_teaching": "Dr Nam is very nice and engages students in class. He often uses funny real-life examples to explain vague philosophy concepts. All lectures are recorded and no attendance is taken so you do not have to attend the classes. <br /><br />It is important to register for a meeting with Dr Nam when you are writing your essay to make sure you are on the right track. His advice is very helpful and he will help you organize your arguments.",
            "comment_grading": "Essay 50%<br />There are 3 essay prompts to choose from. You will work on this 1000-word essay the entire semester, so choose wisely! Your workshop instructors are actually lang tutors, so they will be strict on the format of your essay. Each sentence of your essay should have its purpose. (Details will be taught in your workshop)<br /><br />Online Discussions 10%<br />There are 3 Canvas discussion topics over the semester. They are usually ethical dilemmas and you just have to apply the theories learnt in class to state your views. You should also reply to a few classmates' comments. Everyone writes a lot, but both Dr Nam and Perseus keep emphasizing you shouldn't write that much. <br /><br />Writing Workshops 20%<br />There are 5 workshops in total, each with an online and a classroom component. The online section comprises of short videos and quizzes with unlimited attempts on Canvas. The classroom section is a recap of the online content. The instructor will talk about different parts of the essay and give you time for sharing advice among peers. Remember, attendance WILL be taken during workshops! So be sure to attend them!<br /><br />Quizzes 20%<br />There are 2 MC quizzes. The first one covers Module 2a, 2b and 2c, while the second one covers Module 2d, 4a, 4b and 5a. Each quiz had 16 questions. You can already gain the full 20% if the total score of your 2 quizzes is 27/32.",
            "comment_workload": "The workload during the semester is quite heavy. The online discussions takes quite a long time to complete as it is just like writing a mini essay. You also have to read other people's comments and reply to them. There are 5 workshops in total and you need to complete online quizzes and homework before and after each workshop (which usually is a writing task for one paragraph of your essay). There are also 2 quizzes. However, after you submit your essay, you can study for your other finals.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ksVSeOMzmH3y3vnw8EIZvu66jVCgHmd6",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                },
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 424,
                    "name": "YU, Anna Po Shan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "anonymoususer",
            "date": "Jul 11, 2019",
            "title": "Good grade though heavy workload",
            "comment_content": "Module 2a - Moral Conflict in Western Ethics I: Principal of Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Moral feeling in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian and Ming<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Menicus<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi",
            "comment_teaching": "Frankly speaking, I cannot comment too much on the teaching as I did not attend most of the lectures. However, I do think Dr. Nam gives interesting lectures and explains the philosophical concepts quite well. As for the instructor of the tutorial, I think she teaches fairly.",
            "comment_grading": "Good grade. My final grade is an A with classroom activities part full and quiz full, essay should be good.<br />As long as you reply to the discussions timely and in adequate length, selectively attend lectures before the quiz and get full marks for the quiz part, book office hour of Dr. Nam to write better essay, then you can get an A range. The median is B+ which is very good.",
            "comment_workload": "Heavy workload.<br />Attending lectures is not compulsory. You don't even have to watch the lecture videos as long as you read the powerpoint and understand the contents.<br />The main workload is from canvas discussions. You have to write about 500-700 words to reply to the discussion topic, plus keep replying others. Have to do the discussions throughout the semester and this is quite demanding.<br />Writing the final essay of 1000 words is not difficult and this can be done in a night. Just pick some moral concepts and elaborate and this will be fine.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xzMRIeV9o5O4I5mtbYpXRDeg5ESpHxjl",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "daydream4ever",
            "date": "Jul 09, 2019",
            "title": "An interesting course that makes me think deeper",
            "comment_content": "Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian (天) and Ming (命)<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi",
            "comment_teaching": "Dr Nam is a very nice person who gives constructive feedback even during individual essay consultations. His teachings have definitely made me understood the importance of being a critical thinker in whatever circumstances. <br />REMEMBER TO WATCH LECTURE VIDEOS EVEN IF YOU DON&quot;T ATTEND THE LESSON. Just fast-forward it and watch it when you have free time. Trust me, it's more interesting than reading a blank ppt.",
            "comment_grading": "Final grade: A-<br />Considering the little effort that I pay into it, I think this grade is fair for me. <br />Since I didn't skip any deadlines and completed online discussions regularly, I think you have to pay more effort on essay, since it contributes a lot to the final grade (50%）",
            "comment_workload": "Personally, I think having better English will definitely reduce the time and effort spent in this course. As mentioned from the prof. during the beginning of the semester, your ability to express ideas through English is very essential especially for this course, as you have to write an essay (approx 900-1100 words; similar to lang courses) and contribute to 3 online discussions (writing at least 3 reviews per discussion). For me, this is one of the most relaxing course given that I also learnt a lot throughout the course.<br />For the quiz, I don't think it's as easy as everyone mentioned during previous years. Quiz 1 is okay but quiz 2 is a bit challenging. <br />Also, be aware of those quiz questions asking 'According to what Dr Nam mentioned in class....'. Make sure you pay attention to what he said in class.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VczVVGOBFU4dHzGNM4OsR7SmSvrCwREW",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "whliam",
            "date": "Jul 08, 2019",
            "title": "",
            "comment_content": "Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian (天) and Ming (命)<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi",
            "comment_teaching": "Professor Nam is a really fun professor that can use interesting daily life examples to explain the theories in a well-organised way. I believe most of the students will find this course inspiring.",
            "comment_grading": "Writing Workshop Online Activities\t(10%): 9.231/10<br />Online Discussions\t(10%): 8/10<br />In-Class Quizzes\t(20%): 20/20<br />Writing Workshop Classroom Activities (10%): 10/10<br />Final Essay (50%): 42.708/50<br /><br />Final score is 89.939/100 (A-)",
            "comment_workload": "Really light for a 3-credit course, the two quizzes are quite straight forward and you just need to score 27/32 to get a full 20% of the final grade. The three online discussion are manageable. I met the minimum requirement (400-500 words comment on the topic and 5 replies to other students) suggested by the instructor only for the first two discussion but can still score 8 out of 10 for the Online Discussions. The essay is similar to the one you need to write in LANG1003, with more resources provided by the professor. For the writing workshop, you just need to attend them bi-weekly, each time an hour.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uXcqrsEcuErpFrW1F2ORqMns6sIJcBI8",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kevin KAI",
            "date": "Jun 15, 2019",
            "title": "STRONG RECOMMEDATION",
            "comment_content": "教古今中外嘅基本嘅哲學理論，頗有意思。<br />如果你係對哲學有興趣嘅人，呢個course你一定唔會覺得悶，我就覺得呢個course嘅野都幾有趣，打破其他人同我講HUMA SSC好悶嘅傳說。",
            "comment_teaching": "Dr Nam is one of the best teachers I have ever seen.<br />If I have some problems, I can find him freely and give me some super useful advice. One day I had problems in my final essay, I found him personally and i could not believe that he carefully and slowly read my essay and teach me how to change or improve my words and logics in details, including grammar mistakes and also some better words could be used. He is really&nbsp;&nbsp;good.<br />His class is so interesting. Although some people never attended his class, I have to admit that his class is not boring at all. I listen to his every lecture.",
            "comment_grading": "超好grade<br />grade係由 class performance, final essay, quiz, discussion組成<br />- class performance只需要參加兩星期一次嘅writing workshop同時定期完成workshop嘅功課以及online session（睇片）就可以滿分啦。<br />- quiz有兩個，每個quiz只考四至五個哲學理論，你只需要仔細仔細再仔細睇佢嘅ppt同時理解呢D哲學理論就得啦，唔會好辛苦。但係今個sem quiz嘅mean好高⋯⋯真係有D出乎意料<br />- online disscussion有三個，每次會比一個哲學案例叫你發表自己嘅看法同埋在其他人嘅看法下面寫comment。應該積極D參加都可以攞到好分數。<br />- Final essay佔比重60%。差唔多過左midterm期就開始要寫呢個，至於寫嘅格式同埋內容，都會係workshop同埋lecture手把手教你點樣寫，唔需要太過擔心。<br />- 我嘅情況。三個Online discussion我做的比較認真，我每次基本上第一日出topic就開始寫啦，跟住就隔四五日或者某時某刻得閒點開睇下人地嘅野寫下comment。 quiz做的唔算好，因為mean太高，我最終出來分數只得mean。class performance基本上有做到，除左一次miss左deadline跟住攞0分哈哈哈。final essay就跟佢格式寫，跟住得閒約下dr Nam傾一傾D理據同埋行文書寫改一改。<br />因為我只知道quiz同埋class performance嘅分數，都唔算特別高，其他我都唔知點，最終攞到A-，出乎意料，真的好grade。如果你想高分D，積極D寫online discussion同埋去同Dr Nam傾下essay比多D意見修改啦～",
            "comment_workload": "好多人話呢個course workload大但係我真真唔覺得喔。<br />每兩個星期，做online session同埋workshop嘅功課，D功課基本上係教你寫一段野，好快嘎唔使半個鐘，online session睇片做quiz咯，睇片都好短，唔睇影響唔大，D quiz可以無限次嘗試直到滿分，唔使擔心分數唔好，都係有做就滿分，每兩個星期耽誤你一個鐘到做呢D，唔算過分。<br />基本上每個月寫一次online discussion嘅essay，半個鐘至一個鐘搞定，寫comment你就得閒寫下得閒寫下就得啦，每次都唔會超過10分鐘。<br />final essay，一年就叫你好好寫呢篇essay。睇人，如果你斋寫就好容易，如果你想追求高分，你可以得閒約dr nam睇D意見，咁就要多D時間去修改咯。",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TQbM6aeXuuoWbBtuQ0XvK8kpvl2VyjWU",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yljng",
            "date": "Jun 12, 2019",
            "title": "Good course if you follow the deadlines closely",
            "comment_content": "Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian (天) and Ming (命)<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi",
            "comment_teaching": "Dr Nam tries hard to make the lectures enjoyable by cracking some jokes occasionally so that you would not be bored by the abstract philosophical ideas.<br /><br />No attendance is taken for lectures, you can choose to skip all of them as you can watch them back online, although I recommend attending as sometimes what he says in the lectures will be quizzed.",
            "comment_grading": "Quizzes (20%)<br />There are 2 multiple-choice quizzes, 16 questions each. If you get a total of 27/32 from the two quizzes, you would get full marks, getting all 20% of course grade<br /><br />One essay&nbsp;&nbsp;(50%)<br />3 essay prompts are given to you, choose one of them and write a 1000-word essay.<br /><br />Canvas online discussion (10%)<br />3 topics would be posted on Canvas throughout the semester. <br /><br />Writing workshops:<br />Online content(10%) :Complete the online quizzes in&nbsp;&nbsp;Canvas, it includes some videos teaching you some writing skills that could help you write your final essay.<br /><br />Classroom sessions (10%):Attendances are taken You will be marked absent if you are late for more than 15 minutes.",
            "comment_workload": "The two in-class quizzes are very easy, if you pay attention in the lectures, you need not study at all. <br /><br />The essay is also manageable since the workload is spread across the whole semester. Basically you will be completing a part of it for each writing workshop.<br /><br />The online discussions are the heaviest workload to me, it is very time-consuming as you need to post your own ideas and response to others' posts regularly.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qiO6i6LuzadVJrQUuvtv3Z2kpShTDxXH",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "puddypie",
            "date": "Jun 06, 2019",
            "title": "Would Recommend!",
            "comment_content": "Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian (天) and Ming (命)<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi<br /><br />The first half focuses on Western Philosophy whereas the second half focuses on Chinese Philosophy. I personally really enjoyed learning the course and it really stimulated my thinking. Might even consider taking HUMA as my minor because of this.",
            "comment_teaching": "I personally never attended any of his lectures, so that's one of the perks of this class as there is no attendance required. <br /><br />Do take note though that Dr Nam would test you some of the contents based on his personal opinion, so the best studying method is to breeze through the lecture videos and take notes at an increased speed. <br /><br />I enjoyed the power points as most of the relevant materials are covered and it was fairly intriguing to me.",
            "comment_grading": "ONLINE DISCUSSION 10%<br />3 discussion topics that relate to some extent to the learning materials covered. Tip to getting a good grade is simply to be proactive - be the first few to post, like other people's comments and reply over a span of time. What I do is set a reminder to reply every 2 days. <br /><br />WRITING WORKSHOP (ONLINE + CLASSROOM) 20%<br />Very simple task. Once you get the online task just do it all in one go, as there are unlimited tries and it is unlocked. I was complacent and did not complete the last section, completely forgotten about it and was punished afterwards. Don't follow my footsteps and just complete it immediately. <br />Classroom, you just have to turn up 5 times a semester. very simple. Dont even have to talk just attend. I found the sessions quite pointless as I am an international student that wrote tons of essays before, but for those without a firm background maybe you should take note. <br /><br />ESSAY 50%<br />You are given 3 different topics, you choose 1 and you write the single essay over the entire semester. Sounds fairly simple. The marking criteria is straightforward: Content, Language, Organisation and Feedback. Feedback is an instant 25% if you change what the TA told you to do. To be frank the TA has so much essay to mark they don't even remember what you wrote so just follow suit. <br /><br />My Grade: <br />* Disclaimer: the course is not as transparent as we expected so I don't really know what are some of my scores * <br />Quiz (20%) : 19.5/20<br />Classroom (10%) : 10%<br />Online Quiz (10%) : 7.6% <br />Essay: Unknown but judging from feedback done fairly well <br />Discussion: Unknown but quite proactive <br /><br />Final Grade : A <br /><br />Good Grade Course",
            "comment_workload": "Subjective but for me it was fairly simple. <br />A single essay for the whole semester? Yes.<br />Online quiz with unlimited tries? Yes.<br />Attending a workshop 5 times a semester? Yes.<br />No Attendance. Simple Quizzes. <br /><br />The most overwhelming part was the discussion but relatively to other courses, I'll just take it.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "S1NNssFbhLMOcERxnaD0pSwmpYDqpDH3",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KKKKS",
            "date": "May 29, 2019",
            "title": "",
            "comment_content": "-Utility in Utilitarianism<br />-Categorical Imperative in Kantianism<br />-Uprightness in Confucianism<br />-Impartiality in Mohism<br />-Rationale of dissolving moral conflict in the thought of Daoism<br />-The Concept of Tian (天) and the Concept Ming (命) in Zhuangzi<br />-The Distinction between Righteousness and Destiny in the Thought of Mencius<br />-Self-establishment and Detachment of Zhuangzi<br />-Well-being II: The Life of a Man of Virtue",
            "comment_teaching": "Funny professor with jokes.<br />Local students will probably find him very interesting.<br />Examples are used to explain some concepts.",
            "comment_grading": "Quizzes: Both 14/16<br />Discussions:Unknown<br />Workshops: All attended<br />Essay:Unknown<br />Final Grade: A-",
            "comment_workload": "1. Two in-class quizzes (MCs) 20%<br />2. Writing workshops-online content 10% <br />3. Canvas online discussions x 3 10%<br />4. Writing workshop –five<br />classroom sessions(attendance required) 10%<br />5. Term essay 50%<br /><br />*No attendance for lectures",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2F9TYsLHw4VvxdNodySbHYW5wN9BVs8K",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                },
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "paulmill",
            "date": "Apr 22, 2019",
            "title": "good course",
            "comment_content": "The content are boring but it is not difficult to understand if you attend all lessons.<br /><br />Here is the list of the course content<br />1. utilitarianism <br />2. kantianism<br />3. confucianism<br />4. inclusive care of mohism<br />5. daoism<br />6. tian(天）&amp; ming(命）<br />7. zhuangzi",
            "comment_teaching": "Dr Nam is a funny person! He would make jokes in the class and share some opinion towards the thoughts.",
            "comment_grading": "The grading is good if you do all the discussion from Canvas and put some time on your final essay. I finally got A- in the section",
            "comment_workload": "It is a bit hard, especially we are required to do three discussions in Canvas during the semester. Everytime I post my views on the discussion board with at least 500 words. Also, there are two quizzes in the lecture time but it is not difficult to aim full marks because 27 out of 32 totally for two quizzes will got a full mark for the quiz section.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kKDPF3ODqmDBgCuyqug9ORedQUF11066",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "仁和",
            "date": "Apr 17, 2019",
            "title": "",
            "comment_content": "interesting insights on Chinese and Western philosophy from the instructor",
            "comment_teaching": "best professor ever!!!<br />at first i was not used to his cantonese style english, but step by step i get used to it and made a lot of notes <br />very nice and patient!<br />give recaps in cantonese and mandarin every topic(and a bit different from the lecture) worthwhile attending!<br />(and he likes one piece!!!)",
            "comment_grading": "if you work hard for online discussion, essay and prepare for quiz, the worst grade for you is A!!!<br />the quiz is really based on what he teaches and quite easy.<br />reply to the online discussion and spend time on it!!!<br />go to his office hour and ask for advice for the essay.",
            "comment_workload": "quite heavy... <br />the topics of online discussions are not easy...<br />essay also need some deliberation<br />and the readings are not required, which is lovely...",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GQXrWc5v9VoHVUkvwZsjOrkiPfU1OU5K",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                },
                {
                    "id": 302,
                    "name": "HO, Susanna Pui San",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DoVaKeitH",
            "date": "Jan 31, 2019",
            "title": "Good grade course but a little bit heavy workload",
            "comment_content": "Module 1: Introduction<br />Module 2: Utilitarianism<br />Module 3: Kantianism<br />Module 4: Confucianism<br />Module 5: Mohism<br />Module 6: Daoism<br />Module 7: Destiny, Concept of Tian and Ming.<br />Module 8: Righteousness and Destiny from Mencius<br />Module 9: Well-being of Zhuangzi.<br /><br />The contents are quite interesting so I have attended every lecture.",
            "comment_teaching": "Dr.Nam always prepare something interesting in the ppts to let you study this course in a happier way.",
            "comment_grading": "20% for 2 in-class quizzes<br />The quizzes are not difficult at all. Just be careful and should be able to get this 20%<br /><br />10% for online discussion<br />There will be 3 topics that you need to discuss with other students on canvas. You may need to write about 300-400 words for your first opinion and give comments on others' opinions.<br /><br />20% for writing workshops<br />You need to attend all writing workshops and do all the online assignment on canvas before the classes in order to get this 20%<br /><br />50% for final essay<br />You will choose your topic from the beginning or middle of the course and then start to plan and write your essay with the help of the writing workshops.<br /><br />I got 20% from quizzes and 20%from writing workshop. I did not know the score of my final essay and online discussion but my final grade is A. I think that this is a good grade course.",
            "comment_workload": "I would say that the workload is a little bit heavy since you need to study for the quizzes, attend all the writing workshops and do all online assignment, have online discussions and write your final essay.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4lb1ZpdHMEQsBLpXPxfZ2Z9wZhvH0hk7",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ykyk01",
            "date": "Jan 21, 2019",
            "title": "Efforts paid out",
            "comment_content": "Utilitarianism <br />Kantianism <br />Confuciusim <br />Mohisim <br />Tian and Ming etc",
            "comment_teaching": "Dr Nam’s English is understandable somehow... he speaks Cnaton-English and always tells Cantonese jokes. I think it is somehow important to attend his lecture since some of the contents he taught in class were not included in the ppt slides. And those contents would also be tested in the quizzes <br />Reading the reading materials will also help you understand each chapter, quite useful indeed.",
            "comment_grading": "Grading is quite fair. <br />Online discussion 6.5/10<br />Writing workshops 20/20 <br />Quizzes 20/20<br />Essay 42.71/50 <br />A-",
            "comment_workload": "Asssigments are all across the whole semester <br />**Do check out the deadlines for online workshops and online discussions. Make few appointments with the prof. is so useful for getting a good grade for the essay as the essay takes up a large proportion of the final grade.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WljJhGLBILy0jQ4dUW48YwrC6dYaCkdA",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "dorischen",
            "date": "Jan 20, 2019",
            "title": "",
            "comment_content": "Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian (天) and Ming (命)<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi",
            "comment_teaching": "Dr. Nam always manages to keep the mood up during his lectures, engaging the students with various classroom activities (including iPRS, no attendance though). He does not rely too much on the PowerPoint, so it is recommended that you attend the lectures to get a better picture of what is being taught",
            "comment_grading": "ONLINE DISCUSSION 10%<br />3 discussion topics were given sequentially over the semester, we had to put forward our opinions and actively contribute to the discussion using Canvas. <br /><br />WRITING WORKSHOP (ONLINE + CLASSROOM) 20%<br />There are 5 workshops in total, each with an online and a classroom component. The online section comprises of short videos and quizzes on Canvas. The classroom section essentially recaps the online content, with the opportunity to receive feedback from the instructor and critique other students' essay-in-progress. The online mark can be earned by completing quizzes and submitting assignments on-time, while the classroom mark is earned simply by attending the workshop <br /><br />ESSAY 50%<br />3 essay prompts (topics) will be released at the start of the semester. Choose 1 and write approximately 1,000 words. If you complete all of the writing workshop assignments on-time, the workload will be spread more evenly across the semester, as these assignments are basically part of your essay. One of the four marking criteria for the essay is how well you respond to the feedback from the writing workshop instructor. If you do this properly (which is relatively easy), 12.5% of the course grade will be yours.<br /><br />QUIZZES 20%<br />2 multiple-choice quizzes: the first one covers Module 2a, 2b and 2c, while the second one covers Module 2d, 4a, 4b and 5a. This semester, a different system was used: each quiz had 16 questions, with a correct answer yielding 0.75%",
            "comment_workload": "large including quizzes workshop ,online discussion and essay",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aSO2CPrxBB7U5uXK0I1O7B9VAUSTrwv3",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 302,
                    "name": "HO, Susanna Pui San",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lamlamlam",
            "date": "Jan 18, 2019",
            "title": "Easy to get B range but hard to attain A range",
            "comment_content": "I didn't attend 90% of the lectures as the professor told us that lectures are not required in the first lesson. But you have to attend two lectures which involve in-class MC quiz as each quiz takes up 10% of the total grade. It's not difficult if you spend one night before the quiz to study. I didn't spend much time to study the quizzes so my scores are a bit below mean but those MC questions are not that difficult. Ans, you have to attend all the five tutorial lessons and finish all the online tasks which are all MCs on time. Online discussions are also required and you have to write as much as possible if you really want to get good marks for this part. (basically more than 500 words for each topic, total 3 topics). At last, the term essay accounts for 50% of the total grade so it's the most important.",
            "comment_teaching": "My tutor for the tutorial lesson is really nice. Her name is Susanna and she's willing to answer all of my questions. As I mentioned, I seldom attended lectures so I don't know how's the teaching of the professor.",
            "comment_grading": "Online Discussions\t10% (Me: 6.5/10)<br />Writing Workshop Online Activities\t10% (Me: 10/10)<br />Quizzes\t20% (Me: 15.75/20 Mean:18.1)<br />Writing Workshop Classroom Activities\t10% (Me:10/10)<br />Final Essay\t50% (Me: 41.67/50)<br />Total\t100% (83.92/100)<br />Final Grade: B+<br /><br />I think it's fair.",
            "comment_workload": "You have to use concepts learned from lectures and powerpoints to write a short essay to respond to the discussion topic. Also, you have to reply to others' opinions and give constructive opinions back to them. Submitting replies within the last 24 hours before the deadline will suffer from mark deduction, so you have to hand in your work as soon as possible. I think for some discussion topics I wrote over 1000 words, so the workload wasn't that light.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "7wHn0eBAeut1VBcstWaX7ZrWxk7AtpkX",
                    "name": "HUMA1000B Fall 2018 Course Outline-1",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "EYxZKjTgrqfQIeM0BQsvsYZ6KIEZlTIJ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SomeoneInUST2",
            "date": "Jan 15, 2019",
            "title": "Good Instructor Not so good grade",
            "comment_content": "The content is Lecture (Once-a-week) + Tutorial (Once every other week) <br /><br />◼Lecture: <br />The courses mainly talk about different Classic Chinese philosophies like Confucianism, Kantism, Mohism.... <br /><br />Dr. Nam focuses on delivering the critiques he has for each of them.. <br /><br />You can refer to HUMA@UST website for syllabus and more details. <br /><br />Not so interesting for me but highly recommended for those who loved to reflect on themselves &amp; love discussing philosophies : )<br /><br />◼Tutorials: <br />Also, each student is assigned to a timeslot for tutorial once every two weeks, ten students per timeslot. The tutorials aim to improve writing skills (which I did not find it soo useful...) but my TA is handsome which compensate for the boring content...? The TA will provide some feedback for your drafted essay as well. <br /><br />Mostly group work. Most of the time groupmates and I taunt on the boring lecture content lol.",
            "comment_teaching": "Dr.Nam is nice but he always spends time talking something else (life examples/ stories) that take up much of the lecture time. However, he holds extra illustrations sessions in both Cantonese and Mandarin which are highly useful. Strong suggest to go for those sessions even if you do not want to attend the lectures. <br /><br />And, the length of the lecture is two-hours, relatively long compared to the regular lectures, so need to concentrate more. The time in Fall 2018-2019 is Tuesday, 13:30-15:30, sleepy...&amp; hungry.... (but definitely not the Dr.Nam's fault lol)",
            "comment_grading": "I am not sure how the TAs grade the course because they do not release the most important component to your final grade (i.e. online discussion score, final essay grade...). (It's Jan.15th and they are not still on Canvas. I think they will never be.... :(<br /><br />I did poor on the two quizzes in class (both below mean for 1sd) but I received highly positive feedback regarding my draft essay. However, I still get a B. <br /><br />I think the key to score a high score is <br />1. Complete all the online materials on time !<br />2. Initiate the online discussion and actively participate and respond to each other<br />3. Familiarize with the content on Powerpoint and score good on both quizzes<br />4. Good Final Essay<br />5. Attend the Cantonese/ Mandarin explanation session.",
            "comment_workload": "Nearly no workload in fact. Just need to complete some online reading/learning before each tutorial and a final essay&nbsp;&nbsp;around 1000 words.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "u3ZVCBaZ9kVap0kcxZg7nbGVzDvfkjXJ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "maboi",
            "date": "Jan 02, 2019",
            "title": "GOOD GRADE COURSE",
            "comment_content": "Easy to follow, just read through the ppts and listen to Dr.Nam's lectures then it will be fine. Some of the content are covered in the quizes and those are the only modules that you will have to pay attention to. <br /><br />Module 1: Introduction<br />Module 2a: Utility in Utilitarianism<br />Module 2b: Categorical Imperative in Kantianism<br />Module 2c: Uprightness in Confucianism<br />Module 2d: Impartiality in Mohism<br />Module 3: Rationale of dissolving moral conflict in the thought of Daoism<br />Module 4: The Concept of Tian (天) and the Concept Ming (命) in Zhuangzi<br />Module 4b: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a: Self-establishment and Detachment of Zhuangzi<br />Module 5b: Well-being II: The Life of a Man of Virtue",
            "comment_teaching": "Dr.Nam's lectures are interesting and you can watch them back online, so it's okay to not attend all of the lectures. But you will have to attend all the workshops, which teaches you how to write your final essay.",
            "comment_grading": "10% Workshop materials<br />10% Attendance<br />10% Online discussion<br />20% Quiz (Quiz 1 + Quiz 2)<br />50% Final essay<br /><br />The emphasis is really on the quiz and the final essay.",
            "comment_workload": "To be honest, the whole semester is packed with HUMA stuff. But I think it is not that hard to fulfill what the course requires. But get prepared to be slightly busy for the upcoming semester.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xny1ARbtZKgCgP9Cvo1FowYFZGf0hu1e",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "imkaaa",
            "date": "Dec 23, 2018",
            "title": "",
            "comment_content": "This course includes the discussion of both western and Chinese moral ethics and philosophy,for instance Utilitarianism ,Kantianism ,Confucianism and Mohizm. Even though you know nothing about philosophy you can still take this course to have a taste of it,quite interesting overall.<br /><br />Module 1:Introduction<br />Module 2a:Utility in Utilitarianism<br />Module 2b:Categorical Imperative in Kantianism<br />Module 2c:Uprightness in Confucianism<br />Module 2d:Impartiality in Mohism<br />Module 3:Rationale of dissolving moral conflict in the thought of Daoism<br />Module 4:The Concept of Tian (天) and the Concept Ming (命) in Zhuangzi<br />Module 4b:The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a:Self-establishment and Detachment of Zhuangzi<br />Module 5b:Well-being II: The Life of a Man of Virtue",
            "comment_teaching": "Dr Nam is very nice, he always tries to make jokes in the lectures.Also,he used many practical examples in daily life to illustrate some abstract concepts in philosophy.Although his pronounciation is not good,as a local student I think it is still understandable. Also,he is always willing to answer your questions and even arranged some recap sessions for those who skipped the lectures.",
            "comment_grading": "Two in-class quizzes (10% each) <br />One essay(50%)<br />Canvas online discussions(10%):Discuss your stance to certain issues or topics posted on Canvas.You are required to include others viewpoints in your response and to comment on other students opinion.<br />Writing workshops:<br />online content(10%) :Complete the online workshops that posted on Canvas,it includes some video teaching the writing skills used for your final essay.<br />classroom sessions(10%):Attendances are taken for the tutorial sessions.You will be marked absent if late for more than 15 minutes.",
            "comment_workload": "Those quizzes are quite easy,the means are high ,and just study the PowerPoint is enough. <br /><br />Online discussion should be the most time-consuming task as you are also required to response to others’ comments.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7Nw4SozqArccB1NpMmGz93u8deEBNgTF",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ronney",
            "date": "Aug 03, 2018",
            "title": "",
            "comment_content": "About chinese and western philosohpy and culture stuff. Many slides and reading materials, but not necessarily to read them, just revise those are coverd in two quiz, and that are not difficult. Quite interesting. If you have studied any philosohpy before, that will be a benefit.",
            "comment_teaching": "Dr. Nam's English is quite localized, i guess some of the foreign students can't even understand what was he talking about, but local student will be amused by his broken gag. You can actually skip all the lectures and just only attend two quizes section.",
            "comment_grading": "The essay occupy 50% of whole subject,which is very important. I think the grading is quite good in this subject.<br />You should focus on the language of the essay, if you have good language skill that will be a benefit on this subject. The online discussion have the lowest CP to pay effort, because it has a relatively lower percentage comparing with the others.",
            "comment_workload": "Although you don't need to attend the lectures, the workload is quite heavy, online discussion, quiz ,writing workshop, essay writing, online seciton before workshop.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nKMXM7Rj3Wld4WJtyowFZACmvpYEt4SR",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cheryl0411",
            "date": "Jan 23, 2018",
            "title": "",
            "comment_content": "Lectures cover different topics of Chinese and Western cultures and values.<br />Contents are quite interesting and are useful for the essay. Many reading materials but not necessary to read it.",
            "comment_teaching": "Dr. Nam is nice and likes joking. He has arranged some optional lectures for students who want to know more and counsel for their essay. However I skipped many lessons and no more comment on teaching.",
            "comment_grading": "Gooddddd if you follow all instructions and comments and like writing<br />2 Quizzes, online discussion, online workshops, tutorials, essay. Essay is 50% of the total grade<br />I got only 7/20, 10/20 in two quizzes, and my essay was not good compared to other. <br />but finally I got A-",
            "comment_workload": "For me, it is very heavy. Online discussion, online workshop exercises, quiz, etc... Online workshop",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NGY7WDjUDOa3GQz4J9DmThD1ZDE7Fsw2",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                },
                {
                    "id": 302,
                    "name": "HO, Susanna Pui San",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Amy Tsang",
            "date": "Jan 22, 2018",
            "title": "Good grade course but heavy workload",
            "comment_content": "The content is interesting. Many PRS but not count in grading. Teachers are very very very nice!!!",
            "comment_teaching": "Teachers are very very very nice! Dr. Nam will offer some optional cantonese and putonghua tutorials for students who do not understand the content in lesson. Though the essay topics are quite difficult, Dr. Nam is so generous that he is always willing to give us directions and ideas.",
            "comment_grading": "Very good grading if you follow all the steps and instructions (especially for the final essay, MUST respond all the comments to your draft essay given by the tutor in your final essay. )<br />The 2 in-class quizzes are not difficult as long as you read all the powerpoint! I ignore all the required readings but still can get a good result.<br />BTW, attendance only counts in the tutorials.",
            "comment_workload": "4 online essays + frequent responses in Canvas and 1 final essay<br />Not much workload if you like writing essays.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "faHbWQVOBZYcHVM3fEpD5mGcCIlFkTKa",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "uo3626",
            "date": "Jan 13, 2018",
            "title": "Bad lecturing, heavy workload in the first half of semester, good grading",
            "comment_content": "Lecture contents cover different topics and not badly design - from morality to destiny. Contents are interesting for people who love to think about these abstract stuffs. But sometimes topics are quite mixed together and hard to follow.",
            "comment_teaching": "Very bad english... Very hard to understand even when I am from Hong Kong too... I feel sorry for the internationals in the lecture hall cause I don't think they even get half of what the professor says in lecture... Professor always tries to be funny but failed... But he teaches very well out of lecture when he held extra tutorial sessions.",
            "comment_grading": "Quiz x2 - 20% not hard questions, just 1-2 tricky ones<br />Online discussion - 10% time-consuming, because u need to give long replies, but you can blow water<br />Online workshops - 10% nothing special to do during classroom sessions, just sit and listen<br />Classroom workshops - 10% very easy, limited tries to get correct answers<br />Essay - 50% Good if you are good at essay writing.",
            "comment_workload": "Deadlines of different assessments (online discussion, quiz and so) comes one after another... Workload is heavy in the first half of the semester. You need to watch out for the deadline of the online workshop, and discussion, discussion you need maybe a few hours to finish. The quiz carries only 10% each but need you to read through many slides. The classroom workshops require you to finish the draft of the essay very early. But in the last month you don't have much to do. And no exam during final period.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WKH48YOtCxnBNLlRCYsCxsBVrCu5jRfy",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "zyyzyyzyy",
            "date": "Jan 11, 2018",
            "title": "超好grade, really good",
            "comment_content": "Just follow the instruction of the course.<br />Learning concepts about the Chinese and Western philosophy.<br />Not hard for local/mainland student to understand.",
            "comment_teaching": "Prof. Nam is a really good professor.<br />As a local student, it is easy to understand his jokes and slangs.<br />He is really responsible. He even arranged optional review classes in both Cantonese and Mandarin.<br />Basically, attend these optional classes, you may catch up the content in the lectures.",
            "comment_grading": "Excellent.<br />Two quizzes and one essay.<br />For quizzes, I got 15/20 in both of them, not that high, but above mean.<br />For the essay, to be honest, I am not that good.<br />I just got 3 in DSE writing paper :)<br /><br />But I still got A- <br />soooooo surprise<br />I think I can only get B/B+",
            "comment_workload": "For quizzes, just remember everything on the ppt.<br />I don't take a lot of time to revise the content.<br /><br />For the essay, I read the past essay, and follow the inquiries of both prof and tutor. In my opinion, English proficiency is not that important, but maybe your idea?",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BMfdMrGA79xSn3RXQeDhLqh6dLkE3drA",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 302,
                    "name": "HO, Susanna Pui San",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Brian.ust",
            "date": "Dec 29, 2017",
            "title": "A course with traditional Chinese and Western culture",
            "comment_content": "Lectures cover wide range of Chinese and Western culture and values including Utilitarianism, Kantianism, Mohism, Confucianism, Daoism, destiny and well-beings. Majority of the topics will be tested on quizzes and only one concept out of Utilitarianism, Kantianism, Mohism, Confucianism is required to appear in your essay and you can find some useful points on Dr Nam's recommended readings.",
            "comment_teaching": "Dr Nam managed to deliver his powerpoint slides with some real-life examples which helps me understand some difficult terms and theories. However, his English has a large room for improvement which you need extra attention on his class since some questions in the quiz will be disclosed on lectures. Dr Susanna Ho and Dr Nam both spent extra time for consultation on the 1000-word essay, which one should realize what they ask for and how one can improve from the draft essay. The teaching on lectures was a bit not understandable but both quizzes only test your memory of the exact wordings in the ppt. However, the teaching on the tutorial is essential for you to write the essay smoothly and attendance and some little practices on Canvas are required.",
            "comment_grading": "The grading is not really transparent. Only scores of the two quizzes will be disclosed while both the score for canvas discussion and essay will not be disclosed. But one obvious thing is that the essay must be the dominating part towards your grade.<br /><br />Score:<br />Quiz 1: 17/20 (Mean: 13.7)<br />Quiz 2: 15/20 (Mean: 14.7)<br /><br />Turn out A",
            "comment_workload": "Not Heavy. One two-hour class per week on theories by Dr Nam and one 50-minute tutorial class every two weeks by Dr Susanna Ho. <br />Percentage Allocation:<br />Canvas Discussion, two topics for each discussion, two discussions in total (10%)<br />Two Quizzes (Each 10%= 20%)<br />1000-word essay (50%)<br />Attendance for tutorials (10%)<br />Little Practice on Canvas for tutorial (10%)",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "IRw4AQVjMnxPoBkXabldGC5V158ZQIq0",
                    "name": "HUMA1000B Fall 2017 - Course Outline",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "iLBr0xN5Uc1hkwZAbKJkBzvWaDVbMnEy",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 1123,
                    "name": "WONG, Ka Sin",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Doug Stamper",
            "date": "Jun 11, 2020",
            "title": "Weird",
            "comment_content": "Mentioned above.<br />Generally speaking, if you are interested in it, it will be interesting.<br />The only sad thing about this course is, it doesn't seem encouraging to me in pursuing further. Guess that's a shame for humanity course",
            "comment_teaching": "The professor doesn't excel in English nor Mandarin. And this course presents itself in only 2 ways: English and Mandarin. This is proven problematic because effective communication is of the essence in disciplines not that rigorous, such as humanity.<br />The topics are fun but the teaching doesn't make one wanna go further.<br />If you are the person that come and go while expecting good grades, I don't think the content is well-designed for quizzes since professor's lectures center on answering studs' questions. And those questions usually can't help quizzes. I personally attended 90% of lectures and still averaged in quizzes. The reason is because knowing more doesn't nail quizzes. Quizzes require &quot;exact wordings&quot; copied from powerpoints, which is counter-intuitive most of the time.<br />If you are interested in this subject in the first place, the lecture helps. Yet, I argue it is limited. The lecture material centers on one and only one thing--answering questions. However, no extra material such as extra readings offered in Canvas are discussed. This is disappointing since the inherent nature of this course is simplicity. It isn't that hard for one to comprehend the content beforehand. Guess I am expecting too much from the lecture.<br /><br />Now, since 50% of this course is devoted to essay. There are 4 writing workshops.<br />These workshops are nothing but deplorable. <br />5 minutes consultation session on average per person. This is far from enough. The tutor do not come prepared in general. Yes, the workload for a 1-to-40 workshop is understandable. But you can extend it. Or do whatever you can. I simply can't see why is efficiency built at the expense on students.",
            "comment_grading": "Got 10 marks above the mean in course overall score. <br />Scored A- at the end.<br />Not bad.",
            "comment_workload": "Weekly quizzes are bizarre. You can complete quizzes on spot--even watching the lecture videos are optional since the quiz has no time limit and above all, investing time, for example, reading extra material, asking questions, may not nail the quizzes. Again, it's about exam skills. And nothing in this course trains this bit. So, you can literally do nothing and still do extremely good or bad.<br />The essay is, again, simple. <br />Let's save the trouble. Everything is simple. Just follow their schedule. Then you can enjoy your life.",
            "rating_content": 5,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZcjHHxUjrb1vqbcz4Wgg9GooM0LSTG4q",
            "semester": "2018-19 Spring",
            "instructors": [],
            "is_author": false,
            "author": "^.^",
            "date": "Jun 23, 2019",
            "title": "",
            "comment_content": "Humanities Topics on &quot;Righteousness&quot;, &quot;Destiny&quot;, &amp; &quot;Well-being&quot; are covered from the perspectives of classical Western &amp; Chinese philosophies.",
            "comment_teaching": "Blended Learning employed:<br />Lectures + Writing Workshop (with face-to-face class conducted by Language Instructor from CLE + e-Learning through Canvas)",
            "comment_grading": "(20%) In-Class Quiz *2<br /><br />(10%) Canvas Online Discussion *3<br />~ Refer to &quot;Workload&quot;<br /><br />(20%) Writing Workshop (Both Online + Classroom Session) *5<br />~ Refer to &quot;Teaching&quot;<br /><br />(50%) Final Essay<br />~ Refer to &quot;Workload&quot;",
            "comment_workload": "Online Discussion Topics will be uploaded on Canvas for open discussion.<br /><br />By the end of the semester, you are required to submit a Final Term Essay, in which you can choose one topic out of the three essay prompts given.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tvLRsA9gGkqzYeS15hibqoLycom9MjrV",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                },
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "penguin3220",
            "date": "Jun 17, 2019",
            "title": "一個幾好grade嘅HUMA Course",
            "comment_content": "Module 1 - Introduction<br />Module 2a - Moral Conflict in Western Ethics I: Utility in Utilitarianism<br />Module 2b - Moral Conflict in Western Ethics II: Categorical Imperative in Kantianism<br />Module 2c - Moral Conflict in Chinese Philosophy I: Uprightness in Confucianism<br />Module 2d - Moral Conflict in Chinese Philosophy II: Inclusive Care in Mohism<br />Module 3 - Dissolving the Moral Conflict: Rationale of Dissolving Moral Conflict in the Thought of Daoism<br />Module 4a - Destiny I: The Concept of Tian (天) and Ming (命)<br />Module 4b - Destiny II: The Distinction between Righteousness and Destiny in the Thought of Mencius<br />Module 5a - Well-being I: Self-establishment and Detachment of Zhuangzi<br /><br />望落好似幾難，但其實讀落都ok",
            "comment_teaching": "The lessons are quite boring, but Dr. Nam is one of the best professors I've ever met. Although he may not good at teaching big classes, you can ask him questions after class and he is willing to answer them explicitly. He also provides some extra lessons in Cantonese for some difficult topics so I could understand the content very well.",
            "comment_grading": "ONLINE DISCUSSION 10%<br />There are 3 discussions to do. It is quite time consuming and seems not worthy enough to spend that much time for just 10%. However, it does has a large effect on your final grade. (could be 2 sub-grades more or less)<br /><br />WRITING WORKSHOP (ONLINE + CLASSROOM) 20%<br />Everyone can get full marks once you finish all online quizzes (unlimited trials) and attend all tutorial lessons (隔個禮拜一次)<br /><br />ESSAY 50%<br />Spend more time on the essay, you can consult the professor before the essay submission. (He would provide some time slots for you to register)<br /><br />QUIZZES 20%<br />2 MC quizzes (not cumulative): each quiz has 16 questions, you can get 20% if you answer 27 questions correctly out of 32. The quizzes are not difficult, most of the students could get &gt;18% in the end.<br /><br />MY GRADE<br />Online Discussion: 6-7/10<br />Workshop: Full marks<br />Essay: 43.7/50<br />Quizzes: Full marks (Mean 18.15, S.D. 2.75)<br />Overall: &gt;90/100<br />Grade: A-",
            "comment_workload": "Things you have to do:<br />- Essay (1000 words)<br />- 3 Online Discussions<br />- Online Quizzes<br />- Tutorial Lessons<br /><br />如果你英文好，會比其他人讀得輕鬆d（Course description寫呢個Course ELPA需要有6，但個人認為ELPA Writing有5都夠）",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cQloii5VSnSIPyE6OPHJ0MylGyaun2po",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 327,
                    "name": "TSANG, Perseus",
                    "rating": 1
                },
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "卡斯",
            "date": "Jun 06, 2019",
            "title": "GOOD GRADE? Only if you get a good lang tutor",
            "comment_content": "The first half part is quite good and i learnt a lot from it",
            "comment_teaching": "Lecture and tutorial are extremely boring<br />You cant learn a lot from it as they only read the PPT",
            "comment_grading": "Not good as expected<br />I could get good grade in lang but my essay is not that good from my perspective.<br />If your tutor is a woman, please swap !!!!! (really troublesome and demanding)",
            "comment_workload": "Workload is ok for me if you get someone study with you.<br />The essay would be the thing with the highest workload",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZRhAUzva0M312mRLpwk05287AHPt9LI6",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "slchong",
            "date": "Jan 18, 2019",
            "title": "",
            "comment_content": "Interesting chinese and western ethics, explained with real life situations for better understanding. For me the second part about chinese tian ming is the most challenging. <br /><br />Topics:<br />- Utility in Utilitarianism<br />- Categorical Imperative in Kantianism<br />- Uprightness in Confucianism<br />- Impartiality in Mohism<br />- Dissolving the Moral Conflict<br />- Rationale of dissolving moral conflict in the thought of Daoism<br />- The Concept of Tian (天) and the Concept Ming (命) in Zhuangzi<br />- The Distinction between Righteousness and Destiny in the thought of Mencius<br />- Self-establishment and Detachment of Zhuangzi<br />- The Life of a Man of Virtue",
            "comment_teaching": "Pay attention to every detail on the ppt for in-class quizzes. Best to attend Dr. Nam's review session (for clearer concepts) and book his office hours essay consultation!",
            "comment_grading": "10% Online Discussions\t (shared within your tutorial group, you can wait and see how other's react and refer to their ideas)<br />10% Writing Workshop Online Activities<br />20% Quizzes (can be tricky, make sure to revise in depth)<br />10% Writing Workshop Classroom Activities (***attend as many tutorial as you can, so you can have the attendance mark and feedback on essay)<br />50% Final Essay",
            "comment_workload": "Heavy workload!! Make sure you plan enough time for the online/ in-class quizzes, three well constructed online discussions and one 900-1000 word essay. No midterm or final exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lXEV0YYPOMjeppcS70OPvaUaykQX2MkS",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hugochiu",
            "date": "Jan 24, 2022",
            "title": "",
            "comment_content": "Just choose one chapter that you are interested in, and try hard to make yourself be clear of the concept. Utilitarianism, Kantianism, Taoist...etc. Content are completely unrealistic in case you are not a student from HUMA school.",
            "comment_teaching": "I am not sure, as I didn't really attend the lecture. But it seems other classmates are quite enjoying his joke. But one thing is important is reserving a consultation with Dr. Nam. He would give very meaningful advice for your final essay.",
            "comment_grading": "Fair. I score 18/20 and 20/20 in two quizzes. And reply over 10 times for each consultation. Finally, scored an A-.",
            "comment_workload": "If you have attended every tutor session and followed their progress, it could be saying no workload at all. No revision is needed for the quiz as you just need a trustful friends.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VfCPDevoFCSCPCzp1e7Yjh3vaNNCi83y",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "幫哥",
            "date": "Jun 17, 2021",
            "title": "",
            "comment_content": "The content is interesting and teach how to have critical thinking by using different philosophy theories.",
            "comment_teaching": "Teaching is sometimes boring. However, he still tried to make his lecture funny. He will make additional zoom lectures for speaking&nbsp;&nbsp;Cantonese and Mandarin for those having insufficient English proficiency. That means he repeated three times of content per topic. This act is so respectable. Therefore, I will give him an A.",
            "comment_grading": "Actually, the grade is not that good as I heard before if you are a student with moderate ability in UST. You still need to work hard to obtain to get A range grade. <br /><br />My grade is A-",
            "comment_workload": "Having three canvas online discussions. It seems the workloads will be light. However, when every students are too serious and diligent to pursue good grade. They will write a lot on the&nbsp;&nbsp;online discussions and use numerous evidence from internet research to support their arguments. Therefore, the discussion environment urge you to work hard to write a lot of long essay during both three times of discussions<br /><br />Also, they have some weekly quizzes for each topic. However, the quizzes do not have any time limits that you could submit before you think they are the best answers.<br /><br />One final essay is needed, writing about 1000 words. There are various topics you could choose to write.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "I4qXFTsEEzRjr7jp5ZwS6Tn8u54MQmKU",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 765,
                    "name": "NAM, Sai Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hypetrain",
            "date": "Dec 28, 2022",
            "title": "Great course",
            "comment_content": "“At fifteen, I had my mind bent on learning. At thirty, I stood firm. At forty, I had no doubts. At fifty, I knew the Tianming (天命). At sixty, my ear was an obedient organ for the reception of truth. At seventy, I could follow what my heart desired, without transgressing what was right.” This is a self-reflection of Confucius. The improvement throughout his life, not only demonstrates the life of a man of virtue (junzi 君子), but also highlights the dialectical characteristic of Chinese philosophy. This characteristic can be shown by the correlation between righteousness, destiny and well-being.<br /><br />Lectures and readings will be (mainly) built upon selected texts of Chinese classics. Through studying the texts, students will reflect and explore the deep meanings and relationship between the concepts of righteousness, destiny and well-being, which demonstrate the dialectical characteristic of philosophy of life in both Classical Confucianism and Classical Daoism. For the concept of righteousness, moral conflict between Confucianism and Mohism will be explored, together with the idea of dissolving the distinction between right and wrong in Daoism. For the concept of destiny, the discussion will begin with the ideas of endeavor (li 力) and destiny (ming 命) in the Liezi, followed by possible replies from Mencius, Xunzi and Zhuangzi. As for the concept of well-being, the ultimate goals of the philosophy of life in Confucianism and Daoism will be discussed, and the possibility of obtaining well-being under the influence of destiny will be shown.<br /><br />Course highlights:<br /><br />3-credit HUMA common core course with no exam but one essay, Canvas online peer discussion, and two quizzes.<br />Learn how to convince others in writing.<br />Learn more about three specific values: “Righteousness”, “Destiny” and “Well-being”.<br /><br />Very boring for me",
            "comment_teaching": "It's not bad. He has a pretty strong HK accent so maybe for non-HKers it can be a bit harder to understand.",
            "comment_grading": "Very good. <br />(10%) Quiz 1 Me: 14/16 (median 12 Mean 11.72)<br />(10%) Quiz 2 Me: 13/16 (median 14 Mean 13.16)<br />(50%) Essay <br />(10%) Canvas Discussion <br />(10%) Tutorial Attendance Me: 20/20 (Mean 18.86, LQ 20)<br />(10%) Online Activities Me: Full<br />Grade: A",
            "comment_workload": "Not much.<br />Need to do 3 discussion forums, attend 5 compulsory writing workshops. Also need to study for 2 quizzes (16MCQs each) and do the online quizzes (unlimited attempts) and essay drafts. The essay drafts will go into your essay anyway.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "pIT913IvavpZARZ68w21s1NcLG8VNOOA",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "sungwook",
            "date": "Sep 13, 2018",
            "title": "",
            "comment_content": "It was interesting to compare Eastern and Western philosophies, and often I was provided with great insights.",
            "comment_teaching": "Quite boring and accent is hard to comprehend.",
            "comment_grading": "Grading is decent. Grading is decent. Grading is decent. vGrading is decent. Grading is decent. Grading is decent. Grading is decent. Grading is decent. Grading is decent. Grading is decent. Grading is decent. Grading is decent.Grading is decent.Grading is decent. Grading is decent. Grading is decent. Grading is decent.Grading is decent.Grading is decent. Grading is decent.Grading is decent.Grading is decent. Grading is decent.Grading is decent.",
            "comment_workload": "good.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 18,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}