{
    "error": false,
    "course": {
        "id": 613,
        "subject": "HUMA",
        "code": "3660",
        "name": "Tradition & Modernity: Chinese Ink Painting in 20th Century",
        "description": "This course surveys the major developments of Chinese ink painting from the late 19th century to the present, focusing on her interaction with foreign cultures, debate over continuity and reform, search for modernity, and adaptation to the political, social, and cultural transformations in different historical periods. Discussions will give equal attention to techniques, stylistic analysis, and interpretations in historical and cultural contexts. In content, this course complements what is not covered by CORE 2651/HUMA 2660 at a more advanced level.",
        "categories": [
            "Common Core (H)",
            "Common Core (Arts)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            1710
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.33,
        "rating_teaching": 4.67,
        "rating_grading": 5,
        "rating_workload": 5,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 767,
                "name": "FU, Li-tsui",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "OcI8BNttSM1Wk5n2UvQzV4Z38PqvMmvz",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 767,
                    "name": "FU, Li-tsui",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ashiroy",
            "date": "Feb 01, 2019",
            "title": "",
            "comment_content": "Chinese ink paintings until mid-20th century. Mainly analyzing the structure, color, and the themes of the works combining the social context. Simple and nothing intense. No pre-requisite on art background.",
            "comment_teaching": "The instructor doesn't speak fluent English but the content was clearly delivered. She is very kind, patient and helpful.",
            "comment_grading": "Fiar grade. I didn't spend too much time on this course. I got B. Besides weekly quizzes, report and the group project, in-class particiation makes up around 10 percent.",
            "comment_workload": "Not high. Quiz every week but easy. One (or two?) reports and one group project.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zfnWv9nRL1Y5HsimXvbRFmPuElPLKbMD",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 767,
                    "name": "FU, Li-tsui",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jjhsia",
            "date": "Jan 27, 2018",
            "title": "",
            "comment_content": "A lot of content that is interesting but goes unused in your papers and on tests. Unique subject that gave me a greater appreciation for art but sometimes the lectures became a bit dull. Some students will leave the lecture after the quiz has been handed out, and many will not come if there hasn't been a scheduled quiz. The subject matter is actually pretty interesting in my opinion but others have found it to be boring. You learn a lot about different styles in ink painting and the influence of history on said styles.",
            "comment_teaching": "Flora Fu was extremely engrossed in the subject of ink painting and it was fascinating to go on that journey with her. She is a very sweet lady who no one in my class has ever spoken crossly about. She cares deeply about ink painting and sharing her passion with her students. She is always very patient with students and tries to help them understand the nuances of brush strokes or use of space.",
            "comment_grading": "I thought Professor Fu was very fair about grading and would reward you if you were actively participating and showed you were truly interested in the material. She really did try to help students have deeper understandings about how to analyze art and relate it to life.",
            "comment_workload": "Very light workload. 30% of your grade goes to quizzes that are not at all difficult as long as you review quickly before. 30% is a short piece for a painting exhibit, and the other 40% go to participation and a group presentation. Overall, a very low-stress class workload-wise.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2FHIOl8xoj3ltEUxv5yjeFVtKXMqnBdC",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 767,
                    "name": "FU, Li-tsui",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "StanleyT",
            "date": "Dec 08, 2017",
            "title": "",
            "comment_content": "If you don't know the geography or time periods of China, or don't speak Chinese it can be a bit difficult to keep the content in order mentally. Plus, it makes it a bit difficult to do research for the individual paper and the presentation, as much of the content available online is in Chinese online. The class is taught in English though.",
            "comment_teaching": "Professor Fu is very dedicated to her work and it's clear she knows what she is talking about. Art is fairly subjective, so she is open to differing opinions. She offers many resources for the paper and the project, and she can direct you to the texts or journals that would be useful to use.",
            "comment_grading": "Very fair grading. The quizzes are easy, and the presentation grading was fair. There were 6 quizzes, and only the top 5 scores were counted. <br /><br />Quizzes: 30%<br />Attendance: 10% (only taken on 4 classes)<br />Presentation: 30%<br />Paper: 30%",
            "comment_workload": "Week to week, it is very easy. You just need to memorize some paintings, titles, and authors for a weekly quiz. Short term quick memory is useful. The only work that took some time was the group presentation for the last class.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}