{
    "error": false,
    "course": {
        "id": 566,
        "subject": "HUMA",
        "code": "2470",
        "name": "From Fung Shui to Mao's Villages: City Plans, Urban Politics & the Unseen World of Chinese Villages",
        "description": "A historical survey of the socio-cultural transformation in Chinese cities and villages from the late-Imperial to the modern periods. The process of “modernization” as well as the persistence of tradition is studied to redress some of the stereotyped pictures of Chinese society, both rural and urban. Important topics include: continuity and change in China’s city plans and their cultural meanings, the cultural meanings and importance of cities in Imperial China, the socio-economic-politico-cultural significances of treaty port cities as beachhead of Western expansion in China, urban modernization and its socio-economic-cultural impacts on China during the warlord period and under the Nationalist regime, the salient characteristics and the reality of Chinese rural society and politic in the pre-modern and modern periods, the social and economic development and devastation of the Chinese countryside between 1800 and 1940, and how the Chinese Communist Party made revolution in the countryside before 1937.",
        "categories": [
            "Common Core (H)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            1830,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 5,
        "rating_workload": 5,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 321,
                "name": "HO, Virgil Kit Yiu",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "mmpSLJVdcOcnObNKxJFF7cT6ovKexQMt",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 321,
                    "name": "HO, Virgil Kit Yiu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fg",
            "date": "Jan 19, 2021",
            "title": "",
            "comment_content": "A great course to learn about the History of China from a different perspective: urbanization and City Plans.<br /><br />Great great course to expand your horizons and learn.<br /><br />You do not learn as much architecture. What you truly learn is how cities are shaped by history and culture.",
            "comment_teaching": "Great professor and person! Super knowledgeable and always available to answer questions.<br /><br />Make sure to take a lot of notes because his lectures are pretty much just him talking!<br /><br />Sometimes he might go off track",
            "comment_grading": "Fair grading<br /><br />Again take a lot of notes during lectures to make sure you pass the final.<br /><br />Mid-term essay from a list of potential topics <br />- external research is needed, grinded it out in a weekend and got an A<br /><br />Final exam <br />- 4/5 open ended questions<br />- wrote for the entire duration of exam, got A",
            "comment_workload": "Not heavy workload.<br /><br />Just make sure you go to class, take notes on whatever he says.<br /><br />A lot of reading but <br />first) super interesting if you like history<br />second) he goes over them in class, so if you really do not want to read them just pay more attention in class",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}