{
    "error": false,
    "course": {
        "id": 502,
        "subject": "HUMA",
        "code": "1010",
        "name": "Introduction to Language",
        "description": "An examination of fundamental concepts and principles in the scientific analysis of human language, especially concerning speech sounds, syntax, meaning, language acquisition, language processing, sociolinguistics and history of languages. Students who have taken an introductory course in linguistics in universities should not enroll in this course.",
        "categories": [
            "Common Core (H)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2030,
            1810,
            1730,
            1630,
            1610,
            1540,
            1510,
            1440,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.19,
        "rating_teaching": 3.63,
        "rating_grading": 4.28,
        "rating_workload": 4.19,
        "review_count": 32,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 303,
                "name": "NG, Walter W. T.",
                "count": 24
            },
            {
                "id": 1194,
                "name": "LI, Dechao",
                "count": 3
            },
            {
                "id": 1502,
                "name": "QIN, Zhen",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "oeFF8ORGj4gJqGfigcBhAtoEv7TNHcNV",
            "semester": "2014-15 Summer",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chchanca+++vcv",
            "date": "Aug 16, 2015",
            "title": "",
            "comment_content": "The topics of the course are broad, covering different areas about language such as the IPA(International Phonetic Symbols), social perspective of language and biological perspective of language etc. The topics are generally not very difficult because they are only the introductions. However, if you haven't studied IPA before, the course can be quite challenging because you are going to study and analyse the IPA of a variety of words, and this is required in the examinations.",
            "comment_teaching": "The instructor does not upload notes to the canvas, and there are also few notes distributed in the lessons. What to learn is what the instructor discusses with you in the lessons. So, make sure that you attend all lessons. Even missing one lessons can be fatal to your learning. Also, jot down the notes on what the instructors discusses every lessons. One thing to note is that the instructor always jump between topics to topics. So it can be hard to catch up if you fail to organize the information.",
            "comment_grading": "The grading is pretty good. The grading distribution consists of a mid-term(45%), a final(45%) and attendance(10%). I scored 96/101 in the mid-term, and my final result was not shown. Full attendance. An a grade.",
            "comment_workload": "In my opinions, the course is quite easy. Content not too difficult, no heavy workload. However, the only important thing to get a good grade in the course is that you can organize what you learn in the lessons effectively. Questions in the exams are not difficult and are straight-forward. If you work hard, you are able to get a good grade.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Z8G4NbT5FSaLYkoiN6uXgW8GHGA6Cmq9",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1502,
                    "name": "QIN, Zhen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "高海千歌",
            "date": "Jun 02, 2023",
            "title": "Straightforward CC course (Note: Same as CORE1501)",
            "comment_content": "(IMPORTANT REMINDER: This course is same as CORE1501 in terms of everything aside from the course code. However, I put the comment at here as well in case someone search this course at this page. If you want to take this course to fulfill CC requirement, YOU SHOULD REG CORE1501 AS YOUR COURSE CODE, NOT HUMA1010)<br /><br />1. Introduction<br />2. Brain and Language<br />3. Phonetics<br />4. Phonology<br />5. Morphology<br />6. Syntax<br />7. Semantics<br />8. Language acquisition<br /><br />Although the title is Introduction to &quot;Language&quot;, it is not that &quot;Language&quot; you think. This course is actually introduction to linguistics. Instead of focusing on the proficiency of language like those LANG courses, this course focus on the analytical approach of how language is produced and formed. This includes the sound (phonetics), patterns (phonology), structure (syntax), meanings (semantics) etc. <br /><br />It looks like the current syllabus focus more on practical analytical skills rather than cramming everything into your brain and ask you to recite. The coverage is better than in the past. You will learn several problem-solving skills to analyze the characteristics and features in different datasets regarding different languages (not only English). Some languages are very interesting and probably most of us have not heard about them before.<br /><br />In my opinion, most contents are not difficult to handle, and they are actually quite interesting. The only challenging part is phonetics. One of the most important tool for this part as well as the whole course is International Phonetic Alphabet (IPA), which maps the every sound to a symbol. I would say this is the most challenging part of this course due to the inconsistencies between pronunciation and spelling. You also need to remember the pronunciation of each IPA symbol and try to assemble them to form the correct pronunciation of the given words. Moreover, phonetics is probably the most important topics in this course because it has a quite connections to other topics. Therefore, you may need to put more effort in this part.<br /><br />If you are struggled on IPA, I recommend you to watch this channel. It's pretty good and help me a lot. Also, try to follow it and speak out loudly. You will have a better idea.<br />https://www.youtube.com/watch?v=7mahmMmnSx4&amp;list=PLOZUTLsJbEAjW-Z9Bou0fPvPs8zdF79pJ<br /><br />For other parts, the content is easy to handle and the problem solving techniques are monotonous and straightforward. No matter what language he gives to you, even you are given Mars language, the problem-solving techniques are universally available. Prof. will provide examples to demonstrate the problem solving techniques. After that, you just need to keep mechanically replicating them in the assignment and exam. It is not hard to follow.<br /><br />Last thing, the prof put some emphasis on the textbook and often ask us to read the textbook chapters. However, I think it is not really necessary. The lecture content has covered what you need for the assignment and exam so just don't waste money&nbsp;&nbsp;and time if you are not really interested in the topic...",
            "comment_teaching": "Decent<br /><br />Prof. Qin is a nice guy. His voice is quite soft but has an appropriate tone and pace. He can explain the content quite well as well. Therefore, I don't really feel bored during the lecture.<br /><br />Prof. Qin cares a lot about class attendance and engagement. Therefore, he will not publish lecture notes until the lecture ends and he will not publish the recordings until the end of the semester (Unless you have justifiable reason then he will provide you the recording of your missed lecture). Therefore, please take his lectures seriously. You cannot skip too many classes otherwise you will miss a lot of thing (attendance, in-class quiz, as well as learning progress)<br /><br />One reminder, he likes to ask students to answer his questions or share thoughts. If there are no one raising the hand, he will either actively invites you or call your names out (He has a name list). This does not count towards attendance and he won't punish you even if you answer wrong or don't know the answer. However, if you don't want to be embarrassed, pay attention to the class. I notice that he likes to pick the student who are seen not concentrated or talking during the class.",
            "comment_grading": "Considering the cost-effectiveness, I think it is still a good grade course.<br /><br />Grading scheme<br />1. Attendance (10%)<br />2. Assignment (x5) (30%)<br />3. In-class quiz (x10) (30%)<br />4. Final exam (30%)<br /><br />My score<br />1. Attendance: 10/10<br />2. Assignment: 30/30<br />3. In-class quiz: 30/30<br />4. Final exam: 27/30<br />(Mean: 23.41 Median: 24 UQ: 25.5 LQ: 21.63)<br /><br />Total: 97/100<br />Final Grade: A+<br /><br />Pretty unexpected. I thought I need a perfect game for A+. Really touching that I can get my first (and probably last) A+ in this university. The mean is somewhat slightly below my expectation as well (Expected final mean will be over 25/30)<br /><br />This course is not difficult to manipulate if you pay enough attention in the lecture because the prof have provided clear examples for solving the problems that will appear in the assignment and exam. The only thing you need to do is mechanically replicate them in the assignment and exam. You don't need high IQ or huge effort for good result. Therefore, try to put more effort in this course and score high because of the high cost-effectiveness.<br /><br />(Probably the only thing that you need extra practice is phonetics (IPA) but it is not a big problem to have extra practice on this as you can find English words everywhere right? If you are able to translate one of my paragraphs into IPA symbols smoothly then you are more than good enough ^ ^) <br /><br />However, please pay extra carefulness on every assessments (assignment, quiz, exam) as the content is really easy and the mean is very high. Everyone score very similar marks in quiz and assignments (Over half of the class get full marks). Therefore, careless mistakes costs a lot in this course. If you look at the score, the ratio of the assessment score to the total score is 1:1. That is, if you lose 1 mark in the assignment, you lose 1 mark for the total score. If you are not careful enough, you will easily get unsatisfactory results.",
            "comment_workload": "Very light, unless you have zero willingness to go to lecture<br /><br />1. Attendance<br />Just go to the lecture, sign your names and you can get the full credit. It is that simple, isn't it? At least it doesn't requires you to answer questions or say anything in the class to earn the credit.<br /><br />2. Assignments<br />Five assignments in total. However, they are very short and straightforward. You only need one hour or even half hour to finish them. The questions just test the problem-solving techniques that are being taught in the class in a very straightforward way. Therefore, if you pay attention to the class then it will be fine.<br /><br />3. In-class quiz<br />There are 10 in-class quizzes which will appear randomly throughout the semester. The prof will not tell you which class has quiz. You will only know when that lecture starts. Therefore, go to lecture for attendance and quiz.<br /><br />The quiz will have 3 concept-checking MC questions to test you the content of that class. They are straightforward and for testing whether you are daydreaming during the lecture only.<br /><br />The quiz is open-book (At least from what I known from prof is open-notes as I just look at my jotted notes for answer). However, the prof will NOT publish the lecture notes of that lecture before the quiz. Therefore, you need to jot notes by yourself if you need to refer to the lecture content during the quiz. Please pay attention to the lecture.<br /><br />4. Final exam<br />Very straightforward close-book exam. It is just a combined version of all the assignments. The question format are very similar but only the content changed. The exam time limit is 3 hours but people start leaving 1 hour after the exam started.<br /><br />Therefore, please make sure you know how to do every assignment questions before the exam. If you do the assignment by yourself, you should have no problem on the exam as well.<br /><br />The score for other assessments are very similar among students so probably the final exam determines your fate in this course. Good luck.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8r8Eq0CArIWTZFidjUUDb3LejQGuEu7T",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1194,
                    "name": "LI, Dechao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mohdhammad",
            "date": "Oct 04, 2018",
            "title": "Bad instructor",
            "comment_content": "Boring content, cant figure out the use of this course, every lesson is about the spelling<br />He told us the quiz will cover mainly the English vowel. however, it turned out it was the Mandarin and Cantonese vowels. <br />If you can't speak Mandarin, do not choose this course.<br />NO, just don't choose this instructor.",
            "comment_teaching": "The teaching is so boring and the instructor I tried but really hard to concentrate in class",
            "comment_grading": "",
            "comment_workload": "one quiz in two weeks, 1 quiz for 6% and they are really hard, you need to memorise everything, even out of the syllabus of the quiz. The instructor will tell you what to quiz before the quiz, however, the quiz will cover more or less things comparing with what he said, so do not trust.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "OXKyMBSAwlEMrpJ3UGM9jm4u70huIm7U",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KLap",
            "date": "Aug 26, 2016",
            "title": "",
            "comment_content": "內容關於不同語言的發音、差異、男女用的語言分別等。",
            "comment_teaching": "上堂氣氛良好，授課風格切合本地生。<br />特別是會記住每個學生的名字和面孔，有時會點名答問題，不過本地生被點名機會較少。",
            "comment_grading": "好Grade，肯留心上堂和溫書就會輕鬆高分穩A。",
            "comment_workload": "約每堂一至兩張工作紙，即堂交，十分容易完成。<br />考試內容大部份出自工作紙，默熟工作紙離A不遠。",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LpIjSFEU3GXiHaBHnEBH7CqvgcbNjhCn",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jacky255",
            "date": "Jan 23, 2017",
            "title": "大包圍",
            "comment_content": "Cover好多好多野<br />mud鬼英文拼音符號呀　唔講仲以為上緊英文堂<br />p.s.拼音 考試係要考的<br />仲有咩language bias against women呀　一大堆奇奇怪怪既野大包圍<br />個人覺得真心唔得 一個3cre course將linguistic既野大包圍全部介紹仲要背　每堂都上得好辛苦<br />不過當中有dcase係幾得意既　值得一睇",
            "comment_teaching": "walter哥睇得出係好有心教　<br />會記大家既樣同名 又會講下笑話<br />亦好想令大家對linguistic有興趣<br />奈何上堂模式太唔organize <br />依一秒鐘講緊A 下秒鐘就去左講琴日既notes <br />上到頭都大埋",
            "comment_grading": "Grade我覺得一般<br />無出面吹依科吹到咁大　就正常grade<br />可能大家都覺得會好grade所以搏命讀　大多分數偏向中上　想拎好grade有難度",
            "comment_workload": "workload唔知算唔算細<br />無assignment <br />只有mid term &amp; final<br />同堂一定要上 只會係堂上俾notes同考上堂講既野<br />attendance都會take<br />reading walter哥會同你上堂一齊睇　<br /><br />但考試真係會cover哂所有學過既野 所有topic所有野　所以要溫得幾仔細<br /><br />overall我覺得係學到野既 想學野既人可以讀讀 只係課程包太多野了 太rush有點可惜<br />walter哥亦係ust少有有心既professor <br />真心要報黎支持下",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "C1koBtrys8aSlRwd0a3p0JbDVlmNKrNI",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "iamwildcat",
            "date": "Aug 27, 2016",
            "title": "",
            "comment_content": "Course provides a systematic introduction on the structure of human language in a linguistic point of view.<br />Covers topics:<br />Structures of sentences / words (morphemes)<br />4 principles of human language,<br />Difference between human language and other animals<br />Difference between genders on language (psychological view)<br />Social factors affecting language<br />How children master their mother tongue<br />Different Accents and usage of a certain language<br />**PHONETICS is a HUGE part of the course.**<br />- Phonetic symbols in English, requires reciting. Usage:&nbsp;&nbsp;pronunciation, stressing, aspiration<br />- Other languages covered: Cantonese (emphisizing on tones), Mandarin, Thai, Hindi, Japanese, Korean (some of which is required in the FINAL exam)",
            "comment_teaching": "Prof NG is one of the more interesting professors in HKUST. He tries to make his classes less dull, often pulling puns and jokes on himself and students (no offense) and frequently interacts with his students. He remembers every single student by name. Class ambience is usually laid back and fun. <br />He gives out a large amount of handouts (THOUGH REALLY UNORGANIZED) which you are required to keep because they are essential for exam revisions.<br />Videos and slideshows are frequently used in classes and you are required to remember minor details and quotes within these materials as they are assessed in exams (which is quite ridiculous if you ask me as it depends how well you generally remember things).<br />The biggest problem is the inconsistency of content within classes. (for summer, 3.5hr courses, breaks included) He tends to skip around covering fundamental topics and phonetics which makes it really difficult to organize your notes well (provided you will jot notes in the first place).<br />Course also covers foreign languages e.g. Hindi, Thai, Japanese, Mandarin which is somewhat difficult to master within a short period of time if you're not a &quot;language&quot; person, but they will be assessed in the exam.",
            "comment_grading": "Final Grading : B+ .<br /><br />Attendance is taken at the midst of every lecture.<br />(handwritten)<br /><br />I would consider myself a fast-learner to new languages but this course isn't really made for people with HUGE left brains. It is again those kind of courses where if you have a great ability of remembering things, then you will easily get an A.<br /><br />There are surely lots of things to recite from handouts, handwritten notes and contents broadcasted in class. The most likely event to happen during exam is seeing a question asking for a keyword from a video played in class, and you'll have a mad sense of deja-vu, and get the answer, if you are one of those lucky ones.<br /><br />You will easily get an A if you midterm score is over 85 (class average 65).<br />Overall, if you consider yourself to be more of a language person than a logic person, this is a good common-core to sign up for. If not, forget it, unless you have a massive brain for fast memory.",
            "comment_workload": "A lot of in class worksheets (easy, merely counts towards final grading)<br />Midterm and Final Exam.<br />Most questions are fill in the blanks, short questions that do not require much pondering, no-brainer questions designated to give out points.There are 3-4 essays which you are required to write in the exams and scoring is phrase dependent (i.e. if you answer a required phrase correctly you get a point, if you don't use a certain phrase, you don't get marks).",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iI3yfl5WzeresVCdLAYTygMahxTxlGRi",
            "semester": "2014-15 Summer",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "helloworld",
            "date": "May 07, 2016",
            "title": "",
            "comment_content": "The content discussed in the course includes general classifications of different fields in linguistics (not important), phonetics&amp;acoustics (v. important), animal communication, some neurolinguistics, some sociolinguistics, etc. before the midterm, final largely focuses on differences between male and female and study of chinese, japanese and korean. <br /><br />In general not hard, especially if you know phonetics of English already, not much to memorize (phonetics, hiragana, some classification of words, etc.), other things tested in exam is common sense<br /><br />Exam not too difficult, make sure you have revised all handouts distributed during class and memorize stuffs on the review list should be enough for an A range already.",
            "comment_teaching": "The instructor is quite enthusiastic and dynamic, however, he always jump from one topic to another topic suddenly, may be hard to follow at first.<br /><br />Attendance is taken by signing a sheet passed around the LT every lesson, so if you plan to skip lessons during the term you should let your friend sign for you starting from the first lecture<br /><br />Since the content is not too sophisticated, one can actually skip class and use google+review list to learn.",
            "comment_grading": "Forgotten, worksheets+ midterm+ final<br /><br />~18-20% A range",
            "comment_workload": "Worksheets are in general easy and can be done within 10 minutes, no take home assignments, revision for midterms and finals can be done in 1 day",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "lDu1wOFyajPhdihZOsdM5hb60JRd9CSW",
                    "name": "Review List excluding children_2c gender & methodology",
                    "format": "pdf"
                },
                {
                    "key": "nHSBkgnp5hE7N6NpAGoC6UvXG8LpvMVD",
                    "name": "Review list after Day07 July 06 (1)",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "Ks0f92NwRRgKCZSfcZZMDFxgINDeERkX",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1502,
                    "name": "QIN, Zhen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "H.W.",
            "date": "Jun 16, 2021",
            "title": "",
            "comment_content": "A common core course in linguistics. <br />Topic 1: Brain and Language<br />Topic 2: Phonetics<br />Topic 3: Phonology<br />Topic 4: Morphology<br />Topic 5: Syntax<br />Topic 6: Semantics<br />Topic 7: Language Acquisition<br /><br />Learning outcomes:<br />1. Grasp fundamental concepts in the structural analysis of language as a rule-governed and productive system of communication.<br />2. Describe the systems of speech sounds in English and Chinese with the International Phonetic Alphabet (IPA).<br />3. Question the origins of the brain’s linguistic capability in relation to aphasias, child language acquisition, and universal properties of languages around the world.<br />4. Discuss the social aspects of language within the framework of contemporary linguistics.<br />5. Aim at sound testing of hypotheses, argumentation and causal reasoning, especially with regard to linguistic phenomena.",
            "comment_teaching": "I had no idea why he spent the first class on how to use Canvas and Zoom. <br /><br />His pace was pretty slow but overall the teaching was okay and clear.<br /><br />He is new to this course, so the grading is slightly different, but the contents are the same.",
            "comment_grading": "1. Attendance/ Participation: 10%<br />2. 8-10 in-class short quizzes (MCs): 30%<br />3. 4-5 assignments: 30%<br />4. Open book final exam: 30%<br /><br />As the quizzes, assignments, and the final exam (open book) were pretty simple, almost everyone got full marks and the means were super high. Make sure you don't make silly mistakes otherwise it is easy to get below mean. <br /><br />Still, it is a good course to get good grades.",
            "comment_workload": "There were pop-up quizzes (3 questions) for almost every class, and he won't tell whether there would be a quiz next time. The quizzes were the contents taught in that class. <br /><br />There were assignments for each topic and they were not difficult at all.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "DyzQcYLVkT77gqYbO2mjvC9Sm42rz14N",
            "semester": "2017-18 Spring",
            "instructors": [],
            "is_author": false,
            "author": "language",
            "date": "Jan 23, 2019",
            "title": "Introduction to Language",
            "comment_content": "This course is about the basics of the English language, including morphology, phonology, language learning in childhood etc.",
            "comment_teaching": "Professor basically just read through the ppt slides, there are some videos prepared to get you familiarized the pronunciation of IPA chart.",
            "comment_grading": "it is a good grade course in Huma.",
            "comment_workload": "There is no homework or presentation. There are only 2 quizzes and a final exam. Professor will take attendance. Your grade will be good as long as you memorize everything in the notes. You don't need to memorize the IPA chart, it will be given in the final exam and quizzes.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gI4qcXrJo20YSIpiNQqf9EYwDf293yUa",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1194,
                    "name": "LI, Dechao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Autumn",
            "date": "Jan 22, 2019",
            "title": "",
            "comment_content": "Content covers phonology and morphology of Mandarin, Cantonese and English, if you've learnt IPA before, things would be much easier as Dr Li's teaching progress in IPA part is quite fast :0 You have to basically memorize all the initial, finals and tones.",
            "comment_teaching": "Dr Li is a kind instructor and willing to answer questions. Nevertheless, he made students confused about the content to be honest. <br />In some lessons, he found it hard to explain some content so he kept saying sorry to us.",
            "comment_grading": "5 quizzes: 2 above mean, 2 mean, 1 below<br />Assignments above mean<br />Final above mean<br /><br />Final Grade: B<br /><br />Easy to get B range but hard to get higher grade",
            "comment_workload": "Workload would be a bit too much for a 1000- level course.<br />5 Quizzes <br />2 assignments",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sW0hHibwIwgmSVTCCAA5jtpth1jiEUaH",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Heinrich",
            "date": "Jan 18, 2019",
            "title": "It is basically a little bit of everything",
            "comment_content": "It is interesting if you are a big fan of linguistics, otherwise you will surely be bored. Do not be deceived by the course name. The course neither teaches you a language nor improves your language skills. The course however teaches you studies about languages itself, e.g. how our brains perceive language, what sounds there are in a language, so on and so forth. The scope of the course is rather wide, be prepared for that.",
            "comment_teaching": "He is quite enthusiastic and he is willing to answer you questions. However, if you are not a beginner in linguistics, you might be able to figure out some flaws in some theories in the course and no one really cares about that in a one-semester course in a university of science of technology. So just accept it. He is also a very nice instructor. Feel free to challenge him if you are confident enough, and he will let you know what the course has missed but how no one will care.",
            "comment_grading": "It varies a lot. It really depends on how much effort you are willing to put in. I cannot represent everyone but A+ is what I got. That could be because of that fact he remembered my existence, by asking him challenging questions after almost every lesson. I am not sure if anyone should do that.",
            "comment_workload": "One of the most cosy courses. There are no home assignments. Everything is done on classes. Just focus on the content of each lesson and you will finish the tasks with no difficulty (provided that you have great interest in linguistics). Attendance is required. Do not skip lessons.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "McNqfpye3Su6oOSCWyFReDUKePBLEtYl",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ngoin100",
            "date": "Jan 23, 2018",
            "title": "",
            "comment_content": "The content of this course is very interesting, example are such as the IPA(International Phonetic Symbols), social perspective of language and biological perspective of language etc. <br /><br /><br />Neuroscience<br />Cognitive Science<br />Language pedagogy<br />Phonemic transcription: IPA symbols, tones...<br />P-rules<br />Acoustics<br />Sociolinguistics: Case studies<br />Cantonese, Mandarin phonetics",
            "comment_teaching": "Professor Ng was very enthusiastic in teaching this course. He gave me a fun and happy semester. The professor is very passionate and motivates students to answer questions by passing the microphone. But students need to jot down notes every lesson as there is no lecture notes given.",
            "comment_grading": "got A+",
            "comment_workload": "Literally nothing to do. Only had to finish one very easy worksheet during class.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dfeiYffCvKLOUome0bJbJRXMhhm0KqkH",
            "semester": "2016-17 Summer",
            "instructors": [],
            "is_author": false,
            "author": "wwm",
            "date": "Sep 13, 2017",
            "title": "",
            "comment_content": "a lot of things to memorise<br />about linguistics and also different culture and different languages<br />a bit boring if you dont like language",
            "comment_teaching": "quite good and have heart<br />No ppt on canvas so you need to take notes and attend all lessons<br />worksheets will give out in lesson and all lessons have assignments",
            "comment_grading": "study hard and easily get good grade, as everything in exam are covered in worksheets",
            "comment_workload": "not a lot but need to attend lesson to take notes<br />no assignment <br />have midterm and final exam, but not too long",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OOZldiZWNxvuoIGwYAmEmMTGUACy6Fma",
            "semester": "2014-15 Summer",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "p.wong1124",
            "date": "Aug 30, 2017",
            "title": "好有趣好得意嘅Prof",
            "comment_content": "Introduction of language<br />Attachment included the syllabus <br />邊個area都會掂下<br />由IPA --&gt; 執下英文啲 Consonant and vowels (呢到你會發覺點解自己讀嘅英文係好唔準)<br />教下 socio-linguistics&nbsp;&nbsp;(男女之間 語言方法係有咩唔同 特徵)<br />再學下 psycholinguistics (講下其中兩隻嘅失語症 Broca 同埋Wernick)<br />又教下 Animal language (呢道會無喇喇變咗睇BBC documentary 咁 睇bee dance)<br />又會無喇喇教咗中文、日韓嘅字<br />同埋廣東話六音(+3個促音)<br />教咗好多fundamental 嘅 linguistic terms (inc. Morpheme, phonetics vs phonology)<br /><br />啲嘢係Walter 教之下係幾得意架",
            "comment_teaching": "Walter 好好人嘅<br />教書佢盡量希望唔好悶親我地<br /><br />雖然係summer 嘅時間試過<br />教教下書發現我地無咩興趣/悶<br />會突然講:「你地係咪好悶呀? 我轉另一個topic 講下好嘛?」<br />Summer 由於係3個鐘好難避免會跳黎跳去 topic<br /><br />會成日教教下書 教一個鐘放15 mins break 但個break係比人去做佢派嘅exercise (e.g. Phonology, English spelling, 分析下廣東話等)<br />接受到佢會跳躍嘅話 就會覺得唔錯<br /><br />但係功課嘅答案唔會放上網 所以一定係追住 Walter 去問啲answer 嘅答案 或者係 上堂對答案時抄足啲<br /><br />上堂亦都會傳咪比學生答問題 答錯唔緊要嘅",
            "comment_grading": "只要願意背熟佢上堂寫底嘅嘢<br />做曬佢上堂比嘅notes (即堂交, 下堂睇黑版對)<br />就會識做Midterm Final 嘅short questions and short essays.<br /><br />願意肯下決心背書 成績會唔錯 因為都幾straight forward",
            "comment_workload": "Break之間要交HW (做錯唔緊要, 只要有做到就得)<br />Reading 可以唔睇嘅 (不過如果想了解語言學可以睇 會清多少少<br />有啲topic 佢都係用textbook example 去教)<br />會點Attendance&nbsp;&nbsp;同埋佢會上堂傳咪比學生答問題 &amp; 佢過多一兩個禮拜就會認得啲學生&amp;佢地嘅名~<br /><br />Midterm 同 Final 只要背熟佢教過嘅嘢就唔怕嘅(不過背嘅嘢都幾廣)<br />(一定要背佢叫你地抄嘅slide因為好大機會會出返類似嘅questions)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "AILcHSmFWsCEEMX0WY4KDav2EGJVWtr5",
                    "name": "HUMA1010",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "wZxQVZxnN2a3ZsxkUX2Si5PnznA9ugR7",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "marmarmarco",
            "date": "Aug 23, 2017",
            "title": "Good grade but messy notes and lessons",
            "comment_content": "關於唔同語言嘅野,起源,國際音標(要背), 人點樣學語言etc,好廣,中意語言會覺得幾有趣,唔中意去夾硬背就會收皮. 上堂講過中文日文韓文英文(american vs british)西班牙文俄文同非洲唔知乜q野文. midterm同final要背幾個日文同韓文嘅詞語.",
            "comment_teaching": "完全垃圾，讀左三年最亂嘅course structure.一開波連course structure果張野都冇,幾時midterm, quiz果啲都唔知，每堂都會派notes同worksheet, worksheet要即堂交。上堂果啲ppt通常唔upload/ 考midterm前幾日upload.總之就好亂,超級亂",
            "comment_grading": "自已有興趣 最後a range, TA好人",
            "comment_workload": "冇乜. 每堂一張worksheet計attendance, 一個quiz, 一個midterm, 一個final",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TbiSb2oF4RTlwwEJKRqfnG96qN09n10n",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cruisers",
            "date": "Aug 22, 2017",
            "title": "",
            "comment_content": "An introductory course to linguistics. You can have a brief understanding about the topics by reading the COURSE INFO when checking course quotas. Wide topic discipline ranging from phonetics to sociolinguistics.&nbsp;&nbsp;Expect a brief study of linguistic-related topics but not very down to depth.",
            "comment_teaching": "The professor showed his enthusiasm in teaching, but the teaching was just a mess, at least up to me. The professor talked about several incomplete topics in each lesson. Then he continued the incomplete topics in the next lesson. You will have to attend all lessons till the end of the semester in order to obtain a complete picture of the course's topics. As a systematically-trained science student, this is not my learning style but guess it maybe good to keep skipping topics for those who find no interest in some topics.",
            "comment_grading": "The mean is quite high, often around 60-70% of the total score of quiz or midterm. (I have no idea about the final score or I don't know if i have skipped checking score. ) However, the quiz, the midterm and the final results are proportional to your effort spent. From arguable concepts such as if language in universal to minor stuffs like how bee dance, a student who understand and familiar with the concepts will be able to achieve good grade. Lots of topics and concepts but the questions are also VERY straightforward. If you are familiar with them, you will get the points. If you forgot them, that's all.",
            "comment_workload": "With the topics-skipping teaching nature of the professor, you have to attend the lessons if you want to learn something. So attendance will not be a problem. There are worksheets distributed on lesson as &quot;assignments&quot; , but required to hand in at the end of the lesson. By paying attention to the demonstration by the professor and discussing with peers, the worksheets are not hard jobs either. Readings are distributed and discussed on lesson and one could spend less time on them beyond lesson. There is a quiz, then a midterm and a final. These are which you have to invest effort into.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hbXq9BsX9FmHfZuxV6c1xx8EWmCuJ2XK",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "thomasng626",
            "date": "Jan 25, 2017",
            "title": "2015-16 Summer",
            "comment_content": "Course provides a systematic introduction on the structure of human language in a linguistic point of view.<br />Covers topics:<br />Structures of sentences / words (morphemes)<br />4 principles of human language,<br />Difference between human language and other animals<br />Difference between genders on language (psychological view)<br />- Other languages covered: Cantonese (emphisizing on tones), Mandarin, Thai, Hindi, Japanese, Korean (some of which is required in the FINAL exam)",
            "comment_teaching": "He gives out a large amount of handouts (THOUGH REALLY UNORGANIZED) which you are required to keep because they are essential for exam revisions.",
            "comment_grading": "Attendance is taken at the midst of every lecture.<br />(handwritten)<br /><br />I would consider myself a fast-learner to new languages but this course isn't really made for people with HUGE left brains. It is again those kind of courses where if you have a great ability of remembering things, then you will easily get an A.<br /><br />There are surely lots of things to recite from handouts, handwritten notes and contents broadcasted in class. The most likely event to happen during exam is seeing a question asking for a keyword from a video played in class, and you'll have a mad sense of deja-vu, and get the answer, if you are one of those lucky ones.",
            "comment_workload": "A lot of in class worksheets (easy, merely counts towards final grading)<br />Midterm and Final Exam.<br />Most questions are fill in the blanks, short questions that do not require much pondering, no-brainer questions designated to give out points.here are 3-4 essays which you are required to write in the exams and scoring is phrase dependent (i.e. if you answer a required phrase correctly you get a point, if you don't use a certain phrase, you don't get marks).",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WOlPEVMntzVtZptKCEGngfOcd4gtnYaE",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "George2179",
            "date": "Jan 22, 2017",
            "title": "An introductory course for students interested in linguistics",
            "comment_content": "Fundamental concepts and principles in the scientific analysis of human language, especially concerning speech sounds, syntax, meaning, language acquisition, sociolinguistics, language processing and history of languages. Phonetics will be quite a big part of this course.<br />Phonetics table of English, Cantonese, Mandarin and a little bit of Japanese and Korean language will be taught. It will be better if you have learned those foreign languages already.<br />Overall, the main topic will be phonetic of English, and you will probably spend lots of time remembering those phonetic symbols.",
            "comment_teaching": "A pretty good professor in my opinion, really kind that he would stay after class for more than half an hour just to answer student's question. One thing that I appreciate is that he would make a review note for all the student to prepare for the mid-term and final exam, which was really helpful to me who study the exam one days prior to it.<br />One thing that I don't like about him is that he won't put the notes on the canvas or some internet platform, forcing students to come to his lecture. Also, his note is not really compact, with 60 notes and worksheets in total.",
            "comment_grading": "Quite well in my opinion, though he said that he would fail a very small percentage of students who are really bad.<br />I am at the highest 5 percentile of the whole class(124 students) and got an A+ from this course. I think it is 20% of students in A range.<br />10% participation<br />30-40% mid-term<br />50-60% final exam",
            "comment_workload": "if you are taking this in the summer semester, the workload is pretty high. The mid-term exam was just 10 days after the start of the semester, and you have to remember the phonetic table within 10 days, in addition to a lot of worksheets.<br />After mid-term, the workload would only be higher, with more worksheets and things to remember.<br />One annoying thing is that you need to make note sometimes during the class, especially when a video is being played since questions about the contents of videos will be asked in exams.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IstVpS8XlDmGAr97mADd7SG4aTozvYIr",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chimz",
            "date": "Oct 17, 2016",
            "title": "get some fun out of rocks",
            "comment_content": "Neuroscience<br />Cognitive Science<br />Language pedagogy<br />Phonemic transcription: IPA symbols, tones...<br />P-rules<br />Acoustics<br />Sociolinguistics: Case studies<br />Cantonese, Mandarin phonetics",
            "comment_teaching": "Walter哥想教好多野，但真心唔好每堂好似擠牙膏咁，但5-6堂先做完一個topic，我咁樣花好多時間做notes架，隨時花嘅時間仲多過HUMA4000 level，我唔係話要餵埋我食，但大家都無咁辛苦，雖然我唔太by Walter哥教法，但佢係好搞笑。如果大家真係跟唔到，不妨買本Textbook。",
            "comment_grading": "Midterm: full mark: 80, median: 64<br />Midterm + test: full mark: 46; median: 34.7, 詳見附件<br />炒咗final都有A-",
            "comment_workload": "30% midterm exam (week 6)<br />16% test (week 10)<br />51% final exam<br />3% participation and attendance (計WS數量)<br /><br />exams: non-cumulative",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "NK8M5V1WXeF38uhrgTGixcAOWq5uB6s4",
                    "name": "Score distribution Midterm and Test",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "DPiWm86IFQE9CzOnBpt6aMLAigGUfnqg",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Oz",
            "date": "Aug 23, 2016",
            "title": "",
            "comment_content": "1. Phonetics, which is very useful for you to pronounce difficult English words. <br />2. Communication differences between males and females, and miscommunication between them.<br />3. Different experiments about linguistics<br />4. few Cantonese, Mandarin, Japanese and Korean words",
            "comment_teaching": "Powerpoint in class ONLY, so you MUST jot notes every lessons. <br />Although the professor doesn't teach the topics sequentially, I think it is his style. So just let it go if you find confusing.",
            "comment_grading": "If you study hard(i.e memorize everything) at least one day before the mid term and final exam, it is very easy to get A range.<br />(Hence I got 86 in midterm and I got A+ finally.)<br /><br />Grade distribution of mid-term (highest in class: 86):<br />Grade||mark||no.of students<br />A || 76.5 - 86.0 || 22<br />B || 65.0 - 76.0 || 36<br />C || 40.0 - 64.0 || 56<br />D || 33.0 - 37.0 || 7<br />F || 18.0 - 27.0 || 3",
            "comment_workload": "10% attendance &amp; classwork<br />40% mid term<br />50% final",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cAmKzivaHUl2jpx9cJ3jUHDNdooO99FR",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "RIP",
            "date": "Aug 21, 2016",
            "title": "recommended",
            "comment_content": "一開始有些實驗和紀錄片，然後帶出language有什麼characteristics<br />主要學英語的音標，還有一些日語、韓語的音標<br />還有粵語的聲調<br />然後還有一些人工智能、圖靈測試之類的topic，還有男女用語措辭的不同等等比較亂的各種topic<br />（不好意思，很多內容都忘了）<br /><br />教的內容都很有趣，但不是很系統",
            "comment_teaching": "Dr.Ng說話挺有趣，但聽起來有點亂，經常東說一塊，西說一塊，一開始不習慣可能follow不了，但總體來說還是很清晰的",
            "comment_grading": "上課要簽到，有時候要回到prs（但似乎不算分）<br />midterm和final都會有review list<br />只要上課做了worksheet，抄下重點，跟著review list溫書就沒有問題<br /><br />記憶中midterm和final都是比滿分低一兩分，A+",
            "comment_workload": "基本沒有workload，只要上課做一下worksheet就可以<br />溫書跟著review list就可以，midterm大概兩三頁，final的大概四五頁，不多。",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CwtZDCXxnr3AB3Rob5hqePWI7XGhKuXs",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ycl",
            "date": "Aug 21, 2016",
            "title": "",
            "comment_content": "The content is interesting. The materials include International phonetic alphabet, attributes of human language, difference between animals and human communication, gender difference in communicative behaviours, tones in Chinese and Putonghua and some Korean and Japanese writing. When discussing some topics, the professor will show video clips that make better and clearer understanding.",
            "comment_teaching": "Although one lesson lasts for 3.5 hours in summer semester, it will never be boring! The teaching style is interactive. He always asks questions. He gives two short breaks so you can take a rest. One bad thing is he always jumps between topic to topic. So, better organization of notes is needed.",
            "comment_grading": "He tries to give most of the good grades, except you did really bad. The attendance is also taken into account, so don't skip lesson. There are one mid-term and one final. He will provide the detailed summary before the exam. If you revise it all, you must know how to do all the questions in the exam and get a good grade.",
            "comment_workload": "Nearly zero workload. You only need to finish some notes which cannot be finished during lesson.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lYRmyYsFoVi2Zx6jl8srSHhoHXmXhdhF",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kitty Leung",
            "date": "Jul 07, 2016",
            "title": "",
            "comment_content": "Content mostly concentrates on phonetic symbols, with interesting topics like comparison between animal and human communications, misunderstanding and miscommunication between the sexes, and gender differences in communicative behavior, with video clips shown quite often and reading materials almost every lessons. It also includes a few simple Korean and Japanese wordings towards the end of the course.",
            "comment_teaching": "The professor is very passionate and motivates students to answer questions by passing the microphone. But students need to jot down notes every lesson as there is no lecture notes given.",
            "comment_grading": "Quite good grade given that I learnt phonetic symbols in junior secondary school, paid full attention in class to jot notes and memorized everything",
            "comment_workload": "1st midterm: 18%<br />2nd midterm: 29%<br />Final: 39%<br />Participation in class and worksheets: 14%",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5A1U4IFp81Tz9vjCK2IgPy7SJ7wwqcYB",
            "semester": "2014-15 Summer",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wakaka",
            "date": "Mar 28, 2016",
            "title": "",
            "comment_content": "Very interesting topic. Although it is just an introductory course of linguistic, it covers many things with examples but not just abstract things like HUMA1000",
            "comment_teaching": "The professor is very nice and teaches using video clips with good explanations.",
            "comment_grading": "Just about 15% students got A range, 35% B range and others are C, D range, which means only half of the class got A,B range.",
            "comment_workload": "There is no assignment at all. If you go to class to take the attendance and try to do the in-class worksheet, you'll get full mark for participation.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "v9JFzljbshhgaIOx2NEJaIaWRIobWWJQ",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "scchan43",
            "date": "Feb 11, 2016",
            "title": "",
            "comment_content": "Rather interesting content. Covers the IPA system for the whole semester, which is useful in daily life.<br /><br />Begins with an introduction of human language system, comparing the similarities and difference between human and animal communication.<br /><br />Also involves some parts regarding how children acquire languages as well as reasons that create communication misunderstandings.",
            "comment_teaching": "The instructor does not upload any notes on canvas. Have to attend lesson in order to get the notes and worksheet.",
            "comment_grading": "Fair grading. Attendance, midterm, a quiz and final. Non-cumulative.",
            "comment_workload": "No workload at all, except attending the lessons. In-class exercises submit right after class.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BXCyxrAe5qBdR0iuAP1sPYIJSZkjGYpX",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YJ",
            "date": "Jan 27, 2016",
            "title": "",
            "comment_content": "introduction to language 其實淨係講linguistics 啦 <br />拼音是個大佬<br />midterm 之前好輕鬆又有趣 <br />講下啲蜜蜂，馬騮點溝通，同埋機器同人嘅溝通<br />點解會有失語症，腦嘅邊part負責語言<br />同埋要背晒啲拼音等等<br />好喇到midterm之後<br />其實都有趣嘅但係要慢慢理解，明白啲linguistics嘅term<br />講下男女嘅溝通模式有啲咩唔同，點解會咁<br />morpheme/allomorph and phoneme/allophone 係乜東東<br />講下日文，韓文（考你點寫）<br />marked 同unmarked 嘅字<br />唔講啦 自己睇個attachment 啦",
            "comment_teaching": "其實佢係幾風趣幽默嘅，爛gag幾多下<br />一定要上堂因為啲notes係上堂派canvas無得dl<br />差唔多堂堂都有handout 同ws，ws要落堂交<br />有好多片睇<br />midterm前有農夫聽，睇下discovery channel 咁啦<br />midterm後都有好多片但係就較學術性，個人認為頗有趣的<br />但係有一樣唔好嘅就係佢勁鐘意講下呢度有講吓嗰度再講返呢度 可能知自己冇系統所以有review list<br />無乜系統（建議帶laptop jot notes) <br />成日考邊度所以都幾好<br />但係呢 成日上堂講考邊度 email又唔係咁架囉（email爲準）<br />問ta ta話其實佢都唔知係點......<br />撇除呢啲佢都講解得好清楚，英文幾好聽啦<br />拼音是重點要等清楚哦～",
            "comment_grading": "堂堂都take attendance ：計分的<br />佢會記得你叫咩名<br />其實個grade 嘅distribution係靚嘅<br />奈何個個都知靚吸引咗好多人諗住chur a range<br />佢有個表話比你聽你呢個分即係咩grade<br />之前我完全唔背啲拼音跟住midterm gg咗 below mean<br />有quiz又係問拼音繼續gg<br />跟住佢send email 恐嚇我話再係咁就會c range<br />然後我洗心革面背晒啲拼音，跟住b都算係咁啦",
            "comment_workload": "I now recap in English <br />ping yum is the big brother <br />最好堂堂review下如果唔係就gg啦<br />無功課 得堂課xdd<br />功課可能就係佢太冇系統要整理整理<br />用word整notes la<br />之前本身用本簿仔點知佢跳topic跳到飛起完全唔知點算",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "VcvJfioQ1SCpprWgLtN4ifX1lWypLe1r",
                    "name": "Review list after Day24 Nov 26",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "304KaNbOTKwehvcvGroulLrZWDhnZBRP",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "xxxxx5",
            "date": "Jan 25, 2016",
            "title": "幾有趣嘅common core",
            "comment_content": "幾有趣 <br />真係學到phonetics 係幾有用<br />重有d關於人類對語言的誤解<br />有對男同女的說話的分析",
            "comment_teaching": "講書好生動搞笑，好鍾意叫人答問題。記得哂成個lecture 成百人嘅名lol<br />每堂會教幾個topic 例如在phonetics教d，gender bias又教d咁，所以上佢堂唔會悶，不過講notes個時會跳黎跳去，比較難跟上lol<br />每堂仲會有10-15分鐘break",
            "comment_grading": "佢都算靚grade 二十幾% A range<br />mid term按佢俾個個scale應該得c<br />final唔知分但最後拎B",
            "comment_workload": "無功課<br />係要背d phonetics<br />會計attendance 但因為上佢堂係有用 同埋唔上會唔明佢教咩 所以基本上都唔會走堂",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "akQ5jIbcf79VQLCoTCVtWzQmmGYYtM75",
            "semester": "2014-15 Fall",
            "instructors": [],
            "is_author": false,
            "author": "mandy87",
            "date": "Aug 22, 2015",
            "title": "",
            "comment_content": "The course is about linguistic. Half of the course content is about English phonetics. If you have learned phonetic before, this would be an advantage to you. The fundamental of Japanese and Korean are also included. The course also involves some interesting topics such how bees and monkeys communicate and how infants acquire language.",
            "comment_teaching": "Professor would upload his ppt to lmes so we have jotted down all the notes. He would sometimes play some videos to us and this would make the lecture less bored. He would remember all the students' names although the class size is quite big.",
            "comment_grading": "The grade is quite good. There are 20% A, 30% B, 30%C. Attendance of each lecture is required.",
            "comment_workload": "This course doesn't have any hw but has classwork which we have to submit it at the end of lecture. There are one mid-term, one quiz and one final. Professor would provide the exam questions and answers on the lecture. Therefore, it is not difficult to get a high mark in exam as all the materials are given in lecture, notes and classwork.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rNEgJGhKhjcZIJElDy6ut16pM5ruXLWC",
            "semester": "2014-15 Summer",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wazowski",
            "date": "Aug 19, 2015",
            "title": "",
            "comment_content": "The content is rather interesting, at least to me. It is nothing about grammar and those stuff we usually get to learn in our language classes. It talks about things like how children learn their mother tongue and how do different gender use language differently.",
            "comment_teaching": "The professor is funny and nice. The only bad thing is that sometimes it is rather difficult to follow in class. The professor tends to jump from one topic to another topic quite frequently, and there are no lecture notes. He does not give model answers for worksheets too, so you might have to ask him after class in case you need them.<br /><br />The good thing is the professor gives handout in every single class, so as long as you have attend every lesson, you should have a free complete set of notes.",
            "comment_grading": "The grading is good. I don't have the final statistic, but the professor has given us the midterm statistics and said the final statistics is quite similar to the midterm one. It should be approximately 22% A, 28% B and 30% C.<br /><br />The exams are rather straight forward too. The professor would tell you the exact number of questions to be asked on each worksheet, e.g. he would ask you two out of five Japanese word out of a particular worksheet. So as long as you jot everything down in class, you should be able to predict how the exam papers would be.",
            "comment_workload": "There are no assignment, and all you have to do is basically fill out the worksheets in class. The worksheets are only for participation marks, so you don't have to worry about the answer.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QOn0RskYY6PA1c04wOL83WEnlY5HRPwP",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1194,
                    "name": "LI, Dechao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Dok",
            "date": "Jan 10, 2019",
            "title": "Don't take it if you don't know Chinese",
            "comment_content": "Overall organised and good overview of linguistics in general. But I suggest not taking this course if you do not speak Mandarin or Cantonese because in the &quot;tones&quot; section there is a lot of Chinese that you have to learn. Although the professor assures you that it is okay even if you don't speak Chinese, there was a 10 point question on the final that requires you to write the tone values of Cantonese numbers.<br /><br />1. Phonetics<br />- Speech organs<br />- Speech mechanism<br />- IPA chart<br /><br />2. Phonology<br />- Phoneme<br />- English, Mandrain, Cantonese<br />- Tones<br /><br />3. Morphology<br />- Morphemes<br />- Word formation processes<br /><br />4. Syntax and phrase structure<br />- Sentence tree structure<br /><br />5. Nature of language<br />- Properties of language<br />- Uniqueness of language<br />- Language divisions<br /><br />6. Languages of the world<br />- Dialects, intelligibility, lingua franca<br /><br />7. Languages and the brain<br />- Human brain<br />- Language centres<br />- Broca's and Wernicke's apasia<br /><br />8. Language acquisition<br />- Innateness of language<br />- Language acquisition phases",
            "comment_teaching": "Very monotone so easy to fall asleep. But the pace is really slow as well, so you can easily catch up after dozing off for 10 minutes or so. His English is tolerable.<br /><br />He uploads each ppt before the start of the lecture on canvas, thankfully.",
            "comment_grading": "Assignment: 10%<br />5 In-class Quizzes: 40%<br />Final exam: 50%<br /><br />Got above mean for all quizzes+assignment, slightly above mean for final, got B+.<br /><br />Final stats: mean=189/240, sd=23, nobody got &gt;220",
            "comment_workload": "Assignment is easy, can be done in 20 minutes using the help of the internet.<br /><br />There are 5 quizzes in total during the course of the semester. He announces that there will be a quiz about 2 lectures prior (also written on lecture slides), so do not miss them. The quiz itself takes around 30 minutes and can be solved easily by memorising the lecture notes. Some multiple choice, filling in the blanks, and free response. <br /><br />Final exam was around 3 hours long but can be finished earlier. The format is similar to the quiz. The final is cumulative, so there will be a lot of things to memorise.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1HOVouGvsSGli7jdfeUdX2bMF7lPDAmD",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ememlol",
            "date": "Jan 22, 2017",
            "title": "",
            "comment_content": "You can learn something interesting and useful, so it's ok if you don't care much about grade.",
            "comment_teaching": "Not organized, often jump from here and there on contents. He also tried to cover a lots of things within limited time. But he tried to be funny as well.",
            "comment_grading": "Harsh Grading! People got quite similar scores in exams, few difference in score really could make a big difference in grade. The questions asked something very trivial and it doesn't make sense.",
            "comment_workload": "No homework, no assignments and projects. Just go class and do revision is enough.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HbCTIuCJ7Q1XXOHBkfNn5kfA6GLq92Iv",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 303,
                    "name": "NG, Walter W. T.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ITSC",
            "date": "Aug 04, 2016",
            "title": "",
            "comment_content": "Intoduction to Language 唔單單係講人類語言<br />呢個Course仲會圍繞住動物同電腦嘅溝通<br />不過呢D係其次 <br />成個Course最重要 midterm Final 都會考嘅就係拼音<br />Summer 讀可能有D chur <br />因為要短時間記得D音<br />Midterm之後就會講下男女之間嘅溝通 BB仔點學語言咁<br /><br />Topic:<br />0. Thinking about human languages theoretically or philosophically<br />1. Phonetics [語音學the general study of speech sounds]<br />2. Animal communication, human language, and artificial intelligence (AI) 人工智能<br />3. Psycholinguistics and neurolinguistics: How does the brain process language?<br />4. Morphology [the study of words]<br />5. Semantics [語義學the study of meaning]<br />6. Syntax [句法學the study of sentence structure]<br />7. Acoustic phonetics 聲學語音學 [the physical 物理properties of speech sounds]<br />8. Phonology [音系學how speech sounds make up a system in a language]<br />11. Sociolinguistics [社會語言學language and society]<br />12. Gender and language [a topic within sociolinguistics]<br />13. Cognitive science 認知科學(How does the brain work?)<br />16. Methodology [方法論remarks on thinking and research methods]<br />17. Methodology: Specific methods or procedures",
            "comment_teaching": "佢第一堂就話年年嘅SFQ都話佢冇Organisation<br />因為佢上堂會講下A走左去講B <br />教得比較跳躍式<br />但係重點呢 佢會連續兩三堂重複講 <br />同埋佢會定期Sd review list比你<br />所以上堂留心重複嘅重點同溫Review list都好夠<br /><br />仲有佢成日搞Gag 上堂都開心嘅<br />不過要上足堂 因為佢所有野都唔會放上Canvas<br />所有嘅Handout同WS都係考試既重點<br />WS上堂之後要交比佢改<br />如果唔係都唔知自己錯咩",
            "comment_grading": "40% Midterm<br />50% Final<br />10% Participation<br /><br />每堂都要簽名計Attendence <br />所以要上足堂！",
            "comment_workload": "Workload唔算大嘅<br />不過要花時間整理下D內容<br />因為佢實在太冇Organisation可言",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}