{
    "error": false,
    "course": {
        "id": 1726,
        "subject": "HUMA",
        "code": "5470",
        "name": "China in Foreigners' Eyes",
        "description": "Given the growing \"China fever\" nowadays and the rising global attention on China as the next superpower, this course aims to explore China \"in and through foreigners' eyes\" by undergoing an in-depth examination of the variety of writings and observations by foreign individuals across different fields and disciplines from early 20th century to now.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            1710,
            1610
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "HMMA 5470",
        "rating_content": 5,
        "rating_teaching": 4,
        "rating_grading": 5,
        "rating_workload": 4,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 306,
                "name": "SHAW, May-yi",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "IDsFCAf0ZmEdyUh3TN8PVX8xdyaZhj7L",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 306,
                    "name": "SHAW, May-yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "pocky_kent",
            "date": "Aug 25, 2017",
            "title": "Good course to go",
            "comment_content": "This course includes some ten writings about China by foreigners of a different time, a different identity and a different nationality. It begins from the Twilight of the Forbidden City by Reginald Johnston to On China by Henry Kissinger. Based on the readings, the students will be asked several questions in class not only about the readings but also issues relevant to the context for discussion. For example, when the lesson was about an extract of John Leighton Stuart's Fifty Years in China about the establishment of Yenching University, not only did we discussed the reading but also ideal university education.",
            "comment_teaching": "Prof Shaw greatly emphasised on interactions between teacher and student. She always appreciates students to speak up in the class to share their own ideas It was therefore not a boring one for us. Besides, for those who intend to listen quietly in class, you will be strongly encouraged to interact with the professor and your classmates.",
            "comment_grading": "It was not that harsh for this issue. I was pleased with my grade indeed.",
            "comment_workload": "Students are required to finish one reading before getting to a class. We are not asked to read a whole book of 300 pages but maybe 1-2 chapters. Comparing with some other PG course, the workload seems comparatively slight In the last lesson, students are required to finish a research about China in Foreigners' Eyes. It seems to me that Prof Shaw provided us with an adequate freedom to choose a topic - students are not required to work on the readings about a variety of issues. For the project, students are required to finish one oral presentation and a written paper. While the TPg students are allowed to finish them in groups and to write a shorter paper of 8-12 pages, RPg students have to finish the project individually and write a longer paper.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}