{
    "error": false,
    "course": {
        "id": 2453,
        "subject": "HUMA",
        "code": "2595",
        "name": "Science, Technology and Modern Life",
        "description": "This course provides students with an introduction to how science and technology have influenced politics, culture and society during the 20th and 21st Centuries. Special emphasis will be placed on new ethical dilemmas present in emerging fields of science and engineering. Classes will mix lectures with discussions, and students will be required to prepare an in-depth final research project.",
        "categories": [
            "Common Core (H)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            1930,
            1830,
            1810,
            1730
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.4,
        "rating_teaching": 3.8,
        "rating_grading": 4,
        "rating_workload": 4.2,
        "review_count": 5,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1020,
                "name": "SMITH, Jenny Leigh",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "ncVGdgCvfbarmMU0IMP307pyD2Qd2Np6",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 1020,
                    "name": "SMITH, Jenny Leigh",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "B.T.",
            "date": "Jun 08, 2019",
            "title": "Professor really bad",
            "comment_content": "Content is so-so. I would say it is more of a HUMA than a science course, or even more harshly, I think it should be retitled to History. What you study is barely historic events, with a slight focus on some scientific contents, like the atomic bomb, Chernobyl nuclear accident, climate changes over the past few centuries, and some aeronautical accident events. However, you will not go deep into the science part, but what you are required to do is to recite the historic descriptive contents and write them on quizzes and exam papers. You have to memorize a lot of items, for most of them you just don't find where the meanings are. For the final exam, you are also required to give essays to justify your views on particular questions. In my opinion, the questions are digging into details too much of particular historic events, resulting in harsh memorization needed.",
            "comment_teaching": "She does not teach bad, she just didn't teach. I have never seen a professor as bad as she was. She never prepared powerpoint, never posted any pre-lecture or post-lecture materials, never gave feedback for quizzes, discussions, or assignments. What she did was merely uploading a few chapters of some books onto canvas and asked us to read(which will be tested), preparing a long script which are passages that she would refer to and read aloud during class time, and a black powerpoint with one full name of a historic guy and his/her face at every slide on every lecture.<br /><br />To be honest, I didn't find any meaning going to class, but attendance is required, you can't choose. <br /><br />She sometimes scheduled the class for quiz or discussion, however, for both, she didn't give the correct answer for quiz nor any feedback for discussion, resulting in that the discussion became super meaningness because you seemed to be answering to your own question raised without any real conversation. I saw someone wrote a long script on his notebook which he 'presented' during the discussion, just for aiming a high discussion score.<br /><br />Moreover, she didn't upload any sources else on canvas, so if you skipped one lesson, or went to the toilet, or lacked focus due to the professor boring presentation, then you are done, you could not pick up until after the final exam.<br /><br />In some lectures, the professor forgot to prepare some materials and the class ended within fifteen minutes. But attendance might have been taken plus it is a 9-a.m., it just wasted our precious time. The opportunity cost of having this class is large.<br /><br />It's just silly.",
            "comment_grading": "Grading is bad.<br /><br />4 quizzes 20% (5% each) (mean = 2.8, 3.1, 2.8, 3.5 respectively)<br />attendace 30% (mean = 26)<br />project(presentation included) 15% (mean = 12.2)<br />in-class discussion 15% (mean = 12.4)<br />Final exam 20% (mean = 14)<br /><br />The grading does not make sense, you gave us a final, but it worths just 20%, so how much effort you expect us to pay on the final? <br /><br />30% Attendance, but nearly half of the classes are not marked with attendance because she or her TA FORGOT to bring the attendance book. It is a 9-am class after all, and you tell us today we don't count? Attendance is by luck, wish you attend a class which is graded.<br /><br />What's more! There is nothing, NOTHING could differentiate the ability of students.<br /><br />First, the quizzes and exams are already both stupid, just a test of thorough memorization. <br /><br />But, get rid of this, in this course, everyone gets very similar points. For all quizzes, mean is about 3 out of 5, nearly everyone gets between 2.5 and 3.5.<br /><br />For projects, the full mark is 15, and no matter how much or little efforts you paid, you receive either 12 or 13, depends on how beautiful and wordy you powerpoints are. <br /><br />For the final exam, nearly all got about 13-15 out of a total of 20 marks.<br /><br />I got overall 80 out of 100, with the mean = 76, and because of the small differentiation, I believe the s.d. should be several marks at most (though it is not released), I might be above 0.5-1 s.d., and still resulted in a B-<br /><br />In short, poor percentage distribution criteria, poor differentiation abilities of exams, and poor gradings.",
            "comment_workload": "It is a humanities course with the course titled in science, but still, it is a HUMA. Don't expect you need not write essays, don't expect you don't need to read, don't expect you can skip attendance, participation and discussion requirement. <br /><br />But overall, it is not a very hectic course, compared to other HUMA, but this might not be a good thing because you lose some ways to differentiate yourself from the others.<br /><br />If you don't mind a C-range, boring content and teacher(maybe another professor who teaches this course might be better, I don't know), and you just want a light workload HUMA and a bare pass to get credits for your Common Core, then this course may still be under your consideration.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dRrWvW45BcviiQnbMf6n1yX0IOAfbOgb",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1020,
                    "name": "SMITH, Jenny Leigh",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ogt",
            "date": "Jun 11, 2020",
            "title": "Interesting but competitive!",
            "comment_content": "The content is actually very interesting but quite random. I am under the impression the professor was given full freedom to do whatever she wants with this course and so she introduced us to stuff she thinks is relevant and worthy of knowing. Nothing too in-depth but a good broad introduction to some specific topics.<br /><br />The course was divided in 5 modules:<br />- Science, technology &amp; ethics<br />- Science, Technology &amp; Psychology<br />- Normal Accidents and Unintended Consequences<br />- Sorting things out<br />- Biopolitics",
            "comment_teaching": "Teaching is particular to say the least. Some will like her teaching style whereas others won't.<br />This semester was ONLINE due to covid19. I actually liked the teaching because she was pleasant to listen to and not boring. She is American so speaks native English. The classes were about 50 minutes long instead of 1h20.<br />The classes constitute of her going through some topics with a black PowerPoint with a few pictures. She doesn't share any slides or notes with students so attending classes is a MUST. You cannot make the content up.<br /><br />One downside is that she is a very slow grader (~3 weeks) for the quizzes. She isn't helping herself out by giving us so many different things to do...",
            "comment_grading": "Participation (Question of the Day): 20%<br />Reading Quizzes (4): 24% (online)<br />Group or Solo Project: 20% (online)<br />Book/ Article Review: 16%<br />Final: 20% (online)<br /><br />Everything was open-book/open-notes because this semester was online.<br /><br />Quiz 1: Mean: 8.2 High: 10 Low: 0 (Me: 10/10)<br />Quiz 2: Mean: 7.7 High: 10 Low: 0 (Me: 9.2/10)<br />Quiz 3: Mean: 7.9 High: 10 Low: 0 (Me: 10/10)<br />Book Review: Mean: 12.1 High: 14 Low: 0 (Me: 14/15)<br />Presentation: Mean: 16.7 High: 19 Low: 0 (Me: 19/20)<br />Participation: Mean: 19.2 (Me: 20/20)<br />Quiz 4 &amp; Final exam (together): Mean: 22.2 High: 30 Low: 0 (Me:&nbsp;&nbsp;30/30)<br /><br />Hence as you can see, grading is very competitive. I ended up with an A only because I didn't score max on quiz 2. Hence to get an A+, you need top score on everything!<br />There were only 45 students in the class, so assuming ~20% get A range that's only ~9 students. Be careful with grading. Mistakes can be expensive.",
            "comment_workload": "Definitely not low but overall OK. Because this semester was open-notes, I didn't study much for quizzes and finals but instead just went through my notes and added information from Wikipedia/other sources to them. You will want to go through her study guides too.<br /><br />Book review deadline fell during a busy period. Luckily, I had decided to work on that a few weeks earlier when I had no other work, so I would highly recommend you doing that too if you can. I did read the book actually, but I can only assume most people don't.<br /><br />For the project you can work alone or in teams. I worked alone so I didn't have to worry about organization but you will have more workload in that case. The presentation was online, which meant I didn't need to learn my script. Instead I put the script in the powerpoint notes and that worked fine. She is open for you suggesting presentation topics so make sure you find something that suits you.<br /><br />Participation was an easy 20%. You need to participate 5 times during the entire semester. If you don't feel like speaking up in class you can answer the question on Canvas.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OEs16NrDcZcRSzwetlTJKsHAfYyckw7M",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "baboon_x",
            "date": "Feb 12, 2019",
            "title": "A 'not-so-HUMA' HUMA",
            "comment_content": "Talks about technology-related issues (mostly accidents) and the humanity-related reasons behind.",
            "comment_teaching": "The class is well-guided. There are lots of videos to watch every time. You can grab some senses for the reviews/ essays/ project from them so I'd say it's fine.<br />I have to say sometimes I don't agree with the instructor's point of view (and may even consider him radical), but everybody has his own points and students do have the right and chances to speak out their own opinions so it's OK.",
            "comment_grading": "Honestly, I didn't expect it to be nice cuz it was my first HUMA lesson in university and people kept telling me that the grading of HUMA lessons is just a mystery. But it turned out to be great.",
            "comment_workload": "Apart from the in-class writing test, documentary review, team project and project report, there are also lots of readings to be done every week. I didn't read most of them because of the great amount. But some of the reading materials turned out to be a great help for the essays/ project.<br /><br />Personally, if you don't wanna read so much but still would like to nail the reviews/ essays/ project, I STRONGLY recommend you to read about/ have some basic knowledge of these people (and their thoughts &amp; works):<br />Georg Wilhelm Friedrich Hegel (Philosophy of Right)<br />Francis Fukuyama (The End of History and the Last Man)<br />Hannah Arendt (Banality of Evil)<br />Max Weber (disenchantment &amp; re-enchantment; instrumental rationality &amp; value rationality)<br />Jean Baudrillard (simulation, hyperreality &amp; consumerism)<br /><br />Also, background knowledge in the science &amp; engineering field is very important in this course.<br /><br /> So if you're from SSCI or SENG, good at writing analytical documents, have enough background knowledge, and don't want to do a HUMA HUMA, then this course would be a good choice for you.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aisyXllWjW3f4iuTkEseG8ZSEXiUfOuP",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Emcv153",
            "date": "Jan 18, 2019",
            "title": "",
            "comment_content": "The content learnt in class is incredibly easy to understand, and no background knowledge of humanities or science is really needed to excel. We discuss multiple controversies revolving around ethics issues of science and technology.",
            "comment_teaching": "Professor Wang's style of lecture can be quite informative and monotone, but it's not necessarily a bad way of learning. We watch a lot of videos and documentaries, and the professor usually presents us with powerpoints to follow his presentation.",
            "comment_grading": "The professor and TA graded the in-class test and essays together. They are both extremely lenient with grades, so if you're familiar with what the topic in class (or just attend and listen in class) you should be fine with getting an A. Most of our assignments are writing-based.<br /><br />Attendance and participation: 25%<br />Group presentation: 15%<br />A 1000-word documentary review: 15%<br />Research project and a 1000-word report: 35%<br />In-class tests in Week 5 and 9: 10%<br /><br />The research project was counted as our final exam. We had no midterm. Just make sure you come to class each day and listen to at least half of what the professor is talking about. Since we ran out of time, the professor decided not to have the second in-class test in Week 9, but if you were dissatisfied with the results of the first in-class test, he allowed you to take the second. The in-class test just comprised of a writing assignment.",
            "comment_workload": "Each week, we had one looooong additional reading to do. We wrote questions about the passage and uploaded them. Most of the time, I just skimmed through the reading titles and made up a question. Apart from the final essay and presentation, there is not much to call homework in this class.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "HgWvQoPCFjtp3TU7VRk0H3IY3DL0fApR",
                    "name": "HUMA 2595 Syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "f2MlOpq03pEmUnfDX1SPsjpRzjkHn8Ox",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 1020,
                    "name": "SMITH, Jenny Leigh",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ams",
            "date": "Jul 14, 2019",
            "title": "Huma with less essays",
            "comment_content": "Modules : <br />1. Science, technology &amp; ethics<br />2. Normal Accidents<br />3. Pollution, Climate Change and Facts<br />4. Your own choice for Presentation<br />5. Standards and Surveillance",
            "comment_teaching": "She is very different from most other UST professors as she doesn’t give out too much information if you don’t attend class, she will only show ppt’s in class with pictures and talk most of the time so your own notes from the lectures are the most important resource. So attending the classes for this course is very important. She does her best to make the class enjoyable with fun facts and gives a lot of information about each topic.",
            "comment_grading": "Grading:<br /><br />Attendance &amp; Participation: 30%<br />Reading Quizzes (4): 20%<br />Group Project 15%<br />Group Discussion (3) 15%<br />Final: 20%<br /><br />You will get good grades as long as you keep up your attendance especially since the attendance is a higher percentage than even the final. However she will not give you attendance if you go to lessons and just sleep, if she can recognise your face and maybe name then she will probably give you a high attendance grade",
            "comment_workload": "The workload is not too high but it is consistently there for the whole sem, so if you keep doing the work you need to throughout the sem and don’t procrastinate too much you won’t feel a high workload and maybe even less workload than most of your other courses. The most workload is probably the project as most people work hard and get a high mark in the project. I suggest you make friends early on as she will let you make your own groups for the project otherwise you will be randomly stuck with some people you do not know. There are also some readings that you have to go trough for each module. As long as you have a good idea of each reading you will get good marks in the quizzes.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}