{
    "error": false,
    "course": {
        "id": 2700,
        "subject": "IEDA",
        "code": "2010",
        "name": "Introduction of Industrial Engineering and Decision Analytics",
        "description": "This course provides an introduction to industrial engineering and decision analytics (IEDA). It comprises of two parts. The first part introduces basic IE analytical tools, such as optimization, game theory, probability and statistics, at a conceptual level. In the second part, many of the IEDA practical concepts, including production and operations management, logistics and supply chain management, financial technology are introduced.",
        "categories": [
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2110,
            2010,
            1910,
            1810
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"IEDA\" data-code=\"2200\" href=\"/review/IEDA2200\" target=\"_blank\">IEDA 2200</a>",
        "rating_content": 4.4,
        "rating_teaching": 4.5,
        "rating_grading": 4.17,
        "rating_workload": 4.38,
        "review_count": 42,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 948,
                "name": "WANG, Xin",
                "count": 35
            },
            {
                "id": 360,
                "name": "QIU, Xuan",
                "count": 6
            }
        ]
    },
    "reviews": [
        {
            "hash": "2ZaPVHqmOiPh1pLekNIGkgNrz7c1hDxF",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "alphacarrot",
            "date": "Jan 18, 2020",
            "title": "Danger: Steep Drop",
            "comment_content": "A comprehensive, yet very basic introduction to the various concepts of industrial engineering.<br />In each topic, only the most simplified model and one or two math formulas are discussed.<br />So just remember a few math formulas such as Little's Law and Critical Ratio are sufficient for most problems in the exams.<br /><br />Course Schedule:<br /><br />Week 1 Introduction to IE: What Is IE? <br />Week 2 Optimization<br />Week 3 Game Theory<br />Week 4 Probability Basics<br />Weeks 5-6 Process Analysis<br />Week 7 Project Management<br />Week 8 Midterm<br />Week 9 Waiting Line Management<br />Week 10 Supply Chain and Inventory Management<br />Week 11 Operations Strategy<br />Week 12 Revenue Management<br />Week 13 Financial Engineering",
            "comment_teaching": "Most of the materials is so straightforward that one can understand them simply by self-studying the lecture slides at home. <br />However, WANG, Xin is a very good professor in terms of teaching. His accent is easy to understand. He explains things clearly. He maintains a constant pace throughout his lecture which is neither too slow nor too fast. He always finishes the last lecture slide around 3 minutes before class ends.<br />That is probably why his class attendance rate is over 90% even though attendance is not taken.<br />TA is also a very nice person, but the tutorials are not useful at all since the materials are so easy and well-explained during lecture.",
            "comment_grading": "Since the content is very basic and there are many smart students, most grades are clustered around the 90% mark.<br />As a result, the curve is extremely steep between B and A range.<br />According to me and two of my friends, the curve from overall mark to course grade is as follows:<br />89% --&gt; B+<br />90% --&gt; A-<br />91% --&gt; A<br /><br />So be very careful in exams. One careless mistake can cost you one or two levels of grade!<br /><br />Assignment: 10% (4 in total)<br />Online quiz: 10% (Full mark is given as long as they are completed on time) <br />Mid-term Exam: 40%<br />Final Exam: 40% (Cumulative on the syllabus, but this year only second half of the material was covered)<br />Bonus points: 3% for class participation",
            "comment_workload": "Not much workload except the four assignments, which do take some time. Marks are taken down for the smallest mistake, so be sure to double check your work. But these assignments do not make much difference in final grade anyway because their weightings are so low.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "wXxc8HisU7LGB9Ofbj4ozaRriqf01F1B",
                    "name": "Syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "MiRfB9UzRCoWZmQeGMkU8FX2ZOVh4UUR",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "EMK",
            "date": "Dec 30, 2022",
            "title": "New content this sem",
            "comment_content": "L1: Introduction<br />L2: Optimization<br />L3: Probability basics<br />L4: Project management<br />L5: Location analysis<br />L6: Inventory management<br />L7: Process selection and Facility layout<br />L8: Forecasting<br />L9: Revenue management<br /><br />Be aware of L4, L5 and L6. Pay extra attention when doing questions of these topics or you will lose marks because of careless mistakes.<br /><br />Lots of the contents were changed when compared with other semesters, I was faked by the reviews. Originally everything is similar to those in ISOM2700 but now only some of the topics are the same, sad.<br /><br />To be honest, all the topics are not difficult so I guess everyone can handle them if enough attention is paid. The only thing that makes the different is your carefulness. <br /><br />HOWEVER, there is a group project which you have to form a group of 5-6 by yourself. In the project, you have to study a real-world problem in Industrial Engineering and Decision Analytics. The following are the requirements:<br />– Clearly identify the problem you want to solve<br />– Explain the importance of your work<br />– Systematically describe the current practices<br />– Propose/develop promising solutions to the problem, and/or <br />&nbsp;&nbsp;&nbsp;evaluate the consequences with the proposed solutions<br />Presentation and report are needed.<br /><br />Because of the group project, it is strongly recommended that year 1 students SHOULD NOT take this course as one of your Engineering Introduction Courses. Don't take the risk of being free-rided (sadly I had a free-rider in my group). Another reason is that you will be killed if you are not careful enough during the exams.",
            "comment_teaching": "This semester, there was only 1 lecture every week but the lecture lasts 2 hours. <br />The professor's English is quite good but sometimes she will not speak to her microphone when writing on whiteboard.Therefore, you can't hear what she is saying. Also, you can't see what has been written down on the board unless you take a photo. However, what she wrote on the board are the answers of in-class practice. NO answer is provided in PPTs so you have to jot them down carefully.<br /><br />PPTs are quite orgainised and clear. <br /><br />No attendance was taken for tutorials and I found them not very useful so skipped nearly all of them.",
            "comment_grading": "Homework: 10% ( take best 3 out of 4)<br />Participation: 5% (&nbsp;&nbsp;should be in form of a sudden quiz)<br />Project: 15%<br />Midtern: 30%<br />Final: 40%<br /><br />For exams, cheat sheet is allowed. Although the final is so-called cumulative, exactly what topic is included will be announced in exam review session. <br />Exams are not difficult but you have to be careful enough. You will have enough time for double check.<br /><br />For project, I will say it is quite time-wasting. A lot of research have to be done so as to make your work sound. However, it is very likely that you will start your work 1 months before the final period. Therefore, it might be quite stressful.<br /><br />No marks for final and project is released when grade was given.<br /><br />Participation : 5/5<br />Homework : 10/10<br />midterm: 27/30 ( 90/100 mean 67.1/100 ) <br /><br />Letter grade: A-<br />should have no big problem on final so it should be due to my group project.",
            "comment_workload": "Homework are quite light, only 4 homework for the whole semester.<br /><br />Quite heavy workload on group project, it is strongly recommended that you should start your work early.<br /><br />No much revision can be done, no past paper nor practice paper are given.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2dAif6CBINuCVWaOEhTxDQMETni1WAIW",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GawrGura",
            "date": "Apr 15, 2020",
            "title": "",
            "comment_content": "Lecture Topic:<br />1.Introduction to IE: What Is IE?<br />2 Optimization<br />3 Game Theory<br />4 Probability Basics<br />5 - 6 Process Analysis<br />7 Project Management<br />8 Midterm <br />9 Waiting Line Management<br />10 Supply Chain and Inventory Management<br />11 Operations Strategy<br />12 Revenue Management<br />13 Financial Engineering<br /><br />Some logics are similar to Econ like Division of Labor ，Interchangeability ，Game Theory<br />Also teach about simple Probability and statistic.",
            "comment_teaching": "Really good, Prof Wang is nice and willing to answer all the question. He always asks some interesting question for us to develop our sense. I really enjoy having his Lecture.<br />The Tutorial is also quite good. My TA is Terence CHEUNG which is also very nice. The tutorial mainly focus on solving questions and assignments. But also will talk little about the lecture notes. You can ask Terence question after the class and he is glad to answer u about it.",
            "comment_grading": "Assignment: 10%<br />Late submission will have 20% penalty for each day past the<br />deadline. And it will not be accepted after two days past the deadline.<br />The best 3 grades out of 4 assignments will be used.<br /><br />Online quiz: 10%<br />As long as you complete them in time, you will receive full credit.<br />Late completion will have 20% penalty for each day past the<br />deadline. The grade is given by the system automatically and we<br />cannot modify it.<br /><br />Mid-term Exam: 40%<br />Cover all the materials before the mid-term (up to project<br />management)<br />Closed book and notes, a double-sided A4 cheat sheet is allowed<br /><br />Final Exam: 40%<br />Comprehensive, with an emphasis on the second half<br />Closed book and notes, a double-sided A4 cheat sheet is allowed<br /><br />Class participation: bonus 3%<br />If you have asked or answered a question in class, please write down your name on a piece of paper and turn it in after class<br /><br />Remember to do this I always ask a question in lecture but do not know need to hand in the paper thus I lose the bonus!<br /><br />I get an average of 80% in assignments and full marks in all the quiz. Both Midterm and Final Exam got near mean. And my final grade is B<br />So the grade is quite fair but definitely not a course for u to 刷grade.",
            "comment_workload": "The workload is low, the only homework you need to do is the assignment. It is easy to do that if u attend the Tutorial session.TA will talk about the assignment.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "92GZgLih330YQI3uk9SfpiXHd3Yo5q3M",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gonpachirou",
            "date": "May 24, 2022",
            "title": "Super technical course but it all seems easy at the end!",
            "comment_content": "L1 Optimization: Linear programming and beyond<br />L2: Game theory<br />L3: Game theory II<br />L4: Probability basics<br />L5: Probability basics II<br />L6: Productivity and Process analysis<br />L7: Process selection<br />L8: Project management<br />L9: Waiting line analysis<br />L10: Inventory management<br />L11: Newsboy model<br />L12: Revenue management<br />L13: Overbooking<br />L14: Forecasting<br />L15: Supply chain management<br />L16: Quality management<br />L17: Financial engineering<br />L18: Exam logistics<br /><br />Some topics are easy (game theory and forecasting) some were learned in high school (probability basics and linear programming) and the rest are new and quite challenging.<br />Watch out for waiting line analysis, overbooking, and process analysis.",
            "comment_teaching": "Prof. Wang knows what he's talking about so the lectures were pretty fulfilling and insightful.<br /><br />In L10 (inventory management) we played a game which was extremely fun. Some people just purposely drove the booking quantities to insane numbers (~10 million) which showed up in the results charts and made everyone laugh. It was a good time.",
            "comment_grading": "Assignment: 15%<br />Online quiz: 15%<br />Final Exam (OPEN NOTES): 70% <br />Bonus points: 3% for class participation<br /><br />I didn't get the bonus points because I was not in Hong Kong ;(<br /><br />Tea (my stats):<br />Homework (100%)<br />Final exam (54/70)<br />-- Final grade = A-<br /><br />*Note: 54/70 was one point below the threshold for A. My friend who got the same grades I did in the homework got 55/70 and that translated to an A. Really unfortunate but oh well!",
            "comment_workload": "Most of the work was towards the end (revising for the final) because as you can see in the contents section, there is A LOT to review.<br /><br />Attendance for lectures is optional and having skipped a few lectures myself (reasons unspecified), I can say that catching up will take ~2-3 hours per lecture. <br /><br />I do not regret taking this course despite the unfortunate grading incident",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xjCnA5MikOUknvWG0ntqcQ3GpUKVhKts",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Caramel",
            "date": "Jan 06, 2022",
            "title": "Raised Engineering students' interest towards Business lol",
            "comment_content": "I recommend DSE M1 people who've learnt basic calculus and probability stuffs like normal distribution probability to take this course. As for course content please go to the last review done by my classmate.<br />As a Y1 student who didn't take ECON/BAFS in DSE, I was bit <br />confused at the beginning and regretted of taking 2xxx course, especially the game theory (firm competition equilibrium was bit difficult for me to apply) but I overcome it with me interest towards optimization and business strategies.<br />The course content are so practical that they have solved my confusion in the past like why a company allows overbooking,why Disneyland have so many visitors though long queues are everywhere and how can suppliers make the best use of money and labors. I did feel like I am learning something I should learn as a university student and preparing for my career,if not,for the real world rules.",
            "comment_teaching": "Professor WANG's teaching is the best among all the professors I have met in my 1st semester in UST. His English is comprehendable and he used key words&amp; real life examples to link ideas and boost student's brainstorming&amp;memorization.<br />(If you find it hard to digest the information, you should probably replay lectures afterward cuz your brain might have generated some questions you got confused)<br /><br />TA's are so nice and helpful that they will reply your questions through email detially.(though they won't answer questions about assignment)",
            "comment_grading": "Assignment(count the highest 3/4): 15%<br />Online quiz(unlimited attempts): 15%<br />Final Exam (in person): 70%&nbsp;&nbsp;&nbsp;<br /><br />Open notes final exam( make sure you do the pastpapers, apart from sample paper given)<br /><br />70% is a lot of weight, I pass the exam but I was below mean few marks, I preview that I'll get B- but turns out is a B (all my assignment and quizes are almost full mark and on mean,fyi the mean is always higher than 9/10),so I think the course is good grade for me cuz my dedication and love towards this course got rewards.",
            "comment_workload": "Not a lot of workload(as long as you don't have other courses having similar deadlines). 1 assignment/month, some online quizzes/week.<br />My friend who really good at probability and ECON didn't even have to replay every lectures/attend lectures but he did read every ppt,turns out he got higher grade than me.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rgEFcHgh7LMzN6KNrPZ4NxZxMqt9nh1K",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nussun54",
            "date": "Mar 25, 2019",
            "title": "Industrial Engineering and Modern Logistics",
            "comment_content": "Week 1 Introduction to IE: What Is IE?<br />Week 2 Optimization<br />Week 3 Game Theory<br />Week 4 Probability Basics<br />Week 5-6 Process Analysis<br />Week 7 Project Management<br />Week 8 Waiting Line Management<br />Week 9 Supply Chain and Inventory Management<br />Week 10 Midterm<br />Week 11 Operations Strategy<br />Week 12 Revenue Management<br />Week 13 Financial Engineering<br /><br />Had no clue what was Industrial Engineering was before enrolling in the course. In the end thought a lot of it was quite interesting albeit not the traditional &quot;engineering&quot;. For those who do not know what IEDA is about, you will be surprised.",
            "comment_teaching": "Prof. Wang really tries hard to make sure you are able to understand the concepts and topics through a lot of different ways and even had a game set up in a class after the midterm so we could understand what one of the concepts were about. Sometimes hard to communicate with him as he might not understand your questions fully, but he will try his best to ensure you understand. Really helpful and nice and the lectures were mostly pretty good I thought although there is a lot of content. A lot of examples are done during class which reinforces all the content learned. The grading scheme pretty much forces student engagement which does make the class somewhat interesting.",
            "comment_grading": "Assignment: 10% <br /> - The best 3 grades out of 4 assignments will be used<br />Online quiz: 10%<br /> - Doesn't matter whether you get all correct answers or all wrong answers. As long as you complete them in time, you will receive full credit.<br />Class participation: 5%<br /> - If you have asked or answered a question in class.<br />Midterm exam: 35%<br />Final Exam: 40%<br /> - For both exams an A4 cheat sheet can be used.<br /><br />Mean + 1 S.D. for both exams - A+ in the end. <br />Grading is pretty fair I thought. (Midterm and Final were out of 35 and 40, so range of grade isn't huge as mean were quite high already) Cheat sheet is not very important, as there are a lot of calculations that require understanding of the topic rather than just facts, but it is good so you do not have to remember the equations.<br /><br />Midterms: Mean = 29.3/35; S.D. = 4.0<br />Finals: Mean = 29.35/40; S.D. = 6.15",
            "comment_workload": "3 hours lectures per week<br />1 hour tutorial per week <br /><br />Not a lot of work overall. 4 assignments and only counts your best 3. So if you get full marks for 3 of them you can just not do the 4th one. Any questions you may have on ask after the tutorial or ask the Prof. directly. <br />Just complete the quizzes on time (you could just randomly click on different options and you would still get full credit). <br />Tutorials are somewhat useful although no attendance is required. It provides some harder problems that will not be seen in the lectures, so might be useful to go.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vpPiSUW9qyJ2zXobvkMgGfPhbeQmyshx",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Asazheng",
            "date": "Jan 28, 2023",
            "title": "Good",
            "comment_content": "内容相对较零散，都是不同的tools分开讲，考虑到是个introduction课也还算合理",
            "comment_teaching": "有很多答疑时间，关于project不懂的也可以去问<br />ppt很详细复习的时候完全可以按着ppt来",
            "comment_grading": "考试普遍较简单而且给龟也比较好",
            "comment_workload": "半期前还好，<br />半期后workload稍微大一点的就是group project，后期会需要大量时间在小组作业上，肝一点点就好",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KNVESY8xJoLHigrJGbQePhfQSNnro1aK",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Magic Wand",
            "date": "Jan 03, 2023",
            "title": "",
            "comment_content": "1 Introduction <br />2 Optimization <br />3 Probability Basics <br />4 Project Management <br />5 Inventory Management <br />6 Location Analysis <br />7 Process and Layout <br />8 Forecasting <br />9 Revenue Management<br /><br />All involve some knowledge of different areas of the IEDA course a little bit. However, in terms of the time limit, the knowledge is not being taught very deeply. As well, it basically just taught us how to use the methods because it is hard to explain those proofs of the methods in just an intro course.",
            "comment_teaching": "I think her teaching is appropriate, the sound is enough, easy to follow if you concentrate. <br /><br />However, the TAs are not doing good. Some of the tutorial lessons are canceled without noticing us, leaving us waiting in the room for half an hour which was a complete wasting time.",
            "comment_grading": "Homework&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10% <br />Participation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5% <br />Project&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;15%&nbsp;&nbsp;<br />Midterm Exam&nbsp;&nbsp;30% <br />Final Exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;40% <br />The grading is good. As well as you memorize the methods and know how to use them, a B is ensured to have.<br /><br />For me, I get a B+ with a higher-than-average result.",
            "comment_workload": "The workload mostly comes from the project. Since the groups are competitive, we have to collect the data, use a method and summarize it into the PowerPoint and report and present it to other groups.<br /><br />The homework is basically 1-2 weeks once, not a heavy workload.<br />The exams are just a few questions regarding the chapters(one question is relevant to one chapter).",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LXxTDsStKGoKS4lXElUBPDT4k64gD5u2",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "/",
            "date": "Dec 28, 2021",
            "title": "Great course",
            "comment_content": "Have a look at the syllabus attached below.<br /><br />Contents are well-organized, as the prof mentions many topics but only touches on the most basic concepts and related formulas, which is just enough for most students but also intriguing for the ones wishing to take on higher IEDA courses. The course really gave me a new outlook on what Industrial Engineering is.<br /><br />Most lectures include some theoretical concepts, derived formulas and example problems. Really similar to a high school math lecture, just with more applied topics, thus making the course very student-friendly. Apart from those, prof sometimes gives example from real-life Industrial Engineering, which makes the lectures more insightful.",
            "comment_teaching": "Prof Wang Xin has a mainland accent but quite easy to follow. He gives clear explanation of concepts and is very willing to answer lots of questions from students, which actually seems to annoy some people as his lectures get disrupted by continuous questions :D<br /><br />Tutorials would often summarize main concepts and then solve applied math problems. TAs' pronunciation are not really good but they are also really willing to help out.",
            "comment_grading": "Online quizzes: 15%<br />Assignments (best 3 out of 4, 5% each): 15%<br />Final exam: 70%<br /><br />Online quizzes are very simple, mostly contents straight off the slides. You are given unlimited attempts so make sure to get full 15% before the deadline.<br /><br />Assignments are not hard. It is crucial to review the last year's assignments' sample solution so you know what to write in your answers. Try not to make simple calculation mistakes.<br /><br />Final exam: Well this seems to be the problem with the course. Even 3 hrs won't be enough for you to solve very long questions which are even harder than the assignments and contain many steps to go through (as previous reviews say, maybe this is a &quot;anti-cheating measure&quot;). I was really shocked after not being able to finish the exam since the previous quizzes and assignments are much easier. I understand that the TAs are also willing to give points as long as you show some effort but it was really difficult.<br /><br />P/S: Seems like grades are also very competitive. One mistake on the final exam can cost you a lot.<br /><br />My grades:<br />Online quizzes: 15 (very high mean, I think must be approx 14.87)<br />Assignment 1: 7.2 (mean 8.26) (I submitted this one late and screwed up the calculations, it was actually very easy)<br />Assignment 2: 10 (mean 9.19)<br />Assignment 3: 10 (mean 9.32)<br />Assignment 4: 10 (mean 8.8)<br />Final: 59 (mean 40.8)<br />Total: 89<br />Grade: A",
            "comment_workload": "Very light, concepts can be grasped with ease, you only need to be careful not to miss the quizzes and assignments. No extra work needed after class. Also, try to study carefully for the hard questions in previous final papers.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "WydY7N0yLVD7JpmllqnePjg3ufMEjwa0",
                    "name": "Syllabus (1)",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "Hx00IrZMVAeu7Azs1v6lBbWXixBSmrZU",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "itsrocky",
            "date": "Nov 24, 2021",
            "title": "Fantastic Course!",
            "comment_content": "I would highly recommend this course for students looking to start their own businesses, or seeking to work in a management position in a business.<br /><br />Industrial Engineering is sometimes known as &quot;The Science of Better.&quot; Better in the sense that you can run your business better and more efficiently.<br /><br />This course provides a high-level overview on various problems one may encounter in a business, as well as solutions/techniques to resolve them.<br /><br />Wang Xin touched on the following topic areas during the semester:<br />- Game Theory<br />- Probability<br />- Productivity<br />- Waiting Lines (Queues)<br />- Inventory Management<br />- Revenue Management<br />- Demand Forecasting<br />- Supply Chain Management<br />- Quality Management<br />- Financial Engineering<br /><br />You are only taught the basics for each concept, just enough to intrigue you should you be interested in the subject.",
            "comment_teaching": "Wang Xin is an engaging lecturer. He does occasionally read off the slides but he is very proactive in answering questions.<br /><br />He's a former Tsingua and UT Austin graduate with a wealth of operations research experience under his belt.",
            "comment_grading": "Final Exam: 70%<br />Assignment: 15%<br />Online Quiz: 15%",
            "comment_workload": "We had a total of 4 assignments and 8 quizzes throughout the semester. <br /><br />The assignments are doable, I would suggest that students go through the &quot;Old Assignments&quot; folder on Canvas in which the TAs post the questions and marketing schemes for assignments in the previous year.<br /><br />The quizzes are very easy provided that you know the material. Quizzes are in a MCQ format with unlimited attempts.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zvgmcCXQoBRDk0w0marSilVLjo6W9AGe",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "69verynice",
            "date": "Jan 20, 2021",
            "title": "Very nice course, recommended",
            "comment_content": "Basically operation management. I have zero business background but still found this course manageable and fun to learn. According to my relative with business background, the content included in the course is not 'basic', but 'simple' enough that everyone can handle it.<br /><br />Expected Learning Outcomes and Course Objectives<br />•Obtain a basic ability to apply mathematics and engineering knowledge to formulate and optimize an operation of a business.<br />•Obtain a basic knowledge of industrial engineering, production, logistics and supply chain management and the related contemporary issues.<br />•Understand the impact of engineering solutions in a global and societal context and on a broad range of issues, including environmental and social responsibilities.",
            "comment_teaching": "Both prof and TAs are the best. They are patient and willing to answer all of your question, and their explanation is helpful.<br />I feel like the IE department have too few students, cuz prof often promote their department in lecture. Just like watching Ads before watching a YouTube video, as long as the main content is awesome, it is not a big deal.",
            "comment_grading": "No Mid-term. Grading is fair but not as good as expected. Maybe the course is too easy, everyone manage to get a high score. The mean and SD of final exam are 74% and 16.7% respectively. My result was 0.5 SD above mean(~82%) and got almost full mark in quizzes and assignments, but got a B+ only at the end. I guess A range requires at least 85% in final, not easy.<br /><br />Grading Scheme<br />Assignment: 15%<br />Online quiz: 15% (Out of class and have infinite attempt, basically guaranteed full mark)<br />Final Exam: 70% <br />Bonus points: 3% for class participation",
            "comment_workload": "Quite light.<br />There are four assignments in total, each of them take up to 2 hours to finish, it is easy to find similar example from ppt slides so don't worry about it. Quizzes are just a few basic conceptional questions. But the exam is a bit challenging, some questions are trickier than examples provided in class. Tho it is an exam so it is normal to be harder than normal practice right?",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FJ8v52STihblYa7PksAOqFGpJ62v0VVW",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Flynn ZHANG",
            "date": "Jan 12, 2019",
            "title": "",
            "comment_content": "This is a course mainly designed for year 1 students. It introduces the basic concepts and some simple models about Industrial Engineering. The maths in this course is not difficult at all. <br />This course is devided into two parts. One is the basic concepts and tools such as game theory and basic probability, the other is the simple applications of those above, including queueing theory, project management, supply chain management and so on.<br />Generally, they are not hard to understand.",
            "comment_teaching": "He taught in a very humorous way, trying to introduce every concept as detailed as possible. Although he did not check attendance at any time, it was good to attend every class to get a deeper understanding about the contents in his ppt. Besides, every week he might introduce different fields of Industrial Engineering, so it would be easy to get lost if you skipped even one single time.<br />He is always willing to answer any questions at any time. You can find him easily at his office after class. He also replies emails swiftly.",
            "comment_grading": "It mignt be helpful if you often go to find him and let him know your name. <br />The tests are fair and comprehensive.<br />I got around mean in midterm and around 1 SD higher than mean in final, receiving a B+ at last.",
            "comment_workload": "No workload.<br />There are only four assignments, each of which is not hard and may not take too much time. If you have problem, you can seek him or TAs for help at any time. It mignt be great if you have a friend to do the assignments together.<br />Online quizzes are also graded, but you will get full marks as long as you finish them in time regardless of correctness.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "TK9wgkCSuEBGN1FcBRrwAeJY3uV8N7Ej",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sancho",
            "date": "Dec 02, 2018",
            "title": "Fairly good",
            "comment_content": "The course gives a pretty good general understanding of what industrial engineering is. The content is quite wide, covering some interesting commonly occurring problems - like, how to predict the length of a queue before a counter. However, since it is an introductory course, one may feel the knowledge they get is rather superficial, as the course does not suggest mathematical derivation of the formulae used. Nevertheless, It still requires some basic math knowledge because calculus will be used a couple of times (A-level is more than sufficient). <br /><br />The presentations are good enough, but some grammatical errors may put you off a little<br /><br />Overall the content taught is interesting but quite commonsensical and easy to understand<br /><br />Course Schedule<br />Week 1 Introduction to IE: What Is IE? <br />Week 2 Optimization<br />Week 3 Game Theory<br />Week 4 Probability Basics<br />Weeks 5-6 Process Analysis<br />Week 7 Project Management <br />Week 8 Waiting Line Management<br />Week 9 Supply Chain and Inventory Management<br />Week 10 Midterm (Cover Materials in Weeks 1-7)<br />Week 11 Operations Strategy<br />Week 12 Revenue Management<br />Week 13 Financial Engineering",
            "comment_teaching": "The instructor was kind and friendly, but appropriately strict too. He tries to answer all the questions asked and nicely explains the content. The slides carry enough information, but lectures do help to better absorb it<br /><br />There is a significant problem with the English level, unfortunately, as he may not be able sometimes to find the words to answer a question or explain a concept in details.",
            "comment_grading": "Assignment: 10%<br />Online quiz: 10%<br />Class participation: 5%<br />Mid-term Exam: 35% (It will cover all the materials before the mid-term)<br />Final Exam: 40% (Comprehensive, with an emphasis on the second half)<br /><br />Simply answering quizzes in due time gives you a full mark<br /><br />It is quite easy to get a good grade, but some questions on exams ask you to memorize definitions<br /><br />However, TAs may sometimes deduct marks for ridiculous &quot;mistakes&quot; - like forgetting a dollar sign at the end of the solution",
            "comment_workload": "4 assignments and weekly quizzes are all you have to do<br /><br />Preparing for mid-terms/finals is nothing special",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vDM2Zjori03sDnpcJmcHIPfzeBMLR1QF",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hi there!",
            "date": "Aug 21, 2023",
            "title": "",
            "comment_content": "Content:<br />L1 - Introduction<br />L2 - Optimization<br />L3 - Probability<br />L4 - Project Management<br />L5 - Location Analysis<br />L6 - Inventory Management<br />L7 - Supply Chain Management<br />L8 - Forecasting<br />L9 - Revenue Management<br /><br />The content is very similar to isom 2700 - Operations Management. Therefore, as a business student, I find it very easy to understand and catch up.",
            "comment_teaching": "Prof Qiu is a super nice and patient professor. Although sometimes she may not explain some concept clearly, she always make sure we understand the concept before moving on. Questions related to the content are always welcomed. If you want to understand the content more thoroughly and do more exercise, remember to attend all the tutorials! They are super useful!",
            "comment_grading": "Homework:(10%)<br />Homework 1: 100/100<br />Homework 2: 85/100<br />Homework 3: 100/100<br />Homework 4: 100/100<br /><br />Midterm(30%): 82/100 (Average : 70.2)<br />Final(45%): Not Disclosed<br />Project(15%): Not Disclosed<br /><br />Final Grade: A<br /><br />I didn't not perform very good in my final and project but I still got a A eventually. I would say the grading is quite good.",
            "comment_workload": "The workload is quite high as a common core (CC) course. There are 4 homework, one mid term, one final and one project. However, all the mt, final and project are easy.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5i0vjOfxnTgfavu1tpy6FmAmQLpatgCA",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sunfly",
            "date": "Jun 08, 2023",
            "title": "Good course, good teaching",
            "comment_content": "Before midterm: <br />-Introduction<br />-Optimization<br />-Probability Basics<br />-Project Management<br />-Inventory Management<br />-Location Analysis<br /><br />After midterm: <br />-Supply Chain Management<br />-Forecasting<br />-Revenue Management<br /><br />The contents are quite easy but useful for solving practical problems.",
            "comment_teaching": "The professor demonstrates a commendable level of patience and willingness to provide guidance and recommendations to her students. Her lectures are highly engaging as she incorporates practical examples and games to enhance the learning experience.",
            "comment_grading": "Homework: 10%<br />Project: 15%<br />Midterm Exam: 30%<br />Final Exam: 45%<br />The best 3 grades out of 4 assignments will be used for the final homework grade. <br /><br />To get good grades, you need to attend every tutorials to get familiar with the contents and approaches taught in lectures. <br /><br />The midterm and final exams are easy but competitive. So you should be very careful in exams.",
            "comment_workload": "There are only 4 homework assignments and 1 project. So the workload is adequate for such an introductory course. You just need to spend about 1 hour reviewing the lecture notes every week.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oxzoucAsWueG7ZSoD9JEClPHEVW2gA1r",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Carsonnnnn",
            "date": "Feb 05, 2023",
            "title": "",
            "comment_content": "1.introduction<br />2.Optimization<br />3.Probability<br />4.Project Management<br />5.Location Analysis<br />6.Inventory Management<br />7.Process Selection and Facility Design<br />8.Forecasting<br />好多嘢係中學既時候都有見到小小 eg prob,linear programe",
            "comment_teaching": "prof幾好人,都樂意回答問題,不過上堂速度個人覺得偏快(語速)",
            "comment_grading": "Homework&nbsp;&nbsp;10%<br />Participation&nbsp;&nbsp;5%(隨機一堂有個quiz)<br />Project 15%<br />Midterm 30%<br />Final 40%<br />d嘢唔算難,,在intro course入面算靚grade",
            "comment_workload": "除左project之外其他都很輕鬆,workload極細",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6S2Yojni4mSjrG9DY1GAl0Q19y0hOKSb",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nick_name_",
            "date": "Dec 30, 2022",
            "title": "Pretty Good CC",
            "comment_content": "1) Introduction to IE: What Is IE?&nbsp;&nbsp;&nbsp;<br />2) Optimization <br />3) Game Theory <br />4) Probability Basics <br />5) Process Analysis <br />6) Project Management&nbsp;&nbsp;&nbsp;<br />7) Waiting Line Management <br />8) Supply Chain and Inventory Management <br />9) Operations Strategy <br />10) Revenue Management <br />11) Forecasting <br />12) Financial Engineering",
            "comment_teaching": "Prof. Wang's pronunciation is clear and understandable. But since there are 3% bonus points for class participation, so his teaching got interrupted frequently.",
            "comment_grading": "Assignment: 15% <br />Online quiz: 15% <br />Final Exam: 70%&nbsp;&nbsp;&nbsp;<br />Bonus points: 3% for class participation<br /><br />Me:<br />Assignment: mean<br />Quiz: full<br />Final Exam: mean<br />Bonus: none<br />Overall: B",
            "comment_workload": "Low workload. The quizzes have unlimited attempts. As long as you have submitted them, you will get the points.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VqNpCNvg7wQbb8owGRcvSSmVrqvEGqXR",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Edwin-the Eddy",
            "date": "Jan 25, 2022",
            "title": "",
            "comment_content": "Week 1 Introduction to IE: What Is IE? <br />Week 2 Optimization<br />Week 3 Game Theory<br />Week 4 Probability Basics<br />Weeks 5-6 Process Analysis<br />Week 7 Project Management <br />Week 8 Waiting Line Management<br />Week 9 Supply Chain and Inventory Management<br />Week 10 Operations Strategy<br />Week 11 Revenue Management<br />Week 12 Forecasting<br />Week 13 Financial Engineering<br /><br />I found it somewhat useful as you may use the knowledge to adjust your decision.",
            "comment_teaching": "He likes playing games with us and then uses the result of the game to explain the content. You will see that he shares some cases with you or ask questions and wait somebody to take them. If you want the bonus, you can answer him and do remember to leave him paper with your name. In no way he remembers you.&nbsp;&nbsp;<br /><br />You may get attracted by the course since sometimes he likes to lure you to take other IEDA courses by selling you how good&nbsp;&nbsp;IEDA is eg gaining money or having a job in bank…",
            "comment_grading": "Quiz 15%<br />Assignment 15%<br />Final 70%<br /><br />Bonus points: 3% for class participation<br /><br />The mean for assignments are high.<br />HW1.&nbsp;&nbsp;8.3<br />2. 9.2<br />3. 9.3<br />4. 8.8<br />Out of 10<br /><br />open-book Final with normal distribution table attached to the paper. Questions were difficult so take time to prepare and practice as well as bring notes or a book along with you for the final. Its mean is&nbsp;&nbsp;quite high",
            "comment_workload": "Most questions can be completed by referring to the handouts or sample assignments. But some are very difficult, not sure how to find resource to do so. The prof did not allow us to ask him and TAs . They won’t respond to us regarding anything of every assignments<br /><br />Fail and try the quizzes&nbsp;&nbsp;unlimitedly before the deadline.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uxXC0HmWU0fPLxZmHKl4Dw0JSlsu5sJo",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Eliza999",
            "date": "Jan 21, 2022",
            "title": "Enjoyable Lecture",
            "comment_content": "Week 1 Introduction to IE: What Is IE?<br />Week 2 Optimization<br />Week 3 Game Theory<br />Week 4 Probability Basics<br />Weeks 5-6 Process Analysis<br />Week 7 Project Management<br />Week 8 Waiting Line Management<br />Week 9 Supply Chain and Inventory Management<br />Week 10 Operations Strategy<br />Week 11 Revenue Management<br />Week 12 Forecasting<br />Week 13 Financial Engineering",
            "comment_teaching": "Prof Wang is a very nice teacher that you will fall in love with his teaching soon.You can see that he enjoys teaching.&nbsp;&nbsp;Always smile.&nbsp;&nbsp;<br />Little accent but it didn't harm enjoying his teaching. Btw I won the game of guessing&nbsp;&nbsp;number in the class about game theory if i recall correctly haha",
            "comment_grading": "Grading Scheme<br /> Assignment: 15%<br /> Online quiz: 15% <br /> Final Exam (in person): 70%<br /> Bonus points: 3% for class participation",
            "comment_workload": "About 1 assignment per chapter. Only 1 or 2 require more calculations, others can be learnt from the lecture itself.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dUdX0qz4PHMA4YV0kkp5lvywl2Q6UlJo",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bellej",
            "date": "Jan 21, 2022",
            "title": "Appropriate introductory course",
            "comment_content": "Basic introduction to Industrial Engineering divided into two parts. First learn about three analytical tools used in IE (Linear Programming, Game theory, and probability), then the rest are the application side. Overall, a great introductory course to grasp about IE. In my opinion, it does not require any prior knowledge, but some mathematical sense/skill is necessary to achieve higher grade. <br /><br />Syllabus:<br />1. Introduction to IE<br />2. Optimization<br />3. Game theory<br />4. Probability Basics<br />5. Process analysis<br />6. Project management<br />7. Waiting line Analysis<br />8. Inventory management<br />9. Revenue management <br />10. Demand Forecasting <br />11. Supply chain management<br />12. Quality management<br />13. Financial engineering",
            "comment_teaching": "Prof Wang is a good instructor. His explanations are clear and detailed.<br /><br />Tutorials are helpful in revising the lecture as it summarizes selected topics. Also all three TAs were very kind and willing to answer students' questions.",
            "comment_grading": "No attendance, but has bonus 3% for participation<br /><br />Assignment - 15%<br />Best 3 assignments out of 4 counted. I did above average for every assignment except one. Professor provides previous assignments. Although the questions aren't exactly same, you can get some hints from it. Also, it is helpful for exam prep, so make use of them wisely. <br /><br />Quiz - 15%<br />Consist of average 5-6 multiple choice questions. Basic questions and unlimited attempt, so just finish it on time.<br /><br />Final exam - 70%<br />34/70<br />Mean: 40.34\t<br />High: 68.5\t<br />Pretty difficult exam. I could not even touch some of the questions. The practice exam paper and assignments provided by the professor are easier than the actual test. <br /><br />Final grade was B. I think it is reasonable considering my exam score which takes 70% of the final grade.",
            "comment_workload": "The content is quite heavy in terms of volume, so make sure to review and take down notes without cramming.<br /><br />Assigments are manageable as long as you reviewed class notes and tutorials thoroughly. <br /><br />Overall, appropriate workload.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bDWoeSabYbvvLv5FCoF9Zf8WqMnSZ9Sx",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kn111",
            "date": "Jan 20, 2022",
            "title": "very interesting course",
            "comment_content": "Syllabus:<br />Introduction to IE<br />Optimization<br />Game theory<br />Probability<br />Process analysis <br />Project management <br />Waiting line management <br />Inventory management <br />Revenue management Forecasting<br />Supply chain management <br />Quality management<br />Financial engineering<br /><br />Overall, this is a good introduction course. You can grasp the content well without any prior knowledge in IEDA",
            "comment_teaching": "Prof Wang is a good instructor. He teaches the knowledge with detailed explanations. The notes prepared by him are interesting and useful.<br /><br />The tutorials are useful. The TAs will help you review the knowledge learnt in the lectures. The TAs are patient and nice. They are willing to answer my questions.",
            "comment_grading": "Assignment: 15% <br />Only the best 3 assignments out of 4 will be counted. <br /><br />Quiz: 15%<br />Once you have done the quiz, you will get the mark.<br /><br />Final exam: 70%<br />This is open notes and open book exam. The exam is much more difficult than the assignment you have done. <br /><br />Bonus point: 3% <br />This is shown in the syllabus but the lecturer hasn't mentioned it. So, just ignore it.",
            "comment_workload": "The workload is moderate. There are 8 quizzes and 4 assignments. <br /><br />For the assignment, there are about 4 to 5 long questions and they are not so difficult. If you have the attend the lecture, you will know the method. Moreover, there are some previous assignments with answers. I highly suggest having a look at the past homework. They will help you a lot.<br /><br />The quizzes are very easy. There are unlimited trials. You can do many trials and revise the knowledge as many times as you want.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PCb3wEs2qzmbRWotZJgIeeQVYIhGuo6K",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ocar",
            "date": "Jan 20, 2022",
            "title": "Quite interesting",
            "comment_content": "Syllabus:<br />- Intro to IE<br />- Optimisation<br />- Game theory, Nash equilibrium<br />- Probability<br />- Process analysis <br />- Project management <br />- Waiting line management <br />- Inventory management <br />- Revenue management <br />- Forecasting<br />- Supply chain management <br />- Quality management<br />- Financial engineering",
            "comment_teaching": "The professor is very nice, he will answer your questions very well. Just remember to join the face-to-face lesson, otherwise, you cannot hear what he said clearly.",
            "comment_grading": "- Assignment: 15% (Best 3 out of 4)<br />The maximum mark is 10 for each assignment. They are not difficult. There are previous assignments for reference. You can use the format it provides. Some questions need extra thinking. <br /><br /><br />- Quiz: 15%<br />Easy stuff. Just remember to do is ok. <br /><br />- Final exam: 70%<br />Open book open notes. I print all notes for the exam. It is a bit different from homework, it requires you to think more and tests your understanding of each topic.",
            "comment_workload": "Very low, but each assignment takes me 3 hours. The quiz only takes you 2-3 minutes.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YAwl4Xop4JIZx2lMC8bJHV67AOLEbjI5",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mango Pudding",
            "date": "Jan 10, 2022",
            "title": "Actually quite interesting (But beware, requires basic differentiation and integration)",
            "comment_content": "Syllabus:<br />- Intro to IE<br />- Optimisation (Linear programming)<br />- Game theory, Nash equilibrium, Cournot model<br />- Probability (Discrete, continuous, normal distribution)<br />- Process analysis (Little's Law)<br />- Project management (Structure, critical path, time-cost model)<br />- Waiting line management (Kingman's equation)<br />- Inventory management (Economic order quantity model, safety stock, newsvendor model)<br />- Revenue management (Two-segment problem, overbooking)<br />- Forecasting<br />- Supply chain management (Bullwhip effect)<br />- Quality management (Six-sigma, process capability index)<br />- Financial engineering<br /><br />I didn't intend to take this course at first with this being a replacement for another course, but this turned out to be quite interesting. Never been interested in business before but this is unexpectedly intriguing. It also answered questions one may ask themselves on business practices like why overbooking occurs when customers may be dissatisfied, why Disney uses fast passes (not anymore when they now charge a premium for it), why more lanes cause more traffic.<br /><br />It might take some time to fully understand and master some portions of the course (particularly I struggled with Cournot model at first), but with the help of TAs, you could grasp it sooner or later.<br /><br />Having prior M1/M2 knowledge (only basic differentiation and integration are relevant) is conducive to understanding Cournot model, continuous probability distribution and optimal order quantity, but not really a necessity.",
            "comment_teaching": "Prof. Wang is a great instructor, he was well prepared for every lecture, with additional anecdotes and real examples on top of the standard presentation. Has a slight accent but is comprehensible. He is very willing to answer questions raised during class, and would further explain with examples on the whiteboard if it stumped many students. A quiet classroom is required or else he wouldn't proceed, which is fair, to be honest.<br /><br />It is much better to be on campus for this course. I've watched the zoom replay once and the audio is hardly intelligible plus the writings on the whiteboard is barely visible (since the classroom camera is computer-controlled and didn't zoom into the content).<br /><br />Tutorial sessions summarise key points in the previous topic and then solve applied math problems. Though the TA conducting tutorials is difficult to understand (both pronunciation-wise and volume-wise).<br /><br />TAs are very helpful and are rapid in responding to emails. Just ask them whenever you are stuck.",
            "comment_grading": "- Assignment: 15% (Best 3 out of 4)<br />Max 10 marks for each assignment, I got [9, 10, 9.7, 9.6], and the mean is [8.26, 9.19, 9.32 8.8], so be meticulous when attempting them. They take quite a while to mark and release feedback for assignments, but marking schemes will be released much earlier than that.<br /><br />- Canvas quiz: 15%<br />Unlimited tries thus you should be able to get full marks here. There will be one for each topic, remember to check Canvas.<br /><br />- Final exam (in person): 70%<br />Open notes open book, thank goodness, just print everything you need, though it was an INTENSE 3-hour exam with ~10 short questions (which notes come in handy) and then ~8 long questions (with many subquestions) involving an ample amount of calculation. It was pretty challenging both time-wise and difficulty-wise. I got 56/70, and the mean is 40.34.<br /><br />- &quot;Bonus points&quot;: 3% for class participation, listed in the syllabus, but Prof. Wang did once say he doesn't care about bonus points and thus is redundant.<br /><br />In the end, I got an A for this course.",
            "comment_workload": "Four assignments and eight quizzes in total.<br /><br />Assignments may take some time to complete, but an abundant amount of time was provided for each one, and don't wait till just before the deadline. Usually 3-5 questions (w/ subquestions). I recommend going through the &quot;Previous assignments&quot; folder on Canvas, where you might find some clues on how to tackle your assignment. Though obviously the questions would be different and it may not aid you at all. Also, thoroughly check your calculation!<br /><br />Canvas quiz for each topic, and are very easy, plus unlimited attempts allow you to try until you fully grasp it.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cp06lzHQBafXnONrSyAoe4ARnaCE9CxS",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AnonStudent",
            "date": "Jan 05, 2022",
            "title": "",
            "comment_content": "Methodologies:<br />Optimization: Linear Programming; Objective Functions<br />Game Theory: Multiple parties doing Optimization\t1<br />Probability - Stochastic Modeling\t<br /><br />Application:\t<br />Productivity and Process Analysis\t<br />Process Selection\t<br />Project Management<br />Waiting Line Analysis<br />Inventory Management<br />Revenue Management<br />Demand Forecasting<br />Supply Chain Management<br />Quality Management<br />Financial Engineering<br /><br />Honestly, this course was really interesting in the beginning, especially until Waiting Line Analysis. All of the information we were given applied to me and the things I saw in daily life. But after that, things started to get really boring. Nonetheless, it pays off to pay attention<br />Also, the financial engineering topic just seems like a shameless self promotion of the Financial Engineering course at HKUST",
            "comment_teaching": "The teaching was alright. The teacher tried his best to be clear, he was friendly and always willing to engage students and answer questions.<br />However I did hear complaints from students on Zoom that they couldn't understand him, so I wouldn't recommend learning this subject online.",
            "comment_grading": " Assignment: 15% <br /> Online quiz: 15% <br /> Final Exam (in person): 70%&nbsp;&nbsp;&nbsp;<br /> Bonus points: 3% for class participation&nbsp;&nbsp;(I think the teacher forgot about this lol)<br /><br />Open notes final exam! What a relief cause there are SO many topics and so little time. However 70% is a lot of weight so study hard, do not leave until last minute if you want to do well.",
            "comment_workload": "Not a lot of workload. You get assigned 1 assignment per month, and you get online quizzes every other week. They also provide past assignments for reference and practice which are similar to the assignments that we have to submit, so it's not too bad",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vaWg93LdeMaPCs9IpnWQLfEQ68NK0HlQ",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ahzzzz",
            "date": "Jan 04, 2022",
            "title": "Fantastic Course",
            "comment_content": "A comprehensive course for the basic introduction to industrial engineering. The main focus of the course is how to improve the performance of a company by scientific methods. The content is easy to understand but involves in calculation. Having some knowledge in calculus and probability is a plus but not a must.",
            "comment_teaching": "Mr. Wang should be one of the best professors in UST in terms of delivering his lectures. Though sometimes due to his limited vocabulary bank you may find it hard to understand what is he referring to. But he will always provide you with significant examples to enhance your understanding. Furthermore, he is also very willing to answer your questions and will try his best to let you understand the topics.",
            "comment_grading": "Assignments(15%):<br />1st assignment: 9.5/10<br />2nd assignment: 10/10<br />3rd assignment: 10/10<br />4th assignment: 9.6/10<br />Three of the best assignments will be counted to your final grade. The questions are not difficult but careless mistakes can cost you a lot. So be careful or you can grab a friend to cross-check your answer.<br /><br />Quizzes(15%):<br />Scoring full in this part<br />Unlimited attempts with short and easy questions<br /><br />Final (70%):<br />Final paper marks: 60.5/70<br />For the final, most of the questions are similar to the sample exam and assignments. So to prepare for the final, having some practice on the sample exam, assignments and past assignments provided to you is important. The duration of the exam is 3 hours in total and is an open book exam. However, you probably will not have enough time to refer to your notes. Please be prepared. There will also be 2-3 challenging sub-questions, I think not being able to work on them is fine(I just left them empty). <br /><br />Class Participation (Bonus 3%)<br />Have answered some questions. Not sure if I get any bonus points or not.<br /><br />Final grade: A",
            "comment_workload": "Fair enough. The assignments and quizzed shall not be a burden.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VvaGMcPYALdFhu5ktk7JwskBQldSSFj3",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nopaynogain_hk",
            "date": "Dec 29, 2021",
            "title": "Pretty Good Grade",
            "comment_content": "The content is literally the same as ISOM 2700, which is supply chain management. Basically, it is all about simple calculations about inventory management, supply chain management, revenue management, QC etc. If you are good at maths, all these content would not be hard for you. Moreever, there is some insights into Financial Engineering at the last semester, which is quite interesting. If you are a business student, definitely go ahead and take this common core, if you have already got a good grade in ISOM 2700",
            "comment_teaching": "It is ok although I skipped 90% of lectures. His English may be kinda hard to understand, but as along as you are concentrated in class, you can still roughly, and even fully understand his words.",
            "comment_grading": "Honestly, the exam is quite tough. It is open book so you are not required to recite those definitions, such as key challenges faced in financial engineering, the definition of Industrial Engineering and some history etc. Therefore, the only criteria for assessing grades is how deep you understand the concepts in inventory and waiting line management. So, just finish past papers carefully and learn statistics, such as exponential distribution by yourself. Understanding these concepts is very very essential for you to get a good grade. <br />I got nearly all below mean in 4 assignments, however, only the best 3 out of 4 assignments will be counted as 15% of the course grade.<br />Online quiz, which is very easy with unlimited attempts, is what you should get full marks in. So, free 15%.<br />Last, the final exam accounts for 70% of the course grade. 3% of bonus for participation doesnt matter as I skipped nearly all lectures and didnt answer any questions.<br />Mean: 40.5/70<br />My mark: 58.5/70<br />Still management to get an A grade.",
            "comment_workload": "Workload is not tough at all. The 4 assignments are somewhat easy because the mean is quite high. Just ensure that you dont miss out any questions or make some silly mistakes and you are totally find. But it is crucial for you to really study the equations, especially the Newboys' model and the waiting line calculations as it accounts for most of the challenging marks.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XAzPdqASO7goRg4PG67s58IHvUXGf6hp",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DuckAndChips",
            "date": "Mar 23, 2021",
            "title": "Reasonable workload, may be difficult for people who are not confident in mathematics",
            "comment_content": "Please refer to the attachment for a more detailed look at the syllabus.<br /><br />Industrial engineering is the study of making operations and processes better (broadly speaking). The course starts with introducing some basic math concepts such as game theory and probability, which helps us understand the following lectures talking about mathematical models for different processes, such as projects, waiting line, supply chain, revenue etc.<br /><br />The difficulty can be intimidating for students who are not confident in mathematics because the application of mathematical models makes up most of the content of the course. It is, however, not impossible to grasp these concepts after sufficient practice and research. As a person who is not confident yet not intimidated by mathematics, I had to search up some videos on YouTube to fully grasp the concepts. <br /><br />Lecture notes are easy to understand.",
            "comment_teaching": "The professor elaborates from the lecture notes and derives/demonstrates different mathematical models. He is also very keen to answering questions in class, and provides good explanation to even very minor/meaningless (i'm sorry) questions - which can become quite annoying for students like me who wants to focus on the materials being taught. One good thing also is that the professor is generous in providing practice questions for us. He also has a mainland accent.<br /><br />Although attendance is not being recorded, I do encourage reviewing his lecture videos (on 2x speed) when you are unable to attend his lectures on time. Not that his lectures are that good, but that it's difficult to understand the concepts without explanation, for me at least.",
            "comment_grading": "- Big Big Premise and also Suggestion -<br />As a premise, in my semester, we had this big WhatsApp group full of IEDA2010 students and we exchanged our assignment answers and discussed our answers with each other. The high mean for assignments just means that a lot of students were in the group, lol. If you guys don't have a group, I really suggest making one.<br /><br />- Overview -<br />Assignment: 15%<br />Online quiz: 15%<br />Final Exam: 70%<br />Bonus points: 3% for class participation<br /><br />- Assignments -<br />Best 3 assignments are graded.<br />(Assignment: my score [min/mean/max])<br />Asm 1: 10/10; [2/8.3/10]<br />Asm 2: 10/10; [0/9.4/10]<br />Asm 3: 10/10; [0/9.1/10]<br />Asm 4: 9.5/10; [0/8.5/10]<br /><br />- Online quiz -<br />Honestly they are easy. Unlimited attempts, basic calculations/concepts that can be found in the power-points. Most of the quizzes have means that are close to full marks.<br /><br />- Final Exam -<br />My Score: 62/70<br />Min/Mean/Max: 12.5/51.9/69.5<br />Most of the final exams are similar to past questions, but there are some tricky questions that are more difficult than the usual practice ones. Do the practice questions, assignments and past papers and you'll be fine.<br /><br />- Bonus Points -<br />This is why there were many pointless/conditional questions in class. I did not say a word in class. Nothing more to add.<br /><br />- Final Grade -<br />A",
            "comment_workload": "Reasonable.<br /><br />Only lecture quizzes and assignments. Assignments usually consist of 3-4 questions (with subquestions) and are similar to assignments in the past year. I honestly gave up the last assignment because only 3 assignments will be counted and I was preparing for some other exam.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": [
                {
                    "key": "yg9ZNlkvQsHowG3KMjcmyiJFPQ8usULb",
                    "name": "Syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "uTxmpbyBgzJsKyPeTgu5gPHv5TbS7yQW",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "schendv",
            "date": "Feb 05, 2021",
            "title": "Not easy",
            "comment_content": "The content is mainly about the Math analysis of some specific models. Though the slides and the presentation show that it's an introduction course. The content is a bit hard for someone who haven't learned Math well. Sometimes it's not so smoothly to comprehend.",
            "comment_teaching": "The prof WANG, Xin is really good that he will try to explain the slides by giving examples. What's more, he is patient to the questions asked by students. And he is always available if you need any help.(going to his office or writing an e-mail",
            "comment_grading": "I got B because I haven't done well in assignments.<br />But I thought it was proper.<br />It's truly a course that depends on your effort.",
            "comment_workload": "Several quiz(not online) that you can get full marks just by participating.<br />4 Assignments (counting the best 3), it's not easy to get the high mark as the requirement is high and you should try to show the process similar to the prof write in the slides <br />Final. The final I took was so hard because of the online teaching mode.Prof made it hard to prevent cheating.(useless I think)<br />Workload is heavy compared to other course because the questions in assignments are about 4-6",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ot4EzAoMov6OlE21Ne1adtQfONnLdwVg",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mantou",
            "date": "Jan 18, 2021",
            "title": "",
            "comment_content": "Week 1 Introduction to IE: What Is IE?<br />Week 2 Optimization<br />Week 3 Game Theory<br />Week 4 Probability Basics<br />Weeks 5-6 Process Analysis<br />Week 7 Project Management<br />Week 8 Waiting Line Management<br />Week 9 Supply Chain and Inventory Management<br />Week 10 Operations Strategy<br />Week 11 Revenue Management<br />Week 12 Forecasting<br />Week 13 Financial Engineering<br /><br />Quite interesting",
            "comment_teaching": "Prof WANG was very dedicated and he is always willing to answer your questions.<br />The TA was really nice and patient as well",
            "comment_grading": " Assignment: 15%<br /> Online quiz: 15%<br /> Final Exam: 70%<br /> Bonus points: 3% for class participation",
            "comment_workload": "Relatively light. <br />You can get full marks for quiz just by doing, they reward marks as long as you finish it.<br /><br />assignments are good as practice for final exam as the question structure is the same",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "g7LqIv40YH7eJzUqpUmKU25hhS1G6Raa",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CrabNebula",
            "date": "Dec 30, 2020",
            "title": "2020-21 Fall semester (online)",
            "comment_content": "Check other comments for the course summary. Attached is the syllabus.<br />This course is like a brief introduction to the more advanced courses offered by the IEDA department. <br />Although this course belongs to SENG, there are some overlaps with ECON2103/2113, which are about microeconomics.<br />Personally, I find that the topics in this course are quite scattered. Also, the way you solve the questions in different topics are very similar, so I sometimes find it confusing.",
            "comment_teaching": "Prof WANG delivers the course content in a very neat and structured way. <br />However, there was a 3% bonus for those who actively participated in the lesson (asking or answering questions), therefore the lesson was sometimes disrupted. I think this is annoying somehow so I only watched videos afterwards.",
            "comment_grading": "The grading is not bad.<br />Grading Scheme<br />Assignment: 15%<br />Online quiz: 15%<br />Final Exam: 70% <br />Bonus points: 3% for class participation<br /><br />Final <br />Mean score -- 51.88 (out of 70) <br />S.D. -- 11.64<br /><br />As you can see, the mean is quite high, because the course materials are easy. Basically, if you read through the course assignment and past papers you should be doing fine.<br />My score in final 59/70. Full marks in both online quiz and assignments. Got an A.",
            "comment_workload": "Total of 4 assignments, should talk you 1/2 hours each. It is an individual work but you are allowed to discuss with others. Best 3 out of 4 assignments would be used in your grading.<br />Workload is not too heavy.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "4lKtkmMLQyhxc2UhLt1V9LZEnp0CLs07",
                    "name": "Syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "eN0j7hRt5ELE1XBT8Z9nrGwXIme1z2sy",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Henry2017",
            "date": "Dec 30, 2020",
            "title": "",
            "comment_content": "the content is not very difficult. It is about economy and statistics.",
            "comment_teaching": "The professor is very nice. It is easy to understand everything. Final is a little difficult but midterm is fine.",
            "comment_grading": "Mean is bout quite high but as is very high since the content is not very hard. I got A, although my score is higher than mean almost 1 standard deviation. You need to be well-prepared for the exams by doing a lot of past paper.",
            "comment_workload": "Workload is not very hard. After the chapter, there will be a assignment.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zrDXoggEjyyLEgFi6UGUOwsy4MN01ISJ",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "aUSTBoi",
            "date": "Dec 29, 2020",
            "title": "Good course, even for those who do not wish to major in IE.",
            "comment_content": "1. What is IE (Introduction)?<br />2. Optimization<br />3. Game Theory<br />4. Probability Basics<br />5. Process Analysis<br />6. Project Management<br />7. Waiting Line Management<br />8. Supply Chain and Inventory Management<br />9. Revenue Management<br />10. Demand Forecasting<br />11. Financial Engineering <br /><br />I think that the content is appropriate to the course and is quite interesting even for those who do not wish to pursue this as a major and are only taking this course for credits. <br />I found the content to be very applicable in other fields of study so it's definitely a useful course. <br />I personally found the first 5 topics to be relatively simple and the latter to be more challenging. I would recommend constant study of the first 5 topics as they are fundamental to the course.",
            "comment_teaching": "Professor Wang is a very good professor and I have no complaints. <br />The TAs are also very good but I would recommend asking the professor for help as he is very approachable.",
            "comment_grading": "Grading Scheme: <br />Assignment (homework): 15%<br />Online quiz (unlimited attempts on canvas): 15%<br />Final exam: 70%<br />Bonus points: 3% for participation <br /><br />I think the grading is quite fair. The assignments are not too hard and the online quizzes are supposed to be an easy 100% as long as you do them. I would recommend not screwing up the final as it's a big proportion of your grade. <br /><br />Final exam Statistics (out of 70): <br />Mean: 51.88<br />Standard deviation: 11.64<br /><br />My score: <br />Assignments: 100%<br />Online quizzes: 100%<br />Final exam: 59/70<br />Participation: not sure what I got...<br />Final grade: A<br /><br />I think the exam this year was quite tricky compared to the previous years. Trick: focus on partial marks. <br />I would've given the grading an A but I know people who got scores of only a mark lower on the final exam and still got a B+ so...",
            "comment_workload": "Quite light compared to the other courses. You get sufficient time to do the assignments. No midterm either.<br />I would recommend constant revision to understand all the topics as they are inter-related and making mistakes in the final exam can be very easy. Way better to understand the concept rather than rote memorization of how to answer questions.<br />No attendance but there are bonus points for participation which can really boost your grade.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IvtUYfJvbPLGpSbDBriNpt34GKLMH5T7",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "noddy",
            "date": "Sep 06, 2020",
            "title": "",
            "comment_content": "Lecture Topic:<br />1.Introduction to IE: What Is IE?<br />2 Optimization<br />3 Game Theory<br />4 Probability Basics<br />5 - 6 Process Analysis<br />7 Project Management<br /> Midterm <br />9 Waiting Line Management<br />10 Supply Chain and Inventory Management<br />11 Operations Strategy<br />12 Revenue Management<br />13 Financial Engineering",
            "comment_teaching": "not bad, Prof Wang is nice and willing to answer all the questions. He always asks some interesting questions for us to develop our sense, but I skipped his Lecture after the midterm.<br />The Tutorial is good. My TA is Terence CHEUNG which is also very nice. The tutorial mainly focuses on solving questions and assignments.&nbsp;&nbsp;You can ask Terence questions after the class and he is glad to answer your questions.",
            "comment_grading": "Assignment: 10%<br />The best 3&nbsp;&nbsp;out of 4 assignments.<br />Online quiz: 10%(MC)<br />Mid-term Exam: 40%(short questions&amp;long questions)<br />Final Exam: 40%(short questions&amp;long questions)<br />I got a full mark in assignments and full marks in all the quizzes. Both the Midterm and Final Exam got higher the mean. And my final grade is B+",
            "comment_workload": "The workload is ok. It is easy to do that if you attend all the Tutorial session.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "K7ChuoYjoMDa21YnysGHiesahiDKlIgz",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "豬仔",
            "date": "Jan 23, 2020",
            "title": "not difficult",
            "comment_content": "Week 1Introduction to IE: What Is IE?<br />Week 2Optimization<br />Week 3Game Theory<br />Week 4Probability Basics<br />Weeks5-6Process Analysis<br />Week 7Project Management <br />Week 8Midterm(Oct 22)<br />Week 9Waiting Line Management<br />Week 10Supply Chain and Inventory Management<br />Week 11Operations Strategy<br />Week 12Revenue Management<br />Week 13Financial Engineering",
            "comment_teaching": "Boring. Lecture is useless. Tutorial is a bit useful.But not enough examples for homework and revision. No need to attend any class is fine.",
            "comment_grading": "Assignment: 10%<br />Online quiz: 10%<br />Mid-term Exam: 40% (It will cover all the materials before the mid-term.)<br />Final Exam: 40% (Comprehensive,with an emphasis on the second half.)<br />Bonus points: 3% for class participation<br />Late submission will have 20% penalty for each day past the deadline.And it will not be accepted after two days past the deadline.<br />The best 3grades out of 4assignments will be used for the final assignment grade.<br />Students are expected to join class discussion. Students will receive bonus pointsbased on their class performance. <br />Exams are closed book, closed notes. But a double-sided A4 size handwrittencheat sheet is allowed.<br /><br />Finish all the quiz(quiz have unlimited times of retry)<br />mid term, 1sd and homework, exam 0.5sd have&nbsp;&nbsp;A range.",
            "comment_workload": "4 homework,1 midterm , 1 exam and some canvas quiz",
            "rating_content": 5,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QddUgP5ulJHJOy1W5sijCkri4zIw8QMF",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "SiriusSkyHigh",
            "date": "Dec 27, 2019",
            "title": "",
            "comment_content": "Interesting real-life topics involved. You will like it especially if you are interested in RMBI and marketing. The content of ppt is quite adequate for you to have a general understanding of the topics. <br /><br />Extracts of the syllabus:<br />•Obtain a basic ability to apply mathematics and engineering knowledge to formulate and optimize the operation of a business.<br />•Obtain basic knowledge of industrial engineering, production, logistics and supply chain management and the related contemporary issues.<br />•Understand the impact of engineering solutions in a global and societal context and on a broad range of issues, including environmental and social responsibilities.",
            "comment_teaching": "The prof is very dedicated which he explained the concepts very clear. TAs are willing to help and always deliver help in time. Though sometimes they may make mistakes when formulating the assignments. <br /><br />Don't hesitate to ask if you have any problems regarding the papers. Especially if you are studying alone(you know what I mean) in this course.",
            "comment_grading": "Since they haven't released the grade, I don't know how to comment. But I heard that the grading of this course is quite satisfactory.",
            "comment_workload": "Quizzes and assignments are a bit challenging. You may need to have revision in order that you understand every bit of the questions.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "M8zxmmSJpTWu6IscFQSOkrtHCedT3kHb",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "winnieip1997124",
            "date": "Jan 03, 2019",
            "title": "Not really a good grade course",
            "comment_content": "Content is something about game theory, some OM topics with simple calculation",
            "comment_teaching": "He is quite passionate about teaching and he is willing to answer questions from students. Make sure that he remembers you in class. I think participation is quite important.",
            "comment_grading": "The grading is fair. I got a mean in the midterm and final. I finally get a C+.",
            "comment_workload": "No workload at all. Just midterm and final. No project and presentation. <br />Suitable for year1,2 students as the content is easy to follow. Just memorize and remember the equations related to the course material.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GbtjlX4bvWzMWYqhfDyOJDFICEc5JdML",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Welkin",
            "date": "Jan 24, 2022",
            "title": "good",
            "comment_content": "This course teaches a lot about industrial engineering and decision analytics. And it rel",
            "comment_teaching": "good, the prof is quiet interesting and he will set some examples to let us understanding what he says, so dont worry about the teaching",
            "comment_grading": "I think the grading is quiet good, I get A finally, <br />The grading is based on the 4-assessments which account for 10% and the final exam which accounts for 90%. There is no midterm.",
            "comment_workload": "The workload is small, only 4 assessments and each maybe takes you 1 hour to finish it, and the canvas also have the assessments which were done last year and the questions and answers are similar mostly",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lecXrpiKpwAngArNnpMgvpfT0aXSljKN",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Vegetable",
            "date": "Dec 29, 2020",
            "title": "Nice Course and Good Teaching",
            "comment_content": "Well, just some basic concepts about optimization in many different aspects. To be honest, it is more like an intro course in SBM rather than SENG, but I am pretty sure that you can learn some interesting knowledge by taking this course. The professor will introduce some basic mathematical tools (mainly about probability) before getting to the models that need them, so don't worry about the pre-knowledge you need for this course.",
            "comment_teaching": "Professor Wang is really nice. Although he is from mainland, his verbal English is much better than &quot;acceptable&quot; compared to some other teachers. For the students from mainland like me, it is quite easy to follow him, and I am sure that for students from other regions, they can also enjoy his lecture. Professor Wang likes students to ask questions of whatever kind at whatever time, and he will stop and answer your question patiently. The TAs are also very nice, though their English might not be as good as Professor Wang's. Just repeat your questions and they are willing to stay.",
            "comment_grading": "Quiz: 15%<br />Homework: 15%<br />Final: 70%<br />Participation bonus: 3% (earned by asking questions)<br /><br />For the quiz, as long as you finish them with whatever marks, you can get all scores. There are 4 hw in total, and the 3 best out of 4 will be taken for the score calculation. Besides, there are past homeworks with standard solutions for your reference. Make good use of them, and it is also easy to get the full mark.<br /><br />The most important thing is definitely the final!!! Professor Wang's anti-cheating manner is simple but very effective: overwhelming questions. In the three hours, you have to finish an exam paper composed of 9 pages, which covers all the topics except for financial engineering and quality management in the whole semester. You can have a toilet break at any time with prior notification to the proctor, but I would suggest you to pee in your pants because the time is so precious. The grading for the final is very nice. The TAs have tried their best to give you score as long as the logic is correct.<br /><br />The overall grading is nice, I got full marks in hw and quiz, and 63/70 in final (Mean: 51.88 SD 11.64) with letter grade A in the end, so I think it is pretty satisfactory.",
            "comment_workload": "Pretty low. Just finish the homework on time, and do some reviewing before the final. Everything shall be fine.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "0v9TbHU3zJSnwkZQun5WxpeyMEv9ArUe",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Alex Du",
            "date": "Nov 01, 2020",
            "title": "",
            "comment_content": "Week 1 Introduction to IE: What Is IE? <br />Week 2 Optimization<br />Week 3 Game Theory<br />Week 4 Probability Basics<br />Weeks5-6 Process Analysis<br />Week 7 Project Management <br />Week 8 Waiting Line Management<br />Week 9 Supply Chain and Inventory Management<br />Week 10 Operations Strategy<br />Week 11 Revenue Management<br />Week 12 Forecasting<br />Week 13 Financial Engineering<br /><br />The first 6 weeks would seem to be very easy if you have some understanding in statistics, which I assume everyone does. Starting from the 7th week, however, the course would accelerate, about double the previous speed. The concepts would play a major role, while for the first 6 weeks mathematical tools are more important.",
            "comment_teaching": "Professor Wang is very good at teaching. He has a Chinese accent, after all, he graduated from Tsinghua EE. But it is understandable. Also, he goes into the concepts in a very detailed sense, which is very good.<br />The only problem for teaching is that the bonus points are wanted by everyone. So stupid questions come out and interrupt the class. I hate it personally.",
            "comment_grading": "15% online quiz<br />15% homework<br />70% final<br />bonus 3% participation<br /><br />The reason why I do not add &quot;quiz&quot; is because the online quizzes would be given full mark as long as you decide to do them. Homework are to be selected the best 3 out of 4 homework. Thus the only thing that matters is the final. Get well prepared and well practiced, then it would not be difficult to get over the mean if you feel the same way as I do in the CONTENT part.",
            "comment_workload": "Workload is extremely low. All you have to do is to listen carefully and study the PPT. If you want to do it just before final you may go ahead as well.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WmoERrGYsl6C7PykS2AyZbFPnUCAWJ0V",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kevin(Zhao)",
            "date": "Jan 20, 2021",
            "title": "",
            "comment_content": "Week 1 Introduction to IE: What Is IE?<br />Week 2 Optimization<br />Week 3 Game Theory<br />Week 4 Probability Basics<br />Weeks 5-6 Process Analysis<br />Week 7 Project Management<br />Week 8 Waiting Line Management<br />Week 9 Supply Chain and Inventory Management<br />Week 10 Operations Strategy<br />Week 11 Revenue Management<br />Week 12 Forecasting<br />Week 13 Financial Engineering<br /><br />interesting",
            "comment_teaching": "He is patience and always ready for answering questions.<br />The explanation for the theories are quite clear.<br />TAs are good as well.",
            "comment_grading": "Assignment: 15%<br /> Online quiz: 15%<br /> Final Exam: 70%<br /> Bonus points: 3%<br /><br />I got 91% and I got an A <br />(I don't have any bonus point cause I barely take the class)<br />(Almost everyone can get a full mark in assignment and quiz part)<br />Obviously it is really easy to get a high mark. A GOOD GRADE COURSE for sure.",
            "comment_workload": "Quite light<br />You just need to try your quiz for single time and you can get the answer and copy them to finish your quiz.<br />For homework, you can refer to the past practice answer on canvas, they are almost the same.<br />There's only few after-school-work to do.<br />For final, most of the questions are similar to past papers.<br />It is easy to get an A range.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XHDSz2hyT0m126oeIHJyvTKD2dolaTXU",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lawrenceyau",
            "date": "Oct 21, 2019",
            "title": "",
            "comment_content": "the content of this course is a little bit hard to understand,however, once you can comprehend its concept, you will get very high mark.",
            "comment_teaching": "good teacher but not good accent. but ,his accent is at least better than other prof from mainland .",
            "comment_grading": "some people said the grading of this course is quite good,yes!if you can manage the content and concept of the whole course.",
            "comment_workload": "workload is fairly high. there are quite a lot assignment and online quiz ,fortunately, whose task carry only 20% of the total grade.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H0KLuKHSqOcXgHFu5xLVAgMU7cKEJQ1b",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 948,
                    "name": "WANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LUO",
            "date": "Mar 09, 2020",
            "title": "Just an introduction",
            "comment_content": "It is just a start of operation reaserach",
            "comment_teaching": "no attendence, actually teacher is just reading the ppt. You can actually learn it by urself. Looking at ppt is also very effective somehow.",
            "comment_grading": "mid<br />final<br />quiz<br />assignment<br />The tests are not so hard. you can pactice a lot in the quiz. And as long as you answered the quiz, you can get ur score.&nbsp;&nbsp;rememer to do the assignment carefully. mid and final are very like assignments' question.",
            "comment_workload": "workload is not so hard actually. But it fluctuates very often. Sometimes it takes you a long time, sometimes only a few mintues.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}