{
    "error": false,
    "course": {
        "id": 636,
        "subject": "IELM",
        "code": "2200",
        "name": "Engineering Management",
        "description": "Techniques relating to modeling and analysis and management of engineering operations; productivity assessment and improvement, quality assessment and improvement; principles of behavioral science and its application to engineering management.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            1730,
            1630,
            1530,
            1430,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"IELM\" data-code=\"2010\" href=\"/review/IELM2010\" target=\"_blank\">IELM 2010</a>",
        "rating_content": 4.13,
        "rating_teaching": 4.19,
        "rating_grading": 3.94,
        "rating_workload": 3.88,
        "review_count": 16,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 360,
                "name": "QIU, Xuan",
                "count": 12
            },
            {
                "id": 346,
                "name": "AU, Yim Lee",
                "count": 2
            },
            {
                "id": 99,
                "name": "LAM, Gibson",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "3xQvBTsDfkx0aUhqhkAG4DgcoYHu1bJI",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HokJa",
            "date": "Jun 08, 2017",
            "title": "",
            "comment_content": "Project management, Product &amp; service design, quality management, process selection &amp; layout design, forecasting, inventory management, aggregate planning, MRP&amp;JT<br /><br />Calculation is the most important part that is examined in this course, as you can bring a cheatsheet, the part of memorisation can just be put inside<br />All long questions are calculation problems",
            "comment_teaching": "Prof is good, explain and demonstrate a lot in class <br /><br />some people said she is pretty, i dont judge :)",
            "comment_grading": "Homework 15%<br />Participation 5%<br />Project 15%<br />Midterm exam 25%<br />Final exam 40%<br /><br />I didnt go to class as it is a 9:00 lesson, there are 2 quizzes, i have done 1 luckily, open book and same as source<br /><br />Homework all full mark, mid term exam above ~0.6sd, final marks are not revealed but i think should be just mean( cuz the calculation prob is really difficult in final)<br /><br />I dont know the project mark either, probably above mean<br /><br />At last my grade is --&gt; B+",
            "comment_workload": "3 Homework: same as sources<br />Project includes a final report and ppt presentation, if you have good group mates, the workload is not that heavy<br />midterm and final are closed book but you can bring one double-sided A-4 cheatsheet",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oym2zIU59t49YsFfEYp714oHGPCPafBl",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "THKJ",
            "date": "Jun 01, 2020",
            "title": "",
            "comment_content": "Ch1 Intro<br />Ch2 Project Management<br />Ch3 Product and Service Design<br />Ch4 Process Selection and Facility Layout<br />Ch5 Quality Management<br />Ch6 Forecasting<br />Ch7 Location Analysis<br />Ch8 Inventory Analysis<br />Ch9 Aggregate Planning<br />Ch10 MRP and JIT",
            "comment_teaching": "Ch1 to 5 are some teachings about theories and ideas. So there will be more interactions with the class. Starting from ch6, more is focused on calculations and formulas. So the flow of the lectures for those chapters are like Intro of formula-&gt;Give some examples q for you to do -&gt; check the answers. So it depends on which ch is Qiu,Xuan teaching. From ch6 onwards would be relatively tedious for those who don't like numbers.",
            "comment_grading": "HW 10%<br />Project 25%<br />MT 30%<br />Final 35%<br />-Mid term covers ch1 to ch6, with 20MC and 3 Calculations Q. Don't know whether the application of zoom matters or not. The mean of mid-term this semester is very high with 87.xx out of 100, and there are 8 people getting full marks, which is quite abnormal among the past reviews of the course. MC is quite difficult. Although it is open book and notes, there is inadequate time for you to search the answer. <br />-Assignments are some standard questions. Easy to get full mark.<br />-Finals covers Ch6 to 10, have 15 MC Q plus 5 Calculations Q.",
            "comment_workload": "The workload is very large. There are 4 assignments in total, a project, a mid term and a final exam. The project requires the group to propose a business which makes and sells food in HKUST campus. Each group has to apply the knowledge in the course to the proposal, including the product design, demand forecast etc. The presentation time is 15 mins, followed by 3 mins Q&amp;A. Other than your own presentation, you have to evaluate other group presentation with a assessment worksheet uploaded by the TA. So you have to be concentrated on other presentation as well. A final report is also required after the presentation.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "10Q4fO46Am1zwbvadtcmb4VzSseHFLVc",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rds",
            "date": "Jun 28, 2018",
            "title": "",
            "comment_content": "Easy course with good content. The course covers basic introduction to operations management, project management, product &amp;service design, process selection &amp; facility layout, quality management, forecasting, inventory management, aggregate planning, MRP &amp;JIT. Quite useful for learning topics related to business, but in a more mathematical way. Students good at math will enjoy this course.",
            "comment_teaching": "The professor teaches well and introduces the concepts in a simple and easy way, lessons are nicely structured. She also tries her best to make the class more interactive and engaging. Also very helpful all the time.",
            "comment_grading": "Homework: 10%<br />Class Participation (pop up quizzes): 5%<br />Project: 15%<br />Midterm: 30%<br />Final: 40%<br /><br />Both midterm and final exams are closed book and closed notes with a one-page A-4 summary sheet allowed (double-sided).<br /><br />Not bad grading in general, especially if you make good cheat sheets and remember basic methods for making tables.",
            "comment_workload": "Average workload. 4 Assignments in total that are relatively easy but will take some time to do and you have to fully understand the content before doing. Project will also take up some time as different aspects have to be considered. Midterm and Final are not too hard to study for since you can take cheat sheet but preparing cheat sheet is time consuming so plan ahead of time.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EvSiQ1OX0KNhGgGrJ0FpFhmIQWjk26qd",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Finger_ha",
            "date": "May 27, 2018",
            "title": "Easy course and Good grade course",
            "comment_content": "Quite useful, though it might be a bit boring for some of the students and some of the topics might have already been covered in other courses.<br /><br />After all, the content included in the course is mainly about how business activities are running in a scientific way, so it could be quite useful in terms of helping the students to fit into the ever-changing business society.",
            "comment_teaching": "Professor Qiu has been trying to teach the kind of boring topics in a more interesting way, great professor and she is willing to stay after the lecture is over to answer the questions from the students.<br /><br />There are 4 tutorial sessions in total (one every two to three weeks), not compulsory to attend but quite useful to work on your assignments.<br /><br />TAs are helpful, they are very helpful and friendly to help the students with their problems.",
            "comment_grading": "Homework: 10%<br />Class Participation (random quizzes): 5%<br />Project: 15%<br />Midterm Exam (Week 8): 30%<br />Final Exam : 40%–Both midterm and final exams are closed book and closed notes with a one-page A-4 summary sheet allowed (double-sided)<br /><br />Pretty easy to get good grade for this course, mean is normally around B-/B<br /><br />Assignments are easy, mid-term and final exam are not too difficult as long as you have a good cheatsheet with most of the important slides on it and with steps for constructing the diagrams, and also the formula of some calculations",
            "comment_workload": "Not too tough, four homework in total<br />1 mid-term exam<br />1 final exam<br />2 pop-up quizzes during lessons<br />1 project with presentation to be handed in by the end of semester (on starting up a food business at HKUST)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iUgLQYE5BFab2uI0snLiHvP52hYzPa6b",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hw5010",
            "date": "Jan 25, 2018",
            "title": "Very worth taking",
            "comment_content": "Content is pretty similar and a bit advanced to ISOM 2700, so if you are a BBA student you can take this course together with ISOM 2700 so you only revise for 2 courses together. <br />Reguires lots of memorising stuff but in mid terms and finals you can bring a cheat sheet so it is perfectly fine. <br />Powerpoints only povide point forms of some important concepts so need to pay attention in class and jot down important informtaion. Sample calculations are also in blank so participation in class are very imporatant.<br />There is random quiz happen in class and count for attendance. It pretty simple if you do all the in class practice.<br />Remember to attend the tutorials as they provide sample questions for exam.",
            "comment_teaching": "Yes she is quite boring in teaching, but she is really a nice professor and her class is really informative. And she is really helpful in answering questions and easily approachable.",
            "comment_grading": "Grading consists of:<br />- In class participation (in class random quiz, twice a semester)<br />- Homework<br />-Midterm <br />-Final<br />(midterms and finals are pretty similar to homework)",
            "comment_workload": "Workload is easy, 4 homework assignments, in class random quiz, there is no readings or other stuff you need to prepare before you go to class, there is some in class discussion but does not count for attendance or other scores. There is no group projects nor presentation so the only thing you need to revise for exams.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7hXNdRRbEZH1DQvhtIMhSnXiuyYk9ynO",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "dicky4422",
            "date": "Jan 24, 2018",
            "title": "",
            "comment_content": "This course have a brief introduction on what is industrial engineering, and will cover some topic on engineering management, logistics management and also financial engineering.",
            "comment_teaching": "The professor have passion on teaching and will use quite a lot of example to explain the concepts of the course.",
            "comment_grading": "My result on assignment, mid-term and final are all about the mean, and I got B grade finally.",
            "comment_workload": "It is not difficult for the assignment and for the mid-term and final you can bring a piece of hand-writing chit sheet.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tKmYWcVJb5cETb7J32bWnW4BM5t4hp3o",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ykkkk",
            "date": "Sep 18, 2017",
            "title": "",
            "comment_content": "The content is not difficult. It covers project management, forecasting, aggregate planning and MRP and JIT. As it is an engineering course, the math involved can be quite complicated but it is understandable.",
            "comment_teaching": "Teaching is fair.",
            "comment_grading": "homework and Participation got all mark. <br />Midterm above 1 sd<br />Final didn't release the result <br />Finally got B+",
            "comment_workload": "3 homework 15%<br />Group project 15%<br />Homework is not difficult at all. However, the group project is time-consuming which involved so many discussions and content.<br />Can bring a piece of A4 printed on both sides to exam.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GqUsF1o8Zu7kDN9BBXde7CfxIRnq1sgF",
            "semester": "2016-17 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Leslie Chung",
            "date": "Aug 26, 2017",
            "title": "",
            "comment_content": "Split into 10 modules, with one covered in one to two weeks.<br /><br />Content will be revolving around how to set up a project or business, including both hardware and softwares.",
            "comment_teaching": "Energetic and funny.<br />Flexible.<br /><br />A lot of examples were used to try to help students better understand the topic.",
            "comment_grading": "Assignments full marks<br />Projects above mean<br />Mid term below half a SD<br />Final above half a SD<br /><br />Final Grading : C+",
            "comment_workload": "Light workload<br />3 HW assignments<br />1 project <br />1 mid-term<br />1 final<br /><br />The project is perhaps the most difficult part of the course. The project is to develop a food business within HKUST. A presentation on the business has to be presented in front of the class at the end of the semester. <br /><br />However no clear guidelines are given for the project.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LGuZf88xtjPPBVHOh86Zq1ozxb0RP3Cp",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jenny Choi",
            "date": "Aug 25, 2017",
            "title": "Nice class",
            "comment_content": "it is a class introduced the basic logistic knowledge and some math problems in logistic ways",
            "comment_teaching": "Mrs. QIU is a mainland teacher but her English is quite easy understand. Her powerpoint is very clear but some answers of questions in powerpoint were showed on class.",
            "comment_grading": "the grade in this course is good. I got B finally because I&nbsp;&nbsp;did not do well in midterm due to I did not have enough time to finish it.",
            "comment_workload": "the overall workload is not big but the project and presentation need to spend some time on it.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5u12SqSqrvXPOmTRZbGorwcjYjnOFu1B",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kiu jai",
            "date": "Aug 22, 2017",
            "title": "",
            "comment_content": "尼個course 就係教一d 基本既物流知識 亦都有一d product design既野 需要計數 主要都係用式",
            "comment_teaching": "Prof 教得幾好 算詳細 不過課堂節奏比較慢",
            "comment_grading": "感覺上grading 一般 不過又唔係爛grade course",
            "comment_workload": "尼個course 既workload 唔算多 有幾份assignment 同2個pop up quiz mid term , final 同埋 group project with presentation 主要係group project 比較麻煩",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "j7VvLqz9mwJ0IfttyA4OCRuBe3azXCg0",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gg",
            "date": "Jun 12, 2016",
            "title": "Busi仔唔知S&amp;T讀咩好就狗衝呢個course啦",
            "comment_content": "先利伸:小弟我busi仔黎take呢個course當common core咁讀<br />內容同business core既isom2700係好大部份係相似既 eg project management, quality management, forecast, inventory management等等。不過都有一部份係isom2700無教 eg line balancing, aggregate planning, material resource planning等。<br />呢個course同isom2700最大分別就係ielm始終係engine course,計數題會多同難過isom2700, isom2700就會focus係concept多<br />busi仔如果同一個sem take哂isom2700同ielm2200就讀2個course都好似讀緊同一個course咁",
            "comment_teaching": "professor其實講得幾清楚,有時係isom2700到聽唔明就會呢個course專心少少學番lol, 不過有時有d悶",
            "comment_grading": "10% Random pop up quiz<br />20% Homework<br />30% Midterm<br />40% Final<br /><br />Pop up quiz 好淺, 用電腦又得, 同隔難一齊研究又得, 問埋professor點做都仲得, 所以基本上quiz就唔係100分就0分架啦(走堂)<br />Final 話就話cumulative, 點知佢final得1條mc係考midterm前既野, 真係比個professor伏哂<br />Midterm Final都有1張cheatsheet<br /><br />小弟我midterm 90.5 (mean ~76, SD~13), final 92 (mean 52, SD unknown), Homework同pop up quiz full,&nbsp;&nbsp;最後A+左",
            "comment_workload": "無咩workload, 得4份assignment, 1midterm, 1final. 但係要上堂因為會有pop up quiz total 3個",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "903arymoq7wAV6VlFV37adyP59XLpFZd",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "legendarychriz",
            "date": "Apr 24, 2016",
            "title": "A course which cheatsheets will decide the grades",
            "comment_content": "Main theme of the course: Cheatsheets, striving for 100% efficiency, and management.",
            "comment_teaching": "The professor is young, nice and attractive (that's not the main point).<br />She will teach you the essence of IELM, and will teach you tons of equations, so better arrange your cheatsheet as you are only allowed to bring&nbsp;&nbsp;one piece of paper for your cheatsheet.<br />Never skip classes, there will be quizzes in class and it weighs about 10% of your grade.<br />Pay attention to what she speaks, well thats not difficult because she is quite pretty and you will definitely concentrate in this class, well I did.",
            "comment_grading": "Will update this after my final grades are released.<br /><br />Mid term mean : 77, S.D. 13<br /><br />My result: Midterm more than 0.5 SD (84.5)<br />Finals: 39/100 mean: 52 <br />Someone got above mean 1 SD, the grade is still B-.<br />Got C+ at last, probably I fucked up too much in the final.<br />• Homework ----------------------------------------------20%<br />– No late homework is accepted. Please submit the hard copy to the<br />collection box before 5pm of the due date. No soft copy is<br />accepted. There are 4-5 assignments.<br />• Class Participation (random quizzes) ---------------10%<br />• Midterm Exam (tentative date: 16 Mar.) ------------30%<br />• Final Exam ----------------------------------------------40%<br />– Both midterm and final exams are closed book and closed<br />notes with a one-page A-4 summary sheet allowed (doublesided)",
            "comment_workload": "Plan for your cheatsheet, that's all.<br />You can memorize some equations or some key points about the advantages and disadvantages of using such equations.<br /><br />And pay attention to your calculations, one careless mistake may cost a subgrade.<br /><br />The mean of homework is 99.7/100, LOL.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iMNHjvElWktHnnvVG7RiDIqMH9kaXMZO",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 346,
                    "name": "AU, Yim Lee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sakura",
            "date": "Aug 26, 2015",
            "title": "好grade course for all",
            "comment_content": "主要學下Operation management嘢<br />上堂有video睇<br />2堂一個ppt<br />有時會做PRS,錯都冇所謂,主要用黎計attendence",
            "comment_teaching": "上堂悶,我通常聽到一半就恰着<br />Tutor nice, 有咩唔明就問啦",
            "comment_grading": "4份功課,每份佔5%,個個都almost full mark, <br />唔難, tutorial有教類似題型,<br />唔好遲交, 如果唔係都幾甘",
            "comment_workload": "輕鬆, HW都易搞掂<br />除非你想midterm/final攞攞滿分, 咁就背埋ppt啦, 因為啲MC好煩",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RkizESlmJhmAfvMKGoYpIFSMYcUzGerv",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 346,
                    "name": "AU, Yim Lee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jonas",
            "date": "Aug 16, 2015",
            "title": "比較少人知既好grade科",
            "comment_content": "mid-term:大部份hw類似既計數題目<br />final:背哂notes既野就得,因為主要考背野)",
            "comment_teaching": "prof 英文一般,幾悶下",
            "comment_grading": "mid term mean好高~70/100 我above 0.15個sd<br />final mean正常番~65 我above 0.85個sd<br />hw接近全滿<br />prs 有答就有分(我走左幾堂,所以prs個part麻麻)<br />grade:B+",
            "comment_workload": "有mid term,final,hw,有prs(差唔多堂堂都有)<br />每一份功課都要花好多時間,但唔難,只係多steps",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wEokRaPFaBqsSnAi9BvWVN8owfd6C4uB",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 360,
                    "name": "QIU, Xuan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hejabvb",
            "date": "Jun 01, 2019",
            "title": "Heavy workload but seems good grade..",
            "comment_content": "Very board content!<br />Lecture 1 Introduction<br />Lecture 2 Product &amp; Service Design<br />Lecture 3 Project Management<br />Lecture 4 Process Selection &amp; Layout Design<br />Lecture 5 Quality Management<br />Lecture 6 Forecasting<br />Lecture 7 Location Planning<br />Lecture 8 Inventory Management<br />Lecture 9 Aggregate Planning<br />Lecture 10 MRP &amp; JIT",
            "comment_teaching": "Clear PowerPoint but boring lectures.",
            "comment_grading": "Homework 10%<br />Class participation 5%<br />Project 15%<br />Mid-term exam 30%<br />Final Exam 40%<br />Closed book and a A-4 sized double-sided cheat sheet is allowed. I wrote my cheat sheet for more than 1 day. The exam covers some small details which is quite horrible if you don't mark down in the cheat sheet. P.S. my cheat sheet font size is 6. But overall the grading is really good. I got below mean in mid-term but I got a A- overall.",
            "comment_workload": "Very horrible workload!!!<br />3 assignments plus 2 pop-up quizzes<br />The main point is there is a project, which is very time-consuming, but only count for 15%....<br />You have to attend every lesson otherwise you cannot follow in the next lesson! Personally I spent a lot time to digest the knowledge after class! More than 4 hours per week!",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "pDXiYZuiF0lmzQFcS4g4P8Ye7m1cFkQJ",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 99,
                    "name": "LAM, Gibson",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pingu",
            "date": "Feb 11, 2018",
            "title": "COMP1021",
            "comment_content": "There was a good content in the course. This course basically teaches you the python language which is quite simple and easy to use compared to other computer languages. The course will teach python from scratch. This course is designed for students who don't have any background in computers, or they have very little idea about them. (i am in that category)",
            "comment_teaching": "LAM, Gibson is a very good teacher and he teaches everything nicely and precisely. He is a very easy going person. His lectures can be boring at times but I don't blame his teaching to be the cause for that. And honestly he just a very nice person as well. His explanation is very accurate. There are a lot of things in the course that can be confusing at times but he will clear them up nicely. Also, the PPT is self-explanatory and very well prepared, both for the LABs and the course itself.",
            "comment_grading": "This is where bad things can happen. This course is an open examination. You can bring your notes, PPT, a textbook to examination. Well, this might sound perfect but when you see the questions in the paper, they are really tough. Also the assignments, they can be tricky as well. But, for the assignments, they provide proper methods and ideas to help us go through with them.",
            "comment_workload": "If you think of the quantity then it might not be very high. You get 2 assignments and 2 examinations. That sounds very small but they are tricky. You will need to understand the course and attend the classes if you want to get yourself a good grade.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}