{
    "error": false,
    "course": {
        "id": 2725,
        "subject": "ISDN",
        "code": "2300",
        "name": "Introduction to 3D Design",
        "description": "This course will provide the theoretical principles and real-life examples of a wide variety of digital design technology. The course includes using computer-aided techniques to convert sketches into digital 3D models, animate static 3D models into computer animation, and finally render the 3D models to become the final product image or video. The course also describes how the 3D models and renderings are being used in Virtual Reality and Augmented Reality. Topics covered will include Photogrammetry, Fundamentals of 3D Modeling, NURBS, Principles of Traditional Animation, Computer Animation, 3D Rendering, Virtual Reality and Augmented Reality. Instructor’s approval is required for enrollment in the course.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.13,
        "rating_teaching": 3.88,
        "rating_grading": 4,
        "rating_workload": 3.13,
        "review_count": 8,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1209,
                "name": "YEUNG, Sai Kit",
                "count": 7
            },
            {
                "id": 345,
                "name": "GOONETILLEKE, Ravindra Stephen",
                "count": 5
            }
        ]
    },
    "reviews": [
        {
            "hash": "1Rb11howaU8PFeKMwjelM1IWjfSzjiLi",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1209,
                    "name": "YEUNG, Sai Kit",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lambo",
            "date": "Jan 18, 2023",
            "title": "Fun course, but tough TA",
            "comment_content": "1. Photogrammetry<br />This is quite short, only two lessons. Not much to say about it.<br />2. Rhino CAD modeling<br />Go through the basics of rhino, and have a few lab modeling assignments<br />- Use reference images to create shapes<br />- T spline modeling<br />- Precise modeling<br />- Curves<br />- Modifiers ( twist, scale, etc)<br />- Grasshopper procedural modeling<br />3. Blender rendering and animation<br />- Preparing meshes<br />- Simple blender modeling<br />- Simulations (solid body, gravity, fluid)<br />- Keyframes (to animate things)<br />- Camera control<br />- lighting, colors, and textures<br />- Blenderkit<br />- Rendering settings<br />4. Final project<br />The final project is actually done throughout the semester, but more frequently after learning blender.<br />- Design your own product<br />- Create a storyboard for animation<br />- Use Blender to actually make the animation with your CAD models<br />- Present half-finished animation and get feedback<br />- Present final animation",
            "comment_teaching": "The professor teaches the lectures and the TA teaches the labs. The professor is chill, which is not a problem at all. As for the TA, most of the class would agree quite harshly on the grading. In addition, I think the grading is entirely subjective to the TA, so be prepared to get pissed if you are unlucky.",
            "comment_grading": "I submit some of the assignments with the wrong file types, and got zero, no changes, said the TA. Therefore I only got a B, even though my final project was one of the best in the class. Be very careful taking this class because the TA doesn't make everything clear to you, and you are expected to &quot;get it right&quot;.",
            "comment_workload": "Spend lots of time doing the animation, 40 hr+. But I enjoyed the project, so it was okay for me. But getting a B after so much work is just fucking sad : )",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Mny36IKkX1iBtrh7ZrDdvJU9vSCPCw4u",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1209,
                    "name": "YEUNG, Sai Kit",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JimmyWu",
            "date": "May 22, 2022",
            "title": "A introductory 3D Modelling Course",
            "comment_content": "The content is okay for beginners to follow, but the content only covers the very basics of Rhino, and sometimes lesson time is used to explain the details behind the tools which might not be necessary. For example, grasshopper is a very powerful tool in Rhino but it is only mentioned in one lesson.",
            "comment_teaching": "The Teaching is ok la. TBH most of the lectures are about the theoretical stuff so not many people are interested. The labs are very useful but the TA can go through them pretty quickly so make sure to pay close attention and ask your friend.",
            "comment_grading": "I got A+.<br />The grading is fair, to get an A you need to work considerably and a good model and rendering are expected. For a B you will need a decent model and a long enough video. Somehow the grading can be dependent on your PC hardware as 2300 is rendering intensive. Please make sure to borrow a PC from ISD if rendering is a problem.",
            "comment_workload": "The Workload is pretty heavy if you want a good looking result. Many people worked close to overnight for the Mid-Point and the Final Presentation which take up to a week of work. You have to make sure you plan out your rendering schedule and some people show up with no rendered video and just a model. I turned to Blender for my rendering which is much faster than in&nbsp;&nbsp;Rhino.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "isQwebpbjO337M5vQKR4WytFizsUu4Oy",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 345,
                    "name": "GOONETILLEKE, Ravindra Stephen",
                    "rating": 1
                },
                {
                    "id": 1209,
                    "name": "YEUNG, Sai Kit",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "soy",
            "date": "Jan 22, 2020",
            "title": "有趣geh學動畫/遊戲設計 Very fun course for you to learn about animation/ gaming",
            "comment_content": "(唔想睇英文geh 下面有Google tranlate版)<br /><br />Very fun course for you to learn about animation/ gaming in class!<br /><br />It mainly uses the software Unity, lots more to explore for the class. You will also learn Rhino (3D modeling), Blender (rigging of models, aka making bones), Unity (animation/ game making).<br /><br />one little PRS in-class quiz.<br /><br />非常有趣的課程，讓您在課堂上學習動畫/遊戲！<br /><br />它主要使用Unity軟件，還有更多的課程可供探索。 您還將學習Rhino（3D建模），Blender（模型裝配，又名製作骨骼），Unity（動畫/遊戲製作）。<br /><br />one little PRS in-class quiz.",
            "comment_teaching": "(唔想睇英文geh 下面有Google tranlate版)<br /><br />Too much to tell in class but not all of them will be used in class and explored. A little bit confusing. You can ask more about the syllabus and assignment to know what part of the lecture is more useful for &quot;the assignment&quot;. Or you can ask more if you are interested in all the stuff (I am not).<br /><br />在課堂上講的內容太多了，但並不是所有的內容都會在課堂上使用和探索。 有點混亂。<br /><br /> 您可以詢問有關課程提綱和作業的更多信息，以了解講座的哪一部分對“作業”更有用。 或者，您可以問更多是否對所有內容都感興趣（我不是）。<br /><br />兩個instructor，一個話事權大d嘅你好易睇得出，你可以刷佢鞋，但佢其實好睇你嘅作品，所以努力做assignment啦。",
            "comment_grading": "I got an A+ in the end, I guess if you pay effort to every project and assignments, Ravi will give you an A. But you have to work super super hard in this course to catch up and be better then others<br />Besides, it is better to show your passion and work in class.<br /><br />最後我攞A +，我想如果您為每個項目和作業付出努力，都會給您A。但是你必需好用心做每一份野，最好可以在課堂上表現出您的熱情和工作。<br /><br />我冇設計底，很努力，可以肯定的是你必需很努力。",
            "comment_workload": "3 credit course should be normal heavy workload range.<br />But you have to pay attention in LAB!! to know how to do all the assignments.<br /><br />You will have to work super hard on each assignment to show your passion. <br /><br />one little PRS in-class quiz.<br /><br />可以肯定的是你必需很努力。",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1aVAe55WfcB0MeM59Y70fnMNdnp7XgHX",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Rachna",
            "date": "Nov 05, 2019",
            "title": "",
            "comment_content": "I like the topic we learned, and the softwares that were chosen",
            "comment_teaching": "The professors themselves are very nice., however, they go really fast and many people are left behind because some of the students grasp the material fast than others in the lab, or have done coding, or similar Softwares before. The lectures were good and easy to understand though, they do not put all the lecture online, so it's difficult to remember all the tools based on 1 lecture per week.",
            "comment_grading": "Grading is not done consistently, despite having multiple assignments",
            "comment_workload": "",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aa0yKjJ4wZtH0IU2w6DWBKZkgWjZ4rlx",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 345,
                    "name": "GOONETILLEKE, Ravindra Stephen",
                    "rating": 1
                },
                {
                    "id": 1209,
                    "name": "YEUNG, Sai Kit",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GeekZJK",
            "date": "Aug 20, 2019",
            "title": "Good course",
            "comment_content": "The course will tell you how to do some basic digital design like 3D model building, basic 3D game creating, etc.",
            "comment_teaching": "The professors are very kind. They are always glad to answer your questions and the lessons are full of fun.",
            "comment_grading": "There are several assignments and quiz, also a final project. The assignments and project count most to the final grade. Just&nbsp;&nbsp;devote more to the assignments and the project, the grade won't be so bad.",
            "comment_workload": "Normal assignment doesn't occupy much time. However, before the final project, professors just talked about some very basic Unity skills and asked us to create a complete game. As a result, we spent a lot of time watching YouTube tutorials.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Jk3n4GV9vy6ZQIRjXxrpwF8iEiXBSLGe",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 345,
                    "name": "GOONETILLEKE, Ravindra Stephen",
                    "rating": 1
                },
                {
                    "id": 1209,
                    "name": "YEUNG, Sai Kit",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "NLC",
            "date": "May 15, 2019",
            "title": "",
            "comment_content": "Prof will teach a lot about virtual design<br />Rhino, Blender, Unity and other software relate to digital design.<br />Attendances are required, But it seems that professors have not token at all.<br />It is a project-base course. you need to finish something after the lab.<br />The final project is a group project (while the assignment is individual project)<br />Every project is fun.",
            "comment_teaching": "Professors are nice, they explain many knowledge about digital design. They provided many equipment to us, such as VR glass, 3D printer. They will talk to you before you start your final project.",
            "comment_grading": "Labs 30% <br />Quiz 30% <br />Project 40%<br /><br />An assignment will be assigned every two labs.<br />&nbsp;&nbsp;<br />Quizzes are not easy to pass.<br /><br />You need to show your effort to professors when you present your final project. Project files and reports about the final project need to be submitted.",
            "comment_workload": "Many projects are waiting you, if you enroll this course.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mijikK3jRHumUOsqK911szNpP8X5azxY",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 345,
                    "name": "GOONETILLEKE, Ravindra Stephen",
                    "rating": 1
                },
                {
                    "id": 1209,
                    "name": "YEUNG, Sai Kit",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jack Zhang",
            "date": "Feb 18, 2019",
            "title": "Learn four useful softwares and make a game with them",
            "comment_content": "In two to three weeks, we leaned a software, they are thino, processing, blender and unity (if you do not know what are these softwares, google it). Every lab we would use the software we learned that week to implement some small functions. For example, in rhino lab we build our 3D print sports car, in processing we draw some simple graphs with java, in blender we add bones to a stick man figure, in unity we control the movement of the stick man. Besides these four softwares, we also have a lab to learn human body position recording. <br />PS: highly suggest programming skill to take this class, since processing require java and unity require C#.",
            "comment_teaching": "Two professors are very nice. They could help you out of class at any time. Before the final project, they could talk with your group about your proposal for many times, if needed. Every class, professors would prepare very detailed handout, that helps lot. they provided unlimited 3D print material and Alienware laptops and many VR glasses as lab materials. The only bad thing is that they prolong the class many times, but they have improved a lot this semester.",
            "comment_grading": "Our first three projects have very detailed grading explanation, which are graded by TAs. The professors also explain our projects in class anonymously. But the last two projects I didn’t see my score. The final projects is very important, as shown below 40%. I have to say that the grading is pretty fair, depending on how much efforts you have put into this project, not like ISDN 1000 professor.<br /><br />Labs 30% <br />Quiz 30% <br />Project 40%",
            "comment_workload": "We have no homework, just project and project and projects. Approximately every two weeks we would have a small project, about what software we have learned that week. It really takes a lot of time, cause if you want a good grade in projects which take a large percentage, you need to implement many details and two professor really look at your effort. We have one month to design and implement our final project. Our group stayed up for three nights to finish our game.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MdUBXOLYV7BcBzboa8RGYPHE7z76TK47",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 345,
                    "name": "GOONETILLEKE, Ravindra Stephen",
                    "rating": 1
                },
                {
                    "id": 1209,
                    "name": "YEUNG, Sai Kit",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Li2020",
            "date": "Apr 28, 2020",
            "title": "",
            "comment_content": "Multiple topics regarding digital design including Rhino, Processing, Unity etc. <br />Too many topics which it may be hard to follow. You will only learn the basic skills but it is a good start for digital design.",
            "comment_teaching": "Basic introduction to multiple software. Instructors will talk about the real life application of those software but you will never use those technique for the project. Also, they will talk about the principle of those software. TA will demonstrate the software and guide you step by step but still you may face some problem that cause you hours to fix.",
            "comment_grading": "I got B+. Mostly based on the final project's performance. B range is manageable but A range requires load of self-learning in order to fulfil the expectation for A range.",
            "comment_workload": "It required some effort on completing the final project which is an animation created with Unity and 3D modeling and rendering created by Rhino, blender and processing.<br />Quiz and lab are also required. The quiz is hard but does not really affecting your final grade. Lab is OK if you follow the guide of TA.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}