{
    "error": false,
    "course": {
        "id": 3186,
        "subject": "ISOM",
        "code": "2020",
        "name": "Coding for Business",
        "description": "This course intends to introduce students to basic programming concepts and skills for business data coding and business problem solving. Using Python as an illustrative programming language, this course provides students with a basic understanding of programming concepts and syntaxes, including data types, associated methods and functions, and control flow statements. Through the process of learning a programming language, students will also develop logical and critical thinking skills and be able to tackle simple business problems with coding. For SBM students only.",
        "categories": [],
        "website": null,
        "credits": 1,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"1021\" href=\"/review/COMP1021\" target=\"_blank\">COMP 1021</a>",
        "rating_content": 3.97,
        "rating_teaching": 4.02,
        "rating_grading": 3.21,
        "rating_workload": 3.05,
        "review_count": 62,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1196,
                "name": "HONG, Weiyin",
                "count": 49
            },
            {
                "id": 1108,
                "name": "WONG, Ka Chau",
                "count": 19
            },
            {
                "id": 1506,
                "name": "CHEUNG, Chun Lok (Hilary)",
                "count": 10
            },
            {
                "id": 366,
                "name": "CLARK, Theodore Henry King",
                "count": 6
            },
            {
                "id": 373,
                "name": "JIA, Jia",
                "count": 5
            },
            {
                "id": 1477,
                "name": "Hilary CHEUNG Chun Lok",
                "count": 5
            },
            {
                "id": 949,
                "name": "LAI, Sum Yu",
                "count": 2
            },
            {
                "id": 1602,
                "name": "LEE, Aaron Chun Hay",
                "count": 1
            },
            {
                "id": 1777,
                "name": "TSE, Chris",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "VAIdz7pWcAJtAjdFwXYU08LPq9xIaaUS",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1477,
                    "name": "Hilary CHEUNG Chun Lok",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Rigbones",
            "date": "Jun 06, 2021",
            "title": "Fat and Arrogant TA",
            "comment_content": "Really basic python knowledge.&nbsp;&nbsp;Easy to learn but because of that the course is really competitive.",
            "comment_teaching": "Prof Hong is really good.&nbsp;&nbsp;She speaks good English and teaches clearly.<br /><br />Hilary is a disaster though.&nbsp;&nbsp;He’s so rude and impolite.&nbsp;&nbsp;He keeps complaining that he is a TA for 6 or 7 courses so he doesn’t have time to deal with petty issues from ISOM 2020, but I think he just wants to show off that he is “so capable” in handling so many courses at once.&nbsp;&nbsp;<br /><br />He triple majored in GBUS, FINA, and ISOM, but he can’t even learn basic decency.&nbsp;&nbsp;Disgusting male.&nbsp;&nbsp;Yuck!&nbsp;&nbsp;Don’t ever expect a reply email from him.",
            "comment_grading": "I want to find the assessment weight of each component but whoops sorry Hilary immediately removes the course from Canvas once it is over.<br /><br />10 Weekly quizzes (2 per week)<br />1 assignment<br />1 final exam<br /><br />That being said, even if I told u the weight it’s absolutely useless cause he never reveals the marks you got for each component.&nbsp;&nbsp;Shady grading if you ask me.<br /><br />Exams are more of a typing test rather than test of knowledge.&nbsp;&nbsp;Just make sure you type quickly than you’ll be fine.&nbsp;&nbsp;I never learnt programming before but I got A-range.&nbsp;&nbsp;Who knows what I got for finals though.",
            "comment_workload": "They reduced the workload compared to previous years because of horrible reviews from students.&nbsp;&nbsp;The adjusted workload is acceptable for a 1 credit course.<br /><br />I still gave an E for workload because withstanding Hilary’s rude emails and rude teaching requires a lot of mental effort.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 19,
            "vote_count": 20,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": [
                {
                    "key": "uM5UwalNcBPMk5ZmV92anvJsMqYfpm8M",
                    "name": "Rude email example",
                    "format": "jpg"
                }
            ]
        },
        {
            "hash": "saMRz4hpEpaGE7U8ytUCU4SUok5WRZz9",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pearl",
            "date": "May 11, 2020",
            "title": "Shady grading it took them 3 darn weeks to mark the final but wouldn't release the scores??",
            "comment_content": "Python basics. Intro class so it's pretty understandable even for people with no experience with coding.",
            "comment_teaching": "meh.",
            "comment_grading": "BS. <br /><br />They can always find something wrong in your lab, even if you do manage to come up with the exact answer. <br /><br />Mid-term was set to be 90 min but then they decided to allow for extra 5 mins for people to finish??? The rule was that once you're done you cannot go back to the previous questions, and so many of us who try to rush through on time end up not being able to do anything in the extra time while waiting for slow people to finish.<br /><br />and then they decided to add on another grading scheme which completely excludes midterm grades. That's fine, except they decided to make the final super easy, take up 65%, and then take forever to grade while not releasing the final's score. <br /><br />I got a B+ and I need an explanation from these people. Make sure to be careful. Shady grading isn't an issue until it happens to you.",
            "comment_workload": "1 credit with way too much work to do.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 10,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YwPeuygCUnlujZhDwKsjrj9wizGk11xV",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1477,
                    "name": "Hilary CHEUNG Chun Lok",
                    "rating": 0
                },
                {
                    "id": 1506,
                    "name": "CHEUNG, Chun Lok (Hilary)",
                    "rating": 0
                },
                {
                    "id": 373,
                    "name": "JIA, Jia",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "no_name_provide",
            "date": "Jan 25, 2021",
            "title": "Hilary, if u don't respect us students, don't expect to gain any of our respect",
            "comment_content": "Fundamental of programming w/ Python <br />Basic syntax<br />String &amp; List<br />If statements<br />For loop <br />that's all",
            "comment_teaching": "Prof.'s English is too hard to understand. Never attend his lecture. <br /><br />As for the TA Hilary (a men), that's disaster. He is very 閪. He write announcement &amp; email in a very rude way and he has no respect on students (I think on prof also, seems like he guide prof how to teach/design the grading items instead of other way round). Also, he is so arrogant. Recognize his name 'Hilary' (single 'l') will give u 1.5% of course grade! (but no point will be earned if you memorize prof's name) Disgusting! Disgusting!! Disgusting!!!<br /><br />If you have basic comp knowledge, just go through the lecture notes to capture the syntax will be fine.",
            "comment_grading": "Weekly Quiz on Pre Lecture/Lab Video (15%)<br />- Watch pre class videos before each lecture and lab.<br />- 5 from lecture + 5 from lab <br />- After watching the videos, complete the corresponding quiz on Canvas.<br />- Each quiz counts for 2 points ( merit based ) towards your final<br />- Buffer policy: 20 points can be earned, but capped at 15 for final grade only =&gt; very easy to get full mark<br /><br />Assignment (25%)<br />- quite easy<br /><br />Exam (60%)<br />- much much much more difficult than assignments<br />- you might loss a lot of marks if you did not prepared well due to wrong impression on the easy Qs set on asm &amp; practice Qs (or have a good programming background)<br />- strange rules such as &quot;only able to use methods teach in this class&quot; and &quot;u're not allowed to create an additional list&quot; are enforced in the exam =&gt; i think this is just a tolerate to business students with only half semester exposure to programming <br /><br />Overall: Extremely bad grading <br />even I can achieve all the requirements of the tasks and print out designated outputs in assignment and exams (w/ full mark in quiz), I got A- only<br /><br />also, there is zero transparence on all the graded works done in this course. Only marks but NO answers of weekly quiz are provided, so you will never know where you loss the points and learn from mistakes. <br /><br />And for assignment and exam, NO mark is given and they deleted the Canvas page quickly after they release the grade. Sb in goop says Hilary will NOT response to email right after the grade released. <br /><br />Overall, the grading and assessments of this course is designed for fulfilling Hilary's exaggerate self-esteem rather than really designed for students to learn Python and reasonably assets business students with no prior knowledge in programming.",
            "comment_workload": "Very light if u already have some very basic programming knowledge like me (it will just like you are taking COMP bridging courses)&nbsp;&nbsp;<br /><br />but I guess it will be extremely hard for those without programming knowledge as you need to understand computer logic starts from scratch, which I do so in a 3 cred whole semester COMP course",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 8,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oWcrpJtUSEH9KyZi9fCI8Q71m1qlauuT",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Boeing787",
            "date": "May 17, 2020",
            "title": "Terrible and awful course!",
            "comment_content": "Basics for coding. I am terrible at coding and this course was a total nightmare! I dreaded the lab sessions every week!<br /><br />Syllabus<br />Introduction to Syllabus<br />Introduction to Python<br />Python Basics 1<br />2 <br />Python Basics 2<br />String<br />3 <br />List, Tuple, and Set<br />4 (Mar 11~17)<br />Dictionary<br />Conditional Flow Statements<br />Release of Assignment March 17<br />5 <br />Loops Statements<br />6 (Mar 25~31)<br />Pandas",
            "comment_teaching": "Professor Hong is an extremely knowledgeable and approachable professor. She is clearly very competent in coding. When students encountered problems in coding, she was very patient in the explanation of work. She is by far the best professor I have encountered so far. It is unfortunate that I cannot enjoy benefit much from her excellent teaching as this is my most hated course in HKUST so far!",
            "comment_grading": "I don't even bother about the grading. I've given up on this course towards the end. After all, it's a 1-credit course. You don't need to worry too much about it pulling down your GPA.<br /><br />A. Lab Exercise (best 5 out of 6)<br />15% (got a few 2's and 1.5's haha)<br />B. Assignment<br />20% (got slightly below mean)<br />C. Mid-term Quiz<br />25% (got below mean, not sure how SD's as it was not released)<br />D. Final Exam<br />40% (did terribly, 嘔血！）<br />TOTAL:<br />100%<br /><br />Grades for finals were not released but I believe I did terribly as I didn't know how to answer many questions. I got a C- in the end haha! But it only pulled down my GPA by 0.1! So it's fine, it's just a 1-credit course!",
            "comment_workload": "Extremely heavy workload. This course has a higher workload than any 3 credit course I've taken so far! The course length is 200 minutes a week, which includes a 100 minute lecture and a 100 minute lab session. There are 6 lab session and you have to hand in 6 lab assignments.The first 2 labs were easy to handle but subsequently became overwhelming for a newbie with coding experience like me! It was a pain in the ass.<br /><br />There is a midterm, final and 100-mark assignment, all packed into a 1-credit course for half a semester! Are you serious? This is way too much for a one-credit course. This feels like a 4 credit course to me! The ISOM department should reduce the workload for the course. Instead of 6 lab session, there should be only 3~4. Midterms or assignments should be excluded. I can't believe I spent more time on this course than any other in HKUST. It was a total nightmare and I'm glad I'm done with this! Yuck!",
            "rating_content": 1,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "P9xJxkrA657hZgCxT2AV8qmtKx8qvMrr",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1506,
                    "name": "CHEUNG, Chun Lok (Hilary)",
                    "rating": 0
                },
                {
                    "id": 1477,
                    "name": "Hilary CHEUNG Chun Lok",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "solarski22",
            "date": "May 03, 2021",
            "title": "The worst TA ruined this course",
            "comment_content": "Very basic python knowledge:<br />1. Introduction to Syllabus &amp; Python<br />2. Collective Variables<br />3. Conditional statement<br />4. Loops (for loop only)<br />Some content are cut this semester. <br /><br />Boring and useless content.&nbsp;&nbsp;If you are not going to choose IS, the content actually contributes nothing to your future studies. Even if you are going to choose IS, the content in this course is also not worth a credit and it is not enough to be called a programming course. By just taking this course, you can't even take the COMP1029P programming bridging course, as the prerequisite is not fulfilled, so you can see how useless is this course. Also, there are almost nothing related to business, don't get why it is called Business Coding. The content is easy to understand though.<br /><br />It seems that the content changes every semester. Although this course has already been offered for 3 semesters, I don't get why the course is still not tending to improve.",
            "comment_teaching": "Prof Hong's teaching is okay and she is nice. She emphasizes 'interactions' between students and the instructors, so the lessons are interactive and not very boring. Overall. the teaching fair for the professor. <br /><br />The TA is Hilary. He is a man. His attitude is bad. He writes announcements in a rude way. He is inconsiderate about different students' needs. When you have accidentally given him some 'troubles' (although he has a responsibility to solve/help you with it), he would just ignore you or later write a rude announcement saying that 'you do not deserve any leniency'. The best way to communicate with an arrogant TA like him is to try to be nice, and never give him troubles. He is definitely the worst TA I have encountered. I have&nbsp;&nbsp;another COMP course this year, and the TAs there are way better and nicer than him. Don't think that he will help you. He doesn't reply to students' emails, and he won't even let you know how many marks you scored in your hw/exam.",
            "comment_grading": "1. Pre-lecture video and weekly quizzes (lab and lectures)&nbsp;&nbsp;15%<br />&nbsp;&nbsp;&nbsp;&nbsp;- A total of 10 quizzes x 2 points = 20 points (capped at 15 points)<br />2. One individual assignment&nbsp;&nbsp;25%<br />3. Final exam (closed book, online)&nbsp;&nbsp;60%<br /><br />The final exam is disastrous. Not testing your knowledge, but testing your speed. Each question is restricted by a very harsh time limit. Even you know how to do, you do not have time to type. They said it is to deter cheating, but they are just making things worse for everyone and thinking that they have successfully made the exam environment more fair. Moreover, if you are late for one second, penalty is given, as canvas will not let you to submit anymore, and you will have to email your work to Hilary, and Hilary will start to be angry and saying that he is very busy and you should not be late in any circumstances. He will not reply your email either. More about him here.<br />https://lihkg.com/thread/1600657/page/1<br /><br />Finally, no information about how many marks I got in the exam and assignment, and the Canvas page is deleted immediately...",
            "comment_workload": "Inadequate for a half-semester 1-credit course.<br />(I know it is already better than previous semesters)<br />From my point of view, the lab side takes 3 credits, the lecture side takes 3 credits, total = 6 credits, but as it is a half-semester course, so the workload should be 6/2 = 3 credits.<br />For every week, you have to watch a total of ~9 videos, average length ~ 9 mins, and then do 2 quizzes. The workload is actually not high, but it just shouldn't be described as a 1-credit course.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WKHpCm9M0URJvjLZe8vs4FnKjKdKXZHd",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nononope",
            "date": "May 24, 2022",
            "title": "felt harder than my 4-credit courses, what a joke of a course",
            "comment_content": "basic python knowledge pushed down your throat in the matter of 6 weeks, i thought this was for pure beginners, but i don't think they understood the assignment.<br /><br />topics I strongly suggest you familiarize yourself with before you do this course if you have no coding background &gt;&gt;&gt;python basics, lists (collectives variables), if..elif..else (conditional statements), for loop &amp; while loop.",
            "comment_teaching": "teaching was great - she was a really nice prof and she was really organized, her and the TA, always stuck around for everyones questions and made sure everything was understood",
            "comment_grading": "weekly quiz (5%)<br />lab submissions (10%) <br />individual assignments (20%)<br />final exam (65%) <br /><br />i dont get why they had to make an introductory course so hard - like after 4 weeks it hits you like a truck - i somehow managed to do the individual asm but because i had a week to do it and even then i was struggling - the final was a bit harder but they gave me an hour to do it and they put 65% of grade weight on that - tell me how i should feel <br /><br />i got a C i dont know how",
            "comment_workload": "this is was absolute poo poo - the individual assignment was a nightmare and the final was your nightmare come true - like they gave you the basics of python and it felt like i was suppose to be some CS wiz who is suppose to make a google search engine out of this basic knowledge, at least to someone like me who doesn't have a coding background <br /><br />but the in-class stuff was nice and manageable you had to watch like 30 mins of recorded lecture before the classes to do a easy quiz on canvas and then you get full weekly quiz marks - lab submissions were easy too - you attend the labs and do what he says so you need to make sure you show up and do it and submit the file on canvas during the lab sessions also very manageable",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dHKDvgg5Dn7ohkeakH25uKnhdEFaWIZ6",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1506,
                    "name": "CHEUNG, Chun Lok (Hilary)",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Goodestpig",
            "date": "May 09, 2021",
            "title": "TOO MUCH WORKLOAD",
            "comment_content": "Basic Python knowledge.",
            "comment_teaching": "Prof Hong is nice and willing to explain your problems.<br />Hilary is so arrogant:) No respect to the students:) Never reply your email although he asked you to send an email to him.",
            "comment_grading": "Quizzes: 15%<br />Assignment: 25%<br />Final exam: 60%<br /><br />Final exam is a disaster. Limited time for every question in order to prevent cheating :) No time for you to decide how to answer the question and need to input immediately. We do not know how many marks we get in the exam and assignment:) quite unfair for grading",
            "comment_workload": "TOO MUCH FOR 1 CREDIT<br />Every week a lecture, a lab, and even pre-lecture video and quiz.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 4,
            "attachments": []
        },
        {
            "hash": "V8GO8bkDXoUEXgdUM5WvXjnRSYzGYetx",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1506,
                    "name": "CHEUNG, Chun Lok (Hilary)",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Ged",
            "date": "Apr 30, 2021",
            "title": "DAMN fucking shitty TA! Don't reg this course if you ain't a SBM yr1 student.",
            "comment_content": "Basic syntax and knowledge of python.",
            "comment_teaching": "Prof.Hong is a good instructor. But the stuffs are not difficult to understand, so teaching doesn't matter a lot.<br />As for the TA, Hilary(A man), he is a hypocrite. He crowed about his &quot;good skills&quot; of catching cheats many times in class. HOWEVER, he never released the scores of Individual assignment and FINAL EXAM, which contributes to about 85% of your grade. I think this person is not honest, he is very arrogant. It is worth doubting whether there was some misbehaviour when he graded the individual assignment and final exam because he never tried to release details of these two important stuffs.",
            "comment_grading": "Really poor grade. Many students have learnt python in high school, plus the grade is not transparent. so it is not easy to get good grade.<br />THE TA NEVER RELEASED ANY DETAILS OF THE GRADE!!!!",
            "comment_workload": "Heavy. You must watch extra videos every week. Reg comp1021 if you want to learn python.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cRoQbdgIPygBJlLKdEMlBKTi5rLh7VjN",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "(:",
            "date": "May 02, 2023",
            "title": "🥲A little bit too much for a 1-credit course",
            "comment_content": "1. Introduction to Python<br />Arithmetic operators, Print,<br />Variable, and Data type<br /><br />2. Input, Conversion,<br />Collective Variables<br /><br />3. Conditional statement (if...else)<br /><br />4. Loops (for)<br /><br />5. More about Loops (while/break)",
            "comment_teaching": "Professor Hong is very good at explaining. She presents concise and coherent lecture practices, notes and easily understandable presentation styles.<br />She also has a delightful sense of humour. And her voice is very soothing.<br /><br />But still, self-learning is imperative if you want to achieve a satisfactory grade. This course presents high levels of competitiveness, and some students have already acquired prior knowledge of Python.",
            "comment_grading": "I cried.<br />I thought I would get a good grade, yet I didn't. Probably I was too overconfident about myself and underestimated the ability of others.<br /><br />Guys, work hard.<br />Remember to revise every lecture and lab practice thoroughly before the final exam at least three times. Make sure you understand 98.9% of the course materials.<br />Pay attention to details, such as indentations and quotation marks. <br />And remember: <br />6/2<br />It returns a float, not an integer!",
            "comment_workload": "1. One pre-lesson video per week: You must watch it. It is essential and valuable.<br /><br />2. One quiz regarding the pre-lesson video ( 10 questions per week): Not difficult at all. If you have watched the video, you should be able to finish them within 10 mins.<br /><br />3. Lab assignments per week: Not too complex as well. Even if you have questions, the TAs are willing to help.<br /><br />4. Self-revision💥💥💥<br />Yeah. It would be best if you put a lot of effort into memorizing the logistics and usage of the codes, especially for amateurs like me.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KZBqDhdtJIvAQeWo5oeyF9jb43634xs5",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Annnnnnnn",
            "date": "May 31, 2022",
            "title": "Not bad",
            "comment_content": "content is quite easy but boring. I just attended 1-2 lectures.",
            "comment_teaching": "clear. She would post some videos before the lecture and you have to watch them and finish the quizzes before the lesson.<br /><br />she is pretty friendly and kind, I emailed her serval times for questions and she replied quickly.",
            "comment_grading": "Bad<br />I guess my assignment was nearly full marks but I sucked in the final exam. <br />The final exam is quite difficult and I only got C at the end.",
            "comment_workload": "heavy workload.<br />Although it is just a 1 cr course, it contains quizzes, assignments, and a final exam.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qWkdti6L2dyVm3AHjgJTlpCCjou627is",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 373,
                    "name": "JIA, Jia",
                    "rating": 1
                },
                {
                    "id": 1506,
                    "name": "CHEUNG, Chun Lok (Hilary)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nobodyyyy",
            "date": "Aug 25, 2021",
            "title": "Worst instructors I have ever encountered",
            "comment_content": "Content is useful, able to learn basic Python knowledge in this course. However, there are rules you have to follow. You are allowed to use codes that were taught in class which I think is completely unreasonable. Just like classes in high school.",
            "comment_teaching": "Dr. Jia is responsive and willing to answer questions but his teaching is quite boring. <br /><br />Hilary is terrible. He is very rude in emails and classes. It was a disaster to be taught by him.",
            "comment_grading": "They did not release the exam marks so I am not sure whether the grading is fair or not. Hilary will not reply to your emails after final examination so you will never know how you get the grade.",
            "comment_workload": "Fair. You have to complete a quiz per week.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "unWhHGGOAURKG4Gs5Qq765gk1PyO3Bod",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1477,
                    "name": "Hilary CHEUNG Chun Lok",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "merryXmas",
            "date": "Jul 02, 2021",
            "title": "Ermmmmm...",
            "comment_content": "Simple Python<br />Cover Panda in the last week but it is not tested in final exam",
            "comment_teaching": "Weiyin actually explained everything clearly and she's a very nice instructor with patience. Hilary is just the opposite, the way he speaks really make people stress out:(",
            "comment_grading": "Fair<br />Not sure about the grading in final exam but heard that they give partial credits",
            "comment_workload": "It is just an one-credit-course but the workload is as heavy as a three-credit course...need to watch videos and take quizzes before each class, which is quite troublesome",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "V8pR6NRQHZXWZPLZG76VOdgnx1DH1Tjq",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kelvin123",
            "date": "Jan 21, 2021",
            "title": "Shit TA, ambiguous marking criteria",
            "comment_content": "General python knowledge such as variable, loop, string, etc. Easy to catch up even if you not a pro in coding.",
            "comment_teaching": "Dr. Hong was a good teacher as she teach thing systematically and lots of examples were used. What frustrate me was the teaching of TA. They seemed impatient all the time in teaching.",
            "comment_grading": "Unfair grading. The individual assignment I handed in was graded badly even when I fulfill all the criteria in the marking scheme.&nbsp;&nbsp;&nbsp;The marking criteria was unclear. Even though I email TAs for reasons, they held they will not consider any mark change at any circumstances. The explanation they gave me was also unreasonable. I got a B- eventually.",
            "comment_workload": "OK workload as the curriculum had been changed.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BRGWYBsWVEGOa494hyQqKrDBYIqdF3Ws",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ryan Fung",
            "date": "Dec 07, 2020",
            "title": "",
            "comment_content": "W1:<br />print()<br />- Variable<br />- Data type: int, float, string<br />- Conversion: int(), float(), str()<br /><br />W2:<br />if…elif…else<br />- input()<br /><br />W3:<br />List<br />ꞏ Index and slicing (with step)<br />ꞏ append()<br />ꞏ Functions (len/max/min/sum)<br />- Dictionary<br />ꞏ Definition and format<br />ꞏ Retrieve value by key<br />ꞏ Functions (keys/values/items)<br />ꞏ Update a value <br /><br />W4:<br />for… in …<br />- range()<br />- break <br /><br />W5:<br />Relational operators (&lt;/&lt;=/==/&gt;=/&gt;/!=)<br />- Boolean variables<br />- Boolean operators (and/or/not)<br />- while loop<br /><br />W6:<br />Intro to Pandas<br /><br />(This is an overview of what you can learn in this course)<br /><br />Very basic python knowledge",
            "comment_teaching": "Her teaching skill is fine. Easy to follow. There will be exercises available for you to practice after class. Simple explanations on them will be provided as well.",
            "comment_grading": "Class participation: 20%<br />Individual assignment 1: 15%<br />Individual assignment 2: 25%<br />Individual project: 40 %<br /><br />The assignments are not difficult at all. But for the project, simply fulfilling the basic requirements are not enough. Make sure you have some creative additional functions.<br /><br />I believe it is easy to get a good grade in this course if you have any programming background. If not, try to practice more so that you can understand those code/ logic well.",
            "comment_workload": "No exam and only 3 assignments.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NPggeuwio8X6fd6BvQTGhRVMQdiie5wB",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Saik",
            "date": "May 07, 2020",
            "title": "Easy but need to be careful",
            "comment_content": "Covers basic concepts of python, such as playing with variable types: string, list , tuple, dictionary etc. Conditional statements, loops are also included. Basic pandas was also introduced, but is optional and wasn’t covered in exams. Pretty easy and friendly for people with no background in python like me.",
            "comment_teaching": "Professor Hong explained the concepts very clearly, each with examples and practice questions, which is quite good. TA Charles also did quite a good job in explaining, as well as answering questions.",
            "comment_grading": "Assignment 20%<br />Lab 15% (best 5 out of 6)<br />And maximum between<br />Midterm 25% Final 40%<br />And<br />Final 65%<br /><br />For me,<br />Lab 14.4/15<br />Assignment full<br />Midterm about 10% above mean<br />Final not released, but pretty sure should be either full or near full<br />A+ finally, and fortunately<br />Gave the grading a B since I’ve heard other who seemed to get ~96% overall but end up A-/A, which means it’s quite intolerant to error. Also pay attention to formats and zipping of lab and assignment files, or you may risk getting 0.",
            "comment_workload": "Pretty heavy given that it is only a one credit course. 2hrs of lecture + 2hrs of lab each week, although people usually take much shorter time to complete the labs, it still feels like you are taking half a 3 credit course (since it lasts only for half a semester), or even a bit more. U also have to spend quite an amount of time on the assignment (1 in total), which would take up 20% of total grade. Fortunately, not much extra time needed for revision as long as you understand the concepts, in my opinion.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "adTk5Tly0ejVmEJNyiCkR017Nq1op6Es",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "S.J",
            "date": "Jun 06, 2023",
            "title": "Shady grading",
            "comment_content": "Basic python<br />variables, for, while, if else, list all that basic stuff.",
            "comment_teaching": "Professor Hong is nice and patient. She explains concepts clearly though I think sometimes she cares A LOT about small details in coding that can be ignored.",
            "comment_grading": "A. Weekly Quiz 10%<br />B. Lab Submissions 10%<br />C. Individual Assignment 20%<br />D. Final Exam 60%<br />Weird grading.<br />Be sure to know every tiny detail because the professor will test it.<br />She likes to test some very unimportant and tiny details of Python coding in her final. As a student with coding background, I was taken aback by her exam questions (especially the MCQs because honestly no one codes like that)<br />Also, she will restrict you from using &quot;advanced&quot; method and you need to stick your code to what she taught in class. (no while(condition), no !=…)<br />The final was all hand written, even for the free-coding part. <br />Grades for the assignment and final were not released. No paper checking even though there were tons of hand-written coding parts. <br />Personally, I think it was very shady. (Got B+)",
            "comment_workload": "Ok workload. Need to watch videos and answer the quiz but it has unlimited attempts. For the lab, you can do a waiver every week and submit it before the lab session if you're an &quot;advanced student&quot;. (But you still have to go to the classroom to show it to the TA) <br />For the assignment, please listen to the lecture because the professor sometimes will state what answer she wants in class.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hfJ6NuNvWJr6tggcsznwnlg1S3kFcf4y",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1777,
                    "name": "TSE, Chris",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Human_01",
            "date": "Jun 05, 2023",
            "title": "",
            "comment_content": "The most fun and useful course---- an introduction to Python. <br /><br />We use cloud coding, so no need a good programming computer. But I do suggest you to bring your own laptop during the lecture to run and test the code. Or Prof would distribute paper to let you write the code if you need.<br /><br />Better study hard and be familiar to Python. It will be useful in your future ISOM course.",
            "comment_teaching": "Perfect Cantonese, Mandarin and English. <br />Super kind professor &lt;3<br />Good sense of humor.<br />Perfect design of lecture &amp; post-lecture material. She understand student's need very well, she knows we have no coding background so she would avoid using jargon, even if she need to introduce technical terms, she would explain it in a clear way using metaphor. <br />Super beginninger friendly.<br /><br /><br />TA super nice, detail-minded and fun too. He is a UST alumni and had experience teaching primary school. So he is very skilful in teaching. Can feel his passion toward teaching, good attitude.",
            "comment_grading": "Super good grading. <br />No group hw/project!!!!!!<br /><br />If you attend lesson and pay attention in class, you will get A, even you have no programming background (like me).",
            "comment_workload": "Prof said it is a 1 credit course if it is in a full semester but since we study it in half semester, it is normal to feel that it had heavy workload for a 1 credit course. But yeah, maybe because I enjoy the content and her teaching a lot, I think the workload is light.&nbsp;&nbsp;You only need to do some pre-lecture quiz and one individual assignment, that's all!&nbsp;&nbsp;And you can test the code in Colab before submission, so easy to get full mark.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cSD4Cp6CB6pQo9nOfS8IraGjfv9s9KnU",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cwr",
            "date": "Jun 02, 2023",
            "title": "Why did I get such a poor grade?",
            "comment_content": "You learn how to use python.<br />You will learn how to manipulate numbers, strings (text), lists etc.<br />Create for and while True loops etc.<br />Make conditional statements: if, else, elseif etc.<br /><br />Don't worry about buying a &quot;coding&quot; laptop. Google colab is completely free to use, and you can even do it on your ipad or phone.<br /><br />If you want to seize this opportunity to get your parents to buy you a new laptop, sure. Go ahead. But that makes you a horrible child.<br /><br />Oh, and you have to write code on paper for the final exam. Make sure you are used to that.",
            "comment_teaching": "I think the professor was quite good at explaining and teaching. Lab TA was also quite great.",
            "comment_grading": "I know people who have been coding since they were in junior high. They get a B.<br />I know people who knew shit nothing about coding, and think they are going to fail. They get an A.<br /><br />I got myself a B, but luckily it is only a 1 credit course.<br /><br />10% pre-lecture videos+quiz<br />10% lab tasks (or submit lab waivers)<br />20% individual assignment<br />60% finals<br /><br />Also people have emailed the TA about the release of results.<br />So far, sprin semester is basically over and they won't let you know you actual score for the assignment or finals.<br />Apparently, they also check your handwritten code by &quot;running it in their minds&quot; instead of putting it into colab. I would say this is the shadiest part of the course if true.",
            "comment_workload": "Like many have said, it seems like way too much work for a 1-credit course.<br />You have to attend a Lab session every week, but you can do a &quot;waiver&quot; if you are an &quot;advanced student&quot;.<br />However, apparently, even if you submit the waiver, you STILL HAVE TO COME to the lab to show the TA that you have done the waiver.<br />That completely defeats the purpose of having a waiver?<br /><br />The individual assignment is worth 20%, and it shouldn't take much time to complete it.<br /><br />Before each lecture, you also have to watch three or four 5-minute videos, and answer some MCQs (unlimited attempts).",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4auySDLxb0z8Y5XUd5T0jqkdSYHADo7g",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "WONG Yat Kit",
            "date": "May 30, 2023",
            "title": "",
            "comment_content": "Really basic python courses. If you don't have related standard, it is still easy to understand. To be honest, this course is relatively practial compared to other business courses.",
            "comment_teaching": "HONG, Weiyin is really good at teaching. She requires students watching next week's topic video in advance which can help students know better about what they will learn. She can speak English, Cantonese and Mandarin, so language will not be a hinder. She also has clear accent and good rhythm and thought which makes content much easier to understand.",
            "comment_grading": "A.Weekly Quiz 10%<br />B. Lab Submissions 10%<br />C. Individual Assignment 20%<br />D. Final Exam 60%<br />A, B and C are easy. Just follow professor's indication and finish them. Final exam is a little bit more difficult than other three because it requires candidates to write code with their own hands and pens. However, if you work hard on lecture and lab, it will be easy.<br />The reason causes the grading not good is that the score gap between different students are small. If you lose one more question, you will also have one lower sub-grade.<br />Remember to be carefully on final exam. I finally got an A on this course and I feel satisfied about it.",
            "comment_workload": "Mainly focus on the lab and video assignment. It is obvious that a 1-credit course will not contain a lot of homework.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5zvgu1sECEgr3ytjyHBslP9YD0hHfkRb",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 366,
                    "name": "CLARK, Theodore Henry King",
                    "rating": 1
                },
                {
                    "id": 1602,
                    "name": "LEE, Aaron Chun Hay",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "denise_guzman",
            "date": "Dec 06, 2022",
            "title": "",
            "comment_content": "Content is very clear in general, it starts to get confusing around the third and fourth week of the course if you don't have any previous knowledge about the programming language but nothing that's impossible to understand.",
            "comment_teaching": "The professor is very chill when teaching but will likely ask you to answer questions in class, so be present and don't get distracted.",
            "comment_grading": "The labs and assignment are easy enough to get the full grade, just work some days in advance in case you need to ask the TA about something you didn't catch in class.",
            "comment_workload": "Acceptable. It's a short course so you'll have assignments due each week, which is normal. Again, if you do the quizzes and assignments ahead of time you won't have any trouble.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IK5kmJKRrV8sPkdRX9UYj1IXJqfWLMkC",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 366,
                    "name": "CLARK, Theodore Henry King",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "moseswk",
            "date": "Nov 05, 2022",
            "title": "Be careful if you aim high",
            "comment_content": "-string, integer, float, boolean, list<br />-simple functions, methods, operations<br />-if, elif, else<br />-for loop<br />-while loop<br /><br />Very basic Python stuff. <br />If you have any type of programming background, this course would be extremely simple (and possibly boring) for you.<br />You can still easily learn from zero with sufficient practice as there's more than enough time in this course of 1.5 months.",
            "comment_teaching": "Prof. Clark explicitly said that you could skip the lectures and/or labs if you can handle the content by yourself. <br /><br />Lectures<br />I only attended the first lecture and skipped the others. <br />Prof. Clark explained the material in a very detailed way, so you should be able to understand them if you pay attention in class, but it could be kinda boring cuz the pace is really slow. You may consider learning by YouTube if it's more interesting (and efficient) for you.<br />He also tried to make the lesson more interactive by asking questions for students to answer (especially those sitting in the back), but it didn't quite work for most of us (me included).<br /><br />Labs<br />The lab is for the TAs to help you in case you got any problems with the lab activities. I'm not sure about the arrangement as I never attended any labs, and I don't even know who's the TAs. You could absolutely skip the labs if you can finish the lab activities by yourself, and there's nothing extra to be taught in the lab (from what I was told).",
            "comment_grading": "4 Weekly Quizzes&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20% (5% each)<br />4 Lab Activities&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20% (5% each)<br />Individual Assignment&nbsp;&nbsp;&nbsp;10% (up to 5% bonus on top)<br />Final Exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;50%<br /><br />Weekly Quizzes<br />15 MCs each to check your concepts. Be careful and check your answers before submitting as the scores aren't released until after the deadline, and most people get full marks.<br /><br />Lab Activities<br />Write a few lines of code to fulfil the task requirements. They are formatted to guide you to completion, so most people also get full marks.<br /><br />Individual Assignment<br />It's like a longer version of the lab activities, with several tasks for you to solve. They give you 2 weeks complete it, and I took ~5 hrs to finish (including lots of checking and refining) and submitted it on day 3. You may want to spread the workload into several days if that's less exhausting for you. <br />I was never told how the bonus is given, but I guess coding with efficiency and creativity is key.<br /><br />Final Exam<br />90 mins to finish 30 MCs, 3 SQs, 2 LQs.<br />A cheat sheet including almost everything taught in the course is provided, so you only have to understand how it works but not memorize things (which is great for me).<br />MCs are similar to but somewhat harder than the weekly quizzes.<br />SQs require you to fill in the blanks in some given codes or ask you about the outputs of the code, basically testing whether you can understand the codes given.<br />LQs ask you to write code for the tasks. I finished with 15-20 lines of code, so it's not very long, but I suggest checking your own codes several times (if you have time) to search for bugs as it's a PAPER EXAM and you can't rely on the computers.<br />The paper is longer than I expected. There's sufficient time to finish it for sure, but you can't spend too much time thinking. I actually made quite some mistakes initially, so checking really helps. If you want to spare more time for checking your answers, try responding to the questions instinctively, so practice beforehand is crucial (although I didn't do much). Also, this term is a F2F exam, so the format is likely different from those conducted online during covid.<br /><br />My scores :<br />Weekly Quizzes&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20/20<br />Lab Activities&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20/20<br />Individual Assignment&nbsp;&nbsp;&nbsp;&nbsp;9.6/10<br />Final Exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;45/50<br /><br />Grade : A+<br /><br />They didn't release the scores and statistics of the individual assignment and final exam on Canvas, but they'll let you know your own scores if you ask them via email.<br />I can't really tell how the grading is without the overall statistics, but I guess it's not too bad given that only 90% in the Final Exam (or Overall 94.6%) gets me an A+. The grades are likely proportional to your carefulness and prior experience in programming.",
            "comment_workload": "For me, it takes roughly 1 hour per week finishing the quizzes and lab activities, and I didn't attend the lectures or labs. I'd say the workload is light to medium, but it's possibly higher if you have no programming background (or have bad logic).<br /><br />Btw people here are complaining it's huge workload for a 1-credit course, but I think you should really consider it as 2-credit workload cuz it spans only half-term. (1 cred / 0.5 term = 2 cred/term)",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Bm96i8GxA1vg3dOJWAHkTtfAGWnNou8A",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 366,
                    "name": "CLARK, Theodore Henry King",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Smurfing in UST",
            "date": "Nov 02, 2022",
            "title": "Basic Python",
            "comment_content": "Introductory Python Programming.<br />It is just a 1-credit course so there is not any in-depth concept/ application of Python but just its basics.<br /><br />1. string/integer/float/boolean<br />2. list<br />3. if...else statement<br />4. for loop<br />5. while loop<br /><br />The content is not hard at all. But requires practice if you have no programming background.",
            "comment_teaching": "I can't comment on this part as I only go to the first lecture and none of the labs. I don't even know which TA reaches my lab section. <br /><br />About the professor:<br />His voice is quite sleepy... that's why I skipped all lectures and watched YouTube videos to learn Python instead.<br /><br />https://www.youtube.com/watch?v=kqtD5dpn9C8<br /><br />I learn Python from this video. I think it is quite understandable and useful for beginners. I suggest you to practise after learning each part if you want to get a good grade.",
            "comment_grading": "Grading is not clear as the score of assignment and exam are not disclosed.<br /><br />Canvas quizzes ---------------- 15%<br />Lab activities --------------------15%<br />Individual assignment ---------- 20%<br />Final exam (midterm period) --- 50 %<br /><br />My grade: A<br />Everyone gets full in quizzes and lab activities. So the assignment and exam are determinative. I can say both are hard for beginners... But it means if you study hard enough, you can outperform the mass.",
            "comment_workload": "Quite heavy for a 1-credit course. If you are learning from 0 to 1, you have to treat it as a 3-credit course. But I will say it worths, as the coming course -- ISOM2600 also teaches Python, and you may use Python very often if you want to work in the field of data analytics.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tnEgopaXuBnF4cWYnAOsdPlfw7DvaCvW",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Voguez",
            "date": "Sep 04, 2022",
            "title": "",
            "comment_content": "An introduction to python. Not very difficult. Interesting if you have never learned python before. Boring if you have got some coding background. Coding skills outside the class content are not allowed to be used in the exam but a cheat sheet covering all the codings learned in the lesson will be given.",
            "comment_teaching": "The instructor is really nice. Prepare a lot of videos for students",
            "comment_grading": "No idea how grades are given. But mine is not satisfactory even though I followed strictly in lessons and after lessons.",
            "comment_workload": "The workload is quite high for a 1-credit course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oZYB5FDEPzZtbgUdxdY6z7Hnxajg3gb7",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 949,
                    "name": "LAI, Sum Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Carlota",
            "date": "Aug 03, 2022",
            "title": "Coding for Business",
            "comment_content": "The class teaches basic python programming knowledge including data types (string, float, list, etc), conditions (if, else), loops (while), etc.",
            "comment_teaching": "Professor HONG is patient and explain things slowly and clearly. She has clear pronunciation and almost no accent. You are free to ask her questions after lectures.",
            "comment_grading": "5% Pre class videos together with weekly quizes (=Regular homework, unlimited attemps=&gt;full score)<br />10% Lab submissions : my lab instructor is Samuel and in his lab, lab submissions are like attendance. (Only need to send required words/ numbers to the submission box =&gt;full score if you miss less than one lab)<br />20% Individual assignment: one big assignment (not that big), you can refer to lab and lecture PPT for reference. Run the program to debug (Be careful on details!!!) Score not released at last.<br />65% Final exam: The main factor that determines your grade. Time is enough but not so loose. Strongly advise to do all final exam practice provided several times!!! and slightly change the conditions/requirements of those practice questions and solve the new problem created by yourself. You may encounter similar questions in the final exam. Be careful on details and be circumspective. Final exam score not released.<br /><br />Finally got an A+, but I prefer to rate the GRADING of this course B because it may be kind of chur. You have to look at details and be very careful.",
            "comment_workload": "Except the individual assignment and final exam, you can get full score in all the other tasks easily. So there is very light workload at ordinary times and kind of heavy workload when you do individual assignment and prepare for final exam (both around the midterm period). <br />Anyway, be careful on details and enjoy the interesting content, ask questions whenever necessary. Have fun!!!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bMEoFc6QQUbFNsA4dCWsii2gdYoLP2QO",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KUSTS",
            "date": "Apr 20, 2022",
            "title": "",
            "comment_content": "python basics, variables, list, conditional statement, for loop, while loop<br />quite easy even though I have no coding background",
            "comment_teaching": "Prof Hong has good teaching, explains things very well, her English is good",
            "comment_grading": "weekly quiz: 5%<br />individual asm: 20%<br />lab: 10%<br />final: 65%<br />grading is fair<br />lab and quiz are full mark, no idea about the mark of individual asm and final, got A",
            "comment_workload": "Too much for 1 cred course<br />Need to watch videos and complete quiz every week on top of lecture and lab sessions<br />Lab is quite 'hea', basically TA gives you the full credit if you have submiited it",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wTsZjN3ekeWbckuwxYIPa9tMrQQcSVXE",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 366,
                    "name": "CLARK, Theodore Henry King",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "_JJ",
            "date": "Jan 26, 2022",
            "title": "",
            "comment_content": "好基本嘅python<br /><br />20% weekly Lab Activity<br />30% Quiz x 4 (15 MC questions)<br />10% Individual project<br />40% Final Exam (MC and Short Questions)<br /><br />variable<br />List<br />if statement<br />for loop<br />basic python build-in function: print, input, append...",
            "comment_teaching": "教得都算清晰<br />嘗試同學生互動<br />會上堂問問題<br /><br />有zoom recording<br />所以其實唔上都得<br /><br /><br />冇上過TA堂<br />佢淨係解答你的問題<br />識就唔使去",
            "comment_grading": "內容好簡單<br />所以每個人都好高分，要小心唔好犯錯<br />一犯錯可能就冇咗一個grade <br /><br />但係只要小心啲其實 MC quiz同Lab Activity 唔難，基本上都要滿分<br /><br />而Individual Project 要啲時間做<br />但都唔算難<br /><br />真正決勝負就係 final<br />鬥小心<br /><br />就可以高grade",
            "comment_workload": "以1個Credit嚟講都算多<br />每個禮拜都要交一份MC Quiz 同埋一份 Lab Activity <br />跟住好快就 final",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yDsNOp0bqoOrhvDxUZMJAeyJjZd2CIiY",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 366,
                    "name": "CLARK, Theodore Henry King",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fw.01",
            "date": "Jan 24, 2022",
            "title": "",
            "comment_content": "Week 1: Print(), variable, data type, function: input(), int(), float(), str()<br />Week 2: List: index &amp; slicing, append(), pop(), len(), max(), min(), sum()<br />Week 3: if...elif...else, boolean operations (and/or/not)<br />Week 4: for...in..., range(), break<br />Week 5: Practice Questions Explanations, Individual Project<br />Week 6: Exam<br />Week 7: Introduction to Pandas (Preparation for ISOM2600)<br /><br />It is not difficult to understand the python concepts because the content is not much.",
            "comment_teaching": "clear explanation;<br />quite fun;<br />like to ask students question",
            "comment_grading": "Four Weekly quiz: 30%<br />Four Lab activities: 20%<br />Final Exam: 40%<br />Individual Project: 10% (plus up to 5% bonus)<br /><br />The final grade is fair.",
            "comment_workload": "huge for 1 credit course<br /><br />Weekly quiz: unlimited submission<br /><br />Lab activities: quite easy; lab session is not mandatory; need to submit a .ipynb file<br /><br />Final Exam: Be careful that it is a paper-writing exam, so you have to write the code carefully<br /><br />Individual Project: need to spend some time on it; could ask for TA help in the lab session",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gxQkOEEt3F1A7AbqYOERQHE411AdZkfC",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 366,
                    "name": "CLARK, Theodore Henry King",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cai仔",
            "date": "Dec 16, 2021",
            "title": "",
            "comment_content": "just as the same with other semesters",
            "comment_teaching": "I think he just read the slides and run the coding. I studied by myself.&nbsp;&nbsp;and I think teaching did not help a lot",
            "comment_grading": "not clear because they did not publish the final and project scores. <br /><br />grade: A",
            "comment_workload": "very huge, need to understand how to code and the final is paper-writing. so cannot make any mistakes about the coding and should remember the trivial rules.<br /><br />there are four quizzes, however, you could always submit the quiz&nbsp;&nbsp;before the deadline and check answers with classmates.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wdXVmQARQbgwQZ9x9hVerjo9xp4bRotE",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "thai",
            "date": "Feb 01, 2021",
            "title": "love this course",
            "comment_content": "cover very basic concept of python<br />should be very easy for everyone to understand the content",
            "comment_teaching": "she is good<br />nice, helpful, willing to answer questions",
            "comment_grading": "good grading for those who know how to do <br />all depends on your coding, no other factors affect your grade.<br /><br />mid-term &amp; exam: nothing tricky, easy (high mean)",
            "comment_workload": "too much for 1 credit course<br /><br />very easy to get an answer from others and hard to check plagiarism. <br /><br />However, I think it's better do it yourself because&nbsp;&nbsp;I think if you do more, then you can get a better grade, catch up more easily, spend very little time for preparing the exam or mid term.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CrfNOHo3CyAfrn65WRMGmDVgyAt3aUk0",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "thisisit",
            "date": "Jan 19, 2021",
            "title": "",
            "comment_content": "Just super basic coding. Nothing special. But the question is not as easy as you think. Be more careful.",
            "comment_teaching": "Professor Hong is quite good and the lesson is not boring in fact. However, I believe the duration is too long which does not like a 1-credit course.",
            "comment_grading": "As the course is not difficult, many of us will get a very high marks. So try your best not to make some silly and careless mistakes. And do well in assignments.",
            "comment_workload": "2 exams and multiple assignments. How can you believe it's a course with 1 credit only?",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MOw3XDmP9ElelV5X42lWM6qzbc8kjNA6",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Morty Smith",
            "date": "Jan 06, 2021",
            "title": "",
            "comment_content": "Basic concepts of Python for beginners such as data type, list, dictionary, for/while loop, etc. There is also an introduction to Pandas at the end of the course. However, it is optional and thus will not be tested.",
            "comment_teaching": "Professor Hong is nice and friendly. Her teaching is very clear. She usually gives some optional practice for students to do after class and she will explain the answer at the beginning of the next class. However, she speaks quite slow and you may feel a bit bored.",
            "comment_grading": "Class participation (lecture &amp; lab): 20%<br />Assignment 1: 15%<br />Assignment 2: 25% <br />Project: 40%<br /><br />All assignments and project are individual work. They are not difficult to do but it takes time to think. For the project, it requires you to come up with some additional functions in order to get higher marks. Otherwise, you will just get a pass for the project even if you satisfy the basic requirement.",
            "comment_workload": "Considering that this is a 1 credit course, I think the workload is quite heavy, especially for the project as it takes some time to build from scratch for a beginner. Yet, they cancelled the midterm and final exam this year so it is much better than last year.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BLiqMRAnLLaIiMD6OLvgExWkT4SCSeSO",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 373,
                    "name": "JIA, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kikudp",
            "date": "Oct 25, 2020",
            "title": "introductory python",
            "comment_content": "Just a basic introduction to python programming.<br />Topics:<br />1. Print, Variable, Data Type, Conversion<br />2. input(), if/else statement<br />3. data structures (list, dictionary, tuple)<br />4. for loop<br />5. while loop<br />6. pandas (not tested)",
            "comment_teaching": "The professor talks really slow, so taking this course live might be very boring. When I listened to the recording at 2.0x speed, it was much better. In terms of the content of teaching, the Jupyter notes used during classes and labs are quite useful. Always check your work with answers provided to make sure you grasp all the contents.",
            "comment_grading": "A. Class Participation (20%)<br />B. Assignment (40%)<br />There are TWO individual assignments, both of which are very basic, conceptual. <br />C. Individual Project (40%)<br />We were given a choice of three prompts. We had to choose one. It doesn't take that long to finish this project.<br /><br />The grade for the individual project made no sense. It's so arbitrary. There was no explanation as to how we lost marks. Absolutely horrible grading system.",
            "comment_workload": "After this class got lots of criticism last semester, they changed the entire syllabus so that we don't have to spend that much time in this course. After all, it is just a 1 credit course. Basically, you need to attend a lecture and a lab every week. There's no homework, but I spent around 2 hours each week to revise some of the concepts learned during class.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yHsCEIaxXJaZdqh5xVIr4Tpe1phCx8vx",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Natnat120201",
            "date": "Sep 08, 2020",
            "title": "",
            "comment_content": "Week 1: <br />Introduction to Syllabus <br />Introduction to Python <br />Python Basics 1<br /><br />Week 2:<br />Python Basics 2 <br />String<br /><br />Week 3:<br />List, Tuple, and Set<br /><br />Week 4:<br />Dictionary<br />Conditional Flow Statements<br /><br />Week5:<br />Loops Statements<br /><br />Week 6:<br />Pandas",
            "comment_teaching": "She teaches in a way which it's easy for us to understand. There are exercises for us after she teaches every concept, it makes the whole thing more understandable.",
            "comment_grading": "The contents are easy to understand so many people managed to get high scores. I got above 90 in the assignment and above 90 in the midterm exam. But I still got a B for this course only.",
            "comment_workload": "You have to finish the classwork for every lab session and you have to spend 4 hours per week in total for this course.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "abAUToEdMuM4CJy9kK1R4dpeMadNxvr3",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fks",
            "date": "Sep 07, 2020",
            "title": "",
            "comment_content": "Basic python, easy if you have some basic knowledge.<br />the content in first few weeks are very easy, everyone could understand it. <br />I am not interest in it, but it is quite useful.",
            "comment_teaching": "OK.<br />both professor and tutor were very patient. Answer all the questions in details.<br />tutorial over run for most of the time, but you can leave freely, cause it is just for students to ask questions.<br />They can explain the content clearly.",
            "comment_grading": "Not good for me. <br />but it is fair.",
            "comment_workload": "too many for 1 credit course.<br />6 exercises<br />1 individual assignment<br />mid-term<br />exam",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6KzJQR7FDUL3xRpxn31YigH95K9NE2SE",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Vivianna",
            "date": "Sep 03, 2020",
            "title": "OK La....",
            "comment_content": "Professor said the course covered about 30% of Python coding. <br />First of all, it is quite difficult to learn coding in online mode. You may be lost if you cannot follow the lesson. Try your best to understand and try to speed up in the lesson. <br />Besides, content in previous lessons are related to next lesson. SO, remember to have some revision before the lesson otherwise you may be lost. <br />Also, the content is the basic part of python coding. Don't expect too much. You will still be curious and mindfxxked about the coding in ISOM 2600, which is the course you will have after studying ISOM2020.",
            "comment_teaching": "Anyway, Teaching is so good. Professor and TA tried their best to explain and answer our questions. Although it was quite hard for online teaching, 3 TAs were stood by for answering your question or solving your problem in breakout room.",
            "comment_grading": "My grade: B<br /><br />Lab 1: 3/3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mean: 2.7/3<br />Lab 2: 2.5/3&nbsp;&nbsp;&nbsp;&nbsp;mean: 2.5/3<br />Lab 3: 1.9/3&nbsp;&nbsp;&nbsp;&nbsp;mean: 2.1/3<br />Lab 4: 1.5/3&nbsp;&nbsp;&nbsp;&nbsp;mean: 2.4/3<br />Lab 5: 2.25/3&nbsp;&nbsp;mean: 2.3/3<br />Lab 6: 2.5/3&nbsp;&nbsp;&nbsp;&nbsp;mean: 2.6/3<br />Assignment1: 70/100&nbsp;&nbsp;&nbsp;mean: 81.4/100 <br />Midterm: 46.5/50 mean: 39.7/50<br />Don't know final result...<br />BE CAREFUL for every codes as it may causes error...",
            "comment_workload": "It is a one credit course, which will finish in a half semester. However, there are assignment, midterm, final. Also, you need to attend Lecture and lab every week. I spent almost 5-6 hours a week to attend lessons, do assignments and revision. I cannot understand why this is a one credit course..... toooo much workload lahhhh!!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "s7OtJFnzlfXZI960nMfzaCViWlOahpge",
            "semester": "2019-20 Spring",
            "instructors": [],
            "is_author": false,
            "author": "kaaiheart",
            "date": "Sep 02, 2020",
            "title": "",
            "comment_content": "Basic coding skills. I think it is quite interesting to some extent. Not difficult if you practice enough.",
            "comment_teaching": "Both professor and TA Charles are very patient and nice. They will answer any question you ask. Actually this course was taken online, which makes teaching more clear to some extent.",
            "comment_grading": "Grading is quite fair. Even though I got below mean in midterm, I still got B range.<br />Participation does not count but I still adice you not to skip lectures or tutorials.",
            "comment_workload": "Workload is acceptable. We have assignments per week, which is closely related to tutorial. And I strongly recommend every one don't miss tutorial cuz it helps a lot.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "h5uKZ0Er3WAx7mNy8O3QOhGdMFlgzUQB",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Maffen",
            "date": "Sep 01, 2020",
            "title": "",
            "comment_content": "Introduction to Python. I enjoyed the contents but not the assessments and workload. The contents are easy to comprehend even I did not have any coding background.",
            "comment_teaching": "The teaching is clear and simple, you can understand the contents pretty easily. But stuff got pretty challenging in tutorials.",
            "comment_grading": "I think its fairly good, the exam was not as challenging as I thought it would be.",
            "comment_workload": "For a 1 credit course, you would expect less. But a few weeks of tutorial work used up more than 3 hours for me to finish. I had to even ask around for answers because people tend to get full marks on them.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "02yH1ne9PaaDFGr9xVQ38UIPnsfax7eN",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sleepy",
            "date": "Sep 01, 2020",
            "title": "",
            "comment_content": "Very basic content on Python, trying to teach you from beginners up to for loops within 6 lectures.<br /><br />The content itself is not too heavy nor very hard, and if you followed well the lectures and labs, and also the assignments, it should not be very hard to understand even you have no background with coding.<br /><br />The only problem is that is it necessary to make it into a half-semester course and jumping into a whole new world of isom 2600 python directly after this introductory course. It is very hard to grasp isom2600 afterwards as isom 2600 professors did not know what we know from python, making it hard for them to adjust their course materials according to our level.",
            "comment_teaching": "Professor Hong explains the concepts quite clearly and nicely, and the course notes are also quite well prepared, and easy to review after the lessons. There were also notes and reminders released before midterms and finals, which were really clear summaries.<br /><br />Would really like to appreciate the TA, Charles for his hard work this half-semester. He himself has to take care of all the tutorials, checking with all the assignments and exercises and also replying to our emails (and also with his own other TA or coursework). Despite that, his replies come in quite fast and his explanations in tutorials were also really clear and understandable. He also had times for us to ask questions and confirm whether we understand them or not. He invited me into a zoom meeting to help solve some technical issues within 1 hour of my email sent, which is very very efficient. It is easy to reach out to him in general.",
            "comment_grading": "Have no comment on gradings.<br />You can never beat the people who learnt python way earlier than this course, and because the course content is easy, a lot of people can do well and therefore also causes the curve to be extremely high. <br />You may know what problems you might have and cause you to lose marks in assignments, but you never know what is wrong in your midterm, not even mentioning your final exams. <br />Got an average of 2.5x/3 in the 6 lab exercises and 41.5/50 in midterm (median was around 37/50). Got an 82.5/100 for the big assignment (penalty because I submitted it late, but still over median)&nbsp;&nbsp;Don't know what I got in finals and at the end got a B. I probably screwed up the finals even I was quite confident with most of my answers. You probably have to be very careful with all your answers.<br /><br />As this is their first time offering the course and they are doing it online, they have set the exams to be open-book and you can open your python notebook to test your codes before you submit your answers. Don't know will they still keep this practice even when classes return to normal.",
            "comment_workload": "Very big workload for a 1 credit course.<br /><br />You have to attend a 2 hour lecture, a 1.5 hour tutorial and finish a 3-4 question (with sub qs) lab exercise every week for a total of 6 weeks. The content is sometimes harder and you might need some more time to understand and learn, but after the tutorial, you only have 24 hours more to complete the assignment. It is quite a demanding requirement.<br /><br />Also, as the lab exercise deadline is set according to the tutorial time, the ones further towards the end of the week might be able to copy answers from the previous sessions, also making it unfair for the ones submitting the exercises first.<br /><br />There is another BIG assignment towards the end of the course and just be careful not to miss the deadline as it is set in the noon. It has 11 compulsory questions and a few optional questions, and it will take you very long to finish them. I wish the profs could also release the answer key to us earlier for revision (as the timeline is really tight for this half-sem course)<br /><br />With midterm and finals and all the assignments and workload, this course does not deserve 1 credit only.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ptg2cNfvGwHcnU87ayR0mnsK0nRrE18J",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jared",
            "date": "Aug 30, 2020",
            "title": "",
            "comment_content": "Python beginner course. The content of this course is quite easy and understandable as it only covers the fundamentals of Python. Some time may be needed to pick up Python at the beginning for those who have no programming background.<br /><br />-Python Basics<br />-Python Basics2<br />-String<br />-List, Tuple, and Set<br />-Dictionary<br />-Conditional Flow Statements<br />-Loops Statements<br />-Pandas (not included in exam)",
            "comment_teaching": "Both Professor Hong and TA Charles are very nice and helpful! They are patient in answering questions in lectures and labs. You may even make an individual zoom appointment with them for further discussion if you want.",
            "comment_grading": "Lab Exercise (best 5 out of 6) 15%<br />Assignment 20%<br />Mid-term Quiz 25%<br />Final Exam 40%<br /><br />Score1 = 40%(Final exam score) +25%(midterm score)+20%(Assignment score)+15%(lab score)<br /><br />Score2 = 65%(Final exam score) +20%(Assignment score)+15%(lab score)<br /><br />Final course score = Max (Score1, Score2)<br /><br />The grade is fair but the mean is relatively high (~80%)<br />lab: 14.75/15<br />assignment: 87.5/100<br />midterm: 46.5/50<br />final: not released<br />grade: A",
            "comment_workload": "The workload is heavy for a 1 credit and half-semester course.<br />6 lab exercises (one per week) and 1 assignment (~15 questions).<br />1 lab exercise requires about 2 hrs to finish, including fixing errors and double-checking.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "skxsDHDcSi7iNOr1zFNxmYuq8bYpFlR0",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Iamkmon",
            "date": "Aug 30, 2020",
            "title": "Competitive course",
            "comment_content": "Not much coding knowledge is acquired, maybe due to its 6-week nature and 1 credit course.<br /><br />Week 1: Introduction to Syllabus, Introduction to Python, Python Basics 1<br />Week 2: Python Basics 2, String<br />Week 3: List, Tuple, and Set<br />Week 4: Dictionary, Conditional Flow Statements <br />Week 5: Loops Statements <br />Week 6: Pandas",
            "comment_teaching": "I skipped lectures and some of the labs, so I can't say much about the professor... but the TA Charles is nice. You could request a breakout room in lab session, and he is willing to explain the concepts clearly. He is very helpful!!! As long as you have submitted the labs on time, you'll be fine. No attendance is taken.",
            "comment_grading": "As there are some technical difficulties in the midterm, two marking schemes are allowed. I have screwed up my midterm, so it is lucky for me to omit the score of the midterm. <br /><br />Option 1: 40%(Final exam score) +25%(midterm score)+20%(Assignment score)+15%(lab score)<br /><br />Option 2: 65%(Final exam score) +20%(Assignment score)+15%(lab score)<br /><br />Final course score: Higher score of 2 options<br /><br />Labs: got 2.5/3 in one lab, 3/3 for others<br />Assignment: 100/100<br />Midterm: 38/50 (mean: 39.7/50)<br />Final: 95/100<br /><br />Final grade: A<br /><br />The competition is really intense... so every component counts. Try your best in doing the assignment, It does take time but it is important!",
            "comment_workload": "A super time-consuming assignment during the course. I have spent 6-7 hours cross-checking the answers with my friends given that I have no coding background in python before. 6 labs, 1 per week, and the workload for labs are fair. 1 Mid-term and 1 final. Every time when I remind myself that this is a 1-cred course, I realize this is life in UST :(",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Gk99HgRPEobpQ8JgB2ZjJF8CUK9qbaPR",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                },
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "van^^",
            "date": "Aug 29, 2020",
            "title": "",
            "comment_content": "Python for beginner<br />-Basic<br />-String<br />-List, Tuple, Set<br />-Dictionary<br />-Conditional<br />-Loop",
            "comment_teaching": "Teaching coding online is very troublesome because I cannot type the code and look at what code the instructor is typing at the same time.&nbsp;&nbsp;I need to use an iPad to join zoom and MacBook to type the code.<br />The professor and TA are nice.",
            "comment_grading": "The grading is quite good for me.&nbsp;&nbsp;However, most people did quite well so you may need to score full marks to get an A.",
            "comment_workload": "This shouldn't have been a 1 cred course.&nbsp;&nbsp;The workload is similar to a 3 cred course.&nbsp;&nbsp;The workload is quite heavy for me (well but not as heavy as ISOM 2600).",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2XiYchvL627AnY19p1UnUQJOLuAIdeXz",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sum_",
            "date": "Aug 29, 2020",
            "title": "",
            "comment_content": "Very basic Python stuff.<br />Lecture 1 - Introduction to Python / Python Basics 1<br />Lecture 2 - Python Basics 2 / String<br />Lecture 3 - List, Tuple, and Set<br />Lecture 4 - Dictionary / Conditional Flow Statements<br />Lecture 5 - Loops Statements<br />Lecture 6 - Pandas",
            "comment_teaching": "I love professor Hong's English and voice. She's really nice and patient and can explain concepts very clearly. TA Charles is helpful and willing to answer questions as well.",
            "comment_grading": "Lab Exercise (best 5 out of 6)15%<br />Assignment 20%<br />Mid-term Quiz 25%<br />Final Exam 40%<br /><br />Score1 = 40%(Final exam score) +25%(midterm score)+20%(Assignment score)+15%(lab score)<br /><br />Score2 = 65%(Final exam score) +20%(Assignment score)+15%(lab score)<br /><br />Final course score = Max (Score1, Score2)<br /><br />Cut off is very high since the content is rather easy, mean is usually around 90% and UQ is 100%. Have to be very extremely careful when doing the work if you aim high. <br />Used score 1 as my final score, got 90.9 and ended up with a B+.",
            "comment_workload": "6 lab exercise (1 per week) plus 1 assignment.<br />The workload is rather heavy for a 1-cred course. <br />I usually spend the whole lab session to complete the lab exercise, ie 2 hrs. And I spent around 5 hours on the assignment cuz it was a pretty long one (though some are optional).",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zq2K7MwUvw7l5mc0yuJccOltleKNJL4c",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                },
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "haileyc",
            "date": "Jun 18, 2020",
            "title": "heavy workload for 1 cred course",
            "comment_content": "Introduction to Python<br />Python Basics<br />Python Basics2<br />String<br />List, Tuple, and Set<br />Dictionary<br />Conditional Flow Statements<br />Loops Statements<br />Pandas",
            "comment_teaching": "professor hong explained the concepts very clearly, not difficult to understand the concepts if you attend the lectures. Good course for beginners. she is willing to answer your questions as well<br /><br />TAs did a great job in answering questions and explaining",
            "comment_grading": "Lab Exercise (best 5 out of 6) 15%<br />Assignment 20%<br />Mid-term Quiz 25%<br />Final Exam 40%",
            "comment_workload": "heavy as you have to complete it within 6 weeks <br /><br />6 lab exercise (best 5 out of 6): 1 per week <br />1 assignment (around 15 questions)<br />1 midterm and final",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "L95g2IZB7TasRUAsgMPsP2r7KGa6W0tp",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yan_",
            "date": "Jun 13, 2020",
            "title": "Good instructor and TA but heavy workload",
            "comment_content": "Basic concepts for coding using python. It is quite easy for students with no background in python (like me!) to follow if you pay attention in class and complete every exercise with full understanding. <br /><br />Here are the topics:<br />Introduction to Python<br />Python Basics<br />Python Basics2<br />String<br />List, Tuple, and Set<br />Dictionary<br />Conditional Flow Statements<br />Loops Statements<br />Pandas",
            "comment_teaching": "Both Professor Hong and TA Charles are really nice. The concepts are well explained. They are very willing to answer all your questions. They are soooooo nice!",
            "comment_grading": "Lab Exercise (best 5 out of 6) 15%<br />Assignment 20%<br />Mid-term Quiz 25%<br />Final Exam 40%<br /><br />Originally, there should be only one scheme (mentioned above) but now there are two for this semester as some students have encountered technical difficulties during the mid-term exam.<br /><br />Score1 = 40%(Final exam score) +25%(midterm score)+20%(Assignment score)+15%(lab score)<br />Score2 = 65%(Final exam score) +20%(Assignment score)+15%(lab score)<br />Final course score = Max (Score1, Score2)<br /><br />For me,<br />Lab Exercise: 15/15<br />Assignment: 95/100<br />Mid-term Quiz: 47.5/50 (with mean=39.1)<br />Final Exam: the score is not released but mine should be higher than 90%<br /><br />I got A+ at last",
            "comment_workload": "There are a total of 6 lab exercises and 1 assignment, which means one exercise has to be submitted per week. I think the workload is quite heavy for a one credit course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EduyBt1ZrQrErEtL9VnnPugqnqNMy4Vi",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Soberzz",
            "date": "Jun 10, 2020",
            "title": "Terrible",
            "comment_content": "Python stuffs. You better be more concentrated in class if you have no idea of codings.",
            "comment_teaching": "Professor was willing to answer your questions clearly. Very detailed explanation will be provided, but it will only benefit you if you know codings well.",
            "comment_grading": "Quite fair<br />All my lab exercises, midterm, assignment 1, and final are all below mean, quite a lot.<br />Final Grade: C-<br />To be honest, I actually got the preferred answers or outcomes in lab exercises and the assignment, I don’t know why I lost so many marks. Not transparent enough. Final score was not released also.<br />Disastrous course if you don’t know coding.<br />Luckily it was just a 1-credit course.",
            "comment_workload": "For a 1-credit course, very very heavy workload. Weekly lab exercises for codings. And you have to attend lecture and tutorial (totalling 220 minutes) every week or else you will lose your way. One midterm and final as well, all about codings again. As well as the assignment, around 15 codings questions. And within 6 weeks of time you have to finish all these. It‘s just terrible.",
            "rating_content": 1,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ee1HdWBR9CJJ3dlxzSHq40uMiVpaTs7A",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ypoons9",
            "date": "Jun 10, 2020",
            "title": "",
            "comment_content": "Introduction to Syllabus <br />Introduction to Python <br />Python Basics 1<br />Python Basics 2<br />String<br />List, Tuple, and Set<br />Dictionary<br />Conditional Flow Statements<br />Loops Statements<br />Pandas<br /><br />This is an introduction course of Python, leaning some basic functions so the content is not so difficult.",
            "comment_teaching": "Prof Hong is nice. She understands that most of us are just beginners so she always ask us whether we can comprehend the content and sometimes she makes polling in class to test our understanding. She is also open to students' comments. She adjusted the teaching pace and the length of the break after collecting our comments. <br /><br />The TA Charles is patient and kind. His workload is very heavy, teaching all eight lab sessions, helping students and&nbsp;&nbsp;grading the assignments. Some students bothered him a lot lol, they kept asking questions and emailing Charles. Charles is quite stressed but he is always willing to help.",
            "comment_grading": "Lab Exercise (best 5 out of 6) 15% <br />Assignment 20%<br />Mid-term Quiz 25%<br />Final Exam 40%<br /><br />Score1 = 40%(Final exam score) +25%(midterm score)+20%(Assignment score)+15%(lab score)<br /><br />Score2 = 65%(Final exam score) +20%(Assignment score)+15%(lab score)<br /><br />Final course score = Max (Score1, Score2)<br /><br />I used Socre2 as my final exam score is much higher than the midterm score.<br /><br />Lab: 14.5/15<br />Assignment: 90/100<br />Final Exam: 99/100 (final exam score is not disclosed but I ask the TA Charles for the score)<br /><br />I got a A at last.",
            "comment_workload": "The workload is very heavy for a one credit course. I had to submit lab exercise every week and it took me two hours to finish each of them because I am not really good at coding and not sure about the answers.<br /><br />I spent much more time on this course than other three credit courses such as FINA2303...",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 3,
            "attachments": []
        },
        {
            "hash": "0hWVPKK8yIuvIaBUNtAxSxDvhCmSfnOQ",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wolfheart",
            "date": "May 16, 2020",
            "title": "Grading should be made absolute",
            "comment_content": "Feb 19 - April 4 (half a semester)<br />2 hour lecture and 2 hour lab once a week (optional attendance but how Lab Exercises are done is taught during labs and you can ask questions)<br /><br />Introductory Course to Python - see attachment for syllabus<br /><br />Midterm: Until Conditional Flow Statements (if-else-elif), <br />Finals: Midterm + Loops Statements (just &quot;for&quot;, not &quot;while&quot;)<br />Bonus: basic Pandas (Don't remember if this was supposed to be covered had it been during physical learning mode)<br /><br />Midterm and finals were supposed to be closed-book if physical learning mode, so it was open-book this semester (no *book*; just&nbsp;&nbsp;your labs, Assignment, and self-made notes).",
            "comment_teaching": "The professor, Weiyin Hong, is very kind and teaches in a very systematic, logical manner. She also has extensive background in Python and is approachable. For those without prior coding background, attending lectures on concepts you don't understand is great because she can also illustrate the concept.<br /><br />T.A. Charles, has a lot of work. He's bothered by everyone when something goes wrong in their Lab Exercises or its grading (you should bother him as well, Charles re-graded when I screen-captured code and explained my logic in one of the labs). I think he also teaches most, if not all, lab sessions (2hrs * 6 or so labs per week). Some people take their anger and frustration in the course out on him, but we should also understand his situation and UST's bs grading policy.",
            "comment_grading": "[15%] Lab Exercise - best 5 of 6 (got full marks)<br />[20%] Assignment (got full marks, mean = 80/100)<br /><br />Scheme 1:<br />[25%] Midterm (40/50 LOL mean is 39.5) <br />[40%] Final Exam (unreleased)<br /><br />Scheme 2:<br />[65%] Final Exam (unreleased)<br /><br />Got A in the course. Don't feel that the grading is all that fair. The course places too much emphasis on ensuring that you coded the proper way or you did the question in the wrong way (e.g. didn't have a variable and just manually inputted the values) even if the logic is undoubtedly correct. <br /><br />Originally, it was supposed to be just Scheme 1 but the midterm was conducted on Qualtrics so many people complained about connection issues and not knowing how much time to allocate per question. As a result, Scheme 2 was created and Final was held on Canvas.<br /><br />To really have a grade that is fair to all (I speculate mean could be &gt;90% total lol), UST should just make this easy introductory course into absolute grading.",
            "comment_workload": "For a 1 credit load, it's say quite a lot. Assignment was a lot of work because of 15 or so questions, then verifying the code for each item and following directions EXACTLY (cannot stress this enough, carelessness will literally end your grade in ANY assessment for this course). Midterm had conceptual stuff and not just coding; Final Exam was all about coding. Refer to Assignment and labs for practice.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": [
                {
                    "key": "ecFZQutJRCBZMJw2sDkKifZZf9wJqiVr",
                    "name": "Course Syllabus (Spring 2020)",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "M2A74asdG6eWIGufBmp6BlnSIwo2lJ3t",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 373,
                    "name": "JIA, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yoyo.y",
            "date": "Dec 18, 2021",
            "title": "靚grade and easy course",
            "comment_content": "Lecture 1: Print(), variable, data type, function: input(), int(), float(), str()<br />Lecture 2: index &amp; slicing, append(), pop(), len(), max(), min(), sum()<br />Lecture 3: if...elif...else, boolean operations (and/or/not)<br />Lecture 4: for...in..., range(), break<br /><br />I do not know any python concepts before.<br />Overall, the concepts are not difficult to understand and apply if you have attended all the lectures.",
            "comment_teaching": "Quite clear teaching but a bit boring.<br />If you have any questions, the Prof will explain them again. Moreover, there is a break during the lecture. If you have questions, he will explain them to you individually during the break time.",
            "comment_grading": "Lab Activities: Apply concepts presented in lectures to hands-on programming exercises. 20%<br />Weekly Quiz: 30%<br />Individual Project: 10% (plus up to 5% bonus) <br />Final Exam: 40%<br /><br />I got full marks on lab activities and almost full marks on weekly quizzes. <br />For the individual project, I think I get full marks and some or all bonuses.<br /><br />My grade: A",
            "comment_workload": "Although there are some weekly quizzes and lab activities, all of them are quite easy. <br />Lab activities are just required you to apply the concepts you have learned in the lecture. If you really feel difficulties, you could attend the lab sessions that the TA will teach you and almost give you the answers.<br />There are unlimited attend on the quiz. <br /><br />For the Individual Project, you are required to write a Python program to demonstrate an online purchasing system that allows the user to purchase goods, processes payment, convert currency, sum up the total price and display a price summary. Although you need to spend some time on it, it is quite interesting and easy to do it if you understand the concepts and know how to apply them.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YlrZk6yQLpHRgCZKNp58ks2vjBPpDZRL",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1506,
                    "name": "CHEUNG, Chun Lok (Hilary)",
                    "rating": 1
                },
                {
                    "id": 373,
                    "name": "JIA, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tiffesdiario",
            "date": "Aug 26, 2021",
            "title": "",
            "comment_content": "Not too hard, easy to learn.<br />Just a introduction course of python",
            "comment_teaching": "3 hours per lesson, which was too long.<br />Prof.'s English is extremely difficult to understand.<br />It’s really hard to concentrate for 3 hours. But the lab is fine, only 1 hour for the lab lesson.",
            "comment_grading": "Quizzes: 15%<br />Assignment: 25%<br />Final exam: 60%<br /><br />Limited time for 3 exam questions. No time for thinking and answering the question. We didn’t know our final marks in exam.<br />I got a B.",
            "comment_workload": "Quite a lot workload for the 1 credit course.<br />We will have one lecture and one lab per week.<br />But the assignment was acceptable",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "58P1lw6hBplk9s5991ubljHH2gj9kPbE",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1506,
                    "name": "CHEUNG, Chun Lok (Hilary)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hayoha",
            "date": "Aug 24, 2021",
            "title": "It changed",
            "comment_content": "Simple Python coding<br />easy to understand<br />need to memorize the code",
            "comment_teaching": "Professor Hong is one of the best professor in UST. She explained the concepts clearly and in detail. The pre-lecture videos are all useful and good. She is very kind and patient to students. You can always ask her questions (on class/after class) There are interactions during Lecture. Zoom chatting box and Zoom pop-up questions.<br /><br /><br />I think Hilary is good, but i think he is too busy (nearly all/ all tutorial (lab) are taught by him. I think he has tried his best to manage all classes.&nbsp;&nbsp;Good explanation for the code usage. He also gave enough practices to students. You can always send emails and ask questions but remember to state your questions clearly, better with related screenshots.",
            "comment_grading": "I got B+ at last.<br />It is achievable to get full mark in Quiz (15%)<br />total 20 marks for all quizzes, as long as you get more than or equal to 15 among 20. you can get full mark.<br />I think the assignment is not too difficult. I have 1 question do not know how to do. For the exam, it is sad that every question have its own limited time (for preventing cheating, online zoom exam is soooooooooo sad). I have plenty of time remained for the last question but i cannot finish the first one. I think this will not be the case for face to face exam.",
            "comment_workload": "Quizzes (every week has 1 lab quiz and 1 Lecture quiz)<br />Both Lecture and lab have pre-lecture/ pre-lab videos need to watch for every week.<br />1 Assignment<br />1 exam<br />I think the workload is manageable.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aj4wLoeGNMKOEKsHhGDKPwihDNYY96hY",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                },
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wefe232",
            "date": "Aug 19, 2020",
            "title": "Be careful during tests and exams",
            "comment_content": "Python basics about looping, IF, AND, etc.<br />Not very difficult at the beginning but you have to be careful when it comes to complicated parts since the code becomes longer and longer and a minor mistake can be fatal.",
            "comment_teaching": "Both professor and TA is very patient and willing to answer questions. Professor has a good English accent so it is not difficult to understand her explanations.",
            "comment_grading": "Not difficult mid-term and exams, so the mean is quite high.",
            "comment_workload": "Quite heavy, especially for a 1 credit course. <br />You have a long lab session every week and you have to submit a piece of homework during lab session. Even the process of submitting the homework is complicated.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uEzFo7eEwh6I4aSr0yaLh4VpUSHcWzvP",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Janchan",
            "date": "Jul 30, 2020",
            "title": "",
            "comment_content": "Basic intro coding using python.",
            "comment_teaching": "Both the prof and the TA are very nice. They do reply to our emails and tried their best to provide solutions. Personally, I like the way how they teach as it is pretty clear.",
            "comment_grading": "Pretty harsh as everyone seems to do well in the final exam, labs, and assignments. I heard that getting an overall 80s will give you an Bs. But again, it is only one credit, so would not matter even if you got an B to ur overall CGAs.",
            "comment_workload": "A lot of workload for one credit course.<br />Graded lab each week, and one lengthy assignment. <br />It is overall manageable as long as you pay attention during lectures and labs.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "o58eFsgKmpXLJTMBjzpMLrjnK8ZHEmL5",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ElioH",
            "date": "Jun 03, 2020",
            "title": "Best instructor and TA in the world!",
            "comment_content": "Basic building blocks of python. Good for getting a solid foundation and grasp an idea on this programming language, but far not enough for ISOM2600 (where the lab python coding is like HELL).",
            "comment_teaching": "Charles is the best TA I have ever met!!!!!!!!! He is so patient and nice and handsome and cute...You can ask for individual zoom meeting to discuss more with him. <br /><br />Professor's english sounds so comfortable. Authentic America accent. She is also very nice and willing to answer students questions in class. Always explain the ideas in detail. All you need to do is to raise questions of good quality.",
            "comment_grading": "For me it's like:<br />lab: full score<br />midterm: 100/100<br />(notice that there is one tricky MC in midterm, which requires you to have a deep understanding of dictionary. Tips: try to think more and ask more during lectures and labs.) <br />final: not released<br />Grade: A+",
            "comment_workload": "5 Lab practises which you can finish during the lab session. (need to be extremely careful though.) <br />1 individual HW which takes about 2-3 hours (including double checking)<br />Fair for a 1 credit course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eewlek7gxYOZrMUbH2PvDMI6P4UP9nKB",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "oli01",
            "date": "May 25, 2022",
            "title": "ISOM 2020",
            "comment_content": "By the end of this course, students will be able to: <br />(1)&nbsp;&nbsp;Acquire general programming knowledge with Python <br />(2)&nbsp;&nbsp;Model business data with Python data types <br />(3)&nbsp;&nbsp;Process business data with Python supported operations and methods <br />(4)&nbsp;&nbsp;Illustrate business problem solving with coding skills <br />(5)&nbsp;&nbsp;Improve logical and critical thinking ability with coding skills <br />There will not be any textbook for this course. PowerPoint slides and Jupyter notebook notes are the <br />major reading materials.Google Colab (https://colab.research.google.com/) <br />• Anaconda (Optional) (Installation guide is provided on Canvas) <br />o Jupyter notebook <br />With&nbsp;&nbsp;the&nbsp;&nbsp;proliferation&nbsp;&nbsp;of&nbsp;&nbsp;business&nbsp;&nbsp;data&nbsp;&nbsp;and&nbsp;&nbsp;the&nbsp;&nbsp;need&nbsp;&nbsp;to&nbsp;&nbsp;analyze&nbsp;&nbsp;data&nbsp;&nbsp;for&nbsp;&nbsp;business&nbsp;&nbsp;insights,&nbsp;&nbsp;it&nbsp;&nbsp;becomes <br />increasingly important for business students to have a basic understanding of coding that can help them to <br />accomplish business goals. This course intends to introduce students to basic programming concepts and <br />skills for business data coding and business problem-solving. Using Python as an illustrative programming <br />language, this course provides students with a basic understanding of programming concepts and syntaxes, <br />including data types, associated methods and functions, and control flow statements. Through the process <br />of learning&nbsp;&nbsp;a&nbsp;&nbsp;programming&nbsp;&nbsp;language,&nbsp;&nbsp;students&nbsp;&nbsp;will&nbsp;&nbsp;also develop logical and&nbsp;&nbsp;critical&nbsp;&nbsp;thinking skills&nbsp;&nbsp;and&nbsp;&nbsp;be <br />able to tackle simple business problems with coding.",
            "comment_teaching": "The teaching is fine, teachers are very patient and you can understand the content easily",
            "comment_grading": "I think the grading in this class was purely random, and even though I don't think I got any questions wrong in the final or had hard-coding problems, I still ended up with a B. After asking around among my friends, the highest I got was an A- (the friends I asked basically all had a 3.8+ CGA) Even if you work hard during the semester, you will be very disappointed by the final.So for those who are expecting to get an A range with this class, you can basically stop thinking about it.The final result of this course depends on your luck.",
            "comment_workload": "Not too heavy, but if you want to do well, you need to work hard.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VCS6u4mVghMIp2aD9wPbu8RF5snRSudm",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1506,
                    "name": "CHEUNG, Chun Lok (Hilary)",
                    "rating": 1
                },
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Minjul",
            "date": "Aug 27, 2021",
            "title": "",
            "comment_content": "just basic business python<br />if else,<br />for loop.<br />...<br /><br />It is not that hard for a beginner as a dont know python before, just spend time practicing and understanding will do.",
            "comment_teaching": "the prof was ok, abit boring, but I really like the TA, he really explains things welll",
            "comment_grading": "there is only a final since this is a i credit class. to be honest the final was quite hard, like there are basic questions, but there is also some questions that you cant think of the answer in such short time.",
            "comment_workload": "I would say the workload is ok, just go with the lectures and tutorials and spend sometime re doing the examples and concepts you will be good.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "R5GaeqXW3tVuNbChTmnJrM86aLJwzK3L",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1108,
                    "name": "WONG, Ka Chau",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Heliumet",
            "date": "Aug 20, 2020",
            "title": "Coding course by business school? Almost the worst of all!",
            "comment_content": "The course is badly designed. Business school students mostly don't have any coding experience (P.S. I have), but the course manages to include topics from data type, string dictionary, array and if-else-while statement in about 5 weeks. The teaching pace varies with the topic difficulty. Rather slow at the beginning as introducing data type is easy while the class almost in a rush when discussing dictionary and conditional statements. Both lecturers and TA can barely really handle queries from students. I can't imagine how students with no coding experience before or a good mindset can manage to get through this course.",
            "comment_teaching": "The teaching is almost useless. 2 hours of lecturer and 2 hours of lab per week, which means you are wasting 4 hours every week. Basically the lecturer and TA only try to say everything in the notes. Not all TAs are capable to answer students' questions. When someone try to ask something related to the topic (but out of syllabus), the TA may give wrong explanations. (e.g. why rounding xx.x5 to the nearest 1 decimal place sometimes giving round up while sometimes round down)",
            "comment_grading": "Unclear instructions, and model answers in programming. These two things make the course even more ridiculous. For the assignment, the TA only mention &quot;uses of (optional part) in lecturers&quot; are prohibited when one of my friends email the TA to ask. Fyi, &quot;while&quot; is also in the optional part. I think it is reasonable that they don't allow you to use very advanced knowledge that you learnt from outside, but what is the point prohibiting optional part that is taught in lecture? And these instructions are not even given clearly in the assignment statements.<br /><br />Final exam is even trasher. Fill-in-the-blank questions for programming questions using canvas, but the question itself has multiple possible answers. I don't think the one who prepare the exam realise that programmers can solve tasks in different ways.<br /><br />Another problem is no paper-checking. As to my knowledge, almost all coding courses in SENG allows paper-checking to ensure codes won't be marked wrong manually. Meanwhile, this course does not offer any paper checking opportunity.<br /><br />P.S. I am writing so not because I get a bad grade. I do get an A in this course.",
            "comment_workload": "Well, the workload is quite light in this course. As a course with only half a semester length, what you need to do is 1 assignment and about 5 lab work.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Re0oIY4et0ZAWPbj7ZI5IfgQW78Pxl9w",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "huski",
            "date": "Oct 29, 2020",
            "title": "An easy A+",
            "comment_content": "Very basic things like variables, data types, if else statements, list, dictionary, for loop, while loop etc. Also teaches you Pandas in the final lecture. <br /><br />I wished they taught functions as well so that we could use it in our individual project.",
            "comment_teaching": "Professor Hong is quite nice but her teaching is average.",
            "comment_grading": "Class participation: 20%<br />Individual assignment 1: 15%<br />Individual assignment 2: 25%<br />Individual project: 40 %<br /><br />My grade:<br />Class participation: 20/20<br />Individual assignment 1: 15/15<br />Individual assignment 2: 24/25<br />Individual project: 40/40<br />Final grade: A+<br /><br />The assignments are not difficult and the project is quite flexible. Just make sure to be careful for assignments. And for project, make sure your additional functions are creative and efficient.",
            "comment_workload": "There aren't midterm and final from this year, so you should be fine.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5Tq0hjovhNfeHO92kREHiE6OR77yxgsQ",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 1477,
                    "name": "Hilary CHEUNG Chun Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ctc711",
            "date": "Aug 31, 2021",
            "title": "Not bad",
            "comment_content": "Basic Python stuff<br /><br />I think it is manageable for a person who had zero knowledge about programming before this course.",
            "comment_teaching": "Normal, she will ask questions to make sure we understand the concepts.",
            "comment_grading": "I never got the score/feedback of the exam, so I can't tell how the grading is but it seems ookk?",
            "comment_workload": "Ok, not super heavy.<br />Quizzes for lectures and tutorials almost every week.<br />Need to watch the pre-lecture videos before classes, which was a little time-consuming. <br />Individual assignment.<br />Final exam, the time given for each question is pretty short.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nIa4GD8ozvprcYm0BZudMMrVG4lobzXm",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "御坂18520",
            "date": "Aug 26, 2021",
            "title": "Easy 1 credit course",
            "comment_content": "The content is too little.<br />Only the most fundamental content of Python.<br />Basic syntax<br />String &amp; List<br />If statements<br />For loop<br />Which you can finish in a few hours through google.",
            "comment_teaching": "It seems that the instructor and TA give a very detailed explanation to each topic which is quite enough for most students.",
            "comment_grading": "Very good grade.<br />15%quiz<br />25%Assignment<br />60%Final<br />The assignment and the quizes are pretty easy and can be finished without any diffculty.<br />The final is a little bit hurry but still easy. Just remember not to use anything not taught in the course.<br />Grade: A+",
            "comment_workload": "Almost 0, since it is a 1 credit course.<br />Only 1 easy Assignment and a Final in total.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xVybacQjjVo1iZjigXTq9KPtUKaZyN2c",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                },
                {
                    "id": 949,
                    "name": "LAI, Sum Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "肺清",
            "date": "Apr 12, 2022",
            "title": "Interesting course",
            "comment_content": "Basic Python.<br />5 weekly quizzes and corresponding videos to be finished at your own pace. <br />One lab and one lecture per week (2 hours each).<br />The content would be in the pre-lecture videos while the lectures and labs are mainly for you to practice and solve problems.<br /><br />The content of the course is easy. However, you might be competing with those who already know python well/genius/extremely hardworking guys/Cheaters. Heard that many students chose to cheat during the online semester. So if you want a good grade you need to be extremely careful and might need to pay extra effort.",
            "comment_teaching": "Prof. Hong speaks good English and so does Samuel. The pre-lecture videos were clear and they are very willing to answer your questions. Since it was taught online, the workload and syllabus might have been adjusted. Not sure for regular semester.",
            "comment_grading": "Weekly quizzes 5%<br />Lab submissions 10%<br />Individual assignment 20%<br />Final exam 65%<br /><br />Weekly quizzes are associated with the pre-lecture videos and you are able to attempt unlimited times, recording your highest grade. Details of each lab submission would be announced near the end of the labs. You are required to submit them before the end of the labs, but they are just some easy tasks. Just attending the lab sessions is okay. <br /><br />The individual assignment is similar to the format of the final exam, except that you can test your code before submitting it. Shall be able to get full marks if you understand the content of the lecture as you can test it/ you have good friends to teach you.<br /><br />The final exam consists of fill-in-the-blanks and free coding questions. About 3 questions each. Online exam. Closed books and no coding environments are allowed. Need to join Zoom proctoring. Only contents within the syllabus can be used in the final exam and there was a cheat sheet provided on canvas during the exam. If you shift to other windows during the exam, it would be considered cheating and you would directly receive an F and possibly other consequences.<br /><br />The letter grade would be released after about 2-3 weeks while the marks of the exam and assignments are still unknown.<br /><br />Final grade: A+<br /><br />Lastly, Cheat狗死全家.",
            "comment_workload": "Relatively light.<br />Weekly videos and quizzes can be finished within 30min-1h.<br />If you already know python well, just attending the labs for the lab submission is okay as no attendance was counted. But Prof. Hong taught really good so better attend the lecture.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oCrY6GVdBJh0HpFQAcZ6k4wub0suRiRF",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1506,
                    "name": "CHEUNG, Chun Lok (Hilary)",
                    "rating": 1
                },
                {
                    "id": 1196,
                    "name": "HONG, Weiyin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "USTCLS",
            "date": "May 06, 2021",
            "title": "",
            "comment_content": "It is a one credit course but finishes in half semester. They will teach you about the basic codes of python. I enjoy coding so it's quite fun to me.",
            "comment_teaching": "Both the prof and TA teach very well, they will prepare videos before class to shorten class time. You can watch them any time you want.",
            "comment_grading": "Fair grading.<br />I get full marks in all short quizzes but I fked myself in Final.<br />Assignment is easy tho. At last i still hv a B so I think it is fine.<br />Quizzes(15%)<br />Assignment(25%)<br />Final exam(60%)",
            "comment_workload": "The workload is fine to me. Two quiz per week, both lab session and lecture have quizzes",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cNqrbISHEr6xI578qCGfLEA6mecRNMBG",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1506,
                    "name": "CHEUNG, Chun Lok (Hilary)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "belowme",
            "date": "Apr 25, 2021",
            "title": "Feels like suffering when doing, but retrospective actually kinda miss the class. Much better than 2600, which is the other half of the semester",
            "comment_content": "Same as others, basic python stuff:<br /><br />Syllabus<br />Introduction to Syllabus<br />Introduction to Python<br />Python Basics 1<br />Python Basics 2<br />String<br />List, Tuple, and Set<br />Conditional Flow Statements<br />Loops Statements<br />Pandas ( not on exam)",
            "comment_teaching": "Hilary is a funny guy, though not many people like him. He takes no BS. Makes you be active in class where you actually learn to code.",
            "comment_grading": "Grading tbh quite fair.<br /><br />quizes: 12/15(full score 20, but only count up to 15 for errors, I missed like so many). For quiz, can use notebook to try out the combinations<br /><br />1 assignment: quite challenging, but good preparation for final exam. score not released but I think I got full<br /><br />Final: content not released, but 5 problem based questions, knew how to do 4, last one super hard, but attempted to do like the beginning part, left the rest of the question with #comments. <br /><br />Even though I missed out on basically free marks for the quiz, and pretty much gave up on last question still got A. I think because most people find this course hard, so the mean is relatively lower.",
            "comment_workload": "Too much for 1 credit. Expect 1+2 hours of lectures per week + Quiz for each lecture that expires the same day. <br /><br />1 assingment + final",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}