{
    "error": false,
    "course": {
        "id": 690,
        "subject": "ISOM",
        "code": "3540",
        "name": "Introduction to Probability Models",
        "description": "Probabilities, random variables, distribution functions, densities, expected values, conditional distributions and densities, conditional expectations, moment generating functions, Chebyshev's inequality, central limit theorem, and Poisson processes.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1630,
            1610,
            1510,
            1430,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"ISOM\" data-code=\"2500\" href=\"/review/ISOM2500\" target=\"_blank\">ISOM 2500</a> or <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2411\" href=\"/review/MATH2411\" target=\"_blank\">MATH 2411</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"MATH\" data-code=\"2421\" href=\"/review/MATH2421\" target=\"_blank\">MATH 2421</a>, <a class=\"course-link\" data-subject=\"MATH\" data-code=\"3425\" href=\"/review/MATH3425\" target=\"_blank\">MATH 3425</a>",
        "rating_content": 3.93,
        "rating_teaching": 3.71,
        "rating_grading": 3.43,
        "rating_workload": 3.07,
        "review_count": 14,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 769,
                "name": "SO, Mike Ka Pui",
                "count": 10
            },
            {
                "id": 369,
                "name": "PAN, Baoqian",
                "count": 1
            },
            {
                "id": 380,
                "name": "CHEN, Kim Heng",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "HCqceaFW1XIunP3YNWST05YlORZ5EKTN",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 769,
                    "name": "SO, Mike Ka Pui",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "SomeoneInUST2",
            "date": "Jan 15, 2019",
            "title": "Plz don't need take this course unless compulsory (U Willl Regret It ‼）",
            "comment_content": "As the title suggested, Probability. However, compared with Math class, it tells more on business application. <br /><br />You have to go to lectures in order to get the powerpoints (i.e. not upload on Canvas). In fact, in the later classes, TA just put the printed ppts on a desk so you can let your friend grab one for you. <br /><br />Coverd Chapters as below: <br />1. Combinatorial analysis<br />2. Axioms of probability and conditional probability<br />3. Discrete random variables<br />4. Continuous random variables<br />5. Joint distributions<br />6. Properties of expectation<br />7. Dependence measures<br />8. Ideas of Bayesian decision<br />9. Limit theorems<br /><br />Personal Opinion: Very boring and too manyt for me since I am not much into math. The content looks easy but indeed hard. Strongly not recommend this course to students without strong mathematics background.",
            "comment_teaching": "He is a nice professor but almost everyone gets bored during lecture time. He explains every slide in details, especially how the formulas are derived but these are not useful for exams...<br /><br />Later, when he finds he is not able to finish all on time, he speeds up. But those hard content worth ilustrating are in the later part so not so good timing....<br /><br />Though he is nice, I have to say this is the boredest lecture ever in my life....",
            "comment_grading": "Assignment : 25%<br />Mid-term : 25%<br />Final exam: 50% <br /><br />Assignments are super hard T T. However, some can find answers on google. Ask your friend as well ! = It's hard to get high mark doing alone. <br /><br />Mid-term &amp; final super hard ! Both exams require talent + self-practice a lot of application questions. Even if you pay full attention in class and note down everything, you can still do badly.... (like me......)<br /><br />As I said I score pretty low on both the exams, I am grateful I am still in B range (B-). Thank for that.",
            "comment_workload": "Workload is ok if you are smart and good at mathematics. It would be horrible for students like me that require lots of self-practice and after-class review work. <br /><br />Highly suggest go to Math class instead of this one.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oPlQl0vZZG2kqZzS0qPshtMiurrqIq1E",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 769,
                    "name": "SO, Mike Ka Pui",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "lepetite055097",
            "date": "Dec 15, 2019",
            "title": "Don't take it if you are having a busy semester",
            "comment_content": "This&nbsp;&nbsp;course&nbsp;&nbsp;presents&nbsp;&nbsp;basic probability concepts&nbsp;&nbsp;and&nbsp;&nbsp;techniques. Topics&nbsp;&nbsp;like&nbsp;&nbsp;conditional probability,&nbsp;&nbsp;&nbsp;expectation,&nbsp;&nbsp;&nbsp;random&nbsp;&nbsp;&nbsp;variables,&nbsp;&nbsp;&nbsp;discrete&nbsp;&nbsp;&nbsp;and&nbsp;&nbsp;&nbsp;continuous&nbsp;&nbsp;&nbsp;distributions,&nbsp;&nbsp;&nbsp;joint distribution,&nbsp;&nbsp;dependence&nbsp;&nbsp;measures&nbsp;&nbsp;and&nbsp;&nbsp;limit&nbsp;&nbsp;theorems,&nbsp;&nbsp;etc,&nbsp;&nbsp;will&nbsp;&nbsp;be&nbsp;&nbsp;discussed. Modern applications in business, economic, finance and marketing are also presented.<br /><br />Tentative schedule<br />1.Combinatorial analysis<br />2.Axioms of probability and conditional probability<br />3.Discrete random variables<br />4.Continuous random variables<br />5.Joint distributions<br />6.Properties of expectation<br />7.Dependence measures<br />8.Ideas of Bayesian decision<br />9.Limit theorems",
            "comment_teaching": "Very difficult course. If you don't need to take this course, don't.<br />The professor is dedicated in teaching and will explain a lot, but after midterm he will speed up because he can't finish all of the materials.",
            "comment_grading": "Assignments25%<br />Midterm exam25%<br />Final exam50%<br /><br />competitive, have to work very hard and get all concept clear.<br />only a few questions so if you miss something you are basically screwed.",
            "comment_workload": "very large<br /><br />You have to go to every lecture to get new lecture notes, there won't be online version. Also notes in class are important so just go to class. If you are busy maybe consider dropping this course.<br /><br />4 assignments, difficult af<br /><br />I love TA she is so kind and saved my life. You'll understand what I am saying right before midterm and final exams.<br /><br />if you need notes, cheatsheet, or practice question solution you can contact me at gooduststudent@gmail.com",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mvYdB7MQFDZkkkbvKe0d7ivBOI6oy6z3",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 769,
                    "name": "SO, Mike Ka Pui",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "antgod",
            "date": "Jan 07, 2022",
            "title": "Mike gor is so nice this sem",
            "comment_content": "1. Combinatorial analysis <br />2. Axioms of probability and conditional probability&nbsp;&nbsp;<br />3. Discrete random variables <br />4. Continuous random variables <br />5. Joint distributions <br />6. Properties of expectation <br />7. Dependence measures <br />8. Ideas of Bayesian decision <br />9. Limit theorems <br /><br />Only up to Part 6 <br />Need to know multivariable calculus (U should have taken MATH 2011)<br />If you do not hate prob, u can take this course",
            "comment_teaching": "Quite good teaching <br />Arouse my interest in prob<br />Use many business cases<br />This course is no longer diff, the calculus part is not diff",
            "comment_grading": "U need to ask the TA abt the final exam score coz the TA did not disclose<br />Assignments&nbsp;&nbsp;&nbsp;25% <br />Midterm exam&nbsp;&nbsp;25%&nbsp;&nbsp;&nbsp;<br />Me 60/100 Mean 51/100 SD: 16<br />Final exam&nbsp;&nbsp;50% <br />Me 51/95 Mean 43/95 SD: 14.4<br />Grade A-<br />Open book exam<br /><br />Tips: If u encounter diff question, just skip it and reserve time for the easy but troublesome questions<br /><br />Some questions is similar to the lecture note questions<br />Make sure that u have revised the lecture note<br /><br />Mid term: 4 LQS<br />One sub-questions related to conditional prob is same as lecture note<br />One Mosaic plot-Qualitative<br />One Binomial distribution- Find the mean and sd (easy but many steps)<br />One Quantile function- Quite tricky<br /><br />Final:<br />One finding correlation and covariance of discrete RV (easy but many steps), also sim to lecture note<br />One abt the order stat - sim to lecture note, related to VaR<br />One abt double expectation-sim to lecture note related to beta distribution <br />One joint distribution and conditional distribution- need to find some practice problems online, there are many resources, not diff<br />One exponential dist and convolution- quite diff<br />One variable transformation-need to find some practice problems online, there are many resources, easy",
            "comment_workload": "Not high workload<br />Only 4 hws",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "33cF8OLtxKQjIuuKJuvADS657J7Ly8iY",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 769,
                    "name": "SO, Mike Ka Pui",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hdda",
            "date": "Jan 21, 2022",
            "title": "Good Professor, Tough Exams",
            "comment_content": "1. Combinatorial analysis<br />2. Axioms of probability and conditional probability<br />3. Discrete random variables<br />4. Continuous random variables<br />5. Joint distributions<br />6. Properties of expectation<br />7. Dependence measures<br />8. Ideas of Bayesian decision<br />9. Limit theorems<br /><br /><br />basically like a math probability course but puts more focus on the business applications of it. important to understand the concepts and his lecture notes because his exams are mostly based off of lecture notes not much from the assignments.",
            "comment_teaching": "he teaches very very well and clear! he is willing to answer your questions after class all the time!! he is also very nice professor and gives relevant examples. <br /><br />though he teaches quite fast so have to keep up with his pace. <br /><br />The TA is also very nice and willing to help.",
            "comment_grading": "because the homeworks are groupwork, the means for the homework are really high. <br />for the midterm and final exam the means aren't as high but its okay because they focus on partial/working marks more than the final answer. <br />so even if you don't know the final answer/ don't get the final answer correctly, you can still get partial marks from the working and the prof puts high emphasis on understanding the concept more than getting the final answer correctly. <br /><br />overall: fair grading<br />assignment: 25%<br />mid-term: 25%<br />final: 50%",
            "comment_workload": "since the assignments are groupwork, the workload becomes more manageable. though the midterm and final exam needs a lot of time to study and understand because we have to make sure we really understand the concept and not only memorizing it.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nRZdd5QcQTyXzBU4lakYTJHHNkonOxnY",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 769,
                    "name": "SO, Mike Ka Pui",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Floren",
            "date": "Aug 25, 2021",
            "title": "",
            "comment_content": "Require a strong math knowledge, make sure that you have a math background since this course also prerequisite for isom 2500 or math 2411",
            "comment_teaching": "During lectures, the lecturer moves quickly, so you'll need a lot of time to digest and locate appropriate examples to practice with in order to grasp the topics.",
            "comment_grading": "The grading is kinda hard. You have to perform well in the assignment, mid, and final examination to get a good grade.",
            "comment_workload": "For the workload, you need to put effort and the assignment is not easy. You should pay attention during the class",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "RnIneWEdSHOmnSevqHhzzqUjp7trYwSd",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 769,
                    "name": "SO, Mike Ka Pui",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Seraphina",
            "date": "Jan 20, 2021",
            "title": "",
            "comment_content": "if you have a strong math background, then it's pretty okay.",
            "comment_teaching": "the professor goes pretty fast during lecture, you would need a lot of time to digest and find relevant examples to work on to master the concepts",
            "comment_grading": "you take your test and assignments on a white paper and hand it in so it depends on whether you fulfil certain steps required and prove the right answer.",
            "comment_workload": "4 assignments, 1 mid-term and 1 final<br />I wouldn't say it's a huge workload each week on things to hand in, but definitely these assignments, mid-terms and final is a big step to cross over and you better have enough work done before then to pass it",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "9PxQD2ce5NK47XuFmoC8BHe1gmhdTt7H",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 769,
                    "name": "SO, Mike Ka Pui",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "123gg",
            "date": "Dec 24, 2020",
            "title": "HARD COURSE",
            "comment_content": "The content is the same as previous years. The content itself is not difficult but the assignments, midterm, and final are super super difficult. It is completely different from what the prof teaches in class.",
            "comment_teaching": "Prof is one of the best math related course prof, he explains everything clearly. But, he assumes everyone knows multivariate calculus and partial differentiation in this course. <br />The professor and TA has a lot of consultation sessions, around 2 per week for each of them. <br />TA (Yvonne) is nice, and helpful. <br />If you still decide to register this course and is struggling, go to TA consultation session, she is the best. She saved me :)",
            "comment_grading": "Assignments 25%<br />Midterm 25% <br />Final 50% <br /><br />I didn't get full mark in most assignments because it's too difficult, but above mean in all of them. <br />For midterm I got above mean by around 1 SD. <br />For final, I got above mean by a few marks. (don't know SD) The mean for final is around 42%<br />Final grade: B+<br />(The grading is bad because it took too much effort and time to get this B+)",
            "comment_workload": "The content before midterm is quite easy, basic M1 stuff that you learn from secondary school. After midterm, it is seriously hell. Unless you have a very solid foundation in statistics (took stat math course before), the workload is huge. <br />The assignments takes at least 1-2 days to finish. My suggestion is to do the assignments super early (the day it is released) and then attend TA consultation before assignments deadline, or not you'll waste a lot of time in trying to finish the hw like I did. <br />Even though the assignments have a lot of proof questions and questions that are impossible to do, the exam is easier (still very hard), and it will focus on application. <br />How to prepare for the final exam: <br />1. Give up <br />2. Know how to do the first 4 questions of the assignments (need to ask TA for ans because prof never releases ans) + attend TA consultation <br />I would suggest spending more time on other subjects , because even if you study a lot for final, but the foundation for statistics is not solid, it's just a waste of time. Some exam questions are just near impossible to do if you have no prior stat foundation (like me).",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "wo6UFxqBcKYO7KAOUYxdcV4pIGiNpfWB",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 380,
                    "name": "CHEN, Kim Heng",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rebecca Xu",
            "date": "Sep 03, 2017",
            "title": "",
            "comment_content": "calculation of probabilities based on some theories, not difficult to understand, but quite complicated, so follow the instructor step by step.",
            "comment_teaching": "The instructor shows every step of the reasoning, but sometimes it's a little bit boring. He will call students' name unexpectedly.",
            "comment_grading": "no A+, but fair A range. The contents are not easy, so the mean of the exams are quite low. I got 1.5SD above mean and got an A-.",
            "comment_workload": "A-The workload is not big. Only 3 homework and 2 exams. But you may need time to review and understand the contents.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "o4BMJGRaRCNbHt1XLZypdXB0RCnyUsCX",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 769,
                    "name": "SO, Mike Ka Pui",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Maurice",
            "date": "Dec 29, 2016",
            "title": "",
            "comment_content": "1. Combinatorial analysis<br />2. Axioms of probability and conditional probability<br />3. Discrete random variables<br />4. Continuous random variables<br />5. Joint distributions<br />6. Properties of expectation<br />7. Dependence measures<br />8. Ideas of Bayesian decision<br />9. Limit theorems<br /><br />********** Knowing how to do integration is a must for this course, though not written as pre-requisite.",
            "comment_teaching": "I like the teaching style because the course proof-base, like many MATH courses. Students can understand the concept through proofs and apply it somewhere. <br /><br />Lecture notes can only be obtained in lectures. That means, attendance is needed.",
            "comment_grading": "Assignments 20%<br />Midterm exam 20%<br />Final exam 60%<br /><br />Grading is good.",
            "comment_workload": "5 assignments. Midterms and finals are not easy. However the mean score isn't high.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IxRsnDklTwID3NpSnkGeyMX7n6taTW3v",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Henry Luk",
            "date": "Dec 14, 2016",
            "title": "Very difficult course(for me)",
            "comment_content": "If you are not good at mathematics, don't reg into this class.<br />The content is highly related to mathematics about probability, and the models introduce are quite difficult.<br />Some integration and advanced math are required, if you are not prepared for this don't study this course.",
            "comment_teaching": "I think Mike tried to explain the model, and he speak well too.<br />But the problem is, the content in the class are too difficult. So even he talked well, you may not be able to understand the content. Better read reference book or wiki if you really want to explore these contents by yourself.<br /><br />btw all lecture notes are distributed in class(not uploaded to canvas), so you must come to class to take the lecture notes.",
            "comment_grading": "Grading should be good.",
            "comment_workload": "5 assignments with total 20%<br />mid term 20%<br />final 20%<br /><br />** Final exam is extremely hard......",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Mf1VjCl2vRUnNKIjWopGis2U0QLnWT65",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 769,
                    "name": "SO, Mike Ka Pui",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cretree",
            "date": "Mar 21, 2016",
            "title": "",
            "comment_content": "The course content started with easy stuff like permutation and combinations. After that it went crazy. Joint distribution and whats after weren't easy at all. <br />Goes into details for most of the distributions (normal etc.)",
            "comment_teaching": "Lecturer is nice, explain context and answer questions clearly.",
            "comment_grading": "Open book midterm and final. No information about grading. may ask extended questions derived from lecture notes.<br />midterm: mean around 50 with sd 15.<br />No information about final again.<br />acceptable grading overall.",
            "comment_workload": "5 assigned homework in total, about 4-5 questions each time. <br />need to revise after class otherwise have a really hard time during final period.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pwPd0JCWFVQQ1XtlTvhZcivmuJdnbKG3",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Star*",
            "date": "Aug 15, 2015",
            "title": "",
            "comment_content": "Part of the course overlap with the prerequisite ISOM2500 e.g. Normal and other distribution but in a deeper level. However, content after midterm will be a bit more difficult but you will totally understand if you attend all the lecture. No attendance will be taken but then you need to get 10 participation cards throughout the semester in order to get the 10% participation cards. Many chances to ask and answer question but I hate people asking meaningless question in order to get the cards. If you have studied M1 in secondary school, you can understand the course better.<br />P.S. This is an required course for Quantitative Finance UG and electives for OM.",
            "comment_teaching": "I must said instructor matters a lot for this course. I have heard that people who took this course under a different instructor and the result is quite...... Those who have taken her ISOM2500 will know her teaching style and it is very similar. If you don't understand, please ask as she can explain your confusion quite well. However, the TA is quite useless. Tutorials are optional and I have never been to it. Mostly give some hints for assignments but useless =[",
            "comment_grading": "Kris Pan is a good grade professor. if you attend all the lectures and finish all the assignments you will easily pass the exam in high marks. <br />I got an A=]",
            "comment_workload": "3 group assignments and 1 individual. Assignments are partly calculations and partly application on Excel. Quite easy for calculations but Excel need some thinking to finish it.<br />Only need to study lecture notes but not extra reading. Enjoyable course =]",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0QVhGGII7ufXzjilMvvsJzMstOxQBJSj",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 769,
                    "name": "SO, Mike Ka Pui",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Arange",
            "date": "Jan 27, 2016",
            "title": "",
            "comment_content": "The probability at the beginning is easy. However, starting from discrete random variables, the difficulty increases. Joint distribution and expectations are the most difficult part which requires some of the proofs in examinations. Also, you need to learn multivariable calculus first since this course requires the knowledge of multivariable calculus though it is not the pre-requisite.<br />1. Combinatorial analysis 2. Axioms of probability and conditional probability&nbsp;&nbsp;3. Discrete random variables 4. Continuous random variables 5. Jointly distributions 6. Properties of expectation 7. Dependence measures 8. Ideas of Bayesian decision 9. Limit theorems: All sections.",
            "comment_teaching": "He teaches very slowly since he explains each section in great details. However, it leads to some of the content haven't been introduced.",
            "comment_grading": "Midterm and final are open-booked exams. You can bring anything as you like into the exam area. In other words, you may not know how to do even you have your books. You are not recommended to buy books as you cannot understand what the book is talking about.<br />Prof So doesn't tells us the how the grade is given even the composition of the grade. <br />Midterm &gt;1.4sd , final don't know(but I think I get a high mark) = B+<br />Bad grade at all",
            "comment_workload": "There are about six pieces of assignments during the semester. Each piece of assignment includes about 5-6 questions. The questions are difficult such as proof and Excel-related questions. You need to revise after each lecture since you will be very difficult to catch up once you get lost.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "NDMevZRD2cOYxw4SOFriS2b6Y2Gw45Ly",
                    "name": "OUTLINE_ISOM3540_Fall2015_20(4)",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "2VipvQxlckKBuxKD9sitHyauXCuLzQ7h",
            "semester": "2014-15 Spring",
            "instructors": [],
            "is_author": false,
            "author": "kfc",
            "date": "Aug 21, 2016",
            "title": "Phys1003",
            "comment_content": "In fact, not too many Phys calculation is needed for this course. Also, it's better to score high marks in midterm as it's quite easy. Yet, the difficulty level of final exam is extremely hard. And the s.d. is about 1.5 in order to have A range score.",
            "comment_teaching": "Teaching is a bit boring. It's better to skip lessons.",
            "comment_grading": "Good grade",
            "comment_workload": "Problem sets are good for final exam preparation . Also, cheat sheets can be brought to mid term and final exam. Thus, the workload is acceptable, generally speaking.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 28,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}