{
    "error": false,
    "course": {
        "id": 697,
        "subject": "ISOM",
        "code": "4100",
        "name": "Information Systems Auditing",
        "description": "The course provides a comprehensive approach for auditing information systems. It covers fundamental concepts of risk management for Information Systems (IS) auditors to perform risk assessment, and risk analysis at various business levels, including systems, administrative and organizational levels. The course also covers business cases for students to study, and provides opportunities for them to apply their IS auditing skills to solve those cases from IS auditing perspectives. Typical solutions to those cases are effective, reasonable, and practical controls. Other IS auditing practices, such as compliance audit and governance audit, and auditing system development life cycle are covered as well, in order to provide a holistic training of IS auditing to students.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2120,
            2110,
            2020,
            2010,
            1920,
            1910,
            1820,
            1810,
            1720,
            1710,
            1620,
            1610,
            1520,
            1510,
            1420,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"ACCT\" data-code=\"2010\" href=\"/review/ACCT2010\" target=\"_blank\">ACCT 2010</a> and <a class=\"course-link\" data-subject=\"ISOM\" data-code=\"2010\" href=\"/review/ISOM2010\" target=\"_blank\">ISOM 2010</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"ISOM\" data-code=\"4200\" href=\"/review/ISOM4200\" target=\"_blank\">ISOM 4200</a>",
        "rating_content": 3.82,
        "rating_teaching": 2.94,
        "rating_grading": 3.76,
        "rating_workload": 4.18,
        "review_count": 17,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 375,
                "name": "KWOK, James Sai Ho",
                "count": 17
            },
            {
                "id": 958,
                "name": "NG, Sam",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "QHvldqIourM91JV8uXweZICImMjnOB8C",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "棉花糖",
            "date": "Dec 31, 2022",
            "title": "Group project determines your grade",
            "comment_content": "It can be either IS elective/IS auditing option required course. So it covers SOME content of the CISA (Certified Information Systems Auditor) exam. You can refer to other reviews for the topics covered.<br /><br />Easy and not a lot of concepts (compared with other IS courses) HOWEVER I suggest everyone should either attend lessons/watch lecture recordings if you want to get a good grade as his PPT are not suffice to do well. <br /><br />The in-class quizzes and final exam often asks about what he emphasizes in class multiple times. So try to catch what is important by attending classes.",
            "comment_teaching": "James is a Hong Kong professor, so his accent is okay. His teaching style is more freestyle than like a lecturer. What I mean is he could spend a lot of time on explaining a concept and wanders off to talking about points NOT in the PPT (that's why you need to jot notes as you listen/rewatch lecture recordings) or else you will lose A LOT of scores in all assessments. <br /><br />I would say his teaching is both easy and hard to follow. Easy in a sense you can easily understand what he is saying, however, you need to focus and pay attention to have a better sense of what the MAIN POINT is, which will likely appear in in-class exercises and final. <br /><br />Tip: If you hear repeated keywords, it is likely important. Also, he will ask about a certain keyword e.g. CVE so just copy as much notes as possible and print them out for the final exam",
            "comment_grading": "Please look at the score breakdown and what I attained and determine if you want to risk your grade lol<br /><br />Breakdown: <br />1. Assignment (Group) 30%<br />2. 3 In-class exercise (Individual and closed-book) 30%<br />Note: 4 in total. Counts the best 3. Difficulty is similar for all.<br />3. Final Exam (Open-book) 40%<br /><br />My scores:<br />1. almost lowest (not exposing myself lol) Mean 24.3 High 28.5 Low 21 <br />2. 29.8/30 Mean ranges from 7-8 (above average for all 4)<br />3. 32.63/40 (lower than mean) Mean 33.25 High 38.63 Low 21.88<br /><br />Overall:<br />Just as what I put in the title. Your grade is pretty much determined by your group project. However, your group mates are assigned to you. His grading is NOT transparent at all. No free riders in my group. However, it is hard to understand what James want. We asked for feedback since we are almost lowest, and the comments are pointless. We have no idea how we lost that many scores. I am a bit disappointed by the group project scores. Ranting aside, a piece of advice would be to read other reviews on how to nail the group project. All in all, I think you have to follow what James emphasized in class and try your best. <br /><br />In my opinion, doing well (is not hard, given that your lowest score is dropped) in in-class exercises is not enough, or I should say doesn't matter as much as doing well in finals and the group project. The group project is released in mid Nov (and yes, during project peaks) and you have 2 weeks to pull off a 10-minute video presentation with a PPT supplemented by a report. Everyone has to present their own parts so I think it is unlikely to have a free rider but do start early once the assignment is released so you have more time to fine tune your content and all. From what I heard, if you are able to attain the highest score for the project, you can get A range. So, really work hard on the project. <br /><br />As for the final exam, James is nice enough to make it open-book. As you can imagine, when it is open-book, everyone does well lol. The time is not tight at all. So I think jotting notes onto your notes is useful. I printed out all lecture slides. Some questions could be tricky, so nobody is able to score full marks. Not sure how to achieve higher as I think he may change the questions next year. But one question I lost marks in needs you to explain in your own words instead of copying from his lecture slides which he explains in his own words. So, this is a trap I fell into I guess. But who would have guessed he wants us to use our own words to explain. I mean, good luck ;)<br /><br />Final Grade: B<br /><br />Worst grade of all my courses this semester with seemingly easiest course content. My last word is to mentally prepare those who are patient enough to read till here: don't be fooled by the easy course content. Still hard to get A range. Needs much more effort if you want A range. I should have worked harder for the group project and final exam :(",
            "comment_workload": "The 'Grading' part pretty much explains the extent of effort this course requires. Just as any ISOM/UST course, exert all your effort (despite the easy content) if you want A range. Otherwise, I think with minimal effort e.g. attending classes and jotting notes, very easy to get B range, if this is all you want. <br /><br />Think through how to do well in the project and DO NOT take it lightly.<br /><br />If you want B range, reg this; if you want A range, work harder.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lgEAzJdXQITbYfiUwyW09EFP9VDHpKT5",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "hlll",
            "date": "Jan 06, 2023",
            "title": "Don't take this course unless you want to fulfill the IS auditing option",
            "comment_content": "An introduction to IS auditing, teaching fairly simple concepts only. The whole course circulates around the topic of &quot;Risks&quot; and &quot;Controls&quot;. No quantitative or very technical content is covered. It's a bit disappointing that some knowledge learnt are like &quot;your mum is woman&quot;, so I don't feel I have learnt a lot after taking this course.<br /><br />Some content of this course overlaps with ISOM4300, so it is ok to take both ISOM4100 and ISOM4300 in the same semester. You wouldn't want to keep learning Risks and Controls in two separate semesters.",
            "comment_teaching": "James Kwok's explanation on concepts can vary every week. He give you a certain definition on the first week, and then after a few weeks he can overturn what he had said before. So you'll have no idea which definition to follow in exam.<br /><br />His lectures are quite boring in my opinion. He can spend 30mins reviewing what is taught in the previous class, and then spend another 30mins explaining a single slide. You'll have to jot a lot of notes because his slides cover only a very limited portion of what he taught in class.<br /><br />He isn't very helpful when we ask him something about the group assignment either. Most of the time he just said &quot;It's ok as long as it makes sense&quot;. Not much constructive feedback on our work, so I still have no idea why we scored so poorly for the group assignment.<br /><br />The good thing about him is that he teaches quite slowly, and will post the lecture recordings on Canvas, so you should be able to follow and can rewatch the lectures if you find it helpful.",
            "comment_grading": "Assignment (x1) (Group, with video presentation) - 30%<br />In-class exercise (best 3 out of 4) (Individual) - 30%<br />Final Exam - 40%<br /><br />Since the content is not difficult, the SD of all these assessments are very low. I scored well in the in class exercises, below median for assignment, and at median for final exam. Final grading is B. I don't think B is a very nice grade, given that B is the wost grade I've ever had. Besides, I scored A+ in ISOM4300, so I don't think I do not understand IS auditing very well.",
            "comment_workload": "As I said, the in class exercises are very easy so you don't need to spend much time revising for it. The group assignment is fairly simple, won't take much time to complete too.<br /><br />(Yet, having a simple group assignment does not mean you will get a good grade easily. James got quite a &quot;special taste&quot;. For our pre-recorded video presentation, he complimented a group who put background music to their Zoom recorded presentation. He said he appreciate that group adding music, and literally everyone in class were giggling when we heard this comment.)",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DFTB15qheiPEXnMydZTdPzjiesG8B9wp",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cly__",
            "date": "Jan 05, 2021",
            "title": "All I remember is Risk + Control",
            "comment_content": "CISA Topics:<br /><br />Chapter 1: IS Audit Process<br /><br />Chapter 2: IT Governance<br /><br />Chapter 3: SDLC",
            "comment_teaching": "He is a nice professor but he keeps repeating the same things over and over again. Risk + Control Risk + Control Risk + Control....<br /><br />Don't rely solely on the notes he typed on Note Pad but do some elaborations based on what he said.&nbsp;&nbsp;As I am 100% sure you won't understand what is going on during revision if you just simply copy those bullet points.",
            "comment_grading": "Pretty good grading and getting good grpmates are really important<br /><br />-In Class Ex 15% x3 <br /><br />-Group Case 15% <br />Individual Case 2% each&nbsp;&nbsp;(Can get the 2% by asking questions during the presentations Q&amp;A) <br /><br />- Take-home Exam (35%)<br /><br />Got nearly full marks for all in-class &amp; group case<br />Above 1 SD in Exam<br />--&gt; Final Grade: A",
            "comment_workload": "Moderate workload <br /><br />3 In-class exercises (group-based) <br />He will discuss the answers during class so don't skip lectures (that day)<br /><br />3 Cases (1 Chosen as Group Project) <br />For each case, he will choose 2-3 groups to present for 10 mins.&nbsp;&nbsp;The groups chosen are usually those getting higher marks for the case.<br /><br />1 Take-home examination (Complete within 3 hours)",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cRq7UsyePoTaGgOg8koaoTcOjQ8JhjdK",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "qwerttyu",
            "date": "Jan 05, 2020",
            "title": "",
            "comment_content": "Chapter 1: The Process of Auditing Information Systems<br /><br />Chapter 2: Governance and Management of IT<br /><br />Chapter 3: Information Systems Acquisition, Development and Implementation (Partial)",
            "comment_teaching": "He explained quite clearly with examples yet he keeps repeating and repeating all the time. <br /><br />At first he teaches quite slowly and at least he skipped some slides.",
            "comment_grading": "In-class exercises are very easy because he has given all the tips to you. You can easy score full marks in in-class exercises.<br /><br />Midterm is 30 MC and some questions are related to case studies during lesson.<br /><br />Final consists of short questions. The questions are straightforward. <br /><br />Midterm: Above mean<br />Final: Above 1 sd<br />Final grading: A<br /><br />Good grade course",
            "comment_workload": "Fair workload for Fall. <br /><br />1 Midterm (All MC) <br />3 In-class Exercises<br />1 Presentation + 2 Individual question<br />1 Final",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TVuzlHLzmmpTTyHTUhq5jjSOKkQRqI5G",
            "semester": "2016-17 Winter",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nyw",
            "date": "Aug 08, 2017",
            "title": "",
            "comment_content": "The course was conducted in one month time so it was kind of rush. Around 2 hrs per lecture and 2 lectures per week.",
            "comment_teaching": "Detailed notes are given and you can basically understand everything without going to the lecture.",
            "comment_grading": "Grading is pretty good. The midterm score is generally lower and the final is normal. One thing to note is the group presentation score and participation, this would make a big difference if u manage to be the best group and extra score will be given. But the presentation preparation time is only around 2 to 3 days for winter course so it could be a rush.",
            "comment_workload": "Acceptable workload with quizzes, in-class exercise, group presentation, mid term and final. MidTerm is only MC questions while Final includes long questions in addition to MC questions.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NEkfonyI2AGrMbXozNQFGLZ1QKwjn9sV",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "imcat",
            "date": "Dec 29, 2022",
            "title": "Confusion &amp; Misalignment",
            "comment_content": "I can't say whether ISOM4100 or ISOM4300 is the introduction to IS Auditing course - but this seems more like it. The course teaches me the importance of &quot;un-learning&quot; everything that you have experience in. <br /><br />1 Core Reminder: Justify everything you've identified with documentations from the company/case subject. DO NOT justify your risk by inferencing stuff from the case - e.g., by justifying that a risk is possible with external literature or stuff. Just read the case and outline &amp; explain the obvious is enough.<br /><br />Risk = Likelihood x Consequence/Negative Impacts.<br /><br />As for Final Exam &amp; Project Assignment - just remember everything needs to be related to Business Objectives, B-case, and whatever about Expected Benefits those kind of stuff. It is not something understanding &quot;concepts&quot; or rote memorisation can help - you need to somehow be mentally linked with James to understand what he wants. <br /><br />This is another talk-heavy course with no technical stuff discussed. If you know nothing about cybersecurity, risks, and controls, you may find this course interesting and easy-to-handle. For me, what the course teaches just confuses me with what I know in real life.<br /><br />By the way, even after the course, I still cannot distinguish between Personal Data, Confidential Data, and Sensitive Data - maybe it is just me being incompetent.<br /><br />Part 1 – IS Auditors <br /><br />Part 2 – Risks<br />2.1: What are Risks<br />2.2: Risk Matrix<br />2.3 Ransomware Attack<br /><br />Part 3 – Risk Management<br />3.1: Ransomware Attack<br />3.2 Software AG Case<br />3.3 Major Risks<br />3.4 Controls<br />3.5: Control Effectiveness &amp; Implementation Plan<br />3.6: Summary of Risks and Controls<br /><br />Part 4: Internal Controls<br />4.1: Internal Control Design<br />4.2: Ransomware Attack<br />4.3: DDoS Attack<br />4.4: Control Types<br />4.5: Education as a Control<br /><br />Part 5 – Templates of Risks and Controls<br />5.1 Ransomware Attack<br />5.2: DDoS Attack<br />5.3: Summary of Templates<br />5.4: HKEX Case<br /><br />Part 5A – Personal Data and the PDPO <br /><br />Part 6 – Risk Management<br />6.1: A local bank<br /><br />Part 7 – IS Auditor’s Mindset<br />7.1: Major Risks<br />7.2: Compliance Risk<br />7.3: Evidence<br />7.4: DBS Case<br /><br />Part 8 – Risk-based Audit Approach<br />8.1: Interview and Observation<br />8.2 Compliance and Substantive Testing<br />8.3: Audit Risks<br /><br />Part 9 – Performing IS Audit<br />9.1: Evidence<br />9.2: Computer-assisted Auditing Techniques (CAATs)<br />9.3: Other Experts<br />9.4: Presentation<br />9.5: Follow-up<br /><br />Part 10 – Applying the Templates of Risks and Controls<br />10.1: Warehouse Theft<br />10.2: Apple Bug (BOC Case)<br /><br />Part 11 – IT Governance<br />11.1: The Role of Audit<br />11.2: Summary of IT Governance<br />11.3: Hiring Process<br />11.4: Termination Policy<br /><br />Part 12 – System Development Lifecycle (SDLC)<br />12.1: Project Management<br />12.2: Key Terms in SDLC<br />12.3: User Requirements<br />12.4: Emergency Leave<br />12.5: Project Money<br />12.6: Scope Creep",
            "comment_teaching": "Pros: James always tries to explain everything.<br /><br />Cons:<br />1. James' lecture slides are a bit chaotic - you must attend his lectures/watch the lecture recordings to understand what are them (the slides' layout seem to be from PPT's Design Ideas). It can be his intention to make you attend his classes - I have no issues with this, just put a little extra effort to organise everything on your own.<br /><br />2. James' explanations can vary between classes. An explanation given in the previous class can be different in the next - I would say this gave rise to my confusion about the 3 types of Data. <br /><br />3. Risks - James mentioned several Major Risks throughout his lectures: Compliance and Data (C/I/A). His way of explaining all these risks just gave me an impression of framing everything under these Major Risks - so they are sort of a category of the Negative Impacts that we can identify from cases. However, from what I understand from his feedback on the Project Assignment, the DPPs in the Compliance Risk (PDPO) can be discussed separately. I was utterly confused but it is what he expects. As a student, I can only blame myself for not asking sufficient questions during the assignment and not asking him tons of questions to understand what &quot;Risk&quot; actually is.<br /><br />4. Controls - the controls taught are literally just what you can find on Google. The course teaches you how to frame your control to be &quot;Effective&quot;, &quot;Reasonable&quot;, and &quot;Practical&quot; with &quot;sufficient evidence&quot;.",
            "comment_grading": "Grading Components:<br />1. In-class Exercise (30%):<br />- 4 in total<br />- Best 3 counted towards final grade<br /><br />2. Project Assignment (30%):<br />- You have 2 weeks to complete the Project<br />- A case is given with several articles for your understanding<br />- Need to submit a Presentation Slide, Written Report, and a Presentation Recording<br /><br />3. Final Exam (40%):<br />- All Short Questions with word limit<br />- Open-book<br />- Test you on stuff he talked during lectures - virtually nothing from his slides, SO TAKE NOTES during classes<br /><br />Me:<br />1. ~ 29/30<br />2. ~ 37/40<br />3. ~ 22/30<br />Final Grade: B<br /><br />Distribution should be very skewed given means are high. Screwing up the Project Assignment = you should no expectation about the final grade.",
            "comment_workload": "Very light.<br /><br />1. MEMORISE everything James went through in the lectures before the in-class exercise.<br /><br />2. Do NOT make the mistakes I mentioned for the Project Assignment - it takes at most 3 days for the group to sit down and get everything done.<br /><br />3. Consolidate all notes for the final exam, take your notes to the exam venue. Bear in mind the word limit and you should be fine.<br /><br />Whether or not you will screw up the course depends on your Project's score. I underestimated James' expectation and the complete misalignment got me to hell.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nNCIPVHPpc8RheUpwyVuQKkHg7oWtp3Z",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rsternyin",
            "date": "Dec 30, 2020",
            "title": "",
            "comment_content": "Chapter 1: IS Audit Process<br /><br />Chapter 2: IT Governance<br /><br />Chapter 3: SDLC<br /><br />Actually not much to say, just remember the &quot;risks and controls&quot; as they will be repeated throughout the whole semester",
            "comment_teaching": "&quot;Risks and controls&quot; repeated over and over again.<br />But the risks and controls vary under each circumstances and no &quot;model answers&quot; are provided which is very confusing. He usually collected answers from students and graded them in class one by one, but sometimes he agreed that answer was right the lecture before, and disagreed in the next lecture, so it is super confusing. <br />He usually spends a lot of time repeating the same thing over and over again, and ending up not enough time to explain the answers for in-class exercises and cases, which will be appeared in the final exam.",
            "comment_grading": "Take home exam: 35%<br />(26.67/35, mean 26.2, s.d. 2.62)<br /><br />Cases x3: 20% <br />One case needs to be presented with ppt [group]: 16%; <br />the other 2 just write the ans [individual]: 2% each<br />(13.2/16, 2/2, unknown/2)<br /><br />In-class exercise [group] x3: 45%<br />(15/15 x3)<br /><br />Final grade: A-",
            "comment_workload": "Can't say it is too heavy but timing is very important.<br />The in-class exercises are given out in class and you will have 24 hours to finish it. However, the case is also released in the same week, with around 4-5 days for preparation. So if you are the presenting groups for that case, you need to finish the in-class exercise, as well as the answer for the case, and a powerpoint with 10-min presentation. The first case will most probably clash with your midterm period, while the third case will clash with your project deadlines period, so be wise if you've got a chance to choose which case to work on for presentation.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4x7rqYUuRHBai0ZNZd5yx5nXubWnpbJ7",
            "semester": "2016-17 Winter",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                },
                {
                    "id": 958,
                    "name": "NG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Flanker",
            "date": "Feb 07, 2017",
            "title": "",
            "comment_content": "The first 3 topics of CISA exam. Briefly talks about IS Audit, including the basic process, principle , risk-base auditing approach, project management and IT security<br /><br />A quite informative and intensive course for a winter sem course.It is really useful for your future career.",
            "comment_teaching": "The professor is using blended learning for this course.<br />In winter semester, it means<br /><br />3 * 2 hour lecture + 3* 40mins lecture video(seperate from face to face lecture) + 3 in-class exercise + 3 online quiz for each week<br /><br />Lecture notes provided for each lecture, no need to print by yourself. Yet the lecture notes will only cover the basic concepts and keywords, it is strongly recommended that you have to jots what he mentioned in class/videos to make sure you understand the logic flow, which you need to present again during case study and final exams.",
            "comment_grading": "The grade is quite good<br />For me<br />Midterm exam 20/24&nbsp;&nbsp;(mean 17.5,sd not provided)<br />Final exam 87.04%<br />Overall ~90% , turns out A-range",
            "comment_workload": "Required in-class exercise, 3 cases( 1 is chosen as group project), online quiz, midterm and final<br /><br />1 case will be assign as your group exercise, which counts for 14%, if your groups be chosen to have&nbsp;&nbsp;presentation, that means your group scores the highest among all the&nbsp;&nbsp;groups.<br /><br />Midterm is MC question which mostly test about in-class exercise and online quiz<br /><br />For Final exam, it is much harder than the midterm which is mostly short and Long question, remember to think like the way when you are working on case and in-class exercise, the explanation counts much.<br /><br />For a winter sem class the workload is quite heavy but it&nbsp;&nbsp;rewards the same at last.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uucSb4aFERbMHd269RKxqD4xaP6rVWD3",
            "semester": "2015-16 Winter",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "1999",
            "date": "Feb 15, 2016",
            "title": "差1個sd 差1個大grade",
            "comment_content": "This course provides a comprehensive approach for auditing information systems that is useful for auditors and information security professionals. Computer security examples are used to illustrate IS auditing process, practices and management. It will help you take the CISA exam later on in your career.<br /><br />In addition to the concepts of computer security, it also covers the following chapters in CISA:<br /><br />Chapter 1: The Process of Auditing Information Systems<br /><br />Chapter 2: Governance and Management of IT<br /><br />Chapter 3: Information Systems Acquisition, Development and Implementation (Partial)",
            "comment_teaching": "Lessons(jotting notes is necessary in order to understand the concept)<br /><br />there is grouped in-class exercise(no marks for in-class)<br />!important! the in-class exercises' content will be examined on mid-term and final (direct copy from in-class)<br /> -&gt; the best ans will be uploaded",
            "comment_grading": "online quiz 8% 1%@1<br />&nbsp;&nbsp;(mc questions &amp; will be examined on midterm and final)<br />facebook discussion 1% (bonus)<br />mid-term 40%<br />final 52%<br /><br />mid-term: below mean few<br />final: below mean 1.x sd<br />turnout -&gt;C+<br /><br />my friend:<br />mid-term: above mean 1.2 sd<br />final: below mean 1 sd<br />turnout -&gt;B+",
            "comment_workload": "understanding &amp; reciting the concept completely = everything<br /><br />Also, don't trust the best ans, i recited the best ans and write on the paper, still below mean wtf. and the TA in this semester cannot help us at all.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kAqsMMlt5mB11nC4J1FLzhBRcRdwwnT9",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hihihihi",
            "date": "Jan 09, 2016",
            "title": "",
            "comment_content": "As an usual IS course, the prof will print the notes for you. The whole courses is divided into a few session such as IS security, IT governance, SDLC etc.. However, it always use point form or a diagram so you will needa jot down many notes. One point to note is that the lecture notes are not all the theories to be tested, those theories listed in the quiz answer will also be tested.",
            "comment_teaching": "He uses a blended learning method which students need to watch the video at home and go to lecture for review and class exercise. Due to this, usually only one lecture is required to attend per week. However, I think that he does't teach well through the video and I don't always watch video up to time as I may not have time. Moreover, at the first half of the courses, he doesn't provide model answers to us and always said &quot;this answer can be corrected if xxxxx, and that one may also be right&quot; which confused us a lot. Later, he sometimes provide us with model answer, which shows at least he is willing to listen to us and improve",
            "comment_grading": "I am mean at midterm, above mean at final (not sure whether it's above 1 sd because no data provided), discussion score full mark (almost every one will have full mark) and case score is ok. I turn out have a range",
            "comment_workload": "Workload is ok. Throughout semester, you will need to take a quiz per week (with unlimited trial so actually not really a workload because I just try for many times), three cases without one you may need to do presentation. If you do not need to do presentation, the case is just like a normal assignment which you just need to answer a few questions. Facebook discussion throughout whole semester, which is actually an extra quiz in Facebook. Not a must to participate every time but at least it would be better if you answer for a few times.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eqxzW4jRggOUhciRhS5Io5d1oMfWrAv2",
            "semester": "2020-21 Winter",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Striver",
            "date": "Jan 23, 2021",
            "title": "If you are his tommy worm, you can get good grade. Such a pity I'm not.",
            "comment_content": "1. IT auditing <br />2. IT governance<br />3. SDLC<br /><br />he kept saying 'IT auditor mindset' but it's just his mindset...",
            "comment_teaching": "1. his notes are a mess<br />2. no model answers for any exercise at all. some are just ridiculously subjective when he tried to explain the solutions. <br />e.g. a question asking if that case study is a major risk. his answer is yes because you are IT auditor.... No evidence support. or what you can say is what he thinks is evidence...<br />3. ppt skills are shit too but he thinks he did well",
            "comment_grading": "only 3 inclass exercise, 3 case studies<br />but again, grading and answers are sooo subjective.",
            "comment_workload": "light, no exams<br />but if you want to secure better grade, don't take it.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "8660qt9zMANFU8BTeW1ZlUcnlubEPHB8",
                    "name": "2020Winter_ISOM4100_syllabus_v1d",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "0n44qePEo9X15v7f4edRWbCfORSQkfto",
            "semester": "2020-21 Winter",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Stress",
            "date": "Jan 21, 2021",
            "title": "Useful course but ruined by the professor",
            "comment_content": "Introduction<br />Business Objectives, Risks and Controls\t <br />IS Auditor's Mindset<br />IS Auditing Process <br />IT Governance<br />SDLC",
            "comment_teaching": "Worst Prof ever<br />Unclear presentation so many students asked questions every class which used up many lesson time.<br />Questions made by him are always suspicious, unclear and students always misunderstand his meaning with marks deduction.<br />His model answers for assignments are not making sense.<br />Bad time management. <br />Give us practice (not counted to wards grades) after in-class-ex (count towards grade) wtf?!<br />He is the only professor teaching this course. If not compulsory for ISA option, won't choose this course.",
            "comment_grading": "A.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case (x3)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(Group and Individual)\t55%<br />B.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;In-class exercise (x3)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(Individual)\t1\t45%<br />Case:<br />Presentation group(as presentation students)<br />- Detailed analysis<br />- Case presentation\t\t 35% (max) in total<br /><br />Other students (Individual)(as participation students)<br /> - Answer case questions 10% (max) <br />- Participate in case discussion (2% max)",
            "comment_workload": "Not much when comparing with other win sem courses.<br />High workload for the group presentation only.<br />3 case study and only one will be assigned as group work to present in a video.<br />2 in-class-ex",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wMeZ8I6MaQh9uTKmiHUGossdoLBAXB3W",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "WantGoodGrade!",
            "date": "Jan 04, 2021",
            "title": "",
            "comment_content": "CISA topics, I would highly prefer you take ISOM4300 first cuz Percy would provide you with the basics.<br />Don't expect you will learn much from this course or rely on this course for your CISA prep.",
            "comment_teaching": "Rubbish.&nbsp;&nbsp;<br />Idk how to say, just risk and control and vague IS auditor mindset all the time.&nbsp;&nbsp;When he told you the model answer, don't trust it 100% cuz he will give that answer a zero mark next time.",
            "comment_grading": "All u need is good group-mates (he will divide the group for you).<br />I did not score really well in exam, above &lt;1 SD but my projects and in-class are okay.<br />Overall: 88%-90% got an A",
            "comment_workload": "OK la workload.&nbsp;&nbsp;just the in-class ex a bit annoying, others okay.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "q9Zg5dZ6ZWhGO2RlMuOWaFZ42MuHPwFY",
            "semester": "2018-19 Winter",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "msdaydream",
            "date": "Feb 03, 2019",
            "title": "",
            "comment_content": "IT governance <br />System development life cycle<br />Basically the first three domains in your CISA guide<br />Better buy the manual for reference",
            "comment_teaching": "Detailed teaching which requires you to jot down what he has said<br />Gets boring till the end<br />Taught in a rush since he spent most time in the first domain",
            "comment_grading": "Easy to achieve full marks for in class exercises ks he sometimes gives us tips",
            "comment_workload": "Heavy workload for winter semester<br />3 Case studies, 1 where you will be working as a group and the rest are individual work<br />Choosing right group mates is the key to success<br />1 Midterm 1 Final<br />3 in class exercises, super light workload if you have helpful group mates",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "leztdDvMvovqgy4XFVynFbGu3wXYWEl0",
            "semester": "2021-22 Winter",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sfvpcwl",
            "date": "Feb 09, 2022",
            "title": "Surprisingly good IS course!",
            "comment_content": "1. IT auditing<br />2. IT governance<br />3. SDLC<br />The topics are highly related to CISA exam. And it is appropriate and beginner-friendly since Professor did not use a lot of terminologies. The course itself is informative and entertaining to take.",
            "comment_teaching": "Professor taught excellently. Not only did he spend time reviewing concepts that could be confusing, but also allowed us to have breaks. It is so considerate given the fact that the duration of winter courses would be nearly 4 hours. <br /><br />Besides, he encouraged us to think and reflect on the concepts, and he ensured us to have a thorough understanding of each and every new concept.",
            "comment_grading": "The grading is generous and out of my expectation! <br /><br />No attendance required!!<br /><br />He counted the best 2 out of 3 in class exercise, so even if you failed/miss one, it does not really matters. They are super easy as the professor offered the hints explicitly in the lectures. As long as you attend the lecture, you would be guaranteed to score great! (Even if you missed some, the review session provided by the professor is way beyond enough for you!)<br /><br />There are rumours saying the assignment is exhausting, but it is not in my cases. Of course you and your teammate need to spend enough time on it. But the professor would certainly recognize your effort and reflects on your score.<br /><br />Due to the COVID, the final exam changed to be online. The questions are similar to the assignment (which he also mentioned couple of times during the lecture so no surprised questions), and they are pretty straightforward.<br /><br />Would update the actual grade after annoucement.",
            "comment_workload": "Light workload for winter class<br />3 in-class exercises (~just 20 - 30 minutes each, with mostly MC)<br />1 group assignment<br />1 Final",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ly0ZL60F12M3D600zT2M35IsXb4vvdMK",
            "semester": "2021-22 Winter",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "thking2727",
            "date": "Jan 26, 2022",
            "title": "ISOM4100",
            "comment_content": "IS auditing <br />identify risk <br />recommend control<br />SDLC",
            "comment_teaching": "Detailed and patience<br /><br />He will spend many time on explaining the IS auditing mindset and explain the risk identification process and control recommendation repeatedly to make sure students understand. Although some of the answers from students may not be the model answers he wants and it will affect the final grade. However, he is generally nice in teaching.",
            "comment_grading": "Dont know. No attendance required<br /><br />30% in class exercise (15% x2)<br />40% final exam<br />30% assignment",
            "comment_workload": "Not high, 1 assignment + 1 online presentation<br />3 in class exe (count 2 highest)<br />1 final eam",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "scwtcYUOcPXbHjUTgA2dE6OGMJWG1AZ5",
            "semester": "2020-21 Winter",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Casssuper6",
            "date": "Jan 26, 2021",
            "title": "W__ I am learning",
            "comment_content": "IS auditor mindset<br />IT goverence <br />SDLC",
            "comment_teaching": "1. note so confusing, his explaination even more confusing<br />2. Giving practise after the graded inclass exercise!?<br />3. Word limit in every question, every time need to do word count, most of the test time used to cut wordings and have not wnough time to do the in-class exercises<br />4. He keep speaking during the inclass exercise, too disturbing but have no way to keep the audio on. Want to turn off the mic but afraid missed sone important announcment",
            "comment_grading": "Don’t know",
            "comment_workload": "Not heavy only 1 presentation, 2 assignments and 3 in-class quiz",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}