{
    "error": false,
    "course": {
        "id": 1551,
        "subject": "LABU",
        "code": "2060",
        "name": "Effective Communication in Business",
        "description": "The course activates students' previously acquired English language skills into a useful managerial communication toolkit targeted toward specific business applications and strategies. Students will learn how to be an effective communicator in the global workplace. The course is designed and structured to address the learning needs of students in job-seeking and in their early careers. Students will have opportunities to learn and practice how to succeed in business writing, presentations, interviews, meetings, and collaborative assignments. The course also introduces students to strategies for handling the communication challenges which fresh graduates can expect in the global workplace. For students who have this course as a program requirement.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710
        ],
        "prerequisites": "CORE 1403 OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1404\" href=\"/review/CORE1404\" target=\"_blank\">CORE 1404</a> OR LANG 1003 (prior to 2022-23)",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"LABU\" data-code=\"2020\" href=\"/review/LABU2020\" target=\"_blank\">LABU 2020</a> (prior to 2019-20)",
        "rating_content": 3.71,
        "rating_teaching": 3.8,
        "rating_grading": 3.67,
        "rating_workload": 3.55,
        "review_count": 51,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 428,
                "name": "SIN, Kathy Mun Yee",
                "count": 7
            },
            {
                "id": 294,
                "name": "LAM, Levi",
                "count": 5
            },
            {
                "id": 408,
                "name": "GASKELL, Delian Dawn",
                "count": 5
            },
            {
                "id": 297,
                "name": "LEE, William Wai Lam",
                "count": 4
            },
            {
                "id": 879,
                "name": "WONG, Nick",
                "count": 3
            },
            {
                "id": 1415,
                "name": "SHEN, Chi",
                "count": 3
            },
            {
                "id": 419,
                "name": "KWAN, Yuen Tung Gloria",
                "count": 2
            },
            {
                "id": 421,
                "name": "TANG, Eunice",
                "count": 2
            },
            {
                "id": 466,
                "name": "ENGLAND, Graham James Fisher",
                "count": 2
            },
            {
                "id": 467,
                "name": "CHONG, Doreen",
                "count": 2
            },
            {
                "id": 875,
                "name": "NG, Choi Ping Martha",
                "count": 2
            },
            {
                "id": 1326,
                "name": "MCLAUGHLIN, Rosie",
                "count": 2
            },
            {
                "id": 330,
                "name": "FUNG, John",
                "count": 1
            },
            {
                "id": 417,
                "name": "HUSSIN, Nora Anniesha Binte",
                "count": 1
            },
            {
                "id": 420,
                "name": "LAM, Chak Yan Jessie Teresa",
                "count": 1
            },
            {
                "id": 1763,
                "name": "REWHORN, Thomas Jay",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "qb0HZEj7HRD2FvW34cdju3auzOdZWr6r",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 408,
                    "name": "GASKELL, Delian Dawn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "vickyman",
            "date": "Jan 24, 2018",
            "title": "",
            "comment_content": "There are 3 phases of the course, all aiming to prepare student for job seeking skills or business style of writing and presentation.<br /><br />Phase I (Weeks 1 – 4)<br />- CV<br />- Cover Letter<br />- Digital Portfolio: self-introduction video + CV + cover letter specified for own chosen job ad<br />- Mock Interview: for own chosen job ad<br /><br />Phase II (Weeks 5 – 9)<br />- Impromptu Speaking<br />- Business Writing: for an imaginary startup between a group of 3, 1 student writes the preliminary market analysis, 1 progress report and 1 business plan<br /><br />Phase III (Weeks 10 – 13)<br />- Business Pitch: for the aforementioned startup, basically a compilation of the above 3 pieces of writing<br /><br />The contents themselves are useful and applicable in real-life, but frankly speaking you need quite a good solid foundation of English to be able to handle the course well since it heavily demands on English writing and speaking.&nbsp;&nbsp;Not sure if it's just cause Delian is Canadian or does it apply to other sessions too, the entire course is conducted in English so even if you know the content well in Chinese it wouldn't help much.<br /><br />The course itself is designed for senior year students as technically it prepares you for working in the society, I would not recommend it for junior year students especially freshmen as you could make better use of this course if you take it in your later years, and that you won't have much to put in your CV or even cover letter, making it difficult to score well in phase I.",
            "comment_teaching": "Delian is a nice teacher.&nbsp;&nbsp;Her PowerPoints are easy to refer to when working on assignments and her explanations are very clear.&nbsp;&nbsp;You will not fall asleep in class as they are packed with content and often requires interaction with her or other students.&nbsp;&nbsp;<br /><br />For tasks that require speaking, ie. the mock interview, impromptu speaking and pitching, there were quite many opportunities given for each and everyone of us to practise in class so don't worry too much even if you're not good at public speaking.",
            "comment_grading": "- 10% Digital Portfolio (including CV, cover letter and self-intro video)<br />- 10% Mock Interview<br />- 15% Impromptu Speaking<br />- 25% Business Writing <br />- 25% Business Pitch (Team and Individual)<br />- 5%&nbsp;&nbsp;&nbsp;Peer Evaluation<br />- 10% Participation (80% min. attendance)<br /><br />You get your groupmates assigned for the imaginary startup, there are components in your marks assigned for the coherence of your business writings as well as overall presentation of the business pitch, on top of your individual performance, so Good Luck if your groupmates are hea.",
            "comment_workload": "Requires quite a lot of writing, schedule a bit tight especially towards end of semester<br /><br />- Digital Portfolio: CV, 1 page A4 cover letter, 5min self-intro video<br />- Mock Interview: no preparation outside of class required<br />- Impromptu Speaking: no preparation outside of class required<br />- Business Writing: 1500 words<br />- Business Pitch: 15page PowerPoint + 16min presentation<br /><br />Worst part is that you have to come up with an &quot;innovative idea&quot; for the imaginary startup in order to proceed with your business writing and pitch, that was quite time consuming.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 8,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "owsBMnxHydaLudtTAfZ0Do8hgEFxgrbe",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 879,
                    "name": "WONG, Nick",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kabul",
            "date": "May 26, 2020",
            "title": "",
            "comment_content": "💬 Job Interview (Weeks 1 - 4)<br />Mainly on how to draft your CV, and how to answer commonly asked questions in the interview. It's a 8-min one-to-one interview with your tutor.<br /><br />💬 Impromptu Speech (Weeks 5 - 7)<br />A 3-min pitch on leadership and teamwork delivered to your colleagues in a social enterprise during a staff retreat.<br /><br />The setting is weird cuz you have to improvise while standing from an unfamiliar perspective as a colleague in a social enterprise, instead of a student. So talking about your own experience may not work out that well.<br /><br />💬 Pitch Presentation (Weeks 8 - 13)<br />A 15- to 20-min group presentation (5 min for each group member) on a social innovation idea to a selection panel comprising of your senior management and external investors.<br /><br />✏️ Business Writing (Weeks 8 - 13)<br />A 1200- to 1500-word business plan on the social innovation, including market opportunity, market analysis, execution, management, timeline, financial plan, recommendations, basically everything you'd need in a business plan.<br /><br />I'm still wondering how I could stuff so many sections in merely 1500 words.",
            "comment_teaching": "Nick is nice, and really more than happy to offer help and give you suggestions. You can reach out to him for extra consultation sessions for your presentation and writing. Also very nice of him to allow one or a few practice rounds before the real oral assessments.<br /><br />But even though with the extra practice rounds I still screwed up. 😭",
            "comment_grading": "Applied for P/F, but I think I screwed up. It could be (one of) my first C range awaiting for me if I didn't go for P/F.<br /><br />💬 20% Job Interview<br />💬 15% Impromptu Speech<br />💬 25% Pitch Presentation<br />✏️ 25% Business Writing<br />👍 5% Peer Evaluation<br />💬 5% Participation<br /><br />I really hate Zoom / video recording in front of my laptop. Feels weird and really hard to do well in front of the webcam, e.g. maintaining eye contact and body gestures in front of webcam. <br /><br />Just like other LANG courses the grading would be super harsh with only around 3 out of 18 students in class getting A range.<br /><br />One more thing - getting A's in previous LANG courses doesn't mean you'll also do well in this course. Previous LANG courses are all about things in an academic setting, but in this LABU course you need to pack and present yourself well.",
            "comment_workload": "Super heavy workload, especially if your group mates are &quot;chur&quot; and want perfection for everything. Also partly because my group literally had meeting madness - turning down what was confirmed previously, spending too much time on the specifics, and then forgetting the big picture. All sorts of these happen when you have highly motivated group mates, but obviously these things could harm at the end.<br /><br />On the other hand, if your delivery is good you don't quite need to dedicate a lot of efforts to ace the course.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Y02etXm5CUg9Xw02Lc92wr8qJF4HxasI",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 297,
                    "name": "LEE, William Wai Lam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "卡斯",
            "date": "Nov 22, 2018",
            "title": "Required course but content is not that useful",
            "comment_content": "The content is for finding a job which can be helpful if you didn't do any preparation before.<br />The second part is more related to a real business context.",
            "comment_teaching": "William is quite hea.<br />But you can enjoy his accent:)",
            "comment_grading": "I have never received a C range in UST course.<br />I got 5/7 in each assignment and never skip the lessons. So i am quite confused why did he give me a C",
            "comment_workload": "Workload is quite acceptable<br />You have project related to selling your 'company' to the audience.It involves presentation and business proposal writing.Not that difficult.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "s6cxhELjhYmeSelDXughqszm2je8Sroq",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 428,
                    "name": "SIN, Kathy Mun Yee",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "L7E2O9",
            "date": "Jun 04, 2021",
            "title": "swap when you see her",
            "comment_content": "job interview (20%)<br />impromptu speech (15%)<br />pitch presentation and business writing (25% + 30%)<br /><br />Peer evaluation: 5%",
            "comment_teaching": "She is the most hea tutor in this course because she never gives constructive feedback and expects you to know everything before lesson. More unreasonable is she is not willing to give you resources and expect you to perform well. WLTF<br /><br />She always has a poker face and never smiles which disgusts me a lot. Boring teaching and explain everything very briefly. <br /><br />One more thing is if she has a bad impression on you, be prepared to receive broken grade.",
            "comment_grading": "My performance: <br />job interview: good-very good, good to very good, very good<br />impromptu speech: all good<br /><br />Pitch presentation: unknown<br />Business writing: unknown<br /><br />Final grade: B-, WLTF<br /><br />She is pretty harsh in grading as my classmates and me never get 'excellent' on her hands. Unlike my friend who studies another session and got lots of 'excellent'",
            "comment_workload": "well, basically not much workload if you have prepared your CV well and have participated in any case competitions before, if not, better not reg this course. <br /><br />Even if you joined case competitions and have decent CVs, this is no guarantee you will get a good grade in this course because you don't know what they expect.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dYjQcLVHKhlBKlTVB7J0XdPdC8pAFheW",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 297,
                    "name": "LEE, William Wai Lam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "uststressed",
            "date": "Oct 15, 2018",
            "title": "",
            "comment_content": "Three Phases:<br />1. Job seeking: (most useful part for me)<br />- CV, Interview, cover letter<br />2. Business writing and communication<br />- more teaching you on how to write business ideas, communication etc (impromptu speech)<br />3. Business presentations<br />- now to pitch an idea and group project would be done",
            "comment_teaching": "William is such a nice teacher with nice accent. (He is a BBC if I remember it right). Most of the content taught are helpful, especially those for interview and CV etc. (remember to keep all the notes for future use). <br />He provided a lot of guidance on the final essay which are quite helpful. But after all the essay was not too difficult.",
            "comment_grading": "Not sure my grade for the essay<br />Generally above average for most of the tasks<br />Only missed 1 or 2 lessons<br />generally a very good grade <br />got an A eventually.",
            "comment_workload": "If you have taken 2040, then you will realise 2060 is heaven. In 2040, there were 2 reports and 2 presentations. But for 2060, the was only one presentation (plus an impromptu speaking, which no preparation is needed).<br />For the interview, just try all the questions in the ppt, then you will be fine.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "60YlbM1ARbCTktRz0Vd84dfpuocQeOnj",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1415,
                    "name": "SHEN, Chi",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "kkkkkkkkkkk",
            "date": "Jun 05, 2023",
            "title": "Not good grading and teaching",
            "comment_content": "Like other comments, this course helps students to build up career related skills such as writing CV, preparing for a job interview and writing business proposal and presentation. These contents are quite useful for you to prepare your intern interview and grad job May relate to the following grading system.<br /><br />Individual Job Interview 25%<br />Business Writing 5%<br />Business Plan 30%<br />Assessed Business Pitch 30%<br />Peer evaluation 5%<br />Learning Portfolio 5%",
            "comment_teaching": "I am sorry to say that she is poor in teaching. She always ask us to do some task in a online platform called padlet. Requiring us to record our speech or video on it. However, she give little comments and suggestions on our work. I tried my best to focus on her lesson, but her teaching is so boring and unorganized that I could hardly catch up.<br /><br />Besides, In the assessed business plan and pitch, she didn't give clear clarification on the required things in these task and we are lost and very stressed about the group project. Moreover, she do not really give constructive comments on our plan and writing, even if she do so, the comment would be given on the day you need to submit your assignment. I cannot understand why she can expect us to finishing amending the group homework within one afternoon. As I tend to submit the work a few days earlier, thus she really stressed me out...<br /><br />As the others said, she always smile and seems to be nice and kind. But, I feel that she is not really smiling truthfully, but just acting to be a kind but infact horrible person.",
            "comment_grading": "The grading is not good. She has great bias and favour those who frequently talk and email her after class. I got A- in 2040 but a B in 2060.",
            "comment_workload": "She always ask us to do extra presentation before class which might take a lot of effort. Many group discussions are expected with ambigous theme in each discussions as her questions are not clear and well organized.",
            "rating_content": 5,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FbGuBwAmwQRcaVqVpsGg05esgl8iteix",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 408,
                    "name": "GASKELL, Delian Dawn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "aaronic92351",
            "date": "Aug 18, 2021",
            "title": "Considerate instructor with great teaching!",
            "comment_content": "Contents are similar to previous semesters, just slight changes in the % allocation of the assessments.<br /><br />Phase I: Effective Communication in Job-Seeking<br />1. Assessed Job Interviews (20%)<br /><br />Phase II: Effective Communication in Impromptu Speaking<br />2. Assessed Impromptu Speech (15%)<br /><br />Phase III: Effective Communication in Pitch Presentation and Business Writing<br />3. Assessed Pitch Presentation (30%)<br />4. Assessed Business Writing - Business Plan (30%)<br />5. Peer Evaluation (5%)<br /><br />The skills learnt in Phase I and II are quite useful for job seeking, yet the reality may be different from framework of the assessed tasks.",
            "comment_teaching": "Delian is a very considerate and passionate teacher. She were able to make every lesson interactive. She usually starts the lesson with a 5-min breakout discussion, where we were paired up to chat whatever we wanted and she wouldn't join and intervene. She is a very open-minded person and loves everyone to share about the things we did during weekends.<br /><br />She did a great job in dividing each lesson into parts, where there was appropriate time given for each part. The tasks given were fruitful, in which sometimes I didn't even realise the lesson has ended without her mentioning it.",
            "comment_grading": "My scores:<br />Assessed Job Interviews<br />Task Fulfilment: Very Good<br />Delivery (Visual) : Very Good<br />Delivery (Verbal/Vocal): Good to Very Good<br /><br />Assessed Impromptu Speech<br />Task Fulfilment: Very Good<br />Delivery (Visual) : Very Good to Good<br />Delivery (Verbal/Vocal): Very Good to Good<br /><br />Assessed Pitch Presentation<br />Task Content: Very Good<br />Delivery (Visual) : Very Good<br />Delivery (Verbal/Vocal): Very Good <br /><br />Assessed Business Writing - Business Plan<br />Task Fulfilment: Very Good to Good<br />Organization &amp; Structure: Very Good<br />Use of Language: Very Good to Good<br /><br />Final grade: A-<br /><br />Delian said that she uses absolute grading, so I guess the grading is fair.",
            "comment_workload": "There was a bit of workload as Delian gave homework for every class as progress check. Yet she wouldn't force you to submit anything that was not assessed, just make sure that you can follow the pace of the lessons.<br /><br />For Job interviews and Impromptu speaking, there were practice rounds during lessons.<br /><br />For the Pitch presentation, make sure you find responsible teammates so that your group can evenly divide the workload. <br />It would be quite demanding for the last 2 weeks of the semester, as you have to record a video submission for the pitch, and to write a business plan (individually) for the pitch ideas.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tSvV6yfhE0RrUYAXu5A35QiYNkBIjdfr",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 467,
                    "name": "CHONG, Doreen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "heungyatc",
            "date": "Aug 09, 2021",
            "title": "A fair course",
            "comment_content": "There are no homework, but you will need to finish 3 assessments: <br />1. A mock interview <br />-mainly talks about how to write a CV and how to prepare for a job interview<br /><br />2. Impromptu Speech <br />-you will be given a topic and give a speech about it immediately after a 3 minutes preparation time<br /><br />3. A Business Proposal &amp; Presentation<br />- you need to make a 15 minutes presentation (group work) and hand in a 1200 to 1500 words proposal (individual work)",
            "comment_teaching": "Doreen is a nice person who is willing to answer all types of questions and always tries to help students in different ways. However, her lessons could be boring to some extend, mainly due to the course contents itself.",
            "comment_grading": "Doreen provides a sweet grading. At first, I thought I would got a C+ or B- as I stuttered quite a lot during my speeches, but it turn out that I got a B for the final grade, fair enough I would say. (P.S. Don't think that it is easy to get an A- or above in UST, the students could be crazier than you can ever imagine.)<br /><br />I know that it may not be convincing for me to give tip for you guys for getting a better grade, but if you sound confident and relax in your speech, you definitely would get a B at least (Just from my own experience),",
            "comment_workload": "Fair workload. You won't need to prepare much for the first two assessment. For the final task, the workload won.t be heavy if you have good teammates, the written proposal is just copy &amp; paste of the contents in the presentation, so you won't need to prepare twice for the final assessment.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tatXJEbwUDZyp8F0gs8JpN6z94KcmLB1",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1326,
                    "name": "MCLAUGHLIN, Rosie",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "vino",
            "date": "Jan 11, 2021",
            "title": "Terrible Instructor",
            "comment_content": "There are 3 phases of the course<br /><br />Phase I<br />- CV<br />- Accessed Interview<br /><br />Phase II<br />- Accessed Impromptu Speaking <br /><br />Phase III<br />- Accessed Pitching<br />- Accessed Business Plan<br /><br />Contents are useful. Won’t help with real life job hunting",
            "comment_teaching": "She is way too strict with way too many requirements and way too many out of class activities. Everyone is the group is tired of her endless demanding requirements.<br /><br />Please be prepared for tons of activities that are not graded.",
            "comment_grading": "She enjoys giving C range",
            "comment_workload": "Terrible workload. Extremely heavy out of class and UNMARKED BUT COMPULSORY tasks (yes unmarked). Out of class activitiessssss as mentioned.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "U7UbU0TVzQnjyHr5rDqGWCcI0gfS8tuX",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 408,
                    "name": "GASKELL, Delian Dawn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tony Stark",
            "date": "Jan 19, 2019",
            "title": "",
            "comment_content": "Consists of Digital portfolio, impromptu speech and business writing.<br />Many ppt slides with abundant information, but found it quite difficult to actually apply it during assessments",
            "comment_teaching": "Very nice and considerate personality. You can ask her many questions and even go up to her office for further advice. Very open attitude towards students and prefers a talkative atmosphere where students actively present&nbsp;&nbsp;their opinions",
            "comment_grading": "However, I would not say her grading is as nice. You have to put in a lot of effort into each of her assessments and still a good outcome is hard to get.",
            "comment_workload": "A lot of workload. It may vary by person, but for me impromptu speech and business writing was a tough workload.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hm8KQL1J7eQ8rrLBrww5eUvopaegzIKK",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 428,
                    "name": "SIN, Kathy Mun Yee",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "zhraz6",
            "date": "Jun 09, 2023",
            "title": "快走",
            "comment_content": "- Job interview<br />- Pitch presentation<br />- Group business plan",
            "comment_teaching": "Hea as fuck, only asks us to discuss in groups and sometimes answers our questions<br />Especially my class has adopted blended learning mode, 0 instructions regarding business pitch and business plan, our group had to search for all the canvas documents (messy as fuck as well) to know what to do, we don't even know how long the pitch should be<br /><br />Super hea feedback session, not even sending us our score sheets, need to zoom screenshot ourselves<br /><br />No buffer and saying that she cannot extend peer evaluation deadline (bruh other instructors could)<br /><br />Not replying my email when I have further query",
            "comment_grading": "FYI I got B in previous labu course that my English is not that shit, and my class is all locals (no big comparison)<br />But it seems that she only knows how to give &quot;Good&quot; or &quot;Good&quot; is her maximum in grading, even if she only raised 1-2 improvements in the mark sheet I only received &quot;Good&quot;*N<br />No idea about our business plan performance as she did not give us any comments or feedbacks after we hand It in<br />I missed the peer evaluation and eventually got C+",
            "comment_workload": "Ok la no extra work as she's lazy as fuck, just normal labu workload",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eIwPJawePb9PG4jBmTfeEaD3vbCzwzoJ",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1415,
                    "name": "SHEN, Chi",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ustisfun",
            "date": "Jan 08, 2023",
            "title": "Horrible course, horrible grading",
            "comment_content": "No use. If you're an average business student you should've already have your CV, job interview etiquette, and presentation skills ready. You wouldn't be able to gain anything from this course so don't expect anything.<br /><br />The PPT and course materials given by CLE department is badly arranged. The slides are messy, long, and lack focus. By the way CLE sucks and doesn't care about the grading of students - they even made the gradings less lenient for LABU 2060 this semester if you don't know",
            "comment_teaching": "Mid. We oftentimes fall asleep and do other stuff during her lessons. Didn't expect much though. She seems nice but prolly 笑裡藏刀 LOL",
            "comment_grading": "Jesus christ, B+. My Pitch scored 5-6-6 and my Biz Plan was 5-5-5. Writing not sure.",
            "comment_workload": "Average LABU workload (which is actually quite a lot)",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "c6r11j6FHSdHUk6tUQqJL7Lg3avF9TpN",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "feitse",
            "date": "Aug 25, 2022",
            "title": "",
            "comment_content": "job interview:<br />Find a job position online and get assessed through a mock interview for that job<br /><br />Speech:<br />Just a casual speech to present yourself<br /><br />pitch presentation:<br />Make a business pitch about your own team company idea, make analysis and financials to support <br /><br />individual business report<br />Write a report about your team company to further elaborate about your idea",
            "comment_teaching": "Sylvia Hon<br />Canvas materials are all over the place<br />Didnt really know what are we doing throughout the whole semester<br />Just stick to the reminders and guidelines and hand in all the work on time",
            "comment_grading": "job interview: good<br />impromptu speech: good<br />pitch presentation: ok<br />individual business report: very good<br /><br />B",
            "comment_workload": "Not that bad<br />Many projects and speeches need to prepare<br />No exam",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nFGSTrHiqHzUOrVMuOfXZf6CBF3pd1S6",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1326,
                    "name": "MCLAUGHLIN, Rosie",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jik",
            "date": "Aug 23, 2022",
            "title": "Your effort will pay off",
            "comment_content": "job interview<br />impromptu speech<br />pitch presentation<br />individual report",
            "comment_teaching": "she is nice and helpful<br />always willing to answer questions <br />provided a lot of info for impromptu speaking and sample ppt/ report for group presentation &amp; project<br /><br />many opportunities for you to speak up and group discussion (mainly for you to practice your cv interview with each other)<br /><br />she really did her works with heart and passion: <br />-she made a report to every student with details after the job interview assessment<br />-provided useful insight to your group project and your individual report (not just keep challenging you)",
            "comment_grading": "fair grading<br /><br />job interview assessment: gd + gd + gd<br />impromptu speech: gd/v. gd + gd + gd<br />pitch: dk<br />report: dk<br /><br />final grade: B+",
            "comment_workload": "high workload<br /><br />many out of class activities (not graded for your practice only)<br /><br />better dont get a free-rider for your pitch<br /><br />rlly your effort will pay off",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XpRkzhcwd6Idp7wCUreZGBnkubZjW9sx",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Ccystance",
            "date": "Aug 20, 2022",
            "title": "REWHORN, Thomas Jay",
            "comment_content": "- zoom class <br />- syllabus:<br />Phase I<br />1.&nbsp;&nbsp;Job-seeking<br />You are required to attend a 10-minute job interview for a job they have chosen.<br />Individual 25%<br /><br />Phase II<br />2.&nbsp;&nbsp;Business Writing<br />You will be working in a team of 3 on a group project. You will:<br />•&nbsp;&nbsp;&nbsp;&nbsp;produce 2 short writing tasks (Opportunity and Innovation Section and Market Analysis Section)<br />•&nbsp;&nbsp;&nbsp;&nbsp;submit an 1800-word business plan after giving the business pitch.<br />Team 5%+ individual 30%<br /><br />3. Pitch Presentation<br />Your team will give a 15/ 20 minutes’ pitch on the group project to a mixed business audience.<br />Team + Individual 30%",
            "comment_teaching": "I am not sure about other instructors but he mostly follows the ppt throughout the whole semester. He would give comments on your work before you finalize your work and they can be pretty useful.",
            "comment_grading": "His grading is fair, not too harsh but not lenient. He gives similar grades to a number of students. You could get better grades if you are obviously outstanding or you put enough efforts. I got GOOD for the job interview and group presentation and VERY GOOD for the individual report, A- at last.",
            "comment_workload": "There are an assessed job interview (10 mins), a group presentation and an individual report (kinda like a written version of your presentation) <br />- No big workload<br />- Try your best to apply the rules and guidelines stated in the assessment criteria, you may also take reference on good examples (but do not copy from that) <br />- Work well with your groupmates (assigned) so you can write a creative and well-constructed business plan",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RQ7uHIfGsVPcgKYkWAJ6zD9hwkEGmtBq",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 428,
                    "name": "SIN, Kathy Mun Yee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "旻了",
            "date": "Feb 08, 2022",
            "title": "",
            "comment_content": "The content is great and practical, including handy interview skills. I find it useful and I personally suggest you take the course in year 3 or before so that you could get some preparation for your internships.",
            "comment_teaching": "Kathy is very chill actually, especially during the online mode. We always spend about half an hour in the breakout room and normally she doesn't care about what you are talking about. And you and feel free to speak up in her class, she is open to any answer and willing to chat with you.<br />The class environment is chill.",
            "comment_grading": "I got an A for this course.<br />For most assessments, I got the second level of the mark.",
            "comment_workload": "The workload is acceptable and lighter than I think.<br />If you have any interview or internship experience, you may find this course really easy.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Uqj95W5iBth9667C1tA8sDGE3h7ztTgT",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 297,
                    "name": "LEE, William Wai Lam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "save_my_CGA",
            "date": "Jan 24, 2022",
            "title": "",
            "comment_content": "- Job Interview: participate in a job interview for a position you have chosen<br />- Pitch Presentation: pitch in front of the selection committee to convince them to invest in your innovation for your chosen social enterprise<br />- Business Writing: submit a business plan for your innovation presented<br /><br />Had quite much expectation for the first module but later disappointed as not much time and effort were spent on job interview practice but focused mainly on CV.<br />For project, do think carefully about the company you choose cuz it will affect a lot the amount of research you can do and financial plan.",
            "comment_teaching": "Quite chill with nice accent.<br />Not just teaching you but give time for group discussion and will go to specific groups if you need help.",
            "comment_grading": "Assessment criteria:<br />- Assessed Job Interview (Individual, 25%)<br />- Assessed Pitch Presentation (Team &amp; Individual, 30%)<br />- Assessed Business Writing (Individual, 30%)<br />- Leadership and Teamwork Evaluation (Individual, 5%)<br />- Learning Portfolio (5%)<br />Score given based on performance descriptor and claimed to be assessed by not only your own course instructor but other instructors as well.",
            "comment_workload": "Workload quite acceptable.<br />The business writing sounded long at first but when you will realize you wish you can write more.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pYpkybUk7qlWyOlnu7GCSqXeejoYWx1z",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 297,
                    "name": "LEE, William Wai Lam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jjun99",
            "date": "Jan 22, 2022",
            "title": "labu 2060 class",
            "comment_content": "Content is very good for people to prepare for their job exploration.",
            "comment_teaching": "such a nice professor. <br />But he usually points out a specific person to answer his question and wants everyone to participate in class. <br />So it might be hard to freely answer his question.<br />He gives such specific comments, especially to the interview assignment.",
            "comment_grading": "I expected a higher grade but maybe the professor's expectation level was higher than I thought.",
            "comment_workload": "it requires a lot of teamwork and thus a good team is very important. The team will be randomly designated.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HjlP7hsW1HjzxCHLRNu5beG31BoNHDUi",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 294,
                    "name": "LAM, Levi",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "wantgoodgrade",
            "date": "Dec 25, 2021",
            "title": "",
            "comment_content": "useless. The course is useless and it is such a waste of time to attend it. I don't know what is the meaning of taking this course apart from fulfilling major requirements. Finding a video online can even learn more than what I have learnt in this course",
            "comment_teaching": "hea and bad",
            "comment_grading": "very bad grading. Even you pay effort, you may still end up with bad grades. SUBJECTIVE COURSE AND LUCK IS VERY IMPORTANT !!! Most people get bad grades. He enjoys giving C RANGE and he is a very cunning person too.",
            "comment_workload": "heavy and bad grading<br />Job interview<br />Business pitch<br />Business report",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "772jWaHm7CaUBo2VsYMjQZ4arvrttQnb",
            "semester": "2020-21 Winter",
            "instructors": [
                {
                    "id": 879,
                    "name": "WONG, Nick",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "busi trash",
            "date": "Aug 30, 2021",
            "title": "Nick Wong is a good tutor",
            "comment_content": "see others",
            "comment_teaching": "First of all, it's super chill. WE DONT EVEN NEED TO TURN ON THE CAMERA (on a lang course). Nick won't point someone's name to answer the question which makes me feel relaxed.<br />Nick won't tell everything with all details. He loves to tell us the key concepts and leaves the questions for us to apply it.<br />I can tell Nick really wants us to gain something, not only for the grades. Nick would use Cantonese to give us feedback. He's a nice guy, 同埋黃&amp;好貼地",
            "comment_grading": "The grading is surprisingly good!!<br />I only know my grade of the first assessment(around the lowest), and I don't think I performed well in the following assessment(my english is poor as u might notice from this review), but I still got a B-.<br />The reason i write this review is mostly becuz i have to show some support to Nick:)<br />Lots of ppl said Nick is killer, in fact Nick is nice, warm and good grading.",
            "comment_workload": "The workload is not heavy.<br />For the first two assessments, u actually have not much to prepare.<br />For the last assessment, the workload depends on how good you want your grades to be. It's not difficult to finish everything cuz it's very similar to a marketing project (we literally just copied the idea from the marketing project I've done in my marketing course before). However, I'll say Nick is even more professional than my marketing prof. He asked a lot of questions deeply (on consultation) and we really need to do a lot of research to support our plan.<br />Overall the workload is light",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tLdrxisnMvjzMd2ooErvd7xM27EJSU2b",
            "semester": "2020-21 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Someoneintheuni",
            "date": "Aug 17, 2021",
            "title": "Might be helpful if you have 0 job hunting experience",
            "comment_content": "It's a really functional course which teaches you how to write a CV and cover letter, prepare for an interview, and how to give a public speech in a working environment. Yet since it's a generalization for most of the business jobs and roles, it might not fit each students' career needs perfectly.<br /><br />The following is from the course syllabus:<br /><br />Phase I: Effective Communication in Job-Seeking&nbsp;&nbsp;(Weeks 1 – 4)<br />You will learn how to apply theories and strategies of effective communication to create a positive first impression through compiling your CV and participating in performance-based assessments in a job-seeking context.<br /><br />Phase II: Effective Communication in Impromptu Speaking (Weeks 5 – 8)<br />You will learn and practice how to communicate with people within an organization through giving impromptu and persuasive presentations.<br /><br />Phase III: Effective Communication in Pitch Presentation and Business Writing&nbsp;&nbsp;(Weeks 9 – 13)<br />You will learn and practice how to write to achieve business objectives and communicate persuasively to an internal and external business audience.",
            "comment_teaching": "Due to COVID-19, the class was totally online. It was more like a lecture rather than a tutorial. Even the instructor asks questions sometimes, the class was not delivered in a very interactive way.",
            "comment_grading": "The grading is fair, but 30% comes from a group project so you might consider teaming up with friends before enrolling in a section.<br /><br />Assessed Job Interview (Individual, 20%)<br />Assessed Impromptu Speech (Individual. 15%)<br />Assessed Pitch Presentation (Team &amp; Individual, 30%)<br />Assessed Business Writing (Individual, 30%)<br />Leadership and Teamwork Evaluation (Individual, 5%)",
            "comment_workload": "Besides the assessment listing in the grading part, there're no additional assignments or take-home tasks. The workload is fine but personally, it just doesn't worth the time since it's not very helpful for my career.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hEISP0szHPtrkQEP18mcmsXJqA1vJTtv",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 466,
                    "name": "ENGLAND, Graham James Fisher",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "teehee",
            "date": "Aug 16, 2021",
            "title": "",
            "comment_content": "There are 3 phrases in this course. The content is more practical than LABU 2040. Skills can be applied at the workplace.<br /><br />Phase I: Effective Communication in Job-Seeking&nbsp;&nbsp;<br />Assessment Tasks:<br />- Job interview<br /><br />Phase II: Effective Communication in Impromptu Speaking<br />Assessment Task:<br />- 3-minute impromptu speech<br /><br />Phase III: Effective Communication in Pitch Presentation and Business Writing<br />Assessment Tasks:<br />- Pitch presentation<br />- Business writing",
            "comment_teaching": "Gramham is a great teacher. He is friendly and nice, trying to make his classes interesting and interactive. He is quite energetic in class that would motivate you to pay attention. He is open to feedback and discussion. Yet, he might be irresponsive on email.",
            "comment_grading": "Fair grading, as long as you work hard and ask for feedback:)<br /><br />Job Interview (Individual) 20%<br />Impromptu speech (Individual) 15%<br />Business pitch (Group) 30%<br />Business writing (Individual) 30%<br />Peer evaluation 5%",
            "comment_workload": "Workload is lighter than LABU2040",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IkIo2WdjgjyYEJTQLuCXk1vDmCYCLlNK",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 467,
                    "name": "CHONG, Doreen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "waiyo",
            "date": "Jun 30, 2021",
            "title": "",
            "comment_content": "Can learn some job interview and CV writing skills but don't expect too much. The professor will not spend a lot of time in each topic.",
            "comment_teaching": "Doreen is nice and would like us to answer her questions.",
            "comment_grading": "Very bad in all oral parts, but not bad for some of the written part. The final written part will account for the highest percentage in overall grade. So you should focus on it. For the oral part, I think Doreen is hea marking and may have bias. If you want to get a higher grade, you can participate in class actively and answer all her questions...",
            "comment_workload": "Will be more chur in the first few weeks. There is some oral presentations but you don't really need to prepare for it. The oral questions will be released at the presentation day. So you don't really need to prepare for it.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "es9LGsiaBKYer0VuOFy8qJlUMQ75hhQ7",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 330,
                    "name": "FUNG, John",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "16y39y",
            "date": "Jun 24, 2021",
            "title": "decently useful course",
            "comment_content": "Phase 1: cv &amp; job interview preparation<br />Phase 2: impromptu speaking <br />Phase 3a: business pitch<br />Phase 3b: business plan<br /><br />The contents are generally helpful and relevant to BBA students, but nothing very groundbreaking. The course nicely summarizes things that many of us have already learned on our own, from experiences like case comps, job interviews and other courses.<br /><br />As with any course by CLE, there is a heavier focus on the language aspect than the actual contents (like I felt they were less critical towards the feasibility and creativeness of our ideas), but stricter with the cohesiveness and professionalism of tone.<br /><br />A lot more practical and useful compared to LABU2040.",
            "comment_teaching": "Overall, John is a great teacher (don't know why he doesn't have reviews on here, that's specifically why I wrote one). He is a friendly and nice guy who tries hard to make his classes fun and interactive. He has a great energy that would motivate you to listen in his class. He also answers questions after class nicely is quite responsive on email.<br /><br />His spoken English definitely isn't native, and you can hear some Cantonese accent. But his ability to write in a concise, cohesive and organized manner is very impressive. He once showed us how he rewrote a paragraph from his student's report, which really proved himself to be highly qualified as a LABU teacher.<br /><br />He does, however, tend to be a bit too creative at times. He likes to encourage us to &quot;think out of the box&quot;, and his sample answers to the challenging interview questions are sometimes so creative and unrealistic that HR/recruiters in real life would probably be skeptical of. And quite often he would ever so slightly misinterpret students' answers, but that is not a big issue. <br /><br />He is a fun man and I had quite a lot of fun in his classes. Also appreciate that he gave quite detailed written feedback for all our assignments.",
            "comment_grading": "Generally fair grading but not so transparent. Great that they took away the participation score so there is less pressure to participate extensively in classes.<br /><br />Job Interview (individual) 20%<br />Impromptu speech (individual) 15%<br />Business pitch (group) 30%<br />Business plan (individual) 30%<br />Peer evaluation 5%<br /><br />John didn't release most of the scores, and I wasn't able to figure out what grade I got from his feedback either. I think I got around 6/6/6 for the job interview and didn't do so well for the impromptu (his feedback did say that I didn't fulfill many of the requirements). In the end I got A-, which I think is pretty fair (or maybe a bit high) according to how I think I performed.",
            "comment_workload": "Quite light, especially in the beginning. There is no prep required for the impromptu (you could practise some sample questions though, if you wanted). I spent one evening preparing answers to some standard interview questions, and that was it.<br /><br />The innovation requires a bit more work, and it depends on your groupmates (John let us pick our own groupmates if we wanted to, but seems like none of us knew each other). I had helpful groupmates, we had 3-4 short meetings to discuss the topic and divide our parts. The hard part is making enough content for 20 minutes. <br /><br />Writing the report is easier since by then you will have all your contents, all you need to do is find some more background information and present it in a nice report. I spent 2 days writing the report.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cePDYxN4GEoKvFMns5Snmhs6T3Wxufqd",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 420,
                    "name": "LAM, Chak Yan Jessie Teresa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sasannnl",
            "date": "Dec 23, 2020",
            "title": "Fair",
            "comment_content": "The content is more useful than 2040. The first task teaches you how to prepare for an individual interview. And the impromptu speech is the hardest one. You only have 3 mins to prepare for the 3-min speech. So native speakers may have advantages. The other two assessments are quite similar with 2040.",
            "comment_teaching": "I don't know whether it is because of the online form, we spends like 6-7 classes for assessments or consultation. Also we spent a lot of time on discussing with other students. But her English is fine, and she is nice as well.",
            "comment_grading": "20% Job Interview<br />15% Impromptu Speech<br />25% Pitch Presentation<br />25% Business Plan<br />5% Peer Valuation<br />10% Participation<br /><br />Her grading is not as bad as other people said. Most of my scores are &quot;Good&quot;, and some are even &quot;Satisfactory&quot;, but I received a B at the end. Maybe it is because my initiative in classes so I got high scores in participation. So if you are in her class, try to take initiate and answer her questions as much as possible.",
            "comment_workload": "She always assigns homework, and those homework are helpful as she would give feedback to you, so that you can perform better in the real assessments. Not sure whether she will consider it in the participation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Fgp1WeTBhcLjB1JCCu9iM9f3NKBFmO9g",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "axs",
            "date": "Oct 29, 2020",
            "title": "",
            "comment_content": "The content was straightforward, and everything is transparent. Lots of examples in PowerPoint slides on and especially found CV help was very useful.",
            "comment_teaching": "Professor really tries to engage students and her feedback is always constructive. She truly cares about her students.",
            "comment_grading": "Grading is fair, engage with her during office hours to get even more feedback. <br />1 job interview <br />1 impromptu speech <br />1 group pitch presentation <br />Final report <br />Group evaluation",
            "comment_workload": "Very manageable and skills acquired were of tremendous value. Make sure you read each set of slide decks before doing any of the assignments to know exactly what is required.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xrCZk18yLnzChaYyza1EzC20NwMOtDzl",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 294,
                    "name": "LAM, Levi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "krystalwu",
            "date": "Sep 11, 2020",
            "title": "",
            "comment_content": "The class mainly focus on some skills during job interviews. It will provide you chance to practice and learn to do or not to do in a interview.",
            "comment_teaching": "He will try to response on each students. Quite funny though.",
            "comment_grading": "I heard that he is killer in goop. However, the grade is better than I expected. I do seldom participate in class and the assignments are fair ,fyi.",
            "comment_workload": "It's just a normal lang course workload. One job interview, one impromptu speech, one group project with final report and presentation.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ghlAHVRw8JHSKabeg90ZAYC1uYqaQSkz",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 428,
                    "name": "SIN, Kathy Mun Yee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "holam",
            "date": "Jul 23, 2020",
            "title": "LABU 2060",
            "comment_content": "4 parts: <br />1. Job interview (20%)<br />Submit a CV (no mark) and submit a job post (no mark)<br />Then have an 8-min interview<br />All are general questions. Please well prepare for it.<br /><br />2. Imprmoptu Speech (15%)<br />Give you a question (argumentative one) and prepare it in 3-min.&nbsp;&nbsp;Then make a speech for 3-min. Difficult to prepare, but make sure you fulfil the requirement of your tutor<br /><br />Rundown: open zoom with your face, receive question , prep 3 min, then your face can disappear for around 4-5 min for shooting a 3 min video, then appear your face again, wait until your tutor receive your video, then leave<br /><br />3. Group Project<br />Think of a startup/company for improving the community. You need to use the same thing for the writing and presentation<br />(a) Writing (30%) (individual)<br />&lt;1200 writing for your business plan. There are some spcific structure/requirement you need to fulfil. Wrote very clearly in Canvas. Read them.<br />(b) Group Presentation (20%)+peer evaluation (5%)<br />15min presentation. This semester is making a zoom recording only. You can NG as many times as you can. But usually the technical problem wastes you lots of time.<br />This semester does not have Q&amp;A<br /><br />4. Class participation (10%)<br />If you are still not able to entertain the tutor when this is the third/fourth Lang class, getting a bad grade is common.",
            "comment_teaching": "Hea type. lots of group discussion<br />Therefore very good",
            "comment_grading": "Leng grade.<br /><br />Job Interview: 555<br />Impromptu speech: 566<br />Writing: 555 (I finish it within an hour, don't expect too much)<br />Presentation: 566<br /><br />Grade: B+ (actually I get P instead)<br /><br />Remember, high mark doest not mean better grade. The multiplier of each tutor is the real secret of the grade.",
            "comment_workload": "Still it is a LABU class, a bit chur.<br /><br />No extra workload for Cathy",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "m5SDjmPiL9X3af3vL8iTmG5p3LZy4dQy",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 428,
                    "name": "SIN, Kathy Mun Yee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "penguin3220",
            "date": "Jun 14, 2020",
            "title": "",
            "comment_content": "The content is quite practical, like resume, job interview and impromptu speech, a required course anyway, you can't avoid it.",
            "comment_teaching": "Her lesson is chill and somehow local. Though at the end of the semester it's becoming boring (every lesson dou do an exercise then end lesson), she is quite good overall.",
            "comment_grading": "The grading is quite fair, definitely not a killer.",
            "comment_workload": "Comparing to LABU2040, the workload is much lower. The schedule is a bit tight at the end of the semester cuz there are a group project and also a 1500 words business writing to do in 2 weeks.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "L5Hmzv6hg8I0qUvAdlFwHSYNZT5W5WMp",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 417,
                    "name": "HUSSIN, Nora Anniesha Binte",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GW17",
            "date": "Jan 23, 2020",
            "title": "",
            "comment_content": "2 mini case and 2 case analysis <br /><br />1 mini case presentation<br />2 case presentations and writings",
            "comment_teaching": "She was very enthusiastic and willing to spend time to give suggestions on each of us. There will be a several individual meetings to discuss on our performances. She gave detailed feedbacks each time.",
            "comment_grading": "B range while the feedbacks I got were mostly competent and high satisfactory. <br /><br />The grading were stricter than other instructors,.",
            "comment_workload": "During the add-drop period, we already had a mini case presentation. Felt tied up when there were a lot of things to do in other courses. Need a lot of effort to give good ideas and good presentation.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LSAJ7dLiVoSxWldw05lpcg3qU2FtmMji",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 419,
                    "name": "KWAN, Yuen Tung Gloria",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lonelyguy",
            "date": "Dec 24, 2019",
            "title": "",
            "comment_content": "There are 3 phases in this court. The content is more useful than LABU 2040 and practical. At least it is relevant to the workplace environment. <br /><br />Phase I: Effective Communication in Job-Seeking&nbsp;&nbsp;<br />Assessment Tasks: <br />- Personal digital portfolio<br />- Job interview<br /><br />Phase II: Effective Communication in Impromptu Speaking<br />Assessment Task: <br />- 3 minutes impromptu speech<br /><br />Phase III: Effective Communication in Pitch Presentation and Business Writing<br />Assessment Tasks:<br />- Pitch presentation<br />- Business writing",
            "comment_teaching": "She usually has many class activities in every class. So, it may be a bit tiring to handle all of the activities. Therefore, she will run out of time sometimes. She will then focus on the main points and cut the rest of the activities. But overall speaking, she explains thing quite detailed and sometimes the lessons are quite intense as she includes much useful information. We sometimes may need more time to digest and I feel like I have gone back to the secondary school tutorial (遵理).",
            "comment_grading": "I think she is a strict grader but she did give quite a fair grade to all of us.<br /><br />Grading Components:<br />5% Digital Portfolio - Excellent<br />15% Job Interview - Good, VG to G, Good<br />15% Impromptu Speech - Good, Good, Sat to Good<br />25% Pitch Presentation (unknown)<br />25% Business Writing (unknown)<br />5% Peer Evaluation - Full<br />10% Class Participation (unknown)<br /><br />I did not receive any VG in the interview and impromptu but still got A range. Don't know if this semester is the first semester to change the syllabus so they are more lenient in grade.",
            "comment_workload": "Not as heavy as LABU 2040, but still some workload towards the end of the course. <br /><br />Job Interview: Not much workload. Just find a job ad and prepared for the interview regarding your chosen job ad. Also, just prepare your CV and digital portfolio. Not really a big deal.<br /><br />Impromptu: Lightest workload among all of the assessments as you cannot really prepare too much. You may search for some quotes, vocabulary, examples beforehand to support your arguments in the speech. <br /> <br />Pitching and business report: The heaviest workload should be the innovation pitch presentation and business writing. You need to think of a social-sustainable innovation to attract the external investors to give you funds to run the innovation. It is difficult to think of a very innovative project from scratch. I can also be an entrepreneur if I can really think of a wonderful innovation.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WbzLlOG1T4GsiPo2cn6pdh8NPhdE1Z9N",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 879,
                    "name": "WONG, Nick",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mikiksy",
            "date": "Nov 01, 2019",
            "title": "",
            "comment_content": "The content is useful for your future career seeking about writing the CV. You will also have the chances to practice the situation in interview assessment. It is also good for you to train your delivery and confidence in public speaking.",
            "comment_teaching": "His teaching and english speaking is good. <br />He encourages us to speak confidently and to answer his questions.<br />Some of the lessons are cancelled because Nick is not free and the content is finished.",
            "comment_grading": "Nick said he was a killer. And my grade is in C range.<br />If you can actively answer his questions and attend all the lessons, then your grade will not be bad.<br />Also, use things and methods he taught to answer the questions during interview assessment.",
            "comment_workload": "1. Digital portfolio<br />2. Job interview<br />3. Impromptu speech<br />4. Business writing<br />5. Pitching an idea - Group project<br />6. Attendance<br />7. Peer evaluation",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HsA3fDoWecR7rLiNzx59Wvf0AeVuL4Nk",
            "semester": "2018-19 Spring",
            "instructors": [],
            "is_author": false,
            "author": "joannaaaalam",
            "date": "Sep 03, 2019",
            "title": "Useful lessons",
            "comment_content": "The content is quite useful, most about the future questions you may be confronted during interview. The tutor taught a lot of useful tips to handle those questions. And finally, you will be formed a group of 2-3 people for the start-up project. But it's quite easy to handle.",
            "comment_teaching": "Tutor taught quite well and I learnt a lot on how to prepare for an interview.",
            "comment_grading": "Fair grading. I got 5 6 6 in group project and finally I got a B.",
            "comment_workload": "Light workload. Only workload is to prepare for your group presentation and final report.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kouVFwtHttrVZVpq3hucsOri0ICvVzuj",
            "semester": "2018-19 Spring",
            "instructors": [],
            "is_author": false,
            "author": "hlnt9099207420",
            "date": "Aug 22, 2019",
            "title": "",
            "comment_content": "This course helps students prepare themselves from finding internships and future jobs. It requires students to write CVs, create Digital Portfolios and prepare for interviews.",
            "comment_teaching": "Fiona is a good teacher. Not only does she teaches contents from the slides, she shares her working experiences with us and what interviewers want from the graduates. She provides good suggestions for us in order to perform better in the impromptu speech and presentations. Additionally, she is willing to answer us a lot of questions during class in which I appreciate her passion in teaching a lot.",
            "comment_grading": "Grading is fair. As long as you have actively participation in class and prepare well for your digital portfolios and CVs, it would be fine. <br /><br />Additionally, there would be a part where you have to cooperate with your group&nbsp;&nbsp;mates, having your business writings and pitch presentations marked as a group somehow. Grouping is random, so make sure to get familiar with your group mates and discuss the idea clearly to ensure that all business writings are coherent with each other. It is better to complete everything well before the deadline to ensure a good grade.",
            "comment_workload": "Workload is light comparing all other courses. Basically, if you have got used to presentations and interviews, things will be totally fine and that you don't have to prepare much during class.<br /><br />The most important thing is still your class participation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3vOzUL7CANWUesoUfSGrPjDX2fbphvzs",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 875,
                    "name": "NG, Choi Ping Martha",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jerry Wong",
            "date": "Jul 30, 2019",
            "title": "Nice course",
            "comment_content": "The course is divided into 3 phases.<br /><br />Phase I is job-seeking. You are required to complete digital portfolio (i.e. job ad you chose, your research on the company and your 1-page CV) and an assessed job interview.<br /><br />Phase II is impromtu speaking and business writing. For impromtu speaking, you will give a 3-minute short speech to the colleagues in a staff retreat. For business writing, you wll be working in a team of 3 on a group project. Each will be responsible for writing one of the three documents. You will negotiate with your team and write the preliminary market analysis, the progress report and the business plan.<br /><br />Phase III is pitch presentation and peer evaluation. Your team will give a 16+4 minutes' pitch on the group project to an external business audience. Then, you will evaluate your team members' contribution to the group project.",
            "comment_teaching": "Martha is a patient and a knowledgeable tutor. Before the class, I heard many of my friends saying that she is a &quot;killer&quot;. But I don't think so after attending her course.<br /><br />She gives us many examples on how to promote ourselves during the job interview. She is not only reading her powerpoints, instead, she really keeps on elaborating what she is expecting on. And you can ask for her feedbacks after your practice and assessment, which are useful to your business interview for internship or post-graduate job interview.<br /><br />For business writing, she shows us examples of writing that fulfils the requirements and also points out the room for improvements. What's more, she also keeps concrete feedbacks on how you can improve, though you may not have chance writing these reports later on :)",
            "comment_grading": "Phase I: Job-seeking<br />1. Digital portfolio (5%)<br />2. Assessed job interview (15%)<br /><br />Phase II:<br />1. Impromtu Speaking (15%)<br />2. Business writing (25%)<br /><br />Phase III:<br />1. Pitch presentation (25%)<br />2. Peer evaluation (5%)<br /><br />Participation (10%)<br /><br />I think the grade is fair enough. Even if you are not doing well in phase I, you can still manage to get A range if you work harder and seek more advices from tutor in Phase II and III.",
            "comment_workload": "The workload is relatively small to me. It really depends on what other courses are you attending simultaneously. If you are attending other language courses, please do not attend this class in the same semester because you will be going to write numerous writings then. (But if you hate exams, you may try)<br /><br />Better communication with your teammates facilitate the work. And seeking more advices reduces your time of thinking how to do.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zZ7kEGqfh5NRVS70vlLvsP8y0QZb8LLT",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 875,
                    "name": "NG, Choi Ping Martha",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Oscar Wong",
            "date": "Jun 10, 2019",
            "title": "Average course",
            "comment_content": "Content is about business communications.&nbsp;&nbsp;First few weeks focus on CV and interview skills.&nbsp;&nbsp;Afterwards are impromptu speeches, business reports and pitching.&nbsp;&nbsp;All topics are business related.&nbsp;&nbsp;But how effective the trainings are really depends on the tutor.&nbsp;&nbsp;Labu courses can be really different among various tutors.",
            "comment_teaching": "Martha is a good tutor.&nbsp;&nbsp;Explanations are clear.&nbsp;&nbsp;Examples are provided.&nbsp;&nbsp;Feedback for assignments or in class practice are provided in a timely manner.&nbsp;&nbsp;I generally receive my grade and feedback for assignments about 1-2 weeks after submission.&nbsp;&nbsp;If you ask for further advice, Martha will also give you more details on how to improve your English proficiency accordingly.",
            "comment_grading": "Fair grading.&nbsp;&nbsp;Everyone is not expecting a very good grade for Labu courses.&nbsp;&nbsp;I generally score between 3-4 out of 5 in all assignments, perhaps a bit more 3 than 4.&nbsp;&nbsp;Final grade is B, which is as expected for labu course.",
            "comment_workload": "Labu 2060 has less workload comparing with labu 2040.&nbsp;&nbsp;For 2060, all you need to do is a demo interview, an impromptu speech, a business report and a pitching presentation.&nbsp;&nbsp;For the first 2, actually you just need very little time to prepare.&nbsp;&nbsp;So the main workload will be in the later part of the course, ie when you have to hand in your report and present your ideas.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ze20HxHMJ0jqvTEffl1hiNZI3m3X5hrS",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 428,
                    "name": "SIN, Kathy Mun Yee",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ip",
            "date": "Jun 09, 2019",
            "title": "",
            "comment_content": "typical LABU 2060 content",
            "comment_teaching": "not much teaching honestly<br />everyone was confused abt what we had to do in the beginning as she gave no instructions about the webpage that we were asked to create for the job interview (first assessed task). she didnt even mention how we could hand it in until sb asked her and she said that everyone who did it could get full marks. (so wheres the differentiation when everyone can get full marks? idk if its absolute grading or not but obviously she cant give everyone As)<br /><br />For the second assessed task, we were asked to do impromptu speaking (3mins prep on the spot and 3 mins ans). she did quite enough practice with us for that. like we were asked to do a mock practice in front of everyone in class but she gave little feedback for that she just smiled, laughed a little, gave some general comments and asked us to watch our own videos at home. (yes, she asked us to use our phone to record ourselves in this mock practice) so i feel like she was just enjoying herself when we were doing the practice. <br /><br />Then we were asked to do a startup group project. We were asked to think of an idea and do an individual report+ group pitch for that. <br />She just held the notes given by lang centre and read them out during lessons. I tried to ask her questions but she just kinda read and referred back to the lang centre notes. seems like shes not fully prepared.<br /><br />For the final pitch, seems like she did not wanna give any comments on our idea at all. like she gave us free discussion lessons. good thing is everything can be settled during lessons which means no needa meet up outside class. she held a consultation session. but unlike other lang tutors, she wont really guide u through. u have to ask her qs and she could barely give u constructive feedback (like she nodded, and said yes and agreed, but at the end of the day, does she really agree with that?)",
            "comment_grading": "she was kinda biased. like in every task i received similar comments. <br /><br />grading not bad actually but keep your expectations low",
            "comment_workload": "workload is chill.<br />interview = no needa prepare<br />impromptu speech = u cant prepare<br />report = 1-2 days<br />pitch= 1-2 days including group meetings<br />attendance",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fIHpE0Mb6aLeOYo9ZqYYwaUGDTytOrpr",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 294,
                    "name": "LAM, Levi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "也許不必知道我是誰",
            "date": "Jun 04, 2019",
            "title": "",
            "comment_content": "CLE is infamous for reusing course materials year over year. Please refer to other comments for what will be covered in this course.<br /><br />Just one comment: Rather than building Google Digital Portfolio which no prospective employers in the real world actually care, why not teach us how to use LinkedIn effectively?",
            "comment_teaching": "Many said that Levi had a sense of humor, and it's true - ONLY when he was teasing someone in class for fun. He did prepare his own lecture slides, but most of the time he was just reading the content aloud. There would be in-class practice for oral assessments and brainstorming time for the business pitch, but it could be a disaster when he taught business writing. You would even learn faster by simply reading the slides and supplementary materials prepared by him.<br /><br />Nevertheless, Levi was open to questions both after class&nbsp;&nbsp;and through email. He could also recognize all of his students - he mentioned someone in class who had also taken his LABU2040 in previous semesters! His teaching was not always effective, but he did care about his students.",
            "comment_grading": "1. Job Seeking Assessments (20%)<br />- Digital Portfolio (5%, graded by completion)<br />- Mock Interview (15%, based on a job ad of your choice)<br />2. Impromptu Speech (15%)<br />3. Business Writing (25%)<br />4. Business Pitch (25%)<br />5. Peer Evaluation (5%)<br />6. Class Participation (10%)<br /><br />Levi is known as one of the killers in CLE, but the grading is surprisingly good for me. Although my average grade of mock interview and impromptu speech lied between &quot;Good&quot; and &quot;Satisfactory&quot;, I got B at the end. Class participation is really crucial for you to get a decent grade from Levi.",
            "comment_workload": "Not heavy. You just have to spend at most 2 hours for digital portfolio and preparation of typical interview questions. Don't expect any technical questions as most tutors will just evaluate your performance on your use of language. Also, don't choose jobs that require so much technical knowledge because you won't receive good grades if your tutor don't understand what's your potential job duties. For impromptu speech, you really have nothing to prepare in advance. Just calm down before you choose your topic and try your best not to hesitate during your speech.<br /><br />For business writing and business pitch, they are based on a tourism-related business idea of your group's choice. I give a C for workload because my group mates don't really care about this and I have to do many things beyond my own parts. Good luck if there are freeriders in your group.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "23OKAfe3rQJ6JfX0n5G6gjuUVlKSGT0z",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 421,
                    "name": "TANG, Eunice",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pinball",
            "date": "Feb 01, 2018",
            "title": "",
            "comment_content": "This course is a combination of two topics: job hunt + workplace communication. Each part requires both writing and oral assessment, which is quite well-round.<br /><br />The first part: job hunt, includes the whole process of finding jobs from research, preparation, application to real interview moment. Every stage is assessed, by the way.<br /><br />The second part: workplace communication, includes dealing with colleagues of different backgrounds (1 lesson only, and no assessment about this), impromptu speech and to do a project as a startup. Market research, progress report and business plan will be covered and a pitch of this product/ start-up is assessed.",
            "comment_teaching": "Eunice is a good instructor because of her experience from workplace. Materials were adjusted to reality oriented rather than theoretically spoken. Practises are adequately coordinated and she can give you useful feedback. Enquiries after class are welcome.",
            "comment_grading": "Grading is average. <br />Digital Portfolio 10% <br />Job Interview 10%<br />Impromptu speaking 15%<br />Business writing 25% (A group of 3, each doing 1 out of 3 parts of the plan)<br />Pitch 25%<br />Teamwork evaluation 5%<br />Participation 10%<br />5 skipping lessons allowed.",
            "comment_workload": "Workload is light if preparation works are done on progress in line with teaching. After topics of CV and cover letter, the assessment of a personal portfolio will be assigned with the interview assessment (around week 4-5). The part of impromptu speech will be the next (assessed in around week 7-8). Then, the business plan is coming (week 9-10). And the pitch in the last two week. So every moment is vital for your LABU 2060, in my opinion.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "79Xi7YA3KZUBHCYWTHqBG1zlDNkvTCrG",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 408,
                    "name": "GASKELL, Delian Dawn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "aliali",
            "date": "Jan 10, 2018",
            "title": "",
            "comment_content": "The course content is quite practical since it is designed for job-seeking in student's early careers. You will learn and practice business writing, presentations, interviews etc. <br /><br />The course is divided into 3 phases:<br />Phase I - <br />building a personal digital portfolio, compiling your CV, writing a cover letter, and a mock job interview<br /><br />Phase II - <br />randomly put into groups of 3 and come up with an innovative business learning idea and divide up the work load into: 1 wirting market analysis, 1 progress report and 1 business plan.<br /><br />Phase III - <br />present persuasively to the class about your business idea and businessplan.",
            "comment_teaching": "Delian is a good teacher and she is also very nice.&nbsp;&nbsp;She looks out for students and is willing to answer any questions that we have.&nbsp;&nbsp;She sometimes brings treats to the class as well!<br />She mostly introduces the topics using powerpoint then gives us time to practice and discuss.&nbsp;&nbsp;However, I would say she is rather slow in marking, sometimes, it takes her weeks to return our work.<br /><br />Since LABU 2060 is a relatively new course, I think the planning of the course could be improved since you can tell the course timeline was a bit messed up after the first phase. They tried to cram everything in the last two weels which makes the course a bit stressful towards the end.&nbsp;&nbsp;&nbsp;However, you cannot blame this on the instructor, it's not her fault.",
            "comment_grading": "Like all LABU course, it is absolute grading.&nbsp;&nbsp;So other's performance will not affect your grade.&nbsp;&nbsp;Every piece of work you hand in will be officially graded and will count towards your final grade.&nbsp;&nbsp;And each element will weigh differently.<br /><br />Attendance is important, the minimum attendance requirement for LABU 2060 is 80%. This means that if you are absent for 6 lessons, you will automatically fail the course. Your attendance will be counted starting from the first lesson in the first week. Permission of leave will only be given in special cases of prolonged leave for reasons such as serious illness or injuries on production of documentary evidence.<br /><br />I will say did put effort in all of the course work but I did not work my butt off so getting a B+ at the end is fair.",
            "comment_workload": "Workload is fine as long as you don't leave everything towards the last day.&nbsp;&nbsp;They do give you enough time to prepare like 2 weeks before deadline.&nbsp;&nbsp;<br /><br />However like I said the final 2 weeks of the course was messed up so it was stressful towards the end.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XcV1u0piND9zyTNQbnt3fZbaC9BfnHZ9",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1763,
                    "name": "REWHORN, Thomas Jay",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "cacacacry",
            "date": "Jun 09, 2023",
            "title": "Avoid him",
            "comment_content": "Job Interview (Individual) <br />Business Plan (Group project)",
            "comment_teaching": "Ambiguous guidelines <br />He won't give you concrete and useful feedback <br />He also won't specify assignment due dates on Canvas so you need to attend the lessons to know when to submit your homework",
            "comment_grading": "Bad grading<br />Even if you confirmed with him that everything is on the right track before assignment submission, you end up with bad grades. No way to know whether he's happy with your work or not.",
            "comment_workload": "Heavy workload <br />First part of the course is about job interview (Individual)<br />Second part is business plan writing (group)<br />Some progress check assignments in the middle",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fwncl7A7RdVelg5JD6VMBrVF9BsPwCK1",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 466,
                    "name": "ENGLAND, Graham James Fisher",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "一位不愿意透露姓名的少女",
            "date": "Aug 17, 2020",
            "title": "Graham is the best!",
            "comment_content": "-",
            "comment_teaching": "Clear teaching, relaxing style of class and Graham will make sure his instructions are clear and easy to follow.&nbsp;&nbsp;He's very patient and understanding as well. For this sem (online) he had standard ppt with clear requirements for each assignment. <br /><br />HIs accent very pleasant--&gt; He is British but way more understanding toward students' accent and ways of expression than local instructors (who are way more judgemental somehow). <br /><br />I have done all my language courses ( 7 in total) and I have said this a thousand times to my friends: GRAHAM IS THE BEST ･ᴗ･♡!!",
            "comment_grading": "Mock Job Interview 20%<br />Impromptu Speech 15%<br />Business Plan Writing 25%<br />Pitch 20%<br />Peer Review 5%<br /><br />5s for the impromptu speech and mostly 6s for other assignments, two to three 7s--&gt;final grade: A<br /><br />After each assignment, Graham would help students to do self-reflection--&gt;better pay attention to what he points out to improve your grade for next assignment",
            "comment_workload": "Acceptable. Similar to LABU2040.<br /><br />Students will have samples for writing and investment pitch so an entire day to prepare for each assignment should be enough.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lLlvyQfAsuHfOlsZnpvKx7CNKJO108je",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 421,
                    "name": "TANG, Eunice",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Account guy",
            "date": "Mar 02, 2020",
            "title": "",
            "comment_content": "Content is fair with fun teaching contents suitable for career building.",
            "comment_teaching": "She is a kind, fun and amiable teacher. She is well-prepared before class and provides many class materials to students.",
            "comment_grading": "Grading is fair as Eunice is quite a lenient lecturer.",
            "comment_workload": "Workload is lighter than LABU 2040 with more appropriate contents to students. From this course, students have more divided assignments to do which are not as heavy as LABU 2040. I believe this course is good. It could also provides to other students instead of just business students.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7trbgqunz2a30MmtZcFAPO6QW4mquWBz",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 419,
                    "name": "KWAN, Yuen Tung Gloria",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YCL2018",
            "date": "Jun 07, 2019",
            "title": "(The course itself was) A Tad Bit Boring",
            "comment_content": "The course is kind of everywhere and like any other language courses, it's not so much of a content course but a skills course. The classes are taught in small group tutorials style and very much focuses on personal communication skills whether its interview, impromptu presentations, or planned presentations. While these are skills necessary to have in real life, I don't personally see a point in teaching these skills in a dedicated course as it could get extremely tedious and boring.",
            "comment_teaching": "Gloria has been a great teacher considering the level of boringness of this course which I was quite surprised at myself for not falling asleep and this may very well have to to with the instructor's teaching style. She encourage discussions and has tried to make the course as interesting as possible.<br />While she might not give very clear guidelines as to the final 'startup' project, this is the department's policy and she has&nbsp;&nbsp;done her best to providing support and clearing up any questions about the project and other assessments.",
            "comment_grading": "I think the grading was quite fair and like most instructors and professors I found did not skew the grading to make it more or less favorable for the students. As long as the student puts effort into the not so fair workload, the course is unlikely to fail you.<br />Do keep in mind that attendance is quite important in this course and put the course in the time you think you can stay awake for the longest or simply not skip class. If you miss 10 classes in the course, you will be required to retake the course later on. And your active participation will also leave a good image in the instructors mind which will definitely help in the grading portions for this course because the assessment materials a quite subjective.",
            "comment_workload": "It hits you when it hits you and if you are a competent speaker and writer in English, there will be no problem in cramming the tasks last minute and still get a super good grade. However, this course doesn't simply hit you once but continuously and could get a tad bit stressful as you go further into the semester.<br />Last thing, ironing your shirts for the way-too-many formal presentation assessments could be quite some workload.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JoJDVfdiSHiUJuTa3qMMmJiYaVLoYnGM",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 294,
                    "name": "LAM, Levi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gd",
            "date": "Jun 04, 2019",
            "title": "Better than I expected",
            "comment_content": "- 1 Job interview (with digital portfolio) <br />- 1 Impromptu speech ( 3 mins preparation and 3 mins speech)<br />- 1 Business report <br />- 1 presentation ( Brainstorm an innovation )",
            "comment_teaching": "I would say at the beginning, I really don't like his teaching style, which is too interactive and always encourage people to speak up. (I tried to swap this class but failed) <br />But honestly his teaching style really help me to improve my oral skills and presentation skills! <br />Before every task, he did a lot of practices with us like mock interview, speech practice and help us to brainstorm the idea of our innovation. <br />It really depends on your attitude of learning, if you want to improve your oral skills, Levi is a good choice!",
            "comment_grading": "It is BETTER than I expected!!!!!!!!<br />His marking is so strict and my marks are lower than average mark on marking scheme. I was expected to get C or C+! <br />But I get B range eventually! Can't believe it until now! <br />Attendance is important",
            "comment_workload": "The workload is average ! You don't need a lot of time to prepare the interview and impromptu speech! <br />But for the group work, it is quite time-consuming. But actually Levi would help and guide you to prepare the report and speech, it all depends on the efficiency of your group mate!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KOXvRKUirrw8HkM10BZHRxRc2CeVICPz",
            "semester": "2022-23 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Momo111",
            "date": "May 15, 2023",
            "title": "MGMT2130",
            "comment_content": "Toooo useless<br />I don't understand why we need to learn such a boring course in uni.<br />I just blame this course in ust rather than professor, I like the teaching style and interesting examples in lectures.",
            "comment_teaching": "Professor Brown is very dedicated and I like him so much.",
            "comment_grading": "Haven't shown yet<br />But one important thing is that the participation counts 20% of the grading scheme so every class was agonizing for me since I 'm an introvert.",
            "comment_workload": "Huge workload........... But it is only 2 credits......<br />Including weekly discussion comments, survey, class attendance, participation, group project, two written assignment....<br />It was just a waste of time because I can't learn anything from these assignments and project.",
            "rating_content": 1,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H7MA7oYnBAxIrfu4JyHlySOkWpZlPLrY",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1415,
                    "name": "SHEN, Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hayoha",
            "date": "Dec 30, 2022",
            "title": "Bye Bye all LABU",
            "comment_content": "The course is designed and structured to address your learning needs in job-seeking and in your early career. The course introduces students to strategies for handling the communication challenges which fresh graduates can expect in diverse work environments. You will have opportunities to learn and practise how to succeed in business writing, presentations, interviews, meetings, and collaborative assignments with the essential interpersonal communication skills such as active listening, cogent argumentation, and clear expression in writing and speaking.",
            "comment_teaching": "Ms Shen is very nice and kind and friendly. She prepared excellent PPTs for the lectures. There are practice time during lecture (1-2 lectures) for individual interview assessment.<br /><br />She provided so much time for each group to discuss by their own &amp; raise questions.",
            "comment_grading": "Individual Job Interview 25%<br />Business Writing 5%<br />Business Plan 30%<br />Assessed Business Pitch 30%<br />Peer evaluation 5%<br />Learning Portfolio 5%<br /><br />Eventually B<br />Interview: 4.5,4.5,4.5<br />I am not a presentable person, but tried my best. :(",
            "comment_workload": "Need to prepare the CV, e-portfolio (Google Website)<br /><br />NOT sure if it would be a good idea if you have never taken any internship (year 1-2) but choose this course for an Interview assessment.<br />You will be asked to choose a real job advertisement and write your CV matching with the job requirements.<br /><br />Business Plan Writing is around 2500-2800 words, it is a team writing homework so if you group as 4, each person needs to write 625-700 words, while for 3, around 800-900 words.<br />You can choose to be an individual writer if you really very not working well with your group, but sad that you can break the group and force everyone (freeriders) to work on individual as well. So you need to hand in one part of your individual Business Plan into your group's Business Plan.<br /><br />Assessed Business Pitch: can use notecards.<br />Learning Portfolio: can choose to use Office Sway or Google website<br /><br />Common sense: as long as you have good group members, your workload will be normal.<br />I reg this course with my friend but turned out not allowed to choose groupmate. :(",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3JPWz2yKAGuKEHJNl46dbM4E2y2N8N4X",
            "semester": "2020-21 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Charliee.chan27",
            "date": "Oct 20, 2021",
            "title": "Do not reg this teacher",
            "comment_content": "Basic english communication in business.<br /><br /> 1. One-page CV and Chosen Job Advertisement for the Assessed Job Interview (individual, 20%)\t <br />Assignment 2. Assessed Impromptu Speech (Individual, 15%)\t <br />Assignment 3. Assessed Pitch Presentation (Team &amp; Individual, 30%)\t <br />Assignment 4. Assessed Business Writing - Business Plan (Individual, 30%)\t <br />Assignment Feedback for the interview assessment\t <br />Assignment Impromptu Speech Practice (Pre-assessment) 26 March\t <br />Assignment Impromptu Speech Practice 1",
            "comment_teaching": "Her teaching is really dependent on her mood, she could be proactive sometimes. She feigned sick in classes and was not bothered to teach the class half the time. The other half of the time, she would shit on students at any opportunity because I think she holds resentment from previous students. Which is why I don't understand why she is teaching. I had an incredibly great 2040 experience, but the same cannot be said about this experience.",
            "comment_grading": "Her grading makes absolutely no sense. I did not get a single feedback/grade on my assignments. For the whole semester I think I got my grade for one assignment. Was lost as to any indication of my grade and was given a very unwelcome surprise when it was eventually released (took until the last day to post)<br /><br />She bases your grade off of your name and not your ability because I am certain she never actually marked my work. Although my english ability is on par with my friend, he was the only person in the whole class who got A range and I suspect it is because of his name (not a Chinese name). <br /><br />She is also too lazy to remove the course from active classes on Canvas, so every single time I log in I have to be reminded of how terrible of an experience the class was. Honestly, if you want a good grade go with Nick, I left his class and I regret that decision. He is a genuinely nice guy that cares about your learning and has a fair grading system.",
            "comment_workload": "Honestly chill, just don't reg this teacher.",
            "rating_content": 5,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "uGOnNZbzNghusPcskrmEGGsBF4nkSR9C",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 428,
                    "name": "SIN, Kathy Mun Yee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "EricKan",
            "date": "May 18, 2019",
            "title": "Good grade and nice tutor",
            "comment_content": "The course aims to extend the communication and language skills that you have previously acquired in Labu 2040, and further applies in specific business applications and strategies. <br />It provides a more job-oriented environment and experience of how a startup starts from 0.",
            "comment_teaching": "Kathy speaks comfortable and fluent English so you won't have problems while attending her lessons.<br />She doesn't rely on powerpoints very much and gives us to have our own brainstorm session on ideas and projects most of the time.<br />Quite free in the class.",
            "comment_grading": "Kathy is well known as a good grade tutor.<br />She is also so kind to her students in class or out of class.<br />She said that 5 is the mean score in her class so don't worry, it's really good grading.",
            "comment_workload": "Compared to Labu 2040, the workload of Labu 2060 is extremely light. No more complicated business case analysis, you just have to focus on the presenting and spoken English.<br />Assignments that we had to do : <br />1. Prepare the digital portfolio (CV)<br />2. Job interview (The tutor as an interviewer)<br />3. Take a stand (3 mins unprepared speech)<br />4. Business writing (Market analysis, Progress report, Business plan) (Choose 1 out of 3) (1500words)<br />5. Pitching , the presentation<br /> <br />Attendance should be no big deal.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5GeJq0mIBAUuhFTL7ZWUoFImMVyUd55I",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 294,
                    "name": "LAM, Levi",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ust jjjjj",
            "date": "Mar 30, 2020",
            "title": "Poor Teaching",
            "comment_content": "about job interview rehearsal, preparing speech for 3mins, group project, not to mention more because so general, what i would like to write is the teaching part",
            "comment_teaching": "he simply just read out the ppt for around 10mins, then start discussion, every class likes this. each discussion lasts for like 15-20mins, after that each group must pick one person to speak in front of the whole class, and he just gives simple comments after that. Each class has 1-2 discussions.<br />I actually learn something from these discussions because you have to keep speaking, but If i have choices I prefer not to learn from this. I stay in this class because of time clash in timetable.",
            "comment_grading": "/",
            "comment_workload": "/",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "e43MaJQJB9YTvtMgjlBeVvlkECI4wqFJ",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 408,
                    "name": "GASKELL, Delian Dawn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "想當年",
            "date": "Jan 29, 2021",
            "title": "【special semester due to COVID-19】effort pays off !! thanks Delian",
            "comment_content": "I am not going to repeat the whole content.<br /><br />The content is relatively more useful than other LANG courses, especially for the part of CV writing and mock interview, if you have 0 job hunting experience, like me. (So I rate a C here)",
            "comment_teaching": "Delian is a good instructor:<br />1) She is very nice and helpful<br />2) She is very patient when answering my questions. You can ask her questions after class.<br />3) She is pretty responsive to email.",
            "comment_grading": "My English is very poor. I only get level 3 in HKDSE English, but I get B+ in this course.<br />奇蹟啊！<br />(I think the good grade is only due to my effort anyway.)<br />(By the way, I either get satisfactory/good or good/very good for the assessment marks.)",
            "comment_workload": "For me, course workload is heavy because of my poor English.<br /><br />Basically, Delian will give homework for every lesson.<br /><br />********************<br />I rate D here instead of E, because I think that the workload helps me to get a good grade.<br />********************",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 3,
            "attachments": []
        }
    ],
    "composer": []
}