{
    "error": false,
    "course": {
        "id": 1279,
        "subject": "LANG",
        "code": "2010H",
        "name": "English for Science I",
        "description": "An English course for students of the School of Science. The course introduces students to the language and discourse of science and develops their competence in speaking and writing about scientific topics.",
        "categories": [],
        "website": "http://cle.ust.hk/courses/lang2010",
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "CORE 1403 OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1404\" href=\"/review/CORE1404\" target=\"_blank\">CORE 1404</a> OR LANG 1003 (prior to 2022-23)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.69,
        "rating_teaching": 4.5,
        "rating_grading": 4,
        "rating_workload": 3.31,
        "review_count": 16,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 427,
                "name": "SADHWANI, Dinesh Arjan",
                "count": 3
            },
            {
                "id": 460,
                "name": "CONWAY, Austin Eugene",
                "count": 2
            },
            {
                "id": 1303,
                "name": "CHAN, Thomas Anthony Chun Hun",
                "count": 2
            },
            {
                "id": 1720,
                "name": "ZYCHOWICZ, Piotr",
                "count": 2
            },
            {
                "id": 416,
                "name": "LAM, Toni",
                "count": 1
            },
            {
                "id": 423,
                "name": "YEW, Liza Sook Yee",
                "count": 1
            },
            {
                "id": 1708,
                "name": "CRANMER, Yvonne Starr",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "Z0immVeeESLegCYieL7lbKV7MlbSrqm7",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 427,
                    "name": "SADHWANI, Dinesh Arjan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "qjk",
            "date": "Dec 26, 2020",
            "title": "CLE aka CLS",
            "comment_content": "Content consists of the instructor blowing water for every lesson, nothing substantial.",
            "comment_teaching": "I don't recall Monsieur Dinesh doing any teaching at all.<br /><br />He also cancelled 2 classes without giving any reasons, and ending the semester 2 weeks early. As you can see he is a very chill and relaxed gentleman.<br /><br />I would really appreciate it if he had spent more time teaching us how to do his assignments, instead of teaching us absolutely nothing at all then giving me an abysmal score.",
            "comment_grading": "CLE should official rename themselves to CLS Co. Ltd.<br /><br />Since I transferred the 6 credits for eng lang, I didn't have to take 1002 and 1003 during Year 1. Therefore, I was not familiar with the absolute shit show that is eng lang courses at UST.<br /><br />A range is reserved for native speakers who have been speaking English before they left their fathers' testicles. If you are a local like me, even if you are a hardworking straight A's student, you can take your A-range dreams, crush them with a sledgehammer and throw the fragments out the window.<br /><br />The grade you get in this course is completely unrelated to the effort you put in it. It only depends on your natural speaking skills.<br />As someone who get 5* in DSE English but only 4 in speaking, I got around 65% for my presentations which is worth around half the course grade in total, which translates to c-range. Before you say I'm an imbecile, I got all A's this semester.<br /><br />The other reviews that gives this course an A in grading are quite misleading. If you are a local and unfortunately end up in the H stream like me, see if you can drop it and enroll in LANG2010 instead, unless, of course, you are a member of the aforementioned group of people who have attained an exceptional mastery of the English language before their grandfather's balls dropped.",
            "comment_workload": "Quite intense, you have a 3 minute video, a group presentation and a final essay.<br /><br />I spent 7 hours recording that video. In retrospect, I really shouldn't have spent so much effort.<br /><br />This course is a waste of your time. You are better for doing the absolute minimum and spending your time on other courses. It would be a much more productive use of your time, since the effort you put into this course is not related to your grade anyway.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Of5jwsV5MmiBVFFG81aPcnvu6ZNdLPZw",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1303,
                    "name": "CHAN, Thomas Anthony Chun Hun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Chris Tiffany",
            "date": "May 24, 2022",
            "title": "",
            "comment_content": "Basically, students will learn how to communicate effectively. Prof. Kin will explain many ways to achieve it in different scenarios. But do not expect to learn how to write an academic essay or thesis in this course. It focuses more on effectiveness in communication (such as how to talk effectively to different academic backgrounds of people) but not merely on science.",
            "comment_teaching": "Prof. Kin is very nice. <br />I remembered he once replied to my email within 15 minutes. When taking his course, you can really feel his passion for teaching. Personally, I am a relatively introverted person and not getting used to speaking publicly. But he is able to calm me down and encourage everyone to share.<br />The most important thing about him might be that he introduces and explain the assignments thoroughly. Before the assignments, he will bring several examples to class to discuss. During the assignments, we have mandatory consultations and even additional consultations if necessary. After the assignments, self-evaluation is conducted. <br />Although I do not like lang courses, Prof. Kin is trying his best to make this course interesting and clear.",
            "comment_grading": "The grading is not bad. For each assignment, students can see the comments and the composition of the scores. It is pretty fair and rational. I put a B here because students cannot achieve good grades if they are not actually paying hard work. In some assignments, especially for the group work and essay, I think Prof. Kin can tell how much you dedicate to the assignments.",
            "comment_workload": "In terms of the pre-unit quizzes, the workload is very light. Almost none. This is because they are graded based on participation. But it involves group work and essays. Researching and communicating with other people are two of the most time-consuming things for me. <br />In general, the workload still falls within my expectation. My groupmates are nice so I didn't encounter much trouble.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NZA94cTdGVyimXvcx8VdCxbMg9CbSoBk",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1303,
                    "name": "CHAN, Thomas Anthony Chun Hun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jsjs",
            "date": "Apr 20, 2022",
            "title": "",
            "comment_content": "Course content is not bad. <br />1: SIPE (Science In Plain English) Oral Presentation<br />2: Case Study Project on a Natural Disaster<br /><br />First one is individual and the second is a group project followed by a report written on the same topic but individually. <br /><br />Personally, researching on natural disasters was not fun.",
            "comment_teaching": "Kin is a fun teacher. He tries to make classes enjoyable and not boring. During classes, he throws jokes to people often. He explains expectations for assignments pretty thoroughly and responds to emails quickly.",
            "comment_grading": "Grading is quite good. Makes sense.",
            "comment_workload": "There are 12 Pre-unit quizzes on top of major assignments, but the quizzes take maximum 5 minutes to complete. They're also completion-based. <br /><br />The projects may take up some time, especially group projects.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "c3vjoUXmPhEvhKSPItwbAc2xDBxpL0wd",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Eliza",
            "date": "Jan 09, 2022",
            "title": "",
            "comment_content": "Boring and useless stuff<br /><br />Tasks:<br />- An individual presentation (video-recorded) <br />3 minutes (without visual aids);<br />Individual work;<br />Present a scientific concept in plain English.<br />20%<br /><br />- Self-evaluation on individual presentation<br />Self-evaluation of performance in the individual presentation.<br />5%<br /><br />- A group progress report presentation (real-time)<br />15 minutes (with visual aids);<br />Group work;<br />Present the progress of the group on the natural disaster case study project.<br />20%<br /><br />- iPeer <br />Self and peer evaluation of performance in the group work for the presentation.<br />5%<br /><br />- An individual recommendation report <br />1,200 - 1,500 words;<br />Individual work;<br />Recommend a solution to the negative impact in the natural disaster case.<br />35% <br /><br />- Library workshop <br />Participation in the library workshop on research and referencing skills AND<br />Post-workshop quiz (graded).<br />10%<br /><br />- Online activities<br />Completion of online pre-unit tasks and out-of-class work.<br />5%",
            "comment_teaching": "Piotr is a nice guy. Although there is really not much teaching needed in this class.",
            "comment_grading": "Not really good. Everyone in this class has 6 credits E-comm transferred, including some native speakers, so their English is really good. <br /><br />Me:<br />SIPE 18/21<br />self-evaluation 2/2<br />Group Presentation 19/21<br />iPeer 5/5<br />Individual report 18/21<br />Lib workshop 100/100<br />completed all online activities<br /><br />Got an A-",
            "comment_workload": "Fine.",
            "rating_content": 2,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "T1hO9hV9chfdcWxN7eAAiWrOHj1Ntg3Q",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Kemist",
            "date": "Dec 31, 2021",
            "title": "CLS grading",
            "comment_content": "Unit 1 Science in Plain English (SIPE) Oral Presentation<br />Unit 1.1 Understanding science communication<br />Unit 1.2 Analyzing audience<br />Unit 1.3 Making science (scientific concepts) more understandable<br />Unit 1.4 Organising and scripting an oral presentation<br />Unit 1.5 Engaging the audience (1) – voice and connected speech<br />Unit 1.6 Engaging the audience (2) – non-verbal communication strategies<br />Unit 2 Case Study Project on a Natural Disaster<br />Unit 2.1 Exploring science and natural disasters<br />Unit 2.2 Exploring natural disasters and their negative impacts Unit 2.3 Conducting a case analysis<br />Unit 2.4 Reporting project progress<br />Unit 2.5 Presentation strategies (1) – use of visual aids<br />Unit 2.6 Presentation strategies (2) – presentation etiquette<br />Unit 2.7 Presentation strategies (3) – Q&amp;A session<br />Unit 2.8 Writing a recommendation report<br />Unit 2.9 Exploring solutions<br />Unit 2.10 Comparing solutions and making recommendation<br />Unit 2.11 Language focus in writing – tone and style in report<br />Unit 2.12 Graphic representation and explanation",
            "comment_teaching": "Piotr is quite nice, except that the grade he gave is a little bit trash",
            "comment_grading": "harsh as fuck<br />Individual presentation (video recorded) 20%<br />Self-evaluation on individual presentation 5%<br />Group progress report 20%<br />iPeer 5%<br />Individual recommendation report 35%<br />Library workshop 10%<br />Online and In-class activities 5%<br /><br />My grades:<br />Individual presentation 19/21<br />Self-evaluation on individual presentation 2/3<br />Group progress report 18/21<br />Individual recommendation report 18/21<br />Library workshop 100/100<br /><br />Final grade A-<br />Honour class students are all very strong in English speaking so that the curve is extremely high",
            "comment_workload": "quite annoying, the presentation requires a lot of effort and communication with groupmates. Luckily my groupmates are not free riders and we met a lot of time to finish our ppt which is quite good in terms of quality.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RkInurDGyFGSaFViqdhcqMpTTQT0k5R8",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 427,
                    "name": "SADHWANI, Dinesh Arjan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Squidgy",
            "date": "Jan 11, 2021",
            "title": "",
            "comment_content": "I can't visualize what he taught, but somewhat not so boring.",
            "comment_teaching": "Dinesh tries to let everyone involved in the discussion during the course, the highly interactive course may be a little awkward, I got used to it later, so not too bad.<br />People will get grouped for assignment 2. And it is randomly distributed by ZOOM, so your luck is determined by zoom.<br />I met a super rubbish group mate and he got confused with his presentation part. The presentation was not well-prepared, so the grading just dramatically fell. I suggest you not to be a ddl fighter or else you will meet this problem like mine.",
            "comment_grading": "3 assessments.<br />assignment 1: 5.5/7&nbsp;&nbsp;6/7&nbsp;&nbsp;6/7<br />assignment 2: 5/7&nbsp;&nbsp;5.5/7&nbsp;&nbsp;5.5/7<br />assignment 3: 5.5/7&nbsp;&nbsp;5.5/7&nbsp;&nbsp;6/7<br />overall gradings: B+<br /><br />I don't know others, but I would say that it is a little bit difficult to aim A range if you are not a native speaker or a fluent English user.",
            "comment_workload": "A normal 3 credit course workload, won't be too much.<br />assignment 1: take a 3 mins video about a scientific concept<br />assignment 2 and 3: a presentation and a report of a natural disaster",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jUzlf71AllWTTaoeg70NW3JON3lvxZWX",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 416,
                    "name": "LAM, Toni",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YSA",
            "date": "Jan 03, 2017",
            "title": "Review for new format of course (since Fall 2016-17)",
            "comment_content": "This is the imaginary 'scenario' which this course is based around:<br /><br />&quot;The School of Science of the Hong Kong University of Science and Technology has been invited by the United Nations Office for Disaster Risk Reduction (UNISDR) (Links to an external site.) to conduct research and/or experiments to contribute to its project, PreventionWeb.<br /><br />The research will be presented as case studies, and based on specific hazards identified by UNISDR. Researchers/Authors of these case studies will be invited to present their ideas at UNISDR’s annual Disaster Risk Reduction (DRR) Conference in Geneva, Switzerland, which will consist of your Final Group Case Study Report and Final Group Case Study Presentation. <br /><br />Prior to that, there is a preliminary session taking place in Hong Kong to help you brainstorm and research into different problems and find other researchers/authors with the same/similar interests for the final submission.&quot;<br /><br />Not sure what is the purpose/point of this. You learn a bit about some natural/man-made disasters, but apart from that not much. Provides some writing and presentation skills practice. Overall the course has little relevance to any other courses you have taken or will take as a School of Science student.",
            "comment_teaching": "Toni is excellent. Very clear, enthusiastic, funny, helpful. I really enjoyed every tutorial session with him. Unfortunately I think this was his last term at UST.",
            "comment_grading": "A preliminary individual case study report: 20%<br />Identifying, introducing and analysing TWO problems <br />Justifying their importance and/or urgency<br />450-550 words for the entire report<br />Individual work<br /><br />A final group case study presentation: 30%<br />Presenting ONE case problem with introduction, analysis, justifications, solutions and recommendations for the problem identified<br />Presentation time: 15 min<br />Q&amp;A time: 4 min<br />Group work<br /><br />A final group case study report: 25%<br />As in the preliminary report but focusing on ONE problem <br />Proposing solutions with justifications recommendations for the problem identified<br />1500-2000 words<br />Group work <br /><br />Vocabulary and Extensive Reading Project (VERP): 15%<br />Bi-weekly submission of a vocabulary list of minimum 24 self-selected vocabulary items (5%)<br />450-550-word written reflective report (5%)<br />5-min verbal progress report with visual aids (5%)<br />Individual work<br />Out-of-class work<br /><br />iPeer: 5%<br />Peer evaluation of group tasks<br /><br />Participation: 5%<br />Attendance at the library workshop on research and referencing skills<br />Participation in discussion and other tasks<br />Punctuality<br />Class attendance<br />Learning attitude<br />Preparation work and out-of-class work<br /><br />Really complex grading involving many assignments, reports, presentations, etc. Need to pay attention to which assignments have the biggest contributions (20-30%) and focus on those.<br /><br />If you are a native English speaker and have some practice with writing reports and presentations, the grading will be quite easy. Class size is only 18, not sure about the grade distribution (if it is curved or absolute). Grades and mean was not released for all assignments, but I got above mean for at least 50% of the assignments and overall grade A.",
            "comment_workload": "Too much workload, especially for a 2000-level LANG course. The work is not very difficult, but just takes up too much time. With all the reports, presentations, vocab lists, etc. you have to spend some time almost every day of the term doing some work for this course. This course had more out-of-class work than all of my Science courses in this term combined. <br />Attendance is also taken and contributes to the participation 5%, and you cannot miss more than 5 tutorials in the term.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "F3pgE62Nj9qtJwPa1sU2nprQlaKaRCUE",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1720,
                    "name": "ZYCHOWICZ, Piotr",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wren",
            "date": "Aug 17, 2023",
            "title": "",
            "comment_content": "This was my first English LANG class at UST, and I do not know how much it overlaps with LANG 1002&amp;1003. For me, the content was kind of useful. The course included science in plain English, a case study about natural disasters, and a library workshop. Genuinely speaking not tight at all for a one-term course. I mainly learned some presentation skills and knowledge about writing a report.",
            "comment_teaching": "Piotr is a very nice person, flexible, and even casual as a professor. He allowed requested leaves (No matter how ridiculous the reason is) and often dismissed the class earlier. Every class he sounded like he did not feel the need to go through all the formatted class materials. Classes were more like chatting. You can make jokes, feel free to move around, and suggest the pace of study. It would be very interesting if you and your classmates were outgoing.",
            "comment_grading": "Good as a LANG course. Curved together with non-honor classes. The majority would get A range.<br />Piotr complained about some killers in LANG2010 himself. And he said he would not make this course a burden with bad grades.",
            "comment_workload": "Some pre-unit quizzes. <br />A 3min video presentation and a self-evaluation. <br />A group presentation. <br />A written report of around 1500 words.<br />A library workshop and a quiz about it.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TVvVA55beLg6m7r7Wwxzdfeabxjq6TnB",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1720,
                    "name": "ZYCHOWICZ, Piotr",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ggg_",
            "date": "Jun 16, 2023",
            "title": "Piotr is a nice guy",
            "comment_content": "The whole course can be divided into preparation for two main tasks throughout the whole semester: Science in Plain English (SIPE) Oral Presentation and Case Study Project on a Natural Disaster, where the latter can be further divided into a presentation and a final recommendation report. <br />Therefore, the contents are mainly techniques for making the SIPE video (e.g. how to engage audience, how to make science more understandable, how to organize a presentation et.), preparing for progress presentation (e.g. making visual aids, presentation etiquette, etc.) and writing a recommendation report (e.g. comparison, visuals, etc.). I actually find the contents quite useful for communicating science, although researching on methods against natural disasters is boring and hard for me. Try to choose a disaster that has a good number of methods would be helpful.",
            "comment_teaching": "Piotr is very relaxed about teaching. He sometimes tell us that he will make next lesson a &quot;self-directed learning&quot;, which means we don't need to come to the class and just need to study the unit by ourselves (which I doubt if anyone did). And he usually dismisses us 20 min earlier than the ending time, which is really nice for a 10:30am~11:50am class. He even seems to not care too much of attendance...<br />As for each class, he usually just follows the notes of each unit on canvas, supplemented with some extra materials or websites that he suggests us to use. Most of them is indeed useful, like using slidesgo for slides or the instruction on writing a recommendation report. He is also quite humorous, and the class atmosphere is comfortable.<br />Just as the previous review said, I would say that &quot;Piotr likes and cares about his students&quot;. He showed us samples from previous students for almost every assignment. He is willing to give feedback if you ask him to. He even sent us an email after the semester ends to thank us and recognize our effort in the assignments. I don't know whether he sends the same email ever year, but all in all I think he is nice. (Just don't be frightened by his height lol)",
            "comment_grading": "At first I was kinda shocked by the fluent English that my classmates spoke coz they really spoke like native speakers. But later it turned out that everyone is very nice and hard work pays off.<br />Science in Plain English (recorded individual video): 20%<br />Self-evaluation on individual presentation: 5%<br />A problem analysis: 5%<br />An Interim Presentation update on case study project (live in class): 20%<br />An individual recommendation report: 35%<br />iPeer: 5%<br />Library workshop: 5%<br />online activities: 5%<br /><br />I think the grading in Honour course is generally better than the normal sessions and Piotr is kinda generous compared to most other lang course teachers...?<br />SIPE: 7/7/7<br />presentation: 7/6/6 <br />final recommendation report: 7/7/6<br />others all full I think<br />A+",
            "comment_workload": "Although honor class seems to generally have better grades, still efforts are needed to get good scores for each assignment, and the workload is quite high. Try to really enjoy the process of communicating science in plain English may make you suffer less (?",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qopqr09D9L1cvitHIk9Psa1LKrX1etdw",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1708,
                    "name": "CRANMER, Yvonne Starr",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kwkwkw",
            "date": "Apr 28, 2023",
            "title": "",
            "comment_content": "An individual presentation (video submission): 3mins<br />Self-evaluation on individual presentation<br />A problem analysis: 150-200 words<br />An Interim Presentation update on the case study project (live in class): 15mins for a group of 4-5<br />iPeer<br />An individual recommendation report: 1200-1700, individual<br />Library workshop <br />Online activities(online pre-unit tasks and out-of-class work.)",
            "comment_teaching": "Yvonne focuses a lot on intonation and rhythm in the two presentations ( individual presentation and group presentation). <br />She will give clear instructions so we just need to follow what she has said. Answer more questions so that she can remember you. It may help to get a higher grade. She is eager to give help if you ask her for advice so don't hesitate. Interestingly, she will look at your outfit in the group presentation. What she said are &quot;I don't know how much my eye affected my brain&quot; and &quot;You look more professional in those outfits&quot;. She wants us to dress in Smart Causal style.",
            "comment_grading": "20% Individual presentation<br />5% Self evaluation on individual presentation<br />5% Problem analysis<br />20% Interim presentation update on case study project<br />5% iPeer<br />35% Individual recommendation report<br />5% Library workshop<br />5% Online activities (pre-class quizzes)",
            "comment_workload": "Quite heavy for me. I spend much time upgrading my presentation script. If you are good at English and giving presentation, the workload will be much smaller.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8VlxpSOLoBcjSUmAY4Y7EK89RYugyjWp",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "randomhuman",
            "date": "Jan 02, 2023",
            "title": "Piotr is a nice teacher",
            "comment_content": "To be honest I don't quite think the content is useful and it's pretty all over the place. Since this is a required course I'd say see it for yourself and you'd understand.",
            "comment_teaching": "For whatever reason Piotr is not on the instructor's list but he's a really nice guy. As mentioned in the content part there really isn't much to learn, so there isn't much I can comment on his teaching. But one thing for sure, he likes and cares about his students so he really deserves an A+ in teaching.",
            "comment_grading": "If you wanna get good grade from Piotr, make sure you adhere to both the rubrics and what he says. It isn't as harsh as others described.<br /><br />20% Individual presentation<br />5% Self evaluation on individual presentation<br />5% Problem analysis<br />20% Interim presentation update on case study project<br />5% iPeer<br />35% Individual recommendation report<br />5% Library workshop <br />5% Online activities (pre-class quizzes)<br /><br />I got A at last.",
            "comment_workload": "The workload deserves a C. <br />I think the most troublesome part of this course is the quizzes. Not academically challenging, there are so many of them that would probably make your head spin. <br />The presentations are pretty fun to work on, and the individual report is not too tough as well, so these three are not bad.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HmqHJRQ3fXnoVXdUIrI8EeGRd4F1kIHn",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Yuken",
            "date": "Sep 25, 2022",
            "title": "",
            "comment_content": "Content is fine, the science may be too easy for ssci students but since the focus is on English, the easy science makes it better to get grades",
            "comment_teaching": "The teacher is engaging and gives jnstructions as well as answers questions after class fairly quickly",
            "comment_grading": "Depending on the students English level the grading may be a bit harsh",
            "comment_workload": "Substantial work but most are pretty easy. No final or midterm in class so working on the assignments is very important. There are group projects, but only a small portion depends on the groupmates.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XVkl9ZLpofCoiYVVzflKhl8ZyyOGFydZ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 427,
                    "name": "SADHWANI, Dinesh Arjan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Udon98",
            "date": "Dec 15, 2018",
            "title": "",
            "comment_content": "There isn't much content that you will learn or require to memorize, which is helpful. <br /><br />The course also engages you to be more proactive about real-world events and problems, such as natural disasters.",
            "comment_teaching": "Dinesh's teaching style is highly interactive, which is reminiscent of a highschool teaching setting.<br /><br />He does not expect correct answers, but rather, justifications of opinions raised when talking about particular topics or concepts.<br /><br />You will also hold in-class discussions, which can be pretty entertaining, since some people can have outrageous opinions that make him laugh.",
            "comment_grading": "Oral Presentation (SIPE): 15% <br />Individual case study proposal (500-600 words): 20% <br />Group presentation (~15 minutes): 30%<br />- The marks for the group presentation are split that contribute to the overall 30% i.e.<br />1) Half the marks are from the group performance<br />2) The other half of the total marks are from your individual performance in the presentation.<br /><br />Group report (2500 word limit): 25%<br />iPeer: 5%<br />Attendance + engagement : 5%<br /><br />Dinesh can be quite harsh with his grading, so be sure to have your reports and works peer reviewed thoroughly to at least score highly on organization and grammar / diction for the group / individual reports.<br /><br />For the group tasks, which contributes the most to your grade. Pray that you won't have horrible teammates that will pull you down. <br />Also, being grouped with people who have good presentation skills will be a huge bonus for your group presentation as well.",
            "comment_workload": "In exchange for no exams, there is heavy coursework throughout the semester. You shouldn't expect an easy A unless you put a lot of&nbsp;&nbsp;effort.<br /><br />The workload becomes especially heavier if you are grouped with free-riders.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZADFP1vAFIPJiNS6PVOfAXYIeX25TMgq",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 423,
                    "name": "YEW, Liza Sook Yee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cabbi",
            "date": "Jan 03, 2020",
            "title": "",
            "comment_content": "the course is centred on 4 tasks (assessments): <br />1.SIPE speech: present a scientific concept to non-science background audience in plain English <br />2.Expository writing on a natural disaster that warrants most attention<br />3.Group project: presentation on methods to deal with a natural disaster<br />4.Individual report based on the group project",
            "comment_teaching": "The teacher is passionate about teaching and shares her own stories in a humorous manner. There are lots of in-class discussions. She also opened a &quot;weekly takeaway&quot; window on canvas, where you can share your thoughts with her. the teacher also responds to emails timely and patiently. Feedbacks for assessments are also provided pretty timely.",
            "comment_grading": "Pretty fair grading based on the performance of the aforementioned four tasks. An important thing to note is the iPeer evaluation of the group project, which takes up 5 percent of the total grade. The system is closed at 9:00 a.m., which could be easily mistaken as 9 pm or 11:59 pm. Attendance is also taken into account.",
            "comment_workload": "the course is quite tightly-scheduled and the content is pretty packed so there is always something to do...",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TcPL5KLHx7zDE4xb8IwzjJvFQUUV7bhF",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 460,
                    "name": "CONWAY, Austin Eugene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yangers",
            "date": "Aug 31, 2015",
            "title": "",
            "comment_content": "Mainly focuses on science communication through creating an innovation product. Science fiction stories and popular science topics such as time travel, are included as unit sections to help. <br /><br />Groups consist of 3-4 people working together to do 2 presentations on a scientific innovation of their creation. Two individual written reports related to the innovation are also included. There are also easy vocab tests and non-graded presentations discussing selected science fiction stories to help with presentation skills.",
            "comment_teaching": "Austin is a very down-to-earth professor and easy to approach. He implements effective ways to help students improve their presentation skills and creates an environment where discussion and constructive feedback are encouraged.",
            "comment_grading": "Overall, this course is relatively easy, so if one works hard enough he/she can easily get an A. Take note that although the written report, presentations and vocab test consist of the majority of the grading scheme, frequent participation in class may help boost the overall grade.",
            "comment_workload": "Compared to other courses, the workload is not that high as there are no exams. The main workload would be simply preparing for the reports and presentations, but that's about it.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pyn2Tko3IdUuPMehDypFNMhmtJVrlLDe",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 460,
                    "name": "CONWAY, Austin Eugene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "butter",
            "date": "Aug 26, 2015",
            "title": "",
            "comment_content": "Minimal content: include a few works of science fiction. Will mostly be used to prepare model presentation.<br />Will be required to give two graded presentations on a new invention of which one will be like a progress report. <br />Along with each presentation, a report needs to be submitted online.",
            "comment_teaching": "Very nice professor, will tell you about the essence of presentation, and expression without ever making you feel like its being done in an academic way.",
            "comment_grading": "Lenient grading. Just participate in the class, pay attention to what the professor says and incorporate it in your reports and presentations.",
            "comment_workload": "Equivalent to non-existent. The professor makes sure there isn't amount of stress/pressure.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}