{
    "error": false,
    "course": {
        "id": 2851,
        "subject": "LANG",
        "code": "1004",
        "name": "Mediated Me: An Introduction to Digital Literacy",
        "description": "This introductory course will help students explore the impact of digital media texts (such as podcasts, wikis, and social media like YouTube) on academic, professional and social communication practices. The course will enable students to be: critical of current digital communication practices; reflective of their communication and participation through digital media; aware of how digital communication can impact language delivery; and reflective of their English language development. To achieve this, the course guides students in developing basic knowledge of digital literacy theories and practices and to produce their own digital media texts for English communicative purposes. Students will undertake authentic tasks related to their academic and future careers that enables them to achieve the necessary communication skills in a digital world.",
        "categories": [
            "Common Core (H)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2130,
            2110,
            2030,
            1930,
            1830
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.11,
        "rating_teaching": 4,
        "rating_grading": 4.22,
        "rating_workload": 3.33,
        "review_count": 9,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 412,
                "name": "CHAN, Jessica",
                "count": 7
            },
            {
                "id": 410,
                "name": "MCMINN, Sean William John",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "GAaeCd9imCQqA25z2Z6R1pfMAT69cdG2",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 410,
                    "name": "MCMINN, Sean William John",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CyrusL",
            "date": "Jun 11, 2019",
            "title": "",
            "comment_content": "In my opinion, this course is broad and deep enough to provide some new insights, even if you are highly digital literate.<br /><br />The syllabus for this semester is summarized as follows:<br />Week 1 | Defining digital literacies<br />Week 2 | Multi-literacies and multi-modality<br />Week 3 | Multi-literacies and multi-modality<br />Week 4 | Meaning-making through social media<br />Week 5 | Re-mixing and mash-ups<br />Week 6 | Hyper-reading and hyper-writing<br />Week 7 | Online language<br />Week 8 | Critical digital literacy<br />Week 9 | Online cultures<br />Week 10 | Digital practices: learning and literacy<br />Week 11 | Digital practices: collaborative communication<br />Week 12 | Digital practices: literacies at work<br />Week 13 | Brave new world<br /><br />The latest syllabus is available on the LANG website: https://cle.ust.hk/courses/lang1004/",
            "comment_teaching": "This is a flipped classroom course, consisting of online out-of-class work (via Canvas) and face-to-face lessons (one per week). It is important that you complete the online component before coming to class, otherwise you would easily get lost during the lesson. Also, as mentioned in the Grading section, some in-class activities are closely tied to the assignments, so be extra sure not to skip those classes.<br /><br />[Online Work]<br />This consists of video lectures, reading materials, and pre-class tasks. The video lectures are produced by the instructor himself and serve to provide background information for the reading material (be warned: they have quite a number of typos). The reading materials provide additional information on the subject matter and may vary greatly in length. Do not worry - the really long ones are optional. The pre-class tasks consist of several questions designed to test your new-found knowledge, which I find quite appropriate.<br /><br />[Face-to-Face Lessons]<br />Do bring an electronic device, preferably a laptop, as many of the in-class activities are carried out online (such as working on a Google Docs worksheet as a group). These activities will continue to be accessible on Canvas after class. There is also a Kahoot session at the very beginning of the lesson to help you recall the contents of the online materials.<br /><br />The instructor makes good use of multimedia to deliver the in-class content - as expected for this course. Similar to the in-class activities, you can refer to the presentation slides on Canvas after class as well.<br /><br />Much of the class time is dedicated to group or class-wide discussion based on the aforementioned content. Unfortunately, the mood of the discussion had been somewhat ruined from the midterm onwards as many students began to skip class.",
            "comment_grading": "The latest grading scheme is summarized on the LANG website: https://cle.ust.hk/courses/lang1004/<br /><br />Scroll to the bottom to see my grades.<br /><br />----<br />[Quizzes (20%)]<br />There are four online quizzes (hosted on Canvas) which collectively cover the content from weeks 1-12. Each quiz comprises of 9 multiple-choice questions (1 mark each) and 1 essay question (10-11 marks), and you have unlimited time (until the deadline, of course) to complete them.<br /><br />Note that the quizzes are open-book and can be done anywhere. You may even discuss the answers with other students before submitting the quiz - just be sure to steer clear of plagiarism when working on the essay.<br /><br />[Online Discussion Forum (20%)]<br />The online discussion forum (hosted on Canvas) is conducted in groups of 8 to 9. For each week during weeks 5-13 (omitting one week if there are only 8 people in the group), group members take turns being the discussion leader, who is in charge of preparing the discussion prompt and facilitating the group discussion. The discussion prompt need not be related to the course syllabus, as long as it is within the theme of digital literacy. You may refer to the pre-class tasks when structuring your discussion prompt.<br /><br />Leadership performance constitutes 10% of the course grade, while the other 10% is based on overall participation (you are expected to participate weekly). Both are graded on the familiar 7-point scale.<br /><br />Some have contributed long replies during the group discussion (similar to HUMA 1000). This is unnecessary and may even discourage others from posting anything, and as such, is not recommended. It is better to have many shorter replies than a few long ones.<br /><br />[Informative Webpage/Blog/Wiki (20%)]<br />This first assignment requires you to create an informative webpage/blog/wiki for the HKUST community about an academic- or university-related topic, within 250-400 words.<br /><br />Some of the in-class activities will be dedicated to blog/wiki page creation on Wordpress. If you have no experience in blogs/wikis, it is highly recommended that you attend class, otherwise you will face many difficulties when working on the assignment.<br /><br />This assignment is graded based on 7-point scales for Content &amp; Context, Multimodality and Language &amp; Accuracy, resulting in a total score out of 21. Be sure to pay extra attention to Multimodality - this is, after all, the only component that is specifically related to the course, and in my opinion, the trickiest of the three to get right.<br /><br />[Podcast &amp; Rationale (40%)]<br />The second, and final, assignment consists of a video/audio podcast segment for an international audience on a subject related to the Hong Kong community, and a corresponding rationale for an academic audience that demonstrates the reasons for the design of the podcast segment.<br /><br />The in-class activities will equip you with basic audio-editing skills using the software Audacity (another reason why you should attend class). It is entirely optional to create video content for the podcast.<br /><br />The podcast should be 3-4 minutes in duration and is graded based on the same criteria for the first assignment. This section accounts for 30% of the overall score, making this the most important part of the course in terms of grading.<br /><br />The rationale should have approximately 1,000 words and is graded based on 7-point scales for Analysis &amp; Evaluation and Language &amp; Accuracy, resulting in a total score out of 14. This takes up 10% of your course grade.<br /><br />----<br />Below are my grades (as with mainstream LANG courses, no mean scores are available):<br />Quiz 1 | 16.67/19<br />Quiz 2 | 17.33/19<br />Quiz 3 | 17.5/20<br />Quiz 4 | 17/20<br />Discussion Leadership | 7/7<br />Discussion Participation | 6/7<br />Informative Wiki | 19/21<br />Audio Podcast | 16/21<br />Podcast Rationale | 11/14 <br /><br />Overall grade: 84.95% (A-)<br /><br />For a 1k-level common core course, the grading is pretty good. However, getting this score for the mainstream LANG courses would have definitely earned me an A or even A+. I am not sure whether this course utilizes absolute or relative grading (as far as I know, the mainstream LANG courses implement absolute grading).",
            "comment_workload": "Overall, about average for a 3-credit course.<br /><br />[Online Work]<br />Personally, I require between 30 minutes and 1 hour to go through all of the required materials each week. This may vary with reading speed (mine is relatively slow because I process the content at a deeper level).<br /><br />[Quizzes]<br />The multiple-choice questions are a cakewalk because they are quoted directly from the video lectures, reading materials and/or in-class presentation slides, which are all available on Canvas, making it trivial to find the correct answer (use Ctrl+F). The essay question may take a while to complete though (around 300 words). You should be able to complete each quiz well within 1 hour.<br /><br />[Online Discussion Forum]<br />Quote from the instructor: &quot;This is a 3-credit course, which means classroom interaction (online and face-to-face) needs to be equivalent to 3 hours per week. We meet face-to-face 1.5 hours each week, which means online interaction should be at least 1.5 hours per week. Online interaction includes the video lectures and discussion forum activities. Readings, which I will try and keep short, are considered separate (i.e. homework).&quot;<br /><br />TL;DR: Spending 1.5 hours on the discussion forum per week (not including the drafting of your discussion prompt as leader) is more than enough.<br /><br />[Informative Webpage/Blog/Wiki]<br />Most of the time is spent on research and design. If you have grasped the basics of blog/wiki page creation from the in-class activities, 4 hours should be more than sufficient for the whole thing, which is only 400 words long.<br /><br />[Podcast &amp; Rationale]<br />As if preparing your script wasn't enough, you have to go through the tedious process of (re-)recording your speech, downloading various sound effects from copyright-free sources, and editing them to form the podcast segment. Then you have to explain your design with a 1,000-word document. Expect yourself to spend at least 10 hours on this assignment.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 9,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IAeW0CTAhyp3HPE2dxZChu1zmsP6shVQ",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hahalol",
            "date": "Feb 01, 2023",
            "title": "dun reg!",
            "comment_content": "same as others",
            "comment_teaching": "Jessica is fine in f2f teaching, she is nice. however, cause nearly the end of the semester, she is on pregnancy leave and thus there's a Mark guy sub in. He is super unreasonable for the grading like even he wrote my rationale for the podcast is well-written and some sort, he gives me super low mark. Anyway the grading is absurd and for the last 3 lessons taught by that Mark, I think it is complete waste of time lmao. Teaching is so shxt",
            "comment_grading": "shxt grade by Mark<br />but decent and sensible grade by Jessica.<br />That E is for that Mark guy.",
            "comment_workload": "super heavy, you got a lot of work to do. totally not worth it",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "d1TDKEbSaaU8KzzzrvFYynlqcLGrmx5k",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kimjaewon17",
            "date": "Aug 24, 2022",
            "title": "",
            "comment_content": "Content is relatively easy and are about things that we normally face on the Internet.<br />Content amount is also not overloading.",
            "comment_teaching": "Online teaching.<br />Very interactive.<br />Not sure about what will be taught when f2f classes resume.<br />Assume that it will still be very interactive.<br />Instructor encourages discussions very well and is clearly knowledgeable on the topics we discuss.",
            "comment_grading": "Grading is fair.<br />Comments are provided on why a certain grade was given.<br />However, without any effort, you cannot expect to get a good grade.",
            "comment_workload": "A lot of out of class activity but makes up by only having one class per week.<br />Out of class activities are key to catching up with the class material.<br />Two analysis essays and a podcast.<br />Grades will be proportionate to the amount of time spent on them.<br />Have to participate in online discussions every week.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xMWTkcCR9B3Ly6zds2EFF38GsnRWj4Hb",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Elon Musk",
            "date": "Jun 05, 2021",
            "title": "Requires great discipline and critical thinking",
            "comment_content": "Normal LANG course have 2 lectures per week, but LANG1004 only has 1, and the remaining 1.5 hour is allocated to self- reading and preparation. I like the flexibility of this course, because for normally I use 1 hour for out-of-class work instead of 1.5 hours. Although the 1.5 hour is optional, it definitely helps you to stay on track in this course.",
            "comment_teaching": "Jessica studies Masters in Linguistic in Oxford. She’s very passionate in teaching and she always inspire us to think beyond the context. During class, she often recall materials mentioned in previous class as well as out-of-class readings. This helps us to express what we have learnt, which is essential what the Meme and Podcast is about.<br /><br />It is optional to turn on the camera on during class, but if you turn on the camera and participate, Jessica definitely remembers you, and she tries her best not to leave you out. For me, if I stay inactive, I find it less able to understand the content, because it’s quite deep when it comes to the middle of the course.",
            "comment_grading": "Grading is linear. Jessica definitely knows whether you understand the content well. Although there’s no participation, staying active in class must help with your understanding of the out-of-class preparation and what she wants out of the course. <br /><br />1. Quiz x4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />2. Group Lead Discussion (lead discussion for 1 week) 10%<br />3. Discussion Participation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />4. Meme Assignment&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />5. Podcast + Rationale&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;30%+10%<br />---------------------------------------<br />1. Quiz x4 (20%)<br />Quiz 1: 15/19 (x̄=14.5)<br />Quiz 2: 16/19 (x̄=15.5)<br />Quiz 3: 17.5/20 (x̄=16.2)<br />Quiz 4: 19/20 (x̄=16.7)<br /><br />2. Group Lead Discussion (10%) 7/7 (x̄=5.7)<br />3. Discussion Participation (10%) 7/7 (x̄=5.6)<br />4. Meme Assignment&nbsp;&nbsp;(20%)&nbsp;&nbsp;&nbsp;&nbsp;14/20 (x̄=15)<br />5. Podcast + Rationale&nbsp;&nbsp;&nbsp;&nbsp;(30%+10%) 33/35 (x̄=27.1) <br /><br />I messed up the Meme assignment but did excellent in the Podcast assignment and discussions. I ended up securing an A. <br /><br />Work hard, stay disciplined, you’ll get a good grade- reasonable course&nbsp;&nbsp;😊",
            "comment_workload": "Workload is reasonable, the largest workload are the Podcast and posting many comments in discussions. Comments are roughly 200 words per reply and you are expected to read others comments before your reply. Jessica knows whether your comments are high quality because she really reads them one by one. <br /><br />The Podcast is quite time consuming and it requires a lot of creativity and attention (depends on your desired quality). It’s like twice the workload of assignments from a business course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3yBqCeJtooR2hEZfbzfYDtJCPXV5qU6J",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ip",
            "date": "Jun 04, 2021",
            "title": "Not an easy A course, its a self-learnt and demanding course.",
            "comment_content": "Huge focus on multimodality which means using visuals, audio, linguistics,spatial and gestural effect to produce digital work<br /><br />Other topics - you can refer to the syllabus on lang centre website",
            "comment_teaching": "Blended teaching - 50% online learning and 50% lectures (only one lecture throughout the week, attendance not taken)<br /><br />Upside - can skip all classes and watch lecture vids when necessary<br /><br />Downside - a bit messy, most of the online learning materials are just copy and paste of research papers, or a random website, or some youtube videos without explanation/ further analysis by the instructor. Most of these online materials shared would not be covered/ explained in class. Also, concepts taught may not be sufficient to explain your digital work in your essay especially for the final project ie&nbsp;&nbsp;podcast as you have to elaborate on the &quot;skills you've applied&quot; in an academic context such as conceptualising reasons why the background music is used here and there when in fact, its just based on your &quot;feel&quot;. I actually googled some extra concepts to elaborate.<br /><br />For the remaining lesson per week, there'll be &quot;brief review of key concepts&quot; + &quot;breakout rooms + whole class discussion&quot; + &quot;wrap up&quot;<br />breakout rooms+ whole class discussion makes up the largest portion of the lesson. you have to complete worksheets and will be asked to share your ideas randomly in the whole class discussion. Participation is optional even though it sounds demanding (no attendance taken). The breakout activity will be on application of concepts taught in diff examples (ads, youtube videos). In my opinion, they are not very useful towards our assignments especially the podcast one. No breakout activities were on analyzing podcasts.<br /><br />Some lang courses may hold consultation sessions, but not this one.",
            "comment_grading": "Grading is good given that I put much effort in it. A range achieved.<br /><br />Upside no attendance, you can produce some digital work which can be useful in the future, all individual work<br /><br />Downside heavy workload, not much support from lang tutors, relatively demanding requirement",
            "comment_workload": "Heavy workload.<br />-4 quizzes throughout the sem. 9 mcqs and 1 short essay ans on canvas. mcqs are just copy and paste directly from lecture notes and online materials including videos, but it takes much time to find the details as you can't ctr f if the ans is in the videos. Long ans can be tricky - make sure you answer with all the relevant concepts taught in class and explain thoroughly with sources. I personally spend around 2 hours per quiz although it may be because i skipped all the lectures and didn't complete pre lesson tasks. i still revisited the lect vids when necessary.<br /><br />-Canvas discussion forum participation<br />You have to participate on the canvas discussion every week to &quot;demonstrate your digital literacy skills&quot;. I posted around four replies every week. It definitely takes time every week to produce some content. <br /><br />-Canvas discussion forum leadership<br />You will be assigned a week to lead your group to discuss on your selected topic on the discussion forum. You have to design your own discussion prompts. People usually provide a few guided questions and attach some relevant videos to discuss. <br /><br />Midterm project - meme assignment with 800 words essay justifying the design<br />Think of a topic on your own and create a meme with the multimodality skills learnt. You have to explain how your meme fits the context of the target audience. I feel like i was making an advertisement except the fact that i have to self create a context/ topic for it. <br /><br />I spent around 3 days to think of a topic, relevant slogans and research relevant pictures, 1day to design the meme, and 1.5 days on the essay<br /><br />Final project - podcast assignment about local community that targets international audience and 1000 words essay<br />1. Podcast can be audio and video (with visuals effect). I chose audio and I still got a very good mark, so don't worry if you want to choose audio. Just pay attention to the remixing of sounds and try to choose a topic that actually have some sounds to represent the environment you are describing (eg dog barking) other than background music. <br />2. Also pay attention to the choice of topic - it should be about local community.<br />3. Content - it has to be factual based, eg about some history of your chosen topic, some facts and figures, how scholars talked about it. You have to cite the references used for your podcast content in your essay, so you have to find a scholar article to support the facts found. (Pretty demanding)<br /><br />I spent around 4 days to think of the topic that fits the above requirements and research on the&nbsp;&nbsp;topic, 2 days on finalizing the content and recording, 1day on remixing sounds, and 1 day on essay writing",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "muxJ1XFcf9hedPV6OXcFDdtfDELJ6Uui",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 410,
                    "name": "MCMINN, Sean William John",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fungch",
            "date": "Aug 31, 2020",
            "title": "Prof so nice !!",
            "comment_content": "Basically tell you how to communicate with others online, like different modalities, and how to deliver your message clearly in digital way. Personally I think it is quite fun and useful.",
            "comment_teaching": "Sean is just soooo nice. The atmosphere is so chill and relaxed and I looked forward to his lessons every week! He tried to understand and gave feedback to students even if you can't talk fluently.",
            "comment_grading": "Good grade! <br />all online quizzes are easy, just take a look in the ppt and you are good to go! <br />no exam, no mid-term <br />the final assignment is to make a video and introduce a topic, need some research and video technique. I felt like my work was not good, but Sean gave me B+ !",
            "comment_workload": "low workload! <br />some optional reading throughout the semester. Even if you don't read its okay you can just sit and listen to others ' sharing in the lesson. Sean would not force you to answer any question! <br />Since only one lesson per week, no need to spend too much time to do preparation! <br />There's online forum in canvas, possibly the most troublesome task. But just spend around 1.5 hours each week and leave some comments, not very difficult!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ip2C2UZFctOhab2Tl7FaZcGkTkxUmuAw",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cheese",
            "date": "Jun 11, 2020",
            "title": "Unexpectedly good grade course - for learning",
            "comment_content": "You can see the details in the other comments.<br />Mostly about theories on digital literacy.<br />1.The use of multimodality<br />2.The use of digital rhetorical devices<br />3.The use of digital tools (i.e. hashtags, hyperlinks)<br />4.The learning of digital platforms (i.e. infinity spaces, zoom)<br />5.The learning of psychological influence (i.e. cognitive bias, social prejudice)",
            "comment_teaching": "The course is divided into two parts, online learning conducted by Sean and online teaching (for COVID 19) conducted by Jessica.<br />This means that you will still need to participate 1.5 hr for each part but fortunately, you just need to attend the online teaching part at the designated time. You just need to perform online learning anywhere and anytime you like, and finishing all the pre-class work would not even take you for a full 1.5 hr.<br />So in general, the course is fun and teaches you how to look at the use of the internet in a different way.<br />For example, you wouldn't look at the same advertisement the way it seemed to be anymore. You will know how to analyze it and how it attracts its audience.",
            "comment_grading": "The grading reflects what you deserve.<br />4 Quizzes 20%<br />Quiz 1 14.67/19<br />Quiz 2 16/19<br />Quiz 3 17.5/20<br />Quiz 4 18.75/20<br />10% 1-week Discussion Forum Leader 7/7<br />10% Discussion Forum Participation 6/7<br />20% 1 midterm assignment for creating memes 17/21<br />30% 1 final assignment for creating podcast 21/21 (I paid a lot of effort) + 10% for podcast rationale 13/14<br />Eventually getting an A, fair grading.",
            "comment_workload": "The workload is fair and please expect some workload each week, especially when dealing with the pre-class assignment. Please finish them on time as they help you understand each chapter.<br />No final and no midterm. They are replaced by creating digital works that require your creativity, imagination, and critical thinking skills.<br />The quizzes only consist of MCs and one 200-300 words essay relating to the recent 3 topics discussed. I think they are pretty easy to handle.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mgT5lvTIvPQYrNtermYZ7PW1SsjZfhWq",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "asdfghjkl",
            "date": "Jan 26, 2022",
            "title": "Ok",
            "comment_content": "Learn to analyse tactics used in doing any forms of marketing, posts/videos/ads etc.",
            "comment_teaching": "Skipped but shes so good that she gives detailed comments for each individual assignment. You can know whats missing and her expectation after the first assignemnt.",
            "comment_grading": "Quiz1-17/19<br />Quiz2- 18/19<br />Quiz3- 16.5/20<br />Quiz4- 15.5/20<br />Group discussion lead- 4/7<br />Discussion contribution-5/7<br />Meme- 16/21<br />Podcast- 26/35<br />Grade: A- (I thought my scores are low, dk why A range)",
            "comment_workload": "Not that heavy but very mafan, every week has sth to do. (each week ard 2-3 hrs)<br />I personally didn't spend so much time on this course, I do all assignments one day before deadline. (ard 7 hrs for each assignment)<br />I think it is important for you to choose a good topic, interesting and easy to do.<br />Memes and Podcast assignments need blow water, use the class concepts as many as possible lol I sometimes dk what did I write",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2Pjy6eOAmKlmJ6BwGP9h6xT5TkdVY1Wg",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "傲慢的香蕉",
            "date": "Dec 12, 2020",
            "title": "How to be a online celebrity",
            "comment_content": "Digital stuff analysis and delivery<br />Multi-modality<br />Critical think and so on<br />Every week different topic but not hard to follow if u read all online readings<br />Quite interesting<br />Different types of assignments<br />Can learn how to make a meme and podcast<br />U will need to learn using Photoshop and sound editing software<br />U can try to be a KOL after this class",
            "comment_teaching": "Online teaching<br />Nothing special<br />Hopefully not morning class<br />Attendance is not counted<br />Teaching Mode<br />Refer to online material first<br />Teach with ppts with extra info <br />Random group work <br />Interactions in class as a LANG course<br />Optional reflection poll at last every class as she will not force u to hand in",
            "comment_grading": "Score<br />Quizx4&nbsp;&nbsp;75%<br />Meme assignment&nbsp;&nbsp;~72%<br />Podcast+rationale&nbsp;&nbsp;~76%<br />Discussion leading &amp; contribution ~93%<br />Final grade B<br />Ok la<br />一分耕耘 一分收穫<br />Put more time polish assignment give a high grade<br />Me no complaints",
            "comment_workload": "Not so harsh<br />Read materials and discussion+ 1 lesson per week<br />Criteria of discussion is not high<br />Just answer the question and give some feedbacks for other comments<br />Leading discussion not hard also<br />Just refer to group mate comments<br />Summerize points and elaborate<br />1 Quiz each 3 weeks<br />No time limit make sure do well before deadline<br />I do not notice for first quiz so only 75% <br />9MC+1LQ just all refer to online notes <br />Ctrl F if necessary<br />LQ answer as detail as possible and don't misunderstand the source<br />Otherwise, u become a stepping stone for others🙃",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}