{
    "error": false,
    "course": {
        "id": 745,
        "subject": "LANG",
        "code": "2010",
        "name": "English for Science I",
        "description": "An English course for students of the School of Science. The course introduces students to the language and discourse of science and develops their competence in speaking and writing about scientific topics.",
        "categories": [],
        "website": "http://cle.ust.hk/courses/lang2010",
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2040,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "CORE 1403 OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1404\" href=\"/review/CORE1404\" target=\"_blank\">CORE 1404</a> OR LANG 1003 (prior to 2022-23)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.41,
        "rating_teaching": 3.98,
        "rating_grading": 3.85,
        "rating_workload": 3.15,
        "review_count": 46,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 423,
                "name": "YEW, Liza Sook Yee",
                "count": 6
            },
            {
                "id": 878,
                "name": "YIP, Ka Yue Carmel",
                "count": 6
            },
            {
                "id": 333,
                "name": "CHI, Man Lai Amy",
                "count": 3
            },
            {
                "id": 330,
                "name": "FUNG, John",
                "count": 2
            },
            {
                "id": 418,
                "name": "AU, Chui Han Anita",
                "count": 2
            },
            {
                "id": 420,
                "name": "LAM, Chak Yan Jessie Teresa",
                "count": 2
            },
            {
                "id": 456,
                "name": "YUEN, Ka Ming",
                "count": 2
            },
            {
                "id": 876,
                "name": "SIU, Chi Ming Anthony",
                "count": 2
            },
            {
                "id": 1303,
                "name": "CHAN, Thomas Anthony Chun Hun",
                "count": 2
            },
            {
                "id": 1325,
                "name": "HOGUE, Teresa",
                "count": 2
            },
            {
                "id": 332,
                "name": "LEE, Pui",
                "count": 1
            },
            {
                "id": 411,
                "name": "MEGAN, Melissa Jane",
                "count": 1
            },
            {
                "id": 413,
                "name": "YU, Anna Wai Yin",
                "count": 1
            },
            {
                "id": 436,
                "name": "TSANG, Alfred Jones",
                "count": 1
            },
            {
                "id": 440,
                "name": "WONG, Elaine Suk Yi",
                "count": 1
            },
            {
                "id": 463,
                "name": "FOO, Pionie Kim Ling",
                "count": 1
            },
            {
                "id": 881,
                "name": "FARMER, Rebecca",
                "count": 1
            },
            {
                "id": 1049,
                "name": "CHEUNG, Colin",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "eywhkcEBjQoPJKEqeZRb01dJDPpcUZbE",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "燃燒中的GPA",
            "date": "Jan 18, 2020",
            "title": "願GPA亡魂安息",
            "comment_content": "如果要舉辦 &quot;科大擾民垃圾course選舉&quot;, LANG2010一定榮登冠軍寶座<br /><br />“LANG2010唔喺事主個timetable出現就冇事, 出現得喺嗰度就可能有被人秋後算賬嘅風險”<br /><br />喪心病狂的爛grade集團LANG Center利用2015-16 spring sem LANG1003 Vocab Test集體作弊案, 以&quot;更有效學習vocab&quot;為名, 強行將LANG2010原有的vocab tests取消, 並以vocab lists及flashcards (見excel檔) 取代, 此舉不但對英語學習毫無幫助, 反而浪費事主大量時間, 導致其他科目的學習進度和成績受拖累, 實在是百害而無一利<br /><br />LANG2010現正被控以下列罪名:<br /><br />-內容空廢, 不切實際 (討論什麼disaster? 這個course本身就已經是一個disaster)<br /><br />-借刀殺人, 謀殺事主的GPA, 破壞事主GPA安寧 (事主2016-17 fall sem的GPA是在全部8個sem之中最低)<br /><br />-摧毀事主一年前辛苦建立的CGA及GGA, 導致事主要花上兩年時間將CGA及GGA重建, 遺禍人間<br /><br />-騎劫事主2016-17 fall sem僅餘的休息時間, 損害事主身心健康",
            "comment_teaching": "由於GPA謀殺案對事主衝擊太大, 事主已經忘記了操縱LANG2010的幕後主腦叫什麼名字, 只是隱約記得是其中一名course writer, 嚴格依照course requirements要求事主和同學交齊5份vocab lists及flashcards <br /><br />作為course writer理應能為每個assessment提供清晰的指示, 讓同學知道每個assessment該如何完成, 可笑的是, 事主班裡英語能力較高的IRE同學表示, 在閱讀course writer的email後仍然不知道VERP verbal learning progress report是要做什麼, 如此不清晰的指示對於英語能力不太高的同學來說更是無所適從<br /><br />另外, 從事主朋友的朋友得知, 部分非course writer的幕後主腦並不熟悉LANG2010的行兇動機, 竟然自作主張提出flashcards部分可省略<br /><br />教的人不知道自己在教什麼, 學的人也不知道自己在學什麼, 可見無論幕後主腦是誰, 都改變不了LANG2010的擾民本質",
            "comment_grading": "除了慣常的行兇手法 (individual case study preliminary report 20%, group case study presentation 30%, group case study final report 25%, iPeer 5%, participation 5%) 外, LANG2010還採取了一種新的行兇手法, 名為Vocabulary and Extensive Reading Project (VERP, 見pdf檔), 不但要求事主繳交合共5份, 每2星期1份的vocab lists及flashcards (共5%, 每份1%), 更要求事主在Week 8堂上口頭匯報VERP進度 (verbal learning progress report, 5%), 並在Week 14繳交一份450-550字的反思報告 (reflective report, 5%), 值得一提的是, 口頭匯報是會錄影的, 而反思報告是會經Turnitin檢查有否抄襲, 有關安排可謂居心叵測<br /><br />LANG2010謀殺事主GPA的手法相當純熟, 只公佈了individual case study preliminary report (20%) 的分數 (5/4/6/5 = 20/28), final grade顯示為 “B”, 令事主的GPA死無對證<br /><br />躲在LANG2010背後的爛grade集團LANG Center經常強調LANG courses (特別是英LANG) 可以提升事主的語文水平, 事實卻是欠缺透明度, 經常不公佈任何分數, 也不給予writing/speaking assessment的評語, 往往只有一個letter grade而已, 事主根本無法從LANG courses中獲得有用的意見和分數作出改善, 更遑論提升語文水平, LANG Center應立即停止有關 &quot;LANG courses有助提升語文水平&quot; 的癡心妄想<br /><br />先不談LANG2010的workload大得不合理, 連最基本的分數和評語也欠奉, 又何談提升英語水平? 可見LANG2010的存在意義與普通的pass/fail courses (如HLTH1010) 根本無異, 目的是為事主的學業添煩添亂, 其擾民本質顯而易見",
            "comment_workload": "事主當然不希望fail LANG2010要retake, LANG2010當中佔85%的course grade暫且不談, 單是1份僅佔1%的vocab lists及flashcards, 動輒要花上事主數小時甚至數天時間去完成, 事主逼不得已犧牲溫習其他科目的寶貴時間, 更拖垮了其他科目的成績, 最終換來的只有一個B, 英語能力卻不見得有任何改善<br /><br />而更可笑的是, VERP聲稱是一個自主學習的過程 (見pdf檔Objectives部分), 既然是一個自主學習的過程, 又何必在LANG2010中佔15% course grade呢?<br /><br />再者, LANG本來的目的是輔助主修科目的學習, 按道理LANG的workload不應比主修科目大, 然而LANG2010的workload相對主修科目而言, 可謂有過之而無不及, 實有喧賓奪主之嫌, 而VERP對主修科目的學習更是成事不足, 敗事有餘<br /><br />可見VERP名義上是個 “自主學習vocab, 提升英語水平” 的Project, 本質上是種借刀殺人, 浪費事主的時間來拖累其他科目的學習進度和成績, 繼而謀殺事主GPA的行兇手法<br /><br />據事主觀察, VERP這種行兇手法現時似乎沒有再出現, 但事主不知道VERP到底是被爛grade集團LANG Center完全 &quot;撤回&quot;, 還是已成 &quot;明日黃花&quot; 並 &quot;自然死亡&quot;, 抑或只是被 &quot;暫緩&quot; / &quot;押後&quot; / &quot;擱置&quot;, VERP的下落仍是未知之數, 只要爛grade集團LANG Center一天還沒有 &quot;壽終正寢&quot;, VERP還是會有借屍還魂的可能性, 請各位後人引以為戒<br /><br />可以肯定的是, LANG2010在事主心中如夢魘揮之不去",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 62,
            "vote_count": 63,
            "voted": false,
            "is_upvote": false,
            "comment_count": 4,
            "attachments": [
                {
                    "key": "CAePFo4URRWBw2Np7lPgwgFbaKXdjwkZ",
                    "name": "LANG2010 vocab submission template",
                    "format": "xlsx"
                },
                {
                    "key": "ODGdraxJf8xyKSVNcVZW2l1Okb4pLgCx",
                    "name": "VERP",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "sK4Meque71ehhlUgV4je8owtYRAIbFSG",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 1049,
                    "name": "CHEUNG, Colin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "0_0",
            "date": "Jun 07, 2017",
            "title": "UST need to stop forcing ppl to take all these trash bad grade course",
            "comment_content": "Trash.<br /><br />Although this course is called &quot;English for Science&quot;, ironically, chances are your instructor will not even have a science background or even care about science at all. As a result, the objectives of the course are really vague. While it seems like that the main theme of the course is to teach you how to communicate with the general public about science, you're asked to write something in a more technical setting, but you would get criticized if you write something too technical that the instructor cannot understand (WTF?). And honestly I don't see the point of the course, I had taken like some 10 years of English classes just to learn how to communicate with the general public, I don't need another course to teach me the same thing just on a different setting. I was expecting the content of the course to be something more intellectual, like how to communicate with other experts as a SCIENTIST, but not how to tell good science story to a random person on the street, like the course instructor. <br /><br />Honestly, I have learnt nothing from the course. The whole course design is so centered on the final group project. So instead of trying to improve your writing and presentation skills, the focus of its content is literally on how to score high on the assessments. So I paid my $42,100 to get educated, and now you're saying that I have to take a course just for the sake of passing it? What a waste of time.<br /><br />Occasionally, there would be lessons trying to teach you some writing skill, but they are in general lacking in depth and are really of no uses. Though the course won't bother to really try to improve your English, your &quot;performance&quot; and grade in the course are solely assessed based on your English proficiency. C'mon UST, I already have my secondary school exams, LANG1002 and LANG1003 to tell me how bad I'm in English; I really don't need another course to tell me that again. It is ENOUGH.",
            "comment_teaching": "Colin is a nice guy. At least he doesn't run the class in a secondary school style, which many local instructors loved to, and make the classroom has a somewhat relaxed atmosphere.<br /><br />Beware though, he seems to have really high standards and very strict grading (please see &quot;grading&quot;).",
            "comment_grading": "From my impression, the grading of LANG2010 is even worse than LANG1002, LANG1003.<br /><br />I had unfortunately had a killer instructor back in LANG1002, but I still managed to get a B+ at the end, and I had gotten a A- for LANG1003. But I only got a B for this course, even though I had spend almost 3 times as much effort on it as compared to 1002 and 1003.<br /><br />The grading has zero transparency. I still have no idea exactly what scores I got for the assessments.<br /><br />Only the score for the first writing task is released. And I scored quite poorly on that one (4's and 5's) because I didn't follow strictly on the &quot;suggested structure&quot; of the assessment, even though I have addressed all the different parts of the task. The grading is unexpectedly strict; literally every single spelling mistake counts (I had been criticized for a typo). I guess there is again that &quot;impressionism&quot; thing in the grading of all these LANG course. If you scored low on one of the grading criteria, chances are you would score bad on all of them, unless you are really good. Be sure to triple check with the rubric before submitting.",
            "comment_workload": "Quite a lot.<br /><br />You had to submit two vocabulary lists on week4 and week 11. The vocab lists are really useless but extremely time-consuming. Then on week 7 you need to make a 5-min presentation about how that vocab list shit helped you learn new vocab (Ikr, wtf.)<br /><br />Then there is a individual writing task, a group presentation and a group writing task.<br /><br />The individual is only about 500 words, but it is due in some of your busiest days during the midterm period.<br /><br />The group project would take you quite a lot of time to prepare and complete, unless you are really good in English. I myself had spent almost the whole last three weeks in the semester doing nothing but this shit.<br /><br />But the sad truth is, your effort is not proportional to your grade. The more time you need to put on your project, the more likely you are will receive a bad grade at the end...because the whole point of the course is to remind you how bad is your English.",
            "rating_content": 1,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 25,
            "vote_count": 25,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XUy5c7eJiPfvZeN4x3UNeism4VjwTTCU",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1303,
                    "name": "CHAN, Thomas Anthony Chun Hun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SmokingPuddle58",
            "date": "Jun 11, 2023",
            "title": "Introduction to civil engineering",
            "comment_content": "你説的對，但是《LANG2010》 是由CLE自主研發的一款全新英語世界冒險課程。課程發生在一個被稱做「學術大樓」的真實世界，在這裏，被科大選中的人將被授予「Canvas存取權」，導引學術之力。你將扮演一位名為「科大學生」的神秘角色，在迷茫地做project做assignment中邂逅性格各異，能力獨特的instructor及groupmates，和他們一起擊敗CLE之強敵，找回失散的A-range——同時，逐步發掘「CLE派grade準則」的真相。<br />(If you don't know this meme just simply skip this)<br />=======================================<br /><br />Erm, the content, I would say, is totally not related science at all. I believe I am more like taking a course related to engineering. I should quit science school and go to study CIVL after taking this course.<br /><br />The course can be divided into 2 main parts:<br /><br />1. SIPE (Science In Plain English)<br />What do you have to do? Prepare some props and demonstrate some science knowledge to general audiences. How old? Around 15 maybe. <br /><br />2. Natural Disasters<br />Come on! This course is called English for Science. But in the end I feel more like I am doing something related to engineering.<br /><br />You are required to analysize an natural disaster in a scientific way. So you know what it will be ended up, which is, engineering related stuff.",
            "comment_teaching": "Great LANG instructor teaching. (Same as Ivan Yung (Unfortunately he went to CUHK) and Sumie)<br /><br />Thomas is a nice instructor. He can engage the atmosphere of the lecture and make the lecture not boring.",
            "comment_grading": "Let me tell you a secret: <br /><br />Grading in LANG is very clear and transparent, just like the diamond sold in the jewelry shop that everyone believes they deserve that grade.<br /><br />Unfortunately the secret is false :(<br /><br />On 23/5, CLE department throw me 3 emails at once, telling me the grade for all the tasks are released. I thanked my instructor for working so hard these days for marking all the assignments done in this semester, including SIPE and individual report. <br /><br />I suddenly remembered Yan Min, who also release all the score few days after the final exam. I suspect Yan Min also took few days after final to mark all the midterm and final paper. However, considering that Yan Min leaves his office at 6 o'clock exactly, I believe this is impossible.<br /><br />Anyway, when I open the CLE's potato-server hosted webpage that takes at least 1 minutes to load, I see the following grade:<br /><br />SIPE: 5 5 5<br />Interim Presentation: 5 5 5.5<br />Individual Recommendation Report: 4.5 4.5 5<br /><br />Then I got a B. Not bad grade but still not good grade at all.<br /><br />Still, I would like to thank my instructor for his effort in marking all assignments. That's it. After LANG3021 I will no longer need any LANG courses. Thankfully it will not be counted in MCGA or I'll be f**ked up.",
            "comment_workload": "Errrm is this part necessary for you?<br /><br />I mean, every science students have to take the course. You have no choice right (Other than DSCT, you can also choose LANG2030(H)).<br /><br />Let me give you some preperation. The workload is quite large. In the 3 months you need to do a 3-min video and a individual report around 1500 words. ChatGPT is allowed but considered the fact that it gave me bullsh*t, I consider not using this tool for my assignment.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 6,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iEabjrQbUpKRazdRzbD8ZKZlWxXrQXRE",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 418,
                    "name": "AU, Chui Han Anita",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Look A squirrel",
            "date": "Dec 16, 2020",
            "title": "Great Course.......for future Sci Fi writers with a lot of time on their hand",
            "comment_content": "If I could, I would tell people to not take this course but this option is not available for the unlucky victims in the school of Science <br /><br />As many has stated before, the instructor has neither a scientific background nor any relevant knowledge<br /><br />No useful information can be gleamed from the curse (It’s a typo but I see no need in fixing it), and I’m saying this as someone who will begrudgingly admit that LANG 1002 and 1003 have taught useful skills for the future, though they are a waste of time. They supposed purpose of the course is to teach you how to communicate science to the public which it tried teaching in some way but not effectively, some course contents are scientifically questionable, especially using a video from the Union of Concerned Scientists, a well known anti-GMO advocacy group, related to GMO, despite the organisation being well known for being against the scientific consensus about GMO. The course also limits the solution provided for the recommendation report for a natural disaster to be “scientific”, in reality they mean science-ish, it is a great practice for aspiring science fiction writers, who wish to have their story based on hardish science. Never in my life have I become so disgusted at the word “scientific” being spoken out of a human mouth. I’ve put so many buzzwords in my report, some clueless billionaires reading will be planning to invest in the BS I came up with.<br /><br />(-100)/10, if there was a way to not take this course and still graduate, this course will have no enrolment",
            "comment_teaching": "Given the absolute trainwreck of a course this is, Anita did a pretty decent job teaching the language concepts that is in the course, even though any new contents are completely useless outside of the course. The advice provided in discussions (both in class and 1 on 1 consultations) are genuinely useful for improving my writing. There are also an abundance of group discussions in breakout room that we can use to discuss with group mate how much of a s***show the course is, other courses and just plain chitchat, if it wasn’t for the amount of time required for the course or the abysmally awful content, the course may have been enjoyable",
            "comment_grading": "At least in my opinion, the grading was fair if not a little tough. My SPIE (Science In Plain English) recorded short speech is admittedly not my best work, and the mark reflected that, though having background noises are unavoidable if your family members just insist on sorting out the 10 million plastic bags in the living room while you are recording instead of just shutting up and waited for like 20 minutes and your room is unavailable because your idiot of a brother fell of a motorcycle and had to get stitches on his right arm and leg, and there are no other available room in the house. (I think I’ve gone on a tangent here but I’m to lazy to fix this). <br /><br />The report on the other hand was a masterpiece of complete and utter BS, no more meaningless words have been cobbled together to create something that looks so amazing yet is totally devoid of any real or practical solutions, if you have even a speck of relevant knowledge, you will either be laughing your a** off or facepalmming at such a thing existing. One of the references was an article with the word “shit” in the title, referring to actual feces, the data from that article did not add much useful information and can be found elsewhere easily but where is the fun in that? Did I spend way to much time on a joke that no one will notice? Yes. Was it worth it? Absolutely, after all, the summary of the course’s quality can be found in a word in the title of a reference from a report of a student.<br /><br />The best part is that the report earned a relatively high mark as while the actual “scientific” contents are questionable (not that the instructor would notice, see the content section and multiple other reviews), the language and grammar was to a relatively high standard, a standard that is befitting of a person who took English Language &amp; Literature for his A Levels as his “fun” elective.",
            "comment_workload": "Despite the aforementioned lack of substance in course content, the workload is unreasonably high, high enough that it may interfere with the time you need to study other lectures, especially if you are the kind of person whose ADHD would lead you to Alpha Centauri and back when researching something or spend an ungodly amount of time for one stupid little joke (the emphasis is on the little) that no one will ever notice if they aren’t actively looking for it. The SPIE took some work while the report requires a lot of research even when just half a**ing it for a decent grade. In all honesty, if I failed any of my actual course, this course is responsible.",
            "rating_content": 1,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 6,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PTKfo8tEs6fLQIYW1cJotSXx9qpxzWRj",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 423,
                    "name": "YEW, Liza Sook Yee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "shhhh",
            "date": "Jul 29, 2020",
            "title": "Liza is the best teacher in HKUST!!!",
            "comment_content": "Um actually Idk what I studied<br />Is more like playgroup lol chatting happily hahahaha",
            "comment_teaching": "Liza probably is the best teacher I have ever met in HKUST. She is cute and energetic. She teaches really well. The learning atmosphere is relaxing and joyful. Other than academics, she also cares about students' mental health. She is a great teacher. I lover her so much~~",
            "comment_grading": "Participation 10% <br />(me: unknown)<br />*SIPE Speaking 20%<br />(me: 6 6.5 7 7)<br />*Individual essay 15% <br />(me: 6(20%) 5.5(20%) 5.5(30%) 5.5(30%))<br />*Case Study Presentation 25%<br />(me: 6 6.5 6 6)<br />*Case Study Report 30%<br />(me: 6.5 5 6.5 6 1)<br />*ALL involve 4 marking criteria:<br />- Speaking: Task achievement, Organisation, Language and style, Delivery<br />- Writing: Task achievement, Organisation, Vocabulary, Grammar (Citation as well but 1 mark only)<br /><br />My final grade is A-<br /><br />Liza herself is lenient, and under the situation of COVID19, CLE seemed to be lenient with our grading. LOL",
            "comment_workload": "HEAVY(especially you studied two Lang courses at the same time, and HUMA)<br />You need a well-planned schedule in order to finish all the assignments. Speaking assessments took me a lot of time since I wanted my speech to be perfect with no mistakes. And I took almost a whole day to record the videos... It was very tough... For the SIPE assessment, I recorded till 3 am, really sleepy....",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cwfAorUOM6bl0knEpA2HKRYSHWAoDxU9",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 876,
                    "name": "SIU, Chi Ming Anthony",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SA_1007",
            "date": "Aug 25, 2019",
            "title": "Very easy to get an A but heavy workload. Be warned!",
            "comment_content": "The main idea was to learn how to communicate scientific information with the general public, meaning those without any scientific background. The instructors are language specialists who may or may not have in depth scientific&nbsp;&nbsp;knowledge, at least my professor didn't and it is what he explained in class. First half of the course was about general techniques of conveying knowledge as well as persuading them to take action towards an issue which is the second half.",
            "comment_teaching": "The professor is really funny and chilled person. You will be fond of him if do not like strict professors. Best part is that he is rather lenient in his marking. If you do not want your Mark's to be reduced heavily after the consultation between other language teachers, I suggest you work hard to get top ranges such as 6/7. <br /><br />I got A from him at the end, I got full marks in the first two assignments and close to full range in the last 2.",
            "comment_grading": "The first assignment was a short speech presentation as a preparation for a science competition. It about presenting a science topic of any sort to a large crowd whilst making it interesting. <br /><br /># tip is to speak like those in TED talk (one great source of reference), and talk naturally and not like a robot!.<br /><br />The second one is selecting a natural disaster and writing up a proposal to call for immediate action to prevent casualties. <br />This is the assignment I got full Mark's. <br />##HINT: do pick a easy disaster supported by solid scientific backup. <br /><br />As for the third and the fourth is a group presentation followed by a complete report on the presentation. <br /># To get high mark do find proper research to back up your points without copying. Best way to avoid plagiarism is to use the skill of converting difficult science facts into easy messages, aka, use easier words in your speech and report. For the report do use synonyms if you cannot find any other way to explain the stuff.<br /><br />I got A from him at the end, I got full marks in the first two assignments and close to full range in the last 2.",
            "comment_workload": "4 assignments, but the effort put into them isn't low, especially for those aiming for A or above. Honestly it will take time as the presentation requires practice and the report is fairly lengthy. Especially the second final report requires literature reviewing.<br /><br />So don't take this course too lightly ;P !",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HIOXNgf8LXniTcEWmjhB2Pd6FcvdMQt8",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 463,
                    "name": "FOO, Pionie Kim Ling",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HK416",
            "date": "Jan 22, 2016",
            "title": "",
            "comment_content": "The course includes two assessed presentations and two assessed technical reports which requires you to follow a scenario. It teaches students how to present innovative scientific or engineering ideas and write those in an academic way. This session helps a lot in presentation skills but a little in writing. There will be also four vocabulary tests for assessment.<br /><br />Apart from the graded materials, the course also provide you an opportunity to discuss in a seminar discussion which is not assessed, but may count towards participation in class ,depending on the instructor.",
            "comment_teaching": "In early and most classes, she will discuss and guide you through several science fictions in different topics, which could be a boring and meaningless process. Also, she may requires students to come on time and do the homework for discussion. This would count towards the participation mark.<br /><br />For the project, please make sure you get her understand your idea before the presentation by having a short meeting or a chat with her. This seriously affects you content mark in first presentation.",
            "comment_grading": "first group presentation 15%<br />first technical report 15%<br />final group presentation 25%<br />final report 25%<br />Vocabulary tests 15%<br />Participation 5%<br /><br />First tip is to follow those specific requirements for the report. Those are easy to follow while any missing will seriously lower you grade of the report. <br />Secondly, the instructor is said to be a killer, giving some Ds in lang 100X (dunno which course, either 1002 or 1003). She said she followed the marking scheme as always. To be fair, she gave a 4 or 5 on average for your assessment. Though I had a few mistakes making me score a 3 in some parts, I still managed to get 7 and 6 in the last report and i get an A-, which, in my opinion, is fair. Generally, she also gave quite high marks to the others. Therefore, I will say show her how hard you work.<br />Thirdly, this course is to a certain extent about group work so make sure you get some responsible group mates.",
            "comment_workload": "To have a good grade, basically, you need to at least secure the participation mark and vocabulary tests which are quite easy. Just try to answer some of her question. As to the presentation, hers advice was quite useful.<br />In general, the work load is fair. You will have a few pages of reading per week, four vocab test and a project.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DIy9l74djq0QPPeuW4hmIashETEpHJwt",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 456,
                    "name": "YUEN, Ka Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "9upper",
            "date": "Aug 10, 2015",
            "title": "終於終於離開Lang C range既黑洞啦",
            "comment_content": "呢個course正，真係好岩science學生讀。內容主要都係關science既野，分4個topic: Robotics and artificial Intelligence, Evoltion, Time Travel, Space Coloization.<br /><br />如果係鍾意睇科普既science jj特別正。呢個Course 不會斷睇sci fiction (劇/戲/書)，仲會有討論同debate(都練到D critical thinking，個course後期會教返D 中學既基本grammar(認真有D真係唔記得)。<br /><br />呢個Course最重要既野係你要invent 一個 product，好好玩嫁。之後你要去present 個idea同埋做report介紹。呀，係分組做既。",
            "comment_teaching": "KA MING講野算幾得意。其實你會覺得佢幾似中學老師，但原來佢真係做過中學老師(佢教grammar果陣拎返UE D教材出黎)。<br /><br />幾nice 又會同你改下文咁。",
            "comment_grading": "好好grade，對我呢D 英文廢J黎講，拎左個B算唔錯。如果有跟開我post會知我1002I (C) &amp; 1003S(C)。<br /><br />BTW vocab test 4次 平均6/10 (易過1002/3 但year2開始hea底，3次都係入去前5min先查D野點解。<br />present 平均4.5分<br />兩篇文都平均拎5左右",
            "comment_workload": "得2篇文(500 words n 1000 words) 15% / 25%<br />Vocab test (利申無溫都得) total 15%( 4 times)<br />Present (兩次 6mins n 15mins)&nbsp;&nbsp;15% / 15%<br />Attendance 5%<br /><br />lang不嬲workload唔大既，而且鍾意science，都算係輕鬆。",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 6,
            "vote_count": 10,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oFBPOOMgOnlXHdFocGSCy7HoKq1nFW5T",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 440,
                    "name": "WONG, Elaine Suk Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "grizelyt",
            "date": "Jun 04, 2021",
            "title": "Be a business student among science students then you'll get an A",
            "comment_content": "Please refer to other reviews ;) They're the same.<br />Boring content and useless assessment.<br />Who would talk like speakers of SIPE? That's a wasteful of time. It was so embarrassing to talk like a clown and introduce a topic in science, very cringe.",
            "comment_teaching": "I can feel that the tutor is not equipped with science knowledge, so she doesn't suit teaching scientific people. <br />She usually started her lesson with some songs, then had some chit chats with us, she was a fun teacher with a good sense of humour. However, when it comes to listening to our response, she always ignored the details and misunderstood our answers.<br />Probably she taught other school before, I could feel that she's more inclined to chat with students bringing up topics that are irrelevant to science.",
            "comment_grading": "An individual presentation (video-recorded) 20%<br />A group progress report presentation (real-time) 20%<br />iPeer 5%<br />An individual recommendation report&nbsp;&nbsp;35%<br />Library workshop 5%<br />Online and in-class activities 15%<br /><br />777<br />5.5 77<br />666<br />5 (both iPeer and library workshop)<br />unknown for participation mark<br /><br />overall: A+ (Thx Elaine XD)",
            "comment_workload": "It was quite annoying to finish all pre-class quizzes but workload is quite light comparing to other courses with project. Glad to have responsible group-mates so that we worked efficiently.<br /><br />Friendly reminder:<br />Please dun treat your individual report too seriously when your tutor is not from science school, I used mostly pure english.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "0yUdJHO6cqvenHzX3A9Bx9VsnzmusSZ2",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 878,
                    "name": "YIP, Ka Yue Carmel",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jonathan0705",
            "date": "Jun 10, 2020",
            "title": "A course that depends on your luck.",
            "comment_content": "There is really not much to learn in Uni Lang courses.",
            "comment_teaching": "Fun and open-minded teacher.",
            "comment_grading": "Very inconsistent grading from different instructors. For example, Carmel Yip would have a very high standard. <br /><br />Got around 87% of the course's mark, got B+ :(",
            "comment_workload": "An individual presentation<br /><br />3 minutes (without visual aids);<br />Individual work;<br />Present a scientific concept in plain English.<br />20%<br /><br />Week 5<br /><br />An individual expository writing<br /><br />500 - 600 words;<br />Individual work;<br />Write about ONE natural disaster that needs the most attention.<br />15%<br /><br />Week 8<br /><br />An individual case study presentation<br /><br />7- 8 minutes (with visual aids);<br />Individual work;<br />Present a case with solutions and recommendations for the problem identified.<br />25%<br /><br />Week 13<br /><br />An individual case study report <br /><br />1,200 - 1,500 words;<br />Individual work;<br />Propose solutions and recommendations with justifications for the problem identified.<br />30% <br /><br />Week 14<br /><br />Participation<br /><br />Attendance at the library workshop on research and referencing skills and<br />Instructor evaluation of:<br />participation in-class and other tasks, and preparation/preparedness before lessons<br />punctuality and lesson attendance <br />attitude.<br />10% <br /><br />Weeks 1 to 13",
            "rating_content": 1,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HP9aRGm5RumvAZhvp3FkKWWHQQAvrkza",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "hoiman",
            "date": "Jan 17, 2020",
            "title": "",
            "comment_content": "",
            "comment_teaching": "我個instructor 叫Kin Tang, 佢好好人上堂氣氛都好好，都好靚grade，遇到佢真係唔好swap走，佢好似係岩岩先教 呢個course嘅<br />上堂都係lang堂個啲野啦，discussion個啲啦<br />反二都係為左個attendance囉",
            "comment_grading": "都係啦，睇翻你邊個教，識friend好爛grade，不過我個個幾好 （Kin Tang）",
            "comment_workload": "重workload既，一個個人present + essay一個group present + essay。<br />但今個SEM因停課轉左做拍video做present，唔知會唔會因為咁grading鬆OR緊左",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iHIAW9YDl2KwbgiAXchyK45Mzp4My0IW",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 876,
                    "name": "SIU, Chi Ming Anthony",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lili036",
            "date": "Jan 03, 2019",
            "title": "",
            "comment_content": "呢個course唔係好知想教啲咩，大家都係一頭霧水咁聽，跟住啲guide line做assignments<br />第一個individual present叫你用5分鐘去介紹一個scientific concepts，其實都係考大家創意，點樣present得有趣，如果present得好會被邀請參加一個比賽，啲獎品都幾吸引，有op, disney annual pass，大獎仲有ipad<br />Individual Essay就寫一個natual disaster，幫佢諗2,3個方法去解決，最後揀一個Recommend <br />之後Group report 同present 都係講同一樣嘅野，3,4個人一組，present 15 mins，report 就2500至3000字。",
            "comment_teaching": "Anthony 教書唔差嘅但有時佢講啲野好深奧，我諗冇乜幾個係聽得明佢講咩<br />多數都係做果啲classwork",
            "comment_grading": "1份individual present 同 essay<br />1份group present 同essay<br /><br />Average score係6/7，最後A-",
            "comment_workload": "Workload都正常<br />因為冇midterm 同final，總共有4個assignments",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eibHor1MantMFzauXURYoQPEop7VZsFQ",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 333,
                    "name": "CHI, Man Lai Amy",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "chl",
            "date": "Jan 08, 2018",
            "title": "",
            "comment_content": "Students have to choose one natural disaster to discuss and give scientific solutions to solve.",
            "comment_teaching": "Very Bad! The lessons are extremely boring. She explains the assessments unclear and always bans our suggestions. As a UG student, I think it is difficult to suggest some perfect scientific and innovative solutions to solve the natural disasters. If I can choose once again, i would drop the course and choose another tutors in spring semester.",
            "comment_grading": "Poor Grading. She gives us low mark in all assessments compared to other classes. It is not easy to get high marks from her. Our suggested solutions need to be scientific and innovative. Although she said the solution no need to be brand new, when she commented on my essay, she wrote my suggested solution are existed and are not scientific enough. <br /><br />Since she gave us low mark in the assessments, the grade is poor! I would prefer drop the course if I cant swap to the other lessons and study in the next semester.",
            "comment_workload": "There are 4 assignments: around 500 words Individual Writing, Individual Presentation, around 800 words Group Essay and Group Presentation.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IZc9RLsZWaYThfVzAKfDWLQa64PWnasZ",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 332,
                    "name": "LEE, Pui",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "1609",
            "date": "Sep 18, 2017",
            "title": "",
            "comment_content": "About Building Vocab Lists for science.<br />Individual essay, Group essay, Individual and Group Presentation.",
            "comment_teaching": "Stressless learning environment.",
            "comment_grading": "Grading is super good. <br />Highly Recommend Lee Pui :)<br />Individual Preliminary Case Study Analysis: 5 5 5 5<br />Vocab List Presentation: 5 6<br />Final Case Report &amp; Presentation: Did not disclose but can ask for grades<br />Final grade: B+",
            "comment_workload": "Workload is slightly large.<br />Vocabulary and Extensive Reading Project (Vocab Lists)\t5%<br />Vocabulary and Extensive Reading Project (Verbal Progress Report)\t10%<br />Individual Preliminary Case Study Analysis\t20%<br />Group Final Case Presentation\t30%<br />Group Final Case Study Report\t25%<br />iPeer (Graded by Peers)\t5%<br />Participation (Graded by Instructors)\t5%",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FF0L2Q4T48bSLmKojVz7U3fW3ynT9ovM",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "yylemon",
            "date": "Jan 25, 2017",
            "title": "一般（好似今年開始轉左syllabus)",
            "comment_content": "成個course都係有關Case study report (Natural Hazard)<br />Individual 簡單咁揀2個topic做<br />之後分組 自己組內揀一個topic出黎做一份千幾字嘅report同埋ppt <br />Presentation 早過交report嘅deadline",
            "comment_teaching": "同Y1 lang好似<br />又係派notes睇ppt 不過冇書",
            "comment_grading": "同Y1 lang好似",
            "comment_workload": "份report deadline同final個期好近 所以早啲做好啲<br />唔算特別大workload不過冇可能做deadline fighter<br />尤其",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "imlV1ipKhsyTbZIuwHkZIu9R74qaBmbr",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1325,
                    "name": "HOGUE, Teresa",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "you jump i jump",
            "date": "Jan 28, 2023",
            "title": "",
            "comment_content": "Unit 1.1 - 1.3 Introducing Science in Plain English<br />Unit 1.4 Organizing and scripting an oral presentation<br />Unit 1.5 Engaging the audience <br />Unit 1.6 Engaging the audience <br />Unit 2.1 - 2.2 Exploring science and natural disasters<br />Unit 2.3 Conducting a case analysis<br />Unit 2.4 Reporting project progress<br />Unit 2.5 Presentation strategies <br />Unit 2.6-2.7 Presentation strategies <br />Unit 2.8 Writing a recommendation report<br />Unit 2.9 Exploring solutions<br />Unit 2.10 Comparing solutions and making<br />recommendation<br />Unit 2.11 Graphic representation and explanation<br />Unit 2.12 Language focus in report writing",
            "comment_teaching": "The whole atmosphere was good, but the teacher likes to add her own elements to the class, which includes things that are not included in the course syllabus, but she claims would affect our grades. Also, some of her explanations on how we should approach the project are vague and a bit hard to understand, you have to keep asking her questions to get your answer. Overall, a nice teacher, but not as helpful as I was hoping.",
            "comment_grading": "SIPE Oral presentation 20% <br />Self evaluation on oral presentation 5% <br />Interim Presentation on Case study project 25%<br />Problem Analysis 5% <br />Online quiz 5% <br />Library quiz 5%<br />Final recommendation report 35%",
            "comment_workload": "Workload is pretty high, and not worth it for a LANG course. Mainly because of planning how to structure your oral presentation (video) and the project on preventing natural disasters. The project would be seperated in 2 parts, in which you have to do a lot of background research, find issues caused by natural disasters that you should prioritize, and find different ways to prevent/ solve this issue. Online quizzes are ungraded, you get the 5% as long as you complete all of them.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dblpQSu9n4KQGOZE8dmqmrDqEpdmiWC0",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1325,
                    "name": "HOGUE, Teresa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "日修運動服愛好者",
            "date": "Dec 31, 2022",
            "title": "A good teacher with chilling experience",
            "comment_content": "Unit 1.1 - 1.3 Introducing Science in Plain English (SIPE)<br />Unit 1.4 Organizing and scripting an oral presentation<br />Unit 1.5 Engaging the audience (1)<br />Unit 1.6 Engaging the audience (2)<br />Unit 2.1 - 2.2 Exploring science and natural disasters<br />Unit 2.3 Conducting a case analysis<br />Unit 2.4 Reporting project progress<br />Unit 2.5 Presentation strategies (1)<br />Unit 2.6-2.7 Presentation strategies (2-3)<br />Unit 2.8 Writing a recommendation report<br />Unit 2.9 Exploring solutions<br />Unit 2.10 Comparing solutions and making<br />recommendation<br />Unit 2.11 Graphic representation and explanation<br />Unit 2.12 Language focus in report writing",
            "comment_teaching": "Ms. Tess give a chill atmosphere while attending her lessons. Sometimes, she would share hear own travel, singing and dancing experiences, sometimes if we had free time, she would play some bossnova songs or show a dance video to relax our heavy workload.<br /><br />For lessons, she would make good instructions and give examples on how to ace this course with higher grades examples. Besides, she would separate 2 groups of people attending 1 of the lesson or consultation period when the assignment due date is come.",
            "comment_grading": "My marks:<br />SIPE (Video speech on Science Concept): 5 5 5<br />Problem Analysis: 3/5<br />Group Presentation: 5 6 6<br />Individual Report: 6 6 6<br />Library Workshop: 84/100<br /><br />Final Grade: B",
            "comment_workload": "This course has a quite heavy workload. First, you have to prepare a 3-min video presentation on a scientific concept, how to deliver the concept in an intresting way is very crucial.<br /><br />Another main assignment is the group project on studing natural hazards and how to give a possible solution to solve the problem. You have to form in groups, choosing 1 natural hazard, and finish the problem analysis first. Then, you have to work with your groupmates to finish the powerpoint, and give a 15 minute interim presentation. Finally, you have to write a recommendation report based on what you have done (at least 1200-1500 words), if you attended library workshop, this may help you find sources and cite sources for this project.<br /><br />Therefore, the workload is very tough unless you find a study platform or a partner to help for your work",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8eEmi5tcxJd9ufBv1YhKYxYI1PkPbV58",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "KHL",
            "date": "Aug 03, 2022",
            "title": "",
            "comment_content": "Mainly about using English to explain Scientific concepts. In my opinion, this course was not useful.",
            "comment_teaching": "Michael Tom was my instructor. His teaching was a bit boring, but he still had a lot of discussions with students. Also, he always asked students to answer questions.",
            "comment_grading": "Not really good, compared to LANG1002 and LANG1003. Even if I got 5 or above in every domain in each assignment, I only got a B. I expected to get at least a B+.",
            "comment_workload": "1 individual presentation<br />1 group presentation<br />1 essay<br />Library Workshop<br />Also, we need to finish the Canvas pre-unit quizzes before each lesson.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kWhR7eIUvWEte9kXyNEbMJLWNfz69Qah",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 423,
                    "name": "YEW, Liza Sook Yee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "WHangHo",
            "date": "Feb 16, 2022",
            "title": "",
            "comment_content": "The main purpose of this course is to equip students with ability to explain the complicated science knowledge in interesting and easy to understand ways.<br /><br />There was one assignment that required students to have video recording to introduce a science knowledge. The topic was decided by ourselves.<br /><br />The other one was about the natural disasters. Students needed to form a group of 3-5 people to choose a natural disaster from the list provided and propose science solutions to deal with the natural disasters. An additional related individual writing task was required after the presentation.",
            "comment_teaching": "Liza is a nice instructor. She always explains the tasks clearly and willing to give us advice when we have problems about the the course.",
            "comment_grading": "The top 20% students will receive A range<br />The grading is good. <br />You reap what you have sown.",
            "comment_workload": "Light workload.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OwaH3UE6o4aggH0T9DQQQjeefGk2WIgn",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 881,
                    "name": "FARMER, Rebecca",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "打救我的cga",
            "date": "Jan 21, 2022",
            "title": "",
            "comment_content": "Unit 1.1 - 1.3 Introducing Science in Plain English (SIPE)<br />Unit 1.4 Organizing and scripting an oral presentation<br />Unit 1.5 Engaging the audience (1)<br />Unit 1.6 Engaging the audience (2)<br />Unit 2.1 - 2.2 Exploring science and natural disasters<br />Unit 2.3 Conducting a case analysis<br />Unit 2.4 Reporting project progress<br />Unit 2.5 Presentation strategies (1)<br />Unit 2.6-2.7 Presentation strategies (2-3)<br />Unit 2.8 Writing a recommendation report<br />Unit 2.9 Exploring solutions<br />Unit 2.10 Comparing solutions and making<br />recommendation<br />Unit 2.11 Graphic representation and explanation<br />Unit 2.12 Language focus in report writing",
            "comment_teaching": "Rebecca is really nice and I can feel her passion in teaching. She replied my emails so quickly and gave detailed response. She tend to have some interactions with students but I won’t feel too harsh on that. There was a day that had typhoon no.8 and she even made a make up worksheet, I don’t know whether other instructors will do it or not but at least she takes her job seriously xd.",
            "comment_grading": "My grades:<br />individual presentation 6/6/5.5<br />progress report 7/5/5.5<br />recommendation report 6/6/5<br /><br />Final grade A-",
            "comment_workload": "Individual presentation (video recorded) 20%<br />Self-evaluation on individual presentation 5%<br />Group progress report 20%<br />iPeer 5%<br />Individual recommendation report 35%<br />Library workshop 10%<br />Online and In-class activities 5%<br /><br />In online and In-class activities, there are 1.1-1.6 in unit 1 and 2.1-2.12 in unit 2, most of them are quite short, just remember to finish them before the lesson is ok.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sQ3Jt394sK74DnUzgf5E0rWfsi3FS4ig",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 423,
                    "name": "YEW, Liza Sook Yee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yellow object",
            "date": "Jun 09, 2021",
            "title": "grade depends on how nice your tutor is",
            "comment_content": "Unit 1 Science in Plain English (SIPE) Oral Presentation<br />Unit 1.1 Understanding science communication<br />Unit 1.2 Analyzing audience<br />Unit 1.3 Making science (scientific concepts) more understandable<br />Unit 1.4 Organising and scripting an oral presentation<br />Unit 1.5 Engaging the audience (1) – voice and connected speech<br />Unit 1.6 Engaging the audience (2) – non-verbal communication strategies<br />Unit 2 Case Study Project on a Natural Disaster<br />Unit 2.1 Exploring science and natural disasters<br />Unit 2.2 Exploring natural disasters and their negative impacts Unit 2.3 Conducting a case analysis<br />Unit 2.4 Reporting project progress<br />Unit 2.5 Presentation strategies (1) – use of visual aids<br />Unit 2.6 Presentation strategies (2) – presentation etiquette <br />Unit 2.7 Presentation strategies (3) – Q&amp;A session<br />Unit 2.8 Writing a recommendation report<br />Unit 2.9 Exploring solutions<br />Unit 2.10 Comparing solutions and making recommendation <br />Unit 2.11 Language focus in writing – tone and style in report <br />Unit 2.12 Graphic representation and explanation",
            "comment_teaching": "Maybe I'm lucky to have Liza as my tutor, she is really nice and friendly and is lenient on grades and the lessons are really chill. I did not put much effort into the assessments so just do your best is fine, and remember to look at the assessment rubrics. I you feel like you deserve a higher score, you can email the tutor and justify your reasons. My recommendation report increased from 666 to 667.",
            "comment_grading": "Individual presentation (video recorded) 20%<br />Group progress report 20%<br />iPeer 5%<br />Individual recommendation report 35%<br />Library workshop 5%<br />Online and In-class activities 15%<br /><br />My grades:<br />individual presentation 6/6/6<br />progress report 5.5/6/6.5<br />recommendation report 6/6/7<br /><br />Final grade A",
            "comment_workload": "Quite much workload. There is a simple task in canvas before lessons, remember to do them as they are very easy and you can get the marks already after you complete them. I suggest you to submit your assessment drafts to your tutor before submitting them in canvas as they can give you some feedback, just to make sure you've done correctly. Also remember to find good group mates for the progress report to lessen the workload. It is better to have a good English and Geography background.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VmYPWNCOX36dZurlzWpC83J5XCv8IVCJ",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 418,
                    "name": "AU, Chui Han Anita",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Phil7",
            "date": "Jan 20, 2021",
            "title": "Acceptable",
            "comment_content": "All about natural disasters and u will learn how to deliver science in plain English. <br /><br />The course is quite easy actually.<br /><br />You'll need to prepare a speech about 3 to 4 minutes to deliver a science knowledge in an interesting way by the beginning of October. <br /><br />You need to group with two people and make a 3 people team to work on one type of specific natural disaster. For my team we are dealing with the Argentina locust infestation. You need to prepare a PowerPoint and present it together with your team mate on your progress on this natural disaster by the beginning of the November.<br /><br />The last assignment is to write a report on that natural disaster with solutions.",
            "comment_teaching": "It is OK. She is nice. I like her.<br /><br />A reasonable and young lady.",
            "comment_grading": "The grading is fair.<br /><br />I suggest to practice your assignment (speech) a lot to make it perfect. And it is important to collaborate with your teammate well,<br /><br />Cause they will work with u in that presentation.<br /><br />So it is important to pick a good teammate since it is voluntary to choose.<br /><br />I have good teammate and spend some time and get into A range.😊<br /><br />Its grade is better than my LANG1002/1003 courses.😣",
            "comment_workload": "A speech <br />A presentation<br />A report<br /><br />It is ok if u plan your time well. But need to ensure u practice a lot before submitting your speech or starting your presentation.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AhHt2raEtHmGIEkXYj4IeUtgrJDCKWUP",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 423,
                    "name": "YEW, Liza Sook Yee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "No,Thankyou!",
            "date": "Dec 29, 2020",
            "title": "",
            "comment_content": "SIPE:<br />An individual presentation (video-recorded) (20%) due week 5<br />3 minutes (without visual aids)<br />Individual work<br />Present a scientific concept in plain English<br /><br />Natural Disaster: choose 1 out of 6 given topics<br />Case 1 - Hurricane Katrina the U.S. 2005 <br />Case 2 - Hurricane Maria Puerto Rico 2017 <br />Case 3 - Touhoku Japan Tsunami 2011<br />Case 4 - Locust infestation Argentina 2015 <br />Case 5 - Earthquake Sulawesi Indonesia 2018<br />Case 6 - Floods India 2019<br /><br />A group progress report presentation (real-time) (20%) due week 9~10<br />15 minutes (with visual aids)<br />Group work<br />Present the progress of the group on the natural disaster case study project<br /><br />An individual recommendation report (35%) due week 14<br />1,200 - 1,500 words<br />Individual work<br />Recommend solution to the negative impact in the natural disaster case<br /><br />iPeer (5%) due week 14<br />Self and peer evaluation of performance in the group work for the presentation<br /><br />Library workshop (5%) due week 5~7<br />Participation in the library workshop on research and referencing skills<br /><br />Online and in-class activities (15%)<br />Completion of online pre-unit tasks and out-of-class work<br />Completion of SIPE self-evaluation (due week 6, one week after SIPE)<br />Participation in online discussions<br />Participation in class and other tasks<br /><br />like every LANG course, attendance is required, so don't miss the class.",
            "comment_teaching": "Liza is a very nice person. She would have share some interesting thing with us at the beginning of the lesson to make us be more relax. Like the interesting things about her dogs. She is also passionate in teaching and willing to answer our questions. During the class, she would encourage us to express our ideas. Which I think it is good, providing a chance to let us chat in English.<br /><br />Liza is also willing to listen our concern regarding the assignment. Say the SIPE assignment, she hope us can complete the script before the due day. So that she can have a look at the content, and give us some feedback that whether we are off the track or not. She will try her best to answer your concern.",
            "comment_grading": "I think the grading is fair, as long as you work hard and finish the task on time. You might get an acceptable grading. Just like LANG 1003. For me, I would say Liza grading was so lenient than I expected.<br /><br />For reference:<br />SIPE 5.5/5.5/5.5<br />Group progress report presentation 5.5/5.5/6<br />Individual recommendation report 5/5.5/5<br />With a letter grade B+<br />I finish the recommendation report in 2 day because for me writing an academic essay was a disaster. So my mark in the last assignment was significantly lower than the other.",
            "comment_workload": "I think the workload is acceptable. Before each lesson, there will be a pre-unit task to let you have a brief idea about what is going to teach in the lesson. <br />Through out the course, pre-unit task each lesson. 3 task, 2 are individual, 1 is group work. I think this is fair for an LANG course.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0AYbvfyCYy5vY5n2XubAfZjXnmoHec6c",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 436,
                    "name": "TSANG, Alfred Jones",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "miketony",
            "date": "Aug 29, 2020",
            "title": "Good Instructor, then Good course",
            "comment_content": "Actually I dun know what I can learn in this course. It just recap s what I have learnt in LANG 1002&amp;1003. The only thing I can say is this course is more science-oriented.",
            "comment_teaching": "I think he can not maintain the class atmosphere well, he always makes the class &quot;dead-air&quot;",
            "comment_grading": "Very good grade with this instructor, almost all 5 and with a B+<br /><br />Also, This course is one of the &quot;non-mandatory&quot; attendance course. What I mean is if you miss one lesson, you can finish the &quot;make-up&quot; activities in Canvas. IF you finish one lesson, you can have attendance. So many students skip almost half of the course.",
            "comment_workload": "Only 1 expository paragraph, 1 3-mins speech, group presentation and 1 individual study report (related to the group presentation). So, I think the workload is adequate.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "C652XQaNDmcufYqtqq1xkzeZ4QhEvop8",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 330,
                    "name": "FUNG, John",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lu",
            "date": "Dec 24, 2018",
            "title": "Poor preparation. Teaches useless things. Subjective marking.",
            "comment_content": "Normal workload but beware of free riders. He will not help you to solve free-riding problem or even be lenient to the groups who have free-riders.",
            "comment_teaching": "He used all his time to teach useless grammar. There was little demo before submitting the assessments but they were all useless.",
            "comment_grading": "Cannot how to tell how he gives out his so-called fair, according to marking criteria, marks. So subjective and rubbish.",
            "comment_workload": "No extra workload from this guy. But there are originally quite a lot to do in this cours already.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "GDWFD9z1GWBLPB7EE6tYUGAgDEo54YgX",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 411,
                    "name": "MEGAN, Melissa Jane",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LukaModric",
            "date": "Nov 04, 2018",
            "title": "",
            "comment_content": "1. Individual speaking task<br />3 mins<br />Present a scientific concept<br /><br />2. Individual case study project<br />500-600 words<br />Research related to natural disaster<br /><br />3. Group case study presentation<br />15 mins + 4 mins Q&amp;A<br />Solutions and recommendations for a problem<br /><br />4. Group case study report<br />2000-2500 words<br />Solutions and recommendations for a problem",
            "comment_teaching": "Quite good.<br />Good learning atmosphere.<br />Computers are allowed (or even recommended) to retrieve learning materials from the canvas.",
            "comment_grading": "The grading of the speaking task is quite good but that of the proposal is strict (may be I don't know what it requires in the proposal)",
            "comment_workload": "Heavy.<br />The deadline of essay is near the date of midterm.<br />Lots of time is reserved for group project.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cBehdmvIKa5asV7tp7ptVVAtP1bueeqt",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 423,
                    "name": "YEW, Liza Sook Yee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "zlong",
            "date": "Sep 08, 2018",
            "title": "",
            "comment_content": "Different from Lang1000 courses, this course does not require a textbook. All the content is from Canvas. I appreciate that because the 1000 Level Lang book was kinda useless. <br />The first task (SIPE) you have to do is explaining a scientific concept in simple English. The instructor will comment on your choice of words and delivery skills. <br />The second part of the class, you have to think of a natural disaster (definition: disasters that are not caused by human factors), then write an essay, do presentation and write a report about that disaster.",
            "comment_teaching": "Liza is a nice lady and her lessons were not boring. She explained the marking criteria somewhat clearly.<br />However, the feedback of each task was not given right after the assessment. You cannot improve your performance (especially for the presentation) because you will not get your marks till final examination period. <br />The comments that Liza gave to the individual proposal and study report were very general, compared to other tutors. My friend and I received same comment (We think she &quot;copy and paste&quot;ed the comment).",
            "comment_grading": "15% - Individual presentation task (3 minutes)<br />20% - Individual case study proposal (500-600 words)<br />25% - Group presentation (15 minutes, with 4 minutes Q&amp;A)<br />30% - Group case study report (2000-2500 words)<br />5% - Peer evaluation<br />5% - Participation<br /><br />I got average 21-22 out of 28 marks for all the tasks and I attended all the lessons. I get an A-.",
            "comment_workload": "As the tasks are related to each other, the workload is smaller than what I imagined. As long as you choose a &quot;good&quot; natural disaster, you will not have any difficulties in doing the later tasks.<br />I would suggest finding group mates with similar major so that you can cooperate better and work more effectively.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "03Otpfz7HRlmRtTxu4zltB14aSDXvCn3",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 420,
                    "name": "LAM, Chak Yan Jessie Teresa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "2535",
            "date": "Jun 14, 2018",
            "title": "Good grade but huge workload",
            "comment_content": "Task-based course about natural disaster<br /><br />Science in plain English presentation (Individual)<br />Proposal (Individual)<br />Report (Group)<br />Report presentation (Group)<br /><br />The content is really wired, we have to recommend effective SCIENTIFIC solution to natural disaster but if the solution is really effective, then the world has used it already, why still need you to recommend???",
            "comment_teaching": "Jessie is a very nice instructor and explains every thing very clear, including what we are expected from the accessed tasks and reminds us a lot of things that we may make mistake of.<br /><br />She is also really considerable. During midterm exam period, she has organized a blend-learning lesson, allowing us no need to come to attend class in person.",
            "comment_grading": "Very good grade<br /><br />Perhaps she has helped us to check everything before the 'real' submission, so we an get a lot of 6 or 7 in most categories",
            "comment_workload": "Jessie recommends us to hand in our draft for her to take a look and she will give comments on where can we improve and whether there is gap in our content. Thus, compared to other classes, her class almost have double workload and very tight deadline.<br /><br />But it deserves",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jbq7HCBqptQAkkiZNFTwURn8HtQl8sLI",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 878,
                    "name": "YIP, Ka Yue Carmel",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "數學研究生",
            "date": "Jan 26, 2018",
            "title": "Very Easy Subject",
            "comment_content": "It's mainly talk about how to write a report or personal proposal in your future life in a scientific way. By comparing to the previous language courses, it's easy for students to understand what do you need to do to obtain a good grade or simply how to write a formal proposal to your boss.<br /><br />Mainly focus on Natural Disasters and how can you help to convince those problems as a scientist.",
            "comment_teaching": "I think Carmel is a nice person and funny teacher. You will enjoy every lectures. Carmel tries to make sure everybody knows what's going on and every time if there are any assignments, she will discuss the marking criteria in the class, it ;s very important to know how to get a higher grade.<br /><br />She divides us into many groups and discuss some topics about natural disasters. Since you need to know ehat you are going to write in your proposals and reports.<br /><br />Try not to miss the class and come to the class on time, since I know that Carmel will record the time that you come to the class, I think she may deduct some marks from participation.",
            "comment_grading": "I don't like the grading. Although I got the highest grade by comparing to my previous language subjects. I think my instructor can push me at least one more sub-grade. Since I do think I did really well and I put a lot of effort on it.<br /><br />Personal Proposal (Almost 6)<br />Personal Presentation (Almost 6)<br />Group Report (Some 5, 6)<br />Group Presentation( ALL of the team members have to give a presentation in class) (Almost 6)<br /><br />I got almost all 6 but only get a B+. But I know that my instructor is one of the killers, I can get a B+ from her is not that easy.",
            "comment_workload": "It's quite relax at the beginning of the class. But you may feel tired after or in the middle of the class. Since my lessons started at 9 am, I had to wake up early and came to the campus.<br /><br />I used around 3-4 hours to finish my personal proposal. Some people used 2 days to finish it. You can compare the workload by yourself.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mFwd7OqcPkKSu1gmweYSJr9uTNQCzdQV",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 333,
                    "name": "CHI, Man Lai Amy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kui",
            "date": "Jan 20, 2018",
            "title": "",
            "comment_content": "all the lessons teach you how to write your assignment<br />how to find a topic and make a plan for finish it<br />how to select appropriate information for your essay<br />and how to present in a appropriate manner<br />sounds like broing<br />but amy make it quite interesting",
            "comment_teaching": "Interesting teaching<br />relaxing atmosphere<br />She taught us how to think critically",
            "comment_grading": "unexpected, because many people say amy is a killer<br />Finally got B+, but i got 2 c range in lang 1002 and lang 1003",
            "comment_workload": "moderate, 3 of them are related<br />1 individual presentation (3 mins)<br />1 individual report (600 words)<br />1 group report (2500 words)<br />1 group presentation (15mins)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EaW2aKHlRoOQV7rijDTaQZae6OOtLFvX",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 878,
                    "name": "YIP, Ka Yue Carmel",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Eggtart",
            "date": "Aug 26, 2017",
            "title": "Good tutor",
            "comment_content": "成個course就係為咗寫篇Final report，揀一個natural hazard，寫堆solns來舒緩其帶來的影響。<br />Content比D係因為真係唔多理解整vocab list同present學英文嘅方法有咩意義（我諗都冇咩人會真係走去温個vocab list同喺頭幾個禮拜用D新方法學英文掛…又或者可能係我太懶😑）；<br />同埋唔係好覺寫嗰篇文關science事，起碼我地組嗰篇只係得幾句輕輕一提。",
            "comment_teaching": "Tutor好好人，同埋第一次交嗰兩段比分幾鬆手。<br />如果嚟緊科Lang都係佢教就好:)",
            "comment_grading": "除咗第一段作文之外咩分都冇出，不過感覺上grading唔錯。",
            "comment_workload": "一開始作兩段final essay嘅introduction，之後sem中6分鐘individual present點學英文、交兩次vocab list，以上幾樣似乎hea做都冇乜所謂；不過如果introduction認真寫可能final essay可以用得翻，好環保lol<br />最大workload只係sem尾嘅group present同1500-2000w essay。",
            "rating_content": 2,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cj9P1SUhrJ92K4Z7H58cwtOk8KNNwkyM",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 456,
                    "name": "YUEN, Ka Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Audrey",
            "date": "Dec 30, 2015",
            "title": "Interesting topic but not really good grade :(",
            "comment_content": "Four units on topics of science (fiction), such as AI / space travel / evolution / ...The materials are quite interesting, since we are science students and most of us are passionate about science fiction stories :D<br />4 vocab test, two group pre3 &amp; two individual report.<br />A lot of revision on grammar, quite helpful.<br />On the whole it is much more interesting than 1002/1003.",
            "comment_teaching": "Ka is very detail-oriented :) It's a good thing when he points out a hundred mistakes in your essay (many can be clarified if you talk to him) But your will find it very hard to get him to understand some scientific principles in your product presentation. A little stubborn. Good at teaching though, he would play movies or video clips from time to time (helpful in understanding the materials later).",
            "comment_grading": "Sadly my worst grade till now. Maybe it's because I don't spend that much time and effort on LANG courses ==<br />Almost all vocab test full mark, group pre3 mostly 5/6, individual report around 5. Speak a lot in class. Got B+.(((",
            "comment_workload": "Said before, remember to rehearse the group presentation and think of possible questions from the audience. If you take Ka's class pay special attention to grammar and word choice. Good luck .",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jyuLNJ1LSBcruKssGMYF39swlp78eqJQ",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 330,
                    "name": "FUNG, John",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Man Tik",
            "date": "Sep 01, 2022",
            "title": "Lang 2010",
            "comment_content": "Good and very interesting. It is very related to our daily life so it is quite that easy to handle. Besides, I can understand how to present scientifically in front of different varieties of audiences",
            "comment_teaching": "Good and quite fun. John always raise questions and enhance students’ critical thinking. Students are very willing to answer their questions and raise questions",
            "comment_grading": "Good. Paying attention in lessons is the most important thing to your grade and ask professors questions whenever you face any challenges",
            "comment_workload": "Not really that much but quite heavy. 2 presentations, 1 essay and some small tasks",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cGcBfFrq9yH5o3Gb13lwW2N4fH1lwQ5M",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "chenhs",
            "date": "Jan 28, 2022",
            "title": "",
            "comment_content": "Some useful skills in English of Science. For example how to explain a complex idea of science. And how to write an article for different use.",
            "comment_teaching": "1 teacher for only about 14-16 students. You can talk more with your teacher and classmates.",
            "comment_grading": "unsure, sometimes good. sometimes bad. Sometimes you do a lot but your grade is not very high.",
            "comment_workload": "In class you should talk a lot. Out of class, One video one essay and one presentation in group. And some quiz in canvas before class. Essay and presentation may take more time. No exams.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aUgwOYiN8DC1NZDsWBmSL19v9j4N4ydx",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 878,
                    "name": "YIP, Ka Yue Carmel",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "clarly",
            "date": "Oct 21, 2020",
            "title": "Annoying course with annoying instructor",
            "comment_content": "One individual speech<br />One group presentation<br />One individual report<br />Weekly online quizzes<br />All those are related to skills on delivering science concepts. Not hard as many guidelines and skills are mentioned in the example videos and teaching materials. It is annoying though.",
            "comment_teaching": "Caramel is bad👎🏿 I am done with her ‘jokes’ (can’t even tell if they are jokes as they are not funny and sometimes dreadful)<br />She is not friendly",
            "comment_grading": "I would say it is not hard to get B range but it is hard to get an A.",
            "comment_workload": "The first assignment was the speech, it only gives you around a week (after briefing in class) to think about the content and finish recording.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "80fRx8x6ClRi7ILM30EnkwQbyLVvhgjg",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "michaeltcf",
            "date": "Mar 17, 2019",
            "title": "Very good grade course!",
            "comment_content": "LANG 2010, English for Science 1, is a three-credit course offered to second-year undergraduates of the School of Science. Over one term, students will attend three hours of class, and will be expected to complete up to six hours of out-of-class work per week. It is an integrated skills course utilizing the problem-based case study concept to assist and enhance the development of students’ confidence and competence in language, communication and general life skills.<br /><br />The course aims to develop students’ ability to deliver presentations and take part in discussions on topics relevant to their field of study. It also aims to enhance their ability to read and write about science-related topics, combining the use of sources with their own ideas. Language work focuses on developing the vocabulary, language structures, writing and speaking skills which will allow students to fulfil these aims.",
            "comment_teaching": "It really depends on which professor. My teacher is fun and I have great &quot;LANG mates&quot; as well. We all have a lot of fun and most of us attend every lectures as well.",
            "comment_grading": "Of course, you cannot miss more than 5 lessons. And the grading assessments include an oral presentation (15%) , a proposal writing (20%) and lastly, a group project include writing a report (25%) and a presentation (30%) as well. Also, there are participation marks (5%) as well.<br /><br />In my class, as far as I know most students were given good grades. I got full marks in the proposal writing, only one mark deducted in the oral presentation, and only decent marks (some 7s, not all 7s) in my final group project. I got an A.",
            "comment_workload": "At first, you may find the course pretty hard. The assignments filled up your semester and you will find no time resting in the lessons. If you have good LANG mates and make some friends, you will find the lessons more joyful. Basically when you finish your oral presentation, you immediately are going to prepare for your proposal.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "WwzYym5Nzas0zDtdoTMqFoMMTn2HH9uh",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 423,
                    "name": "YEW, Liza Sook Yee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "biochemisttt",
            "date": "Jan 02, 2019",
            "title": "",
            "comment_content": "Science in plain English presentation (Individual)<br />Proposal (Individual)<br />Report (Group)<br />Report presentation (Group)<br /><br />I think the content of the course is average. Topic of SIPE contest is chosen by your own. The thing u need to pay attention is u just need to explain the concept to dummy and u do it fluently and confidently, then u can get a good mark in SIPE. <br />For the proposal part, u need to choose one natural disaster and explains for the solutions scientifically. This examines your skills of explaining concepts to dummies very much as those solutions can be very complicated. Also, it examines your critical thinking. How to balance the pros and cons of each solutions and choosing the criteria of dealing with the natural disaster. I do think the case study part did examine lots of your integrated skills.",
            "comment_teaching": "I like Liza. She looks old but she loves to interact with us. She even introduces her instagram to us and asked us to follow. I did improve much on my presentation skills as I was chosen by her to be one of the finalist in the SIPE contest. You better ask for her comments personally for specific comments or recommendations as her comments on the grading system would be very general. She studied Life Science for her degree and the whole class is studying Life Science so we can talk without boundaries.",
            "comment_grading": "I did the best in SIPE for 6s and 7s<br />those reports and presentations got 5s and 6s<br />Escape for 4-5 lessons and eventually got B+<br /><br />However, if u dream for an A range in LANG 2010, I think u should choose an instructor that does not teach LANG 2010H. It is obvious for her comparison between our class and the H class ability everytime when talking about the grading. This comparison does not exist for the instructors not teaching H class and their students can get an A more easily! <br />Quite unfair to hear that those people with worse English ability than you having a better just because their instructors give marks loosely.",
            "comment_workload": "A average language course with 4 assessments. Good luck when choosing your groupmates. <br /><br />Please pay attention: if the instructor chose u to represent the class to be a finalist in the SIPE contest held in lt-A, it is OPTIONAL. I was attracted by the prizes and was one of the finalist. However, u would realize the gap of u and those in LANG 2010H. Put more time on studying of other midterm would be more useful instead. Being one of the finalist in SIPE won't make your final grade higher whereas not being a finalist still can get an A range.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NxhaDP8Bc0JvyRpQiFXqu5LVbXr3xS5Q",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 333,
                    "name": "CHI, Man Lai Amy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gazelle",
            "date": "Dec 29, 2018",
            "title": "",
            "comment_content": "Language skills useful for further study are taught in the course. You will learn the presentation skills and report-writing skills that you will find useful when doing your FYP later. Plus, the instructor will also teach you how to think critically and analyze comprehensively on an issue. It is far deeper than what were taught in LANG 1002/3.",
            "comment_teaching": "Amy's teaching is praiseworthy because every lesson you will gain valuable experience from her, be they the sharing of her own experience or her way of viewing the world. I can see her passion and experience in teaching language courses. In spite of her tight schedule (she has 10 lessons per week), every time she is well prepared for the lesson. <br /><br />Yet, I found the instructions of assignments unclear. Although there is a &quot;detailed&quot; marking scheme for every assignment, they are just &quot;cliche&quot; giving us meaningless information. We have to guess what the instructor wants by listening to his/ her explanations and asking for some follow-up clarifications. At the end of the day, it is the instructor himself/ herself who sets the marking criteria and gives out the scores. <br /><br />Another thing that makes no sense is the samples provided. Sometimes, I realized that our own performance is better than that of the sample(s) provided. For example, the sample group report was unsatisfying in terms of task achievement and organization (yet according to Amy, it already deserves some 5s &amp; 6s). If I followed the way of the sample , I would have fallen into B range!!!",
            "comment_grading": "Score distribution<br /><br />Individual presentation&nbsp;&nbsp;15%<br />Individual proposal&nbsp;&nbsp;20%<br />Group presentation&nbsp;&nbsp;30%<br />Group report&nbsp;&nbsp;25%<br />iPeer&nbsp;&nbsp;5%<br />Participation&nbsp;&nbsp;5%<br /><br /><br />My score<br /><br />Individual presentation<br />Content&nbsp;&nbsp;6<br />Organization&nbsp;&nbsp;6<br />Delivery&nbsp;&nbsp;6<br />Language&nbsp;&nbsp;6<br /><br />Individual proposal<br />Task achievement&nbsp;&nbsp;5<br />Organization&nbsp;&nbsp;6<br />Vocabulary&nbsp;&nbsp;6<br />Grammar&nbsp;&nbsp;6<br />Citation &amp; referencing&nbsp;&nbsp;0<br /><br />Group presentation<br />Task achievement&nbsp;&nbsp;5<br />Organization&nbsp;&nbsp;5<br />Language&nbsp;&nbsp;6<br />Delivery&nbsp;&nbsp;5<br /><br />Group report<br />Task achievement&nbsp;&nbsp;5<br />Organization&nbsp;&nbsp;6<br />Vocabulary&nbsp;&nbsp;6<br />Language&nbsp;&nbsp;5<br />Citation &amp; referencing&nbsp;&nbsp;1<br /><br />Attendance: only miss 1 lesson<br /><br />Final grade: A-<br /><br />Year 2 or above lang is perceived to be 爛grade in nature because instructors generally hand out scores of assignments and course grade far stricter than in 1002/3. This is especially true when determining A range students. Rumor has it that Amy is one of the killers in LANG 2010. This not the real case when my assessment results are consistent with my prediction. (Yet failing to get an A grade is a regret to me.) In fact, the real killer is in H class. A friend of mine in H class who got higher score than me for the two group projects eventually ended up a B+.",
            "comment_workload": "I would say the amount of workload depends largely on your goal. If you only aim at a C range, then you could simply 9 do every assignment and you will find the workload quite light. But if you aim high or you are a perfectionist like me, then you will find every assignment time-consuming. This is especially the case for the two group projects.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TTmfSb6EXbJCDI3ImmGd52iKvqsJvhtw",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 420,
                    "name": "LAM, Chak Yan Jessie Teresa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kabul",
            "date": "Dec 21, 2017",
            "title": "Lenient grading.",
            "comment_content": "The tasks are mostly related to disaster risk reduction methodologies. We're expected to pick a natural disaster (tsunami, earthquake, hurricane, epidemic, or whatever...), analyze its cause, propose viable solutions and justify them. Just pick solutions related to your major if you want a better life.<br /><br />In my opinion this course is quite biased towards life science students. In the SIPE contest an overwhelming majority of the finalists were in life science majors, and all of them talked on topics related to life science.",
            "comment_teaching": "Jessie is a phenomenal tutor. She's great in explaining what we're expected in the tasks, how we can better organize our ideas in the essays, and how we can deliver ideas better in the presentations. My presentation marks greatly improved thanks to her guidance. At first when I was utterly confused bout the individual project proposal, she spent 20 minutes after class to make it clear to me what she's looking for and her suggestion was really helpful.",
            "comment_grading": "Jessie is pretty generous in giving marks.<br /><br />My score:<br />✏️ Individual project proposal: 6 7 7 7<br />💬 Individual presentation: 5 5 5 5<br />✏️ Group case study report: 6 6 7 7<br />💬 Group case study presentation: 8 6 6 5<br /><br />💯 Final grade: A<br /><br />P.S Got 8 in content thanks to the +1 bonus mark in the Q&amp;A session.",
            "comment_workload": "A really complex assessment scheme with lots of components. Make sure you've got responsible groupmates in the group work.<br /><br />Course Assessment Scheme<br />✏️ Individual project proposal (20%)<br />💬 Individual presentation (15%)<br />✏️ Group case study report (25%)<br />💬 Group case study presentation (30%)<br />👍 iPeer (5%)<br />💬 Participation (5%)",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "plB4uArOgt9IkvbhKHnZQJ9cd2llJhK6",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 413,
                    "name": "YU, Anna Wai Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wmmfiwoeux",
            "date": "Nov 02, 2017",
            "title": "Not So Useful",
            "comment_content": "Teachings about science proposal and science concept presentation.<br />Quite boring and useless:<br /><br />Over one term, students will attend three hours of class, and will be expected to complete up to six hours of out-of-class work per week. It is an integrated skills course utilizing the problem-based case study concept to assist and enhance the development of students’ confidence and competence in language, communication and general life skills.<br /><br />The course aims to develop students’ ability to deliver presentations and take part in discussions on topics relevant to their field of study. It also aims to enhance their ability to read and write about science-related topics, combining the use of sources with their own ideas. Language work focuses on developing the vocabulary, language structures, writing and speaking skills which will allow students to fulfil these aims.",
            "comment_teaching": "The teaching is good. The instructor tried many ways to make the class more interesting and let us know how to perform better.",
            "comment_grading": "The grading is quite good, easy to get high grades.",
            "comment_workload": "Workload is quite heavy.<br />Vocabulary and Extensive Reading Project (Vocab Lists)\t5%<br />Vocabulary and Extensive Reading Project (Verbal Progress Report)\t10%<br />Individual Preliminary Case Study Analysis 20%<br />Group Final Case Presentation\t30%<br />Group Final Case Study Report\t25%<br />iPeer (Graded by Peers)\t5%<br />Participation (Graded by Instructors)\t5%",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fesqW9rXwUkAZAMcHvRcpsOutcgv5mjH",
            "semester": "2016-17 Spring",
            "instructors": [],
            "is_author": false,
            "author": "wkleung",
            "date": "Aug 23, 2017",
            "title": "",
            "comment_content": "Actually the content is quite useless. It said that it would be about &quot;science&quot;, but just typical essay writing with a &quot;scientific&quot; topic.",
            "comment_teaching": "My tutor is pretty nice and involves a lot of group discussion so I think it should be alright.",
            "comment_grading": "My tutor gave very good grades. Almost half of the class got A. I got a A- even I did not hand in all vocal list.",
            "comment_workload": "It is fair, but remember the deadlines since there are many, and thats why I did not hand in all tasks although I have done them all:(",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "S1c7E9bSlJxFtsWRuTISIDbIJ4cXlOHj",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1303,
                    "name": "CHAN, Thomas Anthony Chun Hun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "RIbtSU",
            "date": "Dec 30, 2022",
            "title": "Good course and good instructor",
            "comment_content": "Unit 1.1 - 1.3 Introducing Science in Plain English (SIPE)<br />Unit 1.4 Organizing and scripting an oral presentation<br />Unit 1.5 Engaging the audience (1)<br />Unit 1.6 Engaging the audience (2)<br />Unit 2.1 - 2.2 Exploring science and natural disasters<br />Unit 2.3 Conducting a case analysis<br />Unit 2.4 Reporting project progress<br />Unit 2.5 Presentation strategies (1)<br />Unit 2.6-2.7 Presentation strategies (2-3)<br />Unit 2.8 Writing a recommendation report<br />Unit 2.9 Exploring solutions<br />Unit 2.10 Comparing solutions and making<br />recommendation<br />Unit 2.11 Graphic representation and explanation<br />Unit 2.12 Language focus in report writing",
            "comment_teaching": "Thomas is the best lang instructor I have ever met. He engages the class in the discussion. Be active in class to answer his questions then you should be clear that what he wants for the submitted tasks. <br /><br />In SIPE, he gave me constructive comments and I followed his instructions and managed to get high marks. This is good because if you really follow his instruction, it is guaranteed to get high marks. He gave marks objectively and reasonably.<br /><br />For the group projects, he gave clear instructions and freedom that he doesn't mind if your presentation exceeded time a bit. He won't stop you from speaking so you dun need to worry about the time limit, which makes me perform better.<br /><br />For the recommendation report, he also gave us more freedom that we can write 1700 words at maximum. It was stated in the task sheet that we can't write more than 1500 words. But i think he knew it's very easy to exceed words so he gave more freedom. You can sense that he is a logical person. He wants you to be evidence-based and specific enough. If you are able to do so in your report, you can score high definitely.",
            "comment_grading": "My Grades:<br /><br />SIPE: 7/ 6.5 / 6.5<br /><br />Group projects: 7/ 6.5 / 6.5<br /><br />Recommendation report: 6.5 / 6.5 / 7<br /><br />Final Grade: A+ <br /><br />The first time to get an A range in Lang and an unexpected grade (really feel surprised), I didn't get any A range in the year 1 Lang course for your reference.<br /><br />Thank You, Thomas !!!",
            "comment_workload": "The workload is a bit heavy. I spend a lot of time on all tasks. The first task of SIPE is a pre-recorded individual presentation. I spend the whole day recording a 3 min presentation. The second task is group projects on natural disasters, you must find good and collaborative groupmates in order to perform well. I am lucky to find good groupmates with that we all participated (no free-riders)<br />The final task is the recommendation report. Make sure you write it specifically and evidence-based.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CwgtFzh6oIkfpLiL1rD7NcqGemBTQUw9",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "ilubyouboyz",
            "date": "Jan 07, 2021",
            "title": "Grade indirectly proportional to effort",
            "comment_content": "This course wants you to learn about Science in Plain English (SIPE), which you need to explain a scientific concept in plain English, like using fewer jargons and more simple words and similes. <br /><br />Another major topic to learn is writing a recommendation report, which you write with evidence and reasonings to persuade the readers that your recommendation is the best one and to choose your suggestion. In this topic, you will learn to do a progress report presentation too.",
            "comment_teaching": "There were definitely new stuffs, like the recommendation report, it was new to me. However, I feel like it's a waste of time that my tutor spent a couple of lessons teaching the presentation skills that primary school students should know, such as how to make visual aids and make them attractive, as well as presentation etiquette.",
            "comment_grading": "Video presentation in SIPE (20%): 6.5 5 5<br />Progress report presentation (20%): 5 5 5<br />Recommendation report (35%): 4.5 5 5<br /><br />Participation mark was not released. I tried hard to talk and share my ideas in the class, hope to leave a better impression in the tutor's mind. But I don't think it helps with my grade. <br /><br />Overall B-<br />Referring to my friends' marks and grades, guess I got the cutoff mark of B- grade of my class, if the grading was really depending on the marks I got in the submitted works.",
            "comment_workload": "It was fine to me, LANG1002 and 1003 had more workload than 2010. That's why I felt quite ok about the assignments and deadlines. The pre-unit quizzes basically didn't count the actual score but just as long as you submit it will be fine. Each pre-unit quiz just needed 3-8 mins to finish.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Z8iLrvXY6wRtSp1bVVjGwwfTKetXv2vU",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "annn",
            "date": "Dec 15, 2020",
            "title": "",
            "comment_content": "Unit 1&nbsp;&nbsp;Science in Plain English Oral Pesentation<br />Unit 2 Case Study Project on a NAtural Disaster",
            "comment_teaching": "the instutor is pretty good, was willing to answer student's question and gave us valuable feedback",
            "comment_grading": "An individual presentation (video-recorded) 20%<br />-3 minutes (without visual aids);<br />-Present a scientific concept in plain English.<br /><br />A group progress report presentation (real-time) 20%<br />-15 minutes (with visual aids);<br />-Present the progress of the group on the natural disaster case study project.<br /><br />Self and peer evaluation of performance in the group work for the presentation.<br />5%<br /><br />An individual recommendation report 35% <br />-1,200 - 1,500 words;<br />-Individual work;<br />Recommend solution to the negative impact in the natural disaster case.<br /><br />iPeer 5%<br /><br />Library workshop 5%<br /><br />Online and in-class activities 15%<br />-Completion of online pre-unit tasks and out-of-class work<br />-Completion of SIPE self-evaluation<br />-Participation in online discussions<br />-Participation in class and other tasks",
            "comment_workload": "Fair workload. Two quizzs each week and three main assigments",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZKIbQcNvyIZZ6CVJnh4pmchDfTP0yyqQ",
            "semester": "2019-20 Winter",
            "instructors": [
                {
                    "id": 878,
                    "name": "YIP, Ka Yue Carmel",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kengorgor",
            "date": "Mar 04, 2020",
            "title": "",
            "comment_content": "It is a three-credit course offered to second-year undergraduates of the School of Science. Over one term, students will attend three hours of class, and will be expected to complete up to six hours of out-of-class work per week. It is an integrated skills course utilizing the problem-based case study concept to assist and enhance the development of students’ confidence and competence in language, communication and general life skills.<br /><br />The course aims to develop students’ ability to deliver presentations and take part in discussions on topics relevant to their field of study. It also aims to enhance their ability to read and write about science-related topics, combining the use of sources with their own ideas. Language work focuses on developing the vocabulary, language structures, writing and speaking skills which will allow students to fulfil these aims.<br /><br />LANG 1002 and LANG 1003 are pre-requisites for this course.",
            "comment_teaching": "good",
            "comment_grading": "Not bad",
            "comment_workload": "",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "z0clPUO5mm8yaXACitAWAT72mDf7zKhN",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 878,
                    "name": "YIP, Ka Yue Carmel",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Trevis@MATH",
            "date": "Jan 12, 2019",
            "title": "Common LANG course",
            "comment_content": "LANG 2010, English for Science 1, is a three-credit course offered to second-year undergraduates of the School of Science. Over one term, students will attend three hours of class, and will be expected to complete up to six hours of out-of-class work per week. It is an integrated skills course utilizing the problem-based case study concept to assist and enhance the development of students’ confidence and competence in language, communication and general life skills.<br /><br />The course aims to develop students’ ability to deliver presentations and take part in discussions on topics relevant to their field of study. It also aims to enhance their ability to read and write about science-related topics, combining the use of sources with their own ideas. Language work focuses on developing the vocabulary, language structures, writing and speaking skills which will allow students to fulfil these aims.",
            "comment_teaching": "Nothing special just like normal LANG courses.",
            "comment_grading": "In line with general University guidelines, the Center for Language Education’s official minimum attendance requirement for all LANG required courses is 80%. If a student misses 6 or more classes in each term, that student will fail the course and will have to retake the whole course.<br /><br />Incremental warnings:<br />After missing 3 classes (in total i.e. not consecutive), a warning letter will be sent to the student, copied to his or her department. After missing 6 lessons, the student fails the course. A letter will be sent to the student, his or her department and a notification to the ARRO.<br />Permission to take leave will be given only where prolonged absence is unavoidable, in cases where students have suffered serious illness or injury, on production of documentary evidence.<br /><br />Participation (5%): Weeks 1 to 13<br />・Attendance at the library workshop on research and referencing skills.<br />・Instructor evaluation of:<br />\t・\t participation in online, in-class and other tasks, <br />\t&nbsp;&nbsp;\t and preparation/preparedness before lessons<br />\t・\t punctuality and lesson attendance<br />\t・\t attitude.",
            "comment_workload": "An individual speaking task (15%): Week 4 and/or Week 5<br />・3 minutes (without visual aids);<br />・Individual work;<br />・Present a scientific concept in plain English.<br /><br />An individual case study project proposal (20%): Week 8<br />・500 - 600 words;<br />・Individual work;<br />・Propose a research related to a natural disaster case.<br /><br />A group case study presentation (30%): Week 13<br />・15 minutes + 4 minutes Q&amp;A session (with visual aids);<br />・Group work;<br />・Present a case with solutions and recommendations for problem identified.<br /><br />A group case study report (25%): Week 14<br />・2000 - 2500 words;<br />・Group work;<br />・Propose a case with solutions and recommendations for problem identified.<br /><br />iPeer (5%): Week 14<br />・Self and peer evaluation of group writing, speaking and online tasks.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}