{
    "error": false,
    "course": {
        "id": 735,
        "subject": "LANG",
        "code": "1125",
        "name": "Chinese for Non-Chinese Language Background Students VI",
        "description": "This course builds on the groundwork laid in LANG 1120, LANG 1121 and LANG 1122 and LANG 1123, and LANG 1124, and takes students to an intermediate-high level of understanding of spoken Chinese and a stronger communicative competence in using Chinese in social and professional situations. Restricted to students with non-Chinese language backgrounds only. Students without the prerequisite but with approximate 250 hours of prior Chinese learning experience may seek instructor’s approval for enrollment in the course.",
        "categories": [],
        "website": "http://cle.ust.hk/courses/lang1125",
        "credits": 3,
        "semesters": [
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"LANG\" data-code=\"1124\" href=\"/review/LANG1124\" target=\"_blank\">LANG 1124</a>",
        "corequisites": "",
        "exclusions": "HKDSE/HKALE/HKCEE/JEE Chinese, <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1113\" href=\"/review/LANG1113\" target=\"_blank\">LANG 1113</a>, <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1114\" href=\"/review/LANG1114\" target=\"_blank\">LANG 1114</a> (prior to 2017-18), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1115\" href=\"/review/LANG1115\" target=\"_blank\">LANG 1115</a> (prior to 2017-18), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1116\" href=\"/review/LANG1116\" target=\"_blank\">LANG 1116</a> (prior to 2017-18), LANG 1117, <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1118\" href=\"/review/LANG1118\" target=\"_blank\">LANG 1118</a>",
        "rating_content": 4.25,
        "rating_teaching": 4.5,
        "rating_grading": 4.5,
        "rating_workload": 4.25,
        "review_count": 4,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 446,
                "name": "WONG, Ngam Susan",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "dMUl6Qu7iyC6IL4dBf0kONCShYxPtk5Z",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 446,
                    "name": "WONG, Ngam Susan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wolfheart",
            "date": "Jun 13, 2020",
            "title": "Fake your proficiency for a higher grade",
            "comment_content": "For reference, I did IB Chinese SL and scored a high 6 out of 7 points. I also passed HSK Level 4.<br /><br />Syllabus:<br />Unit 1: 留学生活与职业规划<br />- 任务一: 在香港留学<br />- 任务二: 交流学习生活<br />- 任务三: 找一个适合自己的工作<br />Unit 2: 入乡随俗与文化碰撞<br />- 任务一: 东西方“礼”俗不同<br />- 任务二: 饭桌上的礼节<br />Unit 3: 四季变化与环境保护<br />- 任务一: 迷人的济州岛<br />- 任务二: 人类活动对环境的影响<br />- 任务三: 保护环境从我做起<br /><br />Content is pretty manageable but there were new words for me in Unit 3. Around 50-70 生词/vocabulary for each unit. Assessments compose of an oral (20%) and written (25%) portion held near midterm and final season, respectively.",
            "comment_teaching": "The professor is generally patient with her students and tries to make the course as fun and interesting as possible. Towards the end of the semester, she stressed the importance of intonation in Chinese as a language and probably wanted this to be as a takeaway from her course.<br /><br />Students can ask her questions on vocabulary, grammar, and usage during the class, and she will respond positively.",
            "comment_grading": "Breakdown:<br />Written - Listening (5%), Grammar (7.5%), Reading (7.5%). Essay Writing (5%)<br />Oral - Topic Development &amp; Structure | Vocab &amp; Grammar; Pronunciation (note: there are two criterions), Delivery Skills<br /><br />My Scores:<br />[20%] Oral 1 - 17.5/21 (Excellent | Very Good,Good | Good)<br />[25%] Written 1 - 21.5/25 (4%, 7%, 6.5%, 4%)<br />[20%] Oral 2 - 15/21 (Good | Good,Good | Good)<br />[25%] Written 2 - 19/25 (2.5%, 6.5%, 7%, 3%)<br />[10%] Attendance - undisclosed<br /><br />My final score, assuming full attendance, would be around 81.45% and I scored a B+ for this course. Letter grades are on a 5% increment (e.g. A+ &gt;= 95%, A &gt;= 90%, ..., D = 50-55%) and I believe this applies to all LANG 1120-1127 courses.<br /><br />Felt that assessment 2 got harder in terms of the listening portion for the written exam and harsher grading in oral presentation. <br /><br />In both oral presentations, the professor hated my non-native accent and deducted points. Throughout the course, I had my essays and video scripts edited by natives from Mainland but never received full marks for the grammar and vocabulary, so I'm not sure what is expected from us in the course.",
            "comment_workload": "Before each written assessment, the professor gave a sample question for the essay prompt. It was the exact same prompt during the actual essay, so practice by writing an essay. For the oral assessment, it's a 5-6 minute do-at-home video that involves discussing about a prompt; most work is writing the script as most people likely read their scripts, even if there were penalties in &quot;Delivery&quot;.<br /><br />I personally felt that there were high expectations for us, which could be explained by how the professor also teaches LANG 1113C or courses for native Mandarin speakers. In comparison, I have a friend with similar background as mine, who took LANG 1124, and scored A with less overall workload in the number of words per essay, number of essays for the semester (including scripts), and fewer taught vocabulary.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZIuZJCh0Ly0lqJFoPY75Sa7qDoCrsoBM",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 446,
                    "name": "WONG, Ngam Susan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bommyknocker",
            "date": "Apr 21, 2022",
            "title": "If u can pass HSK3, its an easy A range",
            "comment_content": "I've barely passed HSK3, and for me it was still very easy course to get A range.<br /><br /> The class content you learn turns out to be much harder than the actual exam, which didn't really have to do with course content. <br /><br />The teacher tells you many exam questions beforehand. <br /><br />Even essay and oral questions are told beforehand. So It is easy to prepare.",
            "comment_teaching": "Teacher is very nice, very kind. She's good at explaining things. But becareful because if you fake your proficiency, trust me you will get caught, and be dropped from the course.",
            "comment_grading": "Many test questions are told beforehand. A final score above 85 is A range, 92 above for A+. Most students get A range. Just review the study guide she gives out before exams, and you'll get an A(assuming you can pass HSK3).",
            "comment_workload": "Fair workload. You'll have short assignments maybe once for two weeks. They only take 30 mins max so no worries.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ci6PauxSilvITcR3IB7DmmHRGfnNOg0j",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 446,
                    "name": "WONG, Ngam Susan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Minerva",
            "date": "Apr 01, 2017",
            "title": "",
            "comment_content": "Chinese Chinese Chinese... little bit more difficult than HSK level 5",
            "comment_teaching": "She is a passionate teacher. Sometimes it was little bit hard to understand her English pronunciation, but you know this is a Chinese class, so you don't use English that much.",
            "comment_grading": "2 oral presentations: 20% each<br />2 exams (inc. reading, listening, grammar &amp; writing): 25% each<br />1 assignment (writing): 10%<br /><br />Attendance doesn't count toward the grade, but if you miss the lecture more than 5 times, then you fail the course.<br /><br />I got quite good grades in the both of exams and the writing assignment. I don't know my oral presentation grades because she didn't tell the presentation grades, but I think I did really poorly compared to others. However, I still got an A, so I'm satisfied with the grading.",
            "comment_workload": "Exams questions (excluding the listening ones) are almost the same as the questions in the textbook, so do them on your own before the exams. For the writing part, you are previously given the topic, so I recommend you to write and memorize it so that you can just copy down what you've written. It saves your time a lot. Oral presentations are tough, especially for people who are not confident in speaking, but speaking confidently without looking down at the script is very important.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "l3GFpN8nondj4B8XH7DZ4AwPgheEF5on",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "sparklingviruss",
            "date": "Sep 25, 2016",
            "title": "",
            "comment_content": "the content is quite ok. The vocab part are quite long but there are many familiar words among them so it is easier to study.",
            "comment_teaching": "the class is not so boring as the teacher always ask the question to do their own sentences with the words yu just learn. But since the classes are early in the morning, you might fall asleep:&gt;",
            "comment_grading": "i dont really know about the grading since we havent had an midterm exam. Attendance is also graded if you are absent for 3 times, you will receive phone call and if you miss the classes for 5 times, then you fail the course.",
            "comment_workload": "quite a lot of homework and there are 2 exams including presentation, reading, listening and writing.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}