{
    "error": false,
    "course": {
        "id": 737,
        "subject": "LANG",
        "code": "1127",
        "name": "Chinese for Non-Chinese Language Background Students VIII",
        "description": "This course builds on the groundwork laid in LANG 1120, LANG 1121 and LANG 1122 and LANG 1123, LANG 1124, LANG 1125 and LANG 1126, and takes students to a high level of understanding of spoken Chinese and a stronger communicative competence in using Chinese in social and professional situations. Restricted to students with non-Chinese language backgrounds only. Students without the prerequisite but with approximate 350 hours of prior Chinese learning experience may seek instructor’s approval for enrollment in the course.",
        "categories": [],
        "website": "http://cle.ust.hk/courses/lang1127",
        "credits": 3,
        "semesters": [
            2130,
            2110,
            2030,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"LANG\" data-code=\"1126\" href=\"/review/LANG1126\" target=\"_blank\">LANG 1126</a>",
        "corequisites": "",
        "exclusions": "HKDSE/HKALE/HKCEE/JEE Chinese, <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1113\" href=\"/review/LANG1113\" target=\"_blank\">LANG 1113</a>, <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1114\" href=\"/review/LANG1114\" target=\"_blank\">LANG 1114</a> (prior to 2017-18), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1115\" href=\"/review/LANG1115\" target=\"_blank\">LANG 1115</a> (prior to 2017-18), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1116\" href=\"/review/LANG1116\" target=\"_blank\">LANG 1116</a> (prior to 2017-18), LANG 1117, <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1118\" href=\"/review/LANG1118\" target=\"_blank\">LANG 1118</a>",
        "rating_content": 4.43,
        "rating_teaching": 5,
        "rating_grading": 4.29,
        "rating_workload": 3.57,
        "review_count": 7,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 455,
                "name": "LIANG, Xin",
                "count": 7
            }
        ]
    },
    "reviews": [
        {
            "hash": "bXLV8yRVFcpD3ztRGvvEugVqrIuSmZGK",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 455,
                    "name": "LIANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hiii",
            "date": "Oct 12, 2018",
            "title": "",
            "comment_content": "If you can speak and understand Chinese fluently then this is a good course for you. HOWEVER, it can be difficult if your vocabulary is limited to basic conversational phrases.<br /><br />In this course, there is no dictation that counts to your grades, but you will be doing a presentation introducing a topic of your choice with a group you choose yourself . This is very useful if you want to expand your vocabulary in a certain area for future reference. Like if you choose your topic to be econ related, then as you do your research, you learn more vocab and maybe when you're done, you can talk like a pro regarding that topic. <br /><br />Then you do a final report on the topic you chose for the presentation. The final exam for this course is just typing out a report in class.",
            "comment_teaching": "Ms Liang is an amazing teacher who will answer any question you have with great enthusiasm. She makes sure to challenge every student and make the class engaging, which is my favorite part about the class. The learning environment is very chill so you always feel free to ask anything. You basically learn how to write a formal report",
            "comment_grading": "For the presentation, she gives a grade but part of it also comes from peer evaluation. Which is really good because then everyone in your group will work on it if they want a good grade so the overall workload between the group members are more balanced. She tries to make the grading as fair as possible.<br /><br />The standards for the class is actually quite high because there are a lot of experienced chinese speakers in the class. Most students are foreigners who lived in a Chinese speaking country for 10+ years so don't underestimate this class. From my experience, there is a wide gap in the capability of this class. Some are REALLY good in Chinese and you wonder why the hell are they in this foreigners class, and some are clearly worse than others and you wonder why they didn't just ask to drop to a lower class. Honestly, who knows. Maybe because you can type out the final report and not have to memorise characters?",
            "comment_workload": "In terms of workload, it is not a lot even though she always gives homework, it is up to you to decide how much you write. She always gives back the homework with suggestions and corrections on what you can work on and she encourages students to correct it and give it back to her for another look so that the student can improve their writing skills as much as they can through out the course. <br />The presentation is just preparing to speak for 3-4 minutes and she gives a lot of clear instructions and examples on how to do them so it is fairly straightforward.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "y26rKoUfvEUHcsAzek1tmgSnyMvBn1f8",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 455,
                    "name": "LIANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ykimak",
            "date": "Jan 09, 2018",
            "title": "",
            "comment_content": "The course is designed to help student improve their Chinese. The contents covered in class is very useful and you get to improve your vocabulary. Students will be asked to write a final report and present in Chinese in a group of three or four.",
            "comment_teaching": "Professor Liang is a very energetic teacher and provides help whenever you request for help. If you request to meet her individually after class, she will tell you the time and location immediately. She is very responsive, and tries to help you to improve your Chinese as much as possible.",
            "comment_grading": "The course is not easy if you do not put any effort into it. However, if you show your commitment to your project, you may get higher grades. Attendance is not important, but it is better to go to all classes to get help for your final project.",
            "comment_workload": "Workload is adequate. The professor gives you homework every week to help you stay on track for your final essay. If you finish your homework on time, she will also provide you with feedback. However, near the end of the semester, preparing for final presentation and paper may be very time consuming so it is better to get started earlier.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EZ5FifXs9sZfMYqJNf38An65uEcCV5nC",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 455,
                    "name": "LIANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Roy Sukjin Mun",
            "date": "Dec 25, 2017",
            "title": "No more Chinese class and I'm burst with joy",
            "comment_content": "Week 1-2: self-Introduction (not counted towards the final grade)<br />Week 3-4: deciding the research topic<br />Week 5-6: oral presentation (proposal of your research), 3-4min per person (20% of final grade)<br />Week 7-11: working on the written report of your research findings (25% of final grade. Submission of electronic/paper copy of the report is due on the very last class)<br />Week 12: oral presentation of your research findings, 4-5min per person (25% of final grade)<br />Week 13: reflection + peer evaluation, 1 hour (20%+10% of final grade)<br /><br />Overall the course content is bit disorganised and I was often confused by the guidelines on the course website which was frequently not accessible. The sample writings (past students' work) posted online sometimes were not in accord with the benchmark. <br /><br />Students can choose their research topic freely, but this also means the difficulty and the professor's expectation for the written report/oral presentation will be different depending on the chosen topic (so there is no set standard for everyone in class). <br /><br />Details of the course outline are included as an attachment below.",
            "comment_teaching": "Professor Liang is very friendly and enthusiastic about teaching. She always responds to questions and is willing to meet students after class if they have additional questions. I had appointments with professor Liang at the language center almost every week regarding the projects, and she was very helpful sometimes.",
            "comment_grading": "Everything except the reflection in the end consists of individual and group marks. Most overall marks are based on the group work, so getting diligent teammates is essential in order to excel in this language class. I was also told that the professor sets different expectations for different students depending on the level of their Chinese academic background.<br /><br />More than two unexcused absences will result in F. <br /><br />Grading was not transparent. What stressed me out the most was that according to the rubric, the grade boundaries between 7 (maximum score that can be achieved in each criteria), 6, 5, and 4 were very subtle, and the professor herself could not clearly explain the difference between an A and a B-.<br /><br />For reference, I got below 70% for the first oral presentation and performed more or less the same in the rest of the assignments. The grades for the second presentation and the final report were not released, but I still got an A (which was aberrant, I was expecting much worse) in the end for the overall grade. In terms of this, students seem to be graded with the lenient scale.",
            "comment_workload": "I could not study my major and other subjects in this semester especially after the mid-term period due to the heavy workload in LANG1127. This is primarily because I am a very slow learner in languages. <br /><br />By the end of each Saturday (prior to week 5-6), students are required to post their assigned homework (recordings, draft versions of written reports. These are not graded but most of them are related to the final project) online. Students also need to update their submitted assignments after the professor leaves comments on the work. Failure to submit these assignments will not affect the final grades but it means there is more work to do on your own later on.<br /><br /> If one does not use Chinese (Mandarin) outside of the class, particularly for an international student, preparations for the oral presentations and written reports can be very dull and time-consuming. So, if the student has never seriously studied Chinese before, he or she is suggested to take LANG 1126 or a lower level Chinese course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "MQFK7s2BDlT7jJCBE9KOagxNGLulK2YC",
                    "name": "Course Outline",
                    "format": "png"
                }
            ]
        },
        {
            "hash": "ySwSl9bhTZgHCKxY1C2wROXgthjteHmO",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 455,
                    "name": "LIANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JCCC",
            "date": "Aug 22, 2017",
            "title": "",
            "comment_content": "The course is designed to help students improve their Chinese by the writing up and presentation of an investigation report. Students will come up with their own topic and do primary research themselves and presenting and writing about their findings for the whole of the semester.",
            "comment_teaching": "Professor Liang Xin is a very kind hearted teacher who is always willing to provide assistance to any students who needs it. Although she is a very busy teacher with a tight schedule, she will always have more time for you if you ask her. In class, Professor Liang Xin is very engaging and welcoming to any questions which is a plus for those who are proactively trying to improve their Chinese.",
            "comment_grading": "Grading in this course is not easy but will definitely come with hard work, as the final grade is based on 2 presentations and a final report. Therefore, if you put more effort into it, you wont finish the course with a bad grade.",
            "comment_workload": "Workload is manageable. Every week, professor would assign one homework at least that is related to the whole project. If you do all the assigned homework, you can basically compile them all into a final report as the homework assigned is usually a draft of a part of your final report.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "j4J03fqx37Tk0boqnV1fh5iQbxJopz4N",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 455,
                    "name": "LIANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mincheol",
            "date": "Aug 10, 2017",
            "title": "",
            "comment_content": "The content of the course is useful in improving your Chinese level to higher one. The content is about writing a good Chinese investigation report. The students will have chances to learn about Chinese vocabs that we do not use daily. In addition, the students will learn about how to present your work to fellow students in Chinese concisely and clearly. You can improve your Chinese speaking quite a lot from this course.",
            "comment_teaching": "Professor Liang Xin is a kind teacher. She always answer students' questions patiently and wants students to ask more questions. Her teaching is organized and you can feel that she prepares a lot before her class. She tends to give students more chances of speaking and discussing in Chinese. Also, she knows a lot about Chinese culture and language stuffs.",
            "comment_grading": "The grading is quite lenient for these course. Most appealing thing about Lang 1127 is that it does not have written exams. No midterm and final. The grading comes from the final report and the presentation of that report. So, you will get a desirable grade if you complete the tasks what the professor asks you to do and work hard.",
            "comment_workload": "The workload is ok. The professor doesn't give extra homework except the things that are related to writing a report. But homework from report also would not be that much because you guys are working as a team and the tasks will be less. Basically one homework a week. You will have plenty of time to finish the tasks.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fSjmMGbSzWWm5dR7UX1umbJR9wepOQos",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 455,
                    "name": "LIANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "robchoi",
            "date": "Jan 19, 2017",
            "title": "About details of LANG 1127",
            "comment_content": "The contents covered in the classes are very useful. It mainly covers how to write formal investigation report in Chinese, and how to present the research proposal and results. If someone need to learn how to write and present with Chinese language with formal way, I recommand to take this course.",
            "comment_teaching": "The instructor, LIANG, Xin has good attitude toward the student. I liked her methods, and satisfied with it. Also the method is very effective when you learn Chinese.",
            "comment_grading": "The instructor's grading method is appropriate. She gives grade by groups, but also there are few points for individuals. So please do not worry about the grades. If you work hard, you may get higher grades. Attendance is not that important, you may be able to skip classes in the term.",
            "comment_workload": "Although there is no specific homeworks, but the final essay and two presentations would be held during the term. It is quite challenging, and lots of researches about your research question will be required. Furthermore, the first presentation is about proposal, and the final essay is about the whole report, one of them is mid-term score, and the other will be final mark.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gpAnZPqTttIlCet9tr7K3i664drZOC6v",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 455,
                    "name": "LIANG, Xin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "5TH",
            "date": "Aug 14, 2016",
            "title": "Challenging but Rewarding",
            "comment_content": "",
            "comment_teaching": "The instructor is enthusiastic about the subject and very willing to help students with improving their Chinese skills. The classroom atmosphere is friendly and relaxing, welcoming students to speak up. The instructor is open to student feedback to cater the course to their needs and improve the learning experience.",
            "comment_grading": "",
            "comment_workload": "Workload is reasonable, with a few homework assignments (not graded) every week or so. However, near the end of the research project, writing and editing the research paper and preparing for the oral presentation can be challenging and time-consuming.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}