{
    "error": false,
    "course": {
        "id": 1387,
        "subject": "LIFS",
        "code": "2010",
        "name": "Modern Approaches to Biochemical and Cell Biological Research",
        "description": "Our current understanding of biochemical reactions and internal organization of a cell was progressively enriched by technological and conceptual breakthroughs in the 20th century. This course will use personal and scientific stories of six prominent scientists to highlight research areas that are still being actively pursued today. Topics to include are DNA and protein biochemistry, physical and chemical methods for biological research, and the use of model organisms.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"LIFS\" data-code=\"1902\" href=\"/review/LIFS1902\" target=\"_blank\">LIFS 1902</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.3,
        "rating_teaching": 4.35,
        "rating_grading": 4,
        "rating_workload": 3.7,
        "review_count": 20,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 488,
                "name": "MAK, Ho Yi",
                "count": 16
            },
            {
                "id": 478,
                "name": "BANFIELD, David Karl",
                "count": 15
            },
            {
                "id": 637,
                "name": "TYE, Bik Kwoon YEUNG",
                "count": 5
            }
        ]
    },
    "reviews": [
        {
            "hash": "7sWovvjcx5nwpRofr3uV7SeQxpf1gu3v",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                },
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Frankie:)",
            "date": "Jan 05, 2022",
            "title": "Heavy content and essay writing course",
            "comment_content": "Mak's Part:<br />1) Seymour Benzer -&gt; Biological Clocks and circadian rhythm <br />2) John Sulston - &gt;Animal development using C.elegan as a model of investigation<br />3)Eugene Kennedy - &gt;Fat synthesis PC and PE synthetic Pathways <br /><br />Banfield Part:<br />4) George Palade - &gt;Secretion and Membrane Trafficking. <br />5) Gunter Blobel - &gt;Mechanism of protein trageting<br />6) Paul Nurse - &gt;The mechanics of Cell Cycle. <br /><br />Each module spans 4 lectures, so a total of 24 lectures in a semester<br /><br />For the Biography assignment, I incorporated this year Nobel Prize of Medicine and psychology into my essay when introducing Leslie Vosshall. For more info, please visit https://www.nobelprize.org/prizes/medicine/2021/press-release/<br /><br />The scientists for the biography assignment are as follows. <br />Frederick Ausubel<br />Scott Emr<br />Takashi Kadowaki<br />Leslie Vosshall<br />Peter Walter <br />Graham Warren<br /><br />For the Infographic assignment topics are:<br /><br />Prof. Banfield’s options:<br />1)Outline how using fluorescent activated cell sorting (FACs) combined with genetics could have been used to identify yeast mutants with defects in the cell division cycle (cdc).<br />2)Outline how correlative EM light microscopy, and the retention using selective hooks (RUSH) assay could have been used to define the pathway by which newly synthesized proteins are secreted from cells<br /> <br />Prof. Mak’s options:<br />3) Measurement of chemotaxis behavior of C. elegans. You may focus on specific volatile attractants or the sex pheromone.<br />4) Measurement of adult lifespan of C. elegans.",
            "comment_teaching": "I think Prof MAK teaches better than Banfield. Mak explains everything clearly and his lecture notes are also better for revision. <br /><br />Banfield lecture ppt are, somehow, scattered and a little bit hard for us to revise",
            "comment_grading": "I don't know how good or bad is the course grading student as none of the scores for biography, Infographic, Final exam was released.<br /><br />Zero transparency when it comes to grading<br /><br />Biography 30%<br />Infographics 25%<br />Final exam(50 MC from Banfield and 35 MC from Mak in 3hrs ) 45%<br /><br />Letter grade: A+<br /><br /> Tips for Banfield's part:<br />-pay attention to what cellular constituent was discovered by which scientists <br />-the purpose and the difference between different centrifugation Techniques <br />-Pulse-Chase assay <br />-Pay attention to the image in the lecture slides, identify what they are and the design of the experiment<br />-pay attention to the experimental results and how the scientists perform the experiment and their respective control set-up<br />-pay attention to the video on how Blobel used the Nobel prize money that Benfield played during the lecture.<br /><br />Mak's part:<br />-basic understanding of a genetic cross between nematodes; identify the recessive and dominant alleles<br />-how does a negative-feedback mechanism look like?<br />-apoptosis pathway in cancer suppression<br />-identify the animal by looking at the circadian rhythm<br />-calculate the length of the circadian rhythm<br />-what happens if DA is absent in nematodes stage transformation?<br />-the structure of the coenzyme in the PC pathway<br />-remember the numbers in the lecture ppt",
            "comment_workload": "Workload is high for this 3-credit courses.<br /><br />Final coverage: all 24 lectures with 50 MCQs from Benfield and 35 MCQs from Prof.Mak<br /><br />2 pages of A4-sized biography <br />1 page of A4-sized Infographics <br /><br />lots of things to be prepared before writing Biography and Infographic and also need to remember lecture content from all lectures.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 8,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZLHXi5oMzdLEv2WAD0hocKrcEXRtaOWM",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                },
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                },
                {
                    "id": 637,
                    "name": "TYE, Bik Kwoon YEUNG",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ym7135",
            "date": "Dec 27, 2017",
            "title": "Very insightful course about scientists and scientific research - highly suggest this course for anyone interested in research",
            "comment_content": "The course structure is a little bit confusing - basically each professor teaches 2 modules (each revolves around a Scientist and a field of life science), each corresponds to 30 minutes of testing in the exam. These modules have three lecture teaching classes and one discussion tutorial class (the interactiveness depends on the professor). <br /><br />Each student in the class is randomly allocated to one module to answer an essay question (1 A4 page, font 12, single spacing, not too long) when that module starts (the essay question is released on the first day of that module) and you have to finish the essay before the tutorial class, and basically the professor MAY call on these students to talk about their findings in the tutorial. Everyone can see the modules' question but only the designated students can submit it. <br /><br />The 6 modules taught in my semester (in chronological order) were: <br />- Module 1 - Seymour Benzer - Circadian rhythm and animal studies on flies and mice (Mak) <br />- Module 2 - Fred Sanger - DNA and protein sequencing (Tye)<br />- Module 3 - Elizabeth Blackburn - Telomeres (Tye) <br />- Module 4 - Eugene Kennedy - Phosphatidyl synthesis pathway (Mak) <br />- Module 5 - George Palade - Centrifugation, EM and pulse chase technology, and organelles (particularly ribosomes) (Banfield) <br />- Module 6 - Paul Nurse - budding yeast, temperature sensitive mutations and the cell cycle and autophagy (Banfield)&nbsp;&nbsp;<br /><br />Each module was very insighftul - you are introduced to the tools and methods in the field, and then how this Scientists worked and collaborated, afterwards you learn the subsequent work in the field and the new technologies used now. In my semester, the order of the modules really seem as if it is flowing in increasing difficulty (beginning was so much easier than the end).<br /><br />Apart from the modules, you need to write a 1 A4 page biography on one Scientists (they provide a list of 9 you choose 1) - you mainly have to discuss their method of discovery and the context of their research.",
            "comment_teaching": "I feel like the three professors teaching, tutorial question and exam question follows a spectrum from fixed, straightforward and predictable to most outgoing, casual and unpredictable (you will totally understand what I mean when you take this course). But all in all each style still works very well and provides new learning experiences.&nbsp;&nbsp;<br /><br />Tye: <br />Most straightforward and predictable out of the three. Her modules had very clear learning outcomes, easy to flow and follow through. Her exam questions are very predictable exactly the techniques, skills and knowledge she taught in class. Her tutorial questions are the easiest (thank god I was allocated to one of hers) because the answers can be easily googled and tend to be theory based, and these questions don't usually involve personal input it is mainly finding the right info. She tries to make her tutorial quite interactive by calling out 2-3 students allocated to her tutorial to talk in front of the class. Almost everyone did very well in her exam questions and her tutorial questions were almost all full or near full marks. <br /><br />Mak: <br />His style is somewhere in between the other two professors - his content is quite clear yet he introduces a lot of additional facts that are interesting (like intro to lab machines and stuff). His tutorial questions are very experimentally based, meaning that you need to design experiments to investigate the intended outcome - with a lot of factors to consider. His exam questions are also experimental design, like it is mainly using experiment techniques from the lectures and applying it to a similar situation (e.g. lecture - mice genetic experiments on circadian rhythm, exam - design experiments to investigate fish circadian rhythm, the fish has characteristics ....), yet there are always one or two questions that nobody knows where it comes from. His classes are the least interactive of the 3 professors, his tutorials is basically him teaching and revealing answers. <br /><br />Banfield <br />He is the course co-ordinator and also one of the top scientists in HKUST. He is very out-going and extremely funny, like his jokes make everyone laugh and his classes are just so much fun. He gives out chocolate and biscuits if you participate in class !!! He makes half the class participate but he is very friendly and inviting. He does introduce a lot of important principles of scientific research and does state the important bits for exams, but he does go off the tangent A LOT, but these details are still quite interesting. His tutorial questions are very open-ended, like the choice of topic is actually up to the student and needs so much personal input and decision making. His exam questions mainly required writing, and some were based on his lecture material, like asking 'what is the particular technique that ... used?' a lot were application questions too. I find his modules and questions to be most difficult because the content was not as fixed and the exam questions were very unpredictable.",
            "comment_grading": "The grading % are as follows:<br /><br />30% - Mid term - module 1-3 (90 minutes - 30 minutes for each module) <br />30% - Final exam - Module 4-6 (90 minutes - 30 minutes for each module) <br />20% - Biography <br />15% - Tutorial essay<br />5% - Tutorial attendance (iPRS system) <br /><br />We were not told what % of students got A, B, C... but I have heard that only a small % are within the A band. I personally got at least 1.5 s.d. above mean for mid-term, 19/20 for Biography, 15/15 for tutorial essay (the mean for both was super high). Score of finals was not revealed, but I performed similar to mid-term. But I ended up with an A. Meaning that they have very high standards for allocating grades.",
            "comment_workload": "There is quite a workload for this course - the exams was only 30% MCQs and a lot were written and some drawing questions, so you need to remember a lot of details rather than just recognition. <br /><br />A lot of the experiments and techniques taught in class is not easily understood on the get-go, you may need to do some further reading or youtube videos to understand. But luckily there is lecture recording so you can go back (or watch for the first time!) in canvas. <br /><br />The tutorial essay was quite stressful because you had 6-7 days to research and write an essay (which is not easy if your question requires a lot of personal input). The biography was assigned in mid-September and due in before study leave in December, however a majority of the class (including myself, woops) left it to the last minute to do! I do advise choosing a Scientist who has a lot of info online, I chosen a Scientist based on my interest in his research but he has so little info about him online (not even a Wikipedia page...) so I really struggled.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6CqIacFzaF54iuIJMvPJPFA9klx96lOT",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                },
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                },
                {
                    "id": 637,
                    "name": "TYE, Bik Kwoon YEUNG",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "qorhvk",
            "date": "Aug 05, 2016",
            "title": "",
            "comment_content": "Very interesting class. Actually it was my first class that was not held in lecture theater, so for me it was relatively small group. Each professor chooses two scientists that they love and lecture about their major scientific finding.",
            "comment_teaching": "Prof. Tye<br /><br />She is a visiting professor. Very passionate and loving. Her part was about DNA sequencing and telomere. Both contents were interesting and I think her part was the part that I understood the most.<br /><br />Prof. Mak<br />His accent is very gentle. He taught us about PC synthesis and biological clock. Actually this was a new course so the system was not solidified, and he was the first prof to deliver the lecture, so I think he overestimated our level.... It was hard to follow him. Still, his teaching was really nice.<br /><br />Prof. Banfield<br />He was very humorous (though quite a lot of them are black humors). Some people said his speech is too fast, but I think understanding was not the problem, just hard to do note taking because of the speed.&nbsp;&nbsp;He likes to jump to other topics all in sudden. So when he is lecturing, I get what he wants to tell us, but when I revise, I find some of my notes are totally unrelated to the topics and I do not even know why this topic is in my notes.",
            "comment_grading": "Grading... I think they are hard grader. My overall grade was ~0.9~1sd above mean, and got B. <br /><br />There is two written assignment and one final, no midterm<br />Assignment 1: 20% writing a one-page biography of a scientist (choose 1 scientist from 6 scientists)<br />Assignment 2: tutorial question. (15% question, 5% PCR) <br />Final: 60%: The mean was very low for final, around 50%. The long questions were quite hard.",
            "comment_workload": "Not very huge.<br />Assignment 1 is to write a biography and they give you plenty of time to finish it. It is only one page, so not hard to write.<br />Assignment 2 totiral question: There are six tutorials, one tutorial for one scientist. You have to attend every tutorial as the attendance is taken, but only require 1 written assignment to submit. You will be randomly assigned to one of the tutorials and need to submit the question for that tutorial. <br />The question is tricky sometimes and you need to do some research based on the lecture taught. The question style varies from professors. Some professors questions that require quite a lot of research, but if you have done the research correctly, he just gives you the mark. Some professors are strict and only wants specific answer that he thinks right.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lyVUSXeaBog9tjtZYIExfAs1MYzziyet",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Mike Dai",
            "date": "Jan 24, 2018",
            "title": "",
            "comment_content": "Content very interesting and covers a lot of milestone research in the field of Biochemistry. Some are not straight forward and requires some thinking. I personally found the lecture videos very helpful, but I only used them for revision purpose. Go to class, not just for the sake of attendance but also because you get a much better understanding, lecture videos only helps then because it refreshes your memory.",
            "comment_teaching": "I think all the professors did a great job in teaching, although I will give special credits for Professor Banfield for the chocolate that he generously offered to anyone who answered his questions in his tutorials.",
            "comment_grading": "Pretty fair. Although attendance for tutorial do count towards grades, 1 of the professors just gave full marks to everyone because he did not use iPRS. <br />I got 14/15 for tutorial assignment, 19/20 for Biography, 23.3/30 for Mid term (Mean 18.7, High 27.8) and I got A (final score not known).",
            "comment_workload": "2 Written assignment (Biography for a scientist + tutorial essay to show understanding). 1 Mid term and 1 Final. Honestly, the written assignment does not take a lot of time, but does require some thought (I started both of them on the same day as the dead line and spent ~3 hours, got 1 mark off full mark for both) . Strictly follow the marking criteria, put some thoughts and you should get a good score. <br />Mid-terms and finals are pretty easy, some course content may not be easy to comprehend at first, but lecture videos is provided and they are very helpful.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PtHINZCUepYQfStuPJ98Ns4hOvyEMvyW",
            "semester": "2015-16 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Atulya",
            "date": "Jan 25, 2016",
            "title": "",
            "comment_content": "This course is divided into 6 modules<br />1) Eugene Kennedy - Fat synthesis <br />2) Fred Sangher - Protein and DNA sequencing. <br />3) George Palade - Secretion and Membrane Trafficking. <br />4) Elizabeth Blackburn - Structure of chromosomes ( telomere) <br />5) Seymour Benzer - Biological Clocks. <br />6) Paul Nurse - The mechanics of Cell Cycle. <br /><br />Each module is woven around a Nobel Laureate and one of his/.her biggest discoveries. Through their life history, students are introduced to the world of scientists, their discoveries, experimental techniques and the approach to designing experiments. <br /><br />While the lives of the scientists is the theme of each module, historical details were barely tested in the exam. ( with the exception of one cheeky question, worth half a point XD).<br /><br />&nbsp;&nbsp;Emphasis is laid on understanding the rationale behind their experiments, ability to design simple experiments (involves understanding and application of experimental techniques)<br />and the concepts involved in their discoveries. <br /><br />All in all, the content was interesting and inspiring. The approach adopted in this course succeeded in presenting the flavors of science - curiosity, imagination and experimental design.",
            "comment_teaching": "This course is taught by 3 professors. Each professor handles 2 modules. <br />1) Prof Mak: <br /> He is very systematic in his presentation of information. His slides are comprehensive and have all the information required. He is eloquent and succinct in his delivery. All in all, he is a good lecturer. He was the most effective lecturer, with regard to remembering content. At the end of his class, you will remember the main points clearly.&nbsp;&nbsp;<br /> <br />2) Prof Tye: <br />Very passionate about her subject.&nbsp;&nbsp;Her lectures were interesting and very interactive, especially the tutorial sessions. the lecture notes were comprehensive as well. But she did not explain some concepts clearly, so make sure you clarify your understanding with the professor after or during class.&nbsp;&nbsp;<br /><br />3) Prof Banfield: <br /> Very humorous and interesting lectures. His classes were both enjoyable and informative. Eloquent in delivery but&nbsp;&nbsp;deviates often ( his side stories are interesting and funny),so one may lost track of the point being conveyed. He emphasizes the important points repeatedly, in a subtle ( not explicit) way, so if you pay attention, you will know what concepts to focus on for the exam. His lecture notes are comprehensive, but they had a lot of questions, without the answers. The answers were discussed in class. So if one does not attend lecture, they will face difficulty with those questions.&nbsp;&nbsp;Points for the tutorial solution are also subtly discussed in class prior to submission of the tutorial assignment. <br /> <br /> I strongly recommend attending class, as the finals tested students more on their conceptual understanding. It included some questions that required designing simple experiments.&nbsp;&nbsp;Context to some slides ( why the professor included them in the lecture) and&nbsp;&nbsp;answers to questions in the lecture notes will be provided in class. ( otherwise, one may wonder &quot; what was the purpose of this slide? Seems random....&quot;) Points for the tutorial assessment will also subtly be hinted&nbsp;&nbsp;in class, prior to assessment submission.",
            "comment_grading": "Final written exam - 60% <br />Had MCQ's, SQ's, LQ's <br /><br />Biography assignment - 20% <br />a one page report on a scientist of your choosing from a list of scientists provided. <br /><br />1 (ONE) Tutorial assignment. 15%<br />One page answer to the question asked in that tutorial session. ( question will be provided in advance, at the start of each module) <br /><br />Attendance and participation in ALL 6 tutorial sessions - 5%<br />This involves answering PRS questions. the accuracy of your answers is irrelevant, it is the participation that counts. <br /><br />In my opinion, the tutorial and biography assignments were fairly graded. <br />We did not receive the scores secured in the finals, so I am not aware how its graded. <br />I secured a pretty good grade in this course :)",
            "comment_workload": "I advice students to prepare for the course from the beginning. <br />Since there is no midterm, the final covers all 6 modules and the syllabus is deceptive ( seems less, but actually more voluminous than expected.) As long as you dont leave it to the last minute, and understand the concepts, you should do well :) <br /><br />I personally do&nbsp;&nbsp;not think it is required to read the research papers discussed in class. The professors clearly state what you need to know from those papers, and even include them in the slides. But read it you wish to clarify your doubts regarding the experiments. <br />The biography assignment is simple. ( just make sure you choose your desired scientist quickly, before the slots fill up. Otherwise, you'll end up stuck with a scientist who's work may be hard to find or present compactly XD). <br />Descriptors for grading this assignment ( what the professors exactly expect from students) are very clearly stated. Follow them, and you'll do well in this assignment. <br /><br />The tutorial assignment is also simple. The type of tutorial assessment will vary from prof to prof ( 'choose the wrong statements from this article', or, 'argue in favor or against this statement', or ' if the scientists had done this experiment using this sample instead of that one, how would the results have varied?') <br />One page assignment. Attend lecture and keep your ears open for hints, you'll do well in this assignment :)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1R0jVXyKVxXZUN77wyar8Uc3lkAqePov",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                },
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Chstellar",
            "date": "Jun 14, 2023",
            "title": "",
            "comment_content": "Too many details were demonstrated, overshadowing the spirit of introducing methodologies and the research workflow. Also, students may not be well prepared without taking LIFS2040 in the previous spring.",
            "comment_teaching": "It's a bit difficult to catch up with what Banfield is talking about... He uses (unnecessarily) complex grammar and vocabulary... I think he has the spirit of research but a certain level of English and biology is required to get his spirit. Mak is fine. He looks unapproachable but he's actually kind. Go ask questions in person!",
            "comment_grading": "Not sure. Got a B perhaps because I did badly on the essay. I think my final went well. <br /><br />For Banfield's final, there are a few MCQs targeting science history... Remember, there was a guy who failed in French and thus failed to get admitted to graduate school in the beginning.",
            "comment_workload": "Fair.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PQJs1bkyFboXuXYHHMs0eqLy8T66ZDfR",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                },
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "letmegohome",
            "date": "Apr 24, 2023",
            "title": "great teaching, min workload",
            "comment_content": "about basic biochem stuff, pretty useful! I attended most lectures and personally enjoyed all the lectures.",
            "comment_teaching": "teaching style is great and the slides are well-organized",
            "comment_grading": "nice grading! got an a in the end<br />For the final exam, there are some weird questions like why didn't xxx use dog as animal model or why didnt xxx go to high school...<br />I got all these questions wrong but still got a decent grade so guys dont worry too much about them:// just consider it as a weird sense of humor of Banfield lol",
            "comment_workload": "very light. no assignment. I finished the essay and infographic winthin 2 days (each)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tWzKSoieLytfxlxAWM3KDr2MQkniZcfb",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                },
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kenjiron",
            "date": "Jan 23, 2023",
            "title": "Cool and interesting course to get into for bio majors",
            "comment_content": "Content wise, the course covers the discoveries and experiments of six respectable scientists. You're expected to understand how these experiments work and the ideas behind them, ranging from the scientific facts that existed in their time to the hypotheses and seminal discoveries (the discovery that contributed to the final discovery) they have made. <br /><br />Can be very interesting to learn ('specially for people in BCB) since you can really go into the thought processes of these scientists and see how they get to their final result.<br /><br />Course Overview:<br />Module 1: Seymour Benzer (Prof. Mak)<br />Module 2: John Sulston (Prof. Mak)<br />Module 3: Eugene Kennedy (Prof. Mak)<br />Module 4: George Palade (Prof. Banfield)<br />Module 5: Gunter Blobel (Prof. Banfield)<br />Module 6: Paul Nurse (Prof. Banfield)",
            "comment_teaching": "Prof. Mak will be teaching you the first three modules of the course and I'd say overall his teaching is pretty good. The way he teaches is very concise and clear, getting straight to the point with each slide he comes across. At some point in the course, he showed us a sample C. elegans (its a small worm) population, which was also pretty cool to see in action. His slides are pretty simple and are pretty straight to the point, but a lot of the explanations that complements it comes from his lectures, so make sure to pay attention and note important things accordingly. <br /><br />Prof. Banfield will teach the later half of the course and while he can be hard to understand, he provides a lot of interesting insight into his lectures. His English is pretty posh and you can catch him using complex words a lot of the time (e.g. paradigm, robust etc. lol). I've had to rewatch his lectures often since it can be easy to get lost in his lectures due to his expansive vocabulary and how fast he speaks as well. Despite these, his lectures are still very insightful overall, you just need to spend more time on them. His slides can be a bit hard to understand too since you can't really look at them alone and understand the entire module. Better to compound the information in it with his lectures to understand it better.",
            "comment_grading": "Your final grade is split into two main parts: assignments and a final exam. A biography (30%) and an infographic (20%) comprise the first half of your grade while a final exam (50%), which covers all modules in the course, will comprise the later half. <br /><br />The final exam consists of mostly MCQ questions (Prof. Mak and Banfield) and a few short answer questions from Prof. Mak as well. As long as you understand the concepts around how the experiments are done, how they work, and the underlying science behind them you'll be fine. <br /><br />There will be some goofy questions in the exam here and there (one of them asked what subject this scientist failed in school lol) and I think they exist to see if you've been listening to the lectures so make sure to pay attention.",
            "comment_workload": "Your assignments, the biography and the infographic, will be announced near exam periods with the biography being announced near the midterm exam period and the infographic being announced near final exams. <br /><br />Both the biography and the infographic mainly focus on the SCIENTIFIC backgrounds of other scientists (not the ones you discuss in lectures), so don't go mentioning their entire life. <br /><br />These assignments require a good amount of researching (moreso for the biography) so if you can find the right sources for the job, then you should be fine. Both also have strict limits and formats you should follow (word count cap, specific margin sizes that aren't normally what you'd see). Don't go too crazy on these, just be clear and concise on what you want to convey and you're golden.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IQnOIdeslxSIKz8XlGmGKY40BZWwMGdu",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                },
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "UST Robot",
            "date": "Jan 08, 2023",
            "title": "Interesting courses to BCB students! Really enjoyable!",
            "comment_content": "6 modules in total<br />First three modules were taught by Prof. Mak<br />Last three modules were taught by Prof. Banfield<br />Module 1: Seymour Benzer<br />Module 2: John Sulston<br />Module 3: Eugene Kennedy <br />Module 4: George Palade <br />Module 5: Gunter Blobel <br />Module 6: Paul Nurse <br />3 Lectures + 1 Tutorial in each modules",
            "comment_teaching": "Prof. Mak:<br />- talks very clear<br />- lecture notes are comprehensive (not too long or not too short)<br /><br />Prof. Banfield:<br />- talks very fast <br />- friendly and humorous person<br />- his lecture notes have lots of information, pay more attention to them, especially the questions<br /><br />They are good professors, and they will answer your questions if you don't know.",
            "comment_grading": "Good Grading<br />1 Biography Assignment (30%)<br />1 Infographic Assignment (20%)<br />1 Final Exam (50%)<br /><br />No grades will be released after you submitted your assignments.<br />Final Exam (120 minutes):<br />40 MCs (Prof. Banfield)<br />20 MCs + 2 short written answers (Prof. Mak)<br /><br />I think you will get good grades if you work hard on your final exams and two assignments.",
            "comment_workload": "2 Assignments<br />The topics of two assignments will be announced during the Mid-Term period and around late November. A bit crazy!<br />You have to finish them before the deadline after selecting the topic in CANVAS. You have to spend some time to search lots of information from the Internet. You can able to do them after sorting out some useful information from the internet.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0QLtudTuKUYtzUZCwgfPIvJEjGgejUBO",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                },
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ggg_",
            "date": "Jan 06, 2023",
            "title": "Great Life Science course for a taste of research",
            "comment_content": "Prof.MAK taught for the first half semester and Prof.BANFIELD taught for the second half semester.&nbsp;&nbsp;They each introduced three scientists and how they made their seminal discoveries. It is like having two teachers guiding you to read papers and explaining essential concepts along the way, which is quite insightful.<br />Module1. Seymour Benzer: Biological clocks<br />Module2. John Sulston: Animal development<br />Module3. Eugene Kennedy: Fat synthesis<br />Module4. George Palade: Secretion and membrane trafficking<br />Module5. Gunter Blobel: Mechanisms of protein targeting<br />Module6. Paul Nurse: The mechanics of the cell cycle<br />Both the ways of targeting problems and the relevant knowledge touched are important.",
            "comment_teaching": "MAK: I think he is one of the best professors I met in HKUST. His English has almost no accent and is very comfortable to listen to. He explained the concepts and points very clearly and tells you what will or will not be tested in the exam. (He always said don't want to waste our brain on remembering the year of the scientists winning Nobel etc. lol) He tried to involve the applications in our daily life and cultivate our critical thinking in the lectures. He also utilized iPRS questions during the lectures to check our understanding of the contents. (not graded) The only one drawback that I can think of is that he talks a bit slowly. <br />Banfield: He speaks faster than MAK and usually uses lots of fancy expression that may hinder your understanding of what he is actually talking about if your English is not good enough. I felt that he actually made the slides and organized the contents in a very logistic way when doing revision by myself but felt confused when listening to him in the lectures. (Maybe it's because he often goes off the topic unknowingly.) He didn't explain things as clearly as MAK, but maybe more humorous and gave us break during the lecture. (or end lectures early) He also sought interactions with students more often. He got COVID near the end of semester and missed lots of lectures and ended up covering all of the contents in one session. <br />I think they are all willing to answer questions after class.",
            "comment_grading": "No midterm, one biography, one infographic, and one final.<br /><br />Biography: (30%)<br />Choose from one of the scientists provided and write a biography in 1 page.<br />Sean F. Brady, Pierre Chambon, Pieter Cullis, Gillian Griffiths, Anne Spang, Ozlem Tureci<br />I spent quite some time reading the papers published by my chosen scientist as I was not sure how many actual research contents to include and reading papers are indeed not easy. It's hard to find other aspects of the scientist besides academics (e.g. hobbies, personal life) as few information are available on the Internet. But since description of the scientific achievements seems to be only requirement, it is not a problem.<br /><br />Infographic: (20%)<br />Choose from one topic provided by MAK or Banfield and follow the template and requirements to create a 1-page infographic. Each infographic is expected to address how using more “recent” technological advances / approaches might have been used to address topics presented during lectures.<br />MAK:<br />Prof. Mak’s options:<br />1) Measurement of chemotaxis behavior of C. elegans. You may focus on specific volatile attractants or the sex pheromone. <br />2) Measurement of metal ion attraction or avoidance of C. elegans. <br />Prof. Banfield's options: <br />1) Outline how using fluorescent activated cell sorting (FACs) combined with genetics could have been used to identify yeast mutants with defects in the cell division cycle (cdc).<br />2) Outline how correlative EM light microscopy, and the retention using selective hooks (RUSH) assay could have been used to define the pathway by which newly synthesized proteins are secreted from cells <br />Final: (50%)<br />(25% from Prof. Banfield and 25% from Prof. Mak). Multiple choice questions (Prof. Banfield) and multiple-choice questions plus questions that require short written answers (Prof. Mak).<br /><br />Tips for Banfield part: <br />1) Make sure you understand the method, purpose and significance of each diagram he presented.<br />2) Pay attention to every sentence he said about abstract things like &quot;how to address problems&quot;.<br />3) Watch the videos he played during the lecture as he will test on some fun facts of the scientist. (Like what language exam did Paul Nurse fail?)<br />4) Remember who discovered which organelle.<br />Tips for MAK part: <br />1) One long question asked you to find mistakes in an experimental design about fat synthesis and explain and correct them. (You must be very clear about the synthesis pathway of PE and PC as well as their difference)<br />2) Another long question was about circadian rhythm. (Make sure you know the way of measuring gene expression and points worth noticing)<br /><br />Wanna quote the words from other reviews: &quot;0 transparency when it comes to grading&quot;, no scores of assignments or exam are shown, and the grade was released really late. Hate this...",
            "comment_workload": "The workload is quite high. The biography takes quite some time to finish as you have to read papers and try to understand what the scientist you chose was doing. The infographic is a bit easier. The lectures themselves also require time to digest since both the research techniques and the knowledge touched may be unfamiliar to students. The final exam preparation was also tough as there were many contents. But I really learnt a lot from the scientists, both in academic and in research attitudes. The course is definitely a great course for students to get to know what research is like.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "D2aJmMRWfJtwLlWzBGxxyx4IMlXNM0um",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 0
                },
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mc_cch",
            "date": "Jun 29, 2022",
            "title": "I almost forgot what I have learnt in this course",
            "comment_content": "The content could be quite challenging for a year 2 student as we may not fully understand the basic principle of without the concept of scientific research, especially for the part of genetics. <br /><br /><br />The topics covered by MAK were relatively easier.<br />1. Biological clocks<br />2. Animal development<br />3.Fat synthesis<br /><br /><br />For Bandfield's part, many students couldn't follow the progress because of the unclear and strange explanation.<br /><br />4.Secretion and membrane trafficking<br />5. Mechanisms of protein targeting<br />6.The mechanics of the cell cycle",
            "comment_teaching": "Both Mak and Bandfield were experienced lecturers and quite patient.<br /><br />Mak: (B+)<br />He was a local lecturer, who always pointed out the key points and explained them one by one. The language used by him is more straightforward, so it is much easier to follow. <br /><br />Bandfield: (C)<br />Although we watched the recordings of Bandfield's lecture several times, we still couldn't fully get what he was talking about. Sometimes, I might need to listen to the same sentence repeatedly on the Zoom recording, because Bandfield always varied the sentence structure and grammatical patterns in his speech. He might skip some parts of the sentence when a new idea popped up in his mind. <br />For example, he always used 'by virtue of' / 'as a result of' , instead of because / as / since... <br />Some British informal phrases could be heard, e.g. get one's head around",
            "comment_grading": "No comments, no scores for all the assessments! (I hate this!!)<br /><br />But finally got B.",
            "comment_workload": "Final written exam<br />Written assignment (essay)<br />Infographic<br /><br />acceptable<br />but it suddenly switched to f2f in this pandemic, so I didn't have time to review the last 2 chapters (as I didn't quite get what Bandfield was talking about)",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "k2SPT1myEAeZIsLnUWAvIVYQEfgoaPnJ",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Phil7",
            "date": "Jan 20, 2021",
            "title": "Good",
            "comment_content": "The course is mainly about some modern approaches to research into life science topic including using C. Elegan to understand cell lineage and drosophila to understand biological clock.<br /><br />The content is easy but make sure to follow and understand its structure.<br /><br />I recommend to take the lectures instead of skipping",
            "comment_teaching": "Professor Mak is good at teaching. Attending his lectures will help you understand.<br /><br />He will give time to use to ask questions. And he is logical to guide you.",
            "comment_grading": "Two assignments to replace the mid-term<br /><br />One is biography on a given scientist , the other one is infographic.<br /><br />Make sure to email professors if u have problems because the marking criteria is quite illusive and vague.<br /><br />But if u attend all lectures and work carefully, it is easy to get A range.",
            "comment_workload": "Two assignment + one Final<br /><br />It is ok. not too much workload<br /><br />But remember to spend some time on the assignments, like finish them weeks ahead and ask professors questions to refine them. Rushing the assignments won't get u good grade.<br /><br />The final is all MC, need to well understand and memorize the methodology in lectures.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bHz4uh01NerVaBNb12aCgPCfU8x8pK1o",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                },
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Leo123454321",
            "date": "Dec 16, 2020",
            "title": "",
            "comment_content": "It's about the study of the discovery of different scientists<br />Seymour Benzer<br />John Sulston<br />Eugene Kennedy<br />George Palade<br />Gunter Blobel<br />Paul Nurse",
            "comment_teaching": "For me, the content was quite hard to understand, so you may need to do more preparations for the exams.",
            "comment_grading": "I was not good at this course, so my grade is really poor.<br />Both exams were below mean, but I believe the grade of this exam is not that bad, mean is around B.",
            "comment_workload": "Not heavy, just midterm and final exams and a short biography about one of the provided scientists' study.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QKHnvmBssryClZePURTk9i7L83RLnl50",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Tryme",
            "date": "Feb 05, 2018",
            "title": "",
            "comment_content": "Topic如下<br />Module 1: Seymour Benzer --&gt; Biological clocks <br />Module 2: Fred Sanger --&gt; Protein and DNA sequencing<br />Module 3: Elizabeth Blackburn&nbsp;&nbsp;--&gt; Structures of chromosomes<br />Module 4: Eugene Kennedy&nbsp;&nbsp;--&gt; Fat synthesis<br />Module 5: George Palade --&gt; Secretion and membrane trafficking <br />Module 6: Paul Nurse --&gt; The mechanics of the cell cycle <br /><br />每個module佔1-2個week到<br />有tutorial要上 計attendance<br />mid-term前會有review session 建議去 去下冇壞",
            "comment_teaching": "BANFIELD我個人覺得教得不錯 雖然講野講得快但會引導你思考 而且有lecture video所以唔洗驚miss左D咩重要內容<br />MAK同TYE教既topic我淨係睇過lecture notes 不便評論",
            "comment_grading": "正常grade<br />咁簡單既assignment同attendance就佔左40%<br />mid-term同final就睇你肯不肯花時間溫<br />我就拎B既",
            "comment_workload": "final written exam - 30%<br />mid-term - 30%<br />written assignment - 20%<br />written assignment for TUTORIAL - 15%<br />tutorial attendance - 5%<br /><br />mid-term同final 都唔算難考前睇lecture video catch下重點就夠<br />written assignment寫一個scientist既biography 上網搵下資料好快搞掂<br />written assignment for TUTORIAL圍繞住一個question回答 建議先google下topic involve既concept 明左再答 (唔會好曬時間; 易拎高分所以average好高下)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5Fop7ttVSz6rWlE5OhUvaDo31ON7hSji",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                },
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                },
                {
                    "id": 637,
                    "name": "TYE, Bik Kwoon YEUNG",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Leoa",
            "date": "Aug 17, 2017",
            "title": "",
            "comment_content": "MAK: Biological clocks+ Fat synthesis<br />TYE: Protein and DNA sequencing+Telomeres<br />Benfield: Secretion and membrane trafficking+Cell cycle<br />每個chapter都有3堂lectures and 1 tutorial",
            "comment_teaching": "3個professors total 6 chapters, Prof. Mak負責lipid, Prof. Tye負責教telomeres, Prof. Banfield教cell cycle. Mak教得幾好好溫柔，Tye會成日問問題，Benfield我catch up 唔到佢講既野，感覺上佢覺既野大部分時候同D notes無咩關係。",
            "comment_grading": "比我想像中好，所有assignment and midterm都above mean，final唔知， final grade A-",
            "comment_workload": "1)Tutorial assignment:每人都要做其中一個tutorial既功課，佢assign比你<br />2)Biography:有幾個科學家，簡其中一個科學家尼寫<br />3)Take attendance<br />Midterm+Final",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5dApwlG4YhM1uN0R7uemREz553ej4CRH",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                },
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                },
                {
                    "id": 637,
                    "name": "TYE, Bik Kwoon YEUNG",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "oto",
            "date": "Jan 16, 2017",
            "title": "",
            "comment_content": "The content was rich, yet quite challenging. It was because the principles explained are advanced and independent from the previous courses. However, it provided students a glimpse at how scientists did their research and tackle problems. Students should find out more and read more aside from the course materials. Honestly, it was too hard for year 2 students.",
            "comment_teaching": "The course was taught by 3 instructors. Overall, their teaching was good. Dr Mak's accent was elegant. His powerpoint was quite informative. Prof Tye's expression was lively. Prof Banfield was humorous, but that was quite stressful during lessons as he picked nearly half of the class to answer the questions. Basically, you can easily stay focus during class.",
            "comment_grading": "As the content is challenging, the performance of the whole class was not very diverged. The exams were hard. They required understanding of course content instead of memorizing them. The short questions were not short at all, as well as the answers.",
            "comment_workload": "The workload is fair. However, we got quite confused at the beginning of the semester as the work distribution was special for this course. There was 2 essays in total, One for a tutorial and one for a biography. They did not require us to write long essays. But they were good chances for students to go through part of the course content.<br /><br />Attendance was taken in every tutorial.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bgsejkfaNJoSr23WWXbQo5qAdjfYejzG",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                },
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                },
                {
                    "id": 637,
                    "name": "TYE, Bik Kwoon YEUNG",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "uststudent",
            "date": "Dec 29, 2016",
            "title": "Hard, should have a right mindset for setting up experiment",
            "comment_content": "Materials are non accumulative at midterm and final. 3 modules before midterm and 3 after it. Materials are quite hard, need to understand how scientists design experiments and a little background of the famous scientists adn their topic.&nbsp;&nbsp;Exam paper is quite hard as it asks a lot about designing experiments. Understanding&nbsp;&nbsp;the&nbsp;&nbsp;material and then know how to make an experiment to prove sth is important.",
            "comment_teaching": "All professors are quite good. Professor Tye and Professor Banfield always ask questions and will ask people directly during lessons as they are more discussion- oriented. Attendance is only taken at tutorial lesson.",
            "comment_grading": "Final not told, not knowing final mark is hard to determine the grading is good or not but seems not so good even midterms and all assignment above mean but no good grade.",
            "comment_workload": "Lots of things to remember. Lots of material to look at when doing tutorial and the assignment, usually the original research paper of the related topic for citation. Quite a lot of time is needed to go through them for enough information. Assignment is to choose one scientist from the given list and write some about them and their research. One tutorial is assigned for you to finish the assignment, writing a one page essay to the questions of the related tutorial.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YKiNEOuaZaDimXrhhITAmuMEDOLcRz8x",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "yolandaaaaaa",
            "date": "Sep 27, 2022",
            "title": "",
            "comment_content": "Introduce幾個科學家同佢嘚嘅成就，可以當歷史堂咁聽，上堂會有iprs但係唔記分，如果有興趣可以自己去查下d科學家資料同science article之類，會對之後的writing有幫助",
            "comment_teaching": "Prof講嘢OK嘅，冇乜口音，照讀ppt，有時會延伸小小到但係又叫我嘚唔好記住",
            "comment_grading": "沒出",
            "comment_workload": "兩個written assignment➕final exam",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "O9qAf8I8aZuovGs6StynzaCZ5xzBc1AB",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                },
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "teachmeeng",
            "date": "Jan 05, 2022",
            "title": "Great course if you try to enjoy it",
            "comment_content": "You can learned a lot from different Nobel prize winner like Seymour Benzer and Eugene Kennedy. Not just academically speaking.<br /><br />The result of their findings are great but not the points of this course. You will feel bored if u just memorize those uninteresting things. Try to focus on their way of thinking and learn it.",
            "comment_teaching": "Both professor Bandfield and Mak are a great teacher. <br /><br />Bandfield's lessons are more lively. Suitable amount of humor to help u not feeling sleepy at the class. The talking speed maybe need some extra time to adapt but once u overcome this, you will fall in love with his class. (At least I do)<br /><br />Mak's lessons, on the other hand, are more steady. I guess it fits the image of local teachers. I'm not saying he is not gd, he still answer all your questions and the those IPRS questions do help u get through those difficult concepts. Anyways, two professors are pretty gd for me.",
            "comment_grading": "Biography 30%<br />Infographics 25%<br />exam 45%<br /><br />Stop care about the percentages and do your best in every assignment and exam.<br /><br />Final grade : A-",
            "comment_workload": "The workload is fine compare to other courses.<br /><br />I spend numerous time on biography which is not necessary. I just fascinated by the scientist. This assignment need some time to finish it. You need to learn some new things through the essay that the scientist published. Try to love the process or you will feel bored pretty fast. Word limit: 2 pages of A4 size. <br /><br />Infographics is a piece of cake compare to the biography. Professors will provide a format for you. Just fit the content in the format and you will be fine.<br /><br />Exams is all MC, Bandfield's part is kinda tricky. You need to remember the content in the video that play at the class. Just listen to the story and that's enough. Mak's part is similar to what you expect in an exam which is some questions that heavily focus on the lectures note. You are a biology students, just memorize it.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IjTa6XUWqFbvTmZ8KpohNZa9knXMQyfy",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 478,
                    "name": "BANFIELD, David Karl",
                    "rating": 1
                },
                {
                    "id": 488,
                    "name": "MAK, Ho Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JJck",
            "date": "Dec 30, 2020",
            "title": "Super interesting Course ! One of the best course I've taken so far !",
            "comment_content": "All about scientist &amp; their research discoveries<br />1 topic per module, 1 Module 4 Lectures, total 6 Modules<br /><br />Generally they focus on teaching research method &amp; thinking process behind each research questions. This is very helpful on becoming a future scientist.",
            "comment_teaching": "Wow !<br /><br />Prof. Mak is really really great !!!<br />I really enjoy his lectures , they were fantastic !<br />He tells the story very well and build clear connections in the related topics.<br />He explains very clear, altho there're lots of materials<br />But require jotting many notes to understand the flow<br /><br />Banfield is kinda unorganized compared to prof. Mak.<br />But he triggers students to think behind each research process",
            "comment_grading": "Biography 24/30<br />Infographic 25/25<br />Final 46/60<br /><br />No Midterm<br />idk grade yet<br /><br />I think for infographic, choosing questions from prof. Mak is easier to get good marks, because references were provided, but for prof. Banfield, he didn't provide any reference paper to read.",
            "comment_workload": "I don't think there is workload<br />But it is highly recommended to watch all lecture video and in x1.5 speed<br /><br />Also Remember to do assignment 2 weeks before submission.<br />I did my infographic 2 weeks before ddl and I got good marks<br />But I did my biography 2 days before ddl and I didn't get good marks",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}