{
    "error": false,
    "course": {
        "id": 832,
        "subject": "LIFS",
        "code": "4963",
        "name": "Biotechnology Capstone Project",
        "description": "Under the supervision of a faculty member, students will undertake a project, which may involve investigation on topics relevant to biotechnology industry and business. The project can be delivered through the format of literature review, research, or practical study. Students are required to submit a written report that documents the project work and learning experiences. For BIOT students only. Approval of the course supervisor is needed for enrollment in the course.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2040,
            2030,
            2010,
            1940,
            1930,
            1910,
            1840,
            1830,
            1810,
            1740,
            1730,
            1710,
            1640,
            1630,
            1610,
            1540,
            1530,
            1510,
            1440,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 4,
        "rating_workload": 4.33,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [
        {
            "hash": "ZmAkGwjkmZk9uTIdMOdtXFw765YeGmcn",
            "semester": "2021-22 Summer",
            "instructors": [],
            "is_author": false,
            "author": "hizoe",
            "date": "Jan 29, 2023",
            "title": "",
            "comment_content": "You can choose any of the below: <br />(1) Internship in a recommended company <br />(2) 1 sem research <br /><br />and I chose internship. <br /><br />There is a list of recommended companies sent to you via email from LIFS department. <br />Try to do more background research of the companies, and look for more comments from the seniors if the options are the same with previous years. <br />Then, you submit your options to LIFS and they will pass your CV to the company. <br />The company will contact you for an interview if they select you. <br /><br />REMINDER!! <br />You CANNOT join UST capstone project and Gov's STEM program simultaneously. <br />Otherwise, your capstone project may be disqualified, which may affect your graduation. <br /><br />Check carefully whether the company you chose joins STEM program as well. If so, you should clearly specify your purpose (for Capstone project and its limitations) before you sign contract. AND clearly specify you DROP OFF from gov STEM program. <br /><br />** This also means that your salary will become min wage (without gov's support) <br />so check your salary when you sign your contract.<br /><br />FYI<br />In 2021-22, under STEM program <br />the salary would be $10500",
            "comment_teaching": "Wilmond Lai from LIFS is helpful. He replies email promptly. <br />Find him if you get a problem about the course.",
            "comment_grading": "B+",
            "comment_workload": "(1) The duty given by the company. <br />(2) A report submitted to LIFS. <br /><br />Guideline would be provided via email. Here are some suggestions. <br />- company background / overview <br />(you can talk about its policy)<br />- your position and duty <br />- learning outcomes",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "72re93ov7t4K8IX0xxcJB4UzfIlHXHQj",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "GuAlan",
            "date": "Jan 13, 2023",
            "title": "Literature review",
            "comment_content": "You choose your interest topic and the title is flexible. You can write some correlational topics, not the provided topic, but it depends on your supervisor.",
            "comment_teaching": "You can discuss the content and topic with your supervisor proactive. You just need to send an email and get a meeting. It also depends on your supervisor.",
            "comment_grading": "I got a B+.",
            "comment_workload": "It needs two progress reports in weeks 4 and 8. The final report needs to be submitted in the final examination period. Final Report (80%), which is assessed based on the Rubrics shown in the course information. The submission due date is the last day of the final examination (unless otherwise advised by your supervisor). <br /><br />You have to submit your report via canvas and send an email copy to your supervisor also. Don't forget to send a copy to your supervisor.(important)<br /><br />The student should at least provide the topic and outline of the article to indicate the initiation of the project in the first progress report and show some write-up in the second. It has not needed a specific format. <br /><br />Therefore, it only needs to write a few words and get a 20% mark for progress reports. (10% for each progress report. I don't know the mark but it looks like submitting that can give a full mark?). The failure to submit the progress report(s) by the due date will score 0% in this category automatically. I wrote around one hundred words for each progress report and demonstrate some write-up (around 2000 words). If you have no time, just write down some future plans and reasons. (I did it in the second progress report because I prepared a mid-term examination). I suggest making a proper allotment of time to write this report because it is thought-provoking (Just me ). You have to read many academic papers.<br /><br />The final report needs 8000-10000 not including review. It depends on your supervisor. I spent 4 weeks doing this report. <br /><br />Warning: Some literature review request a presentation. It also depends on your supervisor. Fortunately, I didn't need to give a presentation. Good luck. <br /><br />I heard some topic correlative to plants needs to give a presentation.<br /><br />My Schedule:<br />1st progress report&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Due date: Sept 30, 2022 (Friday)<br />2nd progress report&nbsp;&nbsp;&nbsp;Due date: Oct 28, 2022 (Friday)<br />Final report&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Due Dec 19, 2022 (Monday)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zkWDX05t3bhVVeW7Q22uE1JXCNcpcp6H",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "3ub",
            "date": "Nov 26, 2021",
            "title": "Wisely choose your professor / topic",
            "comment_content": "The course content depends on which topic you choose and the professor you choose. <br /><br />Basically you get to choose the topic. Few other students will also have the same topic. Then you need to choose the topic in depth for the literature review. <br />For instance, you can choose the type of diseases, when the topic just vaguely says &quot;diseases&quot;. <br /><br />Basically you have wide options on the content.",
            "comment_teaching": "The guidance really depends on the professor who you choose.<br /><br />I personally chose a professor where I felt his teaching was very useful to me. Though students struggle with his classes a lot due to his complexity in lectures, but I just loved his way of teaching!<br /><br />Usually you have to seek for help on what you have to do, but generally everything is up to you. If your organization is neat and just like the common science articles, it is fine.",
            "comment_grading": "Don't know yet, I will update on this.",
            "comment_workload": "Yes, obviously there is countless readings to do. BUT it is a topic I chose, and topic of my interest so it wasn't painful.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}