{
    "error": false,
    "course": {
        "id": 800,
        "subject": "LIFS",
        "code": "3150",
        "name": "Biostatistics",
        "description": "Statistical reasoning relevant to biological, medical and agricultural research, statistical analyses and interpretation, statistical techniques applied under various research circumstances.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2030,
            1930,
            1830,
            1730,
            1630,
            1530,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "IEDA 2510 (prior to 2018-19), <a class=\"course-link\" data-subject=\"ISOM\" data-code=\"2500\" href=\"/review/ISOM2500\" target=\"_blank\">ISOM 2500</a>, <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2411\" href=\"/review/MATH2411\" target=\"_blank\">MATH 2411</a>",
        "rating_content": 3.8,
        "rating_teaching": 2.6,
        "rating_grading": 3.5,
        "rating_workload": 3.7,
        "review_count": 10,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 498,
                "name": "LIU, Kai",
                "count": 9
            },
            {
                "id": 458,
                "name": "LI, Po Lung",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "g3Wvw3BftwOafqa4MzGYO8woDMXX21RB",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 498,
                    "name": "LIU, Kai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DemonicMocha",
            "date": "Aug 07, 2016",
            "title": "Fruitful but hard course",
            "comment_content": "Fundamentals of Statistics, type of data: numerical, categorical and the graph used to represents their relationship, statistical inference, confidence interval, t-test, ANOVA. To make the course more &quot;bio&quot; related, a lot of the case example used in lecture materials are agricultural or medical studies. <br /><br />The contents covered is definitely useful. Statistical concepts really teach you to think rationally. The contents also allow you to spot the flaws in statistical design and see through misleading statistical conclusion.",
            "comment_teaching": "Slightly boring. Professor Liu missed out a lot of opportunities to be interactive with the students and to stimulate us to question the statistical concepts in different cases. During the lectures, normally it's just him talking in a plain tone. Despite the plainness, the teaching is actually clear and logical.",
            "comment_grading": "Grading is normal. 5% attendance, 10% assignments, 40% mid term exam, 45% final exam. I got 0.5 SD above mean in both mid term and finals and I got B+.<br /><br />However, the exam is definitely challenging and it require deep understanding and clear concepts of statistical reasoning. So it was a&nbsp;&nbsp;hard-earned B+ for me.",
            "comment_workload": "The workload is relatively heavy. The assignment is extremely long and take at least 4 hours to finish. Yes, it legit took me that long to finish that even in a study group of 5 people. Other than the assignment, the course content is generally hard and require long time to understand and apply the concepts in calculations.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fm0UnPr6kc9y4vguZ2McFdcmynOwaYba",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 498,
                    "name": "LIU, Kai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ggg_",
            "date": "Jun 22, 2023",
            "title": "Do not take this course",
            "comment_content": "PART I Exploring Data<br />(1) Exploring Data: Variables and Distributions<br />Picturing Distributions with Graphs<br />Describing Distributions with Numbers<br />(2) Exploring Data: Relationships<br />Scatterplots and Correlation <br />Regression<br />Two-Way Tables<br /><br />PART II From Exploration to Inference <br />(1) Producing Data<br />Samples and Observational Studies<br />Designing Experiments<br />(2) Probability and Sampling Distributions<br />Introducing Probability/General Rules of Probability<br />Discrete Probability Distributions<br />The Normal Distributions <br />Sampling Distributions<br />(3) The Idea of Inference<br />Introduction to Inference<br />Inference in Practice/ Review Session 1<br /><br />PART III Statistical Inference<br />(1) Inference about Variables<br />Inference about a Population Mean<br />Comparing Two Means<br />(2) Inference about Relationships<br />Inference about a Population Proportion/Comparing Two <br />Proportions<br />The Chi-Square Test for Goodness of Fit<br />The Chi-Square Test for Two-Way Tables<br />Inference for Regression<br />One-Way Analysis of Variance (ANOVA)<br />Follow-up Tests / Two-Way ANOVA<br />Nonparametric Tests<br /><br />It is basically the contents in the textbook: The Practice of Statistics in the Life Sciences, although some too &quot;mathematics&quot; part is skipped. The contents are not too difficult.<br />Generally, it would be useful for future life science research and may improve your critical thinking by learning to spot the flaw in statistics that you encounter in daily life.",
            "comment_teaching": "His teaching is bad. <br />(1) He seldom uploaded slides before lectures, and he even didn't upload after lectures for several times. And the reason is that he is too lazy to make another version of slides which does not contain answers to practice questions.<br />(2) I think he understand the concepts (hopefully), but his English didn't support him to explain it clearly, and he is constantly saying &quot;e..em...e...eee..&quot;. He sometimes suddenly sped up and sometimes just remain silence for a period. His tone is just plain, and the volume of his voice keep decreasing as he speaks. It's very easy to fall asleep. Maybe that's the reason that most people stopped to show up after the first several lectures? Most of the semester there are just three of us sitting there listening. (I have no idea why I kept attending lectures. It is ridiculous.) To be honest the textbook is explaining things crystal clear and you can just learn it by yourself without taking this course and having such suffering.<br />(3) The midterm was on March 30, and it just took 30min for the TAs to mark 30 people's MC. However, he kept saying that he will upload the midterm scores for two weeks and ended up uploading it only several days before the final exam, with no mean or any statistics given.<br />(4) Oh, forgot to mention, one time he just entered the classroom 30 mins later than he should with no explanation and no announcement. It later turned out that he was sleeping late.<br /><br />The previous comment is right, he is just an instructor that &quot;doesn't give a shit&quot; about this course.",
            "comment_grading": "attendance (5%), midterm (35%), final exam (60%)<br />In fact he almost didn't take attendance, and there are only 3 people attending the lecture on average. The way he took attendance is that he sometimes gave us some quiz questions and ask us to hand in the answer during the lecture.<br />Midterm covers PARTI and PARTII, all MC (around 40), held during lecture time.<br />Final covers all contents in the course, MC + several short questions + 1 long question (if I didn't remember wrong)<br />Me: midterm 28/32, final unknown, A in the end<br />There are only thirty something people in this course, so I did expect the A range to be small. Can't tell if the grading is good since I don't know others' situation. (and also my final)<br />A weird thing is that this course does not count towards elective. Make sure you know that before taking it.",
            "comment_workload": "The workload is ok as there are no assignments and only midterm and final. And you can just skip all the lectures because they are bad. But understanding the concepts and being able to use them to solve practical questions take time. The textbook makes much more sense than his teaching, so I spent quite some time reading the textbook. I also made mindmaps as some contents are quite confusing. Making summary and comparisons is helpful for distinguishing between similar statistical methods to be used under different circumstances. It would be better if you also do exercise questions in the textbook before the exam. (Although I didn't)",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "G1YnOEzgDcTWI69vB3Gr3PsnGr2XOa5R",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 498,
                    "name": "LIU, Kai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Polly0929",
            "date": "Jul 25, 2023",
            "title": "",
            "comment_content": "another said<br />same<br />my frd who major in maths think this course is super easy.",
            "comment_teaching": "poor<br />only 3-4 ppl attend the lesson as it is useless and 9 am lesson",
            "comment_grading": "good<br />I start learning the material 2 weeks before the exam and get B at the end",
            "comment_workload": "low<br />only need to do the questions in textbook, no need attend the lecture<br />I am wondering if there is only 1 attendance taking??? I am not sure coz I skip almost all the lecture. Prof sent us an email and told us he would take the attendance on that particular lesson.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YWtkZqojeqigsBNBiZpltr1qaPD4G2Hh",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 498,
                    "name": "LIU, Kai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "RIbtSU",
            "date": "Jun 12, 2023",
            "title": "Self-learning course, bad grading",
            "comment_content": "Variables and Distributions<br />Picturing Distributions with Graphs<br />Describing Distributions with Numbers<br />Exploring Data: Relationships<br />Scatterplots and Correlation<br />Regression<br />Two-Way Tables<br />From Exploration to Inference<br />Producing Data<br />Samples and Observational Studies<br />Designing Experiments<br />Probability and Sampling Distributions<br />Introducing Probability/General Rules of Probability<br />Discrete Probability Distributions<br />The Normal Distributions<br />Sampling Distributions<br />The Idea of Inference<br />Introduction to Inference/Inference in Practice<br />Inference about a Population Mean<br />Comparing Two Means<br />Statistical Inference<br />Inference about Variables<br />Inference about a Population Proportion/Comparing Two<br />Proportions<br />The Chi-Square Test for Goodness of Fit<br />Inference about Relationships<br />The Chi-Square Test for Two-Way Tables<br />Inference for Regression<br />One-Way Analysis of Variance (ANOVA)<br />Follow-up Tests/ Two-Way ANOVA<br />Nonparametric Tests",
            "comment_teaching": "LIU kai's English is fine. However, his voice is super plain and boring and he spoke pretty slowly. Given it was a 9 am class, I fell asleep most of the time. So I skipped almost all the lectures and just attended the lecture that had attendance. In terms of teaching, he sometimes seems forgot the content of the slides that he looked at the slide and stopped for 5 mins XD. As this course mainly focuses on applying statistics knowledge on research, he wouldn't cover any proofs of the equations. If you want to learn deeper of the proofs, you may consider to take MATH2411 instead of this course.",
            "comment_grading": "35% Midterm<br />60% Final<br />5% Attendance<br /><br />Midterm is much easier than final. It mainly focuses on concepts of those statistics theories. If you understand the concepts well, you should be fine. Make sure you understand the concepts thoroughly.<br /><br />Final is much more challenging. It focuses on both concepts and calculations. And the scope of the final is accumulated which means all the topics covered throughout the whole semester would be tested. <br />Again, make sure you understand all the theories well and practice more of the calculations. <br /><br />My Grade: A<br /><br />This semester has less than 30 students taking which is a small class size. I rank the 2nd overall. A bit sad of not getting A+ but nothing to say because the class size is smaller than previous years. The grading is properly stricter.",
            "comment_workload": "The workload is literally zero. Unlike previous years, this semester didn't have assignments. But you know, for maths related course, often you have to study yourselves on top of lectures. Youtube is your good friend. Many videos explained better than LIU Kai. Though no assignments at all, you really need to practice yourselves because the final exam covers a very wide range of topics. For the midterm, you can no need to practice and just make sure you understand the concepts. But for the final, practice is really required if you want to perform well.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MVNRpjsgnSREXzcpZ9Omp53IGfajwDfX",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 498,
                    "name": "LIU, Kai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ayir",
            "date": "Jan 20, 2021",
            "title": "zoom semester",
            "comment_content": "This course covers the basic statistical tests in the application of life science. It is not too difficult, but the tests can be a bit of a pain if the data sets are large. Be aware that you are not allowed a calculator that can run the tests already, you must use a simple one. Overall, the content is fine, it's what you would expect. It's just the execution that was so poor.",
            "comment_teaching": "To be honest, I don't know why I attended every single lecture. I never had the ability to pay attention, because everything was explained very confusingly and not clear at all. It was only when I started revising for my finals and using the textbook did it all start to come together. I know that the online semester was difficult for students and professors both, however, I find it really hard to believe that it was *that* hard to organize the course a bit better. Assignments were said to be every 2 weeks, but that only happened a handful of times. He would change whether the assignment counted toward your grades or not. It was never consistent, and a huge headache when you're trying to deal with other deadlines. <br /><br />After going through the textbook myself, the overall content isn't too difficult (as long as you don't need to understand the theory behind the tests). The tests are straightforward, and the book even gives a very clear diagram on when to use which test (i.e., multiple groups, comparing means etc). If you are mathematically inclined, you'd be better off just learning from the textbook and doing examples. Also, he was bad at replying to emails, and during finals, this is a HUGE pain. There are no TAs you can go to for help.<br /><br />He uploaded exercises to do very late into the semester, with only a few classes left. It is doable if you start early, but trying to do every question might be hard thanks to how little time you have left before the final. Try and get your hands on the textbook as early as you can, whether online or though the school.",
            "comment_grading": "I can't honestly say anything about the grading. This zoom semester, he decided to skip the midterm and made the final exam 85% of your grade. The breakdown was as follows: <br /><br />- 85% final exam<br />- 10% assignments <br />- 5% quizzes <br /><br />I don't know why, he never gave us our marks for assignments, and the assignments were strangely vague. He also released the letter grade for the exam, but never gave us the mark out of the total. Also, it says 5% for the quizzes, but we never had any quizzes. The grading is a mystery to me. I'm happy with my grade so I am not arguing about it, though. This course will be frustrating if you are a person that appreciates transparency in grading and wants feedback in order to do better.",
            "comment_workload": "Workload was inconsistent. We never got feedback. I don't have much else to add. <br /><br />Sometimes the assignment counted toward your grade, sometimes it didn't. The assignments were confusing in the sense they never tested anything that would show up on the final. I understand he wanted us to have a deeper appreciation for statistics, but with a course this badly organized, it's hard to do so.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mMYhdPJuePah4VcrqhZiKkglskj8TX1L",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 498,
                    "name": "LIU, Kai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "淺水健",
            "date": "Dec 11, 2020",
            "title": "",
            "comment_content": "It is deeper vision on a stats courses<br /><br />Variables and Distributions<br />Picturing Distributions with Graphs<br />Describing Distributions with Numbers<br />Exploring Data: Relationships<br />Scatterplots and Correlation<br />Regression<br />Two-Way Tables<br />From Exploration to Inference<br />Producing Data<br />Samples and Observational Studies<br />Designing Experiments<br />Probability and Sampling Distributions<br />Introducing Probability/General Rules of Probability<br />Discrete Probability Distributions<br />The Normal Distributions<br />Sampling Distributions<br />The Idea of Inference<br />Introduction to Inference/Inference in Practice<br />Inference about a Population Mean<br />Comparing Two Means<br />Statistical Inference<br />Inference about Variables<br />Inference about a Population Proportion/Comparing Two<br />Proportions<br />The Chi-Square Test for Goodness of Fit<br />Inference about Relationships<br />The Chi-Square Test for Two-Way Tables<br />Inference for Regression<br />One-Way Analysis of Variance (ANOVA)<br />Follow-up Tests/ Two-Way ANOVA<br />Nonparametric Tests",
            "comment_teaching": "professor have heart to teach the course, always overrun for a bit of time to answers students questions",
            "comment_grading": "no midterm and all mark count on final examination<br />the grade was not so good even if you have studied M1 (stats) in secondary.<br />Got C range at last",
            "comment_workload": "The whole course do not have many workload that you able to skip all class in whole semester if you can, but on the last half month of the course he give some exercise for us to do. Meanwhile there have lots of assignment from other courses have to finish so you are hard to finish exercise to test your understanding. And the powerpoint for each lecture is about 50-70 pages",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7Ko49NaZDPVxzLUT1BiflNzHN5IBcFIo",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 498,
                    "name": "LIU, Kai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "shhhh",
            "date": "Jul 29, 2020",
            "title": "hate maths course",
            "comment_content": "Actually not much about biology. Just the questions are&nbsp;&nbsp;related to biology but answering the question does not require any biology. ALL CALCULATION and some rules for every statistical tests.<br />Feel lucky studying this course online as only MC and NO long questions!!! (but still some questions required you to solve like the long questions, in order to get the answer)",
            "comment_teaching": "His teaching is so boring. <br />Speaks in a flat tone, with 0 intonation. Just read from the PowerPoint. <br />Feel sleepy easily, especially it was a 9am class...<br />Want to mention one thing that I was really upset with...<br />i asked him about the grading system in canvas and he replied, asking me to finish my work trying my best. Later on, i handed in my first assignment and he messaged me, saying that I should demonstrate I had tried my best, rather than an effortless answer. I was so upset as I already tried my best. But you know, some people are just bad at mathematics... Maybe he thought i was not polite enough in the previous message (ask him about the grading) as I added the word 'haha'",
            "comment_grading": "85% final exam<br />10% assignments<br />5% attendance<br /><br />I am bad at mathematics but still, I tried my best to finish the assignments, typing as many as I could think of.<br />I attended every class (9 am in the morning gosh).<br />I spent three days to practice the calculation intensively but I started my revision long time ago, like two weeks before the examination period with half of the chapter per day in average. (approximately)<br />My final grading is A- which is higher than I expected (since i got a C+ in MATH1012). I think the determining factor is my hard work after the lessons since I did not pay attention during the lessons... (can't focus at all!!! 9 am classes!!!!)",
            "comment_workload": "Average one assignment two week<br />Not very heavy, just several questions<br />But be reminded that he may not remind you a new assignment is uploaded. You may miss it.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2FhUlggqEPTA0FbrRcOaEm5G8JkImnef",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 498,
                    "name": "LIU, Kai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nobody the Man",
            "date": "Aug 22, 2017",
            "title": "",
            "comment_content": "Though the course name is biostatistics, I don't see any linkage between biology and statistics. In fact, the course is more like a statistics course than a biostatistics course. <br />Anyone without biology background but good in statistics (like t-test, correlation, chi-square) can easily understand the content of this course and do well in exams.",
            "comment_teaching": "Basically, teaching following what written in the PowerPoint.<br />English is ok but quite bored especially it is a 9am lesson<br /><br />He will answer question after every lesson and could see him quite passionate in that. So just feel free to ask him after the lesson or even during lessons.<br /><br />One point is that he pretty much like to release the lecture notes after the lessons. Once he just did not release notes after a whole week and he said he forgot it.",
            "comment_grading": "course attendance (5%),<br />assignments (5%) <br />midterm exam (40%)<br />final exam (50%)<br /><br />In both exams, formula sheet is given and formula not given are usually not related to exam question.<br />Final is a cumulative one.<br />Better be prepared how to use each statistics test and show clear calculation.<br /><br />Don't know how did he count the attendance as no PRS and other way could he do so<br />He didn't announce the marks of final exam and I have marks above mean of 1.5sd in midterm<br />My final grade is an A range anyway lol",
            "comment_workload": "Assignments are easy and only contributes 5% of the final grade<br />Only workload might be to memorize thing coz the final is a cumulative one",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QdIIfOsPqMwTliYeojYN6zeGfbzXI2WI",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 498,
                    "name": "LIU, Kai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Weewee",
            "date": "Jun 18, 2021",
            "title": "A Waste of Time",
            "comment_content": "Bar Charts, Pie Charts, and Histograms<br />Scatterplots and Correlation<br />Regression<br />Two-Way Tables<br />Sampling<br />Experimental Design<br />Basic Probability<br />Probability Distributions (Discrete, Normal, Binomial)<br />Sampling Distributions<br />Inference about Population Mean<br />Inference on two means<br />Inference on Population Proportion<br />Chi-Square test for Goodness of Fit<br />Chi-Square test for Two-Way Tables<br />Inference for Regression<br />One-Way Analysis of Variance (ANOVA)<br />Follow-up tests/Two-Way ANOVA<br />Nonparametric Tests<br /><br />There is a total of two review sessions, one after half of the topics are covered, and one after everything is covered.<br /><br />The content of this course is actually quite useful and could be much more interesting if a lecturer other than Liu Kai taught it.<br /><br />If you had studied statistics in secondary school (M1), then this course would be a breeze for you.",
            "comment_teaching": "Liu Kai is extremely boring and makes very unorganized lecture notes. He also never gives out grades for anything. This would greatly demotivate most people studying this course. He gives out a few questions from the textbook before the final for us to do, which takes absolutely no effort. He is just a lazy professor who doesn't give a bull's anus on how the students are doing.",
            "comment_grading": "2 Assignments: 5% each<br />Finals: 90%<br /><br />I have no idea what scores I got in the stuff I hand in. When preparing for the Final, I did a bunch of textbook problems.<br /><br />Grade: B",
            "comment_workload": "You would have no clue how to prepare for the final, so workload is technically 0.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cRjNlqc6adwvbLevsiXjdamTT8P8Nbdl",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 458,
                    "name": "LI, Po Lung",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mabel.Lam",
            "date": "Sep 07, 2018",
            "title": "good tutor",
            "comment_content": "fixed teaching material<br />the course is include 3 part:<br />vocabulary test, assignments and participation",
            "comment_teaching": "a lot of discussion<br />need to play game with classmate<br />He is sure to be a very good mentor. He quickly responded to emails and cared about the needs of students. I used to ask him questions about citations in class. He not only provided me with a reasonable answer, but also helped me find a lot of useful websites.",
            "comment_grading": "good grade, and the grading is loose<br />need to do assignments and speaking test<br />It really depends on how you learn outside the classroom.<br /><br />two speaking test:20%<br />two writing test: 40%<br />vocabulary: 20%<br />participation: 10%",
            "comment_workload": "light workload<br />some out side class HW, but it is light<br />The only amount of work is that you need to work hard on the required homework and vocabulary tests.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 15,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        }
    ],
    "composer": []
}