{
    "error": false,
    "course": {
        "id": 1797,
        "subject": "MARK",
        "code": "6900J",
        "name": "Marketing Strategies for Emerging Markets",
        "description": "This course will focus on the unique characteristics of emerging markets and relevant marketing strategies.  In the past, most companies focused on developed markets.  Emerging markets (EMs)-home to 86 percent of the world’s population-present rich opportunities today and for the future. These opportunities can be seen across all tiers of the market: ranging from low-cost products/services for the so-called bottom-of-the-pyramid consumers, goods for aspiring middle class consumers to luxury goods for the top-end consumers.  However, companies will not be able to meet the challenges and tap market opportunities in EMs through market strategies that worked very well in the developed world. The objectives of this course are threefold: 1) Provide students with an understanding of the unique market characteristics of EMs as well as the challenges 2) Discuss creative as well as profitable marketing strategies that could be implemented to tap into EM opportunities 3) Consider how companies with roots in EMs can successfully compete against more established multinationals both in their home market and in the global marketplace.  The course will be of particular value to students planning careers in multinational companies, NGOs, and consulting. It may also be valuable to students working for a start-up business. The format will be very interactive using a mix of short lectures, case studies and mini-cases.",
        "categories": [],
        "website": null,
        "credits": 2,
        "semesters": [
            1610
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 0,
        "rating_teaching": 0,
        "rating_grading": 0,
        "rating_workload": 0,
        "review_count": 0,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [],
    "composer": []
}