{
    "error": false,
    "course": {
        "id": 1569,
        "subject": "MARK",
        "code": "4290D",
        "name": "Customer Acquisition and Retention",
        "description": "Marketing is about customers. Products come and go, but if you have a customer, you have a business. So how do businesses attract customers? How do they keep them? How do they extract maximum value from the customer relationship? This course focuses on the new marketing tools and techniques—targeted marketing, databases, data mining and modeling, CRM, testing and measurement, and integrated marketing communications—that businesses use to attract the most productive new prospects, convert them to buyers, and gain their loyalty over the long term. This kind of marketing is targeted, measurable and ROI-driven. With these approaches, marketing can be fully accountable to shareholders and stakeholders. Strategies covered in this course include: data capture and data modeling, segmentation by customer value and behavior, buying process analysis, direct response communications, customer contact management, customer experience marketing, and marketing metrics and testing. This course introduces the business, decision-making, strategic, tactical and operational skills essential to managing the customer base as an asset.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            1810,
            1710,
            1610
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MARK\" data-code=\"2120\" href=\"/review/MARK2120\" target=\"_blank\">MARK 2120</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.67,
        "rating_teaching": 3.67,
        "rating_grading": 4.33,
        "rating_workload": 4.33,
        "review_count": 6,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 518,
                "name": "RAITT, Eugene Richard",
                "count": 4
            },
            {
                "id": 847,
                "name": "RAITT, Gene",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "7UrCqpgQlb7o5TxasnYTa1V7mB8KD7GQ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 847,
                    "name": "RAITT, Gene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Chloe Dai",
            "date": "Feb 14, 2019",
            "title": "Weird Exams but good Final Grade",
            "comment_content": "General digital marketing materials which mainly available&nbsp;&nbsp;online or common sense. Doesn't require any data (which Prof. Gene always says he hates math or numbers) or prior experience. <br /><br />There are extensive examples given in class which are coming from marketing agency's point of view.",
            "comment_teaching": "The professor talks very slowly and very helpful. However, he often contracdicts with his own logic and he has his very own standards for many things in digital marketing, since he has extensive experience in the field as an agency. <br />He is quite stubborn which often times he doesn't agree with the academic view on marketing. It sometimes annoyed me but some students found it funny.",
            "comment_grading": "Absolute grading, so it's easy to calculate your grade by yourself. Professor will announce the grading range in the very beginning of the semester. <br />Attendance of the course is not mandatory, but Prof.Gene will remember those who participate or sit in the front, and this might affect your final grade as well.<br />My first quiz was 1SD below mean, 2nd Quiz &lt;1 SD, 3rd Quiz ~1SD above mean. I got A- in the end.",
            "comment_workload": "Very minimal and easy. <br />Only 3 quizes which you are given 24hrs to finish online (you can do it anywhere, and you are allowed to send him email for quesitons.) You might think you can finish it quickly, but actually since there're many short questions/ essay questions, plus that prof's grading is rather subjective, you can take up to 1 whole day before relaxingly turning in.<br /><br />Considering there's no extra workload, the exam is still endurable.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8zGSut0miRZVhhWYYNJFcA0mjDYL780L",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 518,
                    "name": "RAITT, Eugene Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "EACN",
            "date": "Jan 06, 2019",
            "title": "Good course should not be missed",
            "comment_content": "The course is actually about digital and direct marketing. <br /><br />There are some required readings (e.g. 'Medium is the Message'). Read it, they are VERY useful when answering the questions in the quizzes.",
            "comment_teaching": "The professor is very fun and down-to-earth. He has a very moderate speed of speaking so that we can easily jot notes and follow what he was saying. As he is a very experienced businessman, all the theories mentioned in class will be followed by many examples which makes us easier to really absorb those terms and theories.",
            "comment_grading": "Absolute grading.<br /><br />3 quizzes in total (30% each) (With MC, T/F, Essay Questions - pick 3 out of 5)<br />Participation (8%)<br />Research Credit (2%)<br /><br />The participation mark is actually very easy to gain. Basically I did nothing in class, I did not raise or answer any questions and I got 8/8. (The professor, in fact, did not ask so many questions in class, even if he did raise a question, he will actually answer it by himself)<br /><br />Professor Gene is very generous in marks. The mean of the quizzes are very high (~85). <br /><br />Really depends on how you show your understanding of the things he taught in classes via the quizzes, filling more examples outside class in the essay part, should be easy to get good grade",
            "comment_workload": "3 24-hrs take-home quizzes in between the semester. <br />The workload is heavier than I expect (but still light compared to other marketing course which requires project). You are given 24 hours to finish the quiz, at first I thought it might only spend me a few hours to do so, however, turn out I nearly spent all day long to finish the quiz.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nM5ym46GH9PhkwXE7teaau2DhDPqNm2V",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 518,
                    "name": "RAITT, Eugene Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "avv",
            "date": "Dec 22, 2018",
            "title": "Pretty Good course",
            "comment_content": "The course name is a bit misleading. The main focus of this course is digital and direct marketing.<br /><br />It gives a good high level picture of digital and direct marketing as it is a sought after career field for Marketing graduates. <br /><br />The slides are not very detailed so you will need to take some notes down in class.<br /><br />He also recommends some books related to the subject like 'Medium is the Massage' and it is recommended that you go through these books before the day of the exam so that you can attempt the question related to these books. In fact, he asks a lot about the 'Medium is the Massage' in particular and few other books and it is easy to score on these questions from my experience.",
            "comment_teaching": "Eugene is a good instructor and personally found it easy to listen to him as he has a good American accent. He has more real world experience and his examples are quite illustrative to understand the content better.He is quite approachable one-to-one and it is good to ask relevant questions so that he remembers you. He is a pretty humorous and sarcastic guy and&nbsp;&nbsp;always make self deprecating jokes lol.",
            "comment_grading": "Grading:<br /><br />30% each x 3 Tests = 90 %<br />2 % research credit<br />8 % participation. <br /><br />The tests are more like assignment so you don't need to study a lot beforehand, rather understand the content and pick out the content suitably to write answers. <br /><br /><br />The format of his test is: T/F, MCQs, one problem solving question and essay questions. <br /><br />Grading is quite unpredictable as there were no guidelines mentioned on what answers he expects and literally you can get full score by writing just a few sentences or multiple paragraphs- all depending on what he is 'looking' for and not whether the answer is good enough. The T/F and MCQs can be a bit tricky at times as he uses some strange/funny phrases in his questions and you may need to read and re-read to select the correct answer. <br /><br />For participation, it is good to ask questions periodically so that he remembers your face. In my class, people barely ever participates apart from the usual 5-6 people and yet the participation mean was around 7.9/8 which I thought was a bit strange,",
            "comment_workload": "Workload is light. This course is great if you want a break from the usual group project hassles in marketing courses as it just consists of 3 tests done individually. <br /><br />The tests themselves would be a bit time consuming as you would need to think through the questions and write suitable answers- the prof has high standards and just writing any BS will not cut it for sure. And especially since the test may fall on a weekday, it may take up the majority of the day.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XUv3ZbvEQ6roYErFBmZkbBc5nfg7TYQW",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 518,
                    "name": "RAITT, Eugene Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sheryl",
            "date": "Dec 22, 2017",
            "title": "The most small workload of Marketing Course",
            "comment_content": "Although the course name is Customer Acquisition and Retention, it is not related to CRM, it is more about Digital Direct Marketing.<br /><br />Content:<br />1. What is Digital and Direct Marketing (BTL &amp; ATL &amp; CTL)<br />2. Media, Offer, Creative<br />3.Database Marketing<br />4.Viral Marketing<br />5.Creative development<br />6.Test Market<br />7. Market research method<br />8. Big Data in Marketing<br /> and 2 Guest Lectures<br /><br />Marketing Department actually offer this course classified with ABCDE, but according to Prof, the content is actually the same.<br />And If you expect to talk about CRM/SEO/SEM, there are not much content covering about them.",
            "comment_teaching": "Unlike Prof who ususally engaged in academic background, Mr. Raitt had a very comprehensive background in Marketing before he taught in UST, so he offered many real-life experience and actual implementation of marketing strategies, which I found them useful. Marketing in not simply about theory, it's about understanding the customers and the environment. Prof. let me understand what the difference between theories and real-life with an 'Insider' perspective.",
            "comment_grading": "30% for each quiz ( A total of 3 quizs in a semester, open-book, have 24 hours to complete)<br />2% Research credits<br />8% Participation (It might be better if you sit near him and bring a name card to class so he remember you and have a higher score) <br /><br />Prof stressed that he did not have a curve, so this course is absolute grading. I got an overall of 84% and I got a B+ in the end.<br />He marked the tests quite loosely(?), although you might lose marks on some session, the mean is quite high (About 85-88 for each test)",
            "comment_workload": "Although it is a 4 credit course, it does not have any project, even for tests, it is open-book and allow you have 24 hours to complete. The workload is very small compare to other marketing course which have projects, reports and presentation.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "M0QwObGh5XUSBotqWFsmxenc06xVOr6q",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "C666",
            "date": "Jan 23, 2017",
            "title": "Good course, can learning something new and useful",
            "comment_content": "No book, only lecture notes. Some basic things are taught, easy to handle and can learn something new at the same time.",
            "comment_teaching": "Professor name: Ruth Stevens. On average I quite like the way she teaches, sometimes a bit boring tho. The course includes a lot of guest lectures which are very useful and insightful!!! Must attend. Can learn a lot real case of applying digital marketing successfully in big companies, e.g. pizzahut, mannings, banking, etc.",
            "comment_grading": "Relatively good grade course, I got all full mark for all the assignments and project and score A (maybe I lose some parti marks, but even my friend talks a lot in the lesson still got A). My group are all year 4 mark students.",
            "comment_workload": "No exam is the greatest benefit, don't have to recite anything in lesson, feel very relaxing! Only assignments, reading case and projects.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SNuareiyhW8e3p1kYczojSzjHcqAfqG7",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 518,
                    "name": "RAITT, Eugene Richard",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "wmng11",
            "date": "Jan 23, 2018",
            "title": "",
            "comment_content": "This course is totally not related to customer acquisition and retention but direct and digital marketing.",
            "comment_teaching": "He only use 1 powerpoint to cover the whole semester.",
            "comment_grading": "Bad grading.... the quiz is too hard and not enough time to work on. He also release the grading very slow. My friend did poor in the quizzes as well as it is not related to the course material that much. <br />30% for each quiz <br />2% Research credits<br />8% Participation",
            "comment_workload": "There is no final exam but quiz every months, a total of 3 quiz. <br />The quiz contains MC, T/F, Short answer questions and essay. The questions are so difficult and not included in teaching or syllabus which makes it very difficult to work on.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}