{
    "error": false,
    "course": {
        "id": 3007,
        "subject": "MARK",
        "code": "4290G",
        "name": "Leveraging Media for Customer Acquisition and Retention",
        "description": "This course offers an in-depth examination of all media and its importance in the marketing equation across history. There is a heavy emphasis on digital media analysis, with a focus on how media drives behavior change, particularly consumer behavior. Media is dissected and examined within the direct marketing equation, and within the greater general marketing sphere. The objective of this course is to provide the student with a deep and thorough understanding of the most powerful variable available to marketers, whether practicing traditional marketing, digital/direct marketing, or general advertising. The course includes selected readings, online blog reading assignments, case studies, videos, and may include one or more guest lecturers. The instructor is a recognized industry expert and a leading proponent of media studies.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            1910
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MARK\" data-code=\"2120\" href=\"/review/MARK2120\" target=\"_blank\">MARK 2120</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 4,
        "rating_workload": 5,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 847,
                "name": "RAITT, Gene",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "UnF0cSzLWT7Xva8wjLAviUZ9gw3bLQlI",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 847,
                    "name": "RAITT, Gene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "christygg",
            "date": "Jan 22, 2020",
            "title": "super easy content and nice prof",
            "comment_content": "- It is an elective MARK course<br /><br />-will understand of the power generated by media alone to change behaviour, particularly as it relates to customer acquisition &amp; retention.<br /><br />- also, give practical examples of how the basic principles are used in media planning and deployment. The clear differences between media used in General Advertising and Digital &amp; Direct Marketing in customer acquisition and retention will be explained in detail.<br /><br />---&gt; super super super easy content, you could skip class coz there are videos",
            "comment_teaching": "Gene is a nice and funny prof from USA. Has his own business, you could find him on Linkedln <br /><br />- RMB to bring name card so he will rmb your name (you can get full parti if you sit in the front row and always response him)",
            "comment_grading": "- 1st midterm, i don't have time to do, so i write not much and score below mean (&lt; 1 sd) <br /><br />- 2nd midterm, i put afford to write more than last time and score the mean<br /><br />-group report, just score the mean<br /><br />--&gt; the mean score is actually high (mean ~=80-86 out of 100), so try to write more to impress prof<br /><br />-2 credit for marketing research (rmb to sign up)<br /><br />-parti score the mean (most students are the mean) <br /><br />-no attendance <br /><br />==&gt; turn out B, i think is okay coz most of the task i just score the mean, but super regret not writing more for the midterm to gain more marks",
            "comment_workload": "i think is light! but rmb to put afford to do (google more reference and support in your writing lol)<br /><br />Individual:<br />-2 24-hour take-home midterm (have 10 T/F+MCQ and 1 short, 2 long essays) <br /><br />Group: (no presentation!)<br />-1 group report (discuss any media your grp select)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}