{
    "error": false,
    "course": {
        "id": 3543,
        "subject": "MARK",
        "code": "4290I",
        "name": "Marketing Analytics",
        "description": "This course develops the foundation and integrated framework for understanding marketing analytics. It introduces major applications of data analytics in marketing, including customer analytics, product analytics, pricing analytics, and advertising analytics.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2110
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MARK\" data-code=\"2120\" href=\"/review/MARK2120\" target=\"_blank\">MARK 2120</a> AND <a class=\"course-link\" data-subject=\"MARK\" data-code=\"3220\" href=\"/review/MARK3220\" target=\"_blank\">MARK 3220</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.25,
        "rating_teaching": 4.5,
        "rating_grading": 4.25,
        "rating_workload": 4.5,
        "review_count": 4,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 773,
                "name": "LIN, Song",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "pcJndYkqHp7JOGtTr0A0O30qMFzQyMCU",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 773,
                    "name": "LIN, Song",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Danny SU",
            "date": "Feb 09, 2023",
            "title": "",
            "comment_content": "Typical high level marketing course, including theories and simple algorithms. Models are easy to understand, concepts are not tricky as well.",
            "comment_teaching": "Prof. Song is one of my favorite instructors, the materials are well organised and he always leaves some time for us to understand his slides.",
            "comment_grading": "A+. Anyone with a basic quantitative foundation could get at least A if paying attention. Not gonna lie. Group study may be efficient, at least people I know from this course are all above A-.",
            "comment_workload": "Almost no homework compared with other major courses. All assignments are short, won't take you more than half an hour.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "v53NP1DHYcso6iskVljGYCNBMEwbjCCz",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 773,
                    "name": "LIN, Song",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chaha",
            "date": "Jan 05, 2022",
            "title": "",
            "comment_content": "Marketing Management<br />Data Analytics <br />Customer Analytics<br />Product Analytics<br />Pricing Analytics<br />Advertising Analytics <br /><br />Content might be a bit challenging as there will be many models and formulas, but you don't have to deduce the formulas with calculus nor do complicated calculations for quizzes, understanding the logic is the key. Professor actually discuss the concepts pretty clear in class and he is very approachable, so just ask him until you understand.",
            "comment_teaching": "Professor Lin is like one of the best professors I've met so far in HKUST, he make things clear and the class atmosphere is nice too. He is willing to answer questions after lecture or through email, so just ask him if you have any confusion about the content or assignments, he explains them really well. Sometimes it could get boring when he is doing mathematical calculations but it's tolerable (I've had worst) and you don't really need to know how to do those derivatives and calculus, just understand the formulas in slides will do, he just want to explain how the formula comes from.",
            "comment_grading": "2 Quizzes (50)<br />4 Assignments (40)<br />Class Participation (8)<br />Research Credit (2)<br /><br />People usually get full marks for assignments as professor gives useful hints as long as you ask him about the assignments, and it's pretty straightforward, input formulas (included in lecture slides) and numbers in excel. Quizzes consist of 20 MC and 5 points each with 1 hour to complete, time is pretty adequate. However, mean is always high for marketing courses, so is this course :( Be sure to double check and think carefully then you should be good. <br /><br />I am poor at maths but still achieved an A+ for this course, I always email Professor and ask him questions and paid attention in class/watching lecture. I don't think maths/calculation is the main dish for this course so don't worry if you're weak in this area :)",
            "comment_workload": "Workload is very nice compared to most marketing course I've had. There is no project, presentations, reports or essays.<br /><br />4 Assignments <br />- Average 1 week time to complete the assignments, just fill in formulas and numbers in excel, be careful for careless mistakes. 2 of them are pretty easy (~30 mins) while the other 2 are more complicated (1-2 hours).<br /><br />2 Quizzes (Non-cumulative)<br />- 1 in mid-term period and 1 in final period <br /><br />Class Participation<br />- Professor ask a lot of questions in class, esp during the beginning he would normally recall what is taught last lecture, just look at your notes then you can answer his questions easily. I didn't answer a lot of questions but I try to at least speak once in lecture, sometimes just &quot;yes&quot; or &quot;no&quot;.<br /><br />That's all :)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4JDf62qTNtvdIm4qx0a1vP07dszcWJOf",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 773,
                    "name": "LIN, Song",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "得E門生",
            "date": "Jan 04, 2022",
            "title": "",
            "comment_content": "The content is somehow difficult but you manage to understand it as long as you pay some effort.",
            "comment_teaching": "Professor LIN is just PERFECT! He is humorous and the atmosphere in his class is so relaxing. The logic is clear and he explains every question patiently. No attendance and no group project.",
            "comment_grading": "Good grading.",
            "comment_workload": "Moderate workload. You don't need to spend too much time other than attending classes. Only 4 assignments. Easy ones take 30 mins and difficult ones take several hours. Usually, you have one week to finish the assignments.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3yhOsE38lctEQIk7iCBbW1xeh7OIvA5D",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Manisha",
            "date": "Oct 25, 2021",
            "title": "Marketing Analytics",
            "comment_content": "Content is quite difficult, involves a lot of statistical thinking. One of the harder marketing electives.<br /><br />Before midterm<br />- Marketing Management I<br />- Marketing Management II<br />- Dat Analytics I<br />- Data Analytics II<br /><br />After Midterm:<br />- Customer Analytics I<br />- Customer Analytics II<br />- Customer Analytics III<br />- Advertising Analytics <br />- Retail Analytics I<br />- Retail Analytics II<br /><br />-",
            "comment_teaching": "Professor Song's teaching is quite good however lecture material and what comes out in the midterm is quite different. Midterm questions are very tricky.",
            "comment_grading": "2 Quizzes 50%<br />4 Assignments 40%<br />Participation 8%<br />Experiments 2%",
            "comment_workload": "Workload is average. Need to study very hard for the 2 quizzes as it is very challenging and mean can be quite high.<br /><br />One good aspect is there is no good project.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}