{
    "error": false,
    "course": {
        "id": 925,
        "subject": "MATH",
        "code": "4512",
        "name": "Fundamentals of Mathematical Finance",
        "description": "Duration and horizon rate of return, bond portfolio management and immunization; mean-variance formulation of portfolio choices of risky assets; Two-fund theorem and One-fund theorem; asset pricing under the capital asset pricing models and factor models; investment performance analysis; utility optimization in investment decisions; stochastic dominance.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2030,
            1930,
            1830,
            1730,
            1630,
            1530,
            1430
        ],
        "prerequisites": "(<a class=\"course-link\" data-subject=\"MATH\" data-code=\"2011\" href=\"/review/MATH2011\" target=\"_blank\">MATH 2011</a> / <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2023\" href=\"/review/MATH2023\" target=\"_blank\">MATH 2023</a>) AND (<a class=\"course-link\" data-subject=\"MATH\" data-code=\"2111\" href=\"/review/MATH2111\" target=\"_blank\">MATH 2111</a> / <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2121\" href=\"/review/MATH2121\" target=\"_blank\">MATH 2121</a> / <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2131\" href=\"/review/MATH2131\" target=\"_blank\">MATH 2131</a> / <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2350\" href=\"/review/MATH2350\" target=\"_blank\">MATH 2350</a>) AND (<a class=\"course-link\" data-subject=\"IEDA\" data-code=\"2540\" href=\"/review/IEDA2540\" target=\"_blank\">IEDA 2540</a> / <a class=\"course-link\" data-subject=\"ISOM\" data-code=\"2500\" href=\"/review/ISOM2500\" target=\"_blank\">ISOM 2500</a> / <a class=\"course-link\" data-subject=\"LIFS\" data-code=\"3150\" href=\"/review/LIFS3150\" target=\"_blank\">LIFS 3150</a> / <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2411\" href=\"/review/MATH2411\" target=\"_blank\">MATH 2411</a>) AND (<a class=\"course-link\" data-subject=\"MATH\" data-code=\"2511\" href=\"/review/MATH2511\" target=\"_blank\">MATH 2511</a> / <a class=\"course-link\" data-subject=\"FINA\" data-code=\"2203\" href=\"/review/FINA2203\" target=\"_blank\">FINA 2203</a> / <a class=\"course-link\" data-subject=\"FINA\" data-code=\"2303\" href=\"/review/FINA2303\" target=\"_blank\">FINA 2303</a>)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.71,
        "rating_teaching": 4.57,
        "rating_grading": 4.71,
        "rating_workload": 4.14,
        "review_count": 7,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 912,
                "name": "LEUNG, Chi Man",
                "count": 6
            },
            {
                "id": 559,
                "name": "KWOK, Yue Kuen",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "bMKXs2DchdSuHVeMSktBWMmU3EtvTWVL",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 912,
                    "name": "LEUNG, Chi Man",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Moving",
            "date": "May 30, 2018",
            "title": "perfect MATH depth elective for grade-chasers",
            "comment_content": "Prerequisites:<br />a. Multivariable Calculus <br />(MATH2010 / MATH2011 / MATH2021 / MATH2023)<br />b. Linear Algebra <br />(MATH2111 / MATH2121 / MATH2131 / MATH2350)<br />c. Basic knowledge in probability and statistics <br />(IELM2510 / ISOM2500 / LIFS3150 / MATH2411)<br />d. Basic knowledge in finance <br />(FINA2203 / FINA 2303)<br /><br />Chapters:<br />1. Bond Immunization <br />(呢part正正係MATH2511最尾嗰part 學present value, duration, convexity 仲有除左bond immunization以外嘅3種immunization methods)<br />2. Mean-Variance Portfolio Theory <br />(要清楚expected return, variance, covariance概念 跟住用Lagrangian Method做portfolio optimization 同埋用inverse matrix + matrix operation搵minimum variance portfolio &amp; market portfolio 同diversification相關)<br />3. Capital Asset Pricing Model and Factor Models<br />(比較接近Chapter 2 用返學過嘅野derive CML &amp; CAPM model &amp; SML 研究risk同return嘅關係)<br />4. Utility Optimization in Investment Decisions<br />(有讀過ECON3113嘅MAEC &amp; ECOF學生應該好易上手 根據唔同人嘅risk preference而提供一個investment plan 再研究risk averter &amp; risk lover嘅behavior有咩唔同)",
            "comment_teaching": "今年轉左做LCM教 之前一直都係Prof. Kwok 係咪好事就見仁見智 (不過我係因為咁先讀)<br />LCM教書真係好有心 上堂會派lecture notes 有齊好多例子 又會upload problem sets比同學做 花啲時間做晒對exam results真係有幫助 落堂有咩唔明都可以問佢 又或者搵佢吹下水<br />LCM教到risk tolerance model嗰陣 因為lecture notes正係寫到risky assets 所以叫我地試下自己include risk-free assets 點知final就有1題問呢個proof 送分比有上堂嘅學生 haha 大家盡量上佢嘅堂啦 又唔悶又有意外收穫",
            "comment_grading": "3 Assignments (10%)<br />Midterm Exam (25%)<br />Final Exam (65%)<br /><br />上佢第1堂已經有講 因為佢1x年前係UST讀MATH2411嗰陣拎左唔錯嘅分數 但結果relative grading令到佢... 所以佢教嘅course都轉晒用absolute grading scheme 當考完midterm見個mean唔係咁高 佢又降低左每個grade嘅門檻 最終似乎係:<br />&lt; 40%: good luck (D / F)<br />&gt;= 40%: C- or above<br />&gt;= 57%: B- or above<br />&gt;= 80%: A- or above<br />所以自己考得好就會有回報 加上佢assignment每次題目分數加埋都多過100% 所以只要唔好錯太多都穩拎晒assignment分 我個人就覺得係好grade course",
            "comment_workload": "ok la 成個sem得3份assignments 每份有4 - 5題 夾埋120 - 125 marks 佢目的係希望大家盡量拎到滿分 (100 marks)<br />我冇上過tutorial 因為時間唔啱 考完midterm睇返啲tutorial notes好似同佢考啲題型唔同",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 14,
            "vote_count": 19,
            "voted": false,
            "is_upvote": false,
            "comment_count": 3,
            "attachments": []
        },
        {
            "hash": "3ZrSqItVZZQAp6YRfF90BAbcDZILIh9H",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 912,
                    "name": "LEUNG, Chi Man",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "USTAsiaNo1",
            "date": "Aug 16, 2020",
            "title": "as the name suggest, just fundamentals",
            "comment_content": "// Please just read others to get the detailed content list<br /><br />// Comment on contents<br />it covers basically bonds (25% time) + CAPM model (50% time) + Risk preference and its application in insurance (25% time)<br /><br />If you are looking for content in CAPM, this course might be useful, but that is. Nothing more to offer. I personally expect more, still, great as a fundamental<br /><br />** (update at 20 Apr 2021, added some comment after taking more course after 4512)<br />The bond and utility section is too shallow which cannot provide much insight, you can consider others course like fixed income (e.g. FINA 4303, which is mathematically easier but covers more content) and some advanced microeconomic course (ECON 3113, ECON 3133, ECON 4999t( a more specific course comparing to those 2 3xxx course), all 3 course is as mathematically demanding as MATH 4512 if not more, they are all super conceptual ) if you REALLY interested in such topic. Still, you can definitely take this course as an introduction <br />**<br /><br />// Additional comment to Finance students or anyone will take FINA 3103<br />This course is simply a detailed version of FINA 3103, I strongly recommend you take these 2 courses together, then you can simply master your finance course lol, the finance course is like BB level compared to this.<br /><br />// More additional comment to ECOF/MAEC student in particular<br />If you are a ECOF student, It is happy to see you fulfilled the maths requirements which a general ecof student will never accomplish. Back to the topic, I would like to recommend you guys taking this with or after ECON 3113, you will learn risk preference is a much deeper scope in econ course and then you will automatically master the risk part of this course =)",
            "comment_teaching": "// Teaching<br />Many say it is excellent, I would say it is fine, nothing special<br />Many say he is nice, I actually think he is more a serious guy<br />I think his explanation is clear, basically, he proved everything he said<br />But, since it is a financial maths course, when sometimes he need to refer to some economic or finance idea, like EMH (efficient market hypothesis), Arbitrage opportunity), his explanation might not be sufficient (from my maths-only background friend)<br /><br />// Materials<br />Excellent, his note is great, I still kept it<br />Coloured, detailed, he will even print it out and distribute on class",
            "comment_grading": "// Overview<br />Good, it seems LCM is famous for giving good grade, I think it is a fairly valid statement.<br /><br />BUT, be reminded, the reason why it is &quot;good grade&quot; is because it is in absolute grading scheme AND, in the meanwhile, he is pretty nice in giving assignment score and bonus score. You still need to work hard to be able to take advantage of these.<br /><br />// Detail<br />1. The abs grading scheme seems to be changed every year<br />- &gt;= 40% =&gt; C range for sure<br />- &gt;= 58% =&gt; B range for sure<br />- &gt;= 78% =&gt; A range for sure<br /><br />The final cut-off will be decided later, maybe, if everyone performs poorly, 30% is enough to get C range, still, 40% to get C range, 58% to get B range, ... is guaranteed<br /><br />2. Homework grade<br />The homework has a total score &gt; 100, if you get 100 or above, will be counted as 100. <br />That's why I say he gives homework score easily<br /><br />What makes the grading more good is the extra score you gained will be used as bonus score!<br />e.g. if you get 110/100<br />=&gt; 1. your assignment has a full score, 100/100<br />=&gt; 2. the rest 10 will be reserved for counting bonus<br /><br />3. Bonus<br />How will those reserved scores be transferred into bonus score is ambiguous at first, which will be decided after everything is done, as the cut-off<br /><br />e.g. maybe it is 10 reserved score to 1% bonus in calculating grade, depends on the performance at that semester <br /><br />// Conclusion<br />You can see that there's quite a lot of additional area to gain score, which makes it sounds like a good grade course. <br /><br />Yet, the exam is indeed hard, with all the bonus, it might possibly secure you a b-/b grade, but it will be much harder if you aim even higher since, fundamentally, the exam is just hard",
            "comment_workload": "// Overview<br />As a 4000 level maths course, it might possibly be the easiest one<br /><br />// Exam<br />Difficulty : Fair<br />Time limit : super tight!!!<br /><br /><br />// Assignment<br />Some questions are here as a gift<br />It is not hard to get like 90-100 score, but to gain more than 100 to get the bonus score might be challenging<br /><br />// Course contents itself<br />Not hard, I personally find it quite easy (As a student from economics, finance, and maths background).<br /><br />For the average student, if you only have maths skill but no finance background, or have a finance background with no much maths skill, the workload may be fair to heavy",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "I96Pe1NvA3jR1RYvPX567yIl0U9JKPs1",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 912,
                    "name": "LEUNG, Chi Man",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "calcguy",
            "date": "May 18, 2019",
            "title": "Introduction to Financial Economics",
            "comment_content": "Chapter 1: Bond Immunization<br />- A quick review on bond pricing (using yield rate and term structure of interest rate)<br />- Duration and Convexity<br />- Bond investment analysis: Bond immunization and Contingent immunization<br />- Application of bond immunization in asset-liability management.<br /><br />Chapter 2: Mean-Variance Portfolio Theory<br />- Mean and variance of portfolio return<br />- Markowitz’s mean-variance formulation<br />- Two-fund theorem and one-fund theorem<br />- **Risk-tolerance model<br />- **Some extensions of Markowitz’s formulation.<br /><br />Chapter 3: Capital Asset Pricing Model and Performance Analysis<br />- Capital asset pricing model (CAPM) and beta values<br />- Interpretations and uses of CAPM<br />- Investment performance analysis<br /><br />Chapter 4: Utility Optimization in Investment Decisions<br />- Axiomatic approach to the construction of utility function<br />- Maximum expected utility criterion<br />- Stochastic dominance<br /><br />Note 1 (**): Chapter 2 only discussed up to one-fund theorem.<br />Note 2: Midterm coverage is Chapter 1 and 2 (up to Two-fund theorem).<br />Note 3: This course will be useful for you who are planning to take SOA Exam FM (for chapter 1) and SOA Exam IFM (for chapters 2 and 3). Certainly, this course is necessary but not sufficient to get you prepared in taking those exams (you also need MATH2511 for Exam FM and MATH4514 for Exam IFM, both regularly taught by LCM as well).",
            "comment_teaching": "I personally love his way of teaching. He explains things in the lecture notes as if he is telling a story to you, so that you can easily understand what he is trying to explain. In that sense, if you really want your workload to be as minimal as possible, you should attend all his lectures and pay 100% attention to the lecture. Every single detail matters.<br /><br />For the midterm and final exams, pay attention to this keyword : &quot;If I ask you this type of question in the midterm (final if midterm has passed), can you do it?&quot; or &quot;This (proof) is one possible question in the final.&quot; (That's why, attend lectures will be a plus to you.)",
            "comment_grading": "The grading adopted by LCM is &quot;absolute grading&quot; by his convention, which is as follows:<br />- 40% or above =&gt; C- or above (for sure)<br />- 58% or above =&gt; B- or above (for sure)<br />- 78% or above =&gt; A- or above (for sure)<br /><br />Note that there are some bonus marks available in each assignment. Usage of bonus marks:<br />- Bonus marks will first be topped up towards your assignment (in case the required part is not 100)<br />- For each 8 bonus marks, it will be converted into 1 midterm mark (used round-up system, meaning if you have 153 bonus marks, then your midterm mark will be increased by 20 marks).<br />- In case your midterm mark is already 100 (which seems rather &quot;rare&quot;), then for each 15 bonus marks, it will be converted into 1 final mark.<br /><br />Some statistics (only mean is provided):<br />[FORMAT: Required (+ Bonus / Total bonus)]<br />- Assignment 1 : 95.82 (+ 20.64 / 50) -&gt; 5% of total<br />- Assignment 2 : 95.94 (+ 35.76 / 80) -&gt; 5% of total<br />- Assignment 3 : 92.03 (+ 45.94 / 90) -&gt; 5% of total<br />- Midterm : 46.85 -&gt; 25% of total<br />- Final : 50.71 -&gt; 60% of total<br /><br />You can imagine, based on the grading scheme, given the means above, majority may get B-. So I personally do not think it is a good grade course.",
            "comment_workload": "There are 3 assignments throughout the term. For each assignment, there are (4) required problems and (2 ~ 3) bonus problems. The required problems are relatively straight-forward; just mimic the steps provided in the lecture note examples. For bonus problems, however, those are completely new ones (in which you really need to understand the whole explanation to every single topics). Thus, normally, it should take about 2 hours per problem to be solved.<br /><br />Also, for midterm exam and final exam, you also need to do the (optional) problem sets and recite the examples in the lecture notes, since some of them will appear in the exam (where time is extremely tight due to high number of problems). Thus, if you really want to get A range, the workload is definitely not light.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "O6xndaMXKo09ImkFLht2c8kDHdHIKVUr",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 912,
                    "name": "LEUNG, Chi Man",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "『　　　』",
            "date": "Jun 15, 2020",
            "title": "Nice professor and rewarding course.",
            "comment_content": "Chapter 1: Bond Immunization<br />Main focus: Bond immunization and Asset-Liability management.<br /><br />Chapter 2: Mean-Variance Portfolio Theory<br />Main focus: Markowitz’s mean-variance portfolio, Two-fund theorem and One-fund theorem<br /><br />Chapter 3: Capital Asset Pricing Model and Performance Analysis<br />Main focus: CML, Capital asset pricing model, SML, Sharpe ratio, Jensen alpha, Treynor ratio<br /><br />Chapter 4: Utility Optimization in Investment Decisions<br />Main focus: 5 axioms for choosing investment plan using utility function, Maximum expected utility criterion<br /><br />Risk Tolerance Model in Chapter 2 and half of Chapter 4 are not covered in this semester because of lack of time.<br /><br />For me, Chapter 4 is the most difficult part of the course, others are just a mathematical version of some basic finance models.<br /><br />Main techniques used in the course include Lagrange method from MATH 2023 and RREF and matrix computation from MATH 2121, if you can handle these techniques, you should handle the first 3 chapters easily.<br /><br />If you have taken FINA 3103 and ECON 3113, you should have already learnt most of the concepts taught in this course, but you can gain a much better understanding with the help of the mathematics behind the theories.<br /><br />For SF students, you may take this course in year 2 spring if you have taken FINA 2203 in fall and plan to declare Minor in Actuarial Mathematics, this course should be comparatively easier than 4427-4428, and other 45XX courses",
            "comment_teaching": "Teaching is clear, notes are concise and he is a really nice guy.<br /><br />At the first few lectures, I thought his talking pace is quite fast, but it's OK when I'm used to his pace.<br /><br />Although you may learn the materials using his notes without attending lectures as the materials of the course is not that difficult, I strongly suggest you attend every lecture, his way of teaching really helps you to understand the materials much easier.<br /><br />Feel free to ask him any questions after lectures, he is willing to answer your questions patiently. I always stay behind after lectures for more than half hour lol.",
            "comment_grading": "Assignments 20%<br />Midterm 20%<br />Final 60%<br /><br />Mean:<br />Assignment 1: 131.1/170 (100 required)<br />Assignment 2: 142.9/200 (100 required)<br />Assignment 3: 138.7/175 (100 required)<br />Bonus Assignment: 53.8/80<br />Midterm: 51.7/100<br />Final Paper1: 29/50<br />Final Paper2: 19.7/50<br /><br />Cutoff according to the information given in the last lecture (but not finalized):<br /><br />A+: 93%<br />A: 89%<br />A-: 83%<br />B+: 76%<br />B: 69%<br />B-: 62%<br /><br />If you get 40% overall and 20 marks above in final, you can pass the course. (getting C- or above)<br /><br />for bonus scores obtain in bonus questions of assignments, it is first used to top up your assignment scores, if you get full marks in the assignments, 10 bonus marks = 1 Midterm mark, then 24 bonus marks = 1 Final mark. The bonus marks conversion is based on the round-up basis.<br /><br />The midterm covers Chapter 1 and Chapter 2 before Two-fund theorem.<br /> <br />The Final covers all materials in the course. (Paper 1 covers Chapter 1-3 and Paper 2 covers Chapter 4 I was shocked when I saw paper 2......)<br /><br />The exams are about details, speed and precision, LCM will mainly mark your script according to the steps, but not the final solution, so make sure you answer the questions as detailed as possible to show him that you fully understand the materials. Another tip is to answer the questions as quickly as possible (I know it is hard to do it in detail and quickly, but try your best).<br /><br />I got all the 20% in assignments, used most of my marks to top up my midterm score, get 1 extra mark for final and got a bit higher than 70% in final exam. My overall score is at the cutoff of A- according to the information above, but my final grade is A. I heard that someone get an overall score between the cutoff of B and B+ but get A- at last.",
            "comment_workload": "1 assignment per topic, including 3 assignments with both required problems and bonus problems and 1 assignment with only bonus questions.<br /><br />I would say the required problems are quite straight forward, you can finish it easily using the methods taught in the lecture, but the bonus problems are more demanding and require more understanding of the materials, so it is better to revise the notes or read the problem sets before doing the bonus. The bonus questions are graded by LCM, so it's better to write your solutions as detail as possible to obtain full mark.<br /><br />As the bonus marks will boost your mark quite a lot (you may get a subgrade higher or even more if you finish all of the bonus questions), so remember to spend some time to finish it. For me, I spent about 3 days for each of the first 3 assignments, and a day for the bonus assignment.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iwrcVHlImdiuyi9nfuHFSjRdg26r3n15",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 559,
                    "name": "KWOK, Yue Kuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "read_homo",
            "date": "Jun 05, 2016",
            "title": "Mixture of FINA3104, MATH2023, MATH2121, MATH2411",
            "comment_content": "This course is about proof of some basic finance theory which means using mathematics to understand how those theory work.<br /><br />1. Bond portfolio management and immunization <br />This part is merely talking about Bond Price and duration. If you have study FINA3104, it is simply.<br /><br />2. Mean variance portfolio theory <br />The most difficult part is understanding the proof of Markowitz’s mean-variance. You should acquire sufficient background knowledge of Multi-variable Calculus and Algebra.<br /><br />3. Capital asset pricing model and factor models <br />These two have shown you how the Markowitz’s Model and CAPM derived in terms of mathematics. If you know these two things before, then it is just a maths version of these finance core principles. <br /><br />4.Utility optimization for investment decisions <br />I have no idea about this part when I was studying for finals. This is a quite new topics which should spend plenty of time to understand.",
            "comment_teaching": "Professor Kwok is a very interesting person who talks with a local accent. I can ensure you his catchphrase would be the things you remember the most after talking his class for whole semesters. I found that I wasn't interested in listening his lecture since he always jump the notes. I skipped at least 3/4 of them. Self Study would still be sufficient.",
            "comment_grading": "30% A range.<br /><br />I think I can't find any other maths course gave so generous grade to student.<br /><br />Grading Scheme:<br />Mid-term Exam 40%<br />Final Exam 60%",
            "comment_workload": "Mid term and Final only, not even assignments. If you are marginal case student, you should do those optional assignments to get a pass. There are samples in his websites: https://www.math.ust.hk/~maykwok/MATH4512.htm<br />I only study one week before mid-term and final.<br />Understand and recite proof stated in the notes--&gt; good grade for sure.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sNEqc1YKOelEQrMBYUcWpMb24sbxriAE",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 912,
                    "name": "LEUNG, Chi Man",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cary.R",
            "date": "Jun 05, 2019",
            "title": "Best decision ever made",
            "comment_content": "Enjoyable, super useful and eye-opening. It's okay oyu from business school. 4512 enables you to have a much better understanding on some well-known principles. (CAPM, Utility Functions etc.) Proofs are understanable and LCM will offer his way of proofs which I regard as lean and smart.",
            "comment_teaching": "Super helpful and encouraging every step of the way. I usually drop by his office hour and he is always glad and well-prepared to answer every question I have patiently.",
            "comment_grading": "&lt; 40%: D or F<br />&gt;= 40%: C- or above<br />&gt;= 57%: B- or above<br />&gt;= 78%: A- or above<br /><br />The cutting point will be adjusted to a little bit lower if the midterm mean is not sufficiently high. The extra bonus point which will help you a lot. The conversion rate is good (8 bonus point to 1 midterm poin)t. I top up to 90+ midterm score and get around 80 in the final. <br /><br />Me: overall 85%+ &gt;&gt;&gt; A.",
            "comment_workload": "3 Assignment<br />Midterm<br />Final<br /><br />light and reasonable for a 4 level MATH course",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1Q3mrfFhqQJ8vDW1CtCMzVbKLJBBP1dN",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 912,
                    "name": "LEUNG, Chi Man",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "想當年",
            "date": "Jul 04, 2022",
            "title": "【I don’t have time finished writing it now. I’ll write later】",
            "comment_content": "【I’ll write later】",
            "comment_teaching": "【I’ll write later】",
            "comment_grading": "If you have taken courses from Dr. LCM before, you know how he distributes the grade. He tells you the so-called absolute grading scheme in the 1st lesson. However, he will definitely lower the cutoff of grades if needed.<br /><br />This year:<br />overall percentage&nbsp;&nbsp;grade<br />88%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A+<br />78%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A- or above<br />60%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;B- or above<br /><br />To get a C- or above, you need to get 40% in total, and 25% in the final exam.<br /><br />This year, 40 bonus marks (from assignments) and be converted to 1% overall.<br />________________________________________<br /><br />Statistics: (from Canvas)<br />Online final exam: <br />Mean: 49.33\tHigh: 89\tLow: 14<br />(Remark: This year, 2 marks are added to everyone, to make the full mark 100.)\t<br />________________________________________<br /><br />For me:<br />Assignment (25%):&nbsp;&nbsp;552/300<br />Online final exam (75%):&nbsp;&nbsp;53/100<br />overall = 71.05%<br />grade = A-<br />________________________________________<br /><br />【I’ll write later】",
            "comment_workload": "【I’ll write later】",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}