{
    "error": false,
    "course": {
        "id": 885,
        "subject": "MATH",
        "code": "2421",
        "name": "Probability",
        "description": "Sample spaces, conditional probability, random variables, independence, discrete and continuous distributions, expectation, correlation, moment generating function, distributions of function of random variables, law of large numbers and limit theorems.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MATH\" data-code=\"1014\" href=\"/review/MATH1014\" target=\"_blank\">MATH 1014</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1020\" href=\"/review/MATH1020\" target=\"_blank\">MATH 1020</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1024\" href=\"/review/MATH1024\" target=\"_blank\">MATH 1024</a>",
        "corequisites": "<a class=\"course-link\" data-subject=\"MATH\" data-code=\"2011\" href=\"/review/MATH2011\" target=\"_blank\">MATH 2011</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2023\" href=\"/review/MATH2023\" target=\"_blank\">MATH 2023</a>",
        "exclusions": "IEDA 2510 (prior to 2018-19), <a class=\"course-link\" data-subject=\"IEDA\" data-code=\"2520\" href=\"/review/IEDA2520\" target=\"_blank\">IEDA 2520</a>, <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2431\" href=\"/review/MATH2431\" target=\"_blank\">MATH 2431</a>, <a class=\"course-link\" data-subject=\"ELEC\" data-code=\"2600\" href=\"/review/ELEC2600\" target=\"_blank\">ELEC 2600</a>, <a class=\"course-link\" data-subject=\"ELEC\" data-code=\"2600H\" href=\"/review/ELEC2600H\" target=\"_blank\">ELEC 2600H</a>, <a class=\"course-link\" data-subject=\"ISOM\" data-code=\"3540\" href=\"/review/ISOM3540\" target=\"_blank\">ISOM 3540</a>",
        "rating_content": 3.81,
        "rating_teaching": 3.53,
        "rating_grading": 3.83,
        "rating_workload": 4.19,
        "review_count": 36,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 542,
                "name": "YU, Chi Wai",
                "count": 17
            },
            {
                "id": 901,
                "name": "WANG, Ke",
                "count": 8
            },
            {
                "id": 959,
                "name": "BAO, Zhigang",
                "count": 5
            },
            {
                "id": 1202,
                "name": "XIA, Dong",
                "count": 4
            },
            {
                "id": 1063,
                "name": "HAN, Ruijian",
                "count": 2
            },
            {
                "id": 543,
                "name": "LING, Shiqing",
                "count": 1
            },
            {
                "id": 1342,
                "name": "LIANG, Zhicong",
                "count": 1
            },
            {
                "id": 1345,
                "name": "HUANG, Yifei",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "cEUO88FNdrS0oRj0iMp6uxmmdxMNUird",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "mark_",
            "date": "Dec 30, 2022",
            "title": "BUYER BEWARE",
            "comment_content": "The content is normal probability stuff. <br /><br />I typed up LaTeX notes this semester and you can download them below for your own review (pls don't sell them...)<br /><br />CHAPTER 1:<br />Counting, Binomial/Multinomial theorem<br /><br />CHAPTER 2:<br />Axiomatic Definition of Probability, Inclusion-exclusion, Conditional probability, Independence.<br /><br />CHAPTER 3:<br />Random variables, Bernoulli/Binomial/Negative Binomial/Hypergeometric/Poisson Distributions<br />Beta/Gamma/Exponential/Normal Distributions<br /><br />CHAPTER 4:<br />Discrete/Cont. joint distributions, transformations of RV, independence and conditional probability of RV<br /><br />CHAPTER 5:<br />Expectation/Variance of multiple RV, Covariance, Correlation, Moment Generating Functions.",
            "comment_teaching": "The teaching barely prepares you for what will come. There were far from enough examples to help you understand the content intuitively. The motivation behind many concepts or distributions were not given. This is not how a MATH course should be taught.<br /><br />Moreover, we could not finish the content of course by the end of the semester. So, he crammed the untaught content into a make-up lecture during the study period, less than a week before the final. <br /><br />The provided notes are also quite unhelpful... unlike most professors who upload their full notes, he uploads a skimmed down version of his notes that do not contain useful examples, proofs, etc. that he mentioned in class. Moreover, it's impossible to revise efficiently with them because they are a weird mix of MS word, screenshots of LaTeX papers or even for one chapter, just a PDF of images.<br /><br />P.S. Again, if you want more convenient revision notes, look at my notes below :P <br /><br />--<br />As for the tutorials, the first few weeks are honestly quite boring as it should just be review. However, for the later weeks make sure you read the tutorial notes as they may be useful for the final exam.",
            "comment_grading": "GRADING SCHEME:<br />10% class participation (6 in total)<br />30% assignments (2 in total, 15% each)<br />60% final exam<br /><br />So... YCW quite possibly has the worst grading I've seen. And, having taken some &quot;interesting&quot; courses (such as Yan Min's 2131, Chiang's 1014), that's saying something.<br /><br />Firstly, the homeworks are easy and short (except in HW2 many people got 10 marks deduced because the instructions were unclear). And there's only two of them. <br /><br />But then, he sets an insane final exam. If you look at the stats below, the median is only 16.75/70, or 23.9%. This is the lowest median I've heard of in UST. The upper quartile is 42.7%, meaning 75% of the class could not score over half. It's almost like the professor was setting everyone up to do poorly in the final. <br /><br />So, if you score around 50% in the final, then great, you did better than 75% of the class. That means you will at least get B+ or A- right?<br /><br />WRONG! I scored 34/70 and have an overall score of 66%, and the estimated upper quartile is 64%. Yet he still gave me a B. Such funny. I can't even imagine what grade the median score would give you, and to those people, you have my sympathy.<br /><br />According to some sources, even getting +2SD, which I'm assuming means mean + 2*(upper quartile - mean) since the SD was not released, will only get you an A-. I don't doubt that nobody got A+ since the highest score on the exam was a 53/70.<br /><br />I've heard there's some people who may be filing a formal complaint to the ARO. If anything happens, I'll keep this review updated.<br /><br />Overall, I don't know what happened to YCW. His past reviews for this course were pretty positive, but this is not what I was expecting.<br /><br />UPDATE 19/1/2023: After a formal complaint by some students to the MATH department head, my grade went from B to A-. So you can see the department agreed that the original grading was BS... I'm keeping the grade for this component as an E though as the department had to get involved.<br /><br />--<br />Data: (low, lower quartile, median, upper quartile, max | mean)<br /><br />CP1: 0, 1, 1, 1, 1 | 0.81<br />CP2: 0, 0.5, 1, 1, 1 | 0.73<br />CP3: 0, 0, 0.5, 1, 1 | 0.56<br />CP4: 0, 0.13, 1, 1, 1 | 0.66<br />CP5: 0, 0, 1, 1, 1 | 0.69<br />CP6: 0, 0, 0.5, 1, 1 | 0.6<br /><br />HW1: 0, 81, 95.5, 100, 100 | 89.48<br />HW2: 0, 52, 75, 90, 100 | 71.15<br /><br />Final: 0, 12, 16.75, 29.75, 53 | 21.69<br />(score is /70)<br /><br />One can see the final exam's score distribution is left-skewed as the median &lt; mean.",
            "comment_workload": "As mentioned, the workload is incredibly light. Only two easy homeworks. <br /><br />But I must say, I wish there was more homework. A professor once told me that students say they feel lost without homework... and this is exactly how I felt in this course. The course is not easy, and two assignments are not enough to help you deeply understand the content.<br /><br />I tried using the textbook as a source of exercises... but finding good questions is hard due to the sheer amount of exercises in the book.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 19,
            "vote_count": 19,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": [
                {
                    "key": "8jMjejEw6uH5rBAA7ObkQTGAKWZh0CON",
                    "name": "notes",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "ldTCSuu0rkdiCkI1IpJzVG51Xcif1qwg",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Sofy Twilight",
            "date": "Dec 12, 2022",
            "title": "因屌YCW收Warning Letter",
            "comment_content": "BEFORE ANYTHING 我要強調YCW唔止係教育質素，人品都有問題。<br /><br />話學生係垃圾人<br /><br />有題我答案完全正確，步驟都可以Justify到，6分，1分都唔俾我，我問佢點解冇分，佢就好寸咁話：<br />我唔理你答案正確唔正確，你唔係同我marking scheme一模一樣就唔使有分<br />我話有冇step分，佢就冷笑，話，你係Instructor定我係啊？<br />我頂唔信就話，你舊marking scheme咁垃圾。<br />佢就趁眾人唔可以用手機，講咗句<br /><br />你咁多垃圾話嘅？我明，你係垃圾人，所以多垃圾話。<br /><br />就置之不理。<br /><br />幫女加分<br /><br />根據我同其他同學嘅觀察，條友對住女就笑騎騎，去攞分就必加，對住男仔就黑口黑面，唔係Explanation正確答案錯冇得加，就係答案正確Explanation錯(點錯法，好似我咁唔用佢方法就錯?)，一分都冇。<br /><br />洗太平地<br /><br />之前goop上面有篇文都ycw有關，結果就離奇消失咗，唔知係咪有Dr Yu因素呢。<br /><br />Ok Ordinary Content<br />Basic Probability<br />Random Variable and their distribution<br />Expected and Var<br />Joint distribution<br />Moment-generating function<br />Correlation coefficient and Covariance<br /><br />I think this is some classic probability stuff. Nothing wrong.<br /><br />Ycw:我唔理你答案正確唔正確，你唔係同我marking scheme一模一樣就唔使有分<br /><br />BTW 因為屌YCW收Warning Letter",
            "comment_teaching": "I don't mean to personally attack the instructor. But I would really like to say, you are a dumbass who the fuck should not do more teaching job. <br /><br />1. Unclear notes<br />Exclude those funny cartoons on your notes. Your notes have no point, and sometimes I would just like to take a look on formula, but it is difficult to find the formulae on the notes, one is because the bad typesetting, another is that the notes you provide is JPEG to PDF but not word/latex to PDF, not available to search.<br /><br />2. No ppt provided<br />Some content is mentioned in PPT, but you don't provide the PPT. So, I have to hear your boring tone for a long while to do the revision.<br /><br />3. Participation???<br />Except some courses that on-site work is important (e.g. Physics experiment, medical clinic practice), all other courses taking participation indicates it a suck course. Since if no participation is counted, then no one presents. Thanks for the UST workload, I usually woke up really tired and go to the classroom. And at last, since I can't answer two participations questions correctly (time is too short), 3.5% is deducted from my total result. GG<br /><br />4. Bad teaching quality<br />Dull and undirected. You don't know what he's talking about. All my revision is through flying through the notes, doing the pastpapers, and find some other online materials to help my understanding. Thanks to Internet!<br /><br />5. Lack of examples<br />For some distributions that may be difficult to understand and applied. Such as Beta, he completely lost his ability to explain when such distributions should be applied. And in a problem set, it is tested in a quite ambiguous way (The distribution of percentage of students getting A-range). And at that moment, I finally know it.",
            "comment_grading": "Unreasonable.<br />10% Participation and such participations later need you to answer the questions correctly. But sometimes they are not that easy to be solvable in few minutes. So, I got 3 deducted.<br /><br />30% Homework<br />Well, I seldom say homework is too less, but this course is. Given the homework accounts for 30%, the two problem sets only contains 5 questions. And if you do some careless mistake than you got nothing. I got 39/200 *30% = 5.85% marks deducted from the suck homework. <br />On the other hand, the course is not that easy, more homework should indeed be provided to train the understanding.<br /><br />60% Final<br />Hard final. I got some parts not understanding. And I was extremely tired that day. So, I would probably fry the final. GG<br /><br />HW 24.15/30<br />Participation 6.5/10<br />Final 35/70 (I guess YCW was making love with his mom while marking our papers)<br />Grade: I guess B+(?)<br /><br />哇屌係B-啊<br /><br />Finally I appealed and it became B+ from B-. It leaves me a wonder how poor was the original distribution.<br /><br />P.S. For your reference I was almost high and got A+ in MATH 2411 Summer.",
            "comment_workload": "Low. But low is not always a good thing. Especially for the courses with difficult content and exam.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 20,
            "vote_count": 23,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "TXVjWqq8GVscguRZ17pm3aFMARlZvmqd",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "...777",
            "date": "Dec 31, 2022",
            "title": "Don't reg this course if yow is the instructor",
            "comment_content": "CHAPTER 1:<br />Counting, Binomial/Multinomial theorem<br /><br />CHAPTER 2:<br />Axiomatic Definition of Probability, Inclusion-exclusion, Conditional probability, Independence.<br /><br />CHAPTER 3:<br />Random variables, Bernoulli/Binomial/Negative Binomial/Hypergeometric/Poisson Distributions<br />Beta/Gamma/Exponential/Normal Distributions<br /><br />CHAPTER 4:<br />Discrete/Cont. joint distributions, transformations of RV, independence and conditional probability of RV<br /><br />CHAPTER 5:<br />Expectation/Variance of multiple RV, Covariance, Correlation, Moment Generating Functions.",
            "comment_teaching": "He won't explain the complicated part<br />eg. if you don't know matrix, go MSC and learn it<br /><br />This part is not include in our course. appear in final exam<br /><br />We could not finish the content of course by the end of the semester since he tested positive in October if I do not rmb wrong. So, he crammed the untaught content into a make-up lecture during the study period, less than a week before the final. And a question consist 11/70 appear in the final",
            "comment_grading": "GRADING SCHEME:<br />10% class participation (6 in total)<br />30% assignments (2 in total, 15% each)<br />60% final exam<br />There should be 3 asm, but he could not finish the content, so only 2asm were counted.",
            "comment_workload": "There are only 2 asm, so the workload is light. However, ycw won't give us&nbsp;&nbsp;practice exercises for revising and it is totally not enough for every student.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VeYwSkjovrcoASC9VRwYriEwi2WPk68I",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                },
                {
                    "id": 1345,
                    "name": "HUANG, Yifei",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "calcguy",
            "date": "May 26, 2018",
            "title": "Essentially a Self-Study Course",
            "comment_content": "Chapter 1 : Preliminary<br />Chapter 2 : Probability<br />Chapter 3 : Random Variables and Probabilty Distributions<br />Chapter 4 : Joint and Conditional Probability Distributions<br />Chapter 5 : Covariance, Correlation, and Moment Generating Functions<br /><br />The content before midterm (except Chapter 1) is just a repetition of MATH2411, but with more rigorous approach. However, the content after midterm is quite hard to be understood if you do not revise them occasionally, since almost of it are new topics that require your knowledge in multivariable calculus (i.e. MATH2011 OR MATH2023), e.g. double integration.<br /><br />This course will be really beneficial for those who want to take Exam P - Probability (SOA), since the exam syllabus is pretty much the same as the content covered in this course (though there are few &quot;not so hard&quot; topics not discussed in this course)",
            "comment_teaching": "I personally love the way he teaches. More importantly, incomplete notes imply the need of attending the lectures. However, you could actually refer to the reference textbook for the details of each material taught in the class. <br /><br />For the tutorial, it is a complete waste of time going there. I personally attend the tutorial twice, yet I did not learn anything from the tutorials.",
            "comment_grading": "Scheme 1:<br />Homework : 10%<br />Midterm : 35%<br />Final : 55%<br /><br />Scheme 2:<br />Homework : 10%<br />Midterm : 0%<br />Final : 90%<br /><br />(a) For the homework, it is not that hard to actually obtain full score. First, the assignment problems are the exact replica to the problems in the previous years. Moreover, SOME of the questions are even copied from the textbook examples, so you can simply copy and paste them.<br /><br />(b) For midterm exam, you have to read your lecture notes and also do the end-chapter problems (especially theoritical problems), since some of them will actually appear in the exam in the exactly same way.<br /><br />(c) For the final, save at least 2 weeks to review chapter 4 and chapter 5, since it is heavily demanded in the exam. Again, doing the end-chapter problems will help preparing for your final exam.<br /><br />Statistics: <br />Homework 1 : 38.05 / 40 , me : 35<br />Homework 2 : 64.49 / 70 , me : 70<br />Homework 3 : 26.44 / 30 , me : 25<br />Midterm : 33.14 / 60 , me : 33<br />Final : 31.03 / 80 , me : 68<br />Letter Grade : A<br />Seems legit...",
            "comment_workload": "Not that much of workload for this course. Each assignment is due about 3 weeks before the deadline, so you have more than enough time to finish them and discuss with your friends. With the help of self-created formula sheet, the midterm and final exam will look less hard, though it takes some time to create the formula sheet. Just remember that concept is far more important than statements.<br /><br />Just be careful that focusing on doing assignments ONLY will certainly be unhelpful towards the exams.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 7,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "K8PpSIbEDdj3Z6sJEFq8MsPtM6IJOagr",
                    "name": "Ross_8th_ed_English",
                    "format": "pdf"
                },
                {
                    "key": "K92ALHNZXKJn1691ZnwZcKu4ekpg9cw8",
                    "name": "Ross_8th_ed_English_Solution",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "CD1MtJfEqzRoGRmj5V3g2xaCoIYsVSs7",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "haru",
            "date": "Jan 08, 2023",
            "title": "",
            "comment_content": "CHAPTER 1:<br />Counting, Binomial/Multinomial theorem<br /><br />CHAPTER 2:<br />Axiomatic Definition of Probability, Inclusion-exclusion, Conditional probability, Independence.<br /><br />CHAPTER 3:<br />Random variables, Bernoulli/Binomial/Negative Binomial/Hypergeometric/Poisson Distributions<br />Beta/Gamma/Exponential/Normal Distributions<br /><br />CHAPTER 4:<br />Discrete/Cont. joint distributions, transformations of RV, independence and conditional probability of RV<br /><br />CHAPTER 5:<br />Expectation/Variance of multiple RV, Covariance, Correlation, Moment Generating Functions.",
            "comment_teaching": "Mainly proof in class<br />Not many details and lack of useful examples.<br />No revision and exercises<br />He tested positive--&gt; one make-up lecture for this sem",
            "comment_grading": "10% class participation<br />30% assignments<br />60% final exam<br />don't take YCW course if you want good grade",
            "comment_workload": "Only 2 assignments",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TtpOz5Z9MXHzonBGZAHCJ8Rv3STiwzoe",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 901,
                    "name": "WANG, Ke",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "udontknowmyname",
            "date": "Nov 29, 2021",
            "title": "A waste of life. 成個course同埋prof都係垃圾，唔知呢個course同probability有啲咩關係",
            "comment_content": "I have attached weekly schedule for reference. She cancelled the whole Ch8 because there was no time. This course is really a waste of life. I don't think there is any actual content regarding probability. The course is more like teaching you some formulae and let you do the calculation. There is no rigorous theory at all. For proof, the prof only does the simple ones, which you can carry out yourself with a bit of calculation. Those that are hard to prove, she simply skipped. Personal opinion, this is a high school level course instead of a university level one. For those who want to have a deeper understanding of probability, please consider taking MATH2431.",
            "comment_teaching": "Wang Ke's teaching is shit. Yep, that is the word that I found most appropriate. Now allow me to use some probability language to describe her teaching.<br />Let A={WK explains stuff clearly}, B={WK distributes time properly}<br />By my observation, P(A)=0, P(B)=0.<br />She keeps focusing on stuff you already know or those that are easy to understand. If there is something you can spend 10 secs reading through the notes and then understand, she will spend at least 10 minutes explaining. However, if there is something that is hard to understand, she will spend at most 5 minutes. I really doubt whether she is capable of teaching. For some of the Ch6, Ch7 stuff, sometimes I have no idea what she is talking about at all. It is not that it's hard to understand her, but it's that it's impossible to understand her. And she spends too much time doing calculation, which I think is unnecessary since this is a probability course, but not a calculus course. And just by the way, for those of you who will encounter her in the future, be warned that she might also be a certified hypnotist in addition to professorship. Yep, don't blame yourself if you fall asleep in her lecture. Actually, I'm now offering the most useful advice in this filled-with-complaining review: DON'T ATTEND HER LECTURE AT ALL!!!",
            "comment_grading": "To be honest, I haven't taken my final yet. I'm just so unsatisfied with the course and instructor. Will update the grading part after grade is released.<br /><br />Got A+ in the end. I think it's quite easy to get a good grade in this course and you don't even need to make efforts because the content is just so easy. But still, if your aim is to learn stuff instead of getting a good grade, don't take this course.",
            "comment_workload": "Workload is quite light. 5 assignments in total. Doing integration may take a while in some of them, but you can always let online calculator do the job.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 8,
            "vote_count": 12,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "Tdsd7FmMFn5nBjG45q2lUQ5zXuznGZlt",
                    "name": "Tentative weekly schedule",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "FCckTjQbhSK06Stp8jxF7WmRYfsyDHTu",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 901,
                    "name": "WANG, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "_NattU_",
            "date": "Jun 03, 2022",
            "title": "",
            "comment_content": "The course covers the first seven chapters of the textbook (attached to this review). Prof. makes her slides based on this set of lecture notes. She usually avoids the more difficult and theoretical examples so that's good news for non-MATH majors taking this course. <br /><br />Some of the assignment problems are based on exercises from Ross's textbook.",
            "comment_teaching": "She keeps the lecture simple and easy to follow. The zoom chat was also pretty active. She was very considerate of the ongoing situation so she provided an alternating grading scheme and adjusted the grade thresholds. :)",
            "comment_grading": "The course grade is computed based on the following scheme:<br /><br />max{Scheme1, Scheme 2}<br /><br />Scheme 1: HW (15%),&nbsp;&nbsp;Midterm (35%), Final (50%)<br />Scheme 2: HW(15%), Final (85%)<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;My score | Mean | Total <br />HW1:&nbsp;&nbsp;&nbsp;&nbsp;200 | 196.2 | 200<br />HW2:&nbsp;&nbsp;&nbsp;&nbsp;285 | 275.1 | 285<br />HW3:&nbsp;&nbsp;&nbsp;&nbsp;165 | 157.0 | 165<br />HW4:&nbsp;&nbsp;&nbsp;&nbsp;250 | 234.5 | 250<br />HW5:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;70 | 68.8 | 70<br /><br />Midterm: 90 | 69.7 | 100<br />Final:&nbsp;&nbsp;106 | 70.1 | 120<br /><br />Overall course score: 90.77%<br />Grade: A+",
            "comment_workload": "Pretty light workload for a 4-credit course. Only 5 HWs (each one consists of 15-20 problems) in form of Canvas quizzes but you get 20 tries. It's also relatively easy to find similar problems online so getting full marks on the HW assignments shouldn't be too difficult. The lecture slides don't take too much time to cover but if you're aiming for a high grade, it's essential to cover the textbook (and the harder problems) by yourself along with the problem sets and also explore exercise problems from other textbooks.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "KxSLmOmDJ2esHrNXiD7R4jprALqR8nBG",
                    "name": "Lecture Notes",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "aTjvRYcgvB4COVngAMtOcTLF1FmAgHM7",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "USTAsiaNo1",
            "date": "Jul 15, 2020",
            "title": "Excellent introduction to probability",
            "comment_content": "- List of topcis<br /><br />Chapter 1 : Preliminary<br />Chapter 2 : Probability<br />Chapter 3 : Random Variables and Probabilty Distributions<br />Chapter 4 : Joint and Conditional Probability Distributions<br />Chapter 5 : Covariance, Correlation, and Moment Generating Functions<br /><br />- Brief comment on each chapter<br /><br />&gt; Ch1 is simply a revision of secondary school thing, n!, nCr, nPr, (a+b)^n = ..., etc<br />&gt; Ch2 is basic probability, like the famous birthday problem. It is basic since it uses basic concept, not because it is easy!<br />&gt; Ch3-4 is something real<br />1. Single-variable distribution<br />You will learn up to <br />&nbsp;&nbsp;&nbsp;&gt; 6 discrete distribution, and<br />&nbsp;&nbsp;&nbsp;&gt; 6 continuous distribution<br />You are required to learn the intuition, formula, properties (like memoryless), relationship between distribution, and distribution approximation. <br />2. Multivariable distribution<br />Besides these (1-dim) distribution, you will also learn joint distribution, like multinomial (discrete) and multi-normal (continuous)<br />3. Conditional distribution (single or multi-variable)<br />&gt; Ch5 is something fun<br />It covers moment of generating function (mgf) and uniqueness of mgf per distribution<br />It generalizes the process like finding expectation, variance, or in general the expectation of a vector<br />It is hard and abstract, but prof didn't try to scare us by crazy stuff, what u learn is still the basic to this topic and, to be honest, quite fun<br /><br />- Sum-up<br /><br />so, main coverage:<br />1. Single-variable, Discrete and Continuous distribution <br />2. Joint distribution <br />3. Conditional distribution <br />4. Moments",
            "comment_teaching": "- Style<br /><br />1. You will definitely see that he try to entertain you by some weirdly designed example like animate shop problem (It deeply rooted in my mind lol)<br />Still, in general, not really interactive <br />He gives a statement, he proves, you learn, that is<br />(but do you need it in a maths course actually...?)<br /><br />2. Definitely a nice guy who willing to answer questions<br /><br />3. Attain the lecture!<br />Some hard-written notes are randomly added when he thinks of it, and it won't exist on your own note, even not in the textbook! So, go to the lesson and mark down those info!!<br /><br />- Materials<br /><br />His notes are carefully designed, really nice, beautiful and detailed<br />It has sample question and professor will give solution to all of these during class",
            "comment_grading": "- Detail comment on each grading attributes<br /><br />a. The assignment is really easy<br />1. just in its level, not high<br />2. Answer or similar questions are everywhere, you know where to find it<br />3. Just 3 assignments and tons of time was given, you can really think slowly<br /><br />b. Exam is hard<br />The final exam is hard, not some standard problems<br />It is quite conceptual like once you get the point, you can solve it easily, otherwise, you will be stuck at somewhere and cannot get the result<br />the time limit is tight too, be careful on your time management<br /><br />c. Essay<br />It is an essay like a free study on some probability-related topics<br />It is surprisingly hard and is restricted to be a single-paged A4 size essay (seem to prevent someone writes 100 pages to get high scores)<br />And you need to have some structure like motivation, this kind of things, it is therefore quite hard to show your academic knowledge and compress it into such small space<br />Still, it is quite fun like have your little own research<br /><br />- Objective comment<br /><br />a. Assignment<br />mean is like 90%<br />b. Exam<br />mean is like 45/100<br />c. Essay<br />mean is like 13/20<br /><br />for me:<br />a. Assignment (30%)<br />all about 95%-100%<br />b. Exam (50%)<br />about 65/100<br />c. Essay (20%)<br />about mean<br /><br />Get a A-<br /><br />*** Essay part is designed for this semester since the virus, it is as the replacement of mid-term exam, be reminded =)<br /><br />I would say it is &quot;good to fair&quot; in grading<br />Will not be the best for sure, but surely above average",
            "comment_workload": "- Brief comment on each grading attributes<br /><br />a. Assignment <br />Simple, tons of time to do, google is your friend <br />b. Exam<br />It is hard, take your time to study<br />Since ch3-ch5 has tons of facts, theorem, proofs...<br />c. Essay<br />Hard too, yet time are plenty<br />Just some time is definitely needed to pick a good topic to surprise prof and also make yourself understand the contents to write the paper<br /><br />- Brief comment on the contents<br /><br />It is indeed quite hard, even I get a A-, I would weight it as 7/10 in terms of difficulties. Since it really covers soooooo many things, and the final is quite hard. You must do revision seriously to make sure you understand everything and get a good grade.<br /><br />So, I think you definitely need to invest some time on this course!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 7,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rvXqiMf2olGNgyKx6bs0sbhHb06O2NPP",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                },
                {
                    "id": 1342,
                    "name": "LIANG, Zhicong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "miketony",
            "date": "Aug 27, 2020",
            "title": "",
            "comment_content": "Probability, Random Variables and Probability Distributions, Joint and Conditional Probability Distributions, Covariance, Correlation, and Moment Generating Functions<br /><br />This course more focuses on probability and more difficult than MATH 2411. Also, it is a PROOF-BASED course.",
            "comment_teaching": "Prof. Yu's notes are very detail and clear, I can know what is talking about in each chapter. However, since the are many blanks and you need to fill in in the lecture, so better not to skip the lesson. Prof.Yu won't upload the detailed version of lecture notes.",
            "comment_grading": "20% Assignment<br />30% Essay<br />50% Final<br /><br />around mean on both assignment and essay, below mean 2-3 marks on final, B-",
            "comment_workload": "This semester we only have assignment, essay and final. So the workload is very light.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aKNJlgOP6vGmd3QDZBt3LewTLRn1pzL6",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "scambret",
            "date": "Dec 21, 2016",
            "title": "",
            "comment_content": "- counting and probability<br />- discrete random variables<br />- continuous random variables<br />- joint pdf and marginal pdf<br />- independence and sum of iid variables<br />- expectation, correlation, covariance, mgf<br /><br />First chapters are very similar to the one discussed in MATH 2411, but please train yourself to do exercise and proof.",
            "comment_teaching": "Dr. Yu is a great teacher. His proof are clear, examples help you to understand the subject.<br /><br />But please, attend his lectures. Slides are not completed, so you have to go to take notes.",
            "comment_grading": "This term we had<br />10% hw<br />35% mid-term exam<br />55% final exam<br /><br />or <br /><br />10% hw<br />90% final exam<br /><br />whichever is better<br /><br />The total score mean was 60.89/100, sd=23.38<br />The final score mean was 40.91/80, sd=21.99<br /><br />I personally have done total score 92.12, so A+",
            "comment_workload": "Just 4 assignments, each of them consist of 4 questions. Not very hard actually",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iualQrU7jwtGNOdiwxQEuCg72H4QMJCU",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 901,
                    "name": "WANG, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "postexampls",
            "date": "Jun 03, 2023",
            "title": "its ayt i guess",
            "comment_content": "Week 1<br />Chapter 1: Principle of counting, permutations<br /><br />Week 2<br />Chapter 1: Combinations, Multinomial coefficients, number of integer solutions<br />Chapter 2: Sample spaces and events<br /><br />Week 3<br />Chapter 2: Operations on events, axioms of probability, properties of probability,<br />Sample spaces having equally likely outcomes<br /><br />Week 4<br />Chapter 3: Conditional probability, total probability, Bayes’ Theorem,<br />independence<br /><br />Week 5<br />Chapter 4: Definition of random variables, discrete random variables, expected<br />values, expectation of a function of a random variable, variance and standard<br />deviation<br /><br />Week 6<br />Chapter 4: Discrete random variables arising from repeated trials, Poisson<br />random variable, hypergeometric random variable, expected value of sum of<br />random variables<br /><br />Week 7<br />Chapter 5: Continuous random variables, probability density function,<br />expectation and variance, uniform distribution, normal distribution, exponential<br />distribution, Gamma distribution<br /><br />Week 8<br />Chapter 5: Beta distribution, Cauchy distribution, approximations of binomial<br />random variables, distribution of a function of a random variable<br /><br />Week 9<br />Chapter 6: Joint distribution functions, independent random variables, sum of<br />independent random variables, conditional distributions<br /><br />Week 10<br />Chapter 6: Joint probability distribution function of functions of random variables<br /><br />Week 11<br />Chapter 6: Joint probability distribution function of functions of random variables<br />Chapter 7: Expectation of sum of random variables<br /><br />Week 12<br />Chapter 7: Covariance/variance of sums and correlation, conditional expectation,<br />conditional variance<br /><br />Week 13<br />Chapter 7: Moment generating function, joint moment generating functions<br /><br />Week 14<br />Chapter 8: Chebyshev’s inequality and weak law of large numbers, strong law of<br />large numbers<br /><br />Week 15<br />Chapter 8: Central limit theorem<br /><br />If you have experience with probability, permutation and combination then you're all good for midterm.<br /><br />The difficult stuff (at least to me) came after the midterm, but knowing how to do double integrals (from math2023) definitely helped a lot. <br /><br />Overall, the content was definitely challenging but manageable",
            "comment_teaching": "Professor's teaching was pretty average, but not bad at all<br /><br />She explains things well and it isn't hard to understand her",
            "comment_grading": "GRADING SCHEME:<br />HW - 15% (3% each HW)<br />MT - 35%<br />Final 50%<br /><br />MT stats:<br />max - 100<br />mean - 71.1<br />sd - 16.53<br /><br />Final stats:<br />max - 120<br />mean - 73.59<br />sd - 25.16<br /><br />me:<br />MT - 90/100 (+1.14sd)<br />Final - 92/120 (+0.73sd)<br />Total: 84.83% (A-)<br /><br />I thought I was gonna get a B+ cuz of the final exam so thanks ke wang :D",
            "comment_workload": "The workload is super light for a 4 credit course, only 5 HW with 20 attempts for each HW, you can be done with it within 2-3 hours<br /><br />Work hard for both Midterm and Final by doing all the HW questions, practice problems and reviewing tutor notes &amp; lecture notes<br /><br />I didn't prepare enough for the final and didn't do as well as I think I should have :(",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lhuR95FvwiVuydbcHbXQq9MYadCSAYVy",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cmhoad",
            "date": "Sep 01, 2016",
            "title": "Not very difficult course but also not very easy",
            "comment_content": "Probability theory, random variables, probability distributions, expectation, parameter estimation, hypothesis testing, linear regression models.<br /><br />Just refer to YU CHI WAI's webpage, as he will change the content occasionally .<br /><br />The content will be a little bit of mixing&nbsp;&nbsp;the content of linear algebra and Multivariable Calculus. So be prepared before taking this course.",
            "comment_teaching": "YU CHI WAI's teaching style is that you need(have) to attend his lecture to jot down many complemental notes. Otherwise, you may lose many important key.<br /><br />He is also a nice, easy-going professor. English is also quite good and clear.",
            "comment_grading": "Not too harsh. I sored one sd above in midterm. But I didn't do well(mean) in final. And get B.",
            "comment_workload": "Midterm<br />Final (I feel that final exam was more far easier than midterm. But I just didn't sleep enough before the exam and then screw- up)<br />2-3 assignment( highly recommend to finish by yourself)<br /><br />All in all, you better attend all the lecture to jot the notes down. YU CHI WAI always put those question taught in the lecture to the midterm or final exam.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "cx6EhUklRYpKpC9n1iwQQPDKxI7ZqeUk",
                    "name": "Assignment 1",
                    "format": "pdf"
                },
                {
                    "key": "shrHiAVNhMgmU6EzETmUi0oo1tcGAB7k",
                    "name": "Assignment 4",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "Dt8hRoAEa0XBruaCh08Z3zg0J5NZy37C",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 901,
                    "name": "WANG, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Semajolty",
            "date": "Jun 02, 2023",
            "title": "做曬Canvas上面所有野就會好grade嘅course",
            "comment_content": "Midterm: Chapter 1-4<br />Final: Chapter 5-7<br />For Chapter 8, just for your own reference<br />You can have 1 two-sided A4 cheatsheet for both midterm and final exam<br /><br />Scope:<br />Chapter 1 Combinatorial Analysis<br />-Basic Principle of Counting<br />-Permutations<br />-Combinations<br />-Multinomial Coefficients<br />-The Number Of Integer Solutions Of Equations<br /><br />Chapter 2 Axioms of Probability<br />-Sample Space and Events<br />-Axioms of Probability<br />-Properties of Probability<br />-Sample Spaces Having Equally Likely Outcomes<br />-Probability as a Continuous Set Function<br /><br />Chapter 3 Conditional Probability and Independence<br />-Conditional Probabilities<br />-Bayes’ Formulas<br />-Independent Events<br />-3.5 P(●|A) is a Probability<br /><br />Chapter 4 Random Variables<br />-Discrete Random Variables<br />-Expected Value<br />-Expectation of a Function of a Random Variable<br />-Variance and Standard Deviation<br />-Discrete Random Variables arising from Repeated Trials<br />-Poisson Random Variable<br />-Hypergeometric Random Variable<br />-Expected Value Of Sums Of Random Variables<br />-Distribution Functions and Probability Mass Functions<br /><br />Chapter 5 Continuous Random Variables<br />-Expectation and Variance of Continuous Random<br />Variables<br />-Uniform Distribution<br />-Normal Distribution<br />-Exponential Distribution<br />-Gamma Distribution<br />-Beta Distribution<br />-Cauchy Distribution<br />-Approximations of Binomial Random Variables<br />-Distribution of a Function of a Random Variable<br /><br />Chapter 6 Jointly Distributed Random Variables<br />-Independent Random Variables<br />-Sums of Independent Random Variables<br />-Conditional distributions: Discrete Case<br />-Conditional distributions: Continuous Case<br />-Joint Probability Distribution Function of Functions<br />of Random Variables<br />-Jointly Distributed Random Variables: n &gt;= 3<br /><br />Chapter 7 Properties of Expectation<br />-Expectation of Sums of Random Variables<br />-Covariance, Variance of Sums, and Correlations<br />-Conditional Expectation<br />-Conditional Variance<br />-Moment generating functions<br />-Joint Moment Generating Functions<br /><br />Chapter 8 Limit Theorems<br />-Chebyshev’s Inequality and theWeak Law of<br />Large Numbers<br />-Central Limit Theorem<br />-The Strong Law of Large Numbers<br /><br />For the contents of midterm exam, I believe that it is not too difficult for those who have Math background because they are just secondary school probability and some basic knowledge of mean and variance. The only new thing is the use of indicator variable. <br /><br />After midterm exam, Chapter 5-7 include the use of double integral for the joint random variable, which may be hard for those who still have not taken the courses for multivariable calculus(e.g. Math 2023). Also, lots of integration by parts will be used, but they are just simple. Just take enough practice to prevent from the careless mistake.",
            "comment_teaching": "Frankly speaking, I have never downloaded any lecture notes from Canvas. I just read the textbook by myself because tb contains all the examples on lecture notes and some more additional questions. <br />During Wang Ke's lectures, I just fell asleep because her tone is very dull. She always spent tons of time explaining the calculations of the easy questions on the lecture notes in Chapter 1-5, which are the easy stuff. However, for the more difficult contents after midterm exam, she just skipped lots of examples on the lecture notes, which contains the important concepts to understand the contents.",
            "comment_grading": "One of the reasons why I take this course in Spring sem is because of Wang Ke's good grading and the escape from YCW. Her grading is much better than YCW thousand times. You will certainly know the difference if you scroll down for the other reviews about YCW.<br /><br />Grading Scheme:<br />Assignments:&nbsp;&nbsp;&nbsp;15% (3% each)<br />Midterm exam: 35%<br />Final exam:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;50%<br /><br />Each assignment has 20 trials. Therefore, it is supposed for every people get full mark in assignment. The questions are not too difficult. Even you have no idea on certain questions, there are answers on the Internet.<br /><br />My result:<br />Assignments:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;970/970 (5 homework total)<br /><br />Midterm exam:&nbsp;&nbsp;&nbsp;&nbsp;87/100<br />Mean: 70.82&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Median: 73\t<br />Low: 4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Lower Quartile: 62&nbsp;&nbsp;<br />Upper Quartile: 83.75&nbsp;&nbsp;&nbsp;High: 100<br /><br />Final exam:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;111/120<br />Mean: 73.16&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Median: 73.5\t<br />Low: 0&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Lower Quartile: 56<br />Upper Quartile: 95\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;High: 118<br /><br />Total: 91.7% (A+)<br />This is not absolute grading<br /><br />Here is a sincere advice: If you want to get good grade and see Wang Ke's session in your semester, do not hesitate, just choose it.",
            "comment_workload": "It depends. If you have taken M1 during secondary school, it would be a piece of cake. For me, I am a M2 student and I just finished all the questions on textbook, assignments, practice problems and past papers. There are no answers for the past paper on Peter Gao, and I spent lots of time finding the answers. If you are a real deal, you can just start revising 1 week before the exams. Each past paper can just spend you 1.5 hours, including checking answers and revising.<br /><br />IN THIS COURSE, PAYING EFFORTS IS MUCH MORE IMPORTANT THAN YOUR TALENTS.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BOBQXzF7qnklZmDhnthMhYkv2CsAcW3H",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 901,
                    "name": "WANG, Ke",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "LZR",
            "date": "Aug 11, 2022",
            "title": "",
            "comment_content": "Chapter 1. Probability by Combinatorial Analysis<br />Chapter 2. Axioms of Probability<br />Chapter 3&nbsp;&nbsp;Conditional Probability and Independence<br />Chapter 4. Random Variables<br />Chapter 5. Continuous Random Variables<br />Chapter 6. Jointly Distributed Random Variables<br />Chapter 7. Properties of Expectation",
            "comment_teaching": "Professor Wang will walk you through all the examples in the note. In general I would say is a good teaching style which I get to know the steps performed when doing different kinds of questions. But there is some strange noise coming out of her device which may be annoying sometimes and she doesn't seem to have that incentive to fix it for her students.",
            "comment_grading": "Homework assignments (5 in total): 15% (3% for each assignment)<br />Midterm: 35%/0%<br />Final: 50%/85%<br /><br />There is an option regarding the midterm and final grading that you can choose between all-in final or not. The professor will choose the highest score between the two grading scheme.",
            "comment_workload": "The workload is reasonable. 5 assignments in the course and each may only take about 2-3 hour.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bUZhE9b5U8TxkGmuosKP7zMoDjwx62Kr",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1202,
                    "name": "XIA, Dong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yyubu",
            "date": "Feb 01, 2021",
            "title": "good grade course for extensional study in probability",
            "comment_content": "Content coverage:<br />Chapter 1-2: probability by combinatorial analysis<br />Chapter 3: conditional probability and independence<br />Chapter 4: random variables<br />Chapter 5: continuous random variables<br />Chapter 6: jointly distributed random variables<br />Chapter 7: properties of expectation<br /><br />Chapter 1-2 basically reviews high school probability stuff, such as combination, permutation and a few classic example questions. Very friendly for all students from different programs to fit in. Another great part is that chapters afterwards all begin with something we already learned in high school and gradually go deeper. But I would say that they are still quite understandable and fun. So generally speaking, the content is well-structured and friendly for all.<br /><br />Assignments:<br />5 assignments accounting for 15% of the grade. each has around 17 questions( fill in blank, multiple choice)<br /><br />These assignments allow you to type in answers many times( almost too many). One assignment usually takes around 3 hours( you guys definitely can do better than me Haha) , so it's important to start early and spend some time reviewing. As for difficulty, I'd say its reasonably difficult. Usually it's not sth you can't figure out but it requires precision and careful calculation. You can usually get full marks if you spend time on it.<br /><br />Attendance: <br />Accounting for an extra 5% in total grade. It is highly recommended to attend the lecture.",
            "comment_teaching": "The instructor ACTUALLY sent reminders to us if we hadn't finished assignments a few days before ddl. This really prompted me to fight procrastination and finished the task on time. This might be embarrassing, but it's working.<br /><br />Teaching is very detailed and most of the time your question in the zoom chat box will be answered right away. <br /><br />btw, 1.5 speed for zoom recording is great :)",
            "comment_grading": "Assessment Scheme:<br />Two assessment scheme:<br />1.<br />15% assignments<br />30% mid-term<br />55% final<br /><br />2.<br />15% assignments<br />0% mid-term( in case your can't attend midterm)<br />85% final<br /><br />The final grade= max{ assessment 1, assessment 2} + 5% attendance <br /><br />This grading scheme saved my life.<br /><br />My midterm scored 0 because I sent my cheat sheet as answer during mid-term... And it was not until final exam that I found my scanner app malfunctioned. Thankfully, I scored high in final exam and got an A+. But this was just far too thrilling and risky...<br /><br />The grade distribution seems not accessible, so I might just post midterm and final's score information here.<br /><br />midterm:<br />Min: 33.&nbsp;&nbsp;&nbsp;Max: 100<br />1st quartile: 75<br />Median: 87<br />3rd quartile: 94<br /><br />final exam:<br />Min:0&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Max:110<br />1st quantile: 51.75&nbsp;&nbsp;<br />Median: 79<br />3rd quantile: 93<br /><br />Overall the grading is good. In retrospect, one reason is that current exam format is very friendly. The midterm and final are all long questions involving only calculation. This requires comprehensive understanding of material and careful calculation but it's not that challenging.",
            "comment_workload": "Relatively light working load（only for online-teaching mode I guess), you spend around 3 to 4 hours a week for reviewing and practicing, and more practicing few days before exam and you will do just fine.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sCa6FyI6MWGdpBaxsPRg3Dig392LKmz0",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1202,
                    "name": "XIA, Dong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "joskkk",
            "date": "Jan 18, 2021",
            "title": "",
            "comment_content": "Chap 1 Combinatorial analysis (~3 hours) <br />(i) Basic principle of counting; (ii) Permutations; (iii) Combinations; <br />(iv)Binomial and multinomial theorems ; (v) The number of integer solutions of equations. <br />• Chaps 2 and 3 Axioms, Independence and Conditional probability (~6 hours) <br />(i) Sample space, events and some set notations; (ii) Unions and intersection of event; <br />(iii) Laws of events; <br />(iv) Definition and properties of probability; (v) Probability of events in the sample space with <br />equally likely outcomes; <br />(vi) Conditional probability, and independence of events; (vii) total probability and Baye’s <br />theorem <br />• Chaps 4 and 5 Random variables and Probability distributions (~10.5 hours) <br />(i) Bernoulli and Binomial random variables; (ii)Poisson random variable and Poisson <br />process; <br />(iii) Geometric, Negative Binomial and Hypergeometric random variables; (iv) Distribution of <br />a function of a discrete random variable; <br />(v) Uniform, Exponential, Normal random variables; (vi) Normal approximation to the <br />Binomial and Poisson distribution; (vii) Gamma, Beta, lognormal random variables; (viii) <br />Distribution of a function of a continuous random variable. <br />• Chap 6 Joint distributions of random variables (~10 hours) <br />(i) Marginal pmf and Marginal pdf; (ii) Distribution of a function of two or more random <br />variables; (iii) Independence of random variables; <br />(iv) Sum of independent random variables; (v) Central limit theorem; (vi) Conditional <br />distributions, conditional pmf, and conditional pdf. <br />• Chap 7 Expectation and Moment generating functions (~5 hours) <br />(i) Covariance and correlation; (ii) Variance of sum of random variables; (iii) Conditional expectation and conditional variance; <br />(iv) Moment generating function • Chap 8 Law of large numbers (~1.5 hours)",
            "comment_teaching": "The professor is really nice.<br />He explains almost every details of the material he prepared for the class.",
            "comment_grading": "Two schemes for grading:<br />Assessment 1 Assessing Course ILOs<br />15% Assignments 1,2,3,4,5<br />30% Mid-term Test 1,2,3<br />55% Final Examination 1,2,3,4,5<br /><br />Assessment 2 Assessing Course ILOs<br />15% Assignments 1,2,3,4,5<br />0% Mid-term Test (in case the student cannot <br />attend the midterm)<br />1,2,3<br />85% Final Examination (in case the student <br />cannot attend the midterm)<br />1,2,3,4,5<br /><br />Also 5% bonus for attendance.<br /><br />My midterm is a little bit below mean but my final is 93 which is exactly 3rd quantile, with max110 mean 72.5, then I got an A. So I think the grade is pretty good.",
            "comment_workload": "Homework is easy to get full scores but if you want to have satisfactory scores for mid and final, practice is necessary. Prof. will upload many exercises , don't worry.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ACPDwjtZbxbgLz4BxytZfKI9QaO3Vt4v",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 959,
                    "name": "BAO, Zhigang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gio",
            "date": "Dec 22, 2018",
            "title": "hard or easy？",
            "comment_content": "課不難 至少前半部分不難<br />這個課的難度分佈不太好 <br />midterm後難度變大 <br />前面是簡單的possibility 高中學過<br />後面就比較難了<br />從一個random variable的possibility <br />到多個random variable的 possibility<br />還有就是lecture note非常的多 如果想不上課自學很難",
            "comment_teaching": "Baozhigang還是講得很好的 上課會有很多例子 半個小時左右會有一個五分鐘break<br />但是不太好的一點就是講課太寬了 <br />經常會以為在說2431 honour 跑題是常有的事 <br />出席率在midterm後不知道為什麼大幅下降了 每次就十來個人 但是還是講得很認真",
            "comment_grading": "還不知道 不過今年有一個midterm0% final 85%的選項",
            "comment_workload": "5個assignment 不算很大 但是需要花功夫",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "x82uefcVD4cB4EeUtnDr9KTeRAP5VP8y",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 959,
                    "name": "BAO, Zhigang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "vicknt",
            "date": "Jun 01, 2018",
            "title": "",
            "comment_content": "The content was well organized, the only problem is that the professor didn't manage to cover all of it.",
            "comment_teaching": "Prof. Bao teaches this course for the first time, and I would say he did a good job. He was patient and willing to provide extra help if you have any puzzles. His teaching assistant Mr. Han Ruijian was very helpful as well.",
            "comment_grading": "I made some stupid mistakes in midterm exam and fell below mean. Though my final grade was OK (more than 1 SD higher than mean) I still got B+ only. The grading is fair but personally, I would not say it is super lenient.",
            "comment_workload": "The workload was fair and appropriate. Attending the lectures is not a must but I would still say, at least for me, the efficiency is higher than self-studying.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bkaPl5ys9hJ7Z07KKHf6fgKAIImtc0GM",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 959,
                    "name": "BAO, Zhigang",
                    "rating": 1
                },
                {
                    "id": 1063,
                    "name": "HAN, Ruijian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YL",
            "date": "Dec 25, 2017",
            "title": "",
            "comment_content": "轉左Prof，所以教既內容同Yu Chi Wai教既有啲分別，起碼唔洗學畫graph。<br /><br />1. Combinatorial analysis<br />2, 3. Axioms, Independence and Conditional Probability<br />4, 5. Random variables and probability distributions<br />6. Joint distributions of random variables<br />7. Expectation and Moment generating functions",
            "comment_teaching": "Prof第一堂講明你識既話可以走堂。<br /><br />佢教既方式都係跟leature notes教一次，無咩特別，而TA教得好好。<br /><br />另外一提，Prof第一年教呢個course，但其實佢好有heart，exam period特登整個final review。",
            "comment_grading": "Math離講係好好grade。<br /><br />Overall高mean幾分 --&gt; B",
            "comment_workload": "五份assignment，每個大topic一份。",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "U3AmkkkifFRgw6UeuLCd4rtoAUuHsQzz",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MathYear3",
            "date": "Jul 25, 2015",
            "title": "",
            "comment_content": "2字頭既math，哩個我諗算係最難個幾個<br /><br />Calculation 個part如果你有讀2411既話就唔算難，但係證明既題目對loacl黎講真係難，好多時你要背曬唔同既distribution之間既關係之後先會諗到佢D prove點做",
            "comment_teaching": "yu chi wai會keep住用一個死老豆既tone教書，但其實佢私底下好講得笑，你去問野佢都會用一個好funny既tone答你<br />最正就係只要你肯去check卷，佢就會加分比你",
            "comment_grading": "踩mean有b-，above 1 sd有a range，所以math黎講真係幾好grade",
            "comment_workload": "yu chi wai 好hihi，專登整10%既in class assignment去叫你上堂，唔上就會冇左，但之後都係得midterm final，都唔算大workload",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "4wgSKH595g3GWNY9DtPsJwF9Op3Cwxw4",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "id@a",
            "date": "Dec 23, 2022",
            "title": "P(cutoff is generated by random.randint() ) = 100%",
            "comment_content": "combination stuffs<br />Different random variables<br />Joint distributions<br />Correlation and MGF",
            "comment_teaching": "somehow understandable teaching, but slides are not provided<br />btw he deleted all files in canvas BEFORE exam<br /><br />Also, his notes is written in a funny way that you cannot ctrl+F and highlight anything :)",
            "comment_grading": "30% HW<br />60% Final<br />10% Participation<br /><br />HW:<br />2 HWs, so each dominates 15%.<br />HW is not difficult at all. And for any difficult questions in the homework, he gives hints in the lecture. <br /><br />HW1 median: 96%<br />HW2 median: 75%<br /><br /><br />Final:<br />The final exam is quite extreme, with two very difficult questions, with the else very easy. I suppose getting high in this exam requires clear intuition and understanding about RVs.<br /><br />edit: and very unreasonable marking<br /><br />Median: 24%, because of the marking<br /><br />Participation:<br />Attend all the lectures, and be careful when answering the questions, that's all. <br /><br />Median: 5/6<br /><br />Median: 48.3<br />UQ: 64<br />Me: 63.2<br />Grade: Not yet released, getting a B+ I guess<br /><br />edit: B lol<br />nice job ycw<br />For me, it is not too unfair because it is just one subgrade lower than my prediction<br />but it is quite unfair that 66 = B+ and 61 = B-<br /><br />I wonder what is the grade for median, C or C-?<br /><br />edit: grade revised<br />B -&gt; A-<br />below uq still have A-, quite nice <br />but not sure whether it will still be that nice next time",
            "comment_workload": "Quite low, just 2 HW, each may take you ~2 hr",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 5,
            "attachments": []
        },
        {
            "hash": "f1Dpti1c4HnQ58XyrQHCQX8XTueVerOE",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1202,
                    "name": "XIA, Dong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wantgoodgrade",
            "date": "Sep 04, 2021",
            "title": "Good grade course",
            "comment_content": "Chapter 1 : Preliminary<br />Chapter 2 : Probability<br />Chapter 3 : Random Variables and Probabilty Distributions<br />Chapter 4 : Joint and Conditional Probability Distributions<br />Chapter 5 : Covariance, Correlation, and Moment Generating Functions",
            "comment_teaching": "the teaching is good. Prof Xia is willing to answer students' questions patiently and explain questions in detail.",
            "comment_grading": "the grading is very good. <br />I got 104/110 in final exam and result in A+.<br /><br />I have asked many people. B range is very large. If you pay some effort, your grade won't be bad. Some exam questions are quite similar to past exam questions. Just do the supplementary exercises and pastpapers and you'll thank me soon.",
            "comment_workload": "the workload is reasonable. Just a few homeworks. However, quite much time is needed for revision in order to complete the homework questions",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YsXAWXc3Q5j0ksemFIefXsASe6OHeVyw",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1202,
                    "name": "XIA, Dong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "0 and 1",
            "date": "Jun 07, 2021",
            "title": "先上2421 再上2411",
            "comment_content": "看其他review。<br />前六章内容都還算輕鬆，只要calculus 學的夠好就沒什麽問題。<br />一些distribution 要記。<br />第七章難度明顯提高，不過只講一部分。<br /><br />如果你想按照難度從低到高選課，2421一定要在2411前面選。我學完2411后 2421幾乎一半的課都不用聽了。<br /><br />聼 Prof. Jing Bing Yi 說，這門課教得淺，有academic 追求的大佬可以選 2431 或者5411",
            "comment_teaching": "Xia Dong 講的挺慢挺細的，就是要化一段時間習慣他的英文發音。<br />看slides 就夠了，lecture note 沒什麽必要。<br /><br />attendance 是有bonus 的，所以沒什麽事就正常去上課吧。",
            "comment_grading": "看其他review。<br />Xia Dong 給的題難度會有，不過總體不大，注意不要算錯。<br />Midterm 和 Final 的 cheat paper 都不能超過兩張四頁A4 紙，不過考試的時候沒見TA檢查過。保險起見，Final 的cheat paper 推薦記不同種類的distribution 和一些難記的公式。<br /><br />最後拿了A+",
            "comment_workload": "5個作業，每個作業在due 之前有20次機會。<br />比較喜歡這種作業模式。提前兩三天做一遍，最後一天把錯題過了。<br /><br />workload 不算特別少，但非常高效。",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "lwON0ukmYgUsIwh6qJkPiB87JNvlmpSk",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "frankcs",
            "date": "Jun 02, 2018",
            "title": "",
            "comment_content": "1.&nbsp;&nbsp;&nbsp;&nbsp;Basic principles of counting <br />2.&nbsp;&nbsp;&nbsp;&nbsp;Probability<br />3.1&nbsp;&nbsp;&nbsp;&nbsp;Discrete Random Variables and Discrete Probability Distributions<br />3.2&nbsp;&nbsp;&nbsp;&nbsp;Continuous Random Variables and Continuous Probability Distributions<br />4.&nbsp;&nbsp;&nbsp;&nbsp;Joint distributions of Two or more random variables<br />5.&nbsp;&nbsp;&nbsp;&nbsp;Moment generating functions<br /><br />Contents before midterm are almost identical to math2411. only need to review one of them if you take those in the same term (or don't review both, doesn't really matter). Final is a bit harder. Just try to start reviewing a bit earlier ( e.g. not the night before the final exam TT), otherwise everything should be fine.<br /><br />Pretty good course overall.",
            "comment_teaching": "Teaching performance: so-so<br />Notes are not bad. Lots of sample questions( without answers. Gives solution in class) and strange animate icons. The professor gives you a hardcopy of notes if you come to class --&gt; saves printing budget.",
            "comment_grading": "Assignment:&nbsp;&nbsp;&nbsp;&nbsp;10%<br />Mid-term:\t35% (0%)<br />Final Exam:\t55% (90%)<br /><br />Midterm: <br />The highest score: 60/60<br />The median score: 34/60<br />The lowest score: 13/60<br /><br />Final: <br />mean: 31.03/80<br /><br />Me: <br />assignment: 100%<br />midterm: 57/60<br />final: 41.5/80 (thought I would get 60 something. turns out to be fucked up. I guess the TA was in bad mood QQ.<br />overall: 71.78% --&gt; A-<br /><br />Grading is not bad.",
            "comment_workload": "3 problem sets. not really hard. every one gets full marks.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "44UpNSxk7ncGD27etzo67o5kYUDthoNJ",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "數學研究生",
            "date": "May 31, 2018",
            "title": "Easy Mid-term, Difficult Final Exam",
            "comment_content": "The content is almost the same with what the other students said. So, I will not talk too much about it. But I want to point out that Chapter 4 and Chapter 5, the last two chapters are really hard and need to use more time to study and focus on. Chapter 4 is about the two random variables, the joint pmf,pdf and marginal pmt, pdf. Those kind of different combination things. You should have basic skills on multivariable calculus so as to understand and know how to integrate the functions.",
            "comment_teaching": "Professor used powerpoint and notes to teach the students. Normally, he uploads the notes to his webpage. You can find the notes and assignments there. I suggest you print out the notes since there are a lot of spaces that are empty, maybe the instructor wants the students join the lectures and write those things down by themselves. So, don't miss and lessons. Once I was sick I still got back to the school for his lesson.",
            "comment_grading": "I don't think the grading is good. Since it is normal for students to do much better in the mid-term exam than the final exam.<br /><br />In this semester, the mid-term exam just included basic probability and different distributions(Poisson, Binomial, Normal, Negative Binomial, Geometric). So, most of the students can do it well. As well as the instructor provided the formula sheet for the students and you can create your own cheat sheet at the same time, so this helped students need not to remember the distribution functions by themselves.<br /><br />After the mid-term exam, as I said before, the main character will be the Two or More Random Variables. The general concepts are not difficult to understand but I think there are not enough examples to let students digest what is going on. I suggested you have to do the questions by yourself and check the solutions. Since those solutions have been provided.<br /><br />As I heard that, staying at mean can get a B-/C+. Fewer students get B-, much more students get a C+. So, I don't think the grading is good.",
            "comment_workload": "I think not really hard, only 3 assignments need to be handed in. But some of the questions you can find out in the notes or past paper. So, I think one to two hours will be enough for an assignment. And usually, the instructor released the homework a month before the deadline, I believe the time should be enough for you to do it.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6mSQMPi5JcB1YMBT28mkEqG4mXi6XMG1",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 959,
                    "name": "BAO, Zhigang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bbbbb_bbbbbb",
            "date": "Jan 24, 2018",
            "title": "",
            "comment_content": "Chap 1:&nbsp;&nbsp;Combinatorial analysis<br />Chaps 2 and 3 :Axioms, Independence and Conditional probability<br />Chaps 4 and 5: Random variables and Probability distributions<br />Chap 6: Joint distributions of random variables<br />Chap 7: Expectation and Moment generating functions<br />Chap 8: Law of large numbers<br /><br />the content before midterm is easy and similar to the content of MATH 2411.<br />After midterm, the content is more difficult",
            "comment_teaching": "professor is quite good. Very patient to teach us and answer our questions.",
            "comment_grading": "Assessment Scheme 1<br />10%&nbsp;&nbsp;Assignments<br />35%&nbsp;&nbsp;Mid-term Test<br />55%&nbsp;&nbsp;Final Examination<br /><br />Assessment Scheme 2<br />10%&nbsp;&nbsp;Assignments<br />0%&nbsp;&nbsp;Mid-term Test (in case the student cannot attend the midterm)<br />90%&nbsp;&nbsp;Final Examination <br /><br />The final grade=max{ Assessment 1, Assessment 2}<br /><br />overall mean 6x/100 = B",
            "comment_workload": "there are 5 assignments<br />each assignment is to do one chapter's exercises and have around 2x problems to solve.<br /><br />not too much workload for a 4-credits course and have enough time to finish.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "PagqOWBugfEWxJTLTMHX1Hs6M2fhdAa3",
                    "name": "Syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "mJvLBi2WUJavW8qlRbBn3FHcA4ECiUhP",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 959,
                    "name": "BAO, Zhigang",
                    "rating": 1
                },
                {
                    "id": 1063,
                    "name": "HAN, Ruijian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MEMENTO",
            "date": "Dec 20, 2017",
            "title": "",
            "comment_content": "The contents are as following:<br />1. Combinatorial analysis<br />2, 3. Axioms, Independence and Conditional Probability<br />4, 5. Random variables and probability distributions<br />6. Joint distributions of random variables<br />7. Expectation and Moment generating functions",
            "comment_teaching": "I was a bit disappointed about the lecturer, because the lecture was not much different from the lecture notes. Therefore, this means that I could self study in this course, and catch up all the content materials. However, the lecturer's pronunciation is quite good, and the lecture note is very clear.",
            "comment_grading": "Grading is very moderate. <br />10% Assignments<br />35% Midterm<br />55% Final<br />or<br />10% Assignments + 90% final<br />The midterm was extremely easy, with the mean of 94.16 and sd of more than 6. The final was relatively difficult compared to the midterm, with mean of 47.48. <br />The total mean is 68.33, and I got A with overall 1.1sd above mean. This is very good grading.",
            "comment_workload": "The workload is actually quite a lot, because there are 5 assignments in total, and the last two assignments are very long. You should not procrastinate with the assignments if you want to get good mark on those. Also, doing the assignments really helps in understanding the concepts.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ljuF1pPZ1GDQpzP0S9ZC2jNsnMIWZACQ",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 543,
                    "name": "LING, Shiqing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Audrey",
            "date": "Dec 30, 2015",
            "title": "",
            "comment_content": "first 1/3 similar to 2411, but the focus is on concept and proof, not examples or calculation.<br />later talk about joint/marginal/conditional distribution, need 2023 knowledge. comb through the logic and it should not be hard. then moment generaint function, this part quite useful.<br />this semester the professor taught a bit faster than before so as to add the WLLN/SLLN/CLT in the last chapter.&nbsp;&nbsp;A bit harder to understand, but this is the essence of probability theory right? Try to think about it more. Will be helpful in PG courses.",
            "comment_teaching": "Errrr```This professor has terrible accent...I cannot hear him clearly, nor can I focus at all. He did not explain the examples enough, just read it, not leading us through the thinking process. So mostly it is just a self-taught course then.",
            "comment_grading": "2 quiz, 1 midterm, 1 final. attendance enough to get 2% extra. the quiz and exam are standard.",
            "comment_workload": "4 sets of homework no need to hand in. <br />It has 'questions not from textbook' and 'questions from textbook' part. Some of those not from textbook are quite difficult but you can try to do it on your own, for your benefit. Exam most likely those 'from textbook'. But no need to buy or read the textbook.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "phcQLsznW3clVstcqwr5VzFuKk1c4ckD",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "read_homo",
            "date": "Aug 19, 2015",
            "title": "Self Study is the most important for this course",
            "comment_content": "The teaching material for this course is mainly about characteristics of different continuous or discrete distribution. Personally, I think it is relatively easy comparing to Multivariable Calculus. All you need to do is just understanding the proof shown in the lectures. And If you like statistic, this course will definitely make you very excited. But if you dislike statistic, then I recommend you not to take this course.",
            "comment_teaching": "His teaching approach is just reading out the lecture notes and writing some important equations for at least 1/3 of the lesson. However, those notes you have written down help you to remember the proof and logic, which are beneficial to your exam. As the other commentary said, checking paper is a good way for you to have a higher mark. Try to write steps for every questions since those steps are the key for a sub-grade.",
            "comment_grading": "His grade is comparatively better than other maths professor. For me, I would say his grading is fair. This Professor seems quite hard to get a A+.",
            "comment_workload": "He used in-class assignment as a way to take attendance. But you can use his lecture notes to deduce when will he approximately give out in class assignment. As I said, try not to skip any lectures. Apart from assignment, this course only needs mid term and final. You can skip mid-term if you think you are confident about your ability.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "M7WHb3RasmdXELNS6a9ghZ8m7XH2Ktpc",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 901,
                    "name": "WANG, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Dc528",
            "date": "Dec 15, 2021",
            "title": "Funnier than 2411",
            "comment_content": "Chp.1 (Just approach of Counting)<br />Principle of counting<br />Permutations<br />Combinations(C)<br />Multinomial Coefficients (New notation of C)<br />Number of Integer Solutions (Application of C)<br /><br />Chp.2 (Mostly learnt in 2411)<br />Sample Space and Events<br />Operations on Events<br />Axioms of Probability<br />Prop. of Probability<br />Sample Spaces having the equally likely outcome<br /><br />Chp.3 (Mostly learnt in 2411)<br />Conditional Probability<br />Total Probability<br />Bayes'THM<br />Independence<br /><br />Chp.4 (I) (Mostly learnt in 2411)<br />Random Variables (R.V.)<br />Discrete R.V.<br />Expected Value<br />Expectation of a function of R.V.<br />Variance(Var) and Standard Deviation(s.d.)<br />Discrete R.V. from repeated trails (Some distributions of Bernoulli R.V.)<br /><br />-------After MT<br />Chp.4 (II) (Just some props.)<br />*Poisson R.V.<br />Hypergeometric R.V.<br />Expected Value of Sum of R.V.<br /><br />Chp.5 (~Continuous versions of R.V., just some props.)<br />Probability Density Functions <br />*Uniform, Normal, Exponential, Gamma, Beta, Cauchy Distribution<br />*Approximation of Binomial R.V.<br />**Functions of a continuous R.V.<br /><br />Chp.6 (Why you need Math2023: R^2 Integration)<br />Joint Distribution Func. <br />**Independent R.V.<br />Sum of Indep. R.V.<br />**Conditional Distributions<br />**Joint Distribution of a function of 2 R.V. (~changing parameters when you do integ. in Math2023)<br /><br />Chp.7 (Things go messy here)<br />*Expectation of Sum of R.V. <br />**Covariance, variance of sums and correlations<br />**Conditional expectation<br />Conditional Variance<br />**Moment Generating Functions (Unique Transformation ~Laplace Transformation)<br /><br />There is a chp.8 but just spent 1 lesson and not examined.",
            "comment_teaching": "I think Prof. Wang's teaching is not bad, a kinda good accent that you can clearly hear what she is talking about, and she's friendly.<br /><br />But&nbsp;&nbsp;I think there is an inappropriate allocation of time, she spent too much time at the beginning where the content is quite easy, and she couldn't teach all the content in the schedule as a result.",
            "comment_grading": "Weighing:<br />Webwork 15% (μ ≈ 95%, but you can get full as 20 trials provided for each)<br />Midterm&nbsp;&nbsp;35% (μ ≈ 85%)<br />Final&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;50% (μ ≈ 62%)<br /><br />Cutoff:<br />A+&nbsp;&nbsp;[95,100]<br />A&nbsp;&nbsp;&nbsp;&nbsp;[90,95)<br />A-&nbsp;&nbsp;&nbsp;[85,90)<br />...<br />C&nbsp;&nbsp;&nbsp;&nbsp;[60,65)<br />C-&nbsp;&nbsp;&nbsp;[50,60)<br />D&nbsp;&nbsp;&nbsp;&nbsp;[40,50)<br />F&nbsp;&nbsp;&nbsp;&nbsp;[0,40]<br />You get mean, you get B, so I'll say good grade<br /><br />Some tips:<br />You can easily get A range if you have done: <br />all the examples on lecture notes( )<br />Chapter exercises provided by prof ( ) (Not much, ~7 questions each chp.)<br />Examples on Tutor notes ( ) (Not much)<br /><br />For Midterm: Basically, all the materials are covered, but all questions are computational this sem. Also, the MT weighs a lot (35%)<br /><br />For Final: The covered content is not cumulative, the questions asked are denoted by * above, those denoted by ** are questions I guess gonna be asked, year over year(Don't blame on me if I mistipped), contain some easy proof like test if independent.<br /><br />Cheatsheet (2-sided A4) is allowed in both MT and Final",
            "comment_workload": "5asm in 1sem, each contains ard 20questions and costs around <br />2hrs<br />You don't need to have much revision until the last month, very chill<br />No attendance needed",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YLsjU0FYFvIWCnNt4ENCqf0leg6bZa3d",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "NightShade",
            "date": "Aug 26, 2015",
            "title": "Self study is vital, but oh dear, you can't skip lectures",
            "comment_content": "Rich (in proofs). Easy in the beginning. Notes are sufficient but have too many fill in the blanks. So while you're blindly copying from the board, you're wasting precious hours. If you miss the lectures you may not only have to google the difficult-to-find answers, but may also miss the in-class assignments (2% each) which should be outlawed from grading since the answer is given in the classroom (basically surprise attendance).",
            "comment_teaching": "The prof is a good person, for he easily increases your score during paper checking and sympathizes with your unfortunately humongous schedule. However, his teaching is lackluster, dispirited (since he is prone to mumbling to an audience) and limited to writing on the whiteboard that which could have simply been filled into the notes. But you don't have an option to take another prof as long as you take this course in spring.",
            "comment_grading": "Since there is no homework enforced, if you lack the motivation to practice yourself, your grades will plummet. Naturally! But if you practice, it pays.<br /><br />The mean is around 50-60% (C range)<br />SD is around 20",
            "comment_workload": "Extensive and heavy, only if you have never done it before and have to do it yourself. And practice proofs and derivations more than anything else. By the end, you'll realize how easy a course this was if only it had been taught better. So yea, the workload really depends on your level of logical understanding.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JLeaPVXiI9szLE0DM4mQJmV0JdSjex7s",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 901,
                    "name": "WANG, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rind",
            "date": "May 25, 2022",
            "title": "",
            "comment_content": "- Basic Probability Theory<br />review of something covered in 2411<br />- Discrete R.V. distributions<br />pmf, cdf of: Bernoulli, Binomial, Poisson, Negative Binomial, Geometric<br />- Continuous R.V. distributions<br />pmf, cdf of: Uniform, Normal, Cauchy, Beta, Gamma<br />- Joint Distribution<br />Joint cdf, pdf, pmf. Change of Variable, Conditional Distribution, Marginal Distribution.<br />- Moments<br />Formula for calculating different moments: Expectation, Variance, Covariance<br />Moment Generating Functions<br /><br />The hardest thing is this course should come from understanding the meaning of each term and what is it referred to. For example, I am very confuse with the terms &quot;Distribution Function&quot;, &quot;CDF&quot;, &quot;PDF&quot; and &quot;PMF&quot;. It takes some time to understand their difference.",
            "comment_teaching": "I did not attend to any lecture.<br />The lecture notes are quite good, providing enough examples and clear explanations. I can clearly understand every step by reading the annotated lecture notes only.",
            "comment_grading": "The grading scheme:<br />Homework 15% (3% for each homework, everyone should get full mark besides those start late/miss the deadline like me :D)<br />Mock Midterm 1%<br />Midterm 34% (mean: 70.27, sd: 14.69)<br />Final 50% (mean: 68.18, sd: 17.03)<br /><br />Since there are rumours about the compulsory testing in HK, professor decides to make the midterm exam optional. The grading scheme takes the higher from the following:<br />Scheme 1: 34% midterm + 50% final<br />Scheme 2: 84% final<br /><br />This course is absolute grading. However, professor lower the cut-offs by 5%. I guess it is because of COVID situation and a lower mean compared to previous offerings. The new grade cut-off will be 90% for A+, and the course mean: 70% can give you an B grade. Professor claims that she gave out 30% A-range last year. I think she is also very lenient in this offering.",
            "comment_workload": "5 Homework, you should be able to finish them all within 1 day for each one, everyone get the same set of questions.<br /><br />The midterm exam being optional this year, but the difficulty is relatively low (this reflects from the high mean). It tests on the topic for basic counting, permutations and probability, also some part of the discrete R.V.s.<br /><br />The final exam is not cumulative. Some of the questions basically come from the lecture notes but with some modification. Therefore, study all examples in the lecture notes will be the most important.<br /><br />Knowledge in MATH2023 is applicable in the joint distribution part because you have to do double integrals and change of variables. Her notes is detailed enough to cover all the necessary techniques for this course.<br /><br />Personally, I study 2 days before exam and feel ok with the exam paper, the difficulty is comparable to examples in lecture notes.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gUeeNOJypsNRMMnksT0LBTRWT5rwxJ8J",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 901,
                    "name": "WANG, Ke",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Qwerty233",
            "date": "Dec 13, 2021",
            "title": "",
            "comment_content": "- Not good but better than 2411<br />- Focus on computation instead of theory<br />- Didn't cover law of large number and central limit theorem",
            "comment_teaching": "She's nice but her teaching is not good so I didn't attend the&nbsp;&nbsp;lectures after week 2. However, the lecture notes are self-contained and easy to self-study. Also, I think that she has improved her teaching skills after the midterm. She's much better than YCW.",
            "comment_grading": "Grade god!<br /><br />Assignment 15% Midterm 35% Final 50%<br />Most ppl got full mark for assignments.<br />Mean: (midterm, final) = (83/100, 86/140)<br />95~100 -&gt; A+, 90~95 -&gt; A, 85~90 -&gt; A-, ...<br /><br />The exam questions are easy and typical. Unlike other math courses, you don't need to be smart/creative to get high mark. Hard work pays off.",
            "comment_workload": "5 assignments on canvas. On average 10 questions each. Max 20 attempts. Skip all classes and use the time to self study should suffice.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "dj8mL4bSs2QueEdn4pZGQHSCrwElc8TY",
                    "name": "Textbook-1",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "kTFToboiAW0IHjR1IKALDitmhPHiFhld",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Chino2",
            "date": "Dec 29, 2022",
            "title": "",
            "comment_content": "The course is basically introduction to 3 dimensional space before midterm without calculus. Midterm is just asking us to find the shortest distance with dot and cross product. Final is shit af with 10 mc count for 30/66.<br />The content should be good in other year but the instructor this year ruined it.",
            "comment_teaching": "No comment, as what Dr.Ho said to his final",
            "comment_grading": "Quite fair. Around 60% for a B",
            "comment_workload": "Just a presentation homework which is stupid af. As long as you read ff’s notes instead of Dr.HO’s colourful notes, you can get a fair grade.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "Pcgr1R0LW5cSHiV8Qln6vtMpy0hbuTFA",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cdbn",
            "date": "Jun 08, 2017",
            "title": "",
            "comment_content": "这门课的主要内容:<br />midterm前 (discrete):<br />- permutations，combinations<br />- inclusion-exclusion<br />- multinomial theorem<br />- conditional probability<br />- independence of RV<br />- law of total probability<br />- baye’s theorem<br />- PDF, CDF, expectation, variance<br />- discrete distributions（bernoulli，binomial，poisson，geometric，negative binomial）<br /><br />midterm后 (discrete + continuous):<br />- discrete distributions（hypergeometric，multinomial）<br />- continuous distributions（normal [multivariate] + normal approximation，gamma，exponential，beta，uniform，log-normal）<br />- distribution of function of continuous RV<br />- joint PDF，CDF<br />- conditional PDF，CDF and conditional expectation<br />- independence of RV (in terms of PDF)<br />- skewness and kurtosis<br />- distribution of real／vector valued function or RV<br />- central limit theorem<br />- covariance，correlation, variance of sum of RV<br />- moment generating function （核心部分）<br /><br />乍看之下，这门课的内容有很多，但其实midterm前有很多内容是在其它课上过了的（例如COMP 2711，MATH 2343，MATH 2411），因此对于CS的童鞋，有些内容可能会学3遍。不同的是，作为统计学／概率学第一门教得比较深入的课（我不会把MATH 2411归类为统计学课，它只是一门教公式＋计算的课），从discrete到continuous到moment generating function，这门课更着重于证明（虽然有时并不太严谨），也让我对概率学有了更全面的认知。因此，强烈建议CS的童鞋们直接waive掉MATH 2411去上这门课。<br /><br />教授的笔记有很多部分都是要填空的，所以建议童鞋们去上课。还有教授有时会给一些能得bonus分的in-class question，所以不上课的话就无法得到了。<br /><br />希望这门课的教授会跟MATH 2411和COMP 2711的教授讨论和重整这三门课的内容，因为实在有不少重叠之处。这样就能分配更多时间到midterm后的核心内容。",
            "comment_teaching": "没上过课，但在paper checking时跟教授沟通了一下，感觉上很亲切和关心童鞋。<br />（paper checking是一对一的，midterm的paper checking时他还逐个童鞋问会不会double intergral）",
            "comment_grading": "midterm: mean 30.5/60，SD 13.2，highest 58<br />final: mean 47.7/90，SD 21.6，highest 83 （有3个得80以上）<br />total: mean 57.3，SD 18.2<br />本人: assignment 全满，midterm 58，final 75，total 89.7 —&gt; A+<br /><br />虽然考试能带cheatsheet，但这不算是一门适合抱大腿的课，因为materials不少，而且midterm后都是大家不熟悉的，所以要在短时间内吸收并不容易。",
            "comment_workload": "共4份，而且都不难，基本上mean都接近满分。",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 13,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cH1xu7uXu2ssqoSs6P2H8nlKTbvgz7az",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Cecily",
            "date": "Nov 30, 2019",
            "title": "",
            "comment_content": "At the beginning, the content is much easier about random variable and probability.<br />After midterm, most of the course is about proof.",
            "comment_teaching": "It is normal as he won't upload any hand writing note, so you must attend the class.",
            "comment_grading": "It is poor. Because the question you saw in the examination is totally different with his teaching. It is much hard then u learn.<br />I just get D as my midterm and final is lower than 1.x sd.",
            "comment_workload": "It only have 3 or 4 assignments. Not really difficult and it is similar with the question in the note.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}