{
    "error": false,
    "course": {
        "id": 2076,
        "subject": "MATH",
        "code": "2431",
        "name": "Honors Probability",
        "description": "This is an honors undergraduate course in probability theory. Topics include probability spaces and random variables, distributions (absolutely continuous and singular distributions) and probability densities, moment inequalities, moment generating functions, conditional expectations, independence, conditional distributions, convergence concepts (weak, strong and in distribution), law of large numbers (weak and strong) and central limit theorem. Some rigorous theoretical results in probability will be discussed.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2230,
            2130,
            2030,
            1930,
            1830,
            1730,
            1630
        ],
        "prerequisites": "(Grade A- or above in <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1014\" href=\"/review/MATH1014\" target=\"_blank\">MATH 1014</a>) OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1020\" href=\"/review/MATH1020\" target=\"_blank\">MATH 1020</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1024\" href=\"/review/MATH1024\" target=\"_blank\">MATH 1024</a>",
        "corequisites": "<a class=\"course-link\" data-subject=\"MATH\" data-code=\"2011\" href=\"/review/MATH2011\" target=\"_blank\">MATH 2011</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2023\" href=\"/review/MATH2023\" target=\"_blank\">MATH 2023</a>",
        "exclusions": "<a class=\"course-link\" data-subject=\"ELEC\" data-code=\"2600\" href=\"/review/ELEC2600\" target=\"_blank\">ELEC 2600</a>, <a class=\"course-link\" data-subject=\"ELEC\" data-code=\"2600H\" href=\"/review/ELEC2600H\" target=\"_blank\">ELEC 2600H</a>, <a class=\"course-link\" data-subject=\"ISOM\" data-code=\"3540\" href=\"/review/ISOM3540\" target=\"_blank\">ISOM 3540</a>, <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2421\" href=\"/review/MATH2421\" target=\"_blank\">MATH 2421</a>",
        "rating_content": 4.89,
        "rating_teaching": 4.44,
        "rating_grading": 4.22,
        "rating_workload": 3.33,
        "review_count": 9,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 959,
                "name": "BAO, Zhigang",
                "count": 8
            },
            {
                "id": 543,
                "name": "LING, Shiqing",
                "count": 1
            },
            {
                "id": 1353,
                "name": "WANG, Jingming",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "lpEhzZQbjNH0O0cSq9uvVr3sxWvaG1DY",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 959,
                    "name": "BAO, Zhigang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "iwantarange",
            "date": "May 23, 2019",
            "title": "A well-designed course",
            "comment_content": "Before midterm: covered most of the contents in MATH 2421, as mentioned by the instructor. This includes probability space, random variables, and distributions. Probability space and random variables will be discussed in a more concise language, using concepts like sigma-field for probability space and pre-image for random variables.<br /><br />After midterm: Generating functions and convergence in random variables, up to the strong law of large number this year. Martingale is not covered.<br /><br />This is a comprehensive course for a first course in probability. The instructor has tried to avoid the most rigorous approach and avoid using Lebesgue integrals as most of us haven't learned before, but that does not affect too much for the learning process. I would say the difficulty is just right for a more advanced year 2 student.<br /><br />Textbook: Probability and Random Processes (Geoffrey R. Grimmett and David R. Stirzaker)",
            "comment_teaching": "Professor Bao explains things quite clearly. However, if you don't have a good sense of probability or elementary analysis, you may think that his teaching pace is quite fast. He mentioned many extra content during the class, but most of them will not be tested, so those parts are up to your own interest.<br /><br />TA (Wang Jingming) is well-prepared for the tutorials and she explains things clearly. She is willing to help you if you encounter difficulties and try to seek her help.",
            "comment_grading": "Homework x6 10%<br />Midterm 35%/0%<br />Final 55%/90%<br />(2 schemes)<br /><br />Here are some statistics for reference:<br />Homework Mean: 85.7%<br />Midterm Mean: 67.92/100<br />Final Mean: 73.62/100<br />Course Total Mean: 75.79%<br /><br />Most students actually got a homework score higher than the mean (like around 90%). A course total of 86.4% (10/35/55 scheme) gives an A. (I think the A-/A cutoff is around 85%.) Professor Bao has said that he *may* give half of the class an A range, but I am not sure if this is really the case (probably 40~50% of students). I will say he is lenient on grades.",
            "comment_workload": "Content: Workload is not really high if you only consider the part to be tested. The extra materials are the real workload, but that's only up to your own interest.<br /><br />Homework: Relatively heavy workload, bi-weekly homework. Each homework has around 15 problems. If you understand the content, doing the homework does not waste much time. I cannot really follow the regular pace, so it takes me more time. Around 5~8 hours per homework.<br /><br />Exams are not as hard as homework this year. Just some standard questions. There is a rumour saying MATH 2431 is the hardest honors UG MATH course. For me, this is not true. MATH 2431 is mainly hard in terms of the great amount of content, while the honors analysis series is mainly hard in terms of the time and effort spent to solve a question.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bg4DZptFpGbJG9jNbuSIWPgTr6aXGO5p",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 959,
                    "name": "BAO, Zhigang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "UnconMarketeers",
            "date": "May 26, 2022",
            "title": "Rewarding but competitive",
            "comment_content": "Before midterm: A (relatively) modern point of view of probability, using the language of measure theory (Professor tries to avoid it, but...). <br /><br />Starting form probability space, the standard content like discrete/continuous rv, expectation, variance, common distributions (like uniform, poisson, normal...), (random) sum of random variables are introduced. Some classical examples like coupon collecting problem, buffon's needle, branching process are also introduced.<br /><br />After midterm: It makes the course exquisite! <br />From generating function and characteristic functions, a standard way to handle (finite) sum of random variables is developed. <br /><br />For infinite sum, many methodologies from real analysis reappear, but with different terms - Like those convergence modes. Many variants of WLLN and CLT, and a weaker version of SLLN are also introduced. <br /><br />Personal suggestion: One can take real analysis course, or self-learn real analysis before taking this course so that a clearer picture can be constructed. But if taking this course then take real analysis, this course also helps when encountering key topics like measure space, Borel-Cantelli lemma, convergence modes and so on.",
            "comment_teaching": "The professor's teaching is clear enough. The TA discusses some questions, probably mostly appeared in main textbook. It is worth mentioning that, the TA's English accent and delivery is outstanding, comparing with other TAs among all courses I have taken.",
            "comment_grading": "20% hw, 30% midterm, 50% final, or 20% homework and 80% final. <br /><br />A big thanks for having the all-in-final scheme! Around the midterm period I screwed up every single midterm I took because of having covid. <br /><br />The final score distribution speaks for itself that how competitive the course is (out of 100):<br /><br />LQ: 70, Median: 78, Mean: 75.5, UQ: 83<br /><br />What does it mean? Given that each&nbsp;&nbsp;&nbsp;subquestion worth 5 points, getting stuck in one question may make you drop from top 25% to top 50%, or from top 50% to bottom 25%! Also, from others' reviews, the mean of the past years was not that high...<br /><br />Given that this is an Honors course, and MATH2421 offers around 30% A range, I personally expect a more lenient grading distribution than MATH2421. Now (26/5) the grade is not confirmed.<br /><br />Update: I don't have sufficient data, but it seems that the distribution of letter grade is not as lenient as I expect for an honors course.",
            "comment_workload": "6 hws corresponding to each chapter. 10-18 questions for each problem set, adopted form textbook.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1cgKz7BagcadwdNf5uLP3C2kGV0bUgah",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 543,
                    "name": "LING, Shiqing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Little Guy",
            "date": "May 27, 2017",
            "title": "",
            "comment_content": "This course is completely different from MATH 2421. It takes a very theoretical approach and so the main focus is on understanding proofs rather than computation. The end goal of this course is to provide a rigorous proof of the weak and strong law of large numbers. <br /><br />Five chapters: <br />1. Distribution functions<br />2. Measure theory &amp; probability space <br />3. Random variables<br />4. Convergence of random variables<br />5. Law of large numbers<br /><br />Some basic concepts from measure theory are either taught/mentioned without proof in the first few chapters (eg. properties of Borel sigma algebras, Caratheodory's extension theorem). These knowledge are required in order to rigorously define the notion of probability space, random variables, independence etc.&nbsp;&nbsp;<br /><br />The main dish of this course lies in Chapter 4 &amp; 5. Chapter 4 talks about various types of convergence (convergence almost everywhere, convergence in probability, convergence in r-th mean) and Borel Cantelli Lemma. This is to prepare you for another up to 10+ theorems/lemma in chapter 5 that are used to build towards strong law of large numbers.<br /><br />Prerequisite knowledge: <br />It really helps if you are already familiar with the basic concepts in mathematical analysis (epsilon delta notation of limit, lebesgue measure, countability, continuity), otherwise you may find yourself spending a lot of time catching up.",
            "comment_teaching": "Ling Shiqing is always very passionate in teaching. He will always answer any question that you ask, no matter how fundamental/trivial it is. The only issue that I am occasionally uncomfortable with is his heavy accent.<br />Tutorials are helpful. You could learn a lot by just asking the TA about the mistakes in your assignments.",
            "comment_grading": "The midterm is open-book based, these problems are variations of the problems that you have seen in homework, or require a similar technique. <br />Final exam is closed-book, meaning you have to be extremely familiar with the 10+ proofs that were taught in chapter 5. <br /><br />Midterm: <br />Mean = 63.85 / 70<br /><br />Final: <br />Mean = 61.62 / 90",
            "comment_workload": "3 assignments. Each of it takes me an entire weekend to solve.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JVyVYlf8doWRvYMt5yezApreGBgl7iaU",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 959,
                    "name": "BAO, Zhigang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Squidgy",
            "date": "Oct 17, 2021",
            "title": "Good introduction course",
            "comment_content": "Actually I didn't intend to post here. But I found out that every year there's a review, and I don't want to break this tradition(?). Since I'm writing this review after months, I can't give precise content, just follow others if you want.<br /><br />Believe it or not, MATH2421 is quite trivial and you should reg this course if you are considering enrolling. 2431 has covered the entire content of 2421 a week after midterm. And you will found out that probability is not just calculating the chance of having a coin flips to head.",
            "comment_teaching": "Professor BAO is good at teaching, and he's also handsome.<br />Since we usually don't have some serious math background (Measure Theory), the rigorous proofs are omitted. I recommend you to take MATH2043 together so you will have a slightly better visualization of what's going on. The course started at 12pm so I was usually tired, which was the only disadvantage of the course.",
            "comment_grading": "Midterm: 85/100<br />Final : 81/100<br />Grade: A-<br /><br />The mean was around 50+ in midterm after including those who didn't attend( you can all-in final ). The original mean was like 70+ in both midterm and final, so still a quite competitive course.",
            "comment_workload": "Considering it's a 4 credits honors course , the workload is reasonable. 6 assignments, probably takes 1 to 2 days for each.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YHvSFM8AuTbeuD7eIToBs9Wsd0OEmY67",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 959,
                    "name": "BAO, Zhigang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lucien▪Evans",
            "date": "May 31, 2023",
            "title": "a rewarding course but quite difficult",
            "comment_content": "This term only covered half of the contents compared with previous years since Prof.BAO got COVID seriously a few weeks after midterm and suspended his excellent teaching after that.<br /><br />Before midterm, we learnt chapter1-4 and after midterm, Chapter 5 is finished and Chapter 6 are mostly left for self-study.",
            "comment_teaching": "Excellent!<br /><br />Everyone interested in MATH should try this course !<br /><br />I am not a student majored in MATH and always suffered in analysis. But following BAO's teaching, i really have a deep understanding in probability and it helps a lot in my future study.<br /><br />For a beginner, BAO's courses will provide you a good diagram in probability and they are not too abstract to be understood. However, it will still be difficult if you don't take his lectures and follow his teaching carefully.",
            "comment_grading": "Not as lenient as i thought considering it's a honor course. <br /><br />He said he would get 30% A range in the first lecture. But the midterm and final are competitive. You have to perform well to got a high score. <br /><br />Two grading schemes are adopted:<br />1. 20%HW+20%Mid+60%Final<br />2. 20%HW+80%Final<br /><br />Everyone got almost nearly full marks in HW. <br /><br />This year, Midterm and Final are exactly the same as two years before. Thus, for those done PP, what you need to do is writing from memory. But the problems are quite difficult if you never seen it before,<br /><br />I don't think he will copy the questions from PP next year again. But it will still be useful to read PP questions since the type of problems are similar.<br /><br />Finally got A and my overall score is 95.X<br />I think the mean score is also above 90 this year.",
            "comment_workload": "Quite a lot but the same as previous terms. <br /><br />As long as getting the sources in previous semesters, everyone can easily get full marks.<br /><br />However, i suggest everyone finish the HW by yourself before checking the answer. It will significantly help you understand the content in lecture and problems appreared in exams.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "L8bwJrUPQKqL9yHop0XSVfnEcjoP319U",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 959,
                    "name": "BAO, Zhigang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YinChu",
            "date": "Jun 06, 2022",
            "title": "Super rewarding probability course",
            "comment_content": "Content is well-listed in other reviews. It is obviously very broad. It might also depend whether the professor has enough time to cover all of it .For example, this time the professor skipped the alternatives proofs for CLT , they will not appear in exam or homework though. In general, you get to learn A LOT of stuff such as the rigorous proofs for CLT and different versions of LLN. Highly recommend for people who likes rigorous stuff or more probability apart from just integrating boring distributions.",
            "comment_teaching": "Very fluent. The pace might be a bit fast at times but you can always catch up after the lecture. The professor explained the motivations behind the theorem so you can have a better understanding. The TA is responsible and explained the solutions step by step, but he won't give any hints to hw.",
            "comment_grading": "It seems that 90+ will put you into A+ and every five marks is a subgrade. I got 87 in the final and around 95% for the hw and I got an A. Pretty decent grade I would say.",
            "comment_workload": "The workload is.... quite a lot. Each homework has more than 10 questions and they are pretty hard. Don't worry if you can't do it cuz the final or mid-term would be much easier, and hw accounts for just 10 - 15% anyway. Just all in final and know how to use every theorems and it should be fine.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MeWQLfmpQ1xKKiMTAUN3ctgpYXh2k0K9",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 959,
                    "name": "BAO, Zhigang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kkkph1",
            "date": "Jun 02, 2022",
            "title": "",
            "comment_content": "The chapters refer to the textbook chapters.<br />Before Midterm:<br />Chapter 1-4:<br />Events, Probability spaces.<br />Discrete and continuous random variables.<br />After Midterm:<br />Chapter 5, 7:<br />Generating functions.<br />Convergence of random variables.<br /><br />The textbook is Probability and Random Process by G. Grimmett., some examples are also drawn from Probability Theory and Examples (PTE) by Rick Durrett.<br /><br />The content is highly theoretical, most of the class is on doing proofs. Only few applications are mentioned such as Monte Carlo simulation, random walk, and branching process. No coverage on Markov Chains.<br /><br />I took the course without any analysis background, and this is my first honor course. I would say the content is acceptable without any Mathematical Analysis background. However, some proof techniques and things that the professor takes for granted are not familiar to me and require me to do extra searching to understand.",
            "comment_teaching": "Prof. Bao's teaching is pretty nice. Most of the lectures are &quot;understandable&quot; if you take the time to learn them. I like how he gives some heuristic view of the proofs so it is easier for us to understand them.",
            "comment_grading": "Two schemes:<br />1. HW (20%) + Midterm (30%) + Final (50%)<br />2. HW (20%) + Final (80%).<br /><br />HWs are the exercises from the textbook about 50% of them require you to do proofs. Exam questions are easier than homeworks and more application-oriented.&nbsp;&nbsp;I later found out that most of the midterm and final questions are just recombinations of the past papers, which some previous students have uploaded online. I think this is a little unfair since some of the students might have done the questions beforehand.<br /><br />The grading is ok. My final is slightly below the median and got B+ in the end.",
            "comment_workload": "The HWs require about half a day to finish.<br /><br />To understand the lectures completely, you either need to read the lecture notes beforehand or read the textbook. I spent most of my time reading and trying to understand the contents. Periodical reviews also need to be done.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LZF8cGBXGyyXApg3i6Kd2WmNFHG3Dbn0",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 959,
                    "name": "BAO, Zhigang",
                    "rating": 1
                },
                {
                    "id": 1353,
                    "name": "WANG, Jingming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Doraemon",
            "date": "Jun 29, 2020",
            "title": "A great introductory course in probability theory",
            "comment_content": "The course has covered Chapters 1 to 5 and 7 of the textbook Probability and Random Processes by Geoffrey R. Grimmett, David R. Stirzaker. The topics covered are:<br /><br />Chapter 1: Introduction to Probability (Defining probability using the language of measure theory)<br />Chapter 2: Introduction to Random Variables<br />Chapter 3: Discrete Random Variables<br />Chapter 4: Continuous Random Variables<br />Chapter 5: Generating Functions and Characteristic Functions<br />Chapter 7: Convergence of Random Variables<br /><br />I think the first 4 chapters are what MATH2421 (non-honors probability course) will also cover, except that those same concepts are more rigorously defined using measure theory. Chapters 5 and 7 should be unique to honors probability course and require a more solid background of analysis to understand.<br /><br />I recommend taking MATH2043 (or at least read the lecture notes) together or before this course, since a solid understanding on basic analysis concepts is essential for the last two chapters. I think a brief understanding on measure theory (MATH3043) is beneficial (but not a must).",
            "comment_teaching": "Prof Bao's teaching is excellent. His presentation is logical and easy to understand. He knows exactly what difficulties students usually encounter in understanding the concepts, and will elaborate further using concrete examples whenever necessary. However, please note that Prof Bao's teaching pace is rather fast, so you have to pay much attention in lectures or you will get lost very soon.",
            "comment_grading": "Homework 20%<br />Midterm Exam 30% (or 0%)<br />Final Exam 50% (or 80%)<br /><br />Midterm Exam Mean = 70.55%<br />Final Exam Mean = 73.8%",
            "comment_workload": "The workload is about the same as other honors math courses. The major workload during the semester is to understand the course materials and to work on assignments. There are a total of 6 assignments this semester (around one assignment per chapter), each of which comprises around 10 to 15 problems. Most problems are extracted from the textbook.<br /><br />The pace of the course is quite fast (especially if your analysis background is inadequate). You should expect to spend quite a lot of time after the lectures to understand and digest the concepts and proofs.<br /><br />Both the midterm and final exams are easier than the assignments, so don't worry if you struggle to understand everything from the lecture or complete all assignment problems.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "h3g1PCEtSRpZkvC2EefuXpCxWPYH8qgP",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 959,
                    "name": "BAO, Zhigang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "grqm",
            "date": "May 28, 2018",
            "title": "",
            "comment_content": "Much easier than last spring's offering. No measure theory. Not many proof problems in exams. <br /><br />This year's version is more like a more challenging version of 2421. A good working knowledge of multivariable calculus and mathematical analysis is necessary.<br /><br />The course content is based on the first five chapters plus a bit of Chapter 7 in &quot;Probability and Random Processes&quot; by Grimmett and Stirzaker.",
            "comment_teaching": "The lecturer is a very nice and surprisingly young guy. But his lectures don't add much to the notes. Going through the textbook yourself is better than going to class.",
            "comment_grading": "The mean grade is merely B, which is more or less the same as its non-honours counterpart.&nbsp;&nbsp;<br /><br />Not really good grades considering this is an honours course with a small class size of 23 students.",
            "comment_workload": "Six assignments, each with 10+ problems. Some can be really hard to do on your own without looking at the solution manual.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}