{
    "error": false,
    "course": {
        "id": 1875,
        "subject": "MATH",
        "code": "4821B",
        "name": "Introduction to Graph Theory",
        "description": "This is a course to equip students with basic knowledge of graph theory that will be needed in mathematics, computer science and engineering (network analysis). Key topics include Graphs, subgraphs, Euler tours, Hamilton cycles; trees, spanning trees, searching algorithms; connectivity, Merger theorem, 2-connected graphs, block decomposition, edge connectivity; planar graphs, Euler formula, duality, Kuratowski theorem; matchings, perfect matchings, matchings in bipartite graphs, Konig theorem, Hall theorem, matchings in general graphs, Tutte condition; colorings, chromatic number, chromatic polynomial, four-color problem; flows, Max- low Min-cut theorem, integer flows, group-valued flows, flow number, flow polynomial; cycle spaces, bond spaces, matrix-tree theorem. Students should seek the instructor's approval to take the course.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2010,
            1830,
            1610
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4,
        "rating_teaching": 4,
        "rating_grading": 4.33,
        "rating_workload": 4,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 557,
                "name": "CHEN, Beifang",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "o1nD8npcWTwaJTU8sqmlzvuquTumuiqG",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 557,
                    "name": "CHEN, Beifang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Dipsy",
            "date": "Aug 24, 2019",
            "title": "",
            "comment_content": "https://www.math.ust.hk/~mabfchen/Math4821B/<br /><br />- Cycle space and Bond space<br />- Connectivity<br />- Graph decomposition<br />- Tree searching (COMP3711)<br />- Flow (COMP3711)<br />- Planar graph<br />- Matrix tree theory<br /><br />sometimes it is hard to maintain attention since the content is draining your brain power",
            "comment_teaching": "quotes from the professor and his lecture note: <br />- It seems I didn't teach anything<br />- The proof is trivial (You can still ask then there are two possible reactions from you:<br />a: oh it is really trivial,<br />b: what???)<br />- The proof is too complicated (You can definitely ask for it then your brain will explode)<br />- What do you want to be tested (And then the exam is 90%+ the same as what students had proposed)<br /><br />all and all he is super nice and you can even ask for clarification during the middle of class<br /><br />btw be aware of his unique accent and headless explanation.",
            "comment_grading": "Professor was planning to give many many A-ranges, more than half, but sadly he suddenly remembered there is an upper limit of A range so the mean was around B+ or A- to one grade lower<br /><br />in paper check prof said i can secure a B but at last I still got A+ even after the grade adjustment so I am super happy",
            "comment_workload": "attend lessons and you know (or propose) the questions the final exam, but he will reject if you propose something too dumb, e.g. identify which graph is planar<br /><br />The professor could not find a TA for the course and don't want to mark assignments so only one assignment and grade on submission, and attendance",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oGbKOPycMYZqaLcrArvsiUU6UqVYqpcC",
            "semester": "2018-19 Spring",
            "instructors": [],
            "is_author": false,
            "author": "katrin",
            "date": "Aug 20, 2019",
            "title": "",
            "comment_content": "Something that you can never search in google. Because Prof. Chen is the authority of graph theory (seems to be), everything you find in google is also from prof. Chen, even the terms. <br />Definition is important (for exam), but something like cycle space/ bond space, you can hardly find the exact definition on the internet (no such thing in google/youtube), and you may find a few different definition from prof. Chen's notes, but they contradicts to each other.....<br />Also include little searching. Comp3711 is suggested before taking this course.",
            "comment_teaching": "He's good in explanation, but he always forget to give a topic sentence. Therefore, sometimes you may hear he explains something but you don't know what is going on. You know that he's saying something logical but cannot find the main point.<br />Normal &quot;mainland prof.&quot; accent. Sometimes not really understand which word he's using, e.g. minimal and minimum.",
            "comment_grading": "Much better than other math course.",
            "comment_workload": "Almost none. So if you fail in mid term or exam, whole course will be finished.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gX6Bphh1tDq8cEX1SEDf8JL4EtSzpXvo",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 557,
                    "name": "CHEN, Beifang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cdbn",
            "date": "Jan 09, 2017",
            "title": "",
            "comment_content": "主要上了:<br />- 各种graph的名词和定义<br />- Connected Subgraphs (Euler Tour, Fleury's Algorithm, Chinese Postman Problems)<br />- Trees (Spanning Trees, Cycle Space, Bond Space, Flow Space, Tension Space, Cycle Group, Cocycle Group, Cayley's Formula (略教) )<br />- Separation of Graphs (Cut Vertices, Blocks, Ear, Coherent Feedback Set)<br />- Tree Search (BFS, DFS, Prim, Kruskal, Dijkstra, Strong Component) —&gt; 与COMP 3711H 重叠不少，但教授都给出了严谨的证明<br />- Network Flow (Max-Flow Min-Cut Theorem, Ford-Fulkerson Algorithm, Labeling Procedure, Menger’s Theorem, Bipartite Matchings, Hall’s Theorem, Berge’s Theorem)<br />- Connectivity (Vertex Connectivity, Edge Connectivity, Menger’s Theorem, Fan Lemma)<br />- Planarity (Jordan Curve Theorem, Subdivision, Face Cycle Theorem, Duality, Euler Formula, Kuratowski’s Theorem)<br />- Cycle Space and Bond Space - Matrix (Basis Matrices, Unimodularity, Matrix-Tree Theorem, Cauchy-Binet Formula, Farkas’ Lemma, Hoffman’s Feasible Flow Theorem, Ghouila-Houri’s Theorem, Laplacian Matrix)<br />***教授来不及教vertex colouring和chromatic number<br /><br />Lecture note写得挺好和严谨（但还是会出现一些错误和证明不够严谨的地方），刚开始时会有些吃力，但习惯阅读proof的人应该不会有太大问题。教授有时会采取比较特别的方式去证明一些理论，所以非常建议自主阅读其它材料，学习较为传统的证明方式。<br /><br />作为一门数学系的课，这门课非常theoretical，适合想深入了解graph theory的人。只想学graph algorithm还是去上COMP 3711H吧。<br />**有个（貌似读CS的）学生过了add drop period才要求drop这门课，幸亏教授肯帮忙<br /><br />学期开始时，教授在电邮中说到这门课很好grade，而且只需要一些简单的matrix Algebra。因此本人（同时上着MATH 2121和COMP 3711H，而且原先对graph完全没知识）就天真地进了这门课。到了week 3才发现各种space和topology的boundary operator的概念都出现了（天啊！）。所以建议先上了MATH 2121/2131和COMP 3711H（至少要知道BFS, DFS和一些基本graph algorithm）再上这门课，会相对轻松。",
            "comment_teaching": "只上了前几堂课，但教授说的都是lecture note里有的。",
            "comment_grading": "5A, 4B, 3B-, 1C+, 1C, 1C-, and 1F<br />Midterm: mean 63, SD 30 [最高 100, 最低 17]<br />Final: mean 73, SD 25 [最高90+吧，最低40+吧]<br />本人 mid term 40, final 86 —&gt; B",
            "comment_workload": "共有3份assignments，平均一份大约18题证明题，至少有两个星期时间做，但一些题目非常难（教授自己都不会做）。本人每份assignment都熬了不少个夜晚才能完成。然而，基本上教授和TA都没改assignment，只要完成都得满分。一些人会觉得不公平，但教授鼓励我们说要趁年轻学习如何写严谨的证明<br />***建议用latex/word来写assignment，可以省下不少时间。",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}