{
    "error": false,
    "course": {
        "id": 1389,
        "subject": "MECH",
        "code": "1907",
        "name": "Introduction to Aerospace Engineering",
        "description": "Introduction to the field of Aerospace engineering, discussion of basic aerospace systems and disciplines, working vocabulary of the field. Basic concepts. Demonstration through examples.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1530
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.75,
        "rating_teaching": 4.88,
        "rating_grading": 4.46,
        "rating_workload": 4.23,
        "review_count": 56,
        "single_review": false,
        "enrollment_status": 2,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 826,
                "name": "LIEM, Rhea Patricia",
                "count": 56
            }
        ]
    },
    "reviews": [
        {
            "hash": "r3mjMqVporehxdxQn5PnLwTHGjP6Z8bq",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HKG_SIGMA",
            "date": "Jun 11, 2016",
            "title": "An ideal course for those who love aircrafts",
            "comment_content": "A required course for AE major. Covering almost all systems in aircraft engineering, the course itself is indeed very easy and fundamental. It does not require any weird formula derivation or hell-like graph sketching. Instead, it just briefly introduces every elemental part in aerospace system such as Aerodynamics, Structure, Propulsion, Thermodynamics, Mission Analysis, etc. Rhea additionally included something related to real-life operation like Airline Operation. That makes the course very interesting and inspiring since you may not know a commercial airliner flies higher not only for flying faster!",
            "comment_teaching": "Being an Indonesian, Rhea's accent is quite thick indeed but it never affects my understanding. Rhea is a new professor in HKUST but she makes me even more intrigued by Aerospace Engineering. Her friendliness (and dry jokes) makes every lesson very attractive that you don't want to skip any. She sometimes shows fascinating videos during lectures such as the human-powered helicopter. Rhea also likes to share her experiences in the MIT(Yes! An authentic Master from the MIT!). I must mention her notes and handwriting. Extremely neat and pretty(Although I sometimes mixed up 9 and g)! The two TAs are also very helpful in marking our assignments and giving feedback in our papers. Never gonna forget their names!",
            "comment_grading": "For a brand new course, I had never expected such a good grade! <br /><br />Assignments: 15%<br />Midterm: 25%<br />Final: 60%<br />[Participation: ???%]<br /><br />For the assignments, all questions are categorized into different topics which makes it very easy to locate the specific part in lecture notes and find the answer you need. Some of the homework carry 5 bonus points and basically the bonus is a must-get item, since you just need to answer something very basic and straight-forward (e.g. given Aeroflot Flight 593 Disaster, discuss how g-force affects the maneuverability of people on board).<br /><br />There are both Midterm and Final for this course carrying 25% and 60% respectively. Cheatsheets (1 page and 2 pages respectively) allowed.<br />- Midterm: Fundamental Thoughts<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Fluid Dynamics<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Aerodynamics<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Standard Atmosphere<br />- Final: All topics, topics in midterm INCLUSIVE<br />Unlike assignments, questions in both exams are blends of different topics like AERODYNAMICS + MISSION ANALYSIS so that the difficulty is significantly higher than assignments. Try to thoroughly understand all the topics.<br /><br />Assignment: 504/500 (+10 Bonus Points)<br />Midterm: 80/100 (Mean 78/100)<br />Final: RESULT NOT RELEASED<br />Final grade: A-<br /><br />** Let Rhea remember you in class! She can recognize some faces who actively answer or raise questions. Don't feel shy to ask or chat with Rhea after class. It is believed that there are some 'Easter Egg' bonus participation mark. **",
            "comment_workload": "Not heavy at all, for an aircraft lover. I feel very excited and satisfied when doing the assignments instead. Actually, I didn't see the assignments as a burden but an excellent chance for me to know more about the mechanisms of an aircraft. Feel no pressure when revising for both exams if you keep studying them in your free time. No project, no presentation, no field trip for this term.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 8,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cSUSC0ZiEWVDJFwwaOLfgwgTXkh7tran",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "EstherK",
            "date": "Aug 22, 2016",
            "title": "Good professor",
            "comment_content": "A introductory course to aerospace engineering. Even for me as a business student I could still handle it well and got good grade. First few classes mainly related to theories and latter would be structures and more mechanical stuff. Rhea tried to include as many topics as possible in the easiest way of understanding. Cheatsheet allowed in the exams so need not to memorise much even various topics are included.",
            "comment_teaching": "Rhea is one of my favourite professors as she is so passionate in teaching even though I know not all the students feel the same in learning in return. You never want to miss her class otherwise you will be skipping a lot of things. She shared to us a lot of aeronautical stories and her interesting background that are definitely useful to those who wants to pursue a aerospace engineering career. Her accent is fine.",
            "comment_grading": "Lenient marking standard. Maybe it was a new course that Rhea did not want to make it too harsh.",
            "comment_workload": "Mid-term and final exams are basically advanced questions type of your homework. Very similar to those appeared in the homework set and should not be too difficult if you input effort. Totally 5 assignments throughout the whole semester. Do not worry you will have plenty of time to finish them. And She has a very lenient marking standard. All of my homework got 90 or above.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "INpi5x0hjgAmxx3WaOvi441TlT13kjR6",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fishfillett",
            "date": "Jan 27, 2020",
            "title": "My favourite course so far",
            "comment_content": "The content taught in class is generally quite useful and informative if you want to take AE as a major. Calculus is not required for the course as the formulas are already given to you in lecture notes, although it would be helpful for understanding its derivation. If you have a passion for studying AE, this course would definitely open your eyes and provide you the interest.",
            "comment_teaching": "Rhea is very helpful and answers any questions in-depth and she truly is a very kind professor. Her method of teaching step-by-step ensures that everyone would understand. She makes jokes in class and she is able to remember most people's name which makes her feel very approachable, and she makes an effort to take care of everyone's needs.",
            "comment_grading": "During mid-terms, Rhea marks the paper very generously and many people got an ideal mark. She even provides an opportunity in a raise in your mid-terms mark (5 marks) by providing an extra essay to write. However, as during this term the finals are canceled, we got an take-home exam instead, which is probably why it is very different from the mid-terms and I would say it is much more challenging and difficult. Nevertheless, if you are willing to put an effort into revising, getting a satisfactory mark should not be a problem.",
            "comment_workload": "There are 4 assignments in the course, and if you are an AE enthusiast you should not be too stressed about it. I found satisfaction in finishing each assignment, and the questions are highly linked to the examples which are gone through during class, so it would be highly advised for you to attend the classes or you might have difficulty in completing the assignments. Rhea emphasizes the format used to answer questions (Given → Asked → Calculation), so if you don't use this format you might get points deducted.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lWZTH2LFQyHmLceldUjmnc0uegrahM4B",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hoegaarden",
            "date": "Aug 10, 2022",
            "title": "The Most Enjoyable Course in Year 1",
            "comment_content": "This course will cover :&nbsp;&nbsp;&nbsp;<br /><br />1 Introduction and Maths overview<br />2 Fundamental thoughts<br />3 Fluid dynamics<br />4 Aerodynamics<br />5 Aircraft structures, structural designs and loads, and structural basic analysis<br />6 Materials technology<br />7 Standard atmosphere<br />8 Aircraft performance and mission analysis<br />9 Basic thermodynamics<br />10 Introduction to propulsion<br />11 Introduction to astronautical engineering<br />12 Airline industry and aircraft design overview<br /><br />But the knowledge inside is just the very surface in aerospace engineering. It won't be too hard for you. Recommend studying Phys 1112 when studying this course which is only available in Fall Semester.",
            "comment_teaching": "Rhea is a professor who is willing and able to remember the names of each student and their background. It is rare to meet this kind of professor in HKUST. She is also a professor who guides students to understand stuff starting from the foundation step by step. For example, she not only introduced the equations for each topics, such as the famous Breguet Range Equation, but she also took much time to explain how it came from through mathematical way and the physical meaning of each component of the equation. If you get any enquiries or confuse of some concepts, she must be willing to assist you.",
            "comment_grading": "The mean in this course is usually very high. For assignments, it is usually 80-85. For mid-term, it is 83.5. For quiz, it is 80 in average ( normal ). I got 86.5 in mid term and scored 91 and 87 in 2 assignments respectively. However, I was always below means around 20 marks in each quiz The marks of your final exams will not be exposed. I ended up getting B. It is not a good grade to me but considering my performance in quiz and mid term, scoring B is already satisfactory in HKUST.",
            "comment_workload": "The workload this year is fine, not too heavy or too light. There will be an assignment of around 10 questions for around every 3 weeks. 10 questions of course consist of many sub questions. Usually&nbsp;&nbsp;finishing one question took 30 - 40 minutes. There will be quiz ( 10 marks for each MC ) after each chapter ends. For mid term, this year is an essay of either of 2 topics. Rhea asked us to present our ideas in front of the class and kept guiding us if we got any problem in terms of process. For Final exam, we were given 48 hours to finish a paper of 8 questions.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "J73eNGZt1kPZLWIgvcJ7bkc5QujnA0BY",
                    "name": "MECH1907_Fall2021_FinalExam",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "Tk8qlY97IJnDCIXQeEmZTXwxIADLWsgS",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pierre0322",
            "date": "Jan 02, 2020",
            "title": "One of the best courses I've taken.",
            "comment_content": "The course covers the topics essential to the basic understanding of aerodynamics. Professor LIEM often dives even further into each of the topics and uses relevant examples, which makes it simpler and easier to comprehend. The content is very interesting (though, it might be due to my interest in planes) and it never fails to amaze you. <br />Here's a list of the topics:<br />Introduction<br />Fundamental Thoughts<br />Fluid Dynamics<br />Aerodynamics<br />Aircraft Structures<br />Structural Analysis<br />Materials Technology<br />Standard Atmosphere<br />Aircraft Performance and Mission Analysis<br />Thermodynamics<br />Propulsion<br />Space Flight/Astronautics",
            "comment_teaching": "Honestly, I think that Professor LIEM is one of the best lecturers I've met. She gives the course a personal touch, which motivates me to attend her classes. She explains the concepts very clearly for us (and her hand writing is super neat!) She presents herself in a way that makes her very approachable. I have never felt uncomfortable or scared to approach her with my questions. The lectures are never boring, as she often includes her own anecdotes and cracks a lot of jokes (some are actually funny hahaha). Having a good teacher is very important in a student's career, and having Professor LIEM as my teacher in this course had honestly made me even more interested and excited about aerospace. One advice would be not to skip her lectures because it's not a big class, and she remembers her students quite well haha. Overall she is a very good teacher, and honestly a very nice person as well.",
            "comment_grading": "The grading scheme is quite lenient, and the TA's are very helpful with the assignments or if we have any questions. However, one thing that I have to complain would be that the final is worth a significant chunk of the final grade (60%!), so it would be advisable for you to study hard for the whole course, and not just revise in the last 3 days like I did LOL.",
            "comment_workload": "There are 4 assignments throughout the course, together with 1 midterm and 1 final. For each assignment, it takes me around 4 hours to complete it (keep in mind I procrastinate a lot haha). Professor LIEM emphasizes on having the work be done very neatly and organized. Although it takes a little longer, this method helps to decrease human error. It may seem like the workload is not a lot, but each assignment takes a lot of effort and time to complete. In this course, trust me, every effort counts.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SuRSIUFoZVhTGMNx7BujjjR3chxNi9gU",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AE人",
            "date": "Jul 27, 2018",
            "title": "想讀AE既一定要早D take",
            "comment_content": "成個course會cover好多AE既基本知識，唔會太深入但個範圍都算幾大<br />成個course除左Rhea會教之外，中間會有幾個guest prof.黎教，教得深但唔會考番",
            "comment_teaching": "上堂Rhea講得好清𥇦，基本上佢上堂係黑板上面寫既野九成九抄曬都係好有用<br />如果你惗好左要入AE既話，year1 take左呢個course包你有着數",
            "comment_grading": "Assignment 15%<br />Mid term 25%<br />Final 60%<br />---------------------------<br />mid term 同 final都有cheat sheet<br />---------------------------<br />四份assignment 都幾乎滿分<br />mid term同final都有9成幾 <br />最後A左<br />--------------------------<br />只要努力D cheat sheet寫好D 要好grade唔難",
            "comment_workload": "四份assignment 每份都有6至7題 上堂有留心聽同抄足佢黑板寫野 要高分唔難<br />cheat sheet寫好D 同温多D佢手寫既notes 要考好都係輕鬆既",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bGG04HMZQOiGJfQA2Y7hdfeYDraqUJEH",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "undefined",
            "date": "Dec 26, 2022",
            "title": "Simply the best course.",
            "comment_content": "Perfect course for aviation enthusiasts, covers a very broad set of topics across AE at an introductory level. The diverse range of topics are well organised into modular chunks, which makes it easy for students to understand and form connections between them.<br /><br />A very broad introduction to all aspects of aerospace engineering, lectures are:<br />1-3: Introduction &amp; Basic Physics<br />4: Fundamental thoughts<br />5-7: Fluid Dynamics (buoyancy, fluid properties, conservation of mass/momentum/energy: Euler → Bernoulli, continuity, energy equations, isentropic relations)<br />8-9: Aerodynamics (forces, finite wing theory, induced drag, drag polar, flow phenomena)<br />10: Basic Thermodynamics (heat transfer modes, work and energy, cycles, entropy)<br />11-12: Propulsion (shaft, turboprop, turbojet, turbofan, ramjet thrust/work calculations, efficiency, TSFC)<br />13: Standard Atmosphere (hydrostatic eq. → geopotential altitude, isothermal/gradient layers)<br />14-16: Aircraft Performance &amp; Mission Analysis (thrust required / thrust available → level flight, rate of climb, glide angle calculations, stall velocity, takeoff/landing performance, Breguet range eq.)<br />17: Introduction to Astronautics (guest lecture, not assessed)<br />19-20: Aircraft Structures, Design, Loads (anatomy, complexities, cost, D'Alembert, load factors, UFS/MOS)<br />21-22: Materials Technology (types of stresses/tests, material properties/selection/failure modes)<br />23-24: Systems Engineering &amp; Aviation Industry (multidisciplinary, demographic, sociotechnical approaches)",
            "comment_teaching": "Probably the best professor you can ever meet. With a deep passion for both teaching and research, her explanations are always concise and thoughtful. She is very friendly and approachable - the learning environment is chill and upbeat. Loves to share her personal experiences and answers questions with great depth.",
            "comment_grading": "The grading is very lenient - there are often follow-through marks for the homework assignments. As she mentions, the depth of your understanding trumps over the calculations - make sure to explain your derivations and thought processes! Grades will generally be allocated by your in-class proactiveness to learn, and whether you can truly grasp the deeper manifestations/underlying assumptions of specific equations. Quoting: &quot;Most students will get B, 25% will get A and the A+ are only reserved for those who really understand&quot;<br /><br />Breakdown:<br />[15%] Mini Assignments / Quizzes (class mean: ~80%)<br />[20%] Homework assignments (class mean: ~80%)<br />[20%] Midterm Essay<br />[40%] Final Exam (2-page cheatsheet permitted, 70-30% calculations-theory split, final score will not be published)<br />[5%] Class Participation",
            "comment_workload": "Since the course covers a breadth of topics, calculations are generally pretty straightforward once you understand the concept (do not skip lectures - all topics are highly interconnected!). There are 2 homework assignments (based on content &lt;Lec 11 &amp; 21, each will take ~4 hours to do, 6/10 for difficulty), 1 mini assignment and 4 online MC quizzes. Finals are slightly more difficult and encompasses a broader set of topics.<br /><br />The midterm essay is an individual assignment, where you'll decide your own topic (anything related to the aviation industry) and have 2 weeks of research time to write a 3-5 page essay. The essay is a great way to exhibit your enthusiasm for the aviation industry!<br /><br />Although some lectures are packed with details (which would otherwise require extra study time to completely understand), overall it is a challenging yet rewarding course for aviation enthusiasts!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OybzwLwQILd3eYLXO6Tfhp4X8WUk1Out",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "xyzxyzxyz",
            "date": "Jan 27, 2022",
            "title": "Good Course for those who love aerospace",
            "comment_content": "A introductory course to aerospace engineering. Even for me as a business student I could still handle it well and got good grade. First few classes mainly related to theories and latter would be structures and more mechanical stuff. Rhea tried to include as many topics as possible in the easiest way of understanding. Cheatsheet allowed in the exams so need not to memorise much even various topics are included.<br />Here's a list of the topics:<br />Introduction<br />Fundamental Thoughts<br />Fluid Dynamics<br />Aerodynamics<br />Aircraft Structures<br />Structural Analysis<br />Materials Technology<br />Standard Atmosphere<br />Aircraft Performance and Mission Analysis<br />Thermodynamics<br />Propulsion<br />Space Flight/Astronautics",
            "comment_teaching": "Rhea is very helpful and answers any questions in-depth and she truly is a very kind professor. Her method of teaching step-by-step ensures that everyone would understand. She makes jokes in class and she is able to remember most people's name which makes her feel very approachable, and she makes an effort to take care of everyone's needs.",
            "comment_grading": "Grading is quite fair. Doing your assignment and attending the midterm is enough to guarantee a good grade. You'll get what you pay for.<br />I ended up getting a A grade. I would say grading is quite good overall.<br />Mini assignments/quizzes - 15%<br />Homework assignments - 20%<br />Essay (including group discussion &amp; peer review) - 15%<br />Class participation - 10%<br />Final exam - 40%<br />Just do everything normally, and as good as you can. Professor LIEM is not harsh on grading assignments. It is not difficult to get a satisfactory grade in this course.",
            "comment_workload": "workload is reasonable.<br />assignment every 2-3 weeks with enough time to submit.<br />All part of the lecture was included and some difficult questions were also included for those who aim high.<br /><br />take final home exam and midterm exam are similar to assignments",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lQEyluV2OmaeFVH3x5nu374UlRG0BHDF",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JerryLhm0620",
            "date": "Sep 03, 2021",
            "title": "nice course for those who wanted to be in MAE major",
            "comment_content": "Overall quite useful<br />Especially for those who want to take Mechanical / Aerospace engineering as major<br />The part of thermodynamic and fluid dynamics are actually decent way to introduce yourself into latter MECH courses.<br />Overall the content is quite balanced.",
            "comment_teaching": "LIEM is one of the best lecturer. Even tho I didn't take aerospace as major, the content she taught is still widely applicable to the mechanical major. <br />She could explain the basic concept much better than those professors in advance courses. Even tho this is not a required course for mech major I still suggest you (especially year 1) to take it. It definitely helps you with your latter courses.<br /><br />Also she has a nice personality and reply email fast (so as the TAs). That's a huge plus.",
            "comment_grading": "Grading is quite fair. Doing your assignment and attending the midterm is enough to guarantee a good grade. You'll get what you pay for.<br />I ended up getting a B grade consider I missed one assignment and a sub-par final performance. I would say grading is quite good overall.",
            "comment_workload": "workload is reasonable. <br />assignment every 2-3 weeks with enough time to submit. <br />All part of the lecture was included and some difficult questions were also included for those who aim high.<br /><br />take final home exam and midterm exam are similar to assignments",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sW5PAxDX43uzocAxnzZUGxFIfV0PEupb",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "RS.Z",
            "date": "Apr 26, 2021",
            "title": "Very interesting course.",
            "comment_content": "Some basics about aerospace engineering.",
            "comment_teaching": "Really interesting, especially for aviation lovers. Liem will expand a lot about things related to the subjects.",
            "comment_grading": "Liem said, &quot;Getting a B is reasonable, it is very hard to get A, only 2 or 3 students or no students will get A+&quot;.<br /><br />However, I heart some students telling me that this is only a joke. Grading is not bad, at least not for me.",
            "comment_workload": "Liem wanted to help us lower our stress, so she substituted the mid-term with an essay. <br />There was also some homework, which was basically physics problems. (Calculation problems in PDF, you may write it on a paper and scan it with your phone)<br />There are not many things to remember, but sometimes it took some time to understand the concepts.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hGz5chN5llYR7I1nC4svW240V97d01Mr",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "An225 Mriya",
            "date": "Jan 04, 2021",
            "title": "Probably the best course in HKUST",
            "comment_content": "Contents cover some basic concepts of aerospace engineering:<br />*Mathematics<br />*Fundamental theorems<br />*Fluid dynamics<br />*Aerodynamics<br />*Structure<br />*Material technology<br />*Standard atmosphere<br />*Vehicle performance<br />*Thermodynamics<br />*Introduction to propulsion<br />*Introduction to astronautics (not taught and assessed)<br /><br />Professor Liem said that the initial content is the hardest. My opinion is that: it's true. You'll need to fly through loads of equation derivation, but once you know how to actually use them, it's much more easier. Equation derivation is not assessed, and related derivation skills (like partial differentiation or surface integral) will be taught in MATH2011 (or other equivalent courses).<br /><br />Professor Liem also claimed that the content of MECH1907 is becoming easier as time fly. After all, if you are truly interested in aviation, then you'll have real motivation to learn all of the content.<br /><br />Those who studied M2 will have a stronger grasp on the content. Taking PHYS1112 also supplements some of the content.<br /><br />Tips: If you are interested in aerospace engineering, consider reading some related books. I'll recommend H.C. &quot;Skip&quot; Smith's &quot;The illustrated guide to aerodynamics&quot; and Huang Taiping's &quot;飛機性能工程&quot; (Simplified Chinese title), both of them are available from Hong Kong Public Libraries, albeit the latter one will require a lot of calculus.",
            "comment_teaching": "Some said that Professor Liem is one of the best lecturer in HKUST, and I had to agree no more. As per previous reviews, she has some Indonesian accent, which generally does not affect understanding. Her teaching is also lively, often embedded with her personal experience from teenage years to her MIT study experience.<br /><br />The discussion board is also filled with activity, not only there are people going to finish the discussion tasks, but also those who want to raise questions about homework and course material. These questions are also quickly replied by TAs and Professor Liem herself.",
            "comment_grading": "Mini individual assignments/quizzes 15%<br />Homework assignments 20%<br />Group discussion (individual essay + peer assessment) 15%<br />Final (take home) exam 40%<br />Students’ talk time + class participation 10%<br /><br />They never showed the score for the final take home exam and the individual essay, though at the end, I got an A- for MECH1907.<br /><br />Edit: Note that a A-range grade helps you a lot to get into AE major as per my experience, as it really has limited quota (some 30 places for my intake). I heard someone else who didn't perform so well in this course don't get his way into AE after he is registered into MAE Department (I.e. registered in mechanical engineering).",
            "comment_workload": "There are 2 assignments throughout the semester, in which I got 90 and 91%. After all, they aren't such hard if you can understand course material throughly. Given that previously it is reported that the course have 4-5 assignments+1 midterm+1 final throughout the semeseter, I'll consider the workload is light.<br /><br />Short mini-assignments and quizzes are also given out approximately on a monthly basis, mostly focus on concepts. For some reason I got most of them near the mean...<br /><br />There's also an essay task based on in-class and Canvas discussion board discussion, focusing on an aviation related topic, such as drone regulation, changes of the aviation industry after the COVID-19 pandemic, etc.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SMt6SL3NB7N3AOtX61AEok54iQtBFiMM",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KCKC_",
            "date": "Dec 14, 2020",
            "title": "Introduction to Aerospace Engineering",
            "comment_content": "If you like aviation, you would love this course. This is also a required course for AE major. The course content is not too difficult. Some derivation may not be easy to understand without adequate calculus background. There are both computational and conceptual content. Overall, it is an interesting course to take, you will like it.",
            "comment_teaching": "It is my first semester in HKUST, and Professor LIEM is the best lecturer among the courses I took. Although it was online learning mode for this semester, she tried her best to explain everything clearly, in different ways so that we could understand the content. She was always energetic and funny during class, you will never fall asleep. Sometimes, in some content, she would include her personal experience, some extra information for us to learn as much as possible. She encouraged us to participate more in class. Overall, she is a very good teacher, you will like her.<br />There are two TAs this semester, they are both very very helpful honestly. I always feel comfortable to ask them questions via email, or in the canvas discussion forum. Whenever we have questions, they always try to answer us as soon as possible and they explain things well so that students can understand.",
            "comment_grading": "The grading is pretty fair, you will get what you paid for. <br />Mini assignments/quizzes - 15%<br />Homework assignments - 20%<br />Essay (including group discussion &amp; peer review) - 15%<br />Class participation - 10%<br />Final exam - 40%<br />Just do everything normally, and as good as you can. Professor LIEM is not harsh on grading assignments. It is not difficult to get a satisfactory grade in this course.",
            "comment_workload": "In this semester, the workload is fair, and less than the previous semesters as what I saw on this website. There were only 2 assignments mainly on computational problems. Mini assignment and quizzes are easy, just for us to recall content in lectures.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dIeYNkbkxe7cR6JDsoCrcQJZ4IfVC8fw",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "UstK",
            "date": "Sep 01, 2020",
            "title": "Very good course leng grade",
            "comment_content": "Introduction to the field of Aerospace engineering, discussion of basic aerospace systems and disciplines, working vocabulary of the field. Basic concepts. Demonstration through examples. Wind tunnel visit.<br />Introduction to the field of Aerospace engineering, discussion of basic aerospace systems and disciplines, working vocabulary of the field. Basic concepts. Demonstration through examples. Wind tunnel visit.<br /><br />Didnt go wind tunnel at the end",
            "comment_teaching": "Very nice instructor gave us chocolates.Will answer questions.Nice TAs",
            "comment_grading": "Not harsh grading,very lenienet on mistakes.",
            "comment_workload": "Adequate workload, not too much,assignments per two weeks.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KSFjVMbDQ7QGpRoooxepKcQbZX3mudLI",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lucas",
            "date": "Aug 24, 2016",
            "title": "",
            "comment_content": "The fundamental knowledge about Aerospace engineering, including fluid dynamics, aerodynamics, atmosphere, aircraft performance, aircraft structures, material technology, thermodynamics, propulsion, space system, airline industry and aircraft design.<br /><br />Brief but extensive topics.",
            "comment_teaching": "The professor teaches quite clearly, and she made some jokes and show us some videos to make the lectures fun.",
            "comment_grading": "Although the midterm exam and the final exam are very difficult (personal opinion), but it is hard to fail the course. I can hardly follow the lectures and I get B.",
            "comment_workload": "Moderate workload in my opinion.<br /><br />5 pieces of homework throughout the semester, each piece of homework includes less than 10 problems to solve. For the exams, they are difficult but cheat sheet is allowed.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bsAHgNZnbsgY7mz2wLibDhaXUssQxWCa",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gavin040408",
            "date": "Aug 01, 2023",
            "title": "Very good MECH course",
            "comment_content": "Basic aerospace concepts and knowledage, you will enjoy the course very much if you are interested in aerospace. Although the content is difficult for year 1 students, seems like the course is meant for year 2 students more since it covers most content from the engineering required course in year 1.",
            "comment_teaching": "Superb teaching from Prof, you can tell she actually have interest in the things that she teaches and interacts with the class. It was a 9am class and I still attend just because I wanted to listen to her class.",
            "comment_grading": "The grading was brutal as being a year 1 student, it's almost impossible for me to accquire all the knowledge from the course. There are calculations questions in the mid term and finals where the content is from year 2 mech courses, so it's quite a leap for a freshmen. C+ at last.",
            "comment_workload": "2 HW<br />1 mid term essay<br />1 finals",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FcCRaCnThO5AgqracTJPEPmquCUSy6cO",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "彥",
            "date": "Jun 30, 2023",
            "title": "如果想入AE , 或者對飛機好有興趣就讀啦唔好猶疑",
            "comment_content": "his course will cover :&nbsp;&nbsp;&nbsp;<br /><br />1 Introduction and Maths overview<br />2 Fundamental thoughts<br />3 Fluid dynamics<br />4 Aerodynamics<br />5 Aircraft structures, structural designs and loads, and structural basic analysis<br />6 Materials technology<br />7 Standard atmosphere<br />8 Aircraft performance and mission analysis<br />9 Basic thermodynamics<br />10 Introduction to propulsion<br />11 Introduction to astronautical engineering<br />12 Airline industry and aircraft design overview<br />空氣動力學方面理解當中嘅concept可能對各位有少少難度,當中嘅formula相當容易,",
            "comment_teaching": "professor上堂好chill, 如果對飛機唔熟嘅朋友,建議睇書or watch youtube vedio,對你幫助極大,落堂之後,professor願意留低1-2小時同我哋傾上堂我哋聽唔明嘅嘢,只要你肯主動嘅話佢一定解答你唔明嘅嘢,professor系MIT畢業,上堂會講額外知識.",
            "comment_grading": "只要係一個midterm project,同埋final , 佢批准我哋扣20%分重做,而且final有cheat sheet<br />只要你肯上堂留心,同埋做完professor 比嘅extra exercise,同功課,一定靚grade.雖然我得B+,大真心覺得依科 我學到好多嘢",
            "comment_workload": "平均一個禮拜有一個assignment, workload 不大,有啲嘢係要睇書先明白,喺依個course都識到好多人,大家會一齊做功課,我唔多講la, 雖然大家都話係靚grade course ,但係有心同埋有興趣讀嘅話就一定有A+,唔好因為靚grade 而讀1907, 否則有C range",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qkAb8bcBf7q9aae0cjFhWjl4fDXc390N",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "criesinust",
            "date": "Apr 20, 2023",
            "title": "Great course for aircraft lovers and those who are interested in AE",
            "comment_content": "Introductory course to Aerospace Engineering, covers a little bit of everything that will be taught in the major.<br /><br />Major topics taught include aerodynamics, thermodynamics, materials, fundamentals and aircraft performance analysis<br /><br />Although there is a lot of content, Professor Rhea teaches them slowly&nbsp;&nbsp;so the content is not too hard to grasp with the assistance of TA as well.",
            "comment_teaching": "It is simple to say this is the best teaching I have received for my two semesters at this university, Professor Rhea is patient and loves the subject herself so she provides lots of interesting facts about aircraft along the course.<br /><br />This is an amazing course! So take it especially in freshman Fall semester as it is not offered in Spring semester. Also prereq it so you don't miss out and end up on the waitlist.",
            "comment_grading": "The grading is fine in this course so it is not absolutely necessary to get a full grade in order for A range.<br /><br />The examinations are also doable with content similar to the extremely difficult assignment questions which are quite fun and allow you to really enjoy the process of learning while figuring stuff out on your own.",
            "comment_workload": "Not high, just assignments are hard so don't expect to finish them in one day.<br /><br />There are also quizzes and a midterm essay about whatever you want to write about that you are interested about. Which is arguably the most fun assignment.<br /><br />Quizzes are easy but some care is needed in studying to get a good grade.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "90MZSmSmDGwrvvtgj6ScFiTQGlSLOY7S",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "benbenbang",
            "date": "Jan 31, 2023",
            "title": "",
            "comment_content": "only for student who is interested in aerospace engineering.<br />you dont want to touch aerodynamics, fluid dynamics and thermodynamics in 1 course if you are not interested",
            "comment_teaching": "teaching is very good.<br />can feel the enthusiasm.<br />everyone is having fun in class while learnning those knowledge",
            "comment_grading": "5% of class participation - nightmare for student with social anxiety like me.<br />quizzes are terribly designed. you need to be 1000% clear of all the concepts to get good grades<br /><br />finals and homework are mostly straightforward calculations and a bit of concept.",
            "comment_workload": "medium. 1 homework per 2 weeks but each may cost you 5-10 hours to complete.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CISatTdKGwnLkfMP6I6YWUUHhNQfptpD",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jan24i3",
            "date": "Jan 17, 2023",
            "title": "Highly recommended",
            "comment_content": "It starts off with basic math and review of calculus but difficulty increases quickly. The topics covered include fluid dynamics, Aerodynamics, Aircraft performance, which to me were difficult. Make sure you attend the classes regularly and actually pay attention to what Prof says because she sometimes asks questions about stuff she discussed in class but didn't mention specifically in slides. Don't worry, there aren't that many of them.<br /><br />2nd thing, understand the derivations of each formula mentioned, you'll need it for solving homework questions. There are about 4 quizzes of which best 3 will be taken. The assumptions in derivation are important for those.<br /><br />Lastly, start early, this course is content heavy but very interesting, study and keep reviewing throughout semester.<br /><br />You'll be allowed 2 A4 pages as cheatsheet in the final so don't worry about memorizing long equations, learn to apply them correctly. <br /><br />There is a midterm assignment, it is quite demanding so start as early as you can. You get about 1.5 months to research and write your essay, no midterm exam. Try to finish it earlier, you'll get busier as your finals approach so get it out of the way. Discuss with your TAs any problems that you face while writing the essay.",
            "comment_teaching": "Teaching is great. She adds some extra ideas and promotes active participation in class, she tries to make the boring or difficult topics easier. The TAs are very helpful as well.",
            "comment_grading": "While the grading is curved, it isn't as steep. She doesn't reveal the scores for the finals tho. But try doing your homework and quizzes to the best of your ability and you will have a good grade.",
            "comment_workload": "The workload is quite high for an introductory course. You have to read the lecture notes beforehand to follow through the class, its easy to get lost and regret it later. Also, keep your homework neat and well organized. You will get partial marks for showing your steps properly.<br /><br />Also, there aren't many past papers for this course, she provides 2 extra exercises for you to practice but that won't be enough. So you have to practice the homework as well for revision. Don't leave it till last minute, you'll suffer.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Gkj1P1dkNZWfC99HR0JJM3IBUFZsRn8g",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "L.T.",
            "date": "Dec 10, 2022",
            "title": "If u like aircraft",
            "comment_content": "Content is quite informative, lots of fundamental topics of aeronautical engineering are introduced.<br /><br />Lecture Topics are included as below:<br />-Introduction<br />-Basic Maths and Physics Overview<br />-Fundamental Thoughts<br />-Fluid Dynamics<br />-Aerodynamics<br />-Thermodynamics and Propulsion<br />-Standard Atmosphere<br />-Aircraft Performance &amp; Mission Analysis <br />-Aircraft Structure <br />-Material Technology<br />-Introduction to System Engineering",
            "comment_teaching": "This course focuses a lot in term of equation proving, especially for fluid dynamics or aerodynamics to help students really understand these equations. Thankfully, the professor can make it crystal clear and easy to follow. The professor really try to listen from the students and hence make constant changes to satisfy us. (This year we have a guess lecture about space as many of us said interested in aerospace industry). Both TAs and professor love to answer any of your&nbsp;&nbsp;questions, during the lectures or after. The atmosphere during the lecture is pretty relaxing and free.",
            "comment_grading": "*Grading Assessment is Attached <br /><br />I think it is pretty easy to get an B overall, yet it does require a lot more effect to achieve an A.<br /><br />Some statistics listed below:<br />ASSIGNMENTS<br />-Mini-assignment 1:<br />me: 78/100<br />mean: 87.25 Upper Quartile: 94.75<br />-Mid-Term Assignment:<br />me: 78/100<br />median: 81 UQ: 84<br />-Homework 1:<br />me: 94.5/100 <br />median: 84.75 UQ: 95.38<br />-HomeWork 2:<br />me: 98.5/100<br />median: (Unknown) UQ: (Unknown)<br /><br />QUIZ:<br />-Fluid Dynamics:<br />me: 100/100<br />median:80 UQ: 90<br />-Aerodynamics, Thermodynamics and Propulsion<br />me: 77.5/100<br />median: 74.17 UQ: 85<br />-Standard Atmosphere, Aircraft Performance and Mission Analysis<br />me: 37.5/100<br />median: 56.25 UQ: 65.63<br />-Aircraft Structure and Material Technology:<br />me: 76.67<br />median: 76.67 UQ: 90<br /><br />FINAL EXAM:<br />me: 77.5/100<br />median: ~55UQ: (Unknown)<br /><br />OVERALL GRADE:<br />A-",
            "comment_workload": "Workload is fine, except for your mid-term assignment and HW2 which does occupy some of your time. The rest depends on how much you will like a A range in this course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "2G16WmN9WmMrnpZK7naSZDvS5bUQneEj",
                    "name": "Grading Assessment",
                    "format": "png"
                }
            ]
        },
        {
            "hash": "mwVFelbLV2VoVqIveWLP41x7j7XHJIy7",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "desmond fanboy",
            "date": "Nov 17, 2022",
            "title": "Fun Course",
            "comment_content": "This semester, the course will cover:<br />- Fluid dynamics<br />- Aerodynamics<br />- Basic thermodynamics<br />- Introduction to propulsion<br />- Standard atmosphere<br />- Aircraft performance and mission analysis<br />- Aircraft structures, structural designs and loads, and structural basic analysis<br />- Materials technology<br />- Introduction to systems engineering<br />- Airline industry and aircraft design overview<br /><br />If you are interested in some of the topics mentioned above, this course should be a fun course.",
            "comment_teaching": "It will be hard to find a professor at UST that really cares about her students as much as Professor Liem does. Not only is she able to memorize all the names of the students enrolled in her class, but she is also always willing to answer questions and help students to fully understand all the materials. Her teaching style is also very engaging, as she constantly asks questions during class and occasionally plays youtube clips of aircraft-related topics.",
            "comment_grading": "Final scores haven't been released yet, but I believe the grading for this course is quite good. Getting around mean should result in a B to B+.<br /><br />Final Grade: A",
            "comment_workload": "It really depends on how high your standards are for your final letter grade. If you are aiming for A-range, you will have to spend long hours reviewing the lecture notes to completely master all of the content. However, if getting a B is satisfactory, the workload shouldn't be too heavy. After all, this course only has two homework assignments, four short online quizzes, a mid-term essay, and a final exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9LAAaCkdzVmSgzPEZ2aBLCSLE1PlujHk",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "godsend1001",
            "date": "Aug 07, 2022",
            "title": "GOOD COURSEE",
            "comment_content": "Content is very interesting for people who are genuinely interested in aerospace engineering. Although this course just barely scratches the surface, it provides a good overview of the whole Aerospace field, whether it be astronautics, aeronautics, or even to do with missiles and helis",
            "comment_teaching": "Prof Rhea teaches this course with all her passion and energy. I remember we had to miss a lecture cuz she was getting awarded for something, she conducted a make-up class on Saturday. She is genuinely very nice and is happy to meet with students before and after lectures for queries, or even for lunch :))",
            "comment_grading": "The Grading is quite fair. The TA's and Prof Rhea always try something new so for fall, instead of a proper mid-term we had almost to write a &quot;passion project&quot; related to aerospace, as well as an in-class debate about topics on aerospace. Although the discussion was a bit of a mess, it was definitely more fun than a traditional exam. The final exam was a take-home exam but the questions were all new we got 72 hours to complete them. Quite fair and lenient I would say",
            "comment_workload": "There were a couple of quizzes and research papers. It's honestly not that much if you stay on top of things. It shouldn't be that big of a deal even if you don't. We were given 4 homeworks which was exciting and if you paid attention in lectures, you would be able to solve them.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TM6CoPHB3AkjVZz4IeMXrrt6rk1BS8SW",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JasonNg",
            "date": "Aug 07, 2022",
            "title": "Great course",
            "comment_content": "Content is very interesting to anybody interested in planes. A little bit maths heavy for your first semester if you haven't done much calculus prior to taking this course.",
            "comment_teaching": "Prof Rhea is very laid back but also very passionate about her course. Always happy to help after and even outside of class with any questions relating (or even not relating) to course material.",
            "comment_grading": "Most students will get a &quot;B&quot; with decent grades around the mean. However if you pay attention and do all the homework properly you should be fine.",
            "comment_workload": "Workload is quite good. Plan to spend about 1.5-2hours a week on weekly homework sheets. Midterm was a powerpoint presentation on one of two chosen topics mainly discussing personal opinions that are related to course material. The midterm presentation does not need to be presented in class. Final exam is like an extra long homework sheet that took me a few days to finish.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qbwlkWJkSDuPcPvkq3hiTLBFHHOdgejR",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jasonkan",
            "date": "Aug 26, 2021",
            "title": "",
            "comment_content": "The content is broad and fundamental. They are really appropriate for an introductory course.",
            "comment_teaching": "You can ask question any time you want and the atmosphere in class is delightful and interactive. <br />The TA also explain things well without telling you the direct answer.",
            "comment_grading": "Participation will take into account, and the rest is how well you do in any assignment and exams.",
            "comment_workload": "For those who don't have strong engineering and math background, you may find the workload a little bit too tough. This is one of the course that you should really try hard to get a good grade.<br />Workload including midterm project and final exam. Both are open book and give you a huge amount of time to finish (48 hours for final exam). But it's hard, for sure.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0EuMj89lms6nBE31fZ5rZc64LUtw9c45",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Marco Chan",
            "date": "Jun 29, 2021",
            "title": "",
            "comment_content": "Basic contents about aerospace engineering.<br />Ther are fun and easy to learn.",
            "comment_teaching": "Prof. Liem is a nice and kind lecturer. She is willing to chat with you after the lesson if you have any other questions ask her. If you are passionate about aviation, you must like her teaching style. She often makes jokes during class, so you will not get bored.",
            "comment_grading": "It is very good, if you hand in homework and do the online quiz punctually, then you will not get a bad grade at least.",
            "comment_workload": "Reasonable workload. There are a few quizzes after 2-3 chapters, and around 3-4 homework projects. There is no mid-term exam, only the final exam which is a take-home exam. The final exam questions are interesting!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BSf7LoWJItUVPuDbmobZCheeMF3eW0XO",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "EricWongFatGuy",
            "date": "Jan 17, 2021",
            "title": "Fun Course for AE students",
            "comment_content": "If you like airplanes or the aerospace industry, this course is really FUN. This is the AE fundamental course so if you wanna get in AE, take this asap.<br /><br />It basically introduced everything u will learn in AE, like aero-fluid-thermal-dynamics. And Rhea talks a lot about the fun stuff in the Aerospace world, and herself (which is good and friendly).<br /><br />Overall pretty recommend, provided that you enjoy planes.",
            "comment_teaching": "Rhea is a pretty good teacher, She explains stuff pretty clearly.<br />The accent is thick you can understand no problems, well it's aight for me, idk bout u(actually it is more clear to me, idk why). I think if it f2f the lesson will be better and more interesting.<br /><br />I like the emails, just to point this out.",
            "comment_grading": "The grading is lower than I expected, but I guess if you go to all class and actually pay attention you can get higher. Also there is participation marks(I think) so maybe my grade is bad bcuz of dis.",
            "comment_workload": "The workload is a bit large, it has a project, a academic writing, some quizes and some homework, but they are all really fun. So, Brace yourself? its not a work-free course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kPdoPqD4tPl30GJB0eQ8dkk8Czh5ZVp7",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "科大MECH癲佬",
            "date": "Aug 14, 2020",
            "title": "Much better than expected",
            "comment_content": "If you like aerospace engineering, this will be a very interesting course to take. The content is pretty basic such that a beginner with no prior knowledge can still easily follow. Takes you from what is aerospace engineering to you being able to make some simple calculations on your own.",
            "comment_teaching": "The professor is very funny. Not the kind which they try so hard and become cringy, but rather the way she incorporates dry humour made the course very attracting. The notes are intentionally incomplete at places such that you have to go to classes. Lecture videos are only available on-demand but she is extremely accessible via email.",
            "comment_grading": "The grading is alright. It's my first course in UST, no comment.",
            "comment_workload": "There were 4 assignments in total, each one requires about 4-5 hours of work. No reading was needed and there were one midterm and one final.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "U2Ry1ktyUimbj38CYRQt4qlGweFrVGIs",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sagara",
            "date": "Jun 02, 2020",
            "title": "",
            "comment_content": "Quite a lot of things to study for the whole course, but the syllabus taught in the course is very useful for later MECH courses.",
            "comment_teaching": "Does not write out the steps and solutions in the lecture notes, so will need to attend every lecture to solve them with her, but her explanations are pretty detailed so no loss in attending them.",
            "comment_grading": "Grades given according to the curve, mean grade will be B. The mean in the class is not low.<br /><br />Final exam weighs 60%",
            "comment_workload": "There are four assignments in the course with around 10 long questions each, not too easy but covers everything taught in the course and is similar to the exam questions.<br /><br />Suggest to copy some home work questions on the cheatsheet.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0jRZJi1KMRuJtczOOZoYaRI7gwYDZk37",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Andyandy",
            "date": "May 30, 2020",
            "title": "",
            "comment_content": "All the basics and foundations for the courses in year 2<br />1. Thermodynamics<br />2. Propulsion<br />3. Aerodynamics<br />4. Fluid dynamics<br />5. Standard Atmosphere<br />6. Aircraft Performance<br />7. Aircraft Structures",
            "comment_teaching": "Teaching was not boring and she explains everything quite clearly<br />Remember to drop down the notes as it will help you understand the contents more in-depth.",
            "comment_grading": "Her grading was nice as long as you do not miss any lessons and gave her a good impression at least.",
            "comment_workload": "Acceptable workload with 4 homework and Mid-term + final<br />For freshman, you need to spend more time on understanding the contents as they may be difficult at first",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RYDTRVeteLZBg4DgaVf93BgFTPe5y2fj",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AeroEngineer",
            "date": "Mar 20, 2020",
            "title": "Introduction to Aerospace Engineering",
            "comment_content": "This course is very interesting, especially for an aspiring aero engineer. Following are the contents:-<br />Introduction<br />Fluid Dynamics<br />Aerodynamics<br />Aircraft Structures<br />Materials Technology<br />Basic Thermodynamics<br />Propulsion",
            "comment_teaching": "Rhea is an incredible teacher. She starts from the base concepts and progresses slowly to the advanced stuff.",
            "comment_grading": "4 HW Assignments: 15%<br />1 MidTerm Exam: 25%<br />1 Final Exam: 60%<br />In the Fall 2019-20 Sem, when the university shut down they converted into an online assessment which lasted for 48 hours.",
            "comment_workload": "The workload may seem fairly normal but unfortunately, the assignments are super tough. Midterm exams don't have enough time to complete them LOL",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zfuGcWGV5dRKixttBCuz6Q8R8SNMy9mz",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DPhil56",
            "date": "Feb 17, 2020",
            "title": "Good",
            "comment_content": "Interesting content<br />Involves brief content of different engineering fundamentals<br />Good course for engineering and science students",
            "comment_teaching": "Very passionate teaching<br />best prof I've met yet<br />she remembers your faces so don't skip lessons :)",
            "comment_grading": "Actually decent just remember to hand in all assignments don't be like me<br />slightly above mean for both mid term and final, 90% for assignments handed in<br />but missed 2 assignments (10%of the whole grade)<br />final got C+<br />but by the grade my friend got, above mean for midterm and final, plus 80% in all assignments should get you a B+",
            "comment_workload": "4 assignments in total<br />1 midterm(tight in time)<br />this sem was a take home final",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "e7sWTUAzxsv9bSfa2gT6bdFVohjahUYt",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ilef",
            "date": "Jan 29, 2020",
            "title": "Interesting Lectures",
            "comment_content": "Content is very diverse but there was no focus or in depth knowledge gained. <br />the course introduces different topics in aerospace engineering :<br />structure<br />Material science / composites<br />propulsion <br />performance <br />standard atmosphere <br />thermodynamics <br />The goal was getting to know the parameters of design.<br />we also had a guest lecturer who presented composites science.",
            "comment_teaching": "The teacher makes the lectures interesting. Friendly atmosphere. <br />she tries to link the subject to real cases and events in the history of aerospace industry and also includes videos.<br />She also tries to make it interactive and asks us&nbsp;&nbsp;questions.",
            "comment_grading": "Grading is lenient with opportunities to improve scores with bonus points and more.<br />I got an&nbsp;&nbsp;A doing the assignments and attending lectures. no extra time was needed to grasp the materials.",
            "comment_workload": "workload is fair. assignment every 3 weeks with enough time to submit. they cover all parts of lectures and&nbsp;&nbsp;include some open questions and problems that require more research.<br />midterm exam is similar to assignments",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "reWJCOyfMnJNHYye5Yu9hZRUac1lY6ia",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wilhelm_aye",
            "date": "Jan 16, 2020",
            "title": "Introudctory course to AE",
            "comment_content": "As an aviation lover you would enjoy the content of this course. However as it is about engineering but not aviation in general, you have to calculate and solve different problems. This course basically includes most, if not all, disciplines that you will learn in future years if you study AE.<br /><br />Topics include:<br />-Fundamental thoughts<br />-Fluid dynamics<br />-Aerodynamics<br />-Aircraft structures<br />-Materials technology<br />-Standard atmosphere<br />-Aircraft performance and mission analysis<br />-Basic thermodynamics<br />-Introduction to propulsion",
            "comment_teaching": "Rhea is a very passionate professor who loves teaching (you can feel in in the lectures). Her lectures were never boring and you can feel energized just by attending her lessons. She is very friendly and at the same time humorous.Rhea is good at remembering faces, so make sure not to skip much of the lessons.<br /><br />She would invite guest lecturers for different topics, for example material technology.",
            "comment_grading": "Homework: 15%<br />Midterm: 25%<br />Final: 60%<br /><br />Homeworks and midterm have bonus questions. Midterm allows a single page A4 sized cheatsheet so you can write as much information as you can on it. Midterm usually features &quot;The name of TAs&quot; as bonus question. Classes and on-campus final examinations were cancelled or postponed, so the final exam was changed to take home exam with 36 hours for us to finish. <br /><br />HW1: 94/100&nbsp;&nbsp;(Mean:86.5)<br />HW2: 102/100&nbsp;&nbsp;(Mean:87.9)<br />HW3: 97/100&nbsp;&nbsp;(Mean:88.6)<br />HW4: 104/100&nbsp;&nbsp;(Mean:86.7)<br /><br />Midterm: 95/100&nbsp;&nbsp;(Mean:81.1)<br /><br />Final: 91/100&nbsp;&nbsp;(Mean:74.7)<br /><br />Grade: A",
            "comment_workload": "There are 4 homeworks in total.<br />Each homeworks were due in two weeks. Enough time were given to finish them and they are quite easy. Almost all information and required formulae can be found in lecture notes.<br /><br />Need to spend time to revise and validate those learnt in lessons. If you don't and fall behind schedule, it would be hard for you to follow the progress of the lessons. However, it is generally easy to catch up, for example by doing the homework and looking up informations in the notes.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "E5WX8H3Op5doIlSRZLmp2uSMccVTqBbK",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bluemoon",
            "date": "Feb 14, 2019",
            "title": "",
            "comment_content": "Aerodynamics, aircraft performance, aircraft structures... fundamental knowledge on aircraft. There are some equations that you have to understand as questions in exams often require you to really know how the formula works rather than simply plugging in numbers.",
            "comment_teaching": "Probably the best professor I would ever meet in UST. Rhea is really passionate and is super friendly. She welcomes and encourages us to raise all kind of questions. She also would remember you once you asked/answered her questions!!",
            "comment_grading": "Really lenient grading. An extra chance on re-attempting midterm was given in my semester to improve our midterm grades. <br /><br />Grading policy:<br />4 Homework assignments 15%<br />1 Midterm exam 25%<br />1 Final exam 60%<br /><br />Bonus marks maybe given to you if Rhea remembers you!",
            "comment_workload": "4 assignments throughout the semester. 1 midterm, 1 final. No attendance but just try your best to attend all lectures as Rhea MAY recognize you.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ceCBQD4BJMblgmwui2ZYTGbKrpbbokSS",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "施华明智",
            "date": "Jan 26, 2019",
            "title": "Interesting and Good",
            "comment_content": "About the very basics of aerospace engineering. Including but not limited to:<br />Fluid dynamics<br />Aerodynamics<br />Propulsion systems<br />Structure<br />Material technologies<br />And so on...<br />Interesting enough for any engineering student",
            "comment_teaching": "Prof.Rhea is an enthusiastic person, with great commitment to her lectures. Nevertheless, she also grades homework herself. You can easily follow her lectures and get knowledge that she wants to convey.",
            "comment_grading": "I think it's quite good. I got (much) higher than mean for midterm and I didn't know the result of final. I got A+.",
            "comment_workload": "There're 4 assignments in total. You'll have 2 weeks for each of them. There're about 7 problems for each assignment, which takes quite a long time. But since you have long time to do it, it's acceptable.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hBX1CCd9sGPYdKlQMpVyCRJIMQGYrfLb",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "I Want 1st Hon!",
            "date": "Jan 04, 2019",
            "title": "This Course is REALLY worth taking!!!!",
            "comment_content": "Course Curriculum:<br />1. Introduction<br />2. Basic Mathematics <br />3. Fundamental Thoughts<br />4. Fluid Dynamics<br />5. Aerodynamics<br />6. Standard Atmosphere<br />7. Aircraft Performance &amp; Mission Analysis<br />Midterm on above 7 topics (with 5 bonus mark questions ^.^, i.e. what do you like about this course, 3 ways to counter gravity)<br /><br />8. Aircraft Structures<br />9. Materials Technology<br />10. Basic Thermodynamics<br />11. Introduction to Propulsion<br />12. Future trend in aerospace design (*a few content is examined, about strut-braced wing.)<br />Final on all 12 topics (No bonus mark T.T)<br /><br />There are around 4-5 lessons not teaching above content, but the lessons are used for course review, two guest lectures, midterm paper explanation, and one extra topic (aerospace &amp; mission analysis discussion).<br /><br />For both midterm &amp; final, 75% Calculation &amp; 25% Conceptual Questions. For HWs &amp; Exam calculation questions, just simply substitute the numbers into given equations copied from your lecture slides/cheatsheet and you will get the answer eventually. However, you need some understanding (maybe thoroughly understanding) for some topics in both HWs and exams, because Rhea will examine these questions deeply, and you may not be able to find the definite answers in the lecture notes.",
            "comment_teaching": "Rhea is a very passionate and responsible professor. She goes through the slides quite fast and you should pay attention. Sometimes, she will mention keywords which are not inside notes and it is not uncommon. She gives us second chance to take the midterm exam (take-home, but no cheating!) ^.^<br /><br />Sometimes, students may feel tired and she will encourage us and teach some main points instead of going through all slides and words. She encourages us to add oil in both exams by giving us chocolates during lessons (this behaviour is very rare that ONLY a FEW professors in UST would do that)! <br /><br />Try NOT to skip any classes! If you study this course only for grades, then you may skip some topics that are not out of scope, and pay attention to the keywords, proofs, examples that she taught, which may not be inside the notes. However, if you take this course because of the AE interest, you should attend ALL lectures and pay full attention! ^.^<br /><br />Although Rhea has some Indian accent, which I cannot understand at first (first two lessons), I can understand what she says after a week ^.^",
            "comment_grading": "HW (15%)<br />HW1 91/100<br />HW2 90/100<br />HW3 100/100<br />HW4 105/100<br /><br />Midterm: (25%)<br />88/100 (60% counted in real exam)<br />98/100 (40% counted in take-home exam (optional))<br />Hence, my final midterm score: 91.2/100<br /><br />Final: (60%)<br />(No announcement of scores)<br /><br />Grade: A<br />Remember, if you perform well and answer questions, and if Rhea remembers you well, she MAY help you up a sub-grade.",
            "comment_workload": "4 HWs, each has 6-10 questions, and 5 marks bonus questions. Some may be difficult but some are straightforward. It may take you about 2 hours to finish it (I finish on my own, maybe if you discuss with others, which you may get a better score in HWs). <br /><br />You may hand in the softcopy before lecture, but it is a MUST to hand in the hardcopy before or on the deadline. Unless valid reason (e.g. sickness), you can submit the softcopy earlier than deadline and hand in the hardcopy to the TA later.<br /><br />For midterm and final, you can have cheatsheets (1 A4 SIDE for midterm, 2 A4 sides for final). I use around 5 days to finish these cheatsheets. ALL EQUATIONS SHOULD BE PUT INSIDE THE CHEATSHEET &amp; SHOULD BE EASILY FOUND!!!!! (Some people make the cheatsheet too messy, and they panic in exam, resulting in losing a lot of marks due to incompletion and careless mistakes)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "I5EGXsiU15wJ1Fp9XceEirqoRNXG9Ac3",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JJThompson",
            "date": "Jun 19, 2018",
            "title": "Great Course and Loving Instructor",
            "comment_content": "A AE major required course and an overview of the AE curriculum with content reference:<br />- Introduction<br />- Basic Mathematics <br />- Fundamental Thoughts<br />- Fluid Dynamics<br />- Aerodynamics<br />- Standard Atmosphere<br />- Aircraft Performance &amp; Mission Analysis<br />- Aircraft Structures<br />- Materials Technology<br />- Basic Thermodynamics<br />- Introduction to Propulsion<br /><br />The course covers a lot of topics but in a brief way, where it has a huge portion of mathematical calculation yet not requiring calculus--simply substitute the numbers into given equations and you will get the answer eventually. It is overall a fun course for beginners in aerospace and very inspiring for those who want to aim their career at AE.",
            "comment_teaching": "Rhea is really the best and loving professor I have seen! (personal view) Her teaching speed is appropriate and she pauses sometimes if she thinks we are tired or what. She encourages us to tackle our midterm and finals by giving us candies and chocolates during lessons! Be aware that not all contents will be shown in the notes and Rhea always do the proofs or complete the missing parts of the notes during lessons, so don't try to skip classes, you will suffer, and she will be unhappy as her students seem not to like her ha.<br /><br />The TAs are helpful, although I didn't find them to help, I saw other students asking stuffs and the TAs were actively answering patiently. One of the TAs will teach in one of the lessons that covers the completeness of the Bernouli's equation which is interesting.<br /><br />There may be guest lecturers that come for 1-2 lectures, which are the best opportunity to skip lessons ha, the content by them are not included in the exam, yet they could be really interesting or boring depending on how the lecturer's performance. This term there are 2 guest lecturers coming, and they talked about Airworthiness(very boring and messy content) and Space Flight(very interesting and organized content). You can always chat with them after lessons.",
            "comment_grading": "15%~Homework assignments (4 in total)<br />25%~Midterm (1-page cheat sheet)<br />60%~Final (2-page cheat sheet)<br />?%~Participation (although not required, you can try to skip the course and see if you can keep up with the content ;) )<br /><br />HW1-4: 404/415<br />Midterm: 105/105<br />Final: unknown<br />The grade is A+ at the end.<br />Midterm and Final have ratio of Calculation-to-Concept at about 8:2 to 7:3, where obviously you have a lot of simple yet tricky maths to do. You can tackle the maths easily with the aid of your cheat sheet with all the equations written on it. The remaining parts are all concepts from notes or homework, so just copy the highlights from the course notes and jot some notes from the homework on the cheat sheet.<br />Cheat sheet saves the day, don't waste it!<br /><br />[For exams, if you manage to find sources, remember for 3 times: DO THE Past Papers TO PREPARE FOR THEM, and you won't regret coz there will be questions from PPs in the exams.(it seems that as PPs are not provided in Canvas for reference someone was/were being lazy setting up questions XD)]",
            "comment_workload": "4 homework only of ~100 marks@HW, each may cause you 1.5-3 hours to complete. (Ha I do the homework slowly) There may be bonus questions in the hw which may require external research online or in-class mentioned stuff, and they contribute ~5 marks per HW.<br />The questions of HW are mainly new ones, but they often mix with some old questions from HWs or exam papers from previous or earlier years. While you can try to opt for sources, I highly recommend you to do it on your own, as if you can finish them by yourselves, then you can certainly perform well in Midterm and Final, coz those questions are just modified ones from HWs.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rAlq0f6iJhRn7bne4cu4uqvCkTg6Rc2f",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AndNowIKillYOu",
            "date": "Jan 25, 2018",
            "title": "",
            "comment_content": "Most of the content is the basic knowledge of aviation. It includes some basic formula from DSE physics like equations for Gas law and some Newton's law. And then it will introduce some basic equations of thermodynamics and aerodynamics. There will be at least 70 equations but over 90% of them are pure substitution and some of them are very simple. The remaining content would be words about materials, structure and engines. They mostly appear in one sentence or in point form. All of them are easy to understand and some of them are already learned in secondary school. I would say the content is not difficult.",
            "comment_teaching": "Prof may not be the best in teaching but she is better than the others in the school. Attendance is not required but sometime she may teach something that did not appear in lecture notes which included in the assignment and exam. She could also explain complicated things in a simple way. Sometime there will be sessions for guest lecturer and TAs. The teaching of guest lecturers varies. Some are very boring and some are interesting but the content is not included in the exam. TAs' teaching is quite interesting if u pay attention. Overall, it is acceptable",
            "comment_grading": "HW1 102/105<br />HW2 92/100<br />HW3 88/105<br />HW4 98/105<br />MidTerm 97/105<br />Final (I didn't hv the result )<br />The grade turns out to be A-, maybe I screwed up in the final.<br />Midterm allow cheat sheet with one side and Final exam allow cheat sheet with two sides. The cheat sheets play a critical part in both exams. Prepare it wisely.",
            "comment_workload": "4 assignments in one semester. Each has 8 to 10 questions and they are not difficult, just substitution. It takes about 1 to 2 hours to finish it on ur own but it might take only half an hour if u discuss it with ur friends. If there are still some questions that u can’t answer, it might be a mistake made by TAs as they are responsible for designing the homework. Beside the TAs are very helpful and kind, u can ask them any problem about the course and assignment. TAs would allow late submission if u really provide a good reason to them.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6PIOXWRfuAJLOdXGvmaFQcADlo8pB0jE",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Brian L.",
            "date": "Jan 23, 2018",
            "title": "Fair workload, nice lecturer, useful knowledge",
            "comment_content": "useful knowledge in aerospace engineering.&nbsp;&nbsp;Things perhaps quite hard. Notes equipped with examples of questions and daily examples in the aerospace engineering field.",
            "comment_teaching": "Teaching was nice and clear. You gotta catch up or else you will miss a lot of things and find it difficult to understand the following lectures. Videos in class can help understanding.",
            "comment_grading": "Relatively lenient in grading in exam. Very lenient grading in assignments.",
            "comment_workload": "Got 4 assignments in a semester, one mid term test, one final exam. No presentation, no attendance taking, no tutorials, reading, etc. Workload is acceptable but relatively high when compare to other courses.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qt3T0mwIVY49jTV8e9XG5MjpMFKnJGPw",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kero星人",
            "date": "Jan 09, 2018",
            "title": "唔好諗住係度擦grade",
            "comment_content": "introduction to AE<br />基本上AE每個topic都講少少嘢，coverage超多但唔深入，cheat sheet幫到你",
            "comment_teaching": "Rhea口音有啲重，要一啲時間先可以適應<br />教嘅factual content好多，但考嘅主要係計數<br /><br />今年有4個guest lecture，2個prof堅有料，但有啲深，好彩唔考",
            "comment_grading": "4份功課+midterm 先計 60% grade<br />功課全部滿分+Midterm above 2 sd = B",
            "comment_workload": "4份功課+midterm 先計 60% grade<br />每分功課大約4－6條Q<br />midterm final可以有cheat sheet",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WHQ6yxaBI5cOptX1YlSReOchvgsDTCnr",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Small_Potato",
            "date": "Dec 30, 2017",
            "title": "Very interesting course for aircraft enthusiasts",
            "comment_content": "Introduces the basic principles of flight, such as fluid dynamics, aerodynamics, physics of the atmosphere, structures, flight performance, materials sciences, thermodynamics, propulsion mechanisms, and future trends of the aerospace industry. You get to understand how different disciplines of an aircraft affect each other and work together to make a flight possible. The contents are introductory but some may find it difficult to catch up with the physics. Some students who took this course are even from the business school.",
            "comment_teaching": "Rhea is very devoted to teaching. She shows the derivation to most of the equations in lesson so that you know the assumptions and understand how they are formulated. If you miss the lessons, then you will miss those derivations too. Other than that, her explanations were very clear, and she sometimes makes jokes in lessons to make the lesson funner.<br /><br />Informative videos about aircraft will also be shown at times. Also, there were 2 guest lectures, one on airworthiness and another on astronautics engineering. Personally, the astronautics lecture was more interesting. The TAs will also teach in some of the lessons. Overall, the lessons are very enjoyable.",
            "comment_grading": "Rather lenient grading. <br /><br />Grading policy:<br />Homework 15%<br />Midterm 25%<br />Finals 60%<br />Participation n%<br /><br />For homework, there are bonus questions occasionally, which gives you an additional 5 marks. <br /><br />In the midterm, as long as you show your attempts to the question clearly, you will be awarded some marks. There was a 5-mark bonus question too. Hence, the mean is rather high (84.4). The finals mark is unknown. <br /><br />If you answer/ask questions actively in lesson, Rhea will remember you and give you additional marks to your overall score.<br /><br />Homework: 410/400 (15 bonus points)<br />Midterm: 91+5/100 (SD was around 14?, so above mean ~0.83SD)<br />Finals: Unknown<br />Participation: Unknown (I answered some questions)<br />Grade: A+",
            "comment_workload": "There are in total 4 pieces of homework, which takes quite some time and effort to complete. You may need to google some of the answers for the conceptual questions. Some of the problems require very lengthy calculations and steps. If you pay attention to the demo questions Rhea does in lessons, you will know the steps to some of the questions.<br /><br />For the midterm, you can bring a single-sided A4 cheatsheet and for the finals, you can being a double-sided A4 cheatsheet. around 80%+ questions will be on computation (new question types may pop up) and the rest are explanations.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FSen90743bqpeKa0oqHaxAiVaId4O9ST",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "l,tommy",
            "date": "Nov 14, 2017",
            "title": "",
            "comment_content": "This course introduce basic concept of AE<br />1. Fundamental thoughts<br />2. Fluid dynamics and aerodynamics<br />3. The atmosphere<br />4. Aircraft performance and mission analysis<br />5. Aircraft Structures<br />6. Material technology<br />7. Thermodynamics<br />8. Propulsion<br />9. Introduction to space flight<br />10. Aircraft design<br />11. Future trend<br /><br />I think this course is useful for deciding whether to choose AE in the future or not. Also, most of the topics are quite easy to understand. I think the most important topic is fluid dynamics.",
            "comment_teaching": "Prof. Liem is a nice teacher. Her accent was a little bit hard to follow for me at first. She is a caring teacher. When she thinks that some topics are too boring, she plays some interesting videos. Also, she gave us chocolate before test to cheer us up. If you get low marks in tests, you are the one to blame.",
            "comment_grading": "Grade will be adjusted referring to the students' performance.",
            "comment_workload": "Light workload.<br />One assignment every two week. About 6-8 questions per assignment. There are some bonus questions for most of the assignments, you can learn a lot through searching ideas for those bonus questions.<br />Not quite difficult. Need to do revision.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XoK2V8EimtfQ57pfXWDxD8lVQyZN7cvQ",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Shirley Chien",
            "date": "Sep 01, 2017",
            "title": "Easy and Fundamental AE course",
            "comment_content": "The course includes almost every basic parts in aerospace engineering. You will learn basic static dynamics, fluid dynamics and some materials. Basic design concepts and structures were also introduced in the class.<br />If you have read something about AE before, it won't be a problem for you to get through the contents.",
            "comment_teaching": "Rhea speaks English fluently and clearly. It's comforting to understanding all the stuff the professor said in class. And interesting videos were played on class. Though it's an easy course, you still need to pay attention in class, for there will be some contents not provided in the lecture notes.",
            "comment_grading": "The grade is good. Basically, you can get A grade if you score is one SD over mean. There were a lot of conceptual questions in the exams. You need to distinguish the differences and learn how to implement theory into the practical problems. Compared with the midterm, the final exam was a little harder, but you can make through with good luck:)",
            "comment_workload": "There are four assignments in total, one every two weeks. The homework is not very difficult if you listened carefully in class. Everything you need to solve problems could be found in the lecture notes.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3jX0D9p9lutTPortZBjhQWhKXuGvxhuV",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "csh209",
            "date": "Aug 31, 2017",
            "title": "",
            "comment_content": "The course topics are as follows:<br />1. Introduction (Wt is engineering, brief history of aerospace engineering, etc, not important for exam)<br />2. Maths (Briefly introduction of the mathematics needed in this aspect)<br />3. Fundamental thoughts (Gas laws, the idea of shear stress, etc)<br />4. Fluid dynamics and aerodynamics<br />5. The atmosphere<br />6. Aircraft performance and mission analysis<br />7. Aircraft Structures<br />8. Material technology<br />9. Thermodynamics<br />10. Propulsion<br />11. Introduction to space flight<br />12. Aircraft design<br />13. Future trends<br /><br />Although only the easier parts of each topic are being taught, it would still be quite tough for students without basic physics knowledge to learn",
            "comment_teaching": "The professor is very enthusiastic in this field and she is available to answer any types of questions asked by us.",
            "comment_grading": "Assignments x4&nbsp;&nbsp;15%<br />Midterm&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;25%<br />Final&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;60%<br /><br />As the questions in the assignments and also the mid-term exam are mostly similar to the examples provided in class, most of the class would get full mark in the assignment and the difference of grades are mainly determined by the final exam",
            "comment_workload": "The workload of this course is relatively low as we only had 4 assignments (mostly calculation using the formulae taught in class and provided in ppt) throughout the whole semester, and most of the questions are similar to the examples provided in the ppts.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XssFq1WOgD7XZWGVA9ZwdcIMeBUYFeCg",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Antares Zhang",
            "date": "Jan 26, 2017",
            "title": "",
            "comment_content": "the course is basically &quot;everything you need to know in order to understand how we fly&quot; kind of stuff. with theoretical and conceptural knowledge, it truly provide an overview on the aerospace engineering field. without the need for prior knowledge, actually quite interesting and comfortable to keep up with. if you are interested, just enroll and you will come back and write an &quot;A&quot; review<br />and we also get to say ALOHA! a lot :p",
            "comment_teaching": "prof is superb!! ultra responsible and patient, she is constantly updating the course content to fit our needs and interests.<br />lots of example provided and more than enough chances to communicate provided.",
            "comment_grading": "based on all the HWs and MT and Final, just follow what the prof ask us to do and the grade won't be too bad.<br />mine was good but my friend who actually doesn't have a big academical difference got a grade not so good. so i say this is not a easy A course. you do need to pay some effort.",
            "comment_workload": "only 4HWs to do, each take around 3hrs(i'm quite slow with HWs and i don't have friends to discuss with so it was kind of slow, avg should be around 2hrs each). i personally spent much more time on organizing the notes and concepts and key points, etc. so i spend total around 30hrs in the sem for this course. but considering that was 3 month total i say it is not so much.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ntq8sA1IqWsX7Df2luVizudoiqaysZfE",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Freda",
            "date": "Jan 25, 2017",
            "title": "",
            "comment_content": "Includes basic aerospace engineering concepts, e.g. aerodynamics, fluid mechanics, thermodynamics, aircrafts performance etc. Really good course for those who are interested in aviation as the contents are quite easy but useful. Most of them are just similar to DSE physics.<br /><br />Format of midterm and final exams are similar to homework, which include around 70% of calculation and 30% of short questions that test your understanding of concepts and definition.",
            "comment_teaching": "Prof. Liem is really good at explaining concepts and derivation. Although attendance is not taken, it is recommended to attend all the lectures as she will only do the derivation of equations and the solving of examples in class but will not put them in the lecture notes.&nbsp;&nbsp;She is also very nice to answer all of our problems and makes all of us engage in class by asking us questions or playing relevant videos.",
            "comment_grading": "4 Homework 15%<br />1 Midterm 25%<br />1 Final 60%<br /><br />Mean scores<br />Homework: usually around 90%<br />Midterm: 75% (sd 12)<br />Final unknown<br /><br />I got nearly full mark in all homework and got 70% in the midterm, final score unknown. The final grading is B.",
            "comment_workload": "Total of 4 homework throughout the course, with the first 2 cover the first half of the contents and the other 2 cover the rest. The midterm covers topics in hw 1 and 2, and final covers topics in all hw. Cheat sheets of single side A4 and two side A4 are allowed in midterm and final respectively. <br /><br />Each hw includes around 5-7 questions that are similar to the examples demonstrated in class. It required around 2-3 hours to complete. Prof. will release the hw in Canvas around 2 weeks before due date.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0BCemAqucPzDmsfLxFT7OzmBSPsEhufE",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bonobono",
            "date": "Jan 20, 2017",
            "title": "",
            "comment_content": "very basic<br />no advance math involved.",
            "comment_teaching": "She's very friendly and kind. She always encourages her students to ask questions. She is always willing to explain stuff in detail and answer student's problems. <br /><br />Lectures can be a bit boring but I recommend attending them as she points out important concepts during lectures and most of the times, they come up in midterm and final.",
            "comment_grading": "midterm - 25%<br />4 assignments - 15%<br />final - 60%<br />no attendance <br /><br />Lenient marking standard.",
            "comment_workload": "Only 4 homework which you need to hand in. They can take few hours to complete but very reasonable amount.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lZ2f2ICsf9F3yXW9Sj5ZAhm8bm4shyxg",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sunny Ng",
            "date": "Jan 12, 2017",
            "title": "The course for you if you are interested.",
            "comment_content": "-fundamental thoughts <br />-fluid dynamics<br />-aerodynamics<br />-standard atmosphere<br />-performance &amp; mission analysis<br />-aircraft structures<br />-materials technology<br />-basic thermodynamics<br />-propulsion<br /><br />The main objective of this course is to give an overview of topics pertaining to aerospace engineering. The focus will be mainly on aeronautical engineering (atmospheric vehicles), covering the above topics.<br /><br />You will also be introduced to the non-engineering aspects of the \feld, including airline industry, cost estimation, environmental impacts of aviation, policy and regulations. A brief introduction<br />of astronautical engineering (space flights and rocket science) will also be given nearing the end of the course.<br /><br />The materials covered will only be at an introductory level. For students with absolutely no background on aerospace, you will find the course just fine. The powerpoint slides have varying length, but if you pay attention during class, you will find most of them pretty straightforward.",
            "comment_teaching": "A very kind lecturer. She is always willing to explain stuff in detail and answer student's problems. It's fine to ask her about questions regarding your homework assignments too! She prepares the powerpoints herself, works on some example questions in class and makes the course pretty interesting.",
            "comment_grading": "15% Homework assignments × 4<br />25% mid-term exam<br />60% final exam<br /><br />The homework assignments require some thinking. Once you know how to solve the problems in the homework assignments, you will find the exams not too hard.<br /><br />For homework assignments, you will be given plenty of time to complete them (usually more than a week) and it's rather easy to get over 90% (even 100%). The mid-term exam is quite a challenge due to the time constraint but for the final exam, you will have plenty of time once more. <br /><br />Being able to understand most of the content and knowing how to apply the formulas will get you a pretty nice grade within the A range. I have no idea what grade the mean lies in but the gradings are quite lenient.",
            "comment_workload": "As mentioned, there are only 4 homework assignments. You can most probably finish them within 2-3 hours (which means a rather light workload if you spread it out for 13 weeks).<br /><br />For the exams, you are given a cheat sheet (1-sided for the mid-term and 2-sided for the final). This means you barely need to memorize anything.To excel in this course, just make sure you understand the content and know how to use and apply the formulas.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CcAICFBhatP0Lc2KZqCI2rIybme3cP2o",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lolololhaha",
            "date": "Jan 08, 2017",
            "title": "Professor is superb!",
            "comment_content": "A very brief introduction course to Aerospace Engineering.<br /><br />Content included before mid-term exam:<br />Introduction to some basic math<br />Fluid Dynamics, <br />Aerodynamics, <br />Standard Atmosphere, <br />Aircraft performance and mission analysis.<br /><br />After mid-term exam: <br />Structural design and analysis of aircraft, <br />Materials technology, <br />Thermodynamics,<br />Propulsion,<br />and some introduction to Astronautics.<br /><br />Before midterm, a lot of calculations are required. Don't simply plug in numbers to the formulas to compute the answers. It is important to understand the conditions where the equations are adopted.<br /><br />After mid-term the content is rather conceptual which less calculations are required.<br /><br />Most of the questions in the exams will mix content from different powerpoints together. (e.g. Question linking Standard Atmosphere and Aerodynamics).<br /><br />midterm:single sided A4 size cheat sheet<br />final:double sided (so remember to keep the one for midterm lol)",
            "comment_teaching": "Do attend lessons as some important examples and derivation of equations will only be shown during lectures.<br /><br />Professor and the TA are willing to help you if you have any difficulties.",
            "comment_grading": "I was enrolled in this course since I heard that getting good grade in it was easy.<br /><br />The marking standard for assignments are lenient. Although sometimes you may get confused with the score distribution of questions (like a 15-point question requires you to do simple computation but a 5-point question requires in-depth explanation :o) ). Marking standard for exams are similar.<br /><br />Statistics:<br />Midterm: 90/100 (mean:74.1 sd:16)<br />Homework: 402/405<br />Final:???<br />Grade: A<br /><br />To be honest, the grading system is quite opaque as you won't know the performance of you and your classmates in the final exam.",
            "comment_workload": "Quite light if you can meet friends who attend the same course and collaborate on the homework.<br /><br />There are 4 HW throughout the semester. They are good tools for you to get yourself familiarized with the course materials.<br /><br />Don't worry about the examinations. Just make good use of the cheat sheet allowed LOL.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wFaOY7hTORBDrfURbCvHo7265zj5L2Ya",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "martinc",
            "date": "Nov 25, 2016",
            "title": "",
            "comment_content": "Basic Aerospace Engineering knowledge including but not limited to Fluids, Aerodynamics, Mission Analysis, Performance, Structures, Materials, Thermodynamics",
            "comment_teaching": "Professor teaches very well and is clearly passionate about aviation. PowerPoints are intuitive and useful. Although the PowerPoints are posted online, it would be wise to attend class as the Professor goes through questions step-by-step. TAs are very helpful and will respond quickly to any questions.",
            "comment_grading": "Very Generous Grading for the midterm. Homework was graded appropriately.",
            "comment_workload": "Acceptable workload. About one HW assignment every two weeks. Some of the questions are quite challenging but if you pay attention in class it shouldn't be an issue.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "izBNgvhpko6gW1JUfVqL2oezv40fWPBn",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "helloitdog",
            "date": "Oct 11, 2016",
            "title": "Physics oriented course",
            "comment_content": "Fluid Dynamics, Aerodynamics, Mission Analysis, Performance, Structure, Thermodynamics. Mostly mathematics but understanding to concepts, vocabulary are required. If you are aiming to major AE, this is the course for you as it is a requirement for AE major and minor. Derivation to equations is not required in exams. MATH1012 level calculus is already sufficient to meet the needs of some derivation in assignments.",
            "comment_teaching": "Very in depth explanation and derivation on board. Professor and TA are willing to answer questions swiftly in class and in emails. Personally think the powerpoints are not worth printing out. Rather note down important stuff that prof show (examples, explanation of phenomena). Try to jot down examples that prof show in class as they may re-appear in assignments, test and exam.",
            "comment_grading": "Midterm 75/100<br />Final marks are not shown<br />Nearly full marks for all homework.<br />Overall: B",
            "comment_workload": "4 HW for the whole course, mid term and final is somewhat similar to homeworks however homework can be bit difficult to understand. TA and Prof are always helpful in helping us to complete the assignment. Knowing some coursemate friends are also good when you encounter difficulties.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZuM0d2EIB57bQdny9bluut2BXZmleXFD",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pang.",
            "date": "May 19, 2016",
            "title": "",
            "comment_content": "Pre-midterm: Fluid dynamics, aerodynamics, atmosphere, mission analysis.<br />The first two include general knowledge whereas the other two are specific to aerospace engineering.<br />This part is largely computational questions and requires a lot of equations.<br /><br />Post-midterm: aircraft structures, materials, thermodynamics, propulsion.<br />After the midterm there is less calculations and more conceptual questions.<br />Some knowledge is covered in other intro courses such as MECH1906 and CIVL1100.",
            "comment_teaching": "Prof Liem's teaching is generally not difficult to understand, quite fun to be in her class at times. Although I personally think some of the calculations can be explained more thoroughly...",
            "comment_grading": "MT 78/100 if remember correctly<br /><br />Another feature (at least for this semester) is that the question itself carries a lot of marks, yet the TAs do not deduct a lot for common mistakes, probably because this is a new course.",
            "comment_workload": "5 HW, one per two weeks.<br /><br />Each HW is not exactly easy to do, but at the very least I am able to be a &quot;deadline fighter&quot; every time and still get away with it. Although calculus is used to derive equations in class, it is never used in the HWs, MT and final, with the exception of a bonus question which is also pretty easy.<br /><br />Not much to memorize as long as you have a decent cheat sheet. 3 hours for final is already much more than you need.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rpwCDGXr3PAyasbtljjZ68ubO8ueLwzM",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "oscarieong",
            "date": "Oct 16, 2022",
            "title": "",
            "comment_content": "This course will cover :&nbsp;&nbsp;&nbsp;<br /><br />1 Introduction and Maths overview<br />2 Fundamental thoughts<br />3 Fluid dynamics<br />4 Aerodynamics<br />5 Aircraft structures, structural designs and loads, and structural basic analysis<br />6 Materials technology<br />7 Standard atmosphere<br />8 Aircraft performance and mission analysis<br />9 Basic thermodynamics<br />10 Introduction to propulsion<br />11 Introduction to astronautical engineering<br />12 Airline industry and aircraft design overview<br /><br />But the knowledge inside is just the very surface in aerospace engineering. It won't be too hard for you.",
            "comment_teaching": "The best professor.<br /><br />Rhea is very helpful and answers any questions in-depth and she truly is a very kind professor. Her method of teaching step-by-step ensures that everyone would understand.",
            "comment_grading": "The mean in this course is usually very high. For assignments, it is usually 80-85. For mid-term, it is 83.5. For quiz, it is 80 in average.<br /><br />Assignment 15%<br />Mid term 25% (it's a project instead of traditional one)<br />Final 60%",
            "comment_workload": "workload is reasonable. Assignment every 2-3 weeks with enough time to submit. All part of the lecture was included and some difficult questions.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1T8pNKmCcEact4B22Ag1Qp2pRhgJq9Gd",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "dk meh name",
            "date": "Jan 21, 2022",
            "title": "",
            "comment_content": "教啲introduction 嘅嘢咩都掂啲咁，建議有M2底先上呢嗰course<br />1 Introduction and Maths overview<br />2 Fundamental thoughts<br />3 Fluid dynamics<br />4 Aerodynamics<br />5 Aircraft structures, structural designs and loads, and structural basic analysis<br />6 Materials technology<br />7 Standard atmosphere<br />8 Aircraft performance and mission analysis<br />9 Basic thermodynamics<br />10 Introduction to propulsion<br />11 Introduction to astronautical engineering<br />12 Airline industry and aircraft design overview",
            "comment_teaching": "好有心好人嘅professor ，有咩想問都會答",
            "comment_grading": "鍾意飛機有研究開嘅人應該會覺得呢嗰course 幾正，都應該靚grade。不過冇研究開純粹想試吓睇吓有冇興趣嘅就唔建議，你唔會夠啲研究開嘅玩，跟住就會爛grade 幫手墊底，好似我咁C+哭撚咗。",
            "comment_workload": "全sem 兩份功課三份quiz 一份mid term assignment 一份final。功課同quiz require 你真係好透徹咁明白晒每個detail ，可以幫你溫埋書幾好嘅。mid term 就係比你揀topic 寫essay/ppt/video present/poster 。幾free 不過有啲麻煩唔知寫咩好。今個sem final 就因為肺炎所以比我哋online 做，比三日我哋做一份類似assignment 嘅嘢。整體okay 嘅不過有啲麻煩同埋尤其啲冇底嘅人要多啲時間去明。",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "WsrUF4WiqZ2nSZbmppuamSBLcQpPvd8g",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Vincentchan9839",
            "date": "Dec 31, 2021",
            "title": "Best for those who loves flying vehicles very much! (And also a GOOD grade course for year 1 freshmen!!!)",
            "comment_content": "Here are the topics I have learnt in this semester:<br /><br />-Introduction<br />-Basic Maths and Physics overview<br />-Fundamental thoughts<br />-Fluid dynamics<br />-Aerodynamics<br />-Introduction to aircraft structures<br />-Aircraft structures : designs and loads<br />-Structural basic analysis<br />-Materials technology<br />-Aircraft performance &amp; mission analysis<br />-Basic thermodynamics<br />-Introduction to propulsion<br />-Brief introduction to astronautics ***<br />-Introduction to the aviation industry ***<br />-Course review<br /><br />***: Do not have enough time to cover in this semester",
            "comment_teaching": "Professor Liem and the two great TA are very nice! <br /><br />Professor Liem would ensure you can catch up all the materials before moving to the next slide. If you have any questions, just ask her right since class participation will be counted towards your final grade. If you ask her frequently, she may also remember your face and your name. :) Sometimes, she may use some daily example like minibus turning left/right, meat, human muscle, cloth hangers to explain the abstract concepts. I find this is very useful as it help me to understand the topic much better. Bravo!<br /><br />For the two wonderful TAs, the TAs are called Mr. Go Nam LUI (Harry) and Mr. Ikeoluwa I. OGEDENGBE respectively. I have asked them about the homework assignment through emails and they can guide you to the answer very well (but not directly telling you the answer). Mr. Ikeoluwa I. OGEDENGBE even conducted a few lectures at the very end of the whole course (Since professor Liem approved him to do that and she thought his teaching is quite good), and I think his teaching is quite similar to that of professor Liem.<br /><br />Overall speaking, the teaching of all of them are excellent!<br /><br />:)",
            "comment_grading": "As I have mentioned above, this is a good grade course!<br /><br />Here is the grading policy:<br />-Mini individual assignments/quizzes: 15%<br />-Homework assignments: 20%<br />-Midterm assignment (An individual project): 15%<br />-Final exam: 40%<br />-Students' talk time + class participation: 10%<br /><br />Some statistics from Canvas:<br /><br />Mini assignment 1 (Basic Maths, Physics, and Fundamental Thoughts) (out of 100, have 5 marks as bonus points)<br />-Lowest: 36<br />-Highest: 105<br />-Mean: 80.6<br /><br />Homework 1 (out of 100)<br />-Lowest: 16<br />-Highest: 100<br />-Mean: 85.8<br /><br />Homework 2 (out of 100)<br />-Lowest: 50<br />-Highest: 100<br />-Mean: 80.9<br /><br />Midterm assignment (out of 100)<br />-Lowest: 42<br />-Highest: 100<br />-Mean: 83.6<br /><br />Fluid Dynamics Quiz (out of 100)<br />-Lowest: 36.7<br />-Highest: 100<br />-Mean: 78.7<br /><br />Aerodynamics and Structures Quiz (out of 100)<br />-Lowest: 30<br />-Highest: 100<br />-Mean: 76.7<br /><br />Materials Technology and Standard Atmosphere Quiz (out of 100)<br />-Lowest: 40<br />-Highest: 100<br />-Mean: 82.5<br /><br />Aircraft performance, Thermodynamics, and Propulsion Quiz (out of 100)<br />-Lowest: 30<br />-Highest: 100<br />-Mean: 81.7<br /><br />Final exam (out of 100)<br />-Lowest: I don't know<br />-Highest: I don't know<br />-Mean: I don't know<br /><br />My result:<br />-Mini assignment 1 (Basic Maths, Physics, and Fundamental Thoughts): 95/100<br />-Homework 1: 96/100<br />-Homework 2: 92/100<br />-Midterm assignment: 96.8/100<br />-Fluid Dynamics Quiz: 80/100<br />-Aerodynamics and Structures Quiz: 100/100<br />-Materials Technology and Standard Atmosphere Quiz: 90/100<br />-Aircraft performance, Thermodynamics, and Propulsion Quiz: 76/100<br />-Final exam: I don't know<br /><br />Grade: A-<br /><br />As this course is highly related to Physics, here is my 2021 HKDSE Physics result for your reference:<br /><br />Physics: Level 5**<br /><br />So you can see this course is really good grade. :)",
            "comment_workload": "Professor Liem has commit that aerospace engineering is no doubt a difficult course as many things related to all flying vehicles should be as safe as possible. So, many precise and accurate calculations must be performed in this course. Therefore, this course is somehow a little bit high workload.<br /><br />However, if you like aerospace engineering very much, or you want to choose mechanical engineering as your major, I think all these hard work is worth it.<br /><br />Here is the workload in my semester:<br />-Mini individual assignment x 1<br />-Quizzes x 4<br />-Homework assignment x 2<br />-Midterm assignment (individual project) x 1<br />-Final exam x 1<br /><br />You may see the attachment for more information about the course in my semester.<br /><br />*Due to the copyright issue, I cannot post any lecture note slides here without the permission of Professor Liem. Hence, I can only post the course description of MECH1907 here.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "8CvSCIgKokh7OK9X0n0o0z6AFUbZm4vi",
                    "name": "MECH1907_CourseDescription_Fall2021-1",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "oK31DYQbGhZcXS4YwvNN5zKOTQzB0LET",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 826,
                    "name": "LIEM, Rhea Patricia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yktchan",
            "date": "Dec 29, 2017",
            "title": "",
            "comment_content": "正正路路嘅aero intro course，多數要計不過唔算特別難，基本上sub岩數就做到<br />上堂會derive啲equations，不過到hw同exam都係識得用條式就okay",
            "comment_teaching": "Rhea超級好人而且好supportive，上堂好輕鬆搞笑得黎又可以好精簡同清晰咁教到明曬啲野",
            "comment_grading": "mid term below mean少少, final 無出分，hw唔係份份滿分，拉埋都有A range",
            "comment_workload": "四份hw + midterm + final, hw題目全部都係自己出，無得google搵答案，又無得抄翻上年，所以一定要自己做<br />midterm同final都有cheatsheet, 所以都算溫得輕鬆",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}