{
    "error": false,
    "course": {
        "id": 990,
        "subject": "MECH",
        "code": "4950",
        "name": "Co-op Program",
        "description": "This course is intended to provide final year UG students with practical hands-on training in the form of a co-op program in an engineering company located in Hong Kong or China. Students must obtain approval from the UG Coordinator before enrolling in the course.",
        "categories": [],
        "website": null,
        "credits": 6,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4,
        "rating_teaching": 3,
        "rating_grading": 5,
        "rating_workload": 3,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [
        {
            "hash": "wHWalyzmVzsbWcn1ZHuwttwKMRRTl2N0",
            "semester": "2018-19 Spring",
            "instructors": [],
            "is_author": false,
            "author": "MS01",
            "date": "Jun 16, 2019",
            "title": "FYDP in a company",
            "comment_content": "Basically, the MAE department will give a list of companies that offer Co-op Program. After they receive your priority, those companies will arrange interviews for selection.<br /><br />The project title depends on the company project team and you have to discuss with your industrial supervisor. Therefore the content is diverse, such as building services, environmental engineering, or something related to big data analysis.<br /><br />Apart from doing your own FYDP, you are expected to carry out some routine works in the company, such as drafting reports for submission, preparing excel spreadsheet, or replying emails.<br /><br />You may have a chance to get a return offer form your Co-op Program, but it is not guaranteed.",
            "comment_teaching": "Self-learning, your colleagues may provide some assistance and suggestion in your project. <br /><br />You are told to have monthly meetings with your assigned MAE professor. But don't expect he/she can help you a lot. Relax and treat them as a casual chat with your professor.",
            "comment_grading": "It should be a good grade course if you don't mess with your boss and your professor.",
            "comment_workload": "It depends. Even your classmates and you are going to the same company, the workload can be EXTREMELY DIFFERENT in different project teams. My friends and I are offered by the same company with different project teams. They have many routine works and they have not much time to spend on their FYDP, on the other hands, I am the opposite and I have more spare time on my FYDP.<br /><br />Also, you have to complete the following for the Co-op Program:<br />1. Monthly Report<br />2. Progress Report (mid-April)<br />3. Final Report + Final Presentation (mid to late-June)",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}