{
    "error": false,
    "course": {
        "id": 965,
        "subject": "MECH",
        "code": "3610",
        "name": "Control Principles",
        "description": "Introduction to system equations, block diagrams, signal flow graphs, state-space systems, transient response using convolution integral, root locus and frequency response methods. Design by root locus, frequency response and state space method. Nyquist stability test.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1530,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"ELEC\" data-code=\"3200\" href=\"/review/ELEC3200\" target=\"_blank\">ELEC 3200</a>",
        "rating_content": 4.17,
        "rating_teaching": 3.17,
        "rating_grading": 4.08,
        "rating_workload": 3.5,
        "review_count": 12,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 572,
                "name": "CAI, Lilong",
                "count": 11
            },
            {
                "id": 946,
                "name": "SEO, Jungwon",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "54UflKE40hRFYHTD7tclC0NJ7S5TkzMq",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 946,
                    "name": "SEO, Jungwon",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "科大MECH癲佬",
            "date": "Dec 08, 2021",
            "title": "",
            "comment_content": "Electrical analogous systems, Laplace Transformations, Transfer functions and their related signal flow graph / block diagram, open-loop / closed-loop, errors and stuff.",
            "comment_teaching": "The prof has no idea how to teach properly. Decides his drawing is better than PowerPoint, which if you sit on the side or at the back, you won’t see a damn thing. Won’t give you a foresight into what we’re learning, so you have exactly 0 idea why we’re learning this, and thus notes organising is hell. The most confusing thing is he decided not to create any lecture notes for you to take home, so when the class demands it, he just went ahead and straight up posted lecture notes from another Lecture, so the orders in which he teaches doesn’t match up with the notes at all. Overall one of if not the most prof I’ve encountered in UST.",
            "comment_grading": "The grading is meh. Honestly given how horrid the professor is, the grading should not concern you in the slightest.",
            "comment_workload": "Midterm, final, 2 labs and a lab report to be submitted after the finals. 9 sets of homework, the most in Yr 3 Fall.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H2O8D0JDHUepwwWToI52TBy1Jlx4ZDmb",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 572,
                    "name": "CAI, Lilong",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Jefferywyt",
            "date": "Feb 18, 2023",
            "title": "Self study is a better choice",
            "comment_content": "Introduction to system equations, block diagrams, signal flow graphs, state-space systems, transient response using convolution integral, root locus and frequency response methods. Design by root locus, frequency response and state space method. Nyquist stability test.<br /><br />It is better to have some knowledge of differential equation (MATH2351) because Laplace Transform is required in Mid-term.<br /><br />Before mid-term:<br />System differential equation, block diagram, signal flow graphs, basic electronics.<br /><br />After mid-term:<br />transient response using convolution integral, root locus and frequency response methods. <br /><br />Mid-term / final exam<br />Open book (no electronic device)<br />Mid-term: System differential equation, block diagram, signal flow graphs, basic electronics.<br />Final: PID controller",
            "comment_teaching": "It is hard to hear what the professor wants to say. The PowerPoint is a mess, the explanation or derivation of the formula is not provided. Dont try to waste your time. Study control principle by using YouTube.&nbsp;&nbsp;<br /><br />TA is very helpful, attend the tutorials is better than attend lectures.",
            "comment_grading": "Fair",
            "comment_workload": "Assignments require the knowledge of MATLAB. 9 assignments need to be submitted on paper.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "g6uhFtwBuFtl0Go9i3jtmlIkhxPTngGi",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 572,
                    "name": "CAI, Lilong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GK",
            "date": "Feb 02, 2017",
            "title": "Control Principle",
            "comment_content": "Basically about control system. You will learn PID controller. Calculation involve MATH2351 stuff so you better have studied it. Control principle is useful and this course cover most of them like how to simplify control system to transfer function and choose gain for specific performance of the control system.",
            "comment_teaching": "Probably because of 9am lesson, the number of attendees kept dropping. I was one of those not attending the lesson.<br />According to my little experience, his teaching was not bad. He provides quite a number of examples. However, you will better learn by youtube since they will be easier to understand.",
            "comment_grading": "No attendance. All in Midterm, Final and Assignment.<br />Midterm takes 3 hours which is insane, with only 3 question in it. However, the 3 question has a,b,c,d,e,f,g,h,i,j,k part in it and you usually would not know how to do the a part. Got about 40%<br />Assignment have source<br />Final quite similar to midterm but scores not revealed.<br />Finally got A-. I think is very good grade.",
            "comment_workload": "Assignment has source and lab is easy. Find a good groupmate and you will be good to go. Just remember to study hard before exam.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KAmnlEvRWIaajAxds58DYlyg5IVMFf2K",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 572,
                    "name": "CAI, Lilong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "glim",
            "date": "Jan 25, 2019",
            "title": "",
            "comment_content": "overall, the content is heavy. <br />It might be difficult at first but it would be helpful if you find out some videos on the websites to review. <br />no need to go to the lecture since the lecture video is provided. <br /><br />the tutorial section is quite useful to understand the concepts. Sometimes it is better than the lectures. The tutorial slides were more useful than lecture slides. <br /><br />the exams are open-book tests. So, you don't have to memorize but you need to understand the concepts. The contents in the control principle is quite different with the other lectures. So, understanding is the most important in this class.",
            "comment_teaching": "The professor provided enough contents to understand the control principle and his assignments help to understand the contents if you could solve it. However, the lecture is in quite slow process.",
            "comment_grading": "grading is straight forward, I guess. <br /><br />Maybe normal distribution is applied for the grading.",
            "comment_workload": "In my case, the assignments were very difficult. <br />However, if you are able to solve the assignment, you might be able to solve the exam questions.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "sSpxDbNoSAyTFtkZYEOMbri7rBCF7YdE",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 572,
                    "name": "CAI, Lilong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MS01",
            "date": "Jan 04, 2019",
            "title": "Just go for the tutorial section is enough",
            "comment_content": "Laplace transform<br />Block diagram reduction &amp; Transfer functions <br />Signal flow diagram<br />Open and closed loop systems<br />PID control<br />Root Locus method",
            "comment_teaching": "The teaching of the professor is OK, but his sound is quite monotone, making the lecture is boring.<br /><br />TA in the tutorial section is helpful, and his ppts are more organized than those lecture ppt.<br /><br />LECTURE VIDEOS WILL BE PROVIDED!",
            "comment_grading": "Homework 15% and Lab: 5%<br />Midterm Exam: 35% (Mean is 70, no SD provided)<br />Final Exam: 45%<br />-------------------------<br />My result:<br />Homework 100%<br />Mid Term below mean 5 marks<br />Final result unknown<br /><br />Final Grade: B-",
            "comment_workload": "9 Homework<br />2 Lab Reports<br /><br />Easy if you have sources.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "YU2yE2DFszSqST9Bcpb7lRmeOljxfkfF",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 572,
                    "name": "CAI, Lilong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bbmadevipalive",
            "date": "Jan 04, 2019",
            "title": "Control principle and negative feedback",
            "comment_content": "free body diagram converted to electrical circuit<br />Laplace transform<br />Transfer functions <br />Maisons gain and signal flow diagram<br />Open and closed loop systems<br />percentage overshoot and settling time<br />PID control<br />frequency response<br />root locus",
            "comment_teaching": "Clear and logical teaching",
            "comment_grading": "Midterm mean 70/100 sd unknown I got 62<br />Final unknown<br />Got C+...<br />I wonder how poor I did in the final or if prof Cai gave poor grades",
            "comment_workload": "8 homeworks with ans same as previous years<br />No source for the last homework<br />Heard the questions came from textbook<br />Fairly easy before midterm but the part after midterm was abstract and not easy to understand for me",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3KwSiqAY9SEc2WvPXpIDux79wb8cOAm3",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 572,
                    "name": "CAI, Lilong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CKL",
            "date": "Dec 20, 2018",
            "title": "",
            "comment_content": "1. Introduction<br />2. Mathematical Models of Systems<br />3. State-Variable Models<br />4. Feedback Control System Characteristics<br />5. The Performance of Feedback Control Systems<br />6. The Stability of Linear Feedback Systems<br />7. The Root Locus Method<br />8. Frequency Response Methods<br /><br />This course uses block diagrams and mathematical tools to explain control theory.",
            "comment_teaching": "The professor's tone is a bit boring. However, he explains clearly. He also provides lecture videos.",
            "comment_grading": "Homework 15%<br />Lab 5%<br />Midterm 35%<br />Final exam 45%<br /><br />Statistics:<br />Homework mean: 93.7/100<br />Midterm mean: 70/100<br />Final exam score is not released.<br /><br />Final grade: A",
            "comment_workload": "The workload is light. You only have to finish a weekly assignment, which is quite easy. However, you have to finish 2 individual lab reports this year, which is the greatest workload before the final exam.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vq4LMghjNEaVJjs1DnzJOAmQLYUe4bSn",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 572,
                    "name": "CAI, Lilong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "s.fcat.ac",
            "date": "Feb 01, 2018",
            "title": "Don't trust the no-prerequisite!",
            "comment_content": "The topic surrounds on applying control to systems. It starts with introducing closed loop systems, Laplace transform, and goes until PID controls, root locus and frequency response. <br /><br />Aware that even though this course has no pre-requisites(and yet, well-justified since you don't really need much knowledge beforehand in order to take the course), you have to be prepared for the level of content this course will reach, since it is so different to anything else you have learned from other mech courses(which is due to it being a math course in disguise of a mech course). Although this course has Laplace transform, taking Math2351 beforehand doesn't help too much since all you have to know about Laplace transform is that differentials and integrals become powers in the Laplace space, positive and negative respectively. <br /><br />The midterm and final exams are open book exams. However, it is strongly recommended that the content of the course is well-understood before the exam, especially for the finals since the final is extremely time-intensive.",
            "comment_teaching": "The teaching is fine, but a bit boring since the professor is just giving some more supplementary information to the powerpoint (and to say, the powerpoint provided in canvas could be messy since all animations are removed, and you might need some more time spent on other internet sources in order to understand root locus)<br /><br />The TA sessions however is useful since it really focuses on the methodology and suggests different main points where students may make mistakes. Please take note that even if you don't want to print the lecture notes for the exams please do print the TA notes as they are the most useful and holds most of the main points.",
            "comment_grading": "The grading is, as long as I know, not harsh. Although I hold no knowledge on my performance for the final exam, from the rest of the grades I have received (that is around 70 to 80 percent) I received an A-, which is satisfactory especially when I'm only a year-2 student. <br />However, if you are not prepared for being mindblown throughout the semester please do not even attempt such a challenge. A lot of the contents are hard to understand and as I know quite a number of year-3 students are unable to perform well in this course.",
            "comment_workload": "Homework almost every week, 8 in total (even though the last assignment wasn't marked)<br />The homework has a personal part and a group work part. Personal part is no different from homework from other courses. The group work however is typically designing a question similar to the textbook/ homework, and marked through its originality, level of understanding etc. <br /><br />Two lab reports throughout the course, and the lab report is submitted just before the final. Lab report is rather easy, just following the questions provided and the usual lab report formate would be adequate. However, be reminded that a neat record for the lab is required since quite a lot of photo-taking is required for the report.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WCuTKsXNnONI6ufhdgk0nb3R982mzrhD",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 572,
                    "name": "CAI, Lilong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "omega",
            "date": "Dec 29, 2017",
            "title": "Easy",
            "comment_content": "Laplace transformation<br />Spring-mass-damper<br />Some circuit<br />Signal flow diagram<br />Block Diagram<br />Mason Gain<br />PID control<br />Root Locus<br />Bode plot",
            "comment_teaching": "Boring <br />you can never catch up on his speed<br />Just go library and study by yourself<br />Everything is on canvas <br />Notes have no steps and wrong sometimes<br /><br />TA is very nice and you may want to go to tutorial<br />Just email him if you have questions",
            "comment_grading": "Good<br />Midterm less 1 sd, easy to moderate<br />Final very difficult, 3 hours 3 question, mainly focus on things after midterm<br />many parts in 1 question, abcdefghij <br />All 3 questions are related to PID",
            "comment_workload": "OK for a mech course<br />1 homework everyweek<br />8 in total<br />If you know the homework, you can at least do good in midterm<br />Read the question carefully, some may have hints with it<br /><br />2 Labs <br />just follow the steps, take more pictures for your own good, and find source",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Tje7cKUEMOlvSpbRrfkHVSZeS1Vp5ZT7",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 572,
                    "name": "CAI, Lilong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Orange",
            "date": "Apr 06, 2017",
            "title": "",
            "comment_content": "first the topic cover Laplace transforms and transfer function . The course goes on by discussing stability through different method and theory with transfer function. Generally speaking, the content is quite hard and require lots of time to digest and understand. Background with Math 2351 will provide a better start in this course",
            "comment_teaching": "The ppt already contain 90% of the content. Professor only add few new teaching on the ppt and explaining the ppt whole time. Luckily, Professor make it quite clear and understandable so the teaching is fair.",
            "comment_grading": "the exam is very tough and hard. The midterm mean is below 50 which indicate the difficulty of the exam. The exam focus on concept and ask nearly every possible question from these concept.<br />The grading, however , is quite good as i heard quite a lot people got A range or B+.In my point of view, to score high grade, hard-working attitude is a must and hard work does pay off",
            "comment_workload": "Workload is quite little as assignments got source and lab is quite a easy job. However, to get decent grade, assignments must be understood thoroughly and review course material every week is suggested",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1EZItVkcHBuQqzd8Y2dKEtHx2FYqefD4",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 572,
                    "name": "CAI, Lilong",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "An225 Mriya",
            "date": "Jan 15, 2023",
            "title": "Overrated Professor",
            "comment_content": "1. Introduction<br />2.1. Dynamic modelling<br />2.2. Laplace transform and transfer function<br />2.3. Block diagram and its reduction<br />3. State variable models<br />4. Feedback control systems<br />5. Performance of feedback control systems<br />===Midterm===<br />6. Stability<br />7. Root locus method<br />8. Frequency response method<br /><br />Per my experience, one is most likely to be confused in 2 chapters: one is Chapter 2.1, in which students are exposed to the good-old imaginary numbers that one never touched since HKDSE. As a result, you are advised to revise your math knowledge on complex numbers. Appendix G of the textbook provides a good introduction on complex numbers. While those who've studied MATH2351 or MECH2352 will be more familiar to Laplace transform, for most case all you need to do is use the standard transform tables to deal with questions. Laplace transform was not frequently used in this course.<br /><br />Another confusing topic is the frequency response method, in which it is quite detached from the previous contents, limited teaching time at the semester's end also makes through understanding hard. Probably the best way to overcome this is by doing textbook questions.<br /><br />Other than these chapters, most of the contents should be understandable. As these contents form the basis of flight control system, I think they are useful in future studies as well. They were mentioned in MECH3670, but only briefly.",
            "comment_teaching": "Professor Lilong Cai is the course's lecturer, and his teaching was only better than the previous roasted Professor Seo. His Putonghua accent was so thick that seriously hampers understanding. Despite unclear pronunciation, Professor Cai taught in a very fast pace such that it was hard for me to jot notes from his lecture notes. Moreover, the classroom is full with noise in the first few lectures, which is extremely distractive, though the situation was alleviated when less people went for lectures.<br /><br />His poor teaching forced me to watch lecture videos instead of going for the lectures, the first time I have to do so since I was here. Watching a 1.5-hour lecture video would spend me 2 or 2.5 hours, as I have to pause or rewind some portions of his lecture videos to make notes or listen more clearly.<br /><br />While usually a criticism for mediocre teaching, most of the time he functioned as a Powerpoint reader, so the course contents can be understood through lecture notes, a live-saving straw in such case. His lecture notes should be more organized when compared to Professor Seo. Professor Cai also replied to emails quite quickly, which is good for asking homework questions.<br /><br />Perhaps he is the kind of research-focused professor who slumped in teaching, but given by Professor Cai's professorship in Columbia University, I consider such kind of potato lecturing unacceptable in terms of his experience, and ranked him an E grade* accordingly.<br /><br />*When compared with previous lecturers and instructors I've came across. If compared with Professor Seo, I'll probably rated a D for Professor Cai.<br /><br />**The tutorials were conducted by Professor Cai himself and other TAs. As I didn't attended any tutorials, I can't evaluate the performance of the TAs. One of my friend, however, considered their performance as mediocre. That said, the lab assistant was helpful and responsive to questions asked during labs.",
            "comment_grading": "Homework: 15% (Most over 90%, mean fluctuating)<br />Lab: 5% (70/100, mean 82.15/100, median 90/100)<br />Midterm Exam: 35% (78.5/100, mean 64.58/100, median 67.75/100)<br />Final Exam: 45% (Never released per MAE practice, but should be good enough)<br /><br />There were 9 homeworks in MECH3610, each consisting of 2-4 questions. They were relatively easy, although some may require looking through the textbook or asking the professor.<br /><br />The group-based lab session required us to tune a PID controller, and groupmates would need to submit a lab report, answering a few questions. You are advised to do the lab session later, as a early finish will not bring any early advantage in lab report writing, plus you would not understand what was involved in the lab, ending up in a &quot;monkey see monkey do&quot; scenario. For some reason my group ended up with an under-average score for the lab report, though it only counts for 5% of the grade, so nevermind.<br /><br />The midterm exam was open book and lasted for 3 hours, covering Chapters 1 to 5. As they were rather easy chapters, you are advised to prepare better on the midterm. Most of the questions were rather straight-forward, though do expect more challenging ones. I scored quite well in the midterm, and I also heard one of my friend scored 90% in the midterm.<br /><br />The final exam was also open book and lasted for 3 hours. As the later contents were rather abstract, it was much more difficult than the midterm exam. The question's focus was also shifted to designing controllers. To prepare for the final exam, you should spend time in revising the design parts of the lecture notes. Contents related to PID tuning was also important.<br /><br />At the end I got a surprised A grade, in which I don't know whether this is caused by over-average performance in the final, or because everyone performed badly in the final, and I did slightly better.<br />*N.B.: I finished my final exam after I caught COVID, so perhaps I would have perform better if I were healthy?",
            "comment_workload": "Each homework typically have more than a week before submission, so it was less stressful when compared with those from other courses. However, some homework also requires you to submit a separate Matlab code, and you'll need to self-learn it based on the TA's tips. You are best to use HKUST's computer barn when dealing with Matlab, as virtual barns may be laggy. You are also required to submit homeworks on paper.<br /><br />As for every engineering courses, doing additional questions prepares you better, and this was what I did in preparing the exams. While the textbook's question less useful than other textbooks in other courses due to limited numerical solutions (plus questions with solutions were easy questions). That said, practice makes perfect, and buying the textbook is recommended as Peter Gao past papers were basically nonexistent. This would be better if one have an Chegg account or something similar.<br /><br />The lab report was released at the very end of the semester, and was required to be submitted 3 weeks later. Given by the fact that it was a group-based assignment, its workload was rather light.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ABUUkOOrsMxavPtKu1OIns4dzbMG6tQY",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 572,
                    "name": "CAI, Lilong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DiabloXD",
            "date": "Oct 28, 2022",
            "title": "",
            "comment_content": "We learnt a lot about the Control theory and modelling systems and analyzing closed-loop and open-loop control feedback performance.<br />The concepts are the hardest part, and the math is often quite trivial.<br />Especially towards the end, the concepts can be quite hard to grasp, and plotting root locus diagrams were especially challenging. However, I found that things generally came together and made sense. I appreciated the course so that I can understand what goes into ensuring the position of an elevator or train, and the dc gain from motors, etc. <br /><br />One main aspect I didn't like so much was that, the course goes in depth into the theory and gave us simple labs to play with PID, but the course didn't give us a chance to design a control system from scratch, and developing the hands-on skill of designing and then modelling a control system using MATLAB for example. I believe that would be incredibly useful and practical.",
            "comment_teaching": "Prof CAI, Lilong is a wonderful professor. He teaches quite well in my opinion, and willing to clarify questions after class. And he often gives inspirational messages at the end of class. However, his accent can be hard to grasp, but I'm used to this by now.",
            "comment_grading": "I did average in Homework (which is like 95%), better than average in Midterms, but average again in Finals. Due to that I got a B which I am not too happy with, I think I deserved at least B+.",
            "comment_workload": "The concept is quite difficult to grasp and I found that towards the end I had to review the content again myself to really understand, for example, the root locus plots. It was quite difficult to learn to do them.&nbsp;&nbsp;The main thing is that it does take a while to do the homeworks and study due to the difficulty of the course. There was also 2 labs which were quite fun, but not much work since there is a group.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        }
    ],
    "composer": []
}