{
    "error": false,
    "course": {
        "id": 958,
        "subject": "MECH",
        "code": "3030",
        "name": "Mechanisms of Machinery",
        "description": "Application of kinematics and dynamics in the analysis, design and synthesis of mechanisms. Type and dimensional design of linkages, cams and gears based on motion requirements and force transmission, in contrast to the strength requirements. Graphical, analytical and computer methods in analysis and design of mechanisms. Design considerations in mechanism synthesis.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1430
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MECH\" data-code=\"2020\" href=\"/review/MECH2020\" target=\"_blank\">MECH 2020</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.41,
        "rating_teaching": 2,
        "rating_grading": 3.59,
        "rating_workload": 2.35,
        "review_count": 17,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 573,
                "name": "LEE, Yi-Kuen",
                "count": 11
            },
            {
                "id": 574,
                "name": "TANG, Kai",
                "count": 2
            },
            {
                "id": 946,
                "name": "SEO, Jungwon",
                "count": 2
            },
            {
                "id": 235,
                "name": "LAU, Stanley Chun Kwan",
                "count": 1
            },
            {
                "id": 1204,
                "name": "XIA, Minglu",
                "count": 1
            },
            {
                "id": 1669,
                "name": "LU, Yanglong",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "5falS7NuKJZDlQa7nbFf4fGxBDJ01SoJ",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 946,
                    "name": "SEO, Jungwon",
                    "rating": 0
                },
                {
                    "id": 574,
                    "name": "TANG, Kai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Jacky 01",
            "date": "Jan 04, 2021",
            "title": "Quite difficult course",
            "comment_content": "This course talks about mechanism, such as spur gear, four bar linkage, slider-crank mechanism, CAM etc. This course is very relevant to the mechanical engineering major. In this course, you need to do design, analysis of the velocity and acceleration of the parts/joints of the mechanism, and also mobility. The syllabus includes:<br /><br />1. Joints<br />2. Simple linkage and mobility<br />3. Four bar linkage and mobility<br />4. Graphical method of analysis<br />5. Velocity images<br />6. The instant center of velocity<br />7. Computational analysis of four-bar linkages<br />8. Computational analysis of slider-crank linkages<br />9. Computational analysis of other linkages<br />Mid-term<br /><br />10. Four-bar linkage design<br />11. Four-bar linkage motion design<br />12. Design of slider linkages<br />13. CAM –Introduction<br />14. CAM –Motion programming<br />15. CAM –Profile design<br />16. Spur gears–Introduction<br />17. Involute spur gears<br />18. Gear trains<br />19. Planetary gear trains<br /><br />In my point of view, I think the part before the mid-term is way harder, the part after the mid-term is easier. In the graphical method, you need to draw lines using knowledge of vectors, and you need to draw it to the scale using rulers and protractor, and you get the result by measuring the length. It is a quite complicated work. But the worst nightmare is the computational part. You need to do very long derivation and a lot of math. The computational analysis of four bar linkage part is the most difficult part. I think this course is quite difficult and requires a lot of effort. It is even harder than some 4000-level mech course, such as Mech4360 which I took in the same semester. Also, this course requires you to use MATLAB, but they barely taught anything.<br /><br />P.S. The section taught by professor Tang and Seo is very different, including the content and workload. I attend both of the section every weeks. I will talk more about it in &quot;Teaching&quot;.",
            "comment_teaching": "My section was Prof. Tang's section, but I also attend all of Prof. Seo's section. So I will talk both of them here.<br /><br />For Prof. Tang's section:<br />He explain things very un-clear. He can't talk very fluently, and it is quite hard to get the concept. Also, he always jump between the slides frequently, which makes it even more hard to focus on what he says. But the worst part is right before the Final exam, we don't have time to teach all the contents, so he just let us self study for 60% of the contents. But at least he covered everything in the content, which is not the case in Prof. Seo's section,<br /><br />For Prof. Seo's section:<br />He explain the basic concept quite clear. He don't use lecture notes in his lecture. Instead, he draw out everything on a white board, which explain better since this course is most about drawing graph, vectors. The lecture notes are also posted on Canvas for self-study. I thing his teaching is quite good BEFORE MID-TERM. After mid-term, everything changed, he didn't mention a lot of things that will be covered in the final exam. You need to do self-study for most of them. He even explain less than professor Tang after the mid-term. But the worst thing is, he didn't even give any homework and practice after the mid-term, so a lot of student do not know how to do the question.<br /><br />The worst part of this course is that the two section's coverage don't match. Some of the content are taught by Prof Tang but not Prof Seo, and vice versa. They didn't even agree on the coverage on exam!!! Before final exam, Prof Tang said we won't cover bevel gear and things before the mid-term. But in the final exam, which I think the paper was made by Prof Seo, still ask about bevel gear and thing before the mid-term. And prof. Seo didn't give any homework about computational method, which is a huge part in the mid-term!!! That's why Prof. Tang said that his class's mean is way higher than the other section.<br /><br />So, if you want to have a low workload, I suggest you to enroll to Prof. Seo's section. But if you want to have a good grade, I suggest you to enroll to Professor Tang's section while also sits Prof. Seo's section BEFORE MIDTERM!!!<br /><br />For tutorial section, they explain things quite well, way better than lecture. Stanley will even give you some tips on drawing the graph by hand using compass in the exam, which is useful. So I strongly recommend you to attend every single tutorial section.",
            "comment_grading": "Since the course content is quite hard, the mean is quite low as well. So the grading will not be harsh otherwise most of us will get C grade. <br />There are 10 homework, 1 Matlab homework, and 10 tutorial homework which counted as bonus marks. The weightings are:<br /><br />Homework: 5%<br />Mid-term: 40%<br />Final exam: 45%<br />Matlab homework: 10%<br />Tutorial homework (Bonus): 15%<br /><br />My grade:<br />Assignment overall: 77.11%<br />Tutorial assignment overall: 99.9%<br />Matlab homework: 65%<br />Mid-term: 62/100<br />Final exam: Un-released<br />Final grade: A-<br /><br />Mean: <br />Assignment: 58.61%<br />Tutorial assignment: 67.956%<br />Matlab homework: 57.4%<br />Mid-term: 57.3%<br />Final exam: Un-released<br /><br />As you can see, most of the mean are around 50-60%, which is quite low. The homework's mean is usually lower than 50% for most of the case. The tutorial assignment, however, is quite easy to do, and can earn bonus that has 3 times the marks of class assignment. So I strongly recommend you to do tutorial homework first even if you don't have time. You can give up homework since it has 10 homework but only takes up 5%. But you must do the tutorial assignment.<br /><br />The Matlab homework, however, are a total nightmare. They require you to write a code to simulate four-bar linkage start from nothing. They barely taught anything about Matlab, it only has 2 50-mins tutorial about four-bar linkage. I finished it with help from a CS friend in Chinese University. I definitely cannot finish anything by my own. That's why mean is only 57.4%, I think a lot of people just cannot finish it. They are also 2 tutorial assignment need to use Matlab, but in this 2 assignments, they gave us the complete code, you just need to do some modifications, so it can be done even without programming background. But the Matlab homework are just depressing.<br /><br />The final exam will not cover the content before the mid-term. But since the weighting of final and mid-term is very similar and has very large weighting, doing bad in mid-term exam will affect your grade a lot.<br /><br />P.S. My professor are Professor Tang, which has 10 very difficult assignment that mean is always about 50%. But in professor Seo's section, they only has 3 assignment and are relative easy, which most of people can get high mark, which is so un-fair and is the worst part of this course's grading. I will talk more about it in &quot;Workload&quot;.<br /><br />P.P.S I actually retake this course. And from the 2 semester experience, Prof. Seo's exam paper is way harder than Prof. Tang. He will not ask questions that is straightforward. And sometimes he will ask things that only taught in his section. So if your mid-term exam is easy, you know the final will be hard.",
            "comment_workload": "Extremely high if you are in professor Tang's section. We have totally 10 homework, which each one only has one week to do. And the questions are SUPER DIFFICULT!!! And what makes it worse is that it only cost 5%!!! 10 super difficult homework for just 5%!!! And you still have 10 tutorial homework every weeks!!! So average 2 homework each week. But those homework are good practice since the question in exams are difficult as well.<br /><br />If you are in Prof. Seo's section, good for you, your workload is very low. You only has 3 homework, all of them are before mid-term. And the difficulty is way lower than Prof. Tang's section. You still need to do the tutorial homework, but they are easy. However, the homework given by Prof. Seo is far from enough to get a good grade in exams. The variety of question are small, and the difficulty is way too low compare to the exam. So you better to ask your friend in Prof. Tang's section to borrow their homework for you to practice.<br /><br />The tutorial homework are quite easy to do. In fact they are just slight modification to the example question in the tutorial section. And you can use SolidWorks to draw graphs instead of using hands.<br /><br />The Matlab homework, as I mentioned, are a total nightmare. You must do it early if you are a new learner of Matlab since you need to do a lot of self-study online and even ask some help from your friends. But collaboration is allowed, you just need to type in your collaborator's name the the code.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mTKMbwpNfHtJ23kAQxNDSWfXhRBMis7x",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 574,
                    "name": "TANG, Kai",
                    "rating": 0
                },
                {
                    "id": 235,
                    "name": "LAU, Stanley Chun Kwan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Miku",
            "date": "Dec 19, 2021",
            "title": "Poor Professor, Decent TA",
            "comment_content": "The content is quite complicated and dull , so if you are not really into mechanical stuff (like me) you will find it tough and boring.<br /><br />I would suggest you guyz to find chinese books from Mainland or Taiwan on the content, it would be much more easier to understand",
            "comment_teaching": "The professor have no idea what he is teaching , he even use stuff from the lecture next week (stuff&nbsp;&nbsp;not yet taught ) to explain the current content , and he expects us to understand everything. <br /><br />Beside , he creates extemely difficult midterms so beware",
            "comment_grading": "Erm... many people got a poor grade so i guess its nothing speical",
            "comment_workload": "Every week has an assignment, and ALL of the assignment constitutes to 5% of your grade so if you dont want to do it, just ignore it.<br /><br />Submitting them gives you half of the marks so i guess just copy them?<br /><br />Besides the weekly assignment, everything is fine I guess, though many of my fellow classmates found the MATLAB programming assignment very difficult",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QqKG6AugEHYnso3S3iouWcaq18BwtMZo",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1669,
                    "name": "LU, Yanglong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "-------",
            "date": "Oct 20, 2022",
            "title": "",
            "comment_content": "Syllabus and schedule:<br />Part 1: A short introduction <br />(Part-1-A-Short-Introduction.ppt)<br />Part 2: Joints and linkages<br />(Part-2-Joints-and-linkages.ppt)<br />Part 3: Mobility <br />(Part-3- Mobility.ppt)<br />Part 4: Four-bar linkages and Grashof’s inequality <br />2<br />(Part-4-Four-bar-Linkages.ppt)<br />Part 5: Math review <br />Part 6: The graphical method of analysis <br />(Part-6-Graphical-Methods.ppt)<br />Part 7: The instant center of velocity <br />(Part-7-Instant-Centers.ppt)<br />Part 8: Computational analysis of four-bar linkages <br />(Part-8-Computational-Analysis-of-Four-bar-Linkages.ppt)<br />Part 9: Computational analysis of four-bar linkages with prismatic joints <br />(Part-9-Computational-Analysis-of-Slider-Crank-Linkages.ppt)<br />Part 10: Computational analysis of other linkages <br />(Part-10-Computational-Analysis-of-Other-Linkages.ppt)<br />Midterm exam (3 hours)<br />Part 11: 4R Four-bar linkage design of angles<br />(Part-11-4-bar-linkage-design-of-angles.ppt)<br />Part 12: 4R Four-bar linkage motion design of a rigid body<br />(Part-12-4-bar-linkage-design-of-motion-rigid-body.ppt)<br />Part 13: Design of slider linkages of a rigid body<br />(Part-13-Crank-slider-design-of-motion-of-rigid-body.ppt)<br />Part 14: Path synthesis<br />(Part-14-Path-synthesis.ppt)<br />Part 15: CAM – Introduction <br />(Part-15-CAM-introduction.ppt)<br />Part 16: CAM – Motion programming <br />(Part-16-CAM-motion-programming.ppt)<br />Part 17: CAM profile design – graphical approach<br />(Part-17-CAM-profile-design-graphical-approach.ppt)<br />Part 18: CAM profile design – analytical approach<br />(Part-18-CAM-profile-design-analytical-approach.ppt)<br />Part 19: Spur gears – Introduction <br />(Part-19-Spur-gear-introduction.ppt)<br />Part 20: Involute spur gears <br />(Part-20-Involute-spur-gears.ppt)<br />Part 21: Gear trains <br />(Part-21-Gear-trains.ppt)<br />Part 22: Planetary gear trains <br />(Part-22-Planetary-gear-trains.ppt)",
            "comment_teaching": "The notes provided only contain very basic concepts which is totally not enough for any assignment or exam.",
            "comment_grading": "Grading: total 100 points<br />- Midterm: 35%<br />- Final: 45%<br />- Written homework: 5%<br />- Lab projects: 15%",
            "comment_workload": "The assignment provides no hints that many of the questions are difficult.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AgRKS6xtmcTnHAjuHvC8aKb7rWMl0uux",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 946,
                    "name": "SEO, Jungwon",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "jc2048",
            "date": "Jan 19, 2021",
            "title": "Useful and interesting topic, but poor teaching",
            "comment_content": "This course is about some basic and common mechanism, such as some basic linkages (hinges, sliders), CAM and gears. As a MECH student, the content of this course is highly related to my study.<br /><br />Course contents:<br />- Joints, linkage and mobility<br />- 4-Bar linkage<br />- Position, velocity and acceleration analysis<br />- Instant center of velocity<br />- Computational analysis for linkages<br />- 4-Bar linkage design<br />- CAM motion and design<br />- Gear design and basic gear train<br />- Planetary gear trains<br /><br />The overall content is not very difficult, however it requires a deeper understanding in order to solve questions",
            "comment_teaching": "Professor Seo teaches this course poorly.<br /><br />However, the tutorial sections by Dr. Stanley are completely different. Although his English is not as fluent, he explains the example questions very clearly for the session that I have attended.<br /><br />Here are the points for why I think professor Seo teaches this course poorly:<br /><br />1. This course uses online teaching, however sometimes the camera quality is low as $h1t and I cannot even distinguish the letter he wrote on the whiteboard.<br /><br />2. Everyday he just draw on the whiteboard and explain stuff to us. Although drawing can give a better understanding to the course, he did not provide any notes to us about the drawings, only a few of them, and most of the contents require us to take screenshot of the zoom meeting, and you have to wait for the cloud recording if you are unfortunate and he erased that part just 1 minute after he drew it.<br /><br />3. Prof only talks about the actual content of the course, and only explain the theory, without doing any actual examples together.<br /><br />4. There are some part in the final exam, which are from the extra reading materials in Canvas, but he never talk about in the lectures.",
            "comment_grading": "The mean of the exams are not very high, so it is not difficult to get an average grade.<br /><br />My personal grade is not very good, so I will not post it here, please refer to others if you want to know more about grading.<br /><br />Midterm 40%<br />Final 45%<br />Homework (3 + 1 programming homework) 15%<br />Tutorial Assignments (Extra credits) +15%<br />Total 115%",
            "comment_workload": "Work load is supposed to be very low, since there are only 3 assignments and 1 programming assignments. <br /><br />HOWEVER,<br /><br />the first 3 assignment I completed them via googling for similar questions and learn the solving methods there and then complete the homework, which took me an extra 3+ hours to learn all the things again.<br /><br />The programming homework is quite straightforward, just replace some of the variables and formulas in the MATLAB program you have created in the tutorial, but ONLY if you have created in the tutorial, because MATLAB skills are only being taught in tutorials.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4ASYfuPeyjGqX7sie7Qo8aIQRlciJUKT",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 573,
                    "name": "LEE, Yi-Kuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bbmadevipalive",
            "date": "Jan 04, 2019",
            "title": "Interesting topic but poor course structure and teaching",
            "comment_content": "1. position analysis (analytical and graphical)<br />2. velocity analysis (analytical and graphical)<br />3. acceleration analysis (analytical and graphical)<br />5. gear ratio<br />5. cam design",
            "comment_teaching": "lack of focus <br />ignored important features and focused on out-of-syllabus contents<br />About 10 students attending class only",
            "comment_grading": "fairly lenient grading<br />midterm below mean final about mean got B<br />Above mean in all homework<br />Full marks in lab",
            "comment_workload": "very late homework release so 3 homework due at similar time<br />weekly labs and lab quizzes...<br />Ask friends for checking lab quiz ans shd be fine<br />But 2 labs required us to submit solidworks files haha",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Au3vLwOrsrDuO9JTht4gJEV6HvTSgMfR",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 573,
                    "name": "LEE, Yi-Kuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CKL",
            "date": "Dec 18, 2018",
            "title": "",
            "comment_content": "1. Introduction<br />2. Position Analysis<br />3. Velocity Analysis<br />4. Acceleration Analysis<br />5. Mechanism Design and Synthesis<br />6. Gear Trains<br />7. Cam Mechanism<br /><br />Content is quite useful. The main focus of the course is about 4-bar linkage.",
            "comment_teaching": "Not good, not bad. He will repeat some important content in the previous lecture in almost half of the lesson.",
            "comment_grading": "Homework 20%<br />Lab 20%<br />Midterm 30%<br />Final exam 30%<br />Optional project 10%<br /><br />Statistics:<br />Homework mean = 78.6/100<br />Lab mean = 90.1/110<br />Midterm mean = 58.5/100<br />Midterm SD = 19.8<br />Final exam mean = 65.5/100<br />Final exam SD = 13.6<br /><br />Many students did bad in midterm.<br /><br />My scores:<br />Homework: 70.7/100<br />Lab: 99/110<br />Midterm: 90/100<br />Final: 79/100<br /><br />Final grade: A",
            "comment_workload": "The workload is a bit heavy. You have to do a lab assignment every week by using Solidworks to design a 4-bar linkage. Although there are only 6 homeworks, most of them require a lot of time to finish. Especially for 4-bar linkage, you have to use both graphical and analytical method to solve the problem.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WiflC2TD7DChTYis3LaPzHojEmUkANGE",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1204,
                    "name": "XIA, Minglu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MS01",
            "date": "Nov 29, 2018",
            "title": "L2 MECH 3030 review",
            "comment_content": "Introduction to mechanisms, mobility and linkages<br />Position analysis of planar linkage<br />Velocity analysis of planar linkage<br />Acceleration analysis of planar linkage<br />-----Midterm Exam-----<br />Design and synthesis of planar linkage<br />Cam design<br />Gear trains<br />Special mechanisms<br />-----Final Exam----<br /><br />Some reminders:<br />1. Cheatsheet is allowed in both exams. 1 A4 paper in the Midterm and 2 A4 paper in the Final.<br />2. The final exam will only cover topics after the midterm exam.",
            "comment_teaching": "LECTURE:<br />Prof Xia's teaching is comparatively clear and organized. His powerpoint slides are much shorter and easy to follow. I skip his lecture since Week 2 but still manage to get a high score in Midterm because of his well structured ppt.<br /><br />The major drawback is that you have to attend the 3 hours lecture start from 9:00 am. As a result, I skipped most of them because I could not wake up so early.<br /><br />LAB:<br />A lot of annoying things to do. Teaching you how to use SolidWorks to do graphical analysis, but we cannot use SolidWorks in both exams, what are the points in it?<br /><br />I prefer to have a tutorial to discuss more example questions rather than wasting time to do those stupid Lab assignments.",
            "comment_grading": "Homework: 20%<br />Lab: 20%<br />Mid-term Exam: 30%<br />Final Exam: 30%<br />----------------------<br />Mid Term above mean 1 SD<br />Final Exam slightly above mean<br />Miss 1 homework<br />Lab ~80%<br /><br />Final Grade: B+",
            "comment_workload": "Homework: 6 homework in total, which required a lot of steps to complete.<br /><br />Lab: Copy others answer, should be OK if you have friends with you in the same Lab section",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gsAVRMoo8mOU7H28nkC2hZ0fovli9hyW",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 573,
                    "name": "LEE, Yi-Kuen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "omega",
            "date": "Dec 29, 2017",
            "title": "Waste of time",
            "comment_content": "4 bar linkage<br />gear<br />cam<br />matlab, but they dont teach",
            "comment_teaching": "boring and bad english<br />Always show you toys and video <br />Always repeat content from last 1-2 lectures<br />You can go to lectures and do you own things, do play with the toys because 1 question on midterm is about the transformer toy he passed around on lecture<br /><br />Lab: soildwork and working model<br />he just give you the question and that let you rot<br />always laughing<br /><br />some TA's english is extremely difficult to understand ( i talked to her only on final)",
            "comment_grading": "Normal<br />Everyone do bad in midterm, mean 4x/110<br />Final is difficult<br />both not open book, 1 a4 cheatsheet<br /><br />Dont waste too much on cheatsheet",
            "comment_workload": "5 homework in total<br />first one about DOF<br />second velocity analysis<br />third acceleration<br />fourth and fifth is Matlab!!!!!!!<br />learn by yourself<br /><br />They give &quot;help&quot; on matlab<br />by giving you a useless ppt and force you to finish the basic tutorial from matlab academy",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZdOxPVlLTEqkMsnMHr7iaw0ubQnIFvz9",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 573,
                    "name": "LEE, Yi-Kuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yu Hin",
            "date": "Aug 24, 2017",
            "title": "",
            "comment_content": "4-bar linkage, crank motion, screw, etc.",
            "comment_teaching": "All the professor did was to read the words in the powerpoint. Sometimes he repeated the same content for 2-3 lectures. It's perfectly okay to skip all lectures and read the notes yourself. <br />Note: Attendance will be checked (just passing around a paper and tick your name so it's okay to ask your friend...)",
            "comment_grading": "Open book exam. Understand the mechanism and copy the suitable equation and got an A.",
            "comment_workload": "Not a lot of homework, but very long calculation for each homework. Some software is required to finish the homework, but the use of the software will not be examined. <br />Very long lecture note D:<br />With mid term and final, both open book.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1FBNIsapF12E84yTxIMfHhD3Byk5rWFQ",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 573,
                    "name": "LEE, Yi-Kuen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "qwes",
            "date": "Oct 10, 2016",
            "title": "",
            "comment_content": "4 bar linkage, gears, cam &amp; followers<br />two &amp; three position methods",
            "comment_teaching": "Prof. can teach you something, but mostly you need to learn by yourself, he always ask you to watch youtube video at home. He encourage you to buy a book, but it is difficult to understand via the texts without detail steps or methods to solve the problem. He always pass obligation to TAs.",
            "comment_grading": "It is normal, but still not in a good grade even I done better in midterm",
            "comment_workload": "The workload is quite heavy, he suddenly add a project at the middle in the semester. Also, the homework is not easy to finish even have solution manual. The problems are the project require lot of time to finish.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "euROg9qHm83IeFU81mMPspxFzsvhWDhz",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 573,
                    "name": "LEE, Yi-Kuen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "asa",
            "date": "Feb 03, 2016",
            "title": "",
            "comment_content": "Four Bar Linkage, Gears, Cam",
            "comment_teaching": "Non-fluent, cant response to question. The biggest problem of this course is related to this instructor because the planning of the course is not good. In my semester, a project was suddenly added without any notification at&nbsp;&nbsp;the beginning of the session. Also, the weighing of the project changes twice to fit in the project workload. Also, the responsibility was always given to the TAs",
            "comment_grading": "Normal, Sensitive to curve",
            "comment_workload": "Project, Homework is quite heavy even though it can be copied from the textbook answer",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LW1ktpWEFPaU0lXkRXuKa41PigdrrFpR",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 573,
                    "name": "LEE, Yi-Kuen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "etkf",
            "date": "Aug 13, 2015",
            "title": "Worst course ever! but with extremely good grading",
            "comment_content": "Application of kinematics and dynamics in the analysis, design and synthesis of mechanisms. Type and dimensional design of linkages, cams and gears based on motion requirements and force transmission, in contrast to the strength requirements. Graphical, analytical and computer methods in analysis and design of mechanisms. Design considerations in mechanism synthesis.<br /><br />These are basically the basics what a mechanical engineer should at least know.",
            "comment_teaching": "The teaching is terribly terrible, forgive my weird language but it is never enough to over-over-over-overemphasizing this, not to mention the extremely bad English proficiency of the professor!",
            "comment_grading": "The grading, compared to the teaching, is surprisingly good. I thought I would at most get a B- or B since all of the exams and projects and homework are only similar to the average of the class, but it turns out to be an A+. It was really good.",
            "comment_workload": "Stupid project, that's it.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4j44EsWSLUs9xJOhDXmC4bv9IWJr5oU6",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 573,
                    "name": "LEE, Yi-Kuen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "cfszeto",
            "date": "Aug 08, 2015",
            "title": "",
            "comment_content": "Application of kinematics and dynamics in the analysis, design and synthesis of mechanisms. Type and dimensional design of linkages, cams and gears based on motion requirements and force transmission, in contrast to the strength requirements. Graphical, analytical and computer methods in analysis and design of mechanisms. Design considerations in mechanism synthesis.",
            "comment_teaching": "A few students attended his lesson, as his poor teaching skills<br /><br />always replied questions raised by student:&quot;Go read your books, you are an engineer.&quot;<br /><br />Late project (started at last two weeks of semester, ended two weeks after exam period)<br />Didn't provide any useful advice or support for project (no any follow-up works for my friend to complete his project using Arduino due to out of stock)<br /><br />Unfairness on the project<br />(eg some groups had received Arduino while some hadn't)<br />Change course weighting for the project on last week of semester (At last he change back to original weighting due to preparation of petition from students)<br />Some final works are actually unbelievable/unacceptable (heard from friends)<br /><br />A lot of students fxxked him because of the project",
            "comment_grading": "Good grade.&nbsp;&nbsp;But I got very bad grade",
            "comment_workload": "Homework is fine.<br />Project was terrible and too many problems, hope professor think deeply on project guidelines (actually the project guidelines were poor)",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qO07kFK6U7jgBYcbrhMhxVHq3GJHFVSE",
            "semester": "2014-15 Spring",
            "instructors": [],
            "is_author": false,
            "author": "ching",
            "date": "Aug 07, 2015",
            "title": "",
            "comment_content": "four bar linkage four bar linkage four bar linkage.....<br />mainly the analysis of four bar linkage.<br />and gears, engine...",
            "comment_teaching": "ummm... you really dont need to attend if you manage well to study yourself.<br />And there are videos if you really need to look back. The instructor use a lot of time to talk about things that are not examed but I think they are interesting.",
            "comment_grading": "good grade",
            "comment_workload": "weekly homework. It would be quite easy if you got the answer key as all questions are transform from textbook questions.<br />Suddenly give us a project near the end of term =_= locomotive robot race...<br />not heavily weighted after the complains but not sure if its gonna change in the future.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BdPLQS2nNclJUjq0Rj9deuAftOPsj7W1",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 573,
                    "name": "LEE, Yi-Kuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "浪子",
            "date": "Jul 24, 2015",
            "title": "chur 完就好grade",
            "comment_content": "four bar, graphical method ,analytical method<br />content: mid term exam, final exam, assignment<br />assignment 有source 做就ok, 都係書d exercise",
            "comment_teaching": "唔洗上堂,相信我, 有七成人冇上, 佢地隨時高分過你",
            "comment_grading": "mean B- to B",
            "comment_workload": "D assignment 有source 先識做, 快都要做2 hrs<br />個paper robot project 就有d chur , 祝君好運<br />mid final exam 輕鬆高分, open note ,but mean 會高, exam question好似全部出番書or note&nbsp;&nbsp;or lab note , 所以exam question你係會見過",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "t4fHa97JHkiAMvxsSzLVHiY81kQgVRP6",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 573,
                    "name": "LEE, Yi-Kuen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "lemonlml",
            "date": "Jan 11, 2019",
            "title": "",
            "comment_content": "1. position analysis (analytical and graphical)<br />2. velocity analysis (analytical and graphical)<br />3. acceleration analysis (analytical and graphical)<br />5. gear ratio<br />5. cam design",
            "comment_teaching": "lack of focus<br />unclear content<br />difficult to understand",
            "comment_grading": "fair grade<br />submit half homework and half lab quiz, midterm and final are mean and finally got C range",
            "comment_workload": "Heavy workload<br />Around 6 homework but some of them release a week before the final exam. one have to submit in the final exam and one have to submit in the study break<br />one Midterm and one final exam<br />Around 12 lab quiz and two of them have to submit in solid work",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JHcNR376XMNMRhYmWNNCYA5BY73AxIaW",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 573,
                    "name": "LEE, Yi-Kuen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "MECH仔",
            "date": "Aug 15, 2015",
            "title": "More detail review: https://www.facebook.com/HkustSecrets/posts/801701816565341",
            "comment_content": "Four-bar linkage<br />Different method to analysis four-bar linkage.<br />Draw graph and do calculations. <br />Use computer program to analysis four-bar linkage.",
            "comment_teaching": "Dun know, only attended first lecture.<br />Lab Ta is not helpful. <br />Prof. and ta not communicate well.",
            "comment_grading": "Only thing that is good in this course.<br />Mid-term and final mean have B.",
            "comment_workload": "Average workload.<br />3 hard to death hw.<br />Every week have lab but count little towards final grade.<br />Mid-term and final open notes and quite easy.<br />Need to do a project which have no guidelines after final.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}