{
    "error": false,
    "course": {
        "id": 964,
        "subject": "MECH",
        "code": "3520",
        "name": "Design and Manufacturing II",
        "description": "Engineering specification, selection of materials, design criteria. Methods of joining and assembly. Engineering components design and applications: shafts and bearing, gearing, pulleys and belts, brakes and clutches. Design for manufacturing.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            1910,
            1810,
            1710,
            1610,
            1510,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MECH\" data-code=\"2520\" href=\"/review/MECH2520\" target=\"_blank\">MECH 2520</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.75,
        "rating_teaching": 2.75,
        "rating_grading": 4.25,
        "rating_workload": 2.88,
        "review_count": 8,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 569,
                "name": "LAM, David Chuen Chun",
                "count": 7
            },
            {
                "id": 8,
                "name": "LAI, Tai Wai David",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "XPMRviP4FbJHVQ9Mh0FxAs2qP6iSeUuq",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 569,
                    "name": "LAM, David Chuen Chun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Ric",
            "date": "Jan 05, 2017",
            "title": "I feel obliged to reveal to every MECH UG junior student how appalling this course is.",
            "comment_content": "conclusion: no point taking this course, unless another Prof takes charge, which is not expected to take place until 6 to 8 years later. The contents are meaningful, and indeed should be understood by every ME graduates. Still they can be self-studied. Anyway, no matter you register this course or not, you have to do some self-study<br />here are the contents covered, they are arranged according to my understanding (sorry, they for unknown reason disabled the course page during the late final exam period so I can’t verify them since then):<br />¬\tPART I: Static Loading<br />Solidworks CAD modelling,<br />Solidworks (FEM Static) Simulation;<br />evaluating section forces (bending moment and shear forces) (using both FEM and singularity function) &amp; the associate von’ Mises stress in an 1D beam;<br />different Static Failure criteria; safety factor evaluation &amp; dimension optimization (design)<br />¬\tPART II: Variable Loading/ Fatigue<br />Stress-based Approach: S-N curve for repeated completely-reversed loading, evaluating the actual endurance limit of a steel part;<br />amplitude and mid-range stress under steady-state loading;<br />notch sensitivity;<br />various fatigue criteria (for ductile materials, i.e. modified Goodman, Gerber, ASMT elliptic, and Soderberg), safety factor design / analysis using load-line method<br />shaft design with variable loading (Distortion Energy method coupled with fatigue criteria)<br /><br />for more details and problems, see the textbook: Shigley’s Mechanical Engineering Design, McGraw Hill<br /><br />interestingly, there are no pre-requisites stated officially, however, both engineering statics and mechanics of materials are literally the prerequisites.<br />Just one more point to make: don't trust the course description, the word “fastener” indeed to my best knowledge has never been mentioned.",
            "comment_teaching": "I dread to recall how this course went on actually…<br /><br />tutorial + &quot;regular&quot; lecture + 3 phases of a beam project + 3 assignments + 1 CAD quizzes, and self-test quizzes<br /><br />In the project, each team of 3~5 was asked to design and manufacture a beam with section not larger than 1cm*1cm, and a specified span of 12 cm, and with a stipulated material -- Plaster of Paris. Phase I: design it against static failure; Phase II: design against fatigue; phase III: truck competition, where each team had to use mount their beams onto the given RC vehicle as front &amp; rear bumpers...<br /><br /><br />The male TA, taking charge of the early stages of the tutorial, projects and quizzes seemed passionate about teaching. However, gradually it is found he is not actually quite qualified, he blundered when teaching the concept of “structural efficiency”, which is properly embarrassing…<br /><br />The female TA, who is believed to be the one responsible for posting all notifications are unbelievably reliant! Posting an announcement about change of mid-term venue just 1 hour before the exam commenced. Indeed, most notifications are published at the last moment.<br /><br />Still, the root causes of any issue may be related to one particular guy [hint: the one with the highest pay but without much contribution to the course]. Obviously, he never supervised the work from the TA. The only things he did (as far as I am aware) are inventing the brilliant beam project AND ramming 6 intensive problems in the final exam. He once claimed, the whole point of the project was to apply the theories learnt (yes he’s right, not “taught”) into “real-life” example, with increased awareness to manufacturability (yes, he’s right again, for a brittle beam of 1cm * 1cm * 12cm, mold-cast is really a major design headache…)<br /><br />Nonetheless, the 3 assignments and the related Tutorials are genuinely helpful to gain basic understanding on what those concepts covered by the lecture slides.<br /><br />Still above are just the “highlights” of their misdoings, the overall teaching is far from acceptable, “E” is mainly due to that the f**king Prof",
            "comment_grading": "the TA claimed relative grading applies.<br />Commitment and Intelligence are not sufficient… The element of luck can often be found dominant.<br />Grading scheme: forgotten, no longer available to me, but basically (rough percentages only)<br />Projects ~ 30%* (how it is broken down is irrelevant because there is no grading scheme for each grading criterion in the projects)<br />Mid Term# ~ 20% <br />HW# and Quizzes ~ 15%<br />Final Exam# ~ 35%*<br /><br />* marks not available to students<br /># very harsh marking scheme, only the values for the constants stated in that version of the TB were deemed “correct”. for each problem, no partial credit for correct method and substitution, once those numerical values determined previous are wrong, meaning you can easily get very low marks, if you are not luck enough to get the first part of a problem all “correct” because in this course many calculations are carried over to other subsequent steps of the same problem....<br /><br />The Final Exam is just brilliant! About 6 calculation-intensive problems, 2 involving iteration! The nerve can easily lead to mistakes, and of course with that harsh marking scheme, luck is definitely what you need.<br /><br />Honestly, I have not never received any grade lower than A- for any MECH courses taken, but this one just stands out from others. Got B eventually for the first time. What a lesson though. It is all about tactics! not really learning the contents...",
            "comment_workload": "let’s put the time spent on self-studying aside,<br />talking about manufacturing those brittle beams, some facts:<br />¬\tintensive manufacturing activities: for submission (all will receive destructive test), at least 1 (for testing), 5 (for testing), and 5 (2 for the competition and 3 for scrutiny) for project 1, 2, and 3 respectively.<br />But given the high failure rate during manufacturing and other various concerns, you probably have to produce at least 20 for the semester, <br />BTW group work of 3~5, maybe an efficient group could have minimized the burden, but still it would still be horrendously intensive!<br />¬\thigh probability of fracture during manufacturing and transportation<br />(who the hell invented this brilliant idea of stipulating brittle materials for bumpers!? Witness those beam taking you years to produce fracturing must be fun (just for that spectator [hint: the one with the best pay]…))<br />¬\tpoor craftsmanship by the TA, they cut the mold up to an error of ± 1 mm. worst still, the edge of the plate can be about 2 (you know for each rectangular cut, there are usually 4, and you often have at least 4 of those…). Those issues can be fatal to the accuracy of the prediction (graded) because the beam is very small and sensitive to manufacturing defects (section: maximum 1cm*1cm, span: 12cm)!<br /><br />for the HWs, consult your “source”, should be fine in terms of workload<br /><br />btw almost no workload during the first 3 weeks. Haha… Meaning the major intensive workload was distributed in a spectacular fashion!!!<br /><br />hope you can make an informed choice ;)",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Vq5ZTPEMAbTJUMvx8Gm5voyE5ExloUPU",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 569,
                    "name": "LAM, David Chuen Chun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "potat0",
            "date": "Feb 05, 2016",
            "title": "",
            "comment_content": "All about beams! Get ready for an intense semester of studying a solid beam! so exciting! Covers: singularity functions, bending moment, stress strain analysis, fatigue, failure, etc... The course is not really about design, more about applying sests of equations and criteria, without any practical application. It's only theoretical. It overlaps a bit with MECH3010 (solid mech 1) and uses a fair bit of knowledge from MECH2410 (engineering materials 1).",
            "comment_teaching": "Very very boring. The professor doesn't explain much on how/why we get all these formulas, but spends most of the lecture talking about irrelevant things. He does try to relate a bit to design choices, but meh, not really. The TAs were much better at getting the point across and clarifying the course content.",
            "comment_grading": "The exams are fairly simple and the grading is not harsh. There are 2 midterms (non cumulative) and a final (cumulative) with formula sheet, so it's not that complicated to do well. Also, the solution to the homework is uploaded before submission deadline, which basically is a &quot;free&quot; 10% of the course. Tutorial quizzes are fairly simple and not very serious, and not all are graded.",
            "comment_workload": "almost weekly homework and tutorial quizzes, you will need to stay on top of things, but all are simple and the solutions are on canvas so you can get away without doing much.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Z4aBfdFrDWpjAKoeXhEy97I02X3Gva4R",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 569,
                    "name": "LAM, David Chuen Chun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kero星人",
            "date": "Mar 06, 2020",
            "title": "",
            "comment_content": "similar to statics and dynamics<br />most contents are learned before midterm<br />after midterm is topics *can be obtained from the same book of statics and dynamics",
            "comment_teaching": "self-learn helps<br />disorganized ppt, but textbook helps<br />blow water every lecture<br />expect him to use exaggerating, complicated simile for simple concepts",
            "comment_grading": "super easy quizzes<br />formula list listed out all formula you need, indicated which formula you need for which question<br />so being careful is the only criteria differentiate between you from others<br /><br />all homework answers can be obtained from textbook solution",
            "comment_workload": "3 quizzes<br />3 homeworks<br />1 project<br />no final exam",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QvUwj55G0UhsizcJYV42cZSedXZjYkWG",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 569,
                    "name": "LAM, David Chuen Chun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hopwivan",
            "date": "Jan 17, 2019",
            "title": "",
            "comment_content": "Advanced MECH2040<br />First part of the course is revision of stress, bending, safety factor, Mohr's circle.<br />Second part is about failure of materials: fracture and fatigue.<br />As the course is about design, it always emphasizes safety factor.",
            "comment_teaching": "It is easy to follow the professor during lectures.<br />Tutorials and labs are casual.",
            "comment_grading": "10% online video (extremely easy)<br />15% CAD assignment (2 Solidworks homework)<br />15% quizzes<br />25% project<br />35% final exam<br /><br />Quizzes and final exam are straight forward and can be well prepared by the given sample questions.<br />Project is to make beams and write short report. 3 people in a group.",
            "comment_workload": "Online videos and Solidworks assignments are easy.<br />Making beams is quite interesting, but time-consuming.<br />Sample questions are given for quizzes and final exam. The style of questions is more or less the same.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cSr9PDScJTO12HFmB1z8dh6o7LqBq5Sg",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 569,
                    "name": "LAM, David Chuen Chun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "omega",
            "date": "Dec 29, 2017",
            "title": "Glad that I take this instead of Robin ma's",
            "comment_content": "Very different from 2520<br /><br />Static from 2020, focus on singularity function<br />Mohr circle, shear, I, Q, y etc<br />ductile and brittle material properties like stress, strain, strength<br />a lot of coefficient and table and graph<br />a small part of shaft<br />A lot of safety factors<br /><br />Project<br />Make beams and chassis<br />make a prototype, then a mold, finally the beam/chassis<br />Ta will do the tests<br />Plot the test result and analyse",
            "comment_teaching": "blow water<br />For no reason he talks very loud, almost like yelling at you<br />Don't expect to learn in lectures<br />TA's English is not that good, but you should go to lab and tutor, more than half of the time is talking about the project<br /><br />Basically, everything is on canvas, the course book is not available in HK but you dont have to buy it",
            "comment_grading": "Guessing<br />project 40% Final 60% and Quiz 15%?<br />They close the canvas page right after final exam, i dont know the exact number but the percentage is similar<br /><br />Project design is bad<br />No one knows how they grade, the performance of my group's beam is bad<br /><br />Final is easy to moderate<br />A-",
            "comment_workload": "Heavy <br />2 assignment, quiz, a lot of things to do in the project and present<br />Project instruction is unclear so ask more questions on what to do on the analysis<br />Manageable for a group of 3 <br />Watch out for freeriders",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "umpBuVJKWl7ptQga2ff73CRzXFuJTBKd",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 569,
                    "name": "LAM, David Chuen Chun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "GK",
            "date": "May 30, 2017",
            "title": "讀完都唔知為乜",
            "comment_content": "Beam，乜都係beam，基本上就係講fracture 同fatigue of beam，內容其他評論有寫唔重複，但其實前半部係MECH2040學過，後半亦只係塞式，結果你會覺得唔知學過乜。",
            "comment_teaching": "最神奇呢樣野，有陣事居然Lecture都唔見lecturer，佢上堂又純吹水，其實成個course計數part靠tutorial，我個sem好在有教得好嘅TA，靠個Lecturer實死。如果閣下要take，祝君好運撞正好TA。",
            "comment_grading": "可能MECH course唯一好嘅就係grade，final乜都唔識居然有A-，身邊唔少人都A range，算好grade。",
            "comment_workload": "功課方面有source不是大問題，考試就抱一個你識人地識，你唔識人地都唔會識嘅心態就掂。<br />由於可能上年比人話太theoretical今年就塞左個project整beam，比大家manufacture 下做下小手工，不過其實一啲都唔engineering，計出黎嘅數同度嘅天地比，完全唔合理。最後有個碰碰車比賽直頭係派膠。<br />總之成個course最重workload係整project啲beam，有得揀最好有好手工嘅組mate先好玩呢科。",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "62kkVSyTCTCi0KV2bKp5LxCO7XlA5IF7",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 569,
                    "name": "LAM, David Chuen Chun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lazrak",
            "date": "Nov 22, 2016",
            "title": "",
            "comment_content": ": It was an intense semester of studying solid beams. The course was not about design but more about applying sets of equations and criteria, without any practical application (only theoretical).",
            "comment_teaching": "Regarding teaching, the professor was going deep into the explanation of all the formulas and was helpful and open to any question in and out of class",
            "comment_grading": "The exams were difficult but the grading was not harsh.",
            "comment_workload": "The exams were difficult but the grading was not harsh. Also, the solution to the homework is uploaded before submission deadline, which basically is a &quot;free&quot; 10% of the course.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "T33vZEvsdwyWmdRDuLJYDVA9gQfVKHhT",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 8,
                    "name": "LAI, Tai Wai David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cello",
            "date": "Jan 23, 2017",
            "title": "best subject ever",
            "comment_content": "basic design pluz some solid mechanics<br /><br />fracture load of ductile and brittle materials<br /><br />fatigue life cycle <br /><br />basic design pluz some solid mechanics<br /><br />fracture load of ductile and brittle materials<br /><br />fatigue life cycle",
            "comment_teaching": "good english and interesting lectures<br /><br />keep asking students questions<br /><br />many examples in lecture to help you understand<br /><br />good english and interesting lectures<br /><br />keep asking students questions<br /><br />many examples in lecture to help you understand",
            "comment_grading": "very good many ppl A range mean or above mean about b range<br /><br />very good many ppl A range mean or above mean about b range<br /><br />very good many ppl A range mean or above mean about b range<br /><br />very good many ppl A range mean or above mean about b range",
            "comment_workload": "only three homeworks and giving ans in tutorial before handing in<br /><br />some online quizes and CAD quiz<br /><br />presentation in lecture but no marks given<br /><br />project is interesting and easy if no one freeride<br /><br />only three homeworks and giving ans in tutorial before handing in<br /><br />some online quizes and CAD quiz<br /><br />presentation in lecture but no marks given<br /><br />project is interesting and easy if no one freeride",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}