{
    "error": false,
    "course": {
        "id": 1008,
        "subject": "MGMT",
        "code": "4230",
        "name": "International Management",
        "description": "Understanding and managing multinational corporations in different economic, social, cultural, legal and technological environments.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1510,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.57,
        "rating_teaching": 4.14,
        "rating_grading": 3.71,
        "rating_workload": 4,
        "review_count": 7,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 831,
                "name": "ZHELYAZKOV, Pavel Ivanov",
                "count": 6
            },
            {
                "id": 591,
                "name": "HO, Ching Ching Mary",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "dRNVEAM5dJHuMecGzoQ5HvKycAjo37Hm",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hw5010",
            "date": "Jan 10, 2019",
            "title": "Worth Taking if taught by Mary",
            "comment_content": "The course is basically divided into 2 parts:<br />Part I: Globalisation &amp; the International Business Environment<br />Contents regarding globalisation, international economies and political systems, with content freshly designed, including trade war and Brexit as course content. (This is basically the first course I have ever taken in UST with such a fresh and up-to-date course content lol)<br />Prof studied politics in her university degree, so she is very knowledgeable in this particular module of content and very worth paying attention to her every lecture<br /><br />Part II: Corporate Strategy &amp; Management in the International Business Environment<br />Basically an advanced version of mgmt 4210,&nbsp;&nbsp;cover MNC's organisational structure and their globalisation strategy",
            "comment_teaching": "Mary is very humorous and you can feel her passion especially when she is sharing political issues <br />She also encourages in-class interaction and will recognise active participants at class <br />During her lecture, she will verbally explains and elaborate many contents that only has 1-2 sentence in the ppt, so you will need to concentrate on what she explains in class",
            "comment_grading": "Absolute Grading <br />Class Participation: 20/100<br />Mary will mark down students' name who contribute valuable answer to her question or raise challenging question to count the participation, there is also iPRS attendance for every lecture<br /><br />Exam I &amp; II: Each 20, 40/100 in total<br />Basically Essay Question, in-class 1-hour exam <br />Essay Questions for lecture materials and case studies<br />Question is not straight-forward to lecture materials and require in-depth understanding of content<br /><br />Individual Case Analysis: 20/100<br />There are 5 cases for the entire course, choose one and complete the case analysis on assigned date, Mary will ask you to share your analysis on the assigned lecture for case discussion<br /><br />Group Project - Country Analysis: 20/100<br />5-6 in a group, do an Analysis on assigned country and respective industry by using different framework taught in class, and complete a 15min presentation, no need to submit any report<br /><br />If you can get 80/100, you can guarantee an A range",
            "comment_workload": "Very light workload<br />Only one individual case analysis and a group presentation<br />PRS on each lecture only acts for taking attendance, not any form of quizzes <br />Just make sure you read the 5 case studies on assigned lecture for case discussion",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "owtbrFVhEoDff1BIV3w6Ofopq685xPd0",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 831,
                    "name": "ZHELYAZKOV, Pavel Ivanov",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sasannnl",
            "date": "Dec 29, 2020",
            "title": "I love Pavel!!!",
            "comment_content": "The content is about International Management, not hard to understand.<br /><br />9/8 Tue What is globalization?<br />9/10 Thu International trade I<br />9/15 Tue International trade II<br />9/17 Thu International trade policy<br />9/22 Tue Foreign direct investment<br />9/24 Thu The international financial system<br />9/29 Tue Analyzing countries<br />10/6 Tue The strategy of international business<br />10/8 Thu CASE: Yushan bicycles<br />10/13 Tue Entry strategies I<br />10/15 Thu CASE: Jollibee<br />10/20 Tue Entry strategies II <br />10/27 Tue CASE: Amazon in emerging markets<br />10/29 Thu Global production and supply chain management<br />11/3 Tue CASE: Uniqlo: A supply chain going global<br />11/5 Thu Global marketing and R&amp;D<br />11/10 Tue CASE: Louis Vuitton in Japan<br />11/12 Thu CASE: Paris Baguette<br />11/17 Tue The organization of international business<br />11/19 Thu Global HR management<br />11/24 Tue CASE: Arla Foods",
            "comment_teaching": "I would say Pavel has a strong accent and it is quite hard to follow his lessons. But since it is the online form, you can watch the recording videos with subtitles. However, he is very nice to answer your questions and reply your email very quickly like within several minutes lol",
            "comment_grading": "The grading is quite good! TA said she has tried her best to maximise the A range and B range. Participation is very important in Pavel's classes especially in case discussions. If you did very well in exams but didn't say anything in his class, probably you can only get B-/C+ in the end.<br /><br />Participation : 20%<br />Mid-term exam : 25%<br />Final exam : 25%<br />Group final project : 30%",
            "comment_workload": "Workload is very light for a 4 credit course. Only in the second half of the term you need to read the case every week. Remember to speak up in each case to earn the 20% participation grade. The differences of performances of students in exams and project are very slight.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "X8xpJN9CJFVshqnKrIClcPPBEfQ5vOoM",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 831,
                    "name": "ZHELYAZKOV, Pavel Ivanov",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "pye",
            "date": "Jan 21, 2020",
            "title": "",
            "comment_content": "The content is quite useful. You will be able to learn different theories and strategies about globalization and international business management. There are also lots of real business cases.&nbsp;&nbsp;Some lessons are used for case discussion.",
            "comment_teaching": "The teaching is quite easy to follow. The professor is always happy to answer questions regarding the class and group project. He also requires a lot of participation during the case discussion lessons.",
            "comment_grading": "My gradings:<br />Attendance including class quizzes: full mark<br />Participation: moderate <br />Mid-term exam: below mean (i think around 1 s.d.)<br />Final exam: cancelled<br />Group final project: full mark (the presentation is cancelled, so the grading is based on our final report and ppt slides)<br /><br />Final grade: B<br />The grading is quite fair to me, as I did not do well in the mid-term exam.",
            "comment_workload": "You have to do a lot of preparation before classes as there will be a quiz in each lesson. Besides, you need to read through and analyze the case before every case study lesson, in order to get well prepared for the in-class discussion. It may also take some time for the group project as you have to prepare a final report and presentation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bIviStAilNaMS4N4PkwehlITvNYfZFNT",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 831,
                    "name": "ZHELYAZKOV, Pavel Ivanov",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sssssssa",
            "date": "Jan 20, 2020",
            "title": "Bad Course",
            "comment_content": "The content is fine, not too complex as long as you focus in class. But it was too much to memorise and it is messy with the powerpoint he prepared.",
            "comment_teaching": "The accent is a really big problem, sometimes you just cant follow even you are very focus in class. The professor will give real life example to strengthen the understanding of the students.",
            "comment_grading": "Bad grading. REALL REALLY bad. Attendance, project, participation, midterms and finals. It was so unfair where you get to partner up with the international students and they were not really contributing into the project or even attending the class.",
            "comment_workload": "With attendance quiz, loads of case studies, project, 2 midterms and 1 final.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iCKmNa8tRypQmlanbovg4gZHQnv2LZPq",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 831,
                    "name": "ZHELYAZKOV, Pavel Ivanov",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Potato Head",
            "date": "Jan 20, 2020",
            "title": "Not recommended if taught by Pavel",
            "comment_content": "Generally talk about different strategies for a company to expand its business to overseas. If you are interested in strategic consulting, perhaps you may find the content of the course quite interesting. Topics like entry strategies, country analysis, marketing, supply chain and HR management strategies for a firm to further develop in overseas countries are included in class. Case studies regarding each topics will be discussed as well.",
            "comment_teaching": "Frankly speaking, Pavel's teaching can be the worst I have ever experienced in UST. His accent is so heavy that most of the time, students (even for native english speaking exchange students) have to ask him to repeat what he said. His accent makes it super difficult to catch what he says. Besides, he just simply reads out every word written on the PPT, while his slides are quite wordy. You may sometimes find it hard to understand the content. One thing I found a bit ridiculous is that he requires students to answer questions for getting marks for participation. However, he does not ask questions during those 'ordinary' classes which lectures are held, he only asks questions during those 'case studies classes'; yet, there are only 6 cases included throughout the semester. It will be quite hard for every students to get a chance to answer questions in all cases in such case.<br /><br />Despite his very outstanding academic and career background, Pavel's teaching truly has great room for improvement :)",
            "comment_grading": "Grading:<br />Attendance (including quizzes): 10<br />Participation :&nbsp;&nbsp;15<br />Mid-term exam :&nbsp;&nbsp;20<br />Final exam :&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;25 <br />Group final project :30<br /><br />Really poor for my case:( <br />I got above mean for my mid term and attended all classes (completed all quizzes), below mean for my group project, and final exam was cancelled without any replacements. And my grade turns out to be a C. I asked for the final grade breakdown and was told that I was at the bottom tier for participation. However, I did answered questions during class, I found it quite unreasonable to get a bottom tier score for participation. I feel like it is totally just based on impression which sounds&nbsp;&nbsp;pretty unfair. <br /><br />Besides, for attendance, you are asked not only to complete the iprs quizzes right at the beginning of each class, but the accuracy rate also matters. If you answer the questions but you did not choose the correct answer, you cannot get full mark in such case.",
            "comment_workload": "The workload for this class is manageable. Not much to do, except the attendance part might be a bit harsh if you are taking a 9 am lesson as they start the iprs quiz exactly at 9am. You probably will miss the quiz even if you are just a few minutes late. <br /><br />Whereas for the group project, I find it a bit confusing. Not so sure what should be included and discussed in the report as very few guidelines are provided. There are also quite a lot of exchange students taking this class, you might find it a bit hard to gather people around for working on the project when you have 2/3 exchange students.&nbsp;&nbsp;And unfortunately for my group, there are a few freeriders, making the workload for the project quite heavy.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "N2Tl7pWnclC0b2ZYqbQZQiDPDpWRDage",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 831,
                    "name": "ZHELYAZKOV, Pavel Ivanov",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Spriha",
            "date": "Jan 22, 2021",
            "title": "Easy A with low workload",
            "comment_content": "Extremely easy content. It is more theoretical in the beginning two weeks. However, it gets more practical with time.",
            "comment_teaching": "Pavel has a very strong accent. It was even more difficult to understand him due to online lectures. However, after one to two weeks of lectures, you get used to the accent and start understanding the content.<br />He is generally very nice, although he did get a bit agitated when someone from our class was found guilty of plagiarism on the exam.",
            "comment_grading": "Extremely easy grading. There are two exams - midterm and final. Both of these are subjective. The exams might seem difficult while writing them, but once the grades are released, you will find yourself with a score much higher than what you expected.<br />I, for example, was scared I might get a low 50s or 60s score in the midterm. I ended up with 92. Similarly, I got a 95 on the final, with the class highest as 98.<br />Participation is extremely easy to do using the chat function of Zoom, as long as a person skims through the case studies before class. The case studies are guided and led by Pavel and are not very difficult if you have a knack for the content.<br />As for the final project, there are three assignments - project proposal (ungraded - a form of written consultation), project presentation (ungraded - a form of online feedback session) and final report (graded). The professor usually tells everything you need to change for the report after the presentation, which makes it easy to understand his expectations.<br />Ended up with an A.",
            "comment_workload": "No workload at all.<br />Just one case study per week and participation.<br />Only the final workload needs you to put in extra effort.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Q0qpWidY3GdDJ7WSJMKvUcrwa0QKuOOT",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 831,
                    "name": "ZHELYAZKOV, Pavel Ivanov",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "weißbrot",
            "date": "Jan 20, 2020",
            "title": "Interesting introduction to Management",
            "comment_content": "The course starts with a brief history of globalization and financial markets as well as international trade. It then delves into frameworks for analysing businesses in an international context (CAGE). The next theme is the&nbsp;&nbsp;way&nbsp;&nbsp;companies&nbsp;&nbsp;deal&nbsp;&nbsp;with&nbsp;&nbsp;a globalized&nbsp;&nbsp;environment,&nbsp;&nbsp;both&nbsp;&nbsp;in&nbsp;&nbsp;terms&nbsp;&nbsp;of&nbsp;&nbsp;big&nbsp;&nbsp;picture&nbsp;&nbsp;corporate&nbsp;&nbsp;strategy&nbsp;&nbsp;as&nbsp;&nbsp;well&nbsp;&nbsp;as&nbsp;&nbsp;the&nbsp;&nbsp;functional&nbsp;&nbsp;implementation&nbsp;&nbsp;(e.g.,&nbsp;&nbsp;marketing,&nbsp;&nbsp;operations&nbsp;&nbsp;and&nbsp;&nbsp;human&nbsp;&nbsp;resources&nbsp;&nbsp;in&nbsp;&nbsp;the&nbsp;&nbsp;international context). Case studies are done in class on 6 occasions and cover real business cases relevant to the current topic.",
            "comment_teaching": "I had no trouble at all understanding Prof. Zhelyazkov's English and he spoke freely throughout the lectures, rarely looking at the slides. He used lots of examples to&nbsp;&nbsp;underline the points he was explaining and for me as a non-business student it was quite interesting and engaging.",
            "comment_grading": "Grading seemed fair to me. The professor emphasized from the start that participation was important to him and tried to motivate students to speak up during the case study classes.<br /><br />percentage / mean / my grade<br />Attendance (including quizzes): 10 / ? / full marks<br />Participation: 15 / ? / ? (did very well here though)<br />Mid-term exam: 20 / 75.4 / 92.5<br />Final exam: 25* / /<br />Group final project: 30 / ? / ? (But our group did extremely well, so possibly close to 100% here)<br /><br />*cancelled, along with project presentation; deck still had to be submitted along with report though.<br />-&gt;A+",
            "comment_workload": "Revising for the quizzes and working through all the case studies to prepare points for class participation takes time and you will need to constantly stay on top of things to get full marks. The midterm seemed easy to me, but others mentioned they found it difficult. (Not a business major, so can't compare it to other MGMT courses). My group put a lot of work into our report and it paid off. The result you get really depends on the amount of time you spend on the course and whether you speak up in class.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}