{
    "error": false,
    "course": {
        "id": 997,
        "subject": "MGMT",
        "code": "2130",
        "name": "Business Ethics and Social Responsibility",
        "description": "Taking a discussion-based approach to examining ethical issues in a corporate context, this intermediate business ethics course will focus mainly on the ethical issues related to the interaction between business and society. Students will further develop their ethical knowledge, moral reasoning skills, and attitudes towards social responsibility by considering the overarching corporate implications of their decisions. This highly interactive course will draw upon relevant current issues to help students understand (and overcome) some of the real-world challenges that business executives confront.",
        "categories": [],
        "website": null,
        "credits": 2,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "(for non-BIBU and non-SGFN students) <a class=\"course-link\" data-subject=\"MGMT\" data-code=\"2010\" href=\"/review/MGMT2010\" target=\"_blank\">MGMT 2010</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.88,
        "rating_teaching": 4.17,
        "rating_grading": 3.71,
        "rating_workload": 3.62,
        "review_count": 69,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 591,
                "name": "HO, Ching Ching Mary",
                "count": 12
            },
            {
                "id": 590,
                "name": "HE, Jinyu",
                "count": 9
            },
            {
                "id": 1268,
                "name": "YOUNG, Mark",
                "count": 9
            },
            {
                "id": 586,
                "name": "CHAO, Melody Man Chi",
                "count": 7
            },
            {
                "id": 1165,
                "name": "KIM, Yong",
                "count": 6
            },
            {
                "id": 1622,
                "name": "BROWN, Zachariah",
                "count": 6
            },
            {
                "id": 599,
                "name": "GARG, Sam",
                "count": 5
            },
            {
                "id": 583,
                "name": "LEVERMORE, Roger John",
                "count": 3
            },
            {
                "id": 589,
                "name": "MIHOREAN, Mark Andrew",
                "count": 3
            },
            {
                "id": 1648,
                "name": "KOC, Joseph",
                "count": 3
            },
            {
                "id": 598,
                "name": "LI, Qiang",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "VqJTCxm6k62VGMY0Vb9ncDFph0TBXV2Q",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "清水灣廢青",
            "date": "Dec 30, 2020",
            "title": "Another Bull Shit MGMT Course. Introvert = C range (WHAT an ethical ethics course)",
            "comment_content": "Similar to MGMT 2010, learned lots of bull shit theories.<br />To be fair, the content is slightly more useful than 2010 as the concepts can be applied into corporates world. However, it is still very useless.",
            "comment_teaching": "I did know it sucks.<br />But it is pre-reg. I can't drop. <br />Also, I couldn't swap as no one wants her class. :)",
            "comment_grading": "Thank you this useless course together with MGMT 2010, the 2 only C range I get throughout my uni life, I give up pursuing first hon (cuz these two BUSINESS CORE counts MCGA, which requires 3.6 to 1st hon) and relieved from UST academic pressure :) Thank you Mary! <br /><br />I will talk more about grading in workload.<br /><br />DLLMCH",
            "comment_workload": "So fking damn heavy. I think it is a 5,6 credit workload.<br /><br />Cra9zy Workload Requirements:<br />10% online discussion: 50-150 words per essay * 3 essays (each week) * 10 weeks = 1500 - 4500 words for only 10 % of a 2 credit course :D The requirement is officially written. I don't know how the fuck other people think this course workload is reasonable. 比UST Chur撚到傻左?<br /><br />10% Online news sharing: in your assigned week, share a news in CANVAS discussion, applying concepts. Keep tracking of your discussion throughout the week. Some crazy people will almost reply every single comment (2X comments). <br /><br />20% Quiz: 3 quizzes. Testing the lecture notes. This part is relatively chill, so the mean is 9/10.<br /><br />20% Role Plays: 2 case analysis on lessons. Discuss in group and type it on the online board. Quite stressful for introverts due to peer evaluation after the lesson. Also, need to present after typing the board.<br /><br />30% Group Project: Shoot a 10mins video talking on some on9 ethics issue. 學唔撚到D咩，做十幾頁slides係基本. 有D人為左呢個2 credit course，搞撚哂字幕, 整鳩埋動畫,Role Play埋扮professor,真係好Creative :) 究竟為左分可以去到幾撚盡<br /><br />5% Feed Back on 2 group projects: 400 words max. Also quite heavy workload as every group project has included so much contents to chur their grade and you need to read it or at least understand what they are trying to convey. <br /><br />For all the above, I get 70/85, ~83%, should be above mean.<br /><br />15% Participation: I only fk up this part, then get C range. Given that I participated all lessons, Mary rated me unsatisfactory just because I did not speak up in front of the class on my own initiative. 每堂抽十幾個名答問題，堂堂都好撚stressed，而且堂堂都有case studies, 要睇幾頁case/video<br /><br />結論: Introverts 就 deserve C range. no matter I did all the things required including typing thousands of words in this 2 fking credit course. <br /><br />真係好撚柒ethical. 仲好意思Claim自己做ethics course. 垃撚圾mgmt courses",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 28,
            "vote_count": 28,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YpdTqwgUL2JCJq3pJxhVqpHkgz4n1buu",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1165,
                    "name": "KIM, Yong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tyy⭐️",
            "date": "Jun 02, 2020",
            "title": "Nice professor, good grade course with light workload",
            "comment_content": "Ethics and decision making<br />CSR and it’s driving force<br />Stakeholder theory<br />Change management<br />Corporate rights and responsibilities<br />Market and profit<br />Compliance and accountability<br />Strategic CSR<br />Value creation<br /><br />A comprehensive course for SBM students. The content is not very interesting, but in general it is OK.",
            "comment_teaching": "I really really like him!<br />He didn’t force us to open the camera. You can close it if you feel uncomfortable. We only need to open it during quizzes time. Super nice!<br />He didn’t force students to answer questions as well. Participation and answering questions do not affect your course grade. Just speak if you want to. Heaven to introverts!<br />His powerpoint is simple and his teaching is clear and to the point. Most of the students will not worry about the quiz because he just set questions that he has explained in the class. He said he don’t want students to study for a very long time to prepare for the quiz, so the quiz is quite short and easy to handle if you have attend his lecture.<br />Lastly, what I want to say is that he really impressed me. He said that students will forget everything after the course, but he wants his students to at least remember something in the course through his teaching. Very touching!",
            "comment_grading": "Very generous!<br />The quizzes will count the highest 3 out of 4.<br />Two stimulation games which are quite easy and interesting. (It is very fun and you can really learn something from the game!)<br />A video reflection to talk about what you have learned from the game by using course knowledge to explain it.<br /><br />I will say as long as students complete everything on time, and pay some attention in quizzes and reflection, A range is nearly guaranteed.",
            "comment_workload": "Throughout the course I did not feel stressful at all, but professor did mention that there should be presentations/projects in normal class. Because this semester is online class, so it becomes stimulation games and video reflection.<br /><br />For the quizzes, every time is non cumulative. You only need probably 1-2 hours to prepare.<br />For the games, you will definitely find it interesting.<br />For the reflection, probably takes a day to work on. <br />That’s all!<br />But I think this semester is probably the lightest because there is no presentation~",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 8,
            "vote_count": 10,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mRzHFkedAvJQ8dyjRqPglR1MB234b0bo",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 598,
                    "name": "LI, Qiang",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Luweegee",
            "date": "Jun 11, 2021",
            "title": "Bullshitting course with bad teaching 👎",
            "comment_content": "Another bullshitting course that teaches you business &quot;ethics&quot;. I have absolutely no idea what I've learned in this course and I highly doubt whether this course has made anyone a more ethical person 🙄.<br /><br />This course has lots of case study on corporate responsibilities and unethical practices. However, those are not very useful and most of them are bullshitting 💩.",
            "comment_teaching": "Professor Li Qiang is VERY BAD at teaching 🙄. His face is grumpy and unhappy most of the time. He does not show any passion towards the course material and he always speaks in a monotone manner. I'm fully convinced that he does not give a shit in this course. If the professor doesn't care about business ethics, then why should I care? 🤔<br /><br />TA Barry Ng is also notorious for not releasing any marks at all. This time he improved by releasing all scores AFTER releasing the final grade just to make sure that you cannot appeal 😡",
            "comment_grading": "TA only release all the scores after the final grade is out. He really wants to make sure that nobody can appeal for their scores before releasing the final grade. What a &quot;clever&quot; way to reduce the workload of the TA 😑<br /><br />📃 Grading Scheme<br />🔶 Attendance - 5%<br />🔶 Individual participation - 20%<br />🔶 Self-reflection essays x 2 - 20%<br />🔶 Case analysis report - 20%<br />🔶 Group project presentation - 15%<br />🔶 Group project report - 20%<br /><br />Statistics:<br />Attendance - Mean: 4.6 ; Max: 5<br />Individual participation - Mean: 9.1 ; Max: 18.2<br />Self-reflection essay - Mean: 15.65, Max: 16.7<br />Case analysis report - Mean: 16.42 ; Max: 19<br />Group project presentation - Mean: 11.72 ; Max: 12.3<br />Group project report - Mean: 15.52 ; Max: 17<br /><br />My scores:<br />Attendance - 5/5<br />Individual Participation - 9.08/20<br />Self-reflection essay - 16/20<br />Case analysis report - 18/20<br />Group project presentation - 12/15<br />Group project report - 15.6/20<br /><br />I got B+ at the end. As you can see, the range of marks is very narrow and it's very easy for you to screw up your scores.",
            "comment_workload": "Workload is average for a 2 credits course and you don't need to worry about any mid-terms or finals.<br /><br />For the two self-reflection essays, you need to bullshit 200 words. This wouldn't consume you too much time as I believe everyone is professional at bullshitting 😉<br /><br />For the case analysis report, you need to read 7 full pages of text about The Mills (南豐紗廠) and write a single page report. This can take you some time.<br /><br />For the group project, you need to choose one listed company in HK Stock Exchange and comments on the company's sustainability strategy. Each group has 5~6 members so your workload should be fine if there are no free-riders. You need to prepare a 10 minutes presentation (aka. bullshitting session) and then submit a final group written report (max. 7 pages).",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": [
                {
                    "key": "xYrixd7VoYqcC6r4sfR3Jhps2uy3YHuF",
                    "name": "MGMT2130 Syllabus (2021 Spring)",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "GYeHzWPxRPlLUwuzfMECjroQeOrOfsjT",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1268,
                    "name": "YOUNG, Mark",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "helloworld1234",
            "date": "Jan 04, 2023",
            "title": "Heavy workload",
            "comment_content": "The couse content focus on ESG and business moral. We can learn relationship between business, society, customers, employees and etc. However, I do not think the content is useful and feel like I have learnt nothing at the end of the semester.",
            "comment_teaching": "His pace is fair. However, his voice is too husky that it is difficult to catch his words. He always speaks very slow so I felt very sleepy during his lessons.",
            "comment_grading": "His grading is unreasonable. I have done the assignments and projects above mean. However, I just receive a C+ eventually. I still cannot understand his standard of grading",
            "comment_workload": "Heavy workload. It is only a 2-credit course but requires a lot of efforts made. There are two 0personal reflection, which we could choose one of the lecture topics and talk about our views. There is also a final business case analysis. We need to read the case in-depth and talk about whether the practice of the business is appropriate. The most demanding work of this course is the group project. We need to first choose a corporation and analyse if it is doing well on ESG. After the presentation, Mark Young would ask several challenging questions.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YBjxXJeJOjFquEg5WyUaUF7CuixMkHhY",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "K&K",
            "date": "Dec 24, 2020",
            "title": "",
            "comment_content": "very similar to MGMT2010, not much practical use but only theories. Some cases are interesting but online reading workload is huge",
            "comment_teaching": "We had online classes. Sometimes it's apparent that she's reading script (though her English is good enough). Feel like sleeping. Most of the class time is spent on endless discussion. Better learn multitask during classtime",
            "comment_grading": "Super bad grading. Take her class if you want a C range in your uni life.&nbsp;&nbsp;three quizzes, participation, group project video, discussion, role playing.<br />Though she counts participation, she randomly called students to answer, so it's quite unfair.",
            "comment_workload": "huge reading workload but overall it's fine",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vR3SaWDrs6kilxfG12PX5rsuvZ6W3E96",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 586,
                    "name": "CHAO, Melody Man Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "qq",
            "date": "Aug 20, 2015",
            "title": "Good instructor, good grade",
            "comment_content": "In terms of content, I found it quite similar to SBMT2010 as it was mainly based on ethics and being ethical. However it is less vague, and there are many instances where ethics is applied to real life situations and ourselves.",
            "comment_teaching": "Although it was a 9am lesson, most students were able to attend the classes on time. Melody made all the classes very interesting, she would make jokes and also engage all students. I had a lot of fun attending her lessons, and did not find waking up for 9am lessons difficult at all. Overall, the teaching was very good.",
            "comment_grading": "Your grade is mainly based on how much you participate in class. Melody marks down your name if you do speak up in class (as everyone has to put their name card on their desk every lesson). I think that it is crucial you attend all lessons as there are only 13 lessons and participation is HEAVILY depended on. <br /><br />There is also another essay and project which you have to do. The essay is a reflection journal on how you felt about the classes and what you learnt, which I don't think matters a lot to your grade as long as you hand it in on time. As for the project, I do think it is quite important and you must think on a deeper level to show that you have really put effort into the project. Also, most people made really professional presentations, so the presentation aspect is really important as well.",
            "comment_workload": "For those who rather do projects than take exams, you won't find that the workload is large. You would have to meet up a lot with your group mates to make sure that the project is completed. The project does require you to think deeply (not just on a superficial level), which I thought was quite good. <br /><br />But many of my classmates complained that for a 2 credit course the workload is too much (which I do agree to an extent)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dUSO15j23j9mOcNYf2clOhojlpBAbklg",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1622,
                    "name": "BROWN, Zachariah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Momo111",
            "date": "May 15, 2023",
            "title": "",
            "comment_content": "Toooo useless<br />I don't understand why we need to learn such a boring course in uni.<br />I just blame this course in ust rather than professor, I like the teaching style and interesting examples in lectures.",
            "comment_teaching": "Professor Brown is very dedicated and I like him so much.",
            "comment_grading": "Haven't shown yet<br />But one important thing is that the participation counts 20% of the grading scheme so every class was agonizing for me since I 'm an introvert.",
            "comment_workload": "Huge workload........... But it is only 2 credits......<br />Including weekly discussion comments, survey, class attendance, participation, group project, two written assignment....<br />It was just a waste of time because I can't learn anything from these assignments and project.",
            "rating_content": 1,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OVgdzyBmI5BqVcy1JwglemFeVZsySiwQ",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1268,
                    "name": "YOUNG, Mark",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Hmfhjffhj",
            "date": "Jan 27, 2023",
            "title": "",
            "comment_content": "lots of different case topics i guess<br />don't think I have learnt much useful stuff by the end tbh",
            "comment_teaching": "encourages students to express their opinions, creating healthy discourse <br />even still, the slow pace put me to sleep more than a few times",
            "comment_grading": "not great grading<br />vague and little feedback to reflections and report<br />most ppl end up getting similar scores for the small tasks...<br />sim game is pure gambling",
            "comment_workload": "quite heavy compared to the other prof<br />project includes presentation and report<br />also 2 discussions<br />also 2 reflections<br />a case report too<br />weekly readings too",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zURrAIDXnoZxwpryfuFIiYYwPNUgdHmt",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 586,
                    "name": "CHAO, Melody Man Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "holam",
            "date": "Dec 29, 2020",
            "title": "MGMT 2130",
            "comment_content": "I understand nothing in this course.",
            "comment_teaching": "I am not interested in listening.<br />But better than Mary",
            "comment_grading": "Class participation (15%)<br /><br />Basically, what I have done is to attend the first 10 min of 9am session and then copy down what people say for parti score. And then repeat again in 4pm session. Make sure you already copy down the zoom link of other sessions in the add drop period<br /><br />I speak around 6 times in the whole semester. Recap of last lesson is the easiest one that can be prepared.<br /><br />Classwork (15%)<br />Each lesson there are individual/group worksheet/survey to take your attendance <br />Make sure you submit them even if you skip the lesson. Friends are important!<br /><br />Role play (20%)<br />Role play 1: topic is en roads simulation<br />Grouping is same as group project<br />4 min presentation with only 30 min preparation<br />Hint: attend 9am class and then screen cap all the ppt<br />Then very easy and we can even pre-finish the ppt before class<br /><br />Role play 2: I basically free ride this one as I make no contribution, I guess it is about a case about garment factory?!<br />This time Melody is clever, and she made random grouping of 4-5 ppl, and there is 1 week for preparation<br /><br />Melody always said that it is not necessary to have everyone speak out in the presentation. I don't believe so please open your mouth and speak in class, even though I don't think of the idea nor do the ppt, I still strive at least 30 second for me to speak, to 9up(which is the most important element in MGMT)<br /><br />Group project (25%)<br />6-8 ppl to produce 10-15 min video<br />Just analyze a company/suggest some solution for existing problem<br />For my group, we simply do a ppt presentation recorded on zoom, so it is done with very minimal time and effort<br /><br />Self reflection (25%)<br />No one know what she wants......<br />At least I don't know<br /><br />None of the marks are provided.<br />Final letter grade: B+, at least better than Mary",
            "comment_workload": "Only one lecture per class<br />I basically eat/ only attend first 10 min for parti/ say sth in breakout room when Melody or TA appear<br />As long as you are not self chur, I think that is ok.<br /><br />Please pm me for the videos of the groups. I have downloaded all the videos offline<br /><br />There are groups which are chisin and they are producing videos in very high quality, that I got no idea why they would do that for 25% of 2 credit course. I would rather 9up in lesson instead.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "W8eZhPsvrcQDyhAWvyCZFyxexSK9CBh9",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 1165,
                    "name": "KIM, Yong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "avv",
            "date": "Jun 20, 2018",
            "title": "Chill course",
            "comment_content": "Its mainly about ethics concepts in specific business contexts unlike the previous Ethics course which seemed more high-level and philosophical. Its one of the few business classes that you *HAVE* to do in order to satisfy&nbsp;&nbsp;the SBM requirement",
            "comment_teaching": "The professor was arguably the sweetest prof ever in my 3 years at university. Nice, young, Korean guy with a beard (something not too common haha)<br /><br />He understands that students don't want to really do this course and he makes it as relaxed as possible so that students need to just put the bare minimum required to get through this course.",
            "comment_grading": "Grading is very good if you come to all classes and do all the PRS. And finding a good group definitely helps for the project as your workload would be cut by half and you can concentrate on your other courses.",
            "comment_workload": "I have heard in previous classes, the professor used to assign readings every week, but as I mentioned this prof had been very considerate and give us probably just 2 readings to do for the sake of a class activity. <br /><br />If you are confident in your writing skills and have good experiences writing reports and presentations, this class will be very easy",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "u3KdDKO5QVA2GB4hqxZwX3VfZnVdN2jx",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wmh",
            "date": "May 30, 2016",
            "title": "Absolute grading",
            "comment_content": "講下點做好CSR, decision making, environmental management...",
            "comment_teaching": "hea hea 地<br />得閒串下各大公司既csr做得幾唔好",
            "comment_grading": "mary姐用absoulte grading<br />90+&nbsp;&nbsp;A+<br />85-89 A<br />80-84 A-<br />76-79 B+<br />72-75 B...<br />我essay同role-play execrise (total 30%) A-<br />reflection essay (total 10%) A+<br />project (40%) B<br />participation 無出分<br />overall 得 B+<br />所以你想博a range 就唔好reg mary",
            "comment_workload": "reflection essay (500 words) x1<br />CSR news essay (1000 words) x1<br />1個csr project (5-6 人一組)<br />1堂1次prs voting<br />1個sem兩次role-play exercise",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bc60CT4vehROKQAurvnT0No4iyaFchg1",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1622,
                    "name": "BROWN, Zachariah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CrabNebula",
            "date": "Jun 07, 2023",
            "title": "RAGE for my grade",
            "comment_content": "Whatever",
            "comment_teaching": "He read comments on UST space. This was his first teaching in this course. The lesson was interactive and fun. <br />But there's NO fun in receiving a C-range grade. Because I only care about my grades in a MANAGEMENT course this review is dedicated to the grading section only.",
            "comment_grading": "First C+ and C range in my SBM studies (Y3). Because there is obviously no use to argue for grades all I can do is rant here and warn anyone who cares about their grades to reconsider his classes.<br /><br />Group project (group) 25 %<br />Attendance &amp; in-class participation 20 %<br />Professional Values Alignment (PVA) exercise 15 %<br />Computer simulation 10 %<br />Bi-weekly surveys 10 %<br />Personal reflection 10 %<br />Online forum discussion 10 %<br /><br />A hell for introverts? He read the comments here and tried to make it easier for students to answer his in-class questions (with 20% in class participation to make you more pressured ironically). There are 4 marks for every lesson, each time you answer a question he gives you a participation card. If you give a sh*t in answering you normally have a chance for ONE question per class (he picks who to answer). However, answering one question doesn't guarantee you a full score. They score you by how &quot;contributive&quot; your comment was to the class but you will never know how it works. Annoying and stressful.<br /><br />Online discussion section after each class on Canvas. They emphasised a lot on &quot;personal experience&quot; and claimed to not give scores otherwise. <br /><br />Everyone gets a similar score for the group project so it is meaningless. Similar for personal written assignments (pva exercise and reflection). <br /><br />Group project (group) - UNKNOWN MEAN<br />Attendance &amp; in-class participation 20 % - UNKNOWN MEAN<br />Professional Values Alignment (PVA) exercise 15 % - mean 12/15, my score 11.5/15<br />Computer simulation 10 % mean 8.6/10, my score 8.25/10<br />Bi-weekly surveys 10 % - UNKNOWN MEAN<br />Personal reflection 10 % - UNKNOWN MEAN<br />Online forum discussion 10 % - UNKNOWN MEAN<br /><br />AND I'M F*CKED. UNREASONABLE GRADING. I could never imagine getting a C+ in such a course.",
            "comment_workload": "Annoying discussion section on canvas that you have to leave a comment every single week. A group project that nobody gives a damn thing about, at least from what i heard.<br /><br />For 2 credits only.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3lIfzDtXJsXg6g2E6OgzexQ7xWM87WE9",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1648,
                    "name": "KOC, Joseph",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "shivangidey",
            "date": "Jan 26, 2023",
            "title": "Ethics with Joseph",
            "comment_content": "The content by Joseph was really good and he usually made it so that every class was engaging and had a lot of discussion. <br /><br />It is a morality based class, which makes it different than other business classes but keeps it very compelling for its students. <br /><br />Honestly, this class makes HKUST a fun university.",
            "comment_teaching": "Joseph is a phenomenal teacher, probably one of the best in all of HKUST. He really puts in effort in getting to know his students and is always accessible - even through email or office hours. <br /><br />He makes sure to listen to everyone's points and gives great insights into his own life and what it means to actually be a business student. <br /><br />Going into office hours and participating in class also makes you seem engaging to him which can also result in a higher participation score. It's all about the effort you make when you are in the class.",
            "comment_grading": "Very lenient grading. He is strict in making sure you are implementing class concepts in your essays or presentation, but that is mostly to make sure you don't BS your way into getting a grade. <br /><br />The class is very group based so it does make a difference who you are with because usually you don't get to choose. But once again, he is really fair and you can be honest if someone isn't carrying their weight.",
            "comment_workload": "The workload is usually just participation, but also includes a final presentation and final essay. Most of this is super manageable and he does a lot of check-ins to make sure you are good in your content.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QjRnZAk7Fp3YbsjLgEoKcQyHK8kC4BFk",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 598,
                    "name": "LI, Qiang",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Alice.C",
            "date": "Aug 24, 2021",
            "title": "Avoid if you can. such a shitty course that I don't even know why I need to take",
            "comment_content": "Content is so shit that I can't believe myself that I am paying tuition fee for a such a shitty course like this. Seriously I need a refund from UST. fml <br /><br />Basically this course looks into news articles on companies that had issues regarding CSR. <br /><br />Role of business in society<br />psychology of CSR<br />Business and employees<br />Business and customers<br />Business and suppliers<br />Business and communities <br />Business and natural environmental <br />strategy and innovation for sustainability <br />Implementing sustainability strategy",
            "comment_teaching": "His English is good but the class is really boring. Also when he asks questions to students, he never cut off and let students talk for 30-40 mins per question even though they are saying the same thing over and over again just to get participation marks.",
            "comment_grading": "So shit that nothing is clear <br /><br />Professor didn't even released the grade for any of the assessments until I emailed him on why I got such a shit grade. There isn't a single criteria for the grading structure and 0 comments on the assessments so I am assuming that professor just randomly assigned grades to students :) <br /><br />Attendance 5%<br />Individual participation 20%<br />Self-reflection essays 20%<br />Case analysis report 20%<br />Group project 35% <br /><br />Still mystery why I got B-",
            "comment_workload": "I don't know why it has so much work to do considering that it is only 2 credit course? I had to write reflections on the things I learned nothing about and bs the entire case analysis report. WHY WOULDN'T UST JUST GET RID OF THIS COURSE <br /><br />Luckily it does not have an exam thank god I didn't have to kill myself from studying and taking exam on this shit course",
            "rating_content": 1,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "X3yY29wx99u6zfq1SD14Z3IxInUYi9e0",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1622,
                    "name": "BROWN, Zachariah",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Ged",
            "date": "Aug 05, 2023",
            "title": "We have to take it as it is example of political correctness",
            "comment_content": "ESG and related stuff",
            "comment_teaching": "He tries to be interactive but in the end it became utilitarian because all questions you asked to him and all answers to his questions are pertinent with the grade.",
            "comment_grading": "Very bad. It is difficult to distinguish students as the final percentage grades are quite close. 0.5% means different things. And it is very possible to lose some marks as there are many weekly, even daily tasks, easy to forget.",
            "comment_workload": "Very High. 1. You need to write a review or comment on the discussion board every week in about 200 words. 2. There is also a so-called PVA Assignment which requires you to show, evaluate and defend your personal value. It is lengthy and annoyed as it will last ablut 4 weeks and you need to write an eassy, make a graph and discuss your personal value with a randomly assigned peer. Then in the end, he and the TA will give your marks judging on your personal value (How ironic as this is an ethics course, but they judge you purely according to your personal value). 3. A vexing group project: 15min presentation + essay 4. Weekly survey, you have to finish. Otherwise, points will be deducted.",
            "rating_content": 1,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FXK10AiGBLlhRXYcXPu6vTWHlPgRtYn3",
            "semester": "2022-23 Spring",
            "instructors": [],
            "is_author": false,
            "author": "whatttt",
            "date": "Aug 04, 2023",
            "title": "high workload for only 2-credits course",
            "comment_content": "Week 1 Introduction<br />Week 2 Role of Business in Society<br />Week 3 The Psychology of Corporate (Ir)responsibility<br />Week 4 Business and Employees<br />Week 5 Business and Customers<br />Week 6 Business and Suppliers<br />Week 7 Business and Communities<br />Week 8 Environment &amp; Business Models<br />Week 9 Holiday<br />Week 10 Simulation<br />Week 11 Guest Speaker (cancelled, and the topic became social style)<br />Week 12 Group Presentations<br />Week 13 Group Presentations",
            "comment_teaching": "Not bad, very interactive. Professor like asking questions, even give some extra readings to read before class for students to register, so that they can summarize or answer the extra questions for parti mark .",
            "comment_grading": "Bad grading and is too hard to judge, but i think asking more questions will help.",
            "comment_workload": "Very high workload!!! Quiz, survey, debate, discussion, many readings, many group works, presentation, even have some &quot;games&quot;, which also affect your grading. In conclusion, extremely high workload and not worth it!",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yhtnAUb4Uggl4CUHbOgcY0DYgPlAymgO",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 1165,
                    "name": "KIM, Yong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wyiLe",
            "date": "Aug 21, 2018",
            "title": "What did I learn?",
            "comment_content": "Corp Social Responisbility.. Taught us some tools to analyse reports, and draw connection diagrams, not sure how they are used. Even if we get to the work place, unless you will be the companies' nerd to do all these stuff, otherwise I want to say it's quite useless.",
            "comment_teaching": "He read our the slides, and that's about it. Gave us some readings, and nothing much.",
            "comment_grading": "There were a few components that made up the grade: <br />25% Class exercises, which requires you to use the tools he taught in class. Yoshikoda... etc. 25% is a lot, make sure you know how to use these, otherwise it will hinder your grade. <br />15% Class participation, you have to attend the class, sometimes he does attendance check via iprs, make sure you are there.. 15% is a lot, so if you miss any of those iprs, it will cost your grade.<br />20% individual assignment, so you will get 2 pieces of writing to do, both pitching the boss for a change. Not sure if that is the most useful thing.<br />25% Group project, this group project is quite annoying, first you will choose from the Sustainble Development Goals, then you will be given the company, and you will do something that relates the two. Very badly designed project in my opinion. <br />10% Individual Reflection on the group project, so you will be writing a reflection on what you learnt from doing the project. <br />5% Peer evaluation.<br /><br />there is also a project presentation, the score should be within the group project's 25%.",
            "comment_workload": "I think this course has too mcuh workload for a 2 credit course. Esp when the project is not that simple and easy to do.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MQ4NGPw6wi4OryCHsi6WseNQOLBbyaPo",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "1999",
            "date": "May 13, 2016",
            "title": "2-credit course with 4-credit workload....",
            "comment_content": "This intermediate business ethics course takes a discussion-based approach to examining ethical issues in a corporate context. This course focuses on the ethical issues related to the interaction between business and society. You will further develop your knowledge, moral reasoning skills, and attitudes towards social responsibility by considering the perspectives of various stakeholders. Corporate contexts sometimes involve ‘managerial mischief’ and ‘moral mazes’; thus having an awareness and sensitivity to Business Ethics can bring overall improvements. This highly interactive course will draw upon relevant current issues to help you understand (and overcome)<br />some of the real-world challenges that business executives confront. Ultimately, this course will encourage you to become positive, ethical influences in your own personal and professional lives.<br /><br />From my point of view, the content of this course is quite interesting as it explores us the complex business ethical issue nowadays which is useful to develop our &quot;water-blowing&quot; skills in future.",
            "comment_teaching": "The lecture flow:<br />1st: individual news sharing (everyone should present once)<br />2nd: turn off your mobile phone (a must steps)<br />3rd: group discussion on weekly reading material (randomly formed group)<br />4th: raise your group view/deep-sea question<br />5th: another pair discussion on some ethical decision topics<br />6th: group discussion/group work (according to your group)",
            "comment_grading": "(1)Participation (total 30%)<br />&nbsp;&nbsp;&nbsp;&nbsp;(1.1) including attendance (I attend all lessons)<br />&nbsp;&nbsp;&nbsp;&nbsp;(1.2) Online Discussion Forum (I do 12 discussions REGULARLY)<br />&nbsp;&nbsp;&nbsp;&nbsp;(1.3) in-class participation (nearly didn't participate at all)<br /><br />(2)Individual Analysis (total 30%)&nbsp;&nbsp;&nbsp;&nbsp;<br />&nbsp;&nbsp;&nbsp;&nbsp;(2.1)&nbsp;&nbsp;Business News Analysis: news on that month and your ethical views/implication (23/30)<br />&nbsp;&nbsp;&nbsp;&nbsp;(2.2)&nbsp;&nbsp;Integrated Test: quiz on assigned reading (didn't read at all, essay type, can bring the reading material)<br /><br />(3) Group Assignments(total 40%)<br />&nbsp;&nbsp;&nbsp;&nbsp;(3.1) Managing Corporate Ethics (Report): analysis on a designated company ethical performance (31/40)<br />&nbsp;&nbsp;&nbsp;&nbsp;(3.2) Ethical Issues in Business (Presentation): any nowadays ethical issue/controversy, just group presentation with ppt slide, no report is needed<br /><br /><br />Generally, it is out of my expectation that I got B+ finally,<br />I just do the discussion regularly(higher than the average).<br />I didn't raise questions or suggest any deep views at all and just chat with my friend.<br />I believe the reason why is that I got full attendance and I noticed that nearly 1/4 of people skip this lesson usually, but don't expect that you can find somebody to help you take the attendance, the TA would check the attendance sheet.",
            "comment_workload": "every week, Mark required you to read the assigned reading with several ten pages!! <br />Also, why is there an integrated task?<br />every week do discussion....",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": [
                {
                    "key": "3sbUsBzwlrnFvkok9GgLQYJKcHLt05gc",
                    "name": "MGMT2130 Syllabus-1",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "Z181TF4GzTIlHB98b20tQ2FNiW5jffQs",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ookami",
            "date": "Jan 22, 2016",
            "title": "",
            "comment_content": "都係果類business ethics 野<br />會有得出去Firm visit, 睇番人地點樣係fulfill個corporate social responsibility",
            "comment_teaching": "佢幾有心教, 同埋英文幾好聽, 上堂係幾開心",
            "comment_grading": "absolute grading<br />所以你做左幾多野, 答左幾多分就直接有咩grade",
            "comment_workload": "上堂幾hea, 會有兩個role play exercise<br />但mary姐好hea, 好輕鬆<br />要交兩份reflection, 但其實都係600-1000字寫番啲business ethics 同 project反思, 唔係話太難",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NxG3RacTnXCdV78BcVl4eGYM7tqiCYIr",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1622,
                    "name": "BROWN, Zachariah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "heyhihere",
            "date": "Aug 08, 2023",
            "title": "Good professor",
            "comment_content": "Sorry for making reference to the earlier review, but it's the same for all the sections he taught.<br /><br />Week 1 Introduction<br />Week 2 Role of Business in Society<br />Week 3 The Psychology of Corporate (Ir)responsibility<br />Week 4 Business and Employees<br />Week 5 Business and Customers<br />Week 6 Business and Suppliers<br />Week 7 Business and Communities<br />Week 8 Environment &amp; Business Models<br />Week 9 Holiday<br />Week 10 Simulation<br />Week 11 Guest Speaker (cancelled, and the topic became social style)<br />Week 12 Group Presentations<br />Week 13 Group Presentations",
            "comment_teaching": "Professor is friendly, responsive and humorous. He would ask questions in lecture and give priority to people who hasn't answer yet. He would respond to every answer given by students, even when those answers seems to be so weak and non-logical.<br /><br />I appreciate the way how he delivers the lecture content, and his passion in teaching. He makes every lecture fun and interactive.<br /><br />I know professor Brown would read the course comments on the forum, so I just want to express my gratitude again here (I have done so in SFQ already :D)",
            "comment_grading": "I think I am sort of biased in this section. For me, I would give an A for grading as I got a good consequence though I'm an ultimate introvert who can't even answer questions in full. <br /><br />However, I heard from my friend that the curve for this course is quite harsh as professor gave similar marks for group projects, so participation matters a lot. <br /><br />I don't know how much I got from participation, but I am not the kind of student who would answer multiple questions in a single lecture. Sometimes I would just answer 1, or not answering at all. <br /><br />Hence, I don't know how I got my letter grade, knowing that so many people got a C in the previous comments.<br /><br />I would recommend people who want to enjoy a fun lecture to take professor Brown's class.",
            "comment_workload": "Workload is quite heavy, as you can see from the ticks in the assessments / materials column. <br /><br />The workload for this course includes:<br /><br />Online survey (quizzes which test your understanding of course materials) for every 2 weeks. It takes around 5 minutes to finish.<br /><br />Assignment / essay - (PVA)<br />To structure a chart which shows your professional values and write a 800 words essay to elaborate how you prioritise your values.<br /><br />Weekly discussion<br />Just to elaborate some personal experience with the concepts taught in class. Read some comments before you post yours on the forum as you will see many overlapping content. Try not to repeat or just simply post your comments earlier.<br /><br />Group project<br />That's a disaster as no one cares about the project for a 2-cred course. Plus, the project scope is so difficult to handle. For my group, just a few people is willing to initiate the discussion for the group topic, group name, and the contents of the presentation and the report. Everyone deadline fight, working on the script a day (or even 3 hours) before presentation. <br />Try to keep the content concise as you have to cover all of them in 8 minutes ONLY. <br />And great thanks to those of my group mates who worked really hard and help amending the script &amp; powerpoint. Without them, I think our group can't even finish the project.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HecyOTCpbS4olZE4RCMAxr0W7laKGkfR",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 599,
                    "name": "GARG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ItsSmallG",
            "date": "Jul 03, 2023",
            "title": "Good grade course, highly recommended",
            "comment_content": "Introduction<br />Role of Business in Society<br />The Psychology of Corporate (Ir)responsibility<br />Business and Employees<br />Business and Customers<br />Business and Suppliers<br />Technology, Entrepreneurship &amp; Ethics<br />Strategy and Innovation for Sustainability<br />Implementing Sustainability Strategy –SIMULATION",
            "comment_teaching": "Interesting topics, professor will encourage the whole class to participate. The content of the notes are not hard to understand, most of them are talking about ethnics, very easy and blow water stuff.",
            "comment_grading": "In-class discussion – 20%<br />In-class individual participation – 10%<br />Online discussion – 15%<br />Group project – 35%<br />Self-reflection essays – 20%<br /><br />Basically if you attend all lessons and talks, raise hand for 2 - 3 times each lesson, you will have guaranteed full marks for discussion and participation.<br /><br />There are 3 online discussions, for each discussion reply for 4 -5 time, each time maybe 300 to 500 words then your fine.<br /><br />Self Reflection essay, just remember to link your personal experience or ideas that you want to talk about, with the things that he had talked about during class/ shown in lecture notes",
            "comment_workload": "Normal workload.<br /><br />There are pre readings before each lecture, high recommend to read it so that you can have something to talk about during the discussion in lectures. <br /><br />Online Discussion happen each 2 weeks, you have plenty of time to reply to other people's comment<br /><br />Self reflection essay is easy, you only need to write one page of reflection.<br /><br />The final group project only require your group to hand in a&nbsp;&nbsp;10 min video presentation or a 7 page report, tbh it is very easy for a group of 7 to do.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qAm57LUE3xWvo2BqWt2rXIn6Vme5uJhE",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1622,
                    "name": "BROWN, Zachariah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "blessme",
            "date": "Jun 07, 2023",
            "title": "",
            "comment_content": "This intermediate business ethics course addresses issues of responsible decision-making at<br />the business and organizational level. It uses a stakeholder management perspective to<br />understand how firms do and should behave in the economic environments in which they<br />operate. The key purposes of this course are twofold. The first is to equip students with a set<br />of analytical tools to better understand complex ethical and social issues confronting business<br />leaders today. The second purpose is to encourage students to understand their own role in<br />the business ecosystem, as customers, employees, community members, and future leaders.<br />The learning specific objectives for this course seek to address multiple questions.<br />1. What is the responsibility of a for-profit firm in society?<br />2. What social and moral responsibilities do organizations have across stakeholder<br />groups?<br />3. How can a business approach tradeoffs between profit and purpose?<br />4. How do values (those of the organization, its employees, and the greater society)<br />influence firm decisions and behavior?<br />The course is structured mainly as a discussion seminar. There will be some lectures and<br />videos, but mostly we explore and challenge our ethical reasoning through dialogues with<br />each other and by participating in experiential exercises.",
            "comment_teaching": "He is a great professor, very talkative and interactive teaching. He will challenge you when you answer questions during class, it's really hell for introvert. He is nice and passionate.",
            "comment_grading": "You can get a good grade if you have good groupmates (randomly assigned) and answer question every lesson. If you aim A+, you should read all optional cases and get full participation marks but the workload is very high.<br /><br />Group project (group) 25 %<br />Attendance &amp; in-class participation 20 %<br />Professional Values Alignment (PVA) exercise 15 %<br />Computer simulation 10 %<br />Bi-weekly surveys 10 %<br />Personal reflection 10 %<br />Online forum discussion 10 %<br />Total 100 %",
            "comment_workload": "Very high. Not acceptable for only 2-credits.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rgsPrwARA6vkmH6KxTCVoiVpXxX4fU7D",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1648,
                    "name": "KOC, Joseph",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tbc...",
            "date": "Jun 07, 2023",
            "title": "Almost no workload, happy teaching but bad grading",
            "comment_content": "As others mentioned.<br />无非是那些道德难题，裁员啊，城市发展vs公司发展啊，还有一些环保的议题。 project主要是帮case company figure out how to apply their solution to HKUST.说实话有点不知道干嘛的, 最坏的是没法自己组队，第一堂就给你random分好了",
            "comment_teaching": "Mainly group discussion about some tough ethical problems, and class participation, then is ppt reading.<br />Joseph is quite interesting person. The atmosphere is quiet nice during the lessons.<br />一般是先讨论今天的topic，然后一组组present，之后就是他说他的想法然后教书",
            "comment_grading": "Actually I don't know who grade our project. Is the representatives of the case company and the people from the sustainability department of HKUST, or Joseph. <br />Everyone saying the grading is lenient but I don't think so Imao. Maybe they don't like our group's idea. But you know management course is kind of a myth.",
            "comment_workload": "very little. A short essay, attendance and a group project.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "j7WpQRaYKgjev0ycczVpr70HtrkgCl8p",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1268,
                    "name": "YOUNG, Mark",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kkkkkkkkkkk",
            "date": "Jun 05, 2023",
            "title": "Kind professor with less workload",
            "comment_content": "The course covers ESG topics including environment, goverenance and social. For instance, it talks about the environmental impact that the industry makes, how the company do greenwashing and how should government do to prohibit greenwashing actions.",
            "comment_teaching": "Mark is a very kind professor. He speaks clearly and organized his points and ideas well. He is good at engaging the whole class that he always walk around the classroom to listen to everyone's ideas. He usually give out participation card to those who answered his questions once. Hence, it wont be a problem even if you are a introvert as your participation will be rewarded equally if you can answer once per lesson. Mark's kindness will make you relax and help you voice out your ideas better that he may help you to summarize your ideas.<br /><br />Mark works hard to enlarge our horizon that he tries his best to bring in many ESG experts to our class to have talk and lecture which is quite interesting.",
            "comment_grading": "The grading is good. I got above mean in the assignment and group projec and answer 1 question per lesson and end up with an A range.",
            "comment_workload": "The workload is reduced this semseter as Mark as read the past comments and decided to give much shorter reading for us (from 10-20 pages down to 4-5 pages). Also, he even didnt assign any readings in the lesson before Easter as easter present to lower our workload. Thank you so much Mark. Only 1 refelction and discussion in the whole semseter which is much less than other professor's class which may even require weekly discussion. Group project Essay and presentation should be reasonable workload as long as your teamate works with you well.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ewvUxmIdNUzBcphXcjsFpCN27NsOwpdY",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1648,
                    "name": "KOC, Joseph",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Enrico",
            "date": "May 26, 2023",
            "title": "",
            "comment_content": "-Ethics and morals<br />- Social responsibility and stakeholder theory<br />-Innovations and entrepreneurialism<br />-Knowledge management<br />-Circular economy<br />-Responsibility to employees<br />-responsibility to customers",
            "comment_teaching": "Mostly discussion in the first 15-20 minutes of class and he presents for most of the class. Does not force you to talk to class but is very good to talk if you want grades.",
            "comment_grading": "gives fair grades for the writing as he only looks for the content and not the writing (grammar, spelling, etc.)",
            "comment_workload": "Not much work load. Just need to do some writing, report and presentation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QfwLESsvku9QKCz2zFgRFNYwkns3z4ab",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 599,
                    "name": "GARG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ektz23",
            "date": "Jan 26, 2023",
            "title": "",
            "comment_content": "基本上唔聽都會識。<br />• Introduction: What, Why, How<br />• Macro: Role of Business in Society<br />• Micro: Psychology of Corporate (Ir)responsibility<br />• Business and Employees<br />• Business and Customers<br />• Business and Suppliers<br />• [SPEAKER]<br />• Technology, Entrepreneurship &amp; Ethics<br />• Strategy and Innovation for Sustainability<br />• Implementing Sustainability Strategy [SIMULATION]",
            "comment_teaching": "上堂就吹下水，多d答問題搶parti分就得。 （不過我就無，所以parti應該好低）",
            "comment_grading": "15% Online discussion: 15/15（Mean: 12.00）<br />35% Group Project: 31/35 (Mean: 29.77）<br />20% Two Essay: 16/20（Mean: 16.02）<br />10% Participation: ?/10 (Grade not release)<br />20% In-class discussion: ?/20 (Grade not release)<br /><br />Grade: B+",
            "comment_workload": "好少，得個5-6人嘅group project，仲唔駛presentation，其他如essay，discussion都無咩要求，discussion打多d字用字數取勝就可以，essay有兩份，各自400-500字，對topic寫就ok（例如叫你用personal experience記得用就得）<br /><br />我聽其他section好多野搞，Sam真好有良心。<br /><br />hea 讀+ free-style都B+算系咁。",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vjQ6hOiRLLgTUa6nkQBwvRGboT9BeiXS",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 599,
                    "name": "GARG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Harrying",
            "date": "Jan 05, 2023",
            "title": "Good Grade af",
            "comment_content": "Foundations<br />• Introduction: What, Why, How<br />• Macro: Role of Business in Society<br />• Micro: Psychology of Corporate (Ir)responsibility<br />Stakeholders<br />• Business and Employees<br />• Business and Customers<br />• Business and Suppliers<br />• [SPEAKER]<br />Strategies<br />• Technology, Entrepreneurship &amp; Ethics<br />• Strategy and Innovation for Sustainability<br />• Implementing Sustainability Strategy [SIMULATION]",
            "comment_teaching": "Professor is really nice. He likes to guide us through some moral dilemmas and gives us solid insights on what we should do in a particular scenario.<br /><br />Professor is willing to take comments anytime, so voice up if you have anything to the course or to him.<br /><br />Sadly, professor said he will be leaving HKUST for now :(",
            "comment_grading": "In-class discussion – 20%<br />In-class individual participation – 10% (Attendance)<br />Online discussion – 15%<br />Group project – 35%<br />Self-reflection essays – 20% (10% for each)<br /><br />For me:<br />in-class discussion: (not disclosed)<br />In-class individual participation:( Not disclosed) I guess I get full as this corresponds to attendance<br />Online discussion: 15/15<br />Grp Project: 34/35 (High)<br />Self-reflection essays - 16/20<br />Overall: A+",
            "comment_workload": "Discussions, Parti can be quite bothersome sometimes.<br />Also, the required reading is mandatory but it's very lengthy. <br />Other than that, the grp prj is comprised of a group of 6 to 7 ppl. It wouldn't be a problem.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MmUkNUEadOdrHQQUHZgRxkSKaLAq7I1b",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Virginia117117",
            "date": "Aug 22, 2022",
            "title": "",
            "comment_content": "He encourages students to participate in class and express their opinion. He will challenge students and let them think deeply. But I sometimes do find it overwhelming and a bit hard to understand the way he delivers the class content and challenges your viewpoints.<br />He also invites many guest speakers to talk about a topic related to the content covered in class. Appreciate such effort to enrich the content.",
            "comment_teaching": "Feel like sleeping. Most of the class time is spent on endless discussion.Better learn multitask during class time.",
            "comment_grading": "Your grade is mostly based on the extent to which you participate in class. I think that it is essential you attend all lessons as there are only 13 lessons and participation is heavily depended on it. There is also another essay and project which you have to do. The essay is a reflection journal on how you felt about the classes and what you learned, which I don't think matters a lot to your grade as long as you hand it in on time. As for the project, I do think it is quite important and you must think on a deeper level to show that you have really put effort into the project. In addition, most people made very professional presentations, which makes the presentation aspect very important as well.",
            "comment_workload": "Extremely heavy workload.<br />Don't be misled by the fact that this course has no exams.<br />You have to meet your group mates very often.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cIEJXwYstOvdmtVkKQrcdoxX8jK6rsgf",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ahnaaf",
            "date": "Dec 17, 2021",
            "title": "",
            "comment_content": "Same as you'd expect in most ethics courses, saving the corporate world and environment at the same time. It's stuff you already know but just some fancy names to it.",
            "comment_teaching": "He's honestly good, but sometimes it's a little redundant. Basically participating twice a class with something interesting should be fine. After that, you can pretty much just do your own thing on your laptop/iPad. I just catch up on Youtube or music.",
            "comment_grading": "I only received feedback for the written report. My final grade was a B+ which to me is fine cause I think I deserved that. He pretty much is a fair grader cause I don't think I did that well.",
            "comment_workload": "A little heavy: <br />1) Group written report<br />2) Group Presentation<br />3) Essay Final<br />4) Weekly Readings<br />5) Attendance<br /><br />For a 2 credit course it's a bit much but who cares, its required.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "k0dSyuiz6Si8eb7WUXKgsvs9dvi9rMYZ",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 599,
                    "name": "GARG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "waiyo",
            "date": "Jun 30, 2021",
            "title": "",
            "comment_content": "Boring...<br />Can stop listening to the professor coz content is not important for this course.",
            "comment_teaching": "Teaching is not very important for this course. Try to choose a better professor who will provide you with a good grade.",
            "comment_grading": "Really depends on your project and teammates.<br />Me and my friend had a very similar marks except group project. I got 30 marks in my group project and my friend is 36 marks. My friend got a B grade but I'm C grade. So 6 marks is a two grade difference.",
            "comment_workload": "No exam but both group and individual project + participation marks. It is not a heavy workload.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "19T0f1qQOznkJgK3EOL6hjWj95Z04lse",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 586,
                    "name": "CHAO, Melody Man Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "llllllll123",
            "date": "Feb 01, 2021",
            "title": "Not recommended",
            "comment_content": "I don't know what did I learn at all, just talk about social responsibility and sustainability from the aspects of different stakeholders. The prof gives us some scenario and we have to discuss with our groupmate and then respond it during class",
            "comment_teaching": "The prof likes interacting with students. She raises a lot of questions during class and people respond to her. She sometimes plays the video and role play for better demonstration",
            "comment_grading": "Class Exercise (15%) , Class Discussion / Participation (15%), Role-play exercise (20%), Group Project (25%), Term Paper (25%)<br />Class exercises are usually on group basis, have some discussion in class and jot down the notes in the worksheet. Class Participation is counted on responsiveness to class, it is an important indicator to differentiate your grade. The prof marks down the name for whose who responds to the questions<br />Role-play exercises are on group basis, each group will act different stakeholders are make a final decision for a scenario. A short presentation is needed<br />Group Project is randomly assigned by the prof, choose the topic by yourself. No report is needed but creative presentation video is preferred&nbsp;&nbsp;&nbsp;&nbsp;<br />Term Paper is about personal reflection and write some reviews to observe the presentation video assigned group <br /><br />No grade is released for every assessment and the grade for me is bad. The grade is not linked with the efforts you put.",
            "comment_workload": "As a 2 credits course, the course work is not heavy but you have to spend most of your efforts on group project to become outstanding. Some preparation is needed for the role play exercises. As it has no mid-term and exams, I would say the workload is fair",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4SBaCS1RONMtrghrp5bYVNHjQEjXhlpJ",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1165,
                    "name": "KIM, Yong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "科大學生",
            "date": "Jan 21, 2021",
            "title": "Nice professor and easy course",
            "comment_content": "The content of this course is all about CSR. The concept is easy to understand and is not hard to remember.",
            "comment_teaching": "His teaching is quite interesting, he used a lot of real-life examples and videos. He also has some discussion time in class.",
            "comment_grading": "The mean of the course is super high. I scored about 93-95 (I forgot the exact score) and still only got a B+. Most people get a full or nearly full score in video reflection and simulation exercises. The quiz would be important. He counts the best 3 out of the 4 quizzes while the mean is still high. But overall, I think it is easy to achieve a good grade if you put some effort on it.",
            "comment_workload": "The workload is super light. Only revise one day before the quiz is fine since almost all of the questions are exactly from his classes. The hardest part would probably be the video reflection. You are required to record a 6-7 min video reflection on the simulation exercise. There are also in-class simulation exercises but not much preparation is needed for that.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zsaidqM3gem4TyHWgGaWBhXFZuUAv18N",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 586,
                    "name": "CHAO, Melody Man Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LALA8310",
            "date": "Jan 12, 2021",
            "title": "",
            "comment_content": "basic principles of ethical decision-making and stakeholder management<br />ethical dilemmas in business<br />solutions to business challenges involving social responsibility<br />the importance of responsible decision-making in society<br />an entrepreneurial mindset for performing corporate social responsibilities",
            "comment_teaching": "clear accent<br />will ask students to answer, and she will mark down those who answered and will give party score to them. so try your best to answer as much question as you can<br /><br />she will reply email timely, and she is always welcome questions and she is happy to have a zoom meeting if we have any problems",
            "comment_grading": "Class Exercises-------------15%<br />Class Discussion/Participation -------------15%<br />Role-play Exercises------------- 20%<br />Group Project -------------25%<br />Term Paper -------------25%<br /><br />i answered 5-6 questions in total<br />and the scores are not disclosed, so you have to guess your performance.",
            "comment_workload": "group formation assigned randomly, unfortunately, there are free riders in my group. I think if you are lucky enough to get a good group, the workload would be less<br /><br />2-role play exercises<br />1 group presentation<br />final refection<br />class exercises are just answering some questions she pointed out in class and submit it immediately, not really difficult",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FH1a69SeK8Afryjl5SoAV3iAkMxNJH6h",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1165,
                    "name": "KIM, Yong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "skrskrskr",
            "date": "Jan 08, 2021",
            "title": "Light workload and good grade if the professor is Kim",
            "comment_content": "Course content is not important as you won't remember after you finished the course. CSR is the core of the course but I don't think it's useful, you gonna hear this word each class for hundreds of time.",
            "comment_teaching": "He is a nice professor but very unclear presentation. I didn't really understand what was he talking about. Moreover, the instruction for the presentation was pretty obscure, I was once mad when I did it. Therefore, I skipped all the lectures after I got the participation, except for the classes which have quizzes. In the Strategic CSR Simulation, I skipped every class because his noise was very annoying that I couldn't focus on the simulation decisions, be noted that you can do it before class.<br /><br />I attended the last class, he said a few touching words. He is a person who got very high GPA during his college but he said he didn't remember anything. Many things in university are useless even you got a good grade, it's more important to search for the meaning of life.",
            "comment_grading": "Grading is good, he maximizes the A ranges and B ranges in the course. 25% A range he gave.<br /><br />Quiz: 34.5/37.5<br />Presentation: 15/15<br />Simulation: 46/46<br />Participation: 1.5/1.5<br /><br />Final grade: 97% A<br /><br />95% is B+, 98% is A+. The course is highly competitive, one MC one sub-grade. If I got one more MC then A+ but probably B+ if one more mistake. The mean is useless (around 10 for each quiz and 13.5 for the presentation)&nbsp;&nbsp;because if you got all the things in mean you probably can only get B at most. Therefore if you aim at good grades, aim full marks and don't look at the mean. The participation and simulation is full-mark guaranteed if you did it normally, to differentiate is the quizzes and presentation. If you can score full mark in 3 quizzes out out of 4, it will be easy for you to get an A+ even your presentation is not perfect.",
            "comment_workload": "Frankly speaking no workload, just finish all the instructions in the course. The simulations are easy, do it with friends and submit the debrief form to get full marks; Answer any question to get full mark in participation. The presentation is the only workload but if you are serious you will get full mark too. The quizzes are easy to score full marks, don't put too much effort, put more in other courses.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9UR0bygqeWOFx7SI1jkBoltZOAgrJG8G",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1165,
                    "name": "KIM, Yong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bn_sj2013",
            "date": "Jan 07, 2021",
            "title": "Not as good grade as expected",
            "comment_content": "Very simple content about Strategic CSR (Corporate social responsibility)<br /><br />This course is fun as we have to participate in 2 different simulations in class. Just like online games which require you to make decisions for the firm. Be careful of the deadlines as you can score full mark once you completed the task before the due date. DO NOT MISS anything as 1 mark = 1% and this course is HIGHLY COMPETITIVE.",
            "comment_teaching": "He is a really funny and nice prof, always play k-pop songs during the break time.<br />Highly suggest you to join every lecture as his ppt slides are really blank. You have to fill in a lot of information he mentioned in class in order to score higher in the quizzes. You will have to answer at least 1 question to get the 1.5% participation.",
            "comment_grading": "I scored 95%/100% in the whole course and got B+ only. According to other students in another UST forum, 95% is B+, 97% is A. This means 1 mark = 1% = 1 subgrade!!!<br /><br />The quizzes include MC and short-questions, only 15 mins each. Very simple but also tricky in some ways, thus the mean is high.<br /><br />In the Strategic CSR simulation, please try your best to reach 1000 marks to get 1.5 bonus mark (which means 1.5%), and 1100 marks to get another 1.5%.<br /><br />Video Reflection is important too and the mean is really high (13.5/15),&nbsp;&nbsp;you have to film a presentation of yourself reflecting on what you have learned in the CSR simulation.",
            "comment_workload": "Quiz x4 , best 3 out of 4 (37.5%, 12.5% each)<br />Change management simulation (19%)<br />Strategic CSR simulation (27%)<br />Video reflection (15%)<br />Class Participation (1.5%)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iOeJkx9PSbrkMbXuQFN0vbtryCqKQLb7",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "eunicelavigne",
            "date": "Jun 08, 2020",
            "title": "teaching is fine but grading is bad",
            "comment_content": "two main concept<br />CSR<br />CSV<br />different ethical decision making model<br /><br />This intermediate business ethics course takes a discussion-based approach to develop one’s ethical knowledge, moral reasoning skills, and attitudes towards social responsibility. It is a highly interactive course that draws upon relevant current issues to help students understand the real-world challenges that business executives confront. Ultimately, this course will encourage students to become positive, ethical influences in their own personal and professional lives.",
            "comment_teaching": "every lesson will have class discussion <br />Mary has explained the concepts with different real life examples<br />there are 2 role-play exercise during class",
            "comment_grading": "very bad grading <br />got C when most of my assignments are slightly below mean",
            "comment_workload": "a bit heavy <br />you have to read article before every classes and the documents are usually lengthy<br />2 individual assignment, which is the reflection after reading the document have to be submitted before class. (require in-depth explanation and cannot just copy the information)<br />news article sharing every week (you have to do the sharing once but you have to respond others sharing every week)<br />project (guiding is inadequate)",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WRbaoQ9tcP01Xsao8d7oLfMRC0SKI0dM",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DA",
            "date": "May 21, 2020",
            "title": "",
            "comment_content": "teaching --&gt;discussion--&gt;people answer questions <br />This is how she manage the class",
            "comment_teaching": "Nothing special, just like most of the MGMT course<br />Encourage student to answer her questions in class",
            "comment_grading": "not yet released but seems shd be fair?<br />most of us get around 8 marks in individual assignment",
            "comment_workload": "discussion in canvas+15 mins presentation+ attendance&amp;participation in class+news sharing+ individual assignment+role play<br /><br />Not really huge workload and it is manageable but if u want to be chur, u can be more active in class to earn some participation point (i guess).",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WVIBN5g0za3CsfZpxtyPKaplMqgvMNQT",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 590,
                    "name": "HE, Jinyu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Water",
            "date": "Feb 26, 2020",
            "title": "Easy and chill course",
            "comment_content": "easy and understandable topics and concepts, somehow useful.<br /><br />1 Introduction<br />2 Role of Business in Society<br />3 The Psychology of Corporate (Ir)responsibility <br />4 Business and Employees<br />5 Business and Customers<br />6 Business and Suppliers<br />7 Business and Communities<br />8 Business and the Natural Environment <br />9 Strategy and Innovation for Sustainability",
            "comment_teaching": "Jinyu is a nice professor with excellent pronunciation. Most people will be willing to attend lessons and listen to him. (as attendance is counted as well:))",
            "comment_grading": "super easy to go for B range, speak more may be able to get A range.<br /><br />(a) In-class discussion 20% <br />(b) Individual participation 20% <br />(c) Group project 30% <br />(d) Case analysis report 10% <br />(e) Self-reflection essays 20%",
            "comment_workload": "just speak more in the class (answering the professor) and participate actively in the participation will be OK. So light workload, just need to type 3 short essays and finish the group project.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TIAdN4BzOX7IudGyLqNWhkfUUku0B4fI",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kabul",
            "date": "May 24, 2019",
            "title": "Teaching is nice but the grading is so unpredictable.",
            "comment_content": "Really good content. Nowadays a lot of companies keep bragging about CSR, but is it really CSR, or is it just public relation tools? The course will take a look at how real companies handle CSR issues such as long-term corporate strategies, handling corporate scandals, ethical decision making, etc. You also get to know the dark side of the story - how CSR was initially taken in a shallow approach, and how companies like Link REIT can bullsh!t and brag about 'Shared Value'. Overall a really good course that will stimulate our thinking. <br /><br />I don't know why some students think ethics courses are useless. Believe me - you'll be shocked at how many students don't even know it's illegal for a ship captain not to exercise prudent seamanship. I think every one of us should treat this course seriously - professionalism is one of the key aspects companies value a lot. Don't take a very ignorant view on professionalism. <br /><br />1️⃣ Introduction to Business Ethics<br />2️⃣ CSR Evolution<br />3️⃣ Ethical Decision-Making and Leadership<br />4️⃣ Reinventing CSR for the 21st Century<br />5️⃣ Business and Sustainable Development<br />6️⃣ Creating Shared Value",
            "comment_teaching": "Not sure why a lot of reviews here criticized on Mary's teaching. I personally love her teaching a lot.<br /><br />✅ She will engage you to go further than the trivial part of CSR merely &quot;being benevolent&quot; and &quot;donations&quot; - she'll strangle your neck if you do so, seriously.<br /><br />✅ She loves challenging your thinking - when arriving at a solution she will have you think about the effect on different stakeholders and how we should address their concerns.<br /><br />✅ I really like her role-play exercises. This is when we could actually get to understand different peoples concerns and stand from a stakeholder's perspective to think through the issue.<br /><br />Overall her teaching is insightful, and full of fun.",
            "comment_grading": "The bad thing is that her grading is highly unpredictable. Quite a few course components like the project and the individual assignments require us to kinda &quot;guess&quot; what she's looking for. I screwed up cuz I didn't figure out what she was expecting. <br /><br />💬 20% In-class Participation<br />💬 20% 2 Role-play Exercises<br />✏️ 20% 2 Individual Assignments<br />💬 30% Group Project<br />✏️ 10% Personal Reflection on Group Project<br /><br />I got mean in role-play exercises, above mean in individual assignments, below mean in the group project and personal reflection. Participation marks unknown. <br /><br />Final grade: B+. I fucked up.<br />The group project is really important.",
            "comment_workload": "Quite heavy for a 2-credit course. Assigned readings of tens of pages every week, in-class participation, group project with a 20-min presentation, individual assignments...",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bCLcKgIRou5r97U9nlrGe9y2e6PcGRGm",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 590,
                    "name": "HE, Jinyu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Micchi",
            "date": "Aug 20, 2018",
            "title": "",
            "comment_content": "Overall, the teaching is fun and interactive, while there isn't much workload compared to other instructor's classes. Professor He is very nice, always being helpful and cheerful. He welcomes any questions from each of us, and also welcomes for discussions for any topics.",
            "comment_teaching": "The style of Professor He is kinda laid back. It consisted of group discussions and class activities, as well as videos. Overall, it is very interactive, and groups are formed randomly each time, adding to more dynamics into the class. Occasionally, the professor would play some inspirational TED talks or other interesting videos related to the teaching.",
            "comment_grading": "Grading is lenient. Class participation is important, and there is also the forum part, which requires several comments each week. For the self reflection, make sure to write within the word limit and be precise with the content, as professor He told us that the purpose of such short reflection shows the importance of clear and concise expression. Less could be more.",
            "comment_workload": "Workload is minimal, apart from the regular forum replies and 127-word self reflections. Throughout the course, you have to come up with a business ethics issue and do a presentation as well as write a paper about it.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "52OCl77GhniJ7JbisnlBRg2fni6wzI4d",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 590,
                    "name": "HE, Jinyu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nathan CC",
            "date": "Jun 01, 2018",
            "title": "One of the most inspiring course I have ever registered",
            "comment_content": "I personally think there are 4 types of course in school.<br />1. Good grade course with inspiring content<br />1. Good grade course with useless content<br />1. Bad grade course with inspiring content<br />1. Bad grade course with useless content<br /><br />Jinyu's course is definitely belong to the first category. I can still remember some businesses he introduced in class such as patagonia.",
            "comment_teaching": "High quality teaching in my opinion. This is a very fun and interactive course which I would recommend to everyone. He sometimes played interesting psycho games with us which are inspiring.",
            "comment_grading": "Very good grade. As long as you answer questions in class, you will get A range I think. My project was below mean but I answered questions from time to time. Grade: A-. <br />PS: Don't reg Mary btw! OMEGALUL",
            "comment_workload": "Workload is way less than Mary if I am not mistaken. Just a few 150- words reflections which everyone can easily get full marks and a project which are quite easy and not time-consuming.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Emv86UEJ2GrYITgkwfhklqLP1ORnC4R1",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 590,
                    "name": "HE, Jinyu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "pmleeaa",
            "date": "Jan 30, 2018",
            "title": "",
            "comment_content": "The content is mostly about business ethnic which is somehow very common. The topic between different tutors can be very different. <br /><br />The content is easy for most business students.",
            "comment_teaching": "Prof He will always show a video in class. They can be some TED talk, or some cute clips from youtube. <br />After the video, he will talk about the content.<br />In every lesson, students have to form groups with random classmate&nbsp;&nbsp;and discuss on the topic.&nbsp;&nbsp;<br /><br />It is always relaxing to have prof He lesson.",
            "comment_grading": "The grading is not very good and not very bad. <br /><br />It relies heavily on the group project.<br />Some parts will go to the reflection.<br /><br />Attendance is needed for this course.",
            "comment_workload": "3 reflection among the semester <br />and a big project with 5 people in a group.<br /><br />no quiz and final",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "S2O4Cv5IBJYVHs42Hl1OrlR0kG7murE5",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 586,
                    "name": "CHAO, Melody Man Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "swaggerjaggerry",
            "date": "Jan 02, 2018",
            "title": "EZ",
            "comment_content": "Introduction<br />Business' role and responsibilities in society<br />Investors<br />Employees<br />Customers<br />Partners or Competitors<br />Community and Government<br /><br />Extension of MGMT2010<br />Easy common sense",
            "comment_teaching": "She'll write ur name if u speak up so just say something in class so u get participation points<br /><br />Many group discussions, and she'll ask a person in ur group to share to the class on the outcomes of ur discussion<br /><br />It's important to attend her classes so please dont take her 9am classes",
            "comment_grading": "No stats given ????<br /><br />I got a v good grade but idk why so just make sure to come to all classes, participate in class, write plenty in the logbook, do okay in the presentations, write a good essay, etc",
            "comment_workload": "Class Exercises 25% <br />Class Discussion/Participation 20% <br />Personal Reflection Paper 25% <br />Group Project 25% <br />Peer Evaluation 5%<br /><br />COME TO HER CLASSES there's<br />- iprs<br />- graded in class contributions<br />- my discussion logbook (like a diary for u to write ur thoughts on the class, which is handed over at the end of the sem)<br />- group project (no report) 5-8 members, 25 min presentation + 5 min Q&amp;A, plenty of time to prepare so should be manageable<br />- come to all presentation days (there's attendance)<br />- ask questions during the presentations Q&amp;A to get a participation card<br />- personal reflection paper (a freestyle short essay)<br /><br />Super light workload tbh<br />No studying required at all so be sure to do well in the stuffs",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wBMIUHdpe7sx8NYLf3Q0us0wm3OGdGw0",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cysummm",
            "date": "May 30, 2017",
            "title": "",
            "comment_content": "There are few main topics:<br />• Introduction to Business Ethics and Social Responsibility<br />• CSR 1.0 – 3.0<br />• Ethical decision-making and leadership<br />They are all very easy to understand",
            "comment_teaching": "The overall teaching of Mary is okay. She is HongKongese but for most of the time in class/ consultation she will speak in Cantonese. She will kindly answer your question in Cantonese if you insist in using that. <br />She will ask question about the video/ case shown in class in order to initiate the class discussion. She will go into different groups and ask about our thoughts during the discussion. She will guide you to different directions to think deeper. Yet, somehow the class is quite boring hea. Most of us would be playing our laptop.",
            "comment_grading": "The grading is fair. The component with highest weighting and effect on grading is group project because the variance of marks in components other than group project is pretty small.<br /> <br />There are 6 grading components,<br />• In-class participation (should be small marks variance): 15<br />• Role-play exercise (small marks variance): 15<br />• Individual essay (large marks variance):&nbsp;&nbsp;20<br />• Group Project (should be large marks variance): 30<br />• Peer Review on Group Project (small marks variance): 10<br />• Personal Reflection on Group Project (small marks variance): 10<br /><br />The in-class participation will counted from both prs questions and parti card after u answer questions.<br /><br />Please note that there will be a presentation for the group project within the first half of the semester BUT this presentation WILL NOT be GRADED. This presentation is for the peer review on group project. In this peer review, your group needs to write a page and give comments on other group’s presentation. So that other groups can fine tune their project later.",
            "comment_workload": "Only 1 2-hour lesson per week. There are pre-class readings every week but somehow attending class without reading them is fine. The workload during class is very hing sung and most of time is just hea during class.<br /><br />Regarding this is 2-cred course, I think the workload from project is a bit heavy.&nbsp;&nbsp;The most challenging part of the course is the group project; lots of time will be used for reading companies’ CSR report and G4 guidelines.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FdfUp6W2l933SZlQ1eRSrxX7CeEZFBHw",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 590,
                    "name": "HE, Jinyu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Arange",
            "date": "Jan 27, 2017",
            "title": "",
            "comment_content": "Business core course for SBM. <br />Ch1 Role of Business in Society<br />Ch2 Human Psychology and Corporate Irresponsibility<br />Ch3 Business and Employees<br />Ch4 Business and Customers<br />Ch5 Business and Suppliers<br />Ch6 Business and Competitors<br />Ch7 Business and Community<br />Ch8 Social Innovation and Entrepreneurship<br />Ch9 ESG Compliance and Crisis Management",
            "comment_teaching": "I strongly recommend you take this course for this professor's session. This professor is extremely nice. He knows we are full of pressure and gives us game during the lecture. <br /><br />If you are passive and do not raise questions in class, don't worry, you can post comments on Canvas forum, it can also count on individual participation.",
            "comment_grading": "Individual Participation&nbsp;&nbsp;24%<br />Personal Reflections&nbsp;&nbsp;24%<br />PRS Voting&nbsp;&nbsp;2%<br />In-class Group Discussion 20%<br />Group Project&nbsp;&nbsp;24%<br />TMT Practicum&nbsp;&nbsp;6%<br /><br />Individual Participation marks can be gained from participating in class OR posting&nbsp;&nbsp;comments on Canvas<br /><br />There are four personal reflections submitted through Turnitin. The word limit for each reflection is 150 words only.<br /><br />In-class group discussion: You only need to write your name on the paper, and you will get the mark. Just like taking your attendance<br /><br />Group project is very &quot;hea&quot;. You&nbsp;&nbsp;only need to find a company and then find out the following: <br />(a) current CSR practices<br />(b) current social or environmental challenge<br />(c) Alternatives<br />(d) Action Plan for Best Alternative<br /><br />TMT Practicum: You ask questions to the presenting team.<br /><br />Lots of people get A range. Having a very large A range.<br />Grade: A",
            "comment_workload": "The workload is light compared to other lectures as participation can be replaced by Canvas forum, personal reflections only require 150 words, you only need to write your name and then you get the point for group discussion, group project is simple.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "mqOCgKXPUo22Ou25RnrdQsCrD8qfo5Tv",
                    "name": "Syllabus_MGMT2130_FA16_L_123",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "pIGZShkCbdWo7SNrEZM5CEEtIMKbENUn",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 583,
                    "name": "LEVERMORE, Roger John",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YC",
            "date": "Jan 24, 2017",
            "title": "",
            "comment_content": "The content is fruitful. You would learn about ESG of business through case studies and sharings from people in related industries. I think my understanding about ethics and company compliance have increased greatly after the semester. It is for students who truly want to improve their analytical skills and business mindset.",
            "comment_teaching": "Prof Roger puts a lot of efforts into teaching and gives detailed feedback to the assignment and project you worked on. The theories he taught were supported well with company case studies and examples. I have benefited a lot in his class.",
            "comment_grading": "",
            "comment_workload": "Workload is relatively large but you would definitely benefit from the course work and project !",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ffaiqvYEBd6CpVwPRQbv7E2fOb9So8ND",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 590,
                    "name": "HE, Jinyu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ustbba",
            "date": "Jan 21, 2017",
            "title": "",
            "comment_content": "mainly related to corporate social responsibility with different aspects<br />let students reflect more in business and ethic sense <br />every topic has cases for students to read and think and then discuss in the lesson<br />videos related to the topics will be watched during lesson",
            "comment_teaching": "Quite good <br />Willing to answer students' questions and explain clearly",
            "comment_grading": "Fair grade<br /><br />Everyone will get similar mark for personal reflection, so do well in the project and post/reply post online/participate in class will be fine<br /><br />Need to attend lesson",
            "comment_workload": "1. project <br />2. online discussion/class participation<br />3. personal reflection (assignment)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MBWnmOqQ63xiifXdhsOcmcAwxbnrrdlb",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 590,
                    "name": "HE, Jinyu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hki",
            "date": "Jan 20, 2017",
            "title": "Extremely good grade",
            "comment_content": "The course is just something about ethical, how to balance profitable and ethical decision-making, will have a lot of in-class discussion.",
            "comment_teaching": "He can make you think more about yourself and reflect, sometimes is boring but sometimes is inspiring. He loves TED talk so almost every lesson, we will watch a short TED video about the topic discussed in class.",
            "comment_grading": "He is absolutely good in grading, gives out a lot of A range, but the course counts attendance.",
            "comment_workload": "No final and mid-term exam, but have to do one project and few short self reflections, not much workload.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TLu0BsaW4n6W0vIwoEDSeZB6mLBEyUg9",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 583,
                    "name": "LEVERMORE, Roger John",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Flanker",
            "date": "Jan 19, 2017",
            "title": "",
            "comment_content": "Cover more than other instructors, mainly tallk about:<br />ESG<br />Scenario Planning <br />CSR Scorecard<br />MSCI model<br />other model related to ethical decision",
            "comment_teaching": "Roger's lecture are quite informative ,he talks a lot with ESG , each lectures usually presents 60+ of slides which is full of texts and the lesson seems quite intensive with a lot of discussions and so called &quot; simulation&quot;, to act as ESG consultant for multinational companies.<br />Although most of the time he is blowing water but you better remember what he mentioned in the class, cause you have to summaries it and give comments during canvas discussion.",
            "comment_grading": "individual 85/100<br />Group : 90/100<br />Grade : B",
            "comment_workload": "Require Weekly discussion on Canvas <br />use IPRS to take attendance<br />Individual essay within 1500 words<br />Group Project<br />3 scenario planning while one of them need to do a short presentation<br />Have to attend one talk held in the beginning of semester, last for around 2 hours, and hand in a reflective journal/feedback<br />No mid term and final exam which helps to reduce the workload after semester.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qniX43otGKlkLCjY5siI3YSSoIsUVD0t",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 583,
                    "name": "LEVERMORE, Roger John",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cat",
            "date": "Jan 16, 2017",
            "title": "within expectation :)",
            "comment_content": "a lot of things about ESG (=CSR) which is actually blowing water so i do not really remember much now (but scenario planning hahaha)",
            "comment_teaching": "quite engaged with students with good eye contact <br />good at remembering names, so don't keep on talking<br />good to hold review session so that students can submit their work for him brfore final submission",
            "comment_grading": "Within expectation, A-<br />project overall: ~87/100<br />individual essay: 90/100<br />quite engaged in discussion forum",
            "comment_workload": "no mifterm but you have to read assigned readings and have some mini presentation lol<br /><br />still ok as individual and group essay do not come in the same time",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HZoPtctoFUc0BztEFjDpgvj7cXYNG0ec",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": ":o)",
            "date": "Jan 09, 2017",
            "title": "",
            "comment_content": "Studies about CSR and mainly explain theories through different business cases, involved group project by providing tailor-made suggestion to the business chosen/assigned",
            "comment_teaching": "Quite clear flow, but sometimes is boring in lecture as only theories discussed with no discussion<br />Mary is quite nice in the sense that she is willing to answer questions and give freedom for you to do the project",
            "comment_grading": "Total of 100 points<br />• In-class participation: 15 points<br />• Role-play exercise: 15 points<br />• Reflective essay: 20 points<br />• Group Project: 40 points <br />• Personal Reflection on Group Project: 10 points<br /><br />Absolute Grading, you can attain good grade by doing well yourself which is not affected by others, i.e. can gain A+ with 90-100 points",
            "comment_workload": "Adequate workload. 1 written Assignment, 1 Group written project with presentation and 1 Feedback assignment in whole semester, also need to attend class and participate in the Role Play exercise in class but not much preparation needed",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5gYCob8ebzL1DCJnAMXlmIV3HoEWPm1o",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 590,
                    "name": "HE, Jinyu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ITSC",
            "date": "Dec 23, 2016",
            "title": "",
            "comment_content": "Core 冇得唔讀<br />同Yr1讀既差唔多<br />不過今次就係企業角度出發<br />對應唔同持份者點解決Ethics 同CSR既問題",
            "comment_teaching": "好比心機教<br />不過英文教書好似對佢有少少困難<br />不過都接受到 <br />落堂問佢野可以用廣東話 XD<br /><br />上堂主要係佢提出問題<br />之後做discussion<br />所以佢第一堂都有話<br />係我地自己互相學習<br />佢既作用唔大",
            "comment_grading": "有6 parts, 得Personal Reflection有出分，最後A<br /><br />(a) Individual participation 24%<br />要上堂講野或者做Canvas discussion <br />但其實只要你上堂講少少 Prof.記得你就okay<br />Discussion就要at least 一星期兩次<br /><br />(b) Personal reflections 24%<br />就Lecture 既內容寫返125字，通常Mean 係 5/6<br />&nbsp;&nbsp;&nbsp;&nbsp;Personal Reflection (i) - 6/6<br />&nbsp;&nbsp;&nbsp;&nbsp;Personal Reflection (ii) - 5/6\t<br />&nbsp;&nbsp;&nbsp;&nbsp;Personal Reflection (iii) - 5.5/6 <br />&nbsp;&nbsp;&nbsp;&nbsp;Personal Reflection (iv) - 5/6<br /><br />(c) PRS voting 2%<br />上堂PRS答問題<br /><br />(d) In-class group discussion 20%<br />每堂都要做group discussion，落堂要交返份worksheet<br />分組就抽啤牌是旦分<br /><br />(e) Group project 24%<br />扮做 business consultants for sustainability and<br />corporate responsibility。之後要為一間香港公司解決佢Major CSR 既問題<br /><br />Prof會幫你分組，務求入面咩人都有。我個組由yr２到yr 5, local 到non－local，GBM 到GBus 都有，大約4-6人一組<br /><br />正常冇Peer evluation 不過可以自己組要求做<br /><br />(f) TMT practicum 6%<br />到其他姐prsent既時候，做返間公司既TMT，去問佢地問題",
            "comment_workload": "因為做online discussion真係太煩<br />所以上堂active就唔太大問題<br /><br />reflection 2星期先做一次 一次先125字 大概花一個鐘都okay<br /><br />最大workload應該係project，特別係大家都覺得2 cred就推住做<br />不過依家好多公司都有佢地CSR既資料 所以都唔太大問題",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "e5YUuxiCEk1IoYCdZjMfdHPuvR9BDfuH",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "divdiv",
            "date": "Aug 04, 2016",
            "title": "",
            "comment_content": "Informative classes with a lot of in class discussion and group activities. It allows you to mull over some of the day to day issues we face related to ethics and how businesses need to act and react in such ethics related situation. We also go through past cases and analyse whether the companies response to certain issues is appropriate",
            "comment_teaching": "Nice, interactive teacher who is open to different opinions",
            "comment_grading": "She is a fair and good grader.",
            "comment_workload": "Okay workload, 2 essays and one final report, no exams so its is easy to work with.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0z6UyOQg6d82GfxSO2OTLfcz3KshZ1O3",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 590,
                    "name": "HE, Jinyu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Brenda Wijaya",
            "date": "Aug 25, 2015",
            "title": "",
            "comment_content": "His materials are always filled with group discussions which are engaging.",
            "comment_teaching": "He is good in bringing examples that do not bore.",
            "comment_grading": "Grading is fine if you keep on attempting to bring thoughts to questions and discussions in class.",
            "comment_workload": "The workload is not bad.You participate in class by simply answering his questions or posts some discussions in the LMES board. There is a pretty extensive research and presentation which you have to do in your team. Make sure you are in a good team if you want a decent grade.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SVzq0V37fEbjRGOgSVAXHtUnBSyHZm7t",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 586,
                    "name": "CHAO, Melody Man Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "little ass",
            "date": "Jan 22, 2021",
            "title": "",
            "comment_content": "really not useful...<br />didn't teach much that you can apply to the group project<br />did go through some company examples",
            "comment_teaching": "prof herself teaching is fine<br />but the structure of class is just bad<br />everyone just wants participation so literally half of the class time is for students to share their ideas <br />people keep repeating and arguing",
            "comment_grading": "0 transparency<br />didn't release any score for case study/ group proj/ essay/ participation<br />went to all classes, tried my best to speak once every class<br />started project pretty late<br />even tho i think our group screwed up the case study a bit<br />got B+",
            "comment_workload": "attend class and speak<br />write a 2 mins script and make your part of slides for the group project<br />and a 500 word reflection",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7GODzNVMfNwWvQceoKhvrvzkGpRjHcdU",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 586,
                    "name": "CHAO, Melody Man Chi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hsy09",
            "date": "Dec 31, 2020",
            "title": "Good course",
            "comment_content": "Mainly about understanding concepts associated with business ethics and social responsbility.<br /><br />Contents were easy. However, I have learnt nothing in this course.",
            "comment_teaching": "Melody is a nice and friendly professor. She keeps motivating students to answer&nbsp;&nbsp;question in class. She is fair to every students and will let all students to speak if they have already raised their hand.",
            "comment_grading": "No scores are released. No transparency.<br />I dont know what is the score for the group project and the term paper. The grade just released automatically.<br /><br />I think the grade is quite good, I didnt spend much time on this course and no revision is needed. No midterm and final.",
            "comment_workload": "Class exercise: 15%<br />They are all inclass exercises and they are easy to finish. Just count whether you finish it or not.<br /><br />Class discussion/participation:15%<br />Just answer once every lesson is good enough.<br /><br />Role-play exercises: 20%<br />2 role-play exercises and they are easy.<br /><br />Group project: 25%<br />Need to make a video. <br /><br />Term paper: 25%<br />500 words essay. Have to review one of the group project videos and write a reflective essay using the concepts learnt in class. Not so difficult.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wegzncL8J0PdS0wL7IROMGVMa7L7b5RA",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Angry bird",
            "date": "Dec 30, 2020",
            "title": "",
            "comment_content": "The content is funny and interesting.",
            "comment_teaching": "Mary is funny. She uploads videos about the topics before class and we mainly did discussion during class.",
            "comment_grading": "The grade is not good but not bad. As long as you attend all the lessons and finish everything, B range is guaranteed but I have no idea why I cannot get an A range.<br />Grade:B+<br />Online news sharing: 10/10 <br />Online discussion: 8/10 <br />Group project: 24/30 <br />Role-play exercises: 17/20 <br />Online quizzes: 8.5/10 <br />Feedback on Peer's Group Project: 5/5 <br />Real-time class participation: A range",
            "comment_workload": "pretty heavy for a 2credit course. There is 1 group project, 3 online quizzes, 2 role-play exercises which is basically a simulation of cases, and also online news sharing using Canva Discussion. Each student is required to share one piece of news and manage your own discussion by replying to every comment. You also have to reply to 3 pieces of news of your classmates in order to get an A for Online discussion part.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "qk4lhy0iMh2U0Q9ybeJTaPUh2JStEJ8Q",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1622,
                    "name": "BROWN, Zachariah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KaruizawaKei",
            "date": "Jun 01, 2023",
            "title": "",
            "comment_content": "Week 1 Introduction<br />Week 2 Role of Business in Society<br />Week 3 The Psychology of Corporate (Ir)responsibility<br />Week 4 Business and Employees<br />Week 5 Business and Customers<br />Week 6 Business and Suppliers<br />Week 7 Business and Communities<br />Week 8 Environment &amp; Business Models<br />Week 9 Holiday<br />Week 10 Simulation <br />Week 11 Guest Speaker (cancelled, and the topic became social style)<br />Week 12 Group Presentations<br />Week 13 Group Presentations<br /><br />The content is much better comparing to MGMT 2010, these topics are interesting and more relevant to the business world.",
            "comment_teaching": "Best professor ever. Professor BROWN is so passionate in teaching. He is expressive, talkative, humorous. There are full of interactions between professor and students.",
            "comment_grading": "Group Project 25%<br />10% for project, 15% for presentation<br />Participation 20%<br />Include participation and attendance. Coming late will reduce some marks. He will give some participation cards for records. Also, there might be cold calls regarding the reading materials.<br /><br />Professional Values Alignment Exercise 15%<br />There are 3 parts, proposal, meet with partners, and final report.<br />Surveys 10%<br />Bi-weekly, 2% each<br />Online discussion 10%<br />in total 10 discussions, 1% each<br />Personal Reflection 10%<br />Computer Simulation 10%<br />5% for game performance, 5% for reflection",
            "comment_workload": "Quite high, given this is a 2-credit course.<br /><br />As you can see in the grading part, there are many stuff to do...<br />Good luck as there is only random peer evaluation, you might not be able to report if there are free riders...",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KLWT5zPkxPdIQs2McGaKD26w8AezVwcL",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 599,
                    "name": "GARG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Testing1234",
            "date": "Jan 13, 2023",
            "title": "Sorry to all who cant take Sam's course",
            "comment_content": "• Introduction: What, Why, How<br />• Macro: Role of Business in Society<br />• Micro: Psychology of Corporate (Ir)responsibility<br />• Business and Employees<br />• Business and Customers<br />• Business and Suppliers<br />• [SPEAKER]<br />• Technology, Entrepreneurship &amp; Ethics<br />• Strategy and Innovation for Sustainability<br />• Implementing Sustainability Strategy [SIMULATION]<br /><br />Some business ethics topics (just like the course name) with cases to support and study. Some content are fun and I really enjoy it.",
            "comment_teaching": "First of all sorry to all who cant take Sam's course since he is going to leave UST. Sam is one of the most open mined professor I've ever met. He is welcome to all questions or views, you can just raise your hand and start a discussion with him if you disagree with his claim. The in-class atmosphere is very chill and relaxed. You can exchange ideas with your groupmates, classmates and Sam. Sometimes he thinks our ideas are interesting and will ask follow-up questions to extend our thoughts. He also invited some guests to give talks which were really inspiring. This has to be the best MGMT that I've ever taken.",
            "comment_grading": "• In-class discussion – 20%<br />Raise your hand in class and answer/ask questions. <br /><br />• In-class individual participation – 10%<br />Attend the class and sit there<br /><br />• Online discussions x 3 – 15%<br />There will be questions related to topics that Sam mentioned in class. You have to post your view on it and reply to other's views. <br /><br />• Group project – 35%<br />A 10 mins presentation or 7 pages report about a company's sustainability strategy.<br /><br />• Self-reflection essay x 2 – 20%<br />A 1 page short essay about what you think about any topic we discussed in class.<br /><br />Overall A+, totally out of expectation. Great thanks to Sam and Barry!",
            "comment_workload": "You have to read 1-2 articles/videos before class. But there is only 1 class per week so it's fine. There will be 6-7 students in a group for the project so the workload isn't terrible. The overall workload is also very small.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4LyjVdNgE2TISe8eir5OAAIQbJ7kNyJM",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1268,
                    "name": "YOUNG, Mark",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "9527d",
            "date": "Dec 30, 2022",
            "title": "",
            "comment_content": "The course material could be more technical, so the whole class is based on the qualitative understanding and analysis of the cases.&nbsp;&nbsp;Some terminology may be helpful for further discussions and writing assignments.",
            "comment_teaching": "Mark Young has a very nice accent. When he talks in class, he always walks around to ensure that all students are getting his point. but sometimes, he speaks a bit low volume, so students at the back find it hard to get the point. He tends to leave us time for class discussion, and he always wants to hear something about us.",
            "comment_grading": "Good Grade. The grade is distributed in many areas, so weekly work is essential. In this course, if you work hard and participate,&nbsp;&nbsp;you can get a good grade even if your knowledge could be better than your classmates. If you are not a year 3 or 4 student, feel free! Although I'm year two, and only five years two students in one Lec, don't be afraid.",
            "comment_workload": "Very High workload!!!!!!!!<br />Reading materials every week, and the course grade is distributed in so many aspects, except exams. I spend more than three hours reading the material or watching the videos every week. He will test if we read the materials at the beginning of the class. So if you still need to read it and feel the light workload, you should be careful. There are too many writing tasks this term. If you want to be clear in written language, you will spend a lot of time.....",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IYsnJgZPfmojUw1qNfPecWNO4qfJnFn7",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "llyxx",
            "date": "Jan 07, 2020",
            "title": "",
            "comment_content": "ethics and sustainability related contents. discussed from the perspectives of different stakeholders. consider the social and environmental challenges that business today face.",
            "comment_teaching": "the professor was good and put a lot of efforts to make the course fun.",
            "comment_grading": "my friends got good grade. <br />participation, I guess, is very very&nbsp;&nbsp;very important. I was doing fine with everything but my participation, according to my grade. I got B range, that hurt me seriously, LOL. I tried very hard to speak in the class to the extent that I felt kind of unhappy. Unfortunately, the participation was 20 percent. I am not sure about the exact criteria for this 20, and I dont understand how more active I can be in a 70 people's class. I attended every class and filled the end of class survey.<br /><br />never feel so eager to share the grading experience. perhaps it is just me dreaming that I have participated a lot in the class. <br /><br />anyway, never expect me getting such a grade in this course when I have made so many efforts. it hurts me badly, much more than any other courses in this school. this is the first time that I felt a grade is unfair. I think I will never take this professor's course again, lol.",
            "comment_workload": "around three writings and a project to done. not too easy but not that heavy.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QMTMkrcyT68kQN7squqJUgkfPK2yFTh5",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1268,
                    "name": "YOUNG, Mark",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Aristia",
            "date": "Jan 05, 2023",
            "title": "interesting course",
            "comment_content": "Interesting content",
            "comment_teaching": "great teaching encourages students to participate and form opinions. There are opportunities to have lunch with guest speakers which are incredibly insightful.",
            "comment_grading": "clear gradings with feedbacks however it can the letter grade can be very subjective",
            "comment_workload": "quite heavy as it involves group projects, 2 self-reflections (not that long), weekly readings (the professor will randomly ask people to summarize the readings), and active participation in both the discussion board and also in the class. The professor will give out &quot;tickets&quot; to those who answer or ask questions in class.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "36kyCqk5LM7c57YgapgKX1PEvlPhk7Gt",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1268,
                    "name": "YOUNG, Mark",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nancy0702",
            "date": "Jan 03, 2023",
            "title": "MGMT Review",
            "comment_content": "2 personal reflections worth 15%<br />2 online discussion worth 10%<br />team project worth 30%<br />In-class participation worth 15%<br />One case report analysis worth 15%<br />Team computer stimulation worth 15%",
            "comment_teaching": "Professor Young tried to engage the whole class as much as possible with in-class questions and activities and was proven to be very effective. He values everyones opinion and tries to make them think outside the box.",
            "comment_grading": "Fair grading and was quite competitive. <br />Got above mean for almost all assignments and attainted an A.",
            "comment_workload": "Workload was quite light if team project is well-organised and divide the work properly.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RXtA2kvjDd454fpSthoD5zVsdMmwQ6CI",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1268,
                    "name": "YOUNG, Mark",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "save_my_CGA",
            "date": "Jan 24, 2022",
            "title": "",
            "comment_content": "- Role of Business in Society<br />- Business Ethics and Social Responsibility<br />- Employees<br />- Customers<br />- Suppliers<br />- Communities<br />- The natural environment<br />- Strategy and Innovation for sustainability<br />- Implementing Sustainability Strategy<br /><br />There are required readings before class. Make sure you at least have a basic understanding of the content cuz he might randomly pick a person to ask about the readings.",
            "comment_teaching": "He encourages students to participate in class and express their own points of views. Loves to challenge you and make you think more deeply or consider another side of the discussion. However I sometimes do find it overwhelming and a bit hard to understand the way he delivers the class content and challenges your viewpoints.<br />He also invites a lot of guest speakers from different professions talking about a topic related to the content covered in class. Appreciate such effort to enrich content.",
            "comment_grading": "The evaluation criteria are pretty clear but since the assignments are mostly project-based or essay-based, it isn't easy to know what grades you are going to get.<br /><br />Evaluation criteria:<br />- Two Personal Reflections. 20%<br />- Three Online Forum Discussions. 10%<br />- Team Project. 35% (review a firm’s sustainability strategy and give recommendations, the firm must be a listed company on the HKEX)<br />- In-class participation. 20%<br />- One case report analysis. 15%<br /><br />In-class participation is important so make sure you answer his questions or ask guest speakers questions.<br />Personal reflection can be written about any topic covered in-class. Do make sure you really think and reflect or it will not be easy to get high scores.<br />For team projects, make sure you did enough research and had your own thoughts to answer the questions he gave after the presentation cuz it might be tricky.",
            "comment_workload": "Not really heavy. The individual essays (personal reflections/ discussions/ case analysis) are not long with word count restrictions. The group project consists of a presentation and report, and the requirements are just like other courses.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XXgEwxOyjolC2W2DEnzeDtWDARUuBqzX",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1268,
                    "name": "YOUNG, Mark",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gnehcar111",
            "date": "Dec 10, 2022",
            "title": "Nice course, friendly professor",
            "comment_content": "The course covers business ethics, corporate social responsibility and ESG practices. There are no final exams, but active participation is required and highly suggested. Great course if you like reflecting on ethical issues and doing some short writing.",
            "comment_teaching": "Mark is super friendly, he makes each lecture really fun with different discussions and interesting case studies. He's also open to answering any questions you may have and encourages anyone to speak up no matter what ideas or perspectives they have.",
            "comment_grading": "Grading is alright. The mean for each task is quite high and the score distribution is a bit narrow, so it's easy to get a relatively nice grade, but the competition for A range would be rather high. As long as you can present your ideas clearly utilizing concepts covered in the course in your assignments and group project, it shouldn't be too hard to get a good grade. Do actively engage in discussions and answer questions in every lecture as participation can count for a pretty significant score difference, e.g. from B+ to A-.",
            "comment_workload": "Workload is fairly light. No exams (midterm or final). <br /><br />Individual: 2 online discussions, 2 personal reflections (400 word limit), 1 case analysis (500 word limit), lecture participation &amp; attendance<br /><br />Group: Project and presentation, Computer Simulation Exercise, Simulation Exercise Reflection",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QQGUekcyQ9yqzrRSmW5gic7NSPamGlgd",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "purple",
            "date": "May 29, 2019",
            "title": "good grade",
            "comment_content": "The course is about CSR and CSV. Sometimes it is interesting to see that the corporates have other innovative businesses which do good not only to the companies themselves as well as the societies and the environment.<br /><br />Week 1 (Jan. 30 / Feb. 4): Introduction to Business Ethics &amp; Social Responsibility<br />Week 2 (Feb. 11 / Feb. 13): CSR Evolution<br />Week 3 (Feb. 18 / Feb. 20): Ethical Decision-making &amp; Leadership<br />Week 4 (Feb. 25 / Feb. 27): Role-play Exercise I<br />Week 5 (Mar. 4 / Mar. 6): Reinventing CSR for the 21st Century<br />Week 6 (Mar. 11 / Mar. 13): Business and Sustainable Development<br />Week 7 (Mar. 18 / Mar. 20): From CSR to CSV<br />Week 8 (Mar. 25 / Mar. 27): Role-play Exercise II<br />Week 9 (Apr. 1 / Apr. 3): CLASS CANCELLED<br />Week 10 (Apr. 8 / Apr. 10): Group Project Presentations (Corporate Irresponsibility)<br />Week 11 (Apr. 15 / Apr. 17): Group Project Presentations (Ethical Leaders in the Corporate World)<br />Week 12 (Apr. 24 / Apr. 29): Group Project Presentations (Sustainable Innovation and Initiatives)<br />Week 13 (May 6 / May 8): Group Project Presentations (HK's Sustainability Challenge)",
            "comment_teaching": "Mary just read out the powerpoint slides. But she is very nice and knowledgeable by our interaction and its academic backgrounds",
            "comment_grading": "In-class participation: Unknown/20<br />Role-play exercises: 18/20<br />(Mean: 16; High: 19; Low: 6)<br />Individual Assignment #1:10/10<br />(Mean: 8; High: 10; Low:0)<br />Individual Assignment #2: 7/10<br />(Mean: 7.8; High: 10; Low:0)<br />Group project: 26/30<br />(Mean: 24.3; High: 27; Low: 15)<br />Personal Reflection on Group Project: 8/10<br />(Mean: 7.5; High: 9; Low: 0)<br /><br />Final Grade: A+<br /><br />Grade\tPercentage\tLevel of Achievement<br />A+, A, A-\t 0 - 27%\tExcellent performance<br />B+, B, B-\t35 - 45%\tGood performance<br />C+, C, C-\t28 - 38%\tSatisfactory performance<br />D\t0 - 9%\tMarginal pass<br />F\t0 - 6%\tFail<br /><br />Mary gave the name cards to everyone in order to let her recognize you. The mark of in-class participation was not disclosed. I did actively participate during lessons by answering at least one question. Also, there was PRS at the end of each lesson which is directly affecting the participation mark. If you really could not attend the lesson at the timeslot, you could sit other lectures taught by Mary without prior request.<br /><br />There were two role-play exercises which needed to study reading materials in order to get familiarize yourself with the topic going to be discussed. Then, you will be either assigned to a group by Mary or choose your own groupmate with a specific stakeholders and discuss the instructions. For the first role-play exercise, I was one of them to represent the group to express our opinions though I said something incorrect and luckily my groupmates reminded me. However, I did not speak up in the second role-play exercise. If you really could not attend the role-play exercise, requested attending another lecture.<br /><br />I wrote a lot in the first individual assignment, therefore, got the highest mark. Unfortunately, I wrote much less in the second individual assignment due to a lot of deadlines of assignments and projects which led to lower mark.<br /><br />For the group project, you can choose one out of four topics and then make powerpoint slides for presentation. I was surprised that Mary gave us a high mark because I did screw up in making PowerPoint and presentation. I was the one who mainly made the PowerPoint and one of them to do the presentation. Other groupmates are either freeriders or troublemakers. Our presentation got a low recognition from classmates showing in the vote of best presentation. Luckily, Mary is generous in grading our project.<br /><br />After the presentation, personal reflection on the presentation needs to be handed in. When I first saw the mark of personal reflection, I thought that I was screwed up the course again. After looking the mean, it is not a big difference compared with other students.<br /><br />I am really surprised by the grade of this course because I did not consider myself outperforming during the whole semester. I know other reviews advised that not to choose Mary. I am here to tell you, Mary is your best choice in order to ace A+ if you do actively participate in the class and do well in the three individual assignments. For the group project, wisely choose your groupmate and your life will be much easier.",
            "comment_workload": "In general, the workload is light for this course. Attending the lesson every week, two individual assignment by modifying wordings from the weekly readings, attending lessons for the role-play exercises, doing the project and writing the personal reflection for the project. <br /><br />Because you could choose the groupmates by yourself, remember CHOOSE GOOD GROUPMATES and you will have fewer workloads.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xHWLq9bMixLNJGk2ZZnQIndlxAXTC54w",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1268,
                    "name": "YOUNG, Mark",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Boeing787",
            "date": "Dec 02, 2021",
            "title": "Best Business Core MGMT Course",
            "comment_content": "1. Lecture 1: Creating shared value<br />2. Lecture 2: Hoaxwagen<br />3. Lecture 3: Life and death in Apple's forbidden city<br />4. When should a leader apologize?<br />5. The path to corporate responsibility<br />6. Greenwashing<br />7. Why sustainability is now a key driver for innovation<br />8. ESY Supply Chains<br />9. The truth about CSR<br /><br />Class participation consists 20% towards your final grade so do speak up in class. Mark encourages you to express your ideas in the personal reflection. You are free to disagree given that the ideas are well supported with evidence. Do not merely summarize lecture content or put down conventional thoughts that are prevalent in our society. Mark hates that and you will be marked down!<br /><br />You will to analyze a company's CSR listed on HKEX for your group project. Make sure you choose good team members and the project should be a breeze!",
            "comment_teaching": "Professor Mark is a great professor! His lectures are interesting and I can sit attentively throughout the 100 minute lesson. He encourages students to express their own ideas so feel free to challenge his ideas! He hates it if you blindly follow other people's thoughts and he describes this as &quot;sheeple&quot;. <br /><br />He also invites guest speakers to class, some are uploaded as pre-recorded videos while others are held live in class. These speakers are interesting and lively. I really appreciate the effort that Mark puts in when designing this course.",
            "comment_grading": "The assessment methods for this course are listed as follows:<br />1. 2 personal reflections (10% each x 2). 1 must come from lecture 2 to 5 and another from lecture 6 to 10. <br /><br />2. Group project (35%)<br /><br />3. 3 online forum discussions on canvas (10% in total)<br /><br />4. Case report analysis (15%)<br /><br />5. Class participation (20%)",
            "comment_workload": "Relatively light workload. The only work you have throughout the semester are 2 reflections, group project and a case analysis. The group project consists of a presentation and report. The 1000 word report can be written easily with 5 to 6 people per group.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 17,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Z2pXzM9ece78L6mMxHanOLbnVMR3pF47",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": ";-;",
            "date": "Dec 18, 2020",
            "title": "",
            "comment_content": "How do i delete reviews fuck i didnt take this course",
            "comment_teaching": "a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a",
            "comment_grading": "",
            "comment_workload": "",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 7,
            "vote_count": 36,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FQ8299efFWfbs6sYBvmgT3EzvmzQKIVs",
            "semester": "2012-13 Fall",
            "instructors": [],
            "is_author": false,
            "author": "chickenhkust",
            "date": "Dec 07, 2021",
            "title": "",
            "comment_content": "Content Content Content Content Content ContentConte ntCont entCo n ten tContentContentCo ntentContentContentC ontentContentCo ntentContentCont en tC ontentCon te&nbsp;&nbsp;ntContentConte tCont en tConte&nbsp;&nbsp;ntCo ntent Conc c c c c c c c c c c c c c c c&nbsp;&nbsp;&nbsp;c c c c c c c c c c c&nbsp;&nbsp;c c c c c c&nbsp;&nbsp;c c c c&nbsp;&nbsp;c cc c c c c c <br /> c c c&nbsp;&nbsp;c c c&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;c&nbsp;&nbsp;c c c c c&nbsp;&nbsp;c ctentContentCon tentCont en&nbsp;&nbsp;&nbsp;&nbsp;<br />&nbsp;&nbsp;tContentContent Co ntentConte <br /> ntContentContentCo tent",
            "comment_teaching": "",
            "comment_grading": "",
            "comment_workload": "adequate",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 31,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}