{
    "error": false,
    "course": {
        "id": 1010,
        "subject": "MGMT",
        "code": "4250",
        "name": "Management Consulting",
        "description": "To meet the increasing demand from both the private and public sectors in local and international firms in Hong Kong, South East Asia and mainland China, Management Consulting is a course to be offered by faculty with consulting experience who will train students in management with the fundamental and practical skills to understand and analyse business problems in order to work out a number of scenarios for solving problems. More importantly, the students will be encouraged to work in teams and propose innovative and strategic consulting plans to meet a set of specified goals from time to time.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1730,
            1630,
            1510,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MGMT\" data-code=\"1110\" href=\"/review/MGMT1110\" target=\"_blank\">MGMT 1110</a> or <a class=\"course-link\" data-subject=\"MGMT\" data-code=\"2110\" href=\"/review/MGMT2110\" target=\"_blank\">MGMT 2110</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 4,
        "rating_workload": 2.67,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 600,
                "name": "CHOI, Joon Nak",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "CmQEEVhvKNBgIRuzkSqsGqQYb8X9aC1q",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 600,
                    "name": "CHOI, Joon Nak",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "miks99",
            "date": "Feb 11, 2021",
            "title": "Challenging and rewarding experience",
            "comment_content": "Really useful content, tailored towards students wanting to know how to create, present a professional consulting deck. <br /><br />Students go through the entire process of creating a consulting deck. Starting with the project contract, research memos, structured introduction, diagnostic frameworks, hypothesised solution and storyboarded decks. Only at the very end, you put the pieces together and create a full deck, which you present to the class and later to your client.&nbsp;&nbsp;A final deck would look like anything between 60 to 100+ slides, around 50-60 minutes long. <br /><br />A lot of the learning process comes from your group's research and findings. You need to become very knowledgable about your client and their problem in order to produce a good solution.",
            "comment_teaching": "JC has plenty of years teaching and prior industry knowledge as a former consultant. <br /><br />He treats his students 'like professionals at a blue-chip consultancy'. Some may be intimidated by his approach, however I think he really cares for his students and wants the highest quality of work produced from each group. <br /><br />Your group is expected to present your findings to the class pretty much every week or so. He gives really constructive feedback in order to improve your presentation skills.",
            "comment_grading": "Individual Grade: <br />20% Class Participation <br /><br />Group Grade: <br />30% Group Assignments<br />50% Final Presentation <br /><br />Bell curve present, but as all groups did well for their projects. Most students got an A to B range grade.",
            "comment_workload": "Very high workload. Not an easy course, but steep learning curve. Some groups had significantly more challenging projects because of their client's expectations. Be mindful which project and group-mates you choose. <br /><br />Workload at the beginning was just a few hours a week. Expect to spend 10-40 hours per week towards the later part of the course. A lot of this came to making refinements to our project deliverables. By the end, you would have probably presented to the class about 6-8 times, so lots of opportunities for improvement and learning of the other group's projects. <br /><br />Expect to spend a lot of time meeting with your group outside of class. My group had meetings ranging from 1-5 times a week depending on the workload. Deliverables require a lot of critical thinking and analysis. Some groups may need to meet with their client multiple times to go over their progress and discussion.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "P8NLsehjcN0pnAOBKdmkB8z335F1eETe",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 600,
                    "name": "CHOI, Joon Nak",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bobby Chan",
            "date": "Jan 23, 2019",
            "title": "",
            "comment_content": "Basically teaching you how to compile a consulting deck. Working towards your final deck each week and present the progress to the class. Interesting and useful content.",
            "comment_teaching": "Good professor that cares about students and give very useful feedbacks. Half the class are groups presenting and the other half is teaching materials to get you ready for the bit that is due the next week.",
            "comment_grading": "Entire grade base on your consulting project, as the workload is really high, it really depends on getting good groupmates. JC gives very lenient grade if he sees you putting the work in.",
            "comment_workload": "High workload but the end result and what you learn is worth it.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "ImyKzvpdhg6WJbZvNvRSfQkOzhRSgenl",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 600,
                    "name": "CHOI, Joon Nak",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "To Cheuk Hei",
            "date": "Dec 04, 2018",
            "title": "Rewarding",
            "comment_content": "Your Group = Your Fate<br />Basically, this course is similar to a capstone project in which people are divided into groups of 4-6 as consulting teams to work on an actual project for startups or NGOs.<br /><br />Every week, the first half of the lecture is a presentation of the ongoing progress of your project deck, this sounds scary but trust me you will get used to it.<br /><br />The other half of the lecture is JC teaching about the consulting industry and skills you need to form a cohesive analysis. Since every group has a different client, the approach to each problem is different, but general speaking, the skills are quite useful.<br /><br />To be brutally honest, your groupmates = your fate, we all know mgmt courses are full of exchange students and their motivation to deliver the best work may not be as high, this course is no exception.",
            "comment_teaching": "JC kicked half of the class out in the first lesson, he was strict in limiting the number of students in his class. That's simply because he was a great teacher who actually taught important lessons. useful consulting skills. and most important of all, he took good care of his students.<br /><br />Every class is 3 hours long, first half for presentation evaluation, the other half is a lecture on the consulting industry or analytic skills for consulting. If you truly enjoy consulting, you will not regret taking this course.",
            "comment_grading": "Overall JC is a good teacher, he grades presentations fairly, he even asked for dispensation to relax the typical grading curve to give out more Bs and As. <br /><br />If you really did put in the effort and presented the materials well in your final presentation, your hard work would not go in vain.",
            "comment_workload": "20% Class Participation<br />30% Group Assignment<br />50% Final Presentation<br />0% Exam<br /><br />Syllabus definitely looks scary but workload turned out to be manageable (given you have good if not strong groupmates) <br />Should you be warned, this course is not easy, A LOT of hard work and resources (time, people, brainpower) are put into making the project deck happen, if you expect an easy good grade, please don't take the risk.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}