{
    "error": false,
    "course": {
        "id": 1033,
        "subject": "PHYS",
        "code": "3038",
        "name": "Optics",
        "description": "Ray tracing, matrix optics, wave optics, superposition of waves and interference, coherence, Fresnel and Fraunhofer diffraction, polarisation, Fourier optics, holography, phase and group velocity, material dispersion, propagation of Gaussian beams.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"ELEC\" data-code=\"4610\" href=\"/review/ELEC4610\" target=\"_blank\">ELEC 4610</a>",
        "rating_content": 4.4,
        "rating_teaching": 4,
        "rating_grading": 5,
        "rating_workload": 4.4,
        "review_count": 5,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 613,
                "name": "DU, Shengwang",
                "count": 2
            },
            {
                "id": 1371,
                "name": "ZHANG, Jingdi",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "4jV6Lpe4IgAA0p5u8kSoE5x37rMWEIMF",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 613,
                    "name": "DU, Shengwang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "peter john",
            "date": "Jan 16, 2018",
            "title": "",
            "comment_content": "Follow with Optics by Eugene Hecht:<br />wave motion<br />EM theory, photons and light<br />propagation of light<br />geometrical optics<br />more of geo. optics<br />superposition of waves<br />polarization<br />interference<br />diffraction<br />fourier optics(not included in exam)",
            "comment_teaching": "The notes were completely useless(except the first few lectures). He only added few pictures and equations but without any explanation. You can hardly follow unless you have the book. However, the book was written in a bad style - SO MANY WORDS! The organisation was also terrible. Unfortunately, it is the only way to catch up his lesson - Du didn't explain things clearly in the lesson either! He just followed the notes and I could not find anything useful from what he said.",
            "comment_grading": "I heard &quot;small class, good grade&quot; from someone else...<br />Homework : 20%<br />Midterm exam : 35%<br />Final exam : 45%<br />i got 19.12/20 in hw, 90/100 in midterm(mean 69), 77/100 in final(mean 75), though screwing up in final, i got A eventually",
            "comment_workload": "1 homework every week. They were just questions from the textbook which you can google the answer.<br />The exams were surprisingly easier than what I thought. Though it was disaster to read the textbook and notes, the exams only tested some very simple principles and equations. So, don't worry!<br />However, if you really want to learn something, you might face some struggle in reading the textbook or understanding the homework answers",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8e9ksOSXTexAUcD3wrpqtyKt3FVrYaPH",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1371,
                    "name": "ZHANG, Jingdi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gearless Joe",
            "date": "Dec 31, 2021",
            "title": "It's a worthy choice for students who are interested in Optics",
            "comment_content": "Dipole, Geometric Optics, Superposition, Polarization, Interference, Diffraction, Fourier Transformation, Laser. Nearly all topics related to Optics.",
            "comment_teaching": "Prof.Zhang is a considerable professor. He's nearly the best instructor I've ever met. He prepared a lot for his class and teaches detailedly. He also spends a long time answering students' questions.&nbsp;&nbsp;He will always take students' advice into consideration and try to reach better.",
            "comment_grading": "For this semester, it is a good grade class. All my homeworks, which are actually not so difficult, grades are over mean a little bit. Midterm is not difficult, and I got a mean score. The final had 9 problems, which is actually quite difficult. I don't think I did it well, but I don't know whether others feel the same. Still,I got an A in the final. which satisfies me.",
            "comment_workload": "About 5-6 questions each assignment. And there were 7 assignments for this semester. Having both midterm and final, so actually it requires reviwing a lot due to the plentiful content. But the workload is not big for assignments. So for students who really have many examinations in a semester, it may be a little bit painful.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ja2zJ0XRVbUtzT9n38x8zclwkvXC2E6m",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Vincent C",
            "date": "Apr 26, 2023",
            "title": "Hard but Nice Grade",
            "comment_content": "First part is about maxwell equations, so you better know it before you take it since we do quite a lot maths.<br />Afterwards, it is mainly about learning and using formulas. Not difficult but a liitle boring.",
            "comment_teaching": "professor is engaging. But the lecturen note may be a little bit confusing and you better attend the lecture.",
            "comment_grading": "very good grade. <br />Midterm all from homework and secure everyone to pass.<br />Final is much more difficult but still adequate. I did most of the problems and missed 2 but still get A. Professor said he didnt expect anyone to finish all questions.",
            "comment_workload": "quite light workload, 1 homework every week and in general just find formulas from lecture notes.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kiRy0s6yYCsgW3aDWxSyhOGEh1yazn5v",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 613,
                    "name": "DU, Shengwang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hokzar",
            "date": "Dec 17, 2019",
            "title": "A good course",
            "comment_content": "This course has no prerequisite. But a high school level of physics and mathematics will not be able to handle this course. Many of the derivations of the formula require calculation on vector calculus, multivariable calculus, matrix. Please don't expect the professor to go through the calculation slowly in class. You better know Maxwell Equation before register this course. Otherwise, it is hard to catch up. I suggest you to done PHYS1114 or PHYS1314 first. If you played Physics Olympiad before, you can take this on year first year. It is just similar to PHYO content but you will learn more mathematical methods in dealing those problems.&nbsp;&nbsp;(&quot;An Engineering Way&quot; said by Prof Du)<br /><br />Follows the textbook of Hecht Optics ch1-11:<br />Wave<br />EM theory<br />Light propagation<br />Superposition<br />Polarization<br />Interference<br />Diffraction<br />Fourier Optics",
            "comment_teaching": "It is important to go to the lesson although attendance is not counted. As the book is very thick and many words and the lecture slide is hard to follow, going to the lesson will lower the workload a lot instead of catching yourself.<br /><br />Prof Du had done a great job in extracting the main point from that long and thick book. I can understand the concept much quicker by listening to him instead of reading the book and find what is important.<br /><br />Prof Du will go through some out of syllabus things with us and raise question for us to think about. Which is really good in my opinion. It increased my interest in the topic.<br /><br />He will also ask us to derive some formula our own which is handlable for us. Following his instruction gave me a deeper understanding. The task he gave is actually intuitive. Those are not homework so it is your choice if you think that is not useful.",
            "comment_grading": "Due to the social incident, the grading scheme had been changed to<br />Homework: 45%<br />Mid-term: 55%<br /><br />Homework: 44.7/45<br />Mid-term: 55/55 (Mean is about 71%)<br /><br />Overall grade: A+",
            "comment_workload": "Assignment per week. Each with about 4-5 questions. The assignment workload is low actually because all question are from the textbook. There are solution online.<br /><br />I give this grade because I assume you read the textbook and try to do the homework yourself and understand all the main points of the content. It does require some work.<br /><br />Don't worry if you just want to handle the exam. The workload will be low in this case as the mid-term is easy.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KRHrS5JdDpfWIpgZ3FiTgMcnWLSpKS4T",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1371,
                    "name": "ZHANG, Jingdi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lucien▪Evans",
            "date": "Dec 29, 2021",
            "title": "good grading and excellent teaching",
            "comment_content": "Although it is not a mandatory course of physics major, you are highly recommended to take it. It covered some essential part of geometrical optics and wave optics.",
            "comment_teaching": "This is the first year for prof.ZHANG to teach this course. But he gives you a&nbsp;&nbsp;chance to deeply understand all of the fields in linear&nbsp;&nbsp;optic. He will write lecture notes before every class but still using ppt and write down all the steps on the white board .<br />He tried to tell some jokes in the class but no one responded to him most of the time.<br />In all, he is a very nice professor in both grading and teaching.<br /><br />Initially, i am a little bit worried about this course since the professor was changed and new in school. Now i can say that prof.ZHANG is also a nice professor and you should't hesitate if you want to take this course.",
            "comment_grading": "Excellent grading scheme. As long as you followed prof in each lecture, you will find not difficult to get high scores in exams<br />Probably highest in both midterm and final, around mean in HW, finally got A+.<br />My local friend told me she also got A- although she didn't perform very well in final. i guess around mean would be guranteed A range.<br /><br />i am not sure if professor will change his generous grading scheme after this semester but this year it is really nice.<br /><br />a notice: this year midterm is very easy and the mean is 92/100. However, he modified the level of difficulty in final since the mean in midterm is very high. There are 8 problems and not very easy compared to midterm. If you feel like there is no need to learn in the class after the midterm, you might find it hard to deal with the problems in final.",
            "comment_workload": "not very hard<br />Each week or two weeks you should submit an assignment with 4-5 questions. The mean is always high, normally 90-95.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}