{
    "error": false,
    "course": {
        "id": 1022,
        "subject": "PHYS",
        "code": "1312",
        "name": "Honors General Physics I",
        "description": "This course is a more in-depth version of PHYS 1112. It is intended to provide a solid foundation to students who wish to take more advanced physics courses in the future. Key topics include motions and Newton’s Laws, work and energy, conservation of energy and momentum, rotation, rigid body, simple harmonic and damped oscillations, forced oscillations, standing waves and sound waves, kinetic theory and the laws of thermodynamics. Students without the prerequisite may seek instructor’s approval for enrolling in the course. For students under the 4-year degree only.",
        "categories": [
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510,
            1410
        ],
        "prerequisites": "(Level 5* or above in HKDSE 1/2x Physics OR in HKDSE 1x Physics) AND (Level 5 or above in HKDSE Mathematics Extended Module M1/M2)",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1111\" href=\"/review/PHYS1111\" target=\"_blank\">PHYS 1111</a>, <a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1112\" href=\"/review/PHYS1112\" target=\"_blank\">PHYS 1112</a>",
        "rating_content": 4.64,
        "rating_teaching": 4.72,
        "rating_grading": 4.53,
        "rating_workload": 3.21,
        "review_count": 53,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 611,
                "name": "CHAN, Ho Bun",
                "count": 35
            },
            {
                "id": 608,
                "name": "LEUNG, Pak Wo",
                "count": 12
            },
            {
                "id": 607,
                "name": "JO, Gyu Boong",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "8UTjace1Nf06TdPeXX8hVywvviOwwbCK",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "BABA",
            "date": "Jan 18, 2016",
            "title": "",
            "comment_content": "This course focuses heavily on problem solving and less on exploring theoretical concepts in detail. It moves at an extremely fast pace, and would be extremely hard to follow if you are not already aware of all the concepts being taught. I would suggest that only the following students take up this course:<br /><br />-Have studied and are more than familiar with the content, and have used calculus thoroughly in problem solving in high school.<br /><br />-Are genuinely interested in challenging themselves and are not here to get an easy A.<br /><br />-Think they possess above average intelligence.<br /><br />These are the necessary AND sufficient criteria for joining this course.<br /><br />(Attendance isn't a requirement. So if you are an Olympiad gold medalist, go chill in the...library)",
            "comment_teaching": "Prof CHAN can be best described as being mediocre.<br /><br />He had one flaw the existence of which, even though quite common, turned out to be disappointing. <br />He would randomly go about working on a problem without explaining the intent behind each step. I emphasize this, he would explain the 'reasoning', but not the 'intent' behind each step. <br /><br />The teaching assistant barely made his presence felt except on days on which he would collect the written HW.",
            "comment_grading": "Getting more than mean in the midterms and finals will get you an A. Prof CHAN even mentions that at the very beginning.<br /><br />I got mean marks in the midterms and finals and was quite careless about the HW, and didn't even submit it once. I eventually got a B+.<br /><br />If you are looking for a certain A, join PHYS1112.",
            "comment_workload": "Every week, students are required to do ONLINE and WRITTEN homework. <br /><br />The written homework is quite fun and challenging, only if you are interested in physics and problem solving in general. It comprises of 2-3 long problems and would take around 2-15 hours depending on the level of difficulty (Yes, I once spent 15 hours solving one single problem, still couldn't do it and eventually decided to take help from the teaching assistant). But to be honest, it was something I personally looked forward to every week.<br /><br />The online homework is incredibly irritating. It involves more calculations than an ordinary calculator does in its entire lifespan. Holy s*** I'm getting angry just thinking about it. It takes around 2-6 hours depending on your level of frustration.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 9,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tlKH0tQO607wre1sQ7jqY1QM1YDzju67",
            "semester": "2013-14 Fall",
            "instructors": [],
            "is_author": false,
            "author": "O",
            "date": "Aug 02, 2015",
            "title": "",
            "comment_content": "Phys1312 is the harder edition for Phys1112. The questions it asked mainly for proof and so it is quite hard in normal student level.<br />So if you are not very keen to challenge yourself, dont take this course.",
            "comment_teaching": "Ho Ban is a good teacher. He will explain clearly to you if you ask him and also, he will make jokes without smiling.<br />That makes the jokes even more interesting haha.",
            "comment_grading": "Actually since it is a honor course, the grading is quite good.<br />I got below mean for 2 sd in both test and exam and still got B.<br />But I did hand all the homework and the difficulty of hw was similar to long questions in exam.",
            "comment_workload": "You will have a written homework and it will ask you to proof equations or formulae in cases he gave.<br />There are some Mastering Physics exercise but I am not sure whether they count marks or not.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9oedK353sWK87DOqD6qaHynwkhuGwqTj",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "肯尼含",
            "date": "Aug 16, 2019",
            "title": "",
            "comment_content": "The same content as PHYS 1112, but deeper and tougher.",
            "comment_teaching": "Professor Chan is a 100% physics man.<br />He seldom has facial expression on his poker face, and the tome in his lecture is kind of boring.<br /><br />However, he is definitely a great professor, because he is willing to do ANYTHING to let his students understand more about the concept.<br />He almost performed one experiments inside the classroom per week, and he even swallowed some helium just to prove the theory to us.<br /><br />About the contents, he never skip a formula without proving it, and he always try to let us understand the theorem behind with different approaches.<br /><br />A nice and professor. =）",
            "comment_grading": "HW (hand-written)<br />Midterm and Final",
            "comment_workload": "Heavy.<br />Really heavy.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ISfMRC9FKqdxEhcWyeMpt16KWToZkKRi",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 608,
                    "name": "LEUNG, Pak Wo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SunGamePlay",
            "date": "Nov 18, 2022",
            "title": "Good course if you aim high.",
            "comment_content": "The course is more in-depth version of PHYS1112.<br />The notes of PHYS1312 is similar to that of PHYS1112.<br />Unlike PHYS1112, you need a good mathematics foundation to solve<br />the questions in PHYS1312. <br />But once you know how to solve the equations you listed,<br />you can easily solve every problems.<br />It isn't like a PHYS course as in my point of view, <br />Mathematics matter more than the physics part.",
            "comment_teaching": "Prof Leung is a good Prof.<br />Which he can teaches things clearly with fun.<br />(e.g. he mention you and your very important half should observe<br />the same result in two different reference frame / everyone should learned this basic stuff in kindergarten)<br />He will do the experiments in class if possible <br />and explain it in detail well.",
            "comment_grading": "Since PHYS1312 is a honors course,<br />the grading of it is great.<br /><br />Total score = 15%HW + 40%Midterm + 45%Final<br /><br />For homework, <br />the two homework with the lowest score would be dropped,<br />and the others would take account to calculate the average score.<br /><br />For midterm and Final, the difficulty is like the hardest questions<br />in each tutorial, if you can do that questions well, you would be okay and fine with the exams.",
            "comment_workload": "You have online homework every week.<br />You just have to input the correct numeral answer<br />or click the correct answer for MC questions. <br />The questions are not that difficult and you can do it in 2-3 hrs.<br />(sometimes ~ 1hr)<br />There is also follow-up questions to help you if can't get<br />&gt;95% in that homework.<br />(follow-up questions didn't can't the course grade,<br />but i still recommended you to do if you have time",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Lq9fPLseKqm5q1uDp7EIMpJ3yeZfJB29",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 608,
                    "name": "LEUNG, Pak Wo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Physics Noob",
            "date": "Dec 18, 2021",
            "title": "Good course if you want to challenge yourself (I Love Pak Wo)",
            "comment_content": "Basically the same as PHYS1112<br />But some more difficult examples are added to the lecture notes<br />Also, the examples in tutorials are more difficult.<br />Before midterm:<br />Dimensional Analysis, Newton's Laws, Work and Energy, Momentum, Rotation Kinematics, Angular Momentum<br />After midterm:<br />Gravitation, Simple Harmonic Motion, Wave, Ideal Gas Law and Kinetic Theory, First and Second Law of Thermodynamics (Entropy is introduced but not examined)<br /><br />P.S. The homework is done online via MasteringPhysics platform by Pearson, and you have to pay ~HK$300-400 for the textbooks to get access. Same for PHYS1112.",
            "comment_teaching": "Prof. Leung teaches very well.<br />He explains things very well. I really feels that I have better understanding to physics, on how do I interpret the physics laws, to how I can deal with physics problems. He said in the first lecture that he would like to teach us how scientists think, and I think he actually accomplished that.<br />Also, he is very funny during the lecture. He often said &quot;you and your very important half&quot; when describing a physical system, and he often said &quot;kindergarten stuff&quot;.<br />Moreover he sometimes do experiments in class.<br /><br />For tutorial, each time 2 questions are given. You just do it in class, and the TA will explain how to solve it later. The TA is OK. You should be able to understand most of his explanations (except for some ridiculously hard questions).",
            "comment_grading": "If you want good grades, go PHYS1112<br />There is no LQ in 1112, and you don't need to prepare yourselves for LQ.<br /><br />Homework: 15%<br />Midterm: 40%<br />Final: 45%<br /><br />Homework are OK, a few of them are quite difficult. <br />For normal questions(you need to type your own answers, either numerical or an expression, as specified by the questions), you have 5 attempts for each part. 3% of the score is deducted for each wrong answer. For MC, 1/n mark is deducted for MC of n choices. Just make sure you can get it right within 5 attempts and you should be fine.<br />The mean score of each HW is about 80%-90%.<br />(Sometimes the system mark your answer wrongly, simply report it to the professor on canvas and you won't lose score)<br /><br />Midterm:<br />2 hours<br />10 MC from PHYS1112 midterm, 2 marks per MC.<br />And 4 long questions, which carries 30 marks in total.<br />Quite Challenging to do<br />MC: Mean: 17.06/20&nbsp;&nbsp;SD: 3.26 Highest: 20/20<br />LQ: Mean: 16.35/30&nbsp;&nbsp;SD: 7.91 Highest: 30/30<br />Total: Mean: 33.41/50 SD: 10.19 Highest: 50/50<br /><br />Final:<br />Only cover things after midterm (of course you need some knowledge before midterm, such as angular momentum)<br />3 hours<br />20 MC from PHYS1112 final, 2 marks per MC.<br />4 long Questions, 15 points each.<br />More challenging than midterm. Many people I know cannot finish the whole exam paper.<br />MC: Mean: 29.9/40&nbsp;&nbsp;SD: 5.5 Highest: 40/40<br />LQ: Mean: 25,8/60&nbsp;&nbsp;SD: 14.1 Highest: 59/60<br />Total: Mean: 55.7/100 SD: 17.9 Highest: 97/100<br /><br />You can compare the MC results with PHYS1112 to know what is the difference between 1112 and 1312 students.<br />(Midterm Mean: 10.9/24 vs 17.06/20)<br />(Final Mean: 17.26/40 vs 29.9/40)<br /><br />HW: &gt;90%<br />Midterm: 42/50<br />Final: 97/100<br />Grade: A+",
            "comment_workload": "One homework per week, 9-14 questions per week.<br />10 homework in total, with no HW in first week and the week during midterm. Also, there is an optional HW11 for you to do revision.<br />They are the difficult questions from the textbook, with given quantities randomly generated. Technically you can find the answers online, but it is meaningless to do so. If you just want good grade, just go back to PHYS1112. PHYS1312 is for you to challenge yourself. Getting good grade in PHYS1112 should be easier. There is no LQ in 1112, and you don't need to prepare yourselves for LQ.<br />Also, if you never really do those homework, you will no nothing and easily fuck up in exams.<br />I have never record how long I took to do them, but you need to expect you need at least 3-4 hours per week unless you are very talented. If you are not good in physics, you might need more. I would recommend you to plan your time and don't try to do them all within one day.<br />Each homework will be released 2 weeks before the deadline.<br /><br />For tutorials, no attendance is needed. You might do the questions at home and read the solutions by yourselves, or even not do them. Not much workload. Again, not doing any exercise at all will make you fuck up in exams. In fact, one question appeared in final exam is similar to a tutorial question.<br /><br />Another main source of workload is to do revision for exams, which could be quite exhausting.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pxFGzqI2ceeRn5I1TASrKqH2rQjWi1i9",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "iwantarange",
            "date": "Dec 27, 2017",
            "title": "A very good physics course",
            "comment_content": "Covering basic newtonian mechanics, waves and thermodynamics. A more in-depth version when compared to PHYS1112, with more use in calculus to explain some physics concepts or calculations.",
            "comment_teaching": "Professor Chan is one of the best instructor I have met in HKUST. He explains all physics concepts very clearly, and he has some written lecture slides which assist his teaching. It is easy for students to revise after lecture if we cannot catch up any parts of the lecture. He is also willing to answer any questions that you have regarding the course content.<br />It is also worth-mentioning that he does many interesting demos himself and he holds the tutorial himself, which shows his enthusiasm in teaching.",
            "comment_grading": "While most of the students in this class are very good in physics, the grades given out is not too bad. According to experience, getting mean will lead to an A-. However, if you are aiming for A+ in this course, you need to compete with the best students in this class, including some physics olympiad medalists.<br />Midterm: above ~1SD<br />Final exam: above ~0.8SD<br />Grade: A<br />The questions in midterm and final exam may have some similarities with the homework problems, so revising the homework problems helps a lot with your exams. Of course, the difficulty of questions in exams are higher.",
            "comment_workload": "Masteringphysics questions and written homeworks are required for each week. While masteringphysics questions should not be a big problem for most students in this class, written homeworks occasionally require time and effort to complete as some of the problems are quite hard. However, being an honors course, the workload is lower than other year 1 honors course (for example, MATH1023).",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "dZVjM8J6ZDFfimagNTMlOwTdcY0lbgpX",
                    "name": "PHYS1312 final exam histogram",
                    "format": "jpg"
                },
                {
                    "key": "SyUn580nJydRStTvHdncK7VZgXk5YNOF",
                    "name": "PHYS1312 midterm histogram",
                    "format": "jpg"
                }
            ]
        },
        {
            "hash": "aa54oj5oNMcaJ2429GQAaSp441TQhFAF",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 608,
                    "name": "LEUNG, Pak Wo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gakusei123",
            "date": "Jan 28, 2022",
            "title": "Interesting Course",
            "comment_content": "Normal PHYS1112 stuff (Mechanics and Thermodynamics) with<br />- challenging questions in Lecture Notes<br />- challenging questions in Tutorial (that you're supposed to learn/know how to do)<br />- interesting applications of these physics principles in real life<br />- advanced problem-solving techniques (e.g. use calculus/change reference frames/setting up equations etc.)<br />- more fun!",
            "comment_teaching": "I LOVE LEUNG PAK WO<br />He's like putting up a physics show every lecture, he teaches us as if he's telling us a story (very, very clear logical progression), entertaining us with jokes and stuff, jumping around, always wears a smile on his face and says &quot;don't you think it's beautiful?&quot; Sometimes we would even applaud at the end of the lecture.<br /><br />His explanations are crystal clear. In particular, the difficult challenging examples unique to PHYS1312 are all explained in great detail and they became easy to understand under his interpretation. He also gives some practical examples. One of the ones I liked most is when he talked about melting icebergs. When they melt, the water level shouldn't rise, but then why is climate change causing a rise in sea level? I'll leave it to you to discover the answer.",
            "comment_grading": "It's good to you if you can manage your work.<br /><br />Homework\t15% (I got ~14%)<br />(Btw you only get 3% deducted per wrong attempt<br />I think it's 6% in PHYS1112)<br />Midterm\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;40% (I got 48/50)<br />10MCQ, 4LQ<br />Final Exam\t45% (I got 77/100)<br />20MCQ (40%), 4LQ (60%)<br /><br />Ultimately I got A+. Fair enough.",
            "comment_workload": "To me it was fine (cuz I have experience in Physics Olympiads). But to others, it may take a lot of time to do homework because they are exceptionally difficult. Also, tutorial questions are extremely challenging, and to an inexperienced learner, these questions will cost them quite a bit of time to understand.<br /><br />However, don't be afraid. Leung and the TA will both answer your question, and you'll learn much more than the normal course. Physics is fun! (I'm sleepy)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "A3BUi1iqNaAn5jAMLNxbTif08JLbqm3u",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bill_",
            "date": "Feb 28, 2020",
            "title": "",
            "comment_content": "The content is the same as PHYS 1112, but much harder. Problem-solving skill is important.<br />Topics:<br />- Motion in 2D<br />- Newton's Law<br />- Kinetic and potential energy<br />- Momentum<br />- Dynamics of the rigid body, angular Momentum<br />- Gravitation<br />- Periodic motion<br />- Temperature, heat and the thermal properties of matter<br />- Basic thermodynamics",
            "comment_teaching": "Pleasant experience.<br />Chan is a very good professor. He writes all the notes on an iPad, and he proves almost every theorem we meet. He doesn't just tell you the conclusion, but also how to reason.<br />His demos in class are also interesting, like using a spinning bicycle wheel to demonstrate the effect of angular momentum.<br />He uses tutorials to teach, so make sure you join all of them.",
            "comment_grading": "Pretty good, the mean score will get you an A -. Getting A+ may be difficult, though. <br />Midterm: 0.5~1.0 SD above mean<br />Final: less than 0.5 SD above mean<br />Overall: A",
            "comment_workload": "Heavier than other courses in Year 1, but still acceptable. There are written homework (usually two questions) and online homework every week. The written part is more tricky, and it would be easier if you find good companions.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WsTSlNvf50ZuW7hqLzqbE7Y6e7KsQJD6",
            "semester": "2015-16 Fall",
            "instructors": [],
            "is_author": false,
            "author": "wang",
            "date": "Jan 29, 2016",
            "title": "great course for physics learning",
            "comment_content": "Contents nearly all the knowledge in the high school physics competition.Also very useful for those physics learners.It can make such a fundamental knowledge level and help to grab further ones.",
            "comment_teaching": "Students may clearly know what prof. are saying, though,actually, sometimes the conditions may not classified so clearly.",
            "comment_grading": "Um.I can only say it's not bad.Because the students taking part in are almost the best ones in physics,so that they deserved the grades.For normal ones, it not so difficult to get an A range score (maybe the average level)",
            "comment_workload": "Maybe not so hard for the ones who had been familiar with physics.But for those at average level, it can still take a while to fit in the fast pace and difficult knowledge.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ri7Kyn0uvY7KS2LB0pM6zguzsMXEZmit",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": ":):):):)",
            "date": "Dec 25, 2015",
            "title": "",
            "comment_content": "比phys1112深好多，需要好多calculus，基本的double integral都有。phys1112考試全mc, 1312就一半mc一半long question，mc題目都有重疊。好像說是1312取了1112mc卷最難的題目。（1112 跟1312是同一考場一起考的）",
            "comment_teaching": "prof. chan 教得很好，又會上課特意辦認一下我們的名字，叫我們答問題。所以，一不小心就會留下了壞印象了。",
            "comment_grading": "考前一天才開始學的，結果當然很差，below mean了，但最後都有b+。",
            "comment_workload": "一份功課都需要做好久，不過認真學習會獲益無窮。",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TFLEiCLHIjXugKgLGYBW73BrJx3iog2b",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 608,
                    "name": "LEUNG, Pak Wo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pluto12138",
            "date": "Dec 26, 2022",
            "title": "SURVIVAL GUIDE for common students in an Honour Course",
            "comment_content": "A starting point for the study of general physics. The framework and major topics are pretty much the same as PHYS1112, but it contains more mathematical induction, reasoning, and some more complex physics models. Key topics include:<br />motions and Newton’s Laws, pseudo force,<br />change of framework, Coriolis force in rotating frame of reference (only mentioned, without mathematical reasoning)，<br />work and energy,<br />conservation of energy and momentum,<br />rotation, rigid body (important; accounted for many midterm and final scores),<br />gravity and celestial motion (mainly concepts, limited discussion into mathematical details of orbits and so on),<br />simple harmonic motion,<br />damped oscillations, forced oscillations, resonance (again, only concepts, not too much mathematical analysis),<br />standing waves and sound waves,<br />kinetic theory and the laws of thermodynamics,<br />Entropy and heat machines.<br /> <br />Continuum mechanics, though it appears in the textbook, is not discussed in this semester’s lectures.<br /> <br />Calculus is used in many sections of the course, but only for basic things like integrating, approximating, and solving very simple differential equations. People aren’t expected to tackle complex integration or compute higher order differential equations. Applying simple things dextrously is the true problem here.",
            "comment_teaching": "Prof. Leung is a good instructor. He is passionate and humorous in the classes and gives detailed discussion and proof for the class contents. You and your &quot;loved one&quot; will suffer a lot from his examples, lol. If he thinks some of the points are not adequately discussed in the lecture, he will make supplement videos for people to watch, though these are optional. He is also very willing to answer students’ questions after class, and you can find him during his office hours.<br /> <br />Tutorial attendance is strongly recommended (ignore this if you are an IPHO medalist). It introduces some problem-solving techniques that are not necessarily included in the classes. It will give you a taste of utilising calculus dexterously and equip you with some skills that are important for the exam.",
            "comment_grading": "The grading is pretty good. Very wide A and A+ range.<br />15% homework (via Pearson Mastering Physics, must pay ~300$ HKD for the access, discuss later)<br />40% midterm.<br />45% final.<br /> <br />In this semester, the content of the midterm and final do not overlap (which is why the midterm takes up a large proportion of the grading scheme, do take it seriously). Chapters covered in the middle won’t be tested explicitly in the final, though some of that knowledge will be used in some sections of the questions.<br /> <br />There will be a 3% deduction for each wrong attempt in the homework, and you will lose access to the problem if you input the wrong answer six times or press the &quot;request an answer&quot; button.<br />So, try not to guess the answer and treat each attempt carefully. Many students get ~14%+ for their homework.<br /> <br />There are some very talented students from Hong Kong, the Mainland, and other parts of the world in the class. Some of them have general physics training from their high school or may even have IPHO, ICHO experience. It can be tough to get into the top notch of the class.<br /> <br />But the grading scheme is very generous. I think I eventually ranked only ~8-9 in the class of 65, but I still somehow managed to get an A+. It is said that getting above the mean will ensure people an A range grade, and the worst possible grade, if you attended the exams, will be a B-. Fair (and generous) enough.",
            "comment_workload": "Not too heavy but are from easy. Your weekly routine includes:<br />A ~10 question homework, including 1-2 challenging questions. ~2-3 hours if you understand most of the content.<br />A tutorial with 2–3 questions, one or two of which may be hard,<br />Two lectures, with RVC recordings available.<br /> <br />The difficulty of the exams, especially the long questions, is close to the hard questions in homework and tutorials. The bad thing here is that you don’t have many past papers to work on (like 1112). People may find themselves ill-prepared for the long questions due to a lack of exercise and some conceptual multiple-choice problems, that are not emphasised in the assignments. Therefore, it is a good idea to go through lecture notes carefully before exams and make good use of homework and tutorials.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AvvJuLxxkl8MGEcAJShlKetfLUMHUMm0",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 608,
                    "name": "LEUNG, Pak Wo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "humanppplus",
            "date": "Dec 23, 2022",
            "title": "Very fruitful course",
            "comment_content": "Good content, but too much engineering stuff in my opinion (as a pure science student)<br /><br />Mechanics<br />- Projectile Motion<br />- Relative Motion<br />- Newton's Laws<br />- Circular Motion<br />- Work-Energy Theorem<br />- Conservative Forces<br />- Momentum-Impulse Theorem<br />- Elastic Collision<br />- Centre of Mass<br />- Rotational Motion<br />- Gravitation<br />- Kepler's Laws<br />- Simple Harmonic Motion<br />- Damped Oscillation<br />- Resonance<br />- Reflection<br />- Standing Wave<br />- Doppler's Effect<br /><br />Thermodynamics / Gases<br />- Thermal Expansion<br />- Heat Capacity / Latent Heat<br />- Heat Transfer<br />- Kinetic Theory of Gases<br />- Molecular Speed Distribution<br />- Laws of Thermodynamics<br />- Adiabatic / Isothermal / Isochoric / Isobaric Processes<br />- Otto / Carnot Cycle<br />- Heat Engine / Heat pump / Refrigerators<br />- Reversible / Non-Reversible Processes<br />- Entropy",
            "comment_teaching": "Very good teaching! Pak Wo is a friendly professor who likes to tell jokes on classes. The atmosphere is very relaxing and fun. Sometimes he does demonstrations / experiments on class, like once he brought a stick with a fishball (to demonstrate moment of inertia? i forgor💀)",
            "comment_grading": "Definitely take this course if possible, very very good grade.<br /><br />Grading<br />Homework 15%<br />Midterm Exam 40%<br />Final Exam 45%<br /><br />Most people get &gt;95% on every homework.<br /><br />Midterm data<br />MC Total: 20, Mean: 14.81, Median: 16<br />LQ Total: 30, Mean: 13.41, Median: 12<br />Total: 50, Mean: 28.22, Median: 27, Max: 50, Min: 6, UQ: 35.5, LQ: 20, SD: 10.8<br /><br />Final data<br />MC Total: 40, Mean: 27.2, Median: 28<br />LQ Total: 60, Mean: 31.81, Median: 34<br />Total: 100, Mean: 59.87, Median: 61, Max: 96, Min: 8, UQ: 76, LQ: 47.5, SD: 19.9<br /><br />At last I get ~98.5% on Homework, 31/50 on Midterm, 79/100 on Final, and ate an A.",
            "comment_workload": "The workload itself is not heavy, but they require you to purchase the license of MasteringPhysics (The textbook's publisher), which is like &gt;$350. The system is on9, sometimes the answers for two parts are mixed up and you would be so helpless when you can't get the &quot;correct answer&quot; after 6 tries (the max. amount of tries). Sometimes the answer has the wrong sign and you lose 3% for that part for literally no reasons.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CIW44dIC2ZMiftlBEDPEY039Zd7I1fNM",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 608,
                    "name": "LEUNG, Pak Wo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Assylbek",
            "date": "Jan 27, 2022",
            "title": "If you are not an olympiad level physicist, don't take it",
            "comment_content": "Everything covered in this course, is basically high school material, but in more depth. But homework and exams are disproportinately harder, than you would expect from high-school. I don't understand how you can score above B.<br /><br />So even if you got a good grade in A level physics, don't expect to do well here, if you are not a physics olympian as least of a national scale.",
            "comment_teaching": "Prof. Leung is a great and enthusiastic lecturer. It was a pleasure to listen to him, but because everyone in the class is expected to be so advanced, he goes over the material very quickly.",
            "comment_grading": "I did almost every homework, listened to every lecture, but apparantly that's not enough. I got less than half the points for the final exam and got C+ in the end.",
            "comment_workload": "Extreme. If not for this course I would have breezed through the semester, but no, I had to challenge myself, and suffer as a result of actions. All my weekends from dusk to dawn were basically physics. And for what?",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SZHyXoBGZIAUNEkYjVdX9HNSs6nEojGk",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 608,
                    "name": "LEUNG, Pak Wo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "adounope",
            "date": "Jan 22, 2022",
            "title": "very good course to challenge yourself",
            "comment_content": "its teaching material is not much different from PHYS1112<br />but with more detailed material on topics like harmonic motion.<br /><br />the problems in tutorial may look difficult, but calm down, and you will see TAs solving it quite easily<br /><br />also, the pulley questions at beginning of the course are quite complicated, but very interesting<br /><br />they have pulleys that hang on another pulley!!!",
            "comment_teaching": "Leung pak wo is a quite funny guy, he always joke about we learnt calculus in kindergarden, and study taylor series in primary school.<br /><br />the lecture notes are well written, and he is willing to answer any questions after lecture and on canvas(even if those questions may sound stupid)<br /><br />Leung will upload lecture note quite on time, such that you can always find the lecture notes on canvas few days before the lecture.<br /><br />I highly recommand reading the lecture notes before lecture, so when some genius asking weird questions on lecture, you can understand whats going on.",
            "comment_grading": "unlike in 1112, mid term and exams in 1312 have both long questions(longQ) and multiple choice(MC)<br /><br />grading is quite transparent, professor will give a time peroid for student to check their exam paper after marking, to make sure the final score is fair <br /><br />some questions in final exam can freak you out(both longQ and MC), but dont spend too much time on either one,<br /><br />in final,<br />MC make up 40%(40 questions, each 1%), long question 60%(4 questions, each 15%)<br />final exam duration is 3 hour.<br /><br />I spent 2 hours purely doing MC, and realise MC just account for 40%....oof<br /><br />I have only completed just 1 long question, after the exam, you walk out of the exam center, and feel like 人生失敗(your life is a total failure)<br /><br />midterm MC(mean:17.06/20, SD:3.26)<br />midterm longQ(mean:16.35/30, SD:7.91)<br />entire midterm(mean:33.41/50, SD:10.19)<br /><br />final MC(mean:29.9/40, SD:5.5)<br />final longQ(mean:25.8/60, SD:14.1)<br />entire final(mean:55.7/100, SD:17.9)<br /><br />I get 40/50 in mid term, and 58/100 in final, some how I still get an A",
            "comment_workload": "most workload come from canvas web work, others not much.<br /><br />occastionally, some questions in canvas can take you hours to solve, and if you solve a single question with more than 2 hours, I recommand you to find physics help desk in SCI HOME<br /><br />I am not sure if it is more heavier than PHYS 1112",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H8OCZK4gMLeODY9E9r6zU5ZU5psV4SxO",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 608,
                    "name": "LEUNG, Pak Wo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gnohisuxzz",
            "date": "Jan 14, 2022",
            "title": "Short Review Summary",
            "comment_content": "Text Book<br />University Physics Volume 1 Ch 1-20 W/MasteringPhysics, Edition 15<br />Author: Hugh D Young&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />Publisher: Pearson&nbsp;&nbsp;<br /><br />Intended Learning Outcomes:<br />On successful completion of this course, students are expected to be able to:<br /><br />1.Use Newton's laws of motion to solve simple dynamics problems.<br />2.Use the principles of conservation of energy and momentum to solve simple dynamics problems and problems with rotational motion, and explain common physical phenomena.<br />3.Explain physical phenomena unique to waves such as superposition, interference, formulation of standing waves, resonance, beats and Doppler effects.<br />4.Use kinetic theory to explain the properties of gases.<br />5.Use the first and second laws of thermodynamics to solve problems involving ideal gases.<br />6.Use scientific language to explain phenomena in the physical world.<br />7.Use calculus to analyze and solve physical problems.<br /><br />Lectures<br />01 Physical quantities, vectors and 2D motion<br />02 Newton's laws of motion I<br />03 Newton's laws of motion II<br />04 Work and kinetic energy<br />05 Potential energy and conservation of energy<br />06 Momentum, impulse and collision I<br />07 Momentum, impulse and collision II<br />08 Dynamics of rigid bodies I<br />09 Dynamics of rigid bodies II<br />10 Dynamics of rigid bodies III<br />11 Angular momentum<br />12 Gravitation I<br />13 Gravitation II<br />14 Periodic motion I<br />15 Periodic motion II<br />16 Wave motion and sound I<br />17 Wave motion and sound II<br />18 Temperature and heat<br />19 Thermal properties of matter I<br />20 Thermal properties of matter II<br />21 First law of thermodynamics I<br />22 First law of thermodynamics II<br />23 Second law of thermodynamics I<br />24 Second law of thermodynamics II",
            "comment_teaching": "Prof. LEUNG, Pak Wo is a humorous as well as professional teacher. He explains the concepts in a vivid way and derives the formulas detailedly. Some experiments will also be presented to make students better understand the knowledge.",
            "comment_grading": "The grade would rely on the assignments, the mid-term exam as well as the final exam. The percentages of each part are unknown. Since it is an honor version of general physics I, most students would get a grade above B and even A if they spare no effort to learn this course.",
            "comment_workload": "There will be an assignment for 2 or 3 lectures. Each assignment has about 10 problems. Usually it takes 2-3 hours to finish all of them. Some problems would be easy to solve while some are a little bit difficult. Discussing the problems you can't solve with your classmates might help a lot.<br />If you want to master the knowledge of general physics I, you may spend more time handling the concepts and formulas on your own.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rQtFbJqeipR9fvXfyBV9PvAlyJN6vyVi",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 608,
                    "name": "LEUNG, Pak Wo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sarah0501",
            "date": "Jan 03, 2022",
            "title": "",
            "comment_content": "The course covers some basic information about dynamics(3/4) and thermology(1/4). A little simple but very practical.",
            "comment_teaching": "LEUNG, Pak Wo is really a nice guy and very good at teaching. His classes are always interesting and he can make abstract knowledge representational.",
            "comment_grading": "As honor general physics, most students got good grades. About mean scores means A range.",
            "comment_workload": "On average, there is one homework about ten questions a week. Understanding the knowledge also take a little time after class but won't take too much. Generally, spending about 3 to 4 hours a week and a little more time before the examination will guarantee a good grade.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ntrKOutfjixqL1rlqK6YEPtjSKrJGLjK",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 608,
                    "name": "LEUNG, Pak Wo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ccccccc",
            "date": "Dec 30, 2021",
            "title": "good course",
            "comment_content": "The content is very good. I talked about mechanics.<br />This course is a more in-depth version of PHYS 1112. It is intended to provide a solid foundation to students who wish to take more advanced physics courses in the future.<br /> <br />Motions and Newton's laws<br />Work and energy<br />Conservation of energy and momentum<br />Rotation<br />Rigid body<br />Simple harmonic and damped oscillations<br />Forced oscillations<br />Standing waves and sound waves<br />Kinetic theory<br />The laws of thermodynamics",
            "comment_teaching": "He is a very good teacher. He will teach us a lot of knowledge, and others are very good.",
            "comment_grading": "nice",
            "comment_workload": "great",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dngmDu5jbJ7AZ6sIWfeYjD03rLYpU6JN",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 607,
                    "name": "JO, Gyu Boong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ray-_-",
            "date": "Feb 02, 2021",
            "title": "Very good professor",
            "comment_content": "The course is at an extremely fast pace, the content is very rich and a lot of concepts need to be digested. It mainly goes through the things you have learnt in Secondary school or High school with a deeper concept and calculation. It also touched on Thermodynamics which you may not have learnt.<br />The content mainly focuses on:<br />1) Units, Physical Quantities, and Vectors.<br />2) Motion Along&nbsp;&nbsp;a Straight Line<br />3) Motion in Two or Three Dimensions<br />4) Newton's Laws of Motion<br />5) Applying Newton's Law<br />6) Work and Kinetic Energy<br />7) Potential Energy and Energy Conservation<br />8) Momentum, Impulse, and Collisions<br />9) Rotation of Rigid Bodies<br />10) Dynamics of Rotation Motion<br />11) Gravitation<br />12) Periodic motion<br />13) Mechanical Waves<br />14) Sound and Hearing<br />15) Temperature and Heat<br />16) Thermal Properties of Matter<br />17) The First Law of Thermodynamics<br />18) The Second Law of Thermodynamics",
            "comment_teaching": "One of the best Professors in this sem.<br />Prof. JO is very good at teaching, he does not use any PowerPoint in his class and directly wrote the virtual blackboard.<br />His accent is clear, he cares for his students and welcomes any questions.",
            "comment_grading": "The exam is not that hard as I expected and makes sense.<br />The grading is generous compared to other courses, I think if you get mean on everything, you would probably get something like b+ or something.",
            "comment_workload": "Extremely heavy, I have to revise for at least 5 more hours every week for the new concepts and extra challenging HW, mastering physics is only a cup of tea compared to the challenging homework. <br /><br />I have to do extra materials (Cambridge reference book) to have better concepts and a better understanding of the unfamiliar topics.<br /><br />I have devoted at least 7 days, studying 12 hours a day for the exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "jHKRpv3v4BHQhHYCB7NPC4HgcCTmvHjf",
                    "name": "Kleppner D., Kolenkow R. - An Introduction to Mechanics-CUP (2013)",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "7QdBn17AujTY42g6AKY7OG3FRld6vKLU",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 607,
                    "name": "JO, Gyu Boong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anacreon",
            "date": "Jan 05, 2021",
            "title": "",
            "comment_content": "I think the content is ok. STRONGLY suggest to learn some basic calculus before. (differentiate, integrate, and you'll find it useful to have some knowledge about solving differential equations)<br />Classmates asked many interesting questions. Really learnt a lot .",
            "comment_teaching": "f2f is good! Professor was very patient.<br />However, online mode is not that satisfactory. I need to spend many time later on in order to better digest.",
            "comment_grading": "I think my grade is reasonable because I didn't do well in my final exam. <br />However, I got nearly full marks or full marks in all the assignments and midterm exam.<br />B+",
            "comment_workload": "It depends. If you are dedicated to physics, you might find the workload very heavy. <br />It's not very time-consuming to finish the homework if you're familiar with basic concepts and are clear about how to use them.<br />However, if you want to understand the concepts well, you need to look for many reference resources. This might be EXTREMELY time-consuming somehow...",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QNvGBSKNdPzxDvZa7w8wr7x15O0DvrRp",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tdhvl",
            "date": "Sep 07, 2019",
            "title": "",
            "comment_content": "Like PHYS 1112, this course covers simple topics in classical mechanics and thermodynamics but focus more on problem solving and requires a certain background in Calculus. If you have participated in some Physics Olympiads in High School, then the materials in this course should not be difficult for you and probably you will have already known them before. If not, then the content should be rewarding for you if you work hard.<br />Professor Chan has mentioned at the beginning that this course is only suitable for those who are interested in challenging themselves or have a passion of solving hard exercises instead of an easy student life. If you are not, then you should consider taking PHYS 1112.<br />If you are a non-local student, you will have to submit a Requisites Waiver and come to the first lecture to fill the sign up sheet. After that, Prof. Chan will waive the requisites for you.",
            "comment_teaching": "In my opinion, Prof. Chan is very dedicated. Besides PowerPoint slides, he writes his own notes during the lectures and explain carefully the example and the exercises. He also performs many experiments during the lectures to demonstrate the contents that he just taught. In each class, there are some iPRS questions to test the understanding of the students, but it is not used for grading purpose.<br />Prof. Chan also spend time to answer the students' questions after the lectures.",
            "comment_grading": "You will be graded according to your performance in Homework, Midterm and Final exams. The grading scheme is:<br />Homework 15%<br />Midterm 35%<br />Finals 50% <br />Like other Honors courses, many people get good grades since they are all talented. The percentage of A-range grades are better than PHYS 1112. However, if you want to get an A+, you will have to compete with some extremely smart students. Some of them may be even IPhO medalists. Usually, about 5-10 people get the A+ grades if they performed very well in this course.",
            "comment_workload": "The workload is heavy. There is a written assignment each week that you have to solve some long problems and it takes much time. Also, the homework includes online exercises through MasteringPhysics. These exercises were taken from the textbook. Therefore, they are easier compared to the written one, you just have to compute carefully.<br />However, if you have participated in Physics Olympiads, then the workload of this course should not be heavy for you. Since Prof. Chan does not take attendance, you can even skip the classes and only come to the lecture to submit your written homework if you are self-confident enough.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "V71RhEohFcPHOaAD5M28UTBgpfq9T2Xn",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Fpn",
            "date": "Jan 24, 2019",
            "title": "Honors General Physics I",
            "comment_content": "Phys 1312 is a thorough version of Phys 1112. If you want to learn deeper than Phys 1112, this class is the right choice for you. The powerpoint slides are almost the same as in Phys 1112, but the instructor explains a bit more.",
            "comment_teaching": "The instructor and TA are both really kind and helpful. The teaching is great, the instructor performs interesting experiment each week related to the topic in front of the class. He tried to make the topic not to be boring. Non-graded IPRS quizzes also tests our understanding. During the tutorial class, he explained about physics problems that might be found in the upcoming homework (almost similar idea).",
            "comment_grading": "The percentage to get A or A+ is much greater than it is in Phys 1112 (Phys 1312 is also bell-curved). However, a lot of mainland students and students that have experience with physics olympiad are in this class. So make sure you're ready if you enroll in this course.",
            "comment_workload": "We have Masteringphysics homework (online) which is also taken by students in Phys 1112. But we are also given written homework of about 1-3 essay problems per week. But don't worry if you have enough math skills and if you come to each lecture and tutorial.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nEwXmWPuOG3aS9ajX0pcJuVm9u5A5K9j",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "trash",
            "date": "Jan 19, 2019",
            "title": "",
            "comment_content": "The content includes mechanics, wave motion and a bit heat and gases.<br /><br />Some overlap with the HKDSE syllabus, but most of the syllabus is quite new to a normal local student. The homework and teaching notes are quite difficult.",
            "comment_teaching": "His voice is not attractive, though it is quite clear.<br /><br />He likes to do demonstrations during class. Quite interesting",
            "comment_grading": "above mean &lt;1 SD = A-<br /><br />He is being very lenient.<br /><br />However, most of the time you will compete with NDS, which are very great in Physics.",
            "comment_workload": "Heavy af, hw every week<br /><br />But it is a good practice for students who are not self motivated.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gs7hnM6GKFCMsG0M5yU22CWwljMKHduB",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Stefan",
            "date": "Jan 10, 2019",
            "title": "",
            "comment_content": "The overall content of this course is good. It covers the basics of physics. Basically, it is a more in-depth version of high school physics (mechanics and thermodynamics). Remember to study hard for the midterm and final exam because it wouldn't be so easy.",
            "comment_teaching": "In my opinion, the professor explains everything clearly but the pacing is a bit too fast in my opinion. Sometimes the pacing is a bit too fast, but still fine. The professor mainly uses powerpoint ppt and writes the equations uring his tablet.",
            "comment_grading": "Because this course is curved, be careful if you don't have any background in physics. There are a lot of mainland students and physics olympiad medalist. I ended up with a good grade, so I think the grading is good. The instructor will explain the grading in the first lecture, so make sure to come to the first class if you want to take this course.",
            "comment_workload": "The workload is fine. Two essay problems every week and mastering physics homework (online). Actually, I don't really like mastering physics because we need to buy the physical book. Everything you need for the homework will be explained during the lecture, so the book is not so useful in fact.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "26zDMUORq1KGlgoTPSV8h2Ah5aGNwyge",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "7K",
            "date": "Dec 27, 2018",
            "title": "好grade course",
            "comment_content": "This course is a more in-depth version of PHYS 1112. It is intended to provide a solid foundation to students who wish to take more advanced physics courses in the future. Key topics include motions and Newton’s Laws, work and energy, conservation of energy and momentum, rotation, rigid body, simple harmonic and damped oscillations, forced oscillations, standing waves and sound waves, kinetic theory and the laws of thermodynamics. Students without the prerequisite may seek instructor’s approval for enrolling in the course. For students under the 4-year degree only.<br />同1112content上無分別",
            "comment_teaching": "一般, 手寫notes都幾核突, 上堂照 notes讀, tutorial notes 好L重要, 堂可以走, 但tutor 吾建議",
            "comment_grading": "好L好grade, midterm 25/35(below ~0.5 sd), final 40/50 (above 0.5sd) 都有A-, cutoff應該系mean<br />Midterm mean:27.3/35 final:37.3/50<br />assignment=15%, 5%written, 10%mastering physics, written幾難下<br />mastering phy 吾識就穩source",
            "comment_workload": "幾大下, ~2.5x 正常course workload, 功課幾chur下, 利申靠source",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "paKnoIsyE5JB7COa4doaLMBz1ZhjjB7w",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Andy Chen",
            "date": "Aug 23, 2018",
            "title": "",
            "comment_content": "As a general physics course, the content is basically about general physics, introducing from fundamental units to thermodynamics. If you are not familiar with topics included in general physics, just randomly pick up a textbook and read the catalog, which will help you to get a more concrete picture.<br />However, instead of topics going to be taught, the more important thing is how deep the professor will dig into these topics and how hard it will eventually become since this is an &quot;Honor&quot; course. Here I can boldly tell you, it is only a little bit harder than the textbook used in class, which is written by Young and Freedman. Still, one need to consider two things before taking this course. First, the professor quite focuses on the proof of physics laws in comparison with other courses. Second, the exams are actually even harder than the content taught in class. In fact, the difficulty of exams is similar to that of weekly hand-written assignments.",
            "comment_teaching": "CHAN, Ho Bun is a great instructor. Fluent English. Clear presentation. However, the thing I admire him the most is that he not only tells you results but explains the reasons behind them. If he does some trick to solve the problem or to prove some physics law, he will try to tell you why this trick works and the intention of it. This is quite uncommon among other instructors but so important since it prevents one from memorizing the steps. Instead, it helps one to develop one's thinking.",
            "comment_grading": "The grading is fair.<br />Homework 15%. Midterm 35%. Final 50%.<br />If your grade is above mean, you get at least A-.<br />Probably the top 5 to 10 students will get A+, which I am not sure. However, I ranked about 10 in the midterm and about 5 in the final, at last getting A+.",
            "comment_workload": "The workload is quite heavy.<br />Two assignments every week. One is the web homework and the other is hand-written. The web homework is easier but annoying sometimes since the numbers are complicated even though you can use a calculator. The hand-written one is harder and it is usually composed of two problems. Sometimes you need to prove something. Process is required.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uoVRQVIY8nDMclqzQ4g0zz0iqxV4s2Ow",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "twinkle",
            "date": "Apr 28, 2018",
            "title": "a foundation course for research in physics",
            "comment_content": "1_Physical Quantities, dimensional analysis and Vectors <br />2_Motion in 2D<br />3_Newton's Laws of Motion<br />4_Work and Kinetic Energy<br />5_Potential Energy &amp; Energy Conservation<br />6_Momentum, Impulse and Collision<br />7_Dynamics of Rigid Bodies<br />8_Angular Momentum<br />9_Gravitation<br />10_Periodic Motion<br />11_Wave Motion and Sound<br />12_Temperature and Heat<br />13_Thermal Properties of Matter<br />14_First Law of Thermodynamics<br />15_Second Law of Thermodynamics",
            "comment_teaching": "Acceptable, but sometimes his explanation does not make sense. Then you have to study the relevant content by yourself and search for some other materials. The professor will give some written notes each class for a supplement of his lecture notes. Since his handwriting is not good, you really need to concentrate in each class in order to understand what he wrote... Tutorials are necessary as he will also give lectures in the tutorials.",
            "comment_grading": "Good grade. The statistics he provided in the first lecture showed that about 50% of the students can get A range and most of the rest can get B range. You can get a decent grade as long as you make some effort after class. But A+ is relatively difficult since there are many students who have learned something about physics competition before. Of course, if you are one of them, then A+ may be not that difficult for you.<br />Grading scheme: 15%Homework+35%Midterm+50%final<br />Me: homework 14.5/15<br />midterm above mean ~0.4 sd<br />final above mean ~1 sd<br />Finally got A. I think the grading is really good!",
            "comment_workload": "A little bit heavy. There were both online homework in masteringphysics and written homework containing 2 or 3 long questions. The online homework was relatively easy since it just helped you understand the concepts and get familiar with the formulas. But the long questions, especially those related to dynamics of rigid bodies and angular momentum, were really challenging. You have think carefully and arduously to get correct answers and give you explanation carefully. A little carelessness will make you below mean!",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UtpqmBJ03g1u8pAIuMXmpuys4qZlDLpJ",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hi come find me",
            "date": "Feb 01, 2018",
            "title": "Interesting Common Course",
            "comment_content": "There are a lot of topics to be covered in this course. I have some friends studying PHYS in HKU and basically what I learnt from this course are more or less the same as what he has learnt in 2 years. <br /><br />Unlike ordinary HKDSE PHYS, you cannot simply plug the equations like v=u+at. In this course, it involves a lot more calculus. From Mechanics to Wave, more intensive syllabus is covered like the parallel axis theorem and damping.",
            "comment_teaching": "Prof. Chan has the best spoken English ability in the Science School I think. Although he did not really explain very well the intent and intuition, his steps and other explanations are kinda useful. Yet, don't expect to ask via email cuz his answers are kinda short there. TA is good tho (should be Patrick).",
            "comment_grading": "I got both below mean in the midterm and final exam but I did all the homework and online assignment and finally got a B-.",
            "comment_workload": "A lot of workload and the HW are indeed quite challenging. The online Pearson Exercise you have to do very carefully. Like you got wrong for once then the mark you get for that question will be deducted by 10% After 6 times, you will receive 0 mark. Every week you have one written and one online assignment. And you really need to understand in order to answer the questions.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EcmAHfKavDHhrc5eMeOtnNUqRZrZfz6G",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Guess who I am",
            "date": "Jan 05, 2018",
            "title": "A course I enjoyed",
            "comment_content": "This course is a kind of expansion of PHYS1112 and the main topics covered by these two courses are overall same, except that PHYS1312 focuses more on formula deduction. If you are curious about how the formula come out rather than simply remembering them, PHYS1312 is worthy to try.",
            "comment_teaching": "I think the professor is trying his best to usher us into fantastic physics world. His passion to physics is undoubted, and I believe he brings this passion to teaching as well. Before each class, we can get access to PPT in Canvas, and professor uses the pad to write down notes and projects on screen, and releases notes on Canvas after class. So on class you can more focus on catching on the content rather than rushing to finish your own note.",
            "comment_grading": "The honor course's grading scheme is always more mercy than ordinary course. What I mean &quot;mercy&quot; here, is that the proportion of A range and B range is larger than ordinary course, rather than you can get a better grade in honor courses if pay out same effort as your would do in ordinary courses, as you need to compete against your strong classmates.",
            "comment_workload": "The workload is proper. Every week has regular homework to do and it can be divided into two parts - online work and paper work. Online work is same to PHYS1112, while paper work needs your more in-depth understanding on the knowledge. Sometimes paper work can be quite time-consuming but more helpful.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AAOdCLnipqVYL4v2s6BsuMTgxepxqOAf",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Small_Potato",
            "date": "Dec 30, 2017",
            "title": "Very fun course for students who want to learn more about physics, but watch out for IRE gods :o)",
            "comment_content": "A more advanced version of PHYS1112. Some people may find PHYS1112 too easy but PHYS1312 too difficult, so it is up to you to decide which path you want to take. The difficulty goes up gradually during the course and the finals was very challenging, even though some students can still achieve 49/50 which was unbelievable. You learn about basic mechanics (linear motion, simple harmonic motion, gravitation...), rotational motion (moment of inertia, rotational energy, angular momentum...) and thermodynamics (heat engine, 0th/1st/2nd law of thermodynamics, heat exchange...), just like PHYS1112. However, calculus knowledge is a prerequisite and there are additional techniques you have to learn.",
            "comment_teaching": "Very good teaching. Prof Chan writes his own notes during the lesson and teaches stuff out of the powerpoint. He shows the steps very clearly so you can follow them easier. There are some demos in lessons and he even inhaled Helium one time. There are iPRS questions every lesson which allows you to check your own understanding. <br /><br />Prof Chan also takes time after lessons to answer students' queries and he points out the common mistakes in students' homework.",
            "comment_grading": "The mean last spring (forgot which semester?) was B+/A-, and the minimum grade was B-. You can still obtain a rather okay grade even if you do not perform that well in your midterm and finals. There are some very smart mainland students and IRE students who always score a high mark in the exams, so make sure you always push yourself to do better in order to catch up. Some people here are even IPhO gold medalists. It can be very discouraging once you see the score distribution of the midterms and finals, as some people will always attain a crazy high score. Some of my friends kind of regretted taking this course as they would have most likely achieved better grades with PHYS1112.<br /><br />Grading policy:<br />Homework 15%<br />Midterm 35%<br />Finals 50%<br /><br />Homework: Around 99% score<br />Midterm: Above mean 1.36 SD<br />Finals: Above mean 0.47 SD<br />Final grade: A",
            "comment_workload": "The workload is pretty heavy. You have a piece of written homework and online homework almost each week, and each of them takes a bit of time... you can expect yourself to spend at least 1.5 hours in total each week. Some questions may be very challenging, but the exam questions will be on the next level. Prof Chan encourages us to spend more time on the homework by giving us final answers for checking sometimes. <br /><br />Doing your homework can be very frustrating, since MasteringPhysics deducts you 10% instead of 3% as in PHYS1112 for each wrong attempt, and some written questions require very very lengthy and tedious calculations. But if you like physics, I guess doing the questions will be fun in a way.<br /><br />For midterms and finals, there are both MCs and LQs, as compared to only MCs in PHYS1112. At first you will be confused at the long duration of the midterm, but once you get the paper, you will have the answer to that question.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "5kHf290C413Qe6WSLdCs9C6XGND3UnpC",
                    "name": "finals",
                    "format": "jpg"
                },
                {
                    "key": "tm7dOqg1jWX8HEyhqROODKSha3XJPm0R",
                    "name": "midterm",
                    "format": "jpg"
                }
            ]
        },
        {
            "hash": "DUKHtvmU0GUABN9uxMEHARSeazive5p7",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "K.Ahmed",
            "date": "Sep 05, 2017",
            "title": "A more in-depth version of a course than PHYS 1112. This course demands strong foundation in calculus and physics.",
            "comment_content": "The content is similar to PHYS 1112. However it demands more from students. In addition to all the knowledge from PHYS 1112, students have to integrate calculus into the computations. Thus the content becomes much harder. Instead of solving generic questions, students have to solve fundamental proof-type questions with very less numbers and more variables. This is a very nice course as students get to learn Physics in very nice depth.",
            "comment_teaching": "In my opinion, Professor Chan, Ho Bun is a very organized professor. His lectures are easy to follow. He goes over assignments after they are handed in. Moreover he gives us tips for the challenging assignment and examination questions. He gives students encouragement even if they aren't doing too well. He does call on students to answer questions in class.",
            "comment_grading": "Above mean is A- or above. <br />I got about 1 sd lower than mean in mid-term as I didn't put in much effort into assignments and revision. <br />I did better for finals and got about 0.5 sd above mean.<br />The questions in the mid-terms and finals are just extended versions of questions from written assignments. Thus it's important to thoroughly understand how to do your assignments.<br />(Should do all assignments on your own. Without referring to other student's work or copying online.)<br />Overall I was pulled down due to the mid-term. <br />At the end I got a B.<br /><br />Assignments are very important. With a class full of hardworking students. Students can't afford to lose free marks. Moreover the assignments will prepare students for the examinations.",
            "comment_workload": "1 written assignment a week. <br />There are usually at max 2 challenging questions with less than 15 lines of computations each (sometimes only 3 lines). <br />However they require quite a lot of time to think of solution on your own. This can become quite stressful.<br /><br />(Can take up to 1 whole day for average/below average students. Or can take just 10 minutes if you understand everything.)<br /><br />1 online assignment each week.<br />A lot of intermediate level questions. However in total become quite time consuming.<br /><br />Be prepared to devote quite a lot of time to the course if you would like to get an A.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dkW7XwO3MioHRTk76QyVQAbZX52ggVB1",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mcreng",
            "date": "Aug 27, 2017",
            "title": "One of the best courses",
            "comment_content": "Syllabus:<br />- Physical quantities, dimensional analysis, vectors<br />- Motion in 2D<br />- Newton'w laws<br />- Work and Energy<br />- Momentum, impulse and collision<br />- Dynamics of rigid bodies<br />- Angular momentum<br />- Gravitation<br />- Periodic motion<br />- Wave motion and sound<br />- Temperature<br />- Thermal properties of matter<br />- First &amp; Second law of thermodyanmics<br /><br />The syllabus contains more contents than PHYS1112 and they are more in-depth, you would love to take this course if you want to have a greater understanding in physics (esp. in motion, wave &amp; heat)<br /><br />The exam is more harsh than the standard one, apart from MCs (which are the only question type in PHYS1112), we have long questions, with difficulties similar to the written homework.",
            "comment_teaching": "Prof. Chan is one of the best professors I have met in HKUST. He is very passionate in teaching and is willing to answer any sort of questions after lecture. We typically keep him for 30 minutes more after lecture to ask our question :P<br />One thing I would like to mention is the atmosphere of the classroom, among classmates we sometimes talk about the written problems and questions we have during lectures, and truthfully this is the only course yet that I have the opportunity to experience such a nice learning atmosphere. It might be true that all honour courses have a similar atmosphere as well.",
            "comment_grading": "Attached are the histograms for both the mid-term and final exams. From score-grade conversion point of view, this is an awesome course, I got an A- even I went below 0.5 SD in mid-term and hit mean in final. Yet, whether you can keep being at mean in both exams are another question. Prof. Chan mentioned in his first lecture that at least half of the class would get an A-range grade.",
            "comment_workload": "The workload is high in this course, the reason being the difficult assignments. In this course, we would need to finish both MasteringPhysics (this one for PHYS1112) and written assignments. The difficulty for the former one is quite easy in my humble opinion, they are more or less equal to those in PHYS1112. Yet, the written homework are very challenging, I typically need a whole weekend to figure out the solution, and sometimes I need to discuss with my classmates for a better solution.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "N3rdITsiq9WU6TRXS49ZfLjXO18kCQoD",
                    "name": "final histogram",
                    "format": "png"
                },
                {
                    "key": "hDSxwODVzobpuiyo5ovxsWkksDWEAWzE",
                    "name": "histogram-1",
                    "format": "png"
                }
            ]
        },
        {
            "hash": "fopRUfSAqEmpbUylVohqt5pvqPrRJcqX",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "IRE Guy",
            "date": "Jan 26, 2017",
            "title": "Good Course, But Watch Out For Really Smart Students",
            "comment_content": "PHYS 1312 basically covers the same topics of PHYS 1112, with a bit more in-depth discussion in topics like simple harmonic motion, waves, etc. You will need a lot more calculus in proving stuff in 1312 than 1112, and questions you are going to encounter are proof-based.<br /><br />The first half semester will cover basic mechanics learnt in DSE/ high school with some differentiation and integration. You will learn some new stuff in the second half semester such as simple harmonic motion, wave equation, Kepler's Laws of Planetary Motion, gravitation and thermodynamics. Personally, I found those latter topics more difficult.",
            "comment_teaching": "Professor Chan is a REALLY nice professor and we can tell he is really into teaching his fellow students. He is good at drawing pictures and diagrams to illustrate theorems. He also stayed behind to answer a bunch of questions from the hard-working Chinese.",
            "comment_grading": "Although I did not attain a satisfactory grade in 1312, I have to say 1312 has a much better grading scheme than 1112. If I were in 1112, I bet I would get a much lower grade. If you want to attain a good grade here, you have to out-smart a lot of genius here in 1312, ranging from Physics Olympiad medalists to top scorers in Gao Kao of mainland China.<br />We have PRS but professor Chan said they won't be included in our grades.",
            "comment_workload": "It depends. If you love to solve physics long problems with no numbers at all, then you might handle 1312. Otherwise, you will have to struggle every week just because you probably need to spend days to solve 1-2 difficult homework problems, not to mention that tricky online short problems of Masteringphysics.<br />If you are one of those genius I mentioned, you can consider this light workload and skip all the lectures while still managing an A+ just like what the IRE genius had done.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JoxfYEZNv1zKjNzuOAD6UmvEhIo6Nj2R",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nicknameoffan",
            "date": "Jan 25, 2017",
            "title": "nice prof, nice class",
            "comment_content": "Very fundamental physics lesson. The course contains Newtown mechanics and little thermology. The teaching contains mathematic prove and experiment. IT'S BETTER TO LEARN CALCULUS BEFORE TAKE THIS COURSE. Because many methods need math. The course does't take attendance but has PRS questions (will not be graded).",
            "comment_teaching": "Prof CHAN is very nice. He did all experiments himself and some are quite dangerous. The most important thing is that he cares us very much. He gave a pathway for students who want to do more on physics. I got a chance to talk with him face in face and got much experience.",
            "comment_grading": "Midterm 31/35 10 in rank (maybe 44 students?)<br />Final 46.5/50 10 in rank<br />Writing HW nearly all full marks<br />Online HW 105/110 (cannot remember clearly)<br />Final grade is A+<br /><br />Also I hear that mid and final all near and little above mean is A-",
            "comment_workload": "The homework concludes writing and online parts. The writing parts are sometimes easy. And I can discuss with my mates. Online part is very complex and cost long time (2h) every week. Students need to buy the book to get the code to do online homework, may be ...costly",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LatWDDkFYZFq2Kw48BKttJL1KKhNv0O5",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mindy_vm6",
            "date": "Jan 23, 2017",
            "title": "",
            "comment_content": "The content that was taught in the course is basically the same as PHYS 1112 but exam and homework is harder.",
            "comment_teaching": "Prof. Chan taught really good and if having any question, you can just ask him after the lecture and he will answer all the questions, sometimes he was stuck there for more than half an hour.",
            "comment_grading": "The grading of this course is quite fare. Professor made it very clear in the very first class about how he is going to grade us.<br /><br />Homework 15%<br />Midterm 35%<br />Final 50%<br />Not sure if it was the real percentage he used for grading. I didn't remember clearly about it.",
            "comment_workload": "The workload is quite heavy. Online and hand-writing homework have to be hand in every Thursday.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0cmZMXUmJpi1qoTcbfnyaQQgexVtSat9",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Davy",
            "date": "Jan 19, 2017",
            "title": "Good Professor",
            "comment_content": "This course is about basic idea of dynamics , sound and heat. Compared to phys 1112, their content are similar, but phys 1312's exams has some difficult long questions.",
            "comment_teaching": "I think the professor is excellent. Even the tutorial section he taught in person. And he did many demonstrations this term, which were very interesting and inspiring.",
            "comment_grading": "I think this course's grade is good if you devote your time to it. Almost half of the students get A range.",
            "comment_workload": "Because it's an honor course, its workload is a little big. But I think the homework really help us to prepare for the exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fUORiY3XuzOuCuGSwtfbDtMRMPYFIILv",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ey2016",
            "date": "Jan 09, 2017",
            "title": "",
            "comment_content": "It is a good course for those who want to take physics as&nbsp;&nbsp;their major in the future.There are not too many new topics,but the professor will teach you some new approaches to solving physics problem.It is recommended to those who do not join any physics Olympics but want to study physics in the future .",
            "comment_teaching": "The professor is good at teaching and he is willing to answer any students' questions. Sometimes he stays behind after the lectures and answers students' question.",
            "comment_grading": "The grading is reasonable.if you take it serious and you will not do too bad.But it is quite difficult to get&nbsp;&nbsp;A or above if you have no experience in Physics Olympics.",
            "comment_workload": "There are two parts of homework: one is online homework and another is written homework.The online one is not difficult but it is quite time-consuming。 The written homework is quite challenging but you will like it if you truly love physics.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pZ54nLnO2c3EPbZHD2G6Q8jMOVgMFCGc",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Talvi",
            "date": "Jan 05, 2017",
            "title": "",
            "comment_content": "Not really different from the textbook (except for the parts that are stated not to be included, e.g. fluid mechanics), the 1112 course, or the IPhO Hong Kong training (except for noninertial frames, which are not included). Teaching pace normal. Methods normal.",
            "comment_teaching": "Any professor willing to inhale helium in class deserves an A.",
            "comment_grading": "I got an A+ and so I believe myself not to be in a position to comment. However, from what I heard, it is not hard to get into A-range and near impossible to get below B- so this should not be a problem.",
            "comment_workload": "Assignments are divided into two parts: MasteringPhysics online homework and written work. Online homework is easy but involves a lot of psychological pressure; Written work, focusing on the derivation of the formulae, is of moderate difficulty and should not be a problem for anyone who listened in class.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LOfhMlbDS3jlYERVqnbPJDAugmOCG0TF",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "K. H.",
            "date": "Dec 24, 2016",
            "title": "A good course for students who want to take more Physics",
            "comment_content": "This syllabus of this course is similar to PHYS 1112, except there is more proof of theorems and there are some extra topics which are mainly for enrichment, including:<br />1. Projectiles on Inclined Plane<br />2. Tension of a String With Finite Mass Undergoing<br />&nbsp;&nbsp;&nbsp;&nbsp;Circular Motion<br />3. Bowling Ball Problem, e.t.c.<br /><br />This course will require a very good foundation of calculus skills. In addition, some higher level of Mathematical skills, such as solving O.D.E. and Taylor expansion, will also be used. So do not choose this course just for seeking better grades, you will suffer if your Maths skills are not good enough.",
            "comment_teaching": "Professor Chan is a very good professor who knows clearly on the topics in 1312. The lecture notes are very clear and arranged well. He also uses a writing pad in class to demonstrate some of the proofs and also some extra problems related to the topic taught at the moment with clear indication of the flow of his logic. This allows students to easily follow his idea. Moreover, he is also very willing to answer students' questions, even the question might be really 'strange'. So if you have attended his lecture, don't hesitate to ask any questions if you want to.<br /><br />The TA is also very helpful especially in providing some ideas on how to solve the written and online homework, however you can hardly feel his existence because he only shows up in the days of collecting written homework and demonstration.",
            "comment_grading": "Grading Scheme:<br />Homework: 15%<br />Mid-term Exam: 35%<br />Final Exam:50%<br /><br />Since this is an Honour course, the grading is actually quite good (and the mean for both mid-term and final exam is also quite high, so do prepare well for the exams).<br />I got almost full marks in homework, 29/35 in mid-term and 38.5/50 in final. Eventually I got an A-<br /><br />(Fyr the histogram for mid-term and final is attached)",
            "comment_workload": "Each week you are required to hand in written homework and finishes online homework (Mastering Physics Homework, so you are required to buy the textbook to get access code). The written homework generally requires several hours to solve unless you are extremely smart. The online homework is mainly annoying numerical calculations and you have to be extra careful to avoid careless mistakes and mark deduction. So if you are not really interested in Physics, don't take this course as the workload would be extremely high. But if you are really interested in Physics and have a 'not too bad' foundation, go and take the course. The result is really rewarding.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "oXevEgOP1GlGOQMb3lFV6p5QLlNBTGlk",
                    "name": "histogram-1",
                    "format": "png"
                },
                {
                    "key": "d1k24OM82rDdhFKmPrr2ALfyRDVs6qLv",
                    "name": "final histogram",
                    "format": "png"
                }
            ]
        },
        {
            "hash": "zEGyLbBUl9HFY3Qv1NwIjHdKsXTW1jIK",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Zack",
            "date": "Jan 27, 2016",
            "title": "",
            "comment_content": "The course contains from basic mechanics to thermodynamics. I think it's a lot for only one semester.",
            "comment_teaching": "Professor Chan is very interesting. He knows his stuff, I can sometimes see him reading physics related materials on his tablet while having dinner in lg7. He always tell us not to give up because this course is much harder than what he did in Princeton.",
            "comment_grading": "good. midterm&gt;mean 1sd, final below mean a little, A. I've heard that mean was B or something.",
            "comment_workload": "The workload was not very heavy. However, since this course is supposed to be advanced, some extra exercise may be needed.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tUloVdtvSntgtcUPCCaxjRkKM3oAcGc2",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ChuaWanZhen",
            "date": "Jan 26, 2016",
            "title": "PHYS 1312- Can learn a lot",
            "comment_content": "The content is similar to PHYS 1112 however, the professor will emphasize more on some concepts that are quite useful in solving problems. The methods that he teach will be useful during the exams as if you understand it, you can straight away apply it and get full marks.",
            "comment_teaching": "Professor Chan is a very good professor, he is one of my best one. He is willing to teach and does interesting demonstrations during the lectures. He is willing to answer our questions and also concern about our future selection of courses. (He made a sample for the physics major course selection for the four year program which helps a lot to me.) He is cold from his looks but he is warm from beneath.",
            "comment_grading": "The grading is good.",
            "comment_workload": "The workload is heavy especially the written part as Professor Chan wants us to really understand the concept. The written homework is tough but it helps me to learn a lot and enjoy doing it even I spend a lot of time on it. For the online homework, it is a bit irritating as you have to key in the format of the answers correctly. It is not that difficult.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lpznaUyP4Vxk3jLVtoySiWZ6aYEenloT",
            "semester": "2015-16 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Dovran",
            "date": "Jan 17, 2016",
            "title": "",
            "comment_content": "Content is not so hard if you jave some Olympiad student background. It will cover the normal physics topics in more detailed way.",
            "comment_teaching": "Teaching is quite good, instructors organization of notes is amazing and well-developed. If you will listen, you should understand the topic without any hardship.",
            "comment_grading": "Grading also not bad. If you work hard and do your assignments you will surely get B range. And you should show a commitment.",
            "comment_workload": "Workload is a bit higher from normal. But it is manageable. Especially online HW will take your time.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cdFl7MueNj7gJYU34WGMnG9M4UBtA889",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CW",
            "date": "Jan 09, 2016",
            "title": "",
            "comment_content": "Quite good, not much different with PHYS1112 actually, except that we need to do long question",
            "comment_teaching": "Teaching is good, the instructor will write course note on his tablet and upload to the web which make life much easier.",
            "comment_grading": "mean is A range, but given that if you can get a A range in 1112 doesn't mean you can get mean in this course.. There is a hard competition, DSE students are at a disadvantage if you didn't study extra things on your own.<br /><br />Mid term below 0.7 SD<br />Final below 1.5 SD<br />HW almost full<br />B-",
            "comment_workload": "Mastering physics and long questions(written, can take a long of time if you are not smart enough) every week, exam is very close to HW",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "71MZIFjUiBL1SEe5eRjdu41F6KvSN5UM",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "F001",
            "date": "Jan 08, 2016",
            "title": "Great course",
            "comment_content": "Not many thing new. Just something taught in the high school and a little expansion in thermal parts",
            "comment_teaching": "His teaching is good in all.<br />Very patient.<br />Comfortable pace.",
            "comment_grading": "I think Grading is OK. Although I didn't get too much above mean, I still got an A. That is very good compared to MATH 1023. Maybe it is because i have done all the homework?",
            "comment_workload": "Workload is very big although it really helps to understand the content. <br />There is homework online and we need to hand in homework once a week. <br />The written homework is difficult.<br />But the final is even more difficult",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9ytBGxXRgs61yxP8n0T8bmqUHwLhhqM0",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SharonMiao",
            "date": "Dec 25, 2015",
            "title": "This course helps me realize I'm not a physics material",
            "comment_content": "Same syllabus as PHYS1112.<br />Long questions in exams are mutated versions of homework problems.",
            "comment_teaching": "I think he's quite scary sometimes when he calls out students' names and asks questions......<br />But overall his teaching is clear and direct, plus the class is quiet, so you get a good learning environment.",
            "comment_grading": "",
            "comment_workload": "Your workload depends on how familiar you're with the course content. The weekly written homework could be troublesome and difficult. But it's okay. If you don't know the answer, just ask people around, usually they'll know.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "c5RatiRpRzlm0MQTo7aPvpK1DSSdg7BD",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "0_0",
            "date": "Dec 24, 2015",
            "title": "Biggest regret in my first semester in UST",
            "comment_content": "Intro mechanics and a little bit of thermodynamics.<br /><br />As the course introduction suggest, some of the content might get a little bit deeper than the normal general physics course, but nothing is really difficult, and the whole course follows closely to the textbook (that being said, the course will finish that whole thick book in about 3 month, so be careful about the pace you study).<br /><br />Here's my sincere advice:<br /><br />You might have already learnt most of the material being taught in this course, but even so please be sure you at least review a little as the course goes.<br /><br />Personally, this is like my 3rd or 4th time studying these introductory stuff, and I choose to do so simply for the sake of getting an easy A. So I must confess, I was just too unmotivated to even bother about studying. But apparently I am not familiar enough with those intro things to have all of them still staying in my head after two years, adding to that, some of the material was covered a little deeper than what I used to learn the first time. And that really did got me. It ended up, you know, I got nowhere near an A, and I really regret it.<br /><br />So, do work hard if you choose PHYS1312.",
            "comment_teaching": "I can tell Prof. Chan really did try his best to teach, and he did try to give a satisfactory answer to every single question asked by the student.<br /><br />But still, honestly, the lecture can get fairly boring, and I just never think teaching physics with PowerPoint is a good idea.",
            "comment_grading": "The professor has explicitly said that every one got above mean should get some kind of A's.<br /><br />But consider, anyone choose to be in this &quot;honors&quot; physics course must be somewhat good in physics, so the mean can be quite high and most people will be on it. So it is really not that easy to get a high grade and the grading is really not that generous as many people suggested (consider how easily will you get an A if you choose PHYS1112 instead) (but still not too bad) .<br /><br />As others had mentioned, the exams are divided into 2 parts, MC and free responses. The free response questions are similar in difficulty with the homework problems, and none of them are particularly difficult. Though if you are not too used to long exams, it can get quite intense (Well... I guess most local or mainland students will not have this problem, but I myself did performed fairly poorly on the final simply because I didn't have enough stamina to concentrate for that long that day...).<br /><br />I merely managed to get on mean, and I got B+.",
            "comment_workload": "One written homework (typically two long problems in one set) and one problem set on Mastering Physics every week.<br /><br />The written part can get a little bit challenging sometime, but fairly doable. Though I suggest to kill them all early in the week, being a deadline fighter and found yourself got struck in physics problems is no fun. (from my own experience of being a deadline fighter essentially every week from week 3...)<br /><br />Also, you might want to be aware of how quickly you can solve these homework problems, as you have to solve a series of them under time pressure in exams.<br /><br />Overall, the written problems are quite interesting and valuable to do, but in contrast the Mastering Physics part tended to be tedious and annoying.<br /><br />Collectively, the workload can get kinda heavy given that if you do all the homework yourself and spend the time to go over the material taught in class. But like I said, be sure you take the workload if you want a good grade.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pVGaWgHZ9MxsZgFWV6mRhppT5drU0Y0G",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bread",
            "date": "Dec 22, 2015",
            "title": "",
            "comment_content": "Course covers basic classical mechanics/wave/thermodynamics contents. Overall, aside from a few special techniques, this is just a harder version of PHYS1112.",
            "comment_teaching": "Prof. Chan's teaching is quite good. He usually demonstrates some of the problem solving techniques needed on his notepad when necessary to help the students follow. The lectures also consist of some live demonstrations, one of them being Prof. Chan singing after inhaling some Helium gas.",
            "comment_grading": "The weighting is as follow:<br />Homework: 15%<br />Mid-term: 35%<br />Final: 50%<br />Mid-term exam have 15 MC questions (likely taken from PHYS1112) with 5 long questions which are similar to homework. The final exam have 23 MC questions and 5 long questions.<br />Overall, according to the professor himself, if you get above mean, your grade should be in A range. It sounds good on paper, until you realize thanks to Mainland students and a few students with backgrounds in IPhO or other similar competition, the mean is quite high. If you only have HKDSE as your physics background, you may need to work much harder than others to get a good grade.",
            "comment_workload": "Weekly homework consist of the online part, i.e., the infamous MasteringPhysics, and the written homework, which usually consist of around 2 long questions covering the techniques not covered in PHYS1112. <br />MasteringPhysics is mostly just a nuisance, thanks to its scoring system. The written homework is not easy, and can take quite a lot of time if you are not familiar with the topics covered in lesson. Fortunately, there are few hints, which can help in checking answer.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hAf5lFlkHwaoyGkZFrOthalqVEpJmkY0",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "grqm",
            "date": "Dec 22, 2015",
            "title": "",
            "comment_content": "Newtonian mechanics加少少waves同thermodynamics<br /><br />mechanics果part基本上係抄mit 8.012 (kleppner &amp; kolenkow本書)<br />rotation果d特別難",
            "comment_teaching": "Prof Chan都算有心教 不過有時都幾悶<br />有時會有demo<br />同埋上堂講既野太淺<br />聽完都唔代表識做d homework",
            "comment_grading": "15% homework<br />35% midterm<br />50% final<br /><br />雖然話就話過mean就有A-<br />但係好難有A<br />1112又易又好grade <br />唔係特別有興趣(同能力)真係千祈唔好take 1312 <br /><br />走左大部份堂 但有交功課<br />midterm溫左3日 below 0.4 sd<br />final溫左3日 below 0.2 sd =&gt; B+",
            "comment_workload": "一星期一份written homework同masteringphysics<br />written homework幾難<br />每份諗好耐都未必識做<br />masteringphysics就好煩<br />reg之前要諗清楚<br />如果冇物奧底既話就算dse 5**都未必應付到呢個course<br />有可能放左好多時間都只係得A-",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "HURetwwliZwsdQwDBPDNfnakgKNgFlpi",
                    "name": "Midter1",
                    "format": "gif"
                },
                {
                    "key": "8lUQdKnf31dCovAXuXdlHVfSvHGWCJEQ",
                    "name": "Final 1",
                    "format": "gif"
                }
            ]
        },
        {
            "hash": "7AmOMPtFy3AmxgVlIepDCXFVXuE1xm4h",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 608,
                    "name": "LEUNG, Pak Wo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TONY_YANG",
            "date": "Feb 09, 2022",
            "title": "",
            "comment_content": "The content is good, it is not too deep but enough for the basis",
            "comment_teaching": "The professor is taught in a fun way and it's easy to follow.<br />The",
            "comment_grading": "The grading is not too tough, and you will not fail easier. I got 76 in midterm and 47 in the final but I still got B+, you will not fail easily and don't need to be afraid of failing the course",
            "comment_workload": "The workload is webwork every week and consists of 10-13 questions, some is easier and some is a little bit diffcult.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2Vueno1BDE4s6oxSCBuCMOGYw8rlLnwQ",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Scary",
            "date": "Jan 26, 2016",
            "title": "Good Physics course",
            "comment_content": "Professor did very good in teaching. The content of this course is very useful but a little difficult. However, it is worth taking PYHS1312, it's really a good practice of your mind and logical thinking method.",
            "comment_teaching": "Professor did very good in teaching. The content of this course is very useful but a little difficult. However, it is worth taking PYHS1312, it's really a good practice of your mind and logical thinking method.",
            "comment_grading": "Professor did very good in teaching. The content of this course is very useful but a little difficult. However, it is worth taking PYHS1312, it's really a good practice of your mind and logical thinking method.",
            "comment_workload": "Professor did very good in teaching. The content of this course is very useful but a little difficult. However, it is worth taking PYHS1312, it's really a good practice of your mind and logical thinking method.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BHjU8RpWhkXOBGRTQd8Tb22ioIt2knBG",
            "semester": "2015-16 Winter",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Prophet",
            "date": "Jan 21, 2016",
            "title": "General physics",
            "comment_content": "Considering the fact that the term is really short, the content of the course is quite adequate. It covers the basic knowledge about most of the mechanics part of general physics with some simple application of calculus, but lack techniques of thinking and calculating, which cause this course far easier than I expected. I have to point out that some details was omitted and may cause the incompleteness of the knowledge net of students. However, now that the exam would not cover this sort of details, then we can just learn what we need to know and get a grade.",
            "comment_teaching": "Professor CHAN is a good man with a clear string of instructing. He can explain every element in his class and he would be willing to solve any problem for any student. By combining experiment in class, video and his tiny writing pad, he could show what he wanted us to know clearly without ambiguity, You would get all what he want to express easily with his good ability of instructing.",
            "comment_grading": "Comparatively good. With the name of &quot;honors&quot;, the grade of this course is better then other regular ones, at least the A range and the A+ range is good enough for anyone who wants to get an A or A+. My predecessors said that they had rarely met a course with such a good grading pattern, and it offers a good chance for students to make their GPA a little bit prettier.",
            "comment_workload": "Some written and online problems about what was taught in class, and you can deal with them quickly for their lack of difficulty, nor do you need to practice a lot for the exams. In fact, what we [a lot of us] do is just to simply read [ well actually don't need to read ] the textbook and do the homework. He would provide all the formula and parameters needed in the exam so the pressure of memory would me not heavy. After all, this is not a course that would take you a lot of time to deal with, nor would it make you miserable in the limited time when you are with it.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uYSTfFxpE3paYmVfU45ayg4yeKIpWVWB",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "XavierScor",
            "date": "Aug 19, 2017",
            "title": "",
            "comment_content": "I think this is good class&nbsp;&nbsp;to learn. Maybe hard, but worth. I enjoy it a lot. I hope I can get good grade.",
            "comment_teaching": "I think this is good class&nbsp;&nbsp;to learn. Maybe hard, but worth.I enjoy it a lot. I hope I can get good grade.",
            "comment_grading": "I think this is good class&nbsp;&nbsp;to learn. Maybe hard, but worth.I enjoy it a lot. I hope I can get good grade.",
            "comment_workload": "I think this is good class&nbsp;&nbsp;to learn. Maybe hard, but worth.I enjoy it a lot. I hope I can get good grade.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MoyIEFN70o2rnkWZzDX3MOmCdOQzaXKx",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 611,
                    "name": "CHAN, Ho Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Byliu",
            "date": "Aug 25, 2015",
            "title": "好课，能学到知识，竞赛党刷龟课",
            "comment_content": "有很多有用的知识，比1112应该要深，而且用积分多一些。",
            "comment_teaching": "教授讲的比较仔细，而且课后有问题教授都会认真回答",
            "comment_grading": "龟感觉还不错啊，a range应该挺多的。高中物理竞赛的，省一的，可以刷A+",
            "comment_workload": "不大，每周master physics和手写题，总的来说只要上课好好听一定可以做完",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1KhkWTDtjRQo2Va7Fe1yHbTwfJurBap0",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 608,
                    "name": "LEUNG, Pak Wo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YECGAA",
            "date": "Dec 23, 2022",
            "title": "CPhOer的零workload刷龟课",
            "comment_content": "大概是力学和热学，这一点是我从考试题目中推断出的",
            "comment_teaching": "不好评价，因为无论是lecture还是tutorial，我都从来没有去过<br />但是可以肯定的是，梁教授是个大好人，真的很好，非常认真负责，给分也是很不错的",
            "comment_grading": "成绩构成<br />作业*9（剔除两次最低分） 15%<br />期中&nbsp;&nbsp;40%<br />期末&nbsp;&nbsp;45%<br /><br />搬运一下数据<br /><br />期中（满分50）<br />平均数：28.22<br />中位数：27<br />上四分位数：35.5<br />下四分位数：20<br />最高：50<br />最低：6<br />标准差：10.8<br /><br />期末（满分100）<br />平均数：59.87<br />中位数：61<br />上四分位数：76<br />下四分位数：47.5<br />最高：96<br />最低：8<br />标准差：19.9<br /><br />期中期末均有试卷复核环节<br /><br />参考：我的数据<br />作业：平均99.6%<br />期中：50/50<br />期末：93/100<br />等级：A+<br /><br />让我来评价难度或许并不客观，但是还是可以稍微讲一下的<br />期末比期中要稍难一丢丢（不明显）<br />总体上讲，难度远低于CPhO复决赛，略低于CPhO预赛<br />对于省一及以上，系统学过普物的CPhOer，没有什么能阻挡你拿A+<br />而且容错率也是不错的，我想我在期末中有一些步骤可能写的过于简略，丢掉了一些分数，但并不妨碍一个A+的最终成绩",
            "comment_workload": "小到可以忽略，每周一次的线上作业，只需输入答案<br /><br />所有答案都是在网上找的到的，就提示到这里<br /><br />比较烦人的是每次错误尝试都会扣去一定的分数（扣多少取决于你这一道题总共有多少问），所以需要格外注意正负号，单位，有效位数之类的要求。<br /><br />有时会出现答案错误的情况，这时如果你被扣了分，就要及时联系教授，教授会把你丢掉的分加回来，点赞<br /><br />不过有一点需要提出批评，那就是想要做作业？先花钱。即便你不要纸质版的课本，也需要花三百多HKD，还真不便宜。<br /><br />总而言之，如果你是一名CPhOer，尽管选此课，作业网上一搜就OK，课也不需要上，考试也不需要复习，直接裸考妥妥的A+，妥妥的零workload刷龟课",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 12,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "enX0VdZ3w7dmxA2T5xnpB86JzzPHYJxN",
                    "name": "midter mc",
                    "format": "png"
                },
                {
                    "key": "dvImipjjUhyc27mKIgSCK47nqCJk1OF7",
                    "name": "midterm LQ",
                    "format": "png"
                },
                {
                    "key": "YNTFrYmkLnRCRWQGpOESR4agB2W59QHQ",
                    "name": "midterm total",
                    "format": "png"
                },
                {
                    "key": "0Gjyl6fjE8kMwcBQDdxtUPinNIzwFsBI",
                    "name": "final exam LQ score-2",
                    "format": "png"
                },
                {
                    "key": "ZXm0ZtWBTioYbj30Fa7pczbe3ZUM6IFw",
                    "name": "final exam MC score-2",
                    "format": "png"
                },
                {
                    "key": "b99riuSB20hNWK232XYmKXBIWlW1zaXW",
                    "name": "final exam total score-2",
                    "format": "png"
                }
            ]
        }
    ],
    "composer": []
}