{
    "error": false,
    "course": {
        "id": 2514,
        "subject": "RMBI",
        "code": "3000A",
        "name": "Case Studies and Practical Issues in Risk Management Topics",
        "description": "This course will examine various types of risks that many business enterprises face nowadays; for example, financial markets risks can be further divided into equity, foreign exchange, credit, interest rates and commodity risks. In addition, other non-financial risk factors such as operational risks, reputational risks, catastrophe risks (earthquake, typhoon, geopolitical etc), counterparty risks and liquidity risks will also be discussed in details. The format of the course is based on a series of real-life case studies from well-known companies (GM, Enron, Citibank, Merrill Lynch etc) and educational institutions (Harvard & Yale etc). Corporations are increasingly demanding employees with risk management knowledge. Managers and specialists with strong risk management skills are also becoming professionals who serve their communities well. In addition to private enterprises and commercial entities, public agencies and governments around the world are also recognizing that risk management knowledge and skills are necessary in the skill sets of becoming managers and community leaders. In addition to gaining knowledge from cases relating to financial & non-financial market risks, this course will also devote significant amount of time for students’ skill development purposes. Intense preparation for every case is necessary and students are expected to deliver presentations and engage in debate on various risk decisions. Every student must participate actively and take ownership of his/her learning.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            1830,
            1730
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.67,
        "rating_teaching": 4.67,
        "rating_grading": 3.67,
        "rating_workload": 3.33,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [
        {
            "hash": "9OyQlHwv8M9Ah3e8ZtXvwlMhylxV2Yxm",
            "semester": "2018-19 Spring",
            "instructors": [],
            "is_author": false,
            "author": "AL_",
            "date": "Sep 05, 2019",
            "title": "RMBI 3000A",
            "comment_content": "It includes 10 main cases of different risks<br />Introduction to case studies method and overview of risk management N/A<br />Commodity Risk &amp; Credit Risk\tN/A<br />Equity Market Risk\tN/A<br />Strategic Risk\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Alibaba<br />Investment/Liquidity Risk\tYale University Investment Office<br />Reputational Risk\tWells Fargo Bank<br />Operational Risk\tVolkswagen\t<br />Interest Rate Risk\tWalmart\t<br />Foreign Exchange Risk\t\tGeneral Motors<br />Product Launch Risk\t\tMerrill Lynch HOLDRS\t<br />Human Capital Risk\tMorgan Stanley<br />Energy Risk\t\tAmarath Advisors<br />Derivatives Risk\tMoGen Inc<br /><br />Official:<br /><br />This course will examine various types of risks that many business enterprises face nowadays; for example, financial markets risks can be further divided into equity, foreign exchange, credit, interest rates and commodity risks. In addition, other non-financial risk factors such as operational risks, reputational risks, catastrophe risks (earthquake, typhoon, geopolitical etc), counterparty risks and liquidity risks will also be discussed in details. The format of the course is based on a series of real-life case studies from well-known companies (GM, Enron, Citibank, Merrill Lynch etc) and educational institutions (Harvard &amp; Yale etc).<br /> <br />Corporations are increasingly demanding employees with risk management knowledge. Managers and specialists with strong risk management skills are also becoming professionals who serve their communities well. In addition to private enterprises and commercial entities, public agencies and governments around the world are also recognizing that risk management knowledge and skills are necessary in the skill sets of becoming managers and community leaders.<br /> <br />In addition to gaining knowledge from cases relating to financial &amp; non-financial market risks, this course will also devote significant amount of time for students’ skill development purposes. Intense preparation for every case is necessary and students are expected to deliver presentations and engage in debate on various risk decisions. Every student must participate actively and take ownership of his/her learning.",
            "comment_teaching": "He is a good professor with a lot of experiences.&nbsp;&nbsp;However, he always cold call students to answer difficult questions, you need to be well-prepared to be embarrassed.",
            "comment_grading": "In-class tests&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(5 quizzes)\t20%<br />Mid-term test\t20%<br />Written assignment\t10%<br />Project report (Individual)\t10%<br />Presentation&nbsp;&nbsp;&nbsp;(Group Business Attire)\t20%<br />Course participation\t20%<br /><br /><br />The whole grading system is quite unfair and not transparent enough.<br />There are 6 quizzes, 1 super easy quiz during the add drop period and 5 of the highest quizzes will be counted to the final grade. We only have the result of the first 2 quizzes.<br />For midterm, you need to self-study 90% of them. Only 3 lectures is conducted before the midterm examination.<br />For the topic of presentations, some groups get it 1 week prior, some groups get it 1 month prior. SUPER UNFAIR<br /><br />Midterm, presentation, participation and final paper are all not released, not to mention the mean.",
            "comment_workload": "The workload is extremely high. You need to have lessons on Sat and Sun. And self-study most of the cases for the mid-term. For presentation, you will be in a group of 3-5 people and give a formal presentation for 40 mins. Sometimes the professor only gave the topics 1 week prior to the presentation.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vHkzGLG6JYPdX6M3MWFhehq9XSsO7QWk",
            "semester": "2018-19 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Tina Du",
            "date": "Jun 12, 2019",
            "title": "A great and unique type of course in UST",
            "comment_content": "10 cases analysing different types of risks, such as energy risk, financial market risk, credit risk etc. Most of the cases are from Harvard Business School. Supplementary materials about financial news were also discussed on class.",
            "comment_teaching": "Great professor with lots of industrial experience and an open mind. Unlike most of the professors in UST, he used socratic teaching method, teaching by asking questions, to run the whole class. Throughout each class, he gave about 70% of the time for student to express their opinions and thoughts. He is also super willing to talk and share his experience with the students.",
            "comment_grading": "Because of the special arrangement, the students were from each grade, school and origin. And since the grading is highly determined by class participation and essay, you will have an absolute advantage to get good grades if you speak good English and have certain finance background. <br />I would say even for the quiz, it's more about testing one's capability before the course, rather than testing one's growth. Thus, I found the grading was a bit unfair.",
            "comment_workload": "You will expect to :<br />1. read through all 10 cases or more and figure out all the things that you don't understand by yourself<br />2. make a long presentation (10-15 mins per person)<br />3. write an essay<br />4. prepare well before each class in order to actively participate<br /><br />It's not easy. But each task was quite rewarding. Please be prepared to learn a lot of new stuffs through your own research and asking questions.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EZLEeKeuj7IK7rNsxdDi7MbD53tzetTi",
            "semester": "2017-18 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Anmol.M",
            "date": "Aug 27, 2018",
            "title": "Similar to Harvard Case Study Classes",
            "comment_content": "13 cases based on various areas of risk management such as energy risk, financial market risk, credit risk etc. Cases are mainly used for MBA studies at various institutions. Most of the cases are from Harvard Business School.",
            "comment_teaching": "Very good professor with immense industrial experience in the finance industry. He helps run the discussion in the classroom. Also invites 2 industrial experts which will talk about their field of interest",
            "comment_grading": "Not curved in this semester due to lower class size and its relative newness in the curriculum. Grading policy is lenient as far as you are regular with reading the cases thoroughly. There will be a quiz after almost every class and presentations every class starting from the second class",
            "comment_workload": "Need to be regular with the reading material as there are quizzes every class. Class time- 3 hours and classes on weekends. An essay based on one of the cases will be required towards the end",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}