{
    "error": false,
    "course": {
        "id": 3348,
        "subject": "RMBI",
        "code": "3020",
        "name": "Practicing Risk Management using Case Studies",
        "description": "This course will examine various types of risks that many business enterprises face nowadays; for example, financial markets risks can be further divided into equity risk, foreign exchange risk, credit risk, interest rate risk and commodity risk. In addition, other non-financial risk factors such as operational risk, reputational risk, catastrophe risk (earthquake/typhoon), geopolitical risk, cybersecurity risk, counterparty risk and liquidity risk will also be discussed. The format of the course is based on a series of real-life case studies from well-known companies (Alibaba, GM, Enron, Citibank, Merrill Lynch etc.) and educational institutions (Harvard & Yale etc.) Students must prepare for every class by having read the assigned cases before arriving class. Participation in every case discussion is mandatory.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2110,
            2010
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.5,
        "rating_teaching": 5,
        "rating_grading": 2.5,
        "rating_workload": 2,
        "review_count": 2,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1486,
                "name": "LEE, Christopher",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "0wpo7opN0YqmQlDtmv4X4h0OG9eK8LNA",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1486,
                    "name": "LEE, Christopher",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pinball",
            "date": "Jan 10, 2021",
            "title": "",
            "comment_content": "RMBI 3020 is a good course for learning different business events:<br />1. 13 cases regarding different kinds of risk, for example, credit risk, operational risk, energy risk and weather risk.<br />&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;Key concepts<br />&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;Some of the big business events in recent decades<br />&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;Insights from Professor's experience<br /><br />2. Guest Lecture to know some business people",
            "comment_teaching": "Teaching approach is similar to Harvard Business Case Study, which you may get the feel from youtube: https://bit.ly/39d5u48<br />&nbsp;&nbsp;&nbsp;&nbsp;- The reality is, the class is supportive and nice, the above fierce competition is just an ideal.<br />&nbsp;&nbsp;&nbsp;&nbsp;- Using case as the main instrument, issues are analyzed, divided into sub-problems, and concepts &amp; terminologies are taught.<br /><br />Professor Lee is nice, and he answers your questions even though they may sound trivial for some advanced students.",
            "comment_grading": "This semester the course is offered to students even they do not have RMBI major.<br /><br />Grading seems nice if you do participate a lot.<br /><br />With basic business knowledge and prepare beforehand, you should be able to get B or above.<br /><br />Happy learning!",
            "comment_workload": "The course consists of:<br />- 1 midterm on 3rd class, <br />- 1 quiz almost every weekend, <br />- 1 written assignment, <br />- 2 bonus written assignments, <br />- 2-person group presentation on the case, questions provided by professor one week in advance,<br />- class participation<br /><br />Note:<br />1. If you do not participate, you will lose 1/5 of marks.<br />&nbsp;&nbsp;&nbsp;&nbsp;To participate means you need much preparation (or if you <br />&nbsp;&nbsp;&nbsp;&nbsp;have loads of knowledge).<br /><br />2. Reading and researching for the risks can be a long time <br />&nbsp;&nbsp;&nbsp;&nbsp;work.<br />&nbsp;&nbsp;&nbsp;&nbsp;First, you need to prepare total ~300 pages of cases in 2 <br />&nbsp;&nbsp;&nbsp;&nbsp;weeks (if you enrol early) for mid-term <br />&nbsp;&nbsp;&nbsp;&nbsp;Second, 3-hour class in the weekend (in this semester, <br />&nbsp;&nbsp;&nbsp;&nbsp;morning class)<br />&nbsp;&nbsp;&nbsp;&nbsp;Third, discussion is not restricted to theories, but may <br />&nbsp;&nbsp;&nbsp;&nbsp;involve history, policies, cultures, and so on.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ufEGRETilN2njeM81ucSETgvffDx1oD9",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1486,
                    "name": "LEE, Christopher",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "normal person",
            "date": "Jan 08, 2021",
            "title": "interesting course but definetely not an ez one",
            "comment_content": "13 cases about various risks, from reputation, FX, management, catastrophe risks etc. <br />content is diverse and its fairly interesting.<br /><br />6hours per week, on sat and sun, 1 quiz per weekend, 1 term paper, 2 bonus essays, one upfront midterm, 1 presentation",
            "comment_teaching": "the course is in format of case discussion, where the cases are published by Harvard BS, starts by discussing last weeks case (for around 1.5 hour) then quiz or sometimes skips to today's case presentation (30 mins) and Q&amp;A session.<br />the professor is very responsive and he is currently working in the ibank industry, so he has lots of experiences to share.<br />however, he sometimes goes too far and might dig too deep where I and many of us do not understand.<br />NOT recommended for year 1 students.",
            "comment_grading": "grading is absolutely terrible!<br />don't hope for easy grades.<br />there is a mid term in the first lesson (which is insane, need to prepare 300+ page case) and I screwed it (median), but there are no final exam<br />for other quizzes, I got 9/10 and some 8/10, while final essay 9.2/10, bonus essay10/10, bonus essay 2 10/10.<br />I got B- in the end.<br />I thought I would at least get an B as I got pretty decent score for assignments and I finished all bonus credits but I have no idea why I got b-...<br />maybe he just gave me 0% in class participation (which I admit Im not the most talkative person in class, but its too harsh for a year 1 to answer all questions about option pricing,right?)",
            "comment_workload": "not much workload if u are familiar will financial products, basic business concepts, risk factors... However it will be stressful if you have no idea how things work, as each cases are over 30 pages (some are longer) and you cannot just skim through cases without understanding. (or else you cannot follow in class)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}