{
    "error": false,
    "course": {
        "id": 1069,
        "subject": "SBMT",
        "code": "2010",
        "name": "Business Ethics and the Individual",
        "description": "This course presents and exemplifies three major traditions of ethical thought in East and West moral philosophy - namely utilitarianism, principle-based ethics and virtue-based ethics. Employing guest speakers, lectures, cases, contemporary readings, role-plays, fieldwork, reflective student writing, and discussion groups, the course engages students in a serious consideration of their own ethical standards as applied to their present academic environment and their future careers. Students come to understand through this course that while an ethical dilemma may be viewed in various ways depending on one's guiding assumptions, a decision and course of action nevertheless must be chosen in harmony with one's own moral convictions. For Business students only.",
        "categories": [],
        "website": null,
        "credits": 2,
        "semesters": [
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.58,
        "rating_teaching": 4.08,
        "rating_grading": 4,
        "rating_workload": 3.31,
        "review_count": 26,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 589,
                "name": "MIHOREAN, Mark Andrew",
                "count": 14
            },
            {
                "id": 591,
                "name": "HO, Ching Ching Mary",
                "count": 6
            },
            {
                "id": 633,
                "name": "CHUI, Hiu Yeung Samson",
                "count": 5
            },
            {
                "id": 239,
                "name": "LAFON-VINAIS, Veronique J A",
                "count": 2
            },
            {
                "id": 223,
                "name": "FORSTER, Paul Whitfield",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "0lWUhTkDMVzL0cJmDSQ58kSwk2BwXZEa",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "耶耶托尼",
            "date": "Dec 07, 2015",
            "title": "A course enables you to make many new friends and broaden your horizon without pressure",
            "comment_content": "The course will introduce many contemporary issues from local to international which can promisely inspire you a lot. However, none of the course content will be tested, so you don't need to have any revision for this course.",
            "comment_teaching": "Mark is a professor full of life experiences. His English is clearly understandable( Mark is a Canadian) and the teaching is very interactive and he engages students to actively engage in the class. He is nice, kind and responsive to student's opinion and queries.",
            "comment_grading": "Attendence record and classroom participation are particularly important for good grades. Handing all staff on time, attending all lectures and complete other basic requirements of the course as stated in the workload part below will secure you a grade of B range. Active class participation(including frequently answer professor's questions and conduct multiple times of news sharings) are a must to get A range grading.",
            "comment_workload": "You only have to conduct at least one news sharing per semester(1-2 min), one &quot;teaching session&quot; in which you need to answer the questions stated on a PowerPoint slide to one group of students and they will rate your performance, one passage of around 800 words regarding to your ethical analysis over a particular news issue and most importantly, a project which accounts for almost half of the course grade and you will be required to work with 7-8 other students together to work for a small business in our community and do something to improve the business.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rqAb2lZDHaJRd8nKcDKJ6euKLhcIOlrk",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jdub___",
            "date": "Dec 14, 2017",
            "title": "Inspirational Professor, Not-So-Inspirational Content",
            "comment_content": "Different topics related to ethics and its applications in business. The beginning lectures introduced different ethical principles, mainly western, but it all became applications in business from there. Personally I find this type of stuff pretty boring. Also, one has to form a group with other students to complete the Applied Ethics Service Project (AESP), which involves searching for a small business around the city to help improve its operations, but i don't think it's quite relevant to ethics. In fact, i think it helps build up one's soft skills.",
            "comment_teaching": "Mark is a great professor. Not only is his style of teaching impressive, he also has captivating presentation skills. He encourages students to express their thoughts to the class, in order to create an atmosphere of academic exchange within the class. I personally think this is a really good point about this course, but maybe it's because of participation taking up 30% of the whole course weighting.",
            "comment_grading": "50% - Applied Ethics Service Project (AESP)<br />30% - Participation (online discussion and in-class participation)<br />20% - Integrated test<br /><br />The project is apparently the most important part of the course, and it is crucial that you have the right group mates to work with, otherwise you definitely won't be able to do a thing. <br />It is also important that you answer Mark's questions in class frequently and express your opinions on the online discussion board on Canvas weekly, in order to get a good participation score.<br />The integrated test is based on the readings issued at the end of each class, as well as the issues discussed in class. <br />I was lucky to have great group mates to work on the project together; I also wrote on the online discussion board weekly except for the last week, and expressed my views in class every other week or so. Honestly i don't think i really aced the integrated test , but in the end I got an A. So that's why i believe BOTH the project and participation are the most important.",
            "comment_workload": "It's a bit tough as you need to hold meetings with your project group mates frequently, as well as find the time to head out to search for the right business. This takes the longest time, and my group mates and I had to wait until two weeks before the deadline of the project to be able to find a suitable business. There's also the weekly task of writing opinions on the online discussion board on Canvas, and a weekly reading best gone through before next lesson, as it will be discussed in by then, so it's no light workload.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DZFsWtZBCRynr1342JiVvlMVdk0c8lka",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Law~",
            "date": "Dec 19, 2016",
            "title": "",
            "comment_content": "Content is fair. Some of the contents are thought-provoking and suitable for business students. Corruption, branding, CSR are all what business students need to learn.<br /><br />However, the design of the course is quite bad and fails to reflect students' performances accurately. The instructors try to make the grading more objectively but usually they fail to do so. <br /><br />Some past students told me that Mark is always proud of HKUST as the pioneers among universities in Hong Kong for having Business Ethics Courses (and as business core requirements -_-)",
            "comment_teaching": "Mark is an experienced professor and business person. He has also worked as the school principal in an International School in Hong Kong (which means he knows how to manage students skilfully). He speaks fluently, confidently in class and brings the boring content some refreshing moments!",
            "comment_grading": "This is a course which is extremely easy to have a bad bad bad grade. (Although I still manage to get good grade from it)<br /><br />Assessment:<br />20% on Integrated Test<br />50% on AESP (Applied Ethics Services Project)<br />30% on Class Participation<br /><br />Some students play the game smartly and they easily get A-range. A great hours of devotion can mean nothing in this course. What you need is a consistently fair performance, play very safe, and make sure the quality of AESP is good (= understand what Mark wants in your AESP).<br /><br />I have heard that group leaders that are active in the process of project completion eventually gets a C. while some of my friends doze off in class, free rides in group project and turns out receiving A- or even A.<br /><br />You must understand the assessment criteria clearly and follows them smartly to get A-range.",
            "comment_workload": "Workload of this course is not as high as expected. What you need is consistent effort to participate in Online Discussion Forum, speaks up regularly in class. It is like a checklist that if you tick everything you are told to do, you will stand a chance to get A-range.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "h4RW6LE99VEKeohXthLwB2sJfbSHwGSD",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cyy_",
            "date": "Aug 23, 2016",
            "title": "BUSINESS ETHICS AND THE INDIVIDUAL",
            "comment_content": "It contains mainly two parts: ethical issues and projects. Honestly speaking, the professor's teaching about issues is quite boring and doll. But it's useful!!! It's a quiet important part when analysing your project. As for the project, it's kind of challenging but I did gain a lot. It's a very good chance to interact with local people and hk society, especially for nonlocal students.",
            "comment_teaching": "I was not attracted by classes so much. But you do need to participant!!! It counts for your grade.<br />I didn't talk too much with Prof Mary cuz' she looks kind of serious. TA Barry is very nice and most importantly, he's very handsome!",
            "comment_grading": "Class Participation 20% <br />Personal Reflection 20% <br />Ethics in Film 10% <br />The Applied Ethics Service Project (AESP) 40%<br />(Progress Journal (10%) Final Report (25%) AESP Presentation (5%))<br />AESP Personal Reflection 10%<br />Class participation and personal reflection will largely decide your final grade, and don't skip any class! It will deduct your participation mark!",
            "comment_workload": "It depends on what kind of project you do, and your group mates. But at least the workload will be the same as a 3 credit class.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Igm6lxIEDWXWNVDaj3wBgWgCj4MZr0Gr",
            "semester": "2015-16 Fall",
            "instructors": [],
            "is_author": false,
            "author": "mmashkina",
            "date": "Apr 21, 2016",
            "title": "",
            "comment_content": "I liked that we had to work on a real project with a real business. Enjoyed presenting to the business owners.",
            "comment_teaching": "Professor was teaching interesting things and updated us on news. I learn a lot in class, and even if I didn't follow some of the news, this class challenged me to do so.",
            "comment_grading": "Sometimes I felt that grading is based mainly on contribution to the class rather than on projects and individual assignments. I feel that our project was very good and I worked so hard on the individual assignment but still got average grades...",
            "comment_workload": "It depends on the project you do. If you pick a really challenging project, you will have more workload than in classes with 3 credits.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KY0WNK6FT06YN3bjTQ831cTyXwVqiyZh",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CRDZY",
            "date": "Feb 05, 2016",
            "title": "Easy, as long as you know what you're doing.",
            "comment_content": "You'll be introduced to a lot on contemporary issues regarding ethics ranging from Kantian ethics to utilitarianism etc. There's a lot of case studies with regards to fraud or unethical behaviors in the business world both in the past and present. Relatively up to date in terms of everyday news etc.",
            "comment_teaching": "When you go to Mary's first class, you'll realise that she says certain key phrases a lot. I won't ruin it for you, but go and see for yourself :)<br />She teaches in a very diplomatic manner, she'll constantly ask for your opinions and will adjust her teaching accordingly to your preferences. She is overall a good teacher but sometimes she'll go a little off tangent, just gently nudge her back on track.<br />She's very open to questions and participation, so don't hesitate to ask her anything that you may have doubts on.",
            "comment_grading": "I got an A+ but take it with a pinch of salt because there are a variety of factors that will affect your score. <br /><br />Most of the groupings are random so there isn't much you can do, so it's a game of luck. If you get a hard-working team then you honestly won't have a problem. However, for the vast majority of the class, they may not care about this course cause it's a 2 credit course. Be aware of this as you will probably need to carry your team really hard if no one is keen on working which will really affect your grading.<br /><br />Participate and make sure you ask questions. If possible, meet her during her office hours and ask her relevant questions related to your group.",
            "comment_workload": "There is a significant amount of work that you'll need to do. Besides group discussions on canvas and quizzes, you will be mostly occupied with the final group project which requires you to go out and help a Hong Kong company in an ethical way. Some people decided to help bread runs from large corporations or do lectures to secondary schools students about safe sex etc. <br /><br />This project will take up the most amount of time. I had to carry my team really hard because some of my team members were not helpful at all. This will all depend on who you get and what you plan to do. <br /><br />Good luck.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pBJhjQ9U4jLRRZ1LCukpzVSZiqDP0bE9",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                },
                {
                    "id": 633,
                    "name": "CHUI, Hiu Yeung Samson",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sparkler",
            "date": "Feb 04, 2016",
            "title": "SBMT2010 Good Grade",
            "comment_content": "about some marketing and psy aspect. CSR",
            "comment_teaching": "Many students said that SBMT2010 is a waste of time.&nbsp;&nbsp;but i found that the course materials are quite interesting. They are thought-provoking.",
            "comment_grading": "A-<br />Grades are not similar when you are in the same group. the range can be from C to A in a group only.",
            "comment_workload": "Light. All about is a project which is going to help a small business in the Hong Kong. Groupmates are really important in this course. The project needs to talk about CSR or something related to ethnics, <br /><br />Presentation is only a simple stuff, not a big deal.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XYKQeT0dqKGtKxzLpG7FCzWrtQP3tfjM",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ludocyc",
            "date": "Jan 26, 2016",
            "title": "",
            "comment_content": "The content of the course is satisfactory. Professor used some real case scenario to explain ethical issue. She encourage the class to express their own opinion and she emphasise that this course doesn't have any right or wrong answer as long as we explain our rationale, and it helps training our critical thinking skills. <br /><br />Year 1 student should be able to manage this course, with no so difficult content to be assessed, though I believe that it is useful for business students.",
            "comment_teaching": "Professor Ho taught the class in a professional manner and used her own experience to educate us. She also made effort to use hot issue on the news to illustrate all the content of the course.",
            "comment_grading": "As long as you finish all the assigned tasks, you will definitely get good grades for this course. This course is graded with absolute grading, where marks were allocated to each task such as AESP project accounts for 40% of course grade. <br /><br />The most important issue is to find&nbsp;&nbsp;good group mate, beware of free rider.",
            "comment_workload": "No mid-term, No Final.<br />Only one AESP project, write progress journal once every week and participate in Canvas discussion whenever there is a discussion topic. <br />In addition, answer question in class.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3Px5IUqPKcUGG5tRJYos5fXjvdFrIHI9",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 223,
                    "name": "FORSTER, Paul Whitfield",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "weeheeoo",
            "date": "Jan 25, 2016",
            "title": "interesting lesson related to ethics",
            "comment_content": "Very interesting lesson on ethics, watch a lot of youtube videos and listen to stories, study past examples. Have to do a group project related to business/ethics,",
            "comment_teaching": "great, he is funny <br />this is my fav lesson in ust",
            "comment_grading": "attendance and participation counted<br />he will ask a number of questions per lesson and the TA will mark down ur name if u ask or&nbsp;&nbsp;answer a question <br />group project occupies much <br />carried by great groumaptes and late hand in assignment twice and hea do finally got B",
            "comment_workload": "basically light<br />just 2 essays and 1 project<br />project requires group meeting",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uMcydzYjylsuL4ZH6mMy645fFvCDgUGU",
            "semester": "2015-16 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Al17",
            "date": "Jan 22, 2016",
            "title": "",
            "comment_content": "I think the content was pretty easy to follow and interesting as well.",
            "comment_teaching": "The professor was good with his teaching and likes class participation. He enjoys having discussions a lot and likes the idea of sharing ideas.",
            "comment_grading": "grading was pretty good. the more you participate and talk during class and also on the online discussion, it was a good class to have a good grade. the final project influences your overall grade the most",
            "comment_workload": "the workload is really light. the only thing that you really need to work on is the online discussion and also a short essay as well as the group project and presentation",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pCzKpvVu0lKivUQMRf23kUhdFCxFTmoq",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                },
                {
                    "id": 633,
                    "name": "CHUI, Hiu Yeung Samson",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YT",
            "date": "Jan 22, 2016",
            "title": "",
            "comment_content": "The content of this course is all about business ethics. Prof will talk about ethical issues and bring up discussion.",
            "comment_teaching": "Mark creates a fun and interactive learning environment. He likes students who actively participant in class and he responds to every answer/opinion.",
            "comment_grading": "Quite easy to get B range as long as you participate in class and show your commitment in group project. Personally I think class participation really affects your grade.",
            "comment_workload": "As a 2cred course I would say the workload is quite heavy. There are one ethical analysis, one group project (find a business and help them in relation to ethical issues), progress reports.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jnP8RQwG65RymssXSP75snzMSVGcKq2w",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cherry",
            "date": "Jan 21, 2016",
            "title": "",
            "comment_content": "This course is talking about business ethics like cooperating business responsibilities. I think it seems a bit boring since the content is something we normally know.",
            "comment_teaching": "Teaching style is fair but improvements can be made,&nbsp;&nbsp;Class is quite relax as well.&nbsp;&nbsp;All you have to do is to answer some simple questions. If you have active participation, you are able to get a higher bonus mark. The TA will help mark down how many questions you have answered for each lesson.",
            "comment_grading": "I think it is not that difficult to get a good grade if you have put effort on your ASEP project as well as the two personal reflections.",
            "comment_workload": "The workload for this course is quite huge as a two-credit bearing course. It mainly comes from the project. All you have to do is to find a company/organization, help them and show how you contribute to society.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "l2O1ARIDQll5cGaHA2TZSHR75qLPLQ3J",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Avi",
            "date": "Jan 15, 2016",
            "title": "Not the best course....",
            "comment_content": "Content is not complex at all. Fairly common sense. Little theory behind the ethics involved, but you have to know these theories very well and constantly relate to them. <br /><br />The TA often hands out paper hand-outs of readings",
            "comment_teaching": "Class is fairly relaxed. Teaching style is adequate, but not the best. Normally, this is dictated by the material, which as already mentioned, isn't all that interesting. Sometimes though, we discuss interesting topics like business scandals and the class gets into heated debates (which is great to use to your advantage to score participation points).",
            "comment_grading": "Very lenient grading. Just make sure your English is on point (the Prof. and TA love fancy words and complex sentences so really aim to refine your use of diction before this course). Also, ensure that you constantly participate in class, ask questions, respond at least thrice on the Canvas discussion board for each discussion. Respond with your own arguments and points (3 paragraphs), and for the other two responses, respond to your peers points. Find an argument that doesn't seem very strong and either build it up (i.e. I find your point to be an interesting one, but I feel that there can be more added to it....) or break it down (i.e. Although there are some truths to your point, I think that from a different perspective, it may not be true...)",
            "comment_workload": "Workload was fairly light. The majority of the final grade was based on the AESP project (form a group and venture out to assist an organization that is dealing with or involved in an ethical dilemma; can be either a for profit or non-profit organization). Final grades for AESP are based on a progress journal (10%), a report (25%) and a presentation (5%). Other things that are considered for the final grade is attendance/class participation which accounts for 20% (you have to speak at least twice every lesson to reach the highest band in this criterion), and your responses to online discussion forums on Canvas.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "29v2lt6gLvVB06BPk6E7LcMnEQ6DstOz",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                },
                {
                    "id": 633,
                    "name": "CHUI, Hiu Yeung Samson",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gracia",
            "date": "Jan 08, 2016",
            "title": "",
            "comment_content": "Discuss dilemma in real life and company.<br />Weekly &quot;teaching&quot; session,in which each student will do one time of sharing opinion of the case given.<br />Mini debate either per group or per individual about the controversy given.",
            "comment_teaching": "The class starts with 7students doing stand and deliver.Each week Mark will comment on the on-going online discussion,progress of AESP project,give weekly tips,and continue with each week topic,followed by teaching session,and sometimes added by mini-debate.<br />Helpful Lecturer and Teaching Assistant",
            "comment_grading": "Grade are given based on participation attendance,essay(30%),and project(including final presentation)",
            "comment_workload": "Stand and deliver controversial news for 1 minutes. Applied Ethics Service Project,in a group of approximately 9 students.<br />Weekly posting in canvas discussion.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BzPBfIJ64yNWd04AWVyJ2MDGmLlkcb7t",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cloud",
            "date": "Jan 07, 2016",
            "title": "",
            "comment_content": "Mostly about dilemma, CSR.<br />Better read the BBC website before writing your personal reflection<br />mark LOVE this<br />No need to remember everything",
            "comment_teaching": "Love his teaching style, especially &quot;tip of the week&quot;<br />Sometimes he shares his personal experience which is&nbsp;&nbsp;inspirational",
            "comment_grading": "i post comment on canvas once a week<br />Did public speaking once<br />Seldom answer his questions<br />finished my AESP quite well <br />Got a C+ at last",
            "comment_workload": "no final no mid-term no quiz <br />but one BIG group project<br />You have to find a SME and help the owner to solve his problem",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4IxlqeW0BhQt2AJtcP58cvCZFrbPnMr3",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Genn Bucker",
            "date": "Jan 05, 2016",
            "title": "",
            "comment_content": "Quite boring class to me.<br />Don't expect to learn much.<br />It will give you some idea of CSR though.",
            "comment_teaching": "I think it depends on professor. Teaching session and mini debates are quite interesting :P",
            "comment_grading": "Don't be serious about what Mark told you about the final presentation. If you wanna get good grade, be the only presenter of the group. Prepare your presentation, make a good one. DO NOT put too many words in your &quot;powerpoint&quot; slide. <br /><br />If you are active in-class, you will surely get an A",
            "comment_workload": "medium workload.<br />Just a project, an essay (the ethical analysis) and a presentation.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MXvuvUd7ZXCv7M32oWOkdMQfIMogRXzN",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                },
                {
                    "id": 633,
                    "name": "CHUI, Hiu Yeung Samson",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Dreamscometrue",
            "date": "Jan 04, 2016",
            "title": "To be honest, not a useful course.",
            "comment_content": "About ethics, in other words, it is about nothing. This course is just something for you to express your point of view on business ethics, you can't get something solid from the course.<br /><br />Required course for business students, better to take it in Fall.",
            "comment_teaching": "Mark is a talented business person, he had his own company, has been a consultant in various places. Not much fun in most of the time, but he knows some simple Cantonese, you may laugh at that time. <br /><br />He always praise students, and encourgaing them to speak. Always mentioning some phrases (please remember them and use it in works)<br />When he is happy, you will be very happy also :)<br /><br />Tutorial: only 2 tutorials sessions for each group, you will meet Samson, he is helpful and funny, you will be guided on how to finish the assignment. He is cute, and wanna be friends with students, a good TA with no doubt",
            "comment_grading": "10% online discussion<br />10% participation<br />10% teaching session<br />AESP project<br />Ethical review<br /><br />If you want to get good grade, it is better for you to have good english and speaking skills. <br /><br />20% A range( according to Samson)<br />Not few C range also<br /><br />Treat the project seriously, write in a business proposal way, it is important for what you have WRITTEN in the proposal and the report.",
            "comment_workload": "A 2-credit course with 4-credit workload. Many friends complained about it .<br /><br />Online discussions: 1 per week at least, DON'T do the minimum requirement<br /><br />Teaching: generally not bad, marks are given by other stidents<br /><br />Stand and deliver: share a news in ine minute, take it easy.<br /><br />Ethical review: write about a news with ethical concept, also talk about how you perceive right or wrong. Each get similar marks (22-23/30)<br /><br />Project: the one that affects your grade most, you have to find a small business and help them. Mark stressed on legacy effect of your help. Remember, WRITE it well.<br /><br />ATTEND EVERY LECTURE AND TUTORIAL or your grade will be in trouble",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QNY69Mtv4tOQg93oiXDndazylYwmbosW",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 0
                },
                {
                    "id": 633,
                    "name": "CHUI, Hiu Yeung Samson",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Chung",
            "date": "Dec 18, 2015",
            "title": "",
            "comment_content": "This course will cover some issues about business ethics and responsibilities. Students need to have active participation to response with the issue told by the instructor. There will be a 1-minute sharing section, students have to prepare some current issues and discuss in the class.",
            "comment_teaching": "His English is very understandable but he speaks slowly and it is a little bit boring. He is very nice and responsive to the ideas shared by the students, some of the responses are inspiring.",
            "comment_grading": "Active participation is important for students to get an A. Although Mark said the presentation of AESP would not contribute into the grade, an impressive presentation will let Mark remember your project and probably the grade will be better. Also attending lectures and tutorials are important as they will count as participation mark.",
            "comment_workload": "One 800-word reflection is needed, to write the reflection about a current new. Also, it takes 1-2 months for each group to complete the project, including finding the shop and helping it.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EozliJtG74tEdo8xAhUsLshRwIjOzLrE",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Inez",
            "date": "Dec 07, 2015",
            "title": "",
            "comment_content": "In fact the content is quite meaningful but not really relevant to business ethics, e.g. somethings about the companies' ways to operate is mentioned, the relationships of companies or other things. Some daily tips about studying or sleeping may be mentioned too.( hahaha<br />To some people it may seems to be quite boring as there is no exam and in fact nothings mentioned can be used in the project...",
            "comment_teaching": "In my opinions, quite interesting teaching including discussions, videos, IPRS, debating between groups.",
            "comment_grading": "Some people said he gave bad grades...<br />I think it depends...for examples in our group, there are all grades between A to B-...It's quite a large range and&nbsp;&nbsp;you can hardly predict your grade...well I got a good grade at the end",
            "comment_workload": "Very light workload. 30 words replies in the discussion board, a assignment, progress update and a final report is needed only...It is just hard to find a shop to do your project...others are all easy to finish...in case you have some good group mates.<br />You don't even need to do a ppt to present...",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "a28RDqYwQoIBj4qye1q43fEd15NtoACe",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 591,
                    "name": "HO, Ching Ching Mary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Avocado",
            "date": "Dec 04, 2015",
            "title": "",
            "comment_content": "Content is interesting enough, however a lot of it seems like common sense. The class power points are very in-depth, and are there are also quite a few reading materials distributed within class. However, a lot of the concepts are quite simple to understand, and parts of the course are rather similar to the Theory of Knowledge course in IB.",
            "comment_teaching": "Relatively engaging teaching, however the course content is not always that interesting and it may be quite dull at some points in the course. The professor does give plenty of opportunities for participation and discussion, and is also very helpful if you approach her with any questions regarding the course content or project.",
            "comment_grading": "Grading is relatively fair. In-class participation and attendance are part of grade, and missing classes results in a deduction of your 'participation' grade. Try not to skip class, because there are many opportunities to get participations points, through class debates or discussions. Online discussions are also graded, and missing the deadline results in no participation credit for that discussion. Grading is quite fair, however your work has to be of good quality and it must be grammatically accurate. There are two reflections that are to be submitted - one is a personal reflection, the other is a reflection on the AESP project.",
            "comment_workload": "There is a Applied Ethics Service Project which is done in your own time, and you get ~2 lessons to brainstorm and pick a topic, and then 1 lesson to reflect, and at the end of the semester, there is a compulsory presentation. There is also a AESP final report which is graded. The total time that each group member should contribute to the AESP is around 8 hours, provided you don't have any free-riders. Weekly class discussions are posted on Canvas, and contribution counts as part of the 'participation' grade. There are also 2 personal reflections to be done (300-400 words) which are not too challenging. Workload is relatively fair as long as you have good group members for your AESP, however if you want to conduct a good AESP, make sure you have a evident legacy effect for your project.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Z47zr0iV2YHNB3WaYsT7hRNohpskqfI9",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Arange",
            "date": "Sep 22, 2015",
            "title": "",
            "comment_content": "This course talks about business ethics but they are only something that is useless. Since there is no examination on the material taught in class, only a few students listen to what Mark says and the other students just do their own things.",
            "comment_teaching": "The lecture is very boring. In every lecture, the things to do are almost the same. First, he will invite about 7 students to give a 1 to 2 minute short talk about current affairs. Then, he will start the talking the main topic. Afterwards, we will have a short discussion with classmate. Then, we will watch a video, answering a few PRS questions. At last, we will sit into a group and have a teaching session.",
            "comment_grading": "This course involves many different types of assessment<br />First, participation weights 30%, including 10% for attendance of lectures and tutorials, 10% for canvas online discussion, 10% for teaching session, another 30% of course grade is the personal reflections. There are totally two personal reflections, each weighs 15%. At last, the applied ethics service project weighs 40%. The grading is fair.",
            "comment_workload": "The workload of this course is very heavy although it is only&nbsp;&nbsp;2-credit course. You need to write personal reflections, post at least one post in the online discussion board, do a project, attend one of the two talk, participate in a teaching session in one of the lessons, having a short debate at the end of the lesson.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OoYtP180sctMPWx0gLyCQKUuOcom7zpY",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 239,
                    "name": "LAFON-VINAIS, Veronique J A",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gracie",
            "date": "Sep 03, 2015",
            "title": "",
            "comment_content": "Not very solid content.<br />Mainly about common sense and some concepts and models for business ethics.<br />Discussion about some related social problems.<br />Group project, essays and participation are graded.",
            "comment_teaching": "Good professor. Very nice and humorous. Might be strict in some sense.",
            "comment_grading": "Very low in first self reflection. Above mean in the second. Above mean in group project. Full mark in participation. Group leader.<br />Finally got an A.",
            "comment_workload": "Extremely heavy. Like a 4 cred course for me.<br />Good team corporation is very important.<br />Good and plausible project topic is very important.<br />Might help you a lot in presentation skills.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5WDMpRRvHF2K8NtSlTArMbd2VXJL9hzO",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 239,
                    "name": "LAFON-VINAIS, Veronique J A",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "acht",
            "date": "Aug 22, 2015",
            "title": "",
            "comment_content": "Ethical issues regarding businesses, such as corruption, food safety, child labour. Nothing particularly special.",
            "comment_teaching": "Veronique is an easy professor, jokes quite often. She also likes to guide students to think. But anyway, SBMT 2010 is your showtime (AESP, presentations, and lesson discussions), so her teaching is unimportant.",
            "comment_grading": "The grades include two reflections, lesson presentation, AESP and participation.<br />I would say being active in classes and presentations (just get more parts to present) would get you a better grade.<br />For the two essays, write something different and personal. The TA would not be pleased reading hundreds of repetitive ethical dilemmas. <br />The marks are not strict content-wise, just be logical and interesting.<br />Forced myself to be a bit more active, got A.",
            "comment_workload": "Not heavy at all, but if you want to do a good AESP project you would need some time.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pfDzTxzuY8DSmiUVdwnIsXFvaBIx0c4y",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "shk",
            "date": "Aug 16, 2015",
            "title": "",
            "comment_content": "this course is about teaching business students about some business ethics like corruption and marketing stragegy and so on.",
            "comment_teaching": "Mark's teaching is quite good and lively, he gives plenty of time for students to hv interaction and learn from each other.",
            "comment_grading": "The grading is quite good especially for those students who are active in class, like always answer the questions and lead the group. Moreover, students who hv participated in the group presentation might hv a higher grade.",
            "comment_workload": "the workload is quite light, but it depends on your groupmates also. for individual work, there are only 2 personal reflection and online forum. For group work, there is a project about business ethics or helping the society.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xZDgUi6kejaOHZ35npSATHBxmHO7EQxE",
            "semester": "2013-14 Spring",
            "instructors": [
                {
                    "id": 589,
                    "name": "MIHOREAN, Mark Andrew",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "OscarHazard",
            "date": "Aug 16, 2015",
            "title": "",
            "comment_content": "呢科主要學business ethics, 其實common sense為主, 用途不大, 唔聽都無咩所謂 好多人生的抉擇, 利益同道德的選擇,每堂至少有兩三次, 都算有少少思考空間",
            "comment_teaching": "Mark唔可以話教得差, 每堂都分享下自己經驗,加埋好多人都踴躍發言, 所以無咁悶,每一堂都會有小組討論的時間,簡單來講即係吹水, 雖然係兩個鐘一堂, 都算過得快",
            "comment_grading": "40% project 相當chur<br />15% *2 Personal assignment 輕鬆的<br />30% online discussion 每星期一篇, attendance<br />其實幾好grade, 做齊野輕鬆b range<br />聽過有人無交一篇personal assignment, 無做過discussion, 又成日走堂, 起碼無左35%分,都有C-, 真係堅好grade",
            "comment_workload": "2cred course, 4 cred workload, project 真chur, assignment 同discussion 都寫唔少野, 好怕寫長文的話真係要做定爛grade 的準備",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Z0UWaN7KkHjkyCXazSU6hgV6wfvrifHt",
            "semester": "2013-14 Spring",
            "instructors": [],
            "is_author": false,
            "author": ":)",
            "date": "Aug 13, 2015",
            "title": "",
            "comment_content": "Whole course is about doing project and project....",
            "comment_teaching": "Class content is not really important because there is no midterms or exams. Mark (professor) hates people chatting and playing on their phones. He may call you out to answer questions or share your jokes if he sees you chatting a lot.",
            "comment_grading": "Look out for freeriders because a big part of your grade is from the project. Sad news: your groupmates are assigned. Attendence is super important here!!!! try your best not to skip class.",
            "comment_workload": "workload for this 2 cred course is as much as those 4 cred ones. um... good luck.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}