{
    "error": false,
    "course": {
        "id": 1071,
        "subject": "SBMT",
        "code": "2100",
        "name": "Social Responsibilities Project",
        "description": "This course is offered in the form of a community project at a designated non-governmental organization (NGO) under the supervision of the School's Undergraduate Programs Office.  Each project will consist of at least four elements, namely training workshops delivered by members at the host NGO, design, implementation and execution of the service-project as instructed by the host NGO.  Approval from the course coordinator is needed prior to enrolling in the course.  May be graded P or F. Students may repeat the course for credits if different topics are taken.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 5,
        "rating_workload": 5,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [
        {
            "hash": "4rNHhcdbkcPiEbFR9f3gJNplUMtLba2n",
            "semester": "2017-18 Spring",
            "instructors": [],
            "is_author": false,
            "author": "lonelyguy",
            "date": "Jun 01, 2018",
            "title": "Easy course and low effort",
            "comment_content": "A 2 credit social service project course. Mine is SBMT 2110G which is about going to elderly home and visited the elderly and made a life story booklet to the elderly. Each group is constituted with 2 students from business, science or engineering school.&nbsp;&nbsp;You have to visit the elderly for at least 8 times and stay with him for not less than 45 minutes. You can chat with their past life and just sit together. The visiting date and time are all set by you and your teammate so it is super flexible. But, make sure you have to seek the permission of the social worker first and let them know you guys are going to visit the elderly.",
            "comment_teaching": "No teaching at all. You don't need to attend any lectures or tutorials. You just need to attend 1 workshop and the workshop is easy and not demanding. You can know the rest of the participants of this course and have some scenario role play. The social workers will give you some comments and tips on how to chat and communicate with the elderly. It is very easy.",
            "comment_grading": "A 2 credits course, with P or F grade.<br />This course is separated into 2 semesters, winter and spring. <br /><br />You have to do a minimum of 8 visits within 4 months, hand in 3 progress reports to the SBM staff regularly and finish making the life story booklet in late April. You have to attend the yum cha party at the end and present the booklet to the elderly on that day. If you fail to do anyone of this, you cannot pass the course. But, in fact, it is super easy to pass it cause the SBM staff is super nice and friendly. She will postpone the deadline if you really cannot make it. <br /><br />So, it is a good choice to apply for this course if you are lack of credits and want to have some easy and light workload course.",
            "comment_workload": "Not that heavy workload since everything is so flexible except the deadlines set by the SBM staff. The rest are just set by yourself. <br /><br />Workload:<br />- 3 progress reports<br />- A minimum of 8 visits in 4 months<br />- 1 final product",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}