{
    "error": false,
    "course": {
        "id": 1136,
        "subject": "SOSC",
        "code": "1270",
        "name": "International Law",
        "description": "International law (IL) is a system of principles than govern relations among states and the human rights of individuals. It is mainly studied through analyzing international agreements (treaties), customs and court decisions. The topics taught in this course are the same as those taught in almost all introductory IL courses everywhere in the world, including the history and sources of IL, states and international organizations; human rights; sea, air and space law; environmental law; the use of force; and the peaceful settlement of disputes. Many of the topics are frequently discussed in the mass media and concern events of world-wide importance.",
        "categories": [
            "Common Core (SA)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1630,
            1540,
            1510
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.21,
        "rating_teaching": 4.04,
        "rating_grading": 4.08,
        "rating_workload": 4.43,
        "review_count": 89,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 784,
                "name": "SAUTMAN, Barry Victor",
                "count": 82
            }
        ]
    },
    "reviews": [
        {
            "hash": "FeNU1WMxQCKpeA2foivrBQAzWOqeAewp",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Law~",
            "date": "May 17, 2017",
            "title": "Generous Grading but beware of falling into C and D Range",
            "comment_content": "SOSC1270 introduces the fundamentals of International Law. I personally would interpret it as a 'history' course rather than a law course as a great portion of the course simply outlines the historical development of International law in different areas (such as Human Rights, Territory, Pollution, Nuclear Safety, Armed Conflicts ......), which means there are not many (or very few) legal principles to be remembered.<br /><br />There are some suggested readings provided in the course but they are not necessary. You can do simply rely on the Lecture Notes because most of the questions were extracted from there (but some questions will be modified to assess the clarity of your concepts)",
            "comment_teaching": "WARNING: HE IS A PRO-CHINA PROFESSOR<br /><br />Professor Barry Sautman is one of the very good professors I have met in HKUST. He is a cheerful old person with charisma. In exam 1, he welcomes some of the students to join the course (because many students haven't shown up in any classes before and their participation of Exam 1 is their first time to step into the class)<br /><br />Although he speaks quite boring and most of the students don't attend his classes, I would say he is a wise person and you would know more about how states deal with each other, and some mechanisms on how global community is solving problems internationally. (yeah it is a good 1000-level course)",
            "comment_grading": "Very Generous Grading.<br /><br />In 2017 Spring Semester, he offers 26.9% A-Range (Most of them are concentrated at A). If you get 0.8 SD higher than mean in overall assessment, you will receive A-, if you are 1 SD higher than mean, then you will get a A. Even though you are not very strong and you get 0.5 SD higher than mean, you will secure a B+. This is a very good grade for a course with such low level of workload.<br /><br />I get a B+ because I screwed my first exam. Each MCQ you attempt = 1% of the course total feedback. Therefore, it means that it is also very easy to get killed in this course. <br /><br />2017 Spring Semester shows that 4.6% of enrolled students (total of 12) receive an F (which is quite high), he also offers 27 D, and over 80 C-Range (around 125 students receive C+ or below in a 260-student class). Scoring 3/4 marks below mean will get you a C.<br /><br />For Business School Students, you may treat it as the common core version of ECON2113 (Zhang's section) in terms of grading. If you score above mean, you will have a fun time, but you will definitely suffer with a bad bad bad grade if u score below the mean.",
            "comment_workload": "0 workload.<br /><br />No Attendance with all lecture videos released after every class is finished. (but in fact I have never checked out the videos and I start revising the exams 2/3 days before)<br /><br />In general, I would say hard working students are definitely gaining advantages because the part of &quot;understanding&quot; is important to study IL. So if you are aiming high and self-motivated this is a very good course.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 9,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ibhFeugR6Cl7hSf85AJQDrYDviGm0VK5",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gunfm1939",
            "date": "Dec 15, 2020",
            "title": "Exaggerated grading. Don’t ff. A blue-ribbon tutor btw.",
            "comment_content": "There are 8 lecture notes in total, each focusing on one specific international law topic, they are: History, Environment, Human Rights, Peaceful settlement, Sea+Air+Space, states, treaties and use of force. <br /><br />Since zoom semester starts we only got 1 final exam, 80 MCs with all recorded lectures provided. However, you could choose to compete for 12 quotas in writing a paper with on-class presentations (and 10-20% exam MCs are based on student presentations). <br /><br />Berry CLAIMED the grades of paper-writers usually get one grade higher than they should (in view of their exam Mc’s results). Quite depends on whether you like studying cases and history",
            "comment_teaching": "He will illustrate lots of historical examples and quite a lot of them are repeated, and he highlights the importance of knowing the key points shown or reflected from them. Mainly about concepts and memories, and he is always passionate to answer your questions f2f, in email or during the 2 Q&amp;A session provided. <br /><br />One major problem maybe his *pro-Chinese* stands, as the content mainly focuses on criticising US constantly, something about the selection of examples and contents (He also think the protesters in HK were paid and controlled by foreign powers in other occasions), otherwise his explanation is acceptable, just like the average grade UST students have.",
            "comment_grading": "Don’t be fouled by other comments, the grade is just similar with other SOSC/HUMA course, ABSOLUTELY NOT EXTRAORDINARY GOOD GRADE, especially when you do not write the papers. Managed to revise all lecture notes and attend all lectures (With lots of jotted notes) may get you a mark little higher than the mean, and a B grade. Every 2-3MCs equal a sub-grade (eg 40/80=C, 43=C+, 46=B-, 49=B...), mean and median are around 47/80, SD 9.X.<br />160-men Class<br />23% A<br />35% B<br />29% C<br />11% D-F (12 failed)",
            "comment_workload": "Quite flexible, theoretically you could skip all live lectures (No attendance) and revise them the night before exam, or writing a paper along with workshops, guidance, presentations and Q&amp;A sessions. Totally depends on your choice and luck (in getting a place to write the paper).",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "QigZqEcjEblv8kSpJhRTb3olK2GHZZjy",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "goodpeople",
            "date": "Dec 11, 2020",
            "title": "Worst course in HKUST",
            "comment_content": "Historical development of IL;<br />Treaties, Customs, and other sources;<br />States and other entitles;<br />International human rights;<br />Law of sea, air, space;<br />Environmental law;<br />The use of force;<br />The peaceful settlements in international disputes;<br />Student presentation",
            "comment_teaching": "Barry is professional in International Law and he talked many cases and examples outside the ppt. But he spoke slowly and sometimes he just read out the ppt. Those ppts are quite messy and you have to make you own notes.",
            "comment_grading": "Due to COVID-19, there are two options for grading.<br />Option A: essay (50%) + in-class closed book final exam 80 MC (50%)<br />Option B: in-class closed book final exam 80MC (100%)<br />** only 12 places for writing essay (lucky draw !!!)<br /><br />Mean:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;46.5<br />Median:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;47<br />SD:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;9.5<br /><br />The percentage distribution of the course grade:<br />A&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;23.8%<br />B&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;35.4%<br />C&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;29.3%<br />D&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;6.6%<br />F&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4.9%<br /><br />I was not selected to write essay and I got 40/80 in final exam. Grade C.<br /><br />If you don't have interest in law or hate law, like me, NEVER choose this course. If you cannot write the essay, QUIT IT!!!!!",
            "comment_workload": "You have to revise 8 chapters and 12 student presentation ppts for final exam. The workload is so heavy before the exam and it took me for a whole week to recite principles and cases. But my hard work did not pay off.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 10,
            "vote_count": 15,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bsB6lzIOalU706i8XeU5z84vRtMC6VvA",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Ustrubbishgrade",
            "date": "Dec 12, 2020",
            "title": "the worst common core that I have studied",
            "comment_content": "Many content, difficult to remember all the stuff.<br />Due to the dieases, this semester only had final examination. As a result, it is very difficult to remember all the contents.<br /><br />Don't register this course if you dont write the essay. Writing essay can have a better grade. But few people could choose to write essay. Deciding the people who could write essay was by lucky draw, quite unfair.",
            "comment_teaching": "Very boring. The powerpoint was very messy.",
            "comment_grading": "Utterly bad. I got 44marks, just below 0.1-2 sd. Got C+ eventually. Too bad grade if you dont write essay. 10% of people got d range or below.<br /><br />In other sosc courses, I can get&nbsp;&nbsp;B range or even A range. Sosc 1270 was really a bad course.",
            "comment_workload": "The workload came from memorising. It was difficult to memorise all the stuffs.<br /><br />If you choose write essay, you have additional workload.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ch0xpCTFT6hC7nE2Pib3JWtniJuQm4iF",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hei Pang",
            "date": "Jan 22, 2018",
            "title": "",
            "comment_content": "The content is quite interesting but there are lots of cases to review and studied. You have to remember slight details of the cases and the law principles involved.",
            "comment_teaching": "Teaching is a little bit boring but the professor clearly illustrated the concepts. There are a lot of things that he didn't put into the slide so pay attention.",
            "comment_grading": "Grading is quite generous as the finals and midterms are not very difficult if you studied for it.",
            "comment_workload": "In my opinion, there aren't any workload involved as there are no assignments unless you volunteer for presentation, which will change your final exam grading.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iKFwGFVrCws7qda9ToVAJOa1ptCYJyDJ",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "淺水健",
            "date": "Dec 11, 2020",
            "title": "trap course",
            "comment_content": "The content is about the international issues such as treaties, human right, environmental protection, how the countries due with the wars etc. <br /><br />At first you can choose to do the project group with other people or you able to all in final examination.<br /><br />The lecture note of this course is design very badly. Although there is translate to Chinese for student easier to understand. However the content is just putting such words and do not organised it. And there are many content that is not inside the lecture note. If you are not a student that familiar with the internal issues it would be a&nbsp;&nbsp;disaster for you to jot note on classes. <br /><br />There are several additional readings. They are not so relative to the content of the course, just skip it and save you time.",
            "comment_teaching": "The professor speak very boring, when you are sit in front of the computer on zoom it is extreme likely to feel asleep . zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz",
            "comment_grading": "very very bad, the total score is 80 and my score in final is just below the median a bit&nbsp;&nbsp;that 43(less than a half of sd!) and get C + grade finally.",
            "comment_workload": "Very few workload that you don't have midterm that force you to all in final, when your final make a bit mistake you will get very bad result <br />So if you want to have good grade you have to make very big effort. That's why I score this course workload mark so low.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "PWSZKKYi07Ag8K34oBlVFf2Fm3frjVx6",
                    "name": "IL-ChineseSyllabusFall2020",
                    "format": "pdf"
                },
                {
                    "key": "Yc5CJ9DOr8kLSHrDZHmAQZJiu9fjiMMb",
                    "name": "ILSyllabusFall2020",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "Tkdk4oNbJoe1cbCzcHhuVIwxaTe88r1V",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Connie lolo",
            "date": "Aug 25, 2017",
            "title": "good lecturer, you need to have clear concept. it might be easier for senior students.",
            "comment_content": "Many concepts to memorize. But some of them are common sense. The content is rich. There are also reading materials and tutorial materials.<br />They are <br />Historical Development, Customs and Treaties , States and International Organizations ,International Human Rights ,:Sea, Air, Space Law ,Environmental Law , The Use of Force,Peaceful Settlement of Disputes,Presentation of student papers.",
            "comment_teaching": "The professor is excellent. He gives out rich content. Make sure you understand all concepts. His English is good but simple, and understandable. He did provide lecture videos. But better attend lectures.",
            "comment_grading": "All mc questions. You need to understand all concept.<br />overall, sixty something out of 100 is a mean, it is C+/ B-.<br />The mid term mean is 30/42. Exam mean is 35/50.",
            "comment_workload": "Better attend the lectures or watch all the lecture videos so that you can understand and clarify the concepts. There are also reading materials and tutorial materials to read. Unless you do the presentation and essay, which is optional, you don't have much workload. However, people who did the presentation and project obtain a higher sub-grade for the final grade.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bcNHZMLH7nQH2LWUGMvlsAvtn8FWVcin",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "thumpn",
            "date": "Aug 23, 2016",
            "title": "Recommended!",
            "comment_content": "The content is broad and fundamental. A number of cases would be discussed under every topic. Took this course to get a taste of law and liked it!",
            "comment_teaching": "One of the best in UST, teaching is vey clear and fun. Barry is so knowledgable in this area that he could answer any questions raised by students and explained in details.",
            "comment_grading": "Grading depends on how you are doing in the final exam and the paper (in summer all students are required to do the paper and a presentation). All questions in final exam are in the form of multiple choices and are mainly about understandings. Going through course videos would definitely help since some points covered in the exams are not on the notes.",
            "comment_workload": "No assignment, but would need to do some reading to better understand the content. Since I took this course in summer, the workload was relatively bigger because paper and presentation became compulsory.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "y1mstSIEfNtFxsyG26Z94hiuWLz0U6gb",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Heather Choi",
            "date": "Jan 30, 2023",
            "title": "",
            "comment_content": "唔同同國際法有關嘅topic,有興趣會覺得幾得意，冇興趣嘅話上堂就好悶,所以我都成日走堂,同埋每一個topic啲notes都好多，有幾份係90頁",
            "comment_teaching": "好樂於解答學生嘅問題，上堂會補充好多額外嘅知識，唔係照powerpoint讀嘅老師",
            "comment_grading": "no assignment ,didn't take attendance ,得一個final,可以揀做research paper，會比topic 你揀,佔一半final成績，我冇揀，所以Final exam嘅分數就係我嘅grade, final係MC而且中英對照，考之前睇一次啲notes去考就得，唔洗刻意背,係容易靚grade嘅course<br />A- 55/80 (Mean 45.9)",
            "comment_workload": "係我最輕鬆既一個course，冇功課，我又冇揀做research paper,除咗Final前用啲時間溫書基本係0 workload",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DF6hTRsACKjXAIOJnCzeqRv0zgAPJJMW",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "America stan 80",
            "date": "Dec 17, 2022",
            "title": "I love Canada and Canadian prof :)",
            "comment_content": "1. Historical Development of IL<br />2. Treaties<br />3. States<br />4. Human Rights<br />5.Sea, Air, Space Law<br />6. Environmental Law<br />7. The Use of Force<br />8.Peaceful Settlement <br />9. Student presentations ( this was unexpectedly annoying for me )<br /><br />Most of his slides have 40 pages written in Chinese and English. The content is constructed by cases and their related principles. Prof also talk about the political history of different countries in lessons.",
            "comment_teaching": "He is definitely a resourceful and knowledgeable educator. He always speaks fluently in his lectures, willing to answer students' questions with a lot of details. My only dissatisfaction is that he became extremely focused when delivering his lectures, so sometimes he forgets to move along the slides as he speaks. Sometimes when I jot notes on what he said, I realize what I wrote was on the next few pages of the slides. But other than that, he is a good professor.",
            "comment_grading": "Grade: 100% final exam (Scheme 2: 50% exam +50% project)<br /><br />For my class:<br />Mean:  45.9 <br />Median:  46<br />SD:   9.2<br /><br />My score: 60&nbsp;&nbsp;got an A",
            "comment_workload": "Deceptive workload. The only requirement of this course is to take the multiple-choice (MC) exam totaling 80 questions (each question in both English and Chinese). 64 questions based on lectures, and 16&nbsp;&nbsp;based on student presentations. However, the workload is not as light as it seems. Because the professor's ppt are poorly organized and he often gave important examples that are not mentioned on the slides during lectures. Therefore, you will be taking a lot of notes in his lessons. If you want to have easier time for revision, you may consider making your own notes. In addition, the exam was held on the 30 November, which clashes with assignment ddl in other courses, so you may want to prepare for the exam (start reciting) in advance. For myself, I spent 4 days on it and fortunately my efforts paid off.<br /><br />Project: It is optional and I did not take it.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FNROFfP8OjFeEVYYwVNIMxAz2Rgrvizn",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "oc2pus",
            "date": "Dec 14, 2022",
            "title": "Great Course",
            "comment_content": "International law, but the course Dr. Sautman doesn't make you memorize any clauses. You'll first be taught what makes up the IL and internaitonal society, followed by the ILs on topics such as human rights, environment, war, and disputes.<br /><br />This IS an easy A (even A+) course AS LONG AS you study. What this means is that as lots of others said, this is an easy course. However, it doesn't mean that Dr. Sautman will shove an A into your mouth even if you failed miserably on your final. We are in a university and if you want a good score, you have to spend time studying the course.<br /><br />I actually had a tight schedule because I enrolled to 19 credits this semester. I procrastinated until the end. It only took 3~4 full days to prep for the final exam. A tip for a good student, please attend (or at least follow) the class. As I reached to the end, I saw a lot of missing seats since this is a final 100% course. Some of the contents IN the PPT are NOT covered in class while some contents NOT in the PPT ARE covered. Some funny IL examples that Dr. Sautman shares may be on the exam. Its fun when you hear it, so the people in class will not forget them. However, others who just studied through notes won't be able to get some Qs right.",
            "comment_teaching": "The teaching style is somewhat unorganized. Its more like fun issues about international law. BTW, if you find a lot of grammatical &amp; spelling mistakes in the file, you are not wrong. There are tons of errors that kind of made me daubt the professor's nationality.<br /><br />This is kind of fun if you are interested in politics and social science. For me, great. Apart from the easy course (since we don't memorize detailed dates, names, and clauses of treaties) Dr. Sautman is very knowledged in his field. Ask him anything about IL and he will explain it to you.",
            "comment_grading": "In case of 22-23 Fall class,<br />The final exam statistics is:<br />Mean:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;45.9 out of 80<br />Median:&nbsp;&nbsp;46<br />STDEV:&nbsp;&nbsp;&nbsp;9.2<br />(Beautiful bell curve BTW)<br /><br />It seems you get an A+ if you score around top 5%<br />I scored 62 and got an A+",
            "comment_workload": "100% final -&gt; No work at all<br />50% of it can be assessed through presentation if you win the lottery.<br /><br />Apply for the presentation unless you are confident that you can get a satisfying score on a 100% final. I did apply it as well.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GuvYGx32IYB0ADhF96GrqUsse8DfPghd",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gab",
            "date": "Jan 26, 2022",
            "title": "Low-workload SA course, easy to get B range grade with minimal effort",
            "comment_content": "There are 8 topics, namely<br />Historical Development of IL;<br />Treaties, Customs, and Other Sources;<br />States and Other Entitles;<br />International Human Rights;<br />Law of sea, Air and Outer Space;<br />Environmental Law;<br />The Use of Force, and;<br />The Peaceful Settlements of International Disputes;<br /><br />There are many facts and definitions taught, with the addition of relevant case studies.",
            "comment_teaching": "Barry speaks loudly and clearly, and is very friendly. During class, he will generally just read from the PowerPoint, however he invites discussion if you ask a question.",
            "comment_grading": "There is a final and no midterm<br />The final consists of 80 mc questions in 80 minutes, asking about definitions and certain details of case studies. <br /><br />To achieve a good grade in the final, you need to memorize a lot, but passing is not difficult with common sense. I barely studied (30 minutes of reading the PowerPoint before the final) and got 46/80, which was a B- grade. <br /><br />There is also an optional essay research paper, where you can work yourself or with a partner. The paper should be 12-15 pages with a topic related to international law. After writing, the group must present their paper to the class in a 15-20 minute presentation. Only 20 groups can write the paper, and who gets to do the paper is done via lucky draw. Both partners share grade equally. I was able to do the paper, and received an A- grade on the paper.<br /><br />There are 2 grading methods:<br />Final 100%, or;<br />Final 50% and Essay 50%<br /><br />With my combined final grade of B-, and essay grade of A-, I achieved an overall grade of B+. With slightly more than minimal effort, a good grade can be achieved in this course",
            "comment_workload": "If you are not selected for the essay, there is 0 required workload. There are no assignments, and you don't need to study much unless you want to get A range grade. <br /><br />There is no attendance for lectures, and all lectures are recorded in case you want to re-watch something. <br /><br />If you are selected for the essay, expect to spend at least 1 week researching and writing the paper.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "8UU5xxutrNZllr9A3SBBPgpviY2iDI9x",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "a s",
            "date": "Jan 22, 2021",
            "title": "Interesting Course",
            "comment_content": "The contents of this course would interest those who enjoy learning about current affairs, history, etc. It wasn’t very technical but I did learn a lot since the course covers a wide range of topics in a short span of time. <br /><br />The syllabus is as follows:<br />Historical Development of IL<br />Customs and Treaties<br />States and International Organizations<br />International Human Rights<br />Sea, Air, Space Law<br />Environmental Law<br />The Use of Force<br />Peaceful Settlement of Disputes<br /><br />Aside from lectures, the exam also covers the 12 presentations based on student papers. The results of the lucky draw which determines who gets to write these are announced after the add-drop period, therefore be mentally prepared that you may not get to do a paper. Students could choose to do the papers in pairs so more students are allowed to write. We are also provided with a few articles as supplementary materials for the course but I don’t think it’s necessary to read (I didn't).<br />This year, the number of presentation-based questions were reduced -- 74 questions were based on lectures and 6 were about student presentations.",
            "comment_teaching": "Although I feel he speaks too slowly and somewhat monotonously, Barry is eloquent and his lectures were easy to comprehend. It’s important to watch his lectures, even if you watch at a faster speed, since the lecture notes do not contain all the material covered in the exam. <br />Since this semester was over zoom, there were some technical difficulties but Barry made sure to answer all our questions -- after lectures, over email or on Canvas. He also holds optional Q&amp;A sessions where we can ask additional questions. Not only is he approachable, but also knowledgeable. His political opinion is quite clear but he doesn’t force it on you.",
            "comment_grading": "This fall there was only one exam instead of the usual midterm and final, so there were two options:<br />1)\t100% based on final<br />2)\t50% based on final, 50% based on paper<br />I feel that his grading is quite fair, around a fifth of the class achieved A range this semester. Alas! This is still a UST course, so if you score below mean, you’re bound to get C or below.<br /><br />As Barry said, most students who do a paper increase their grade by a letter. Based on the sample papers provided to paper writers, it seems if your paper is decently comprehensible and cogent, the paper will raise your grade -- the paper I wrote did increase my grade overall and I got an A.",
            "comment_workload": "Minimum workload. No attendance. If you choose not to do the paper, all you need to do is understand and recollect the legal principles in the lectures since the exam isn’t based on remembering dates and details of the examples. If you choose to do the paper, it’s a 14 page, double-spaced document and paper-writers are provided with writing workshops and a database with law reviews.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "e9P52XqbraGoXWMUXWNlDAqKmpOK03ug",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ustisfun",
            "date": "Jan 20, 2021",
            "title": "警世post",
            "comment_content": "Suitable for students who are really interested in law. For others I don't think this course suit you.<br /><br />The lecture slides are arranged in an utterly poor manner that I often find it hard to read. The chinese translations are not even close; the words sometimes do not make sense at all; and there is no coherence in each of the slides. I always lose track when I'm reading them.",
            "comment_teaching": "Barry talks in a very, very monotonous tone ZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZ That being said, he does give a lot of additional information to students. <br /><br /><br />=====mainlanders pls leave======<br />On a personal note, Barry is a Chinese patriotic who thinks that our all-mighty motherland is a flawless country, while the US is nothing but a shithole country. I get that he braces our motherland so much, but he is being so ignorant in a way that it seems like he is just a biased and uncritical man :( As a professor he should remain unbiased as possible.",
            "comment_grading": "I took this course for two weeks and then dropped it after he finished the part about treaties, so I can't provide accurate feedback. Yet if you search SOSC 1270 in goop or other places, you will see how the students in the course are so sad about their grades.",
            "comment_workload": "Don't be tricked by other reviewers who say that the workload is small. There are a lot of stuff to be memorised!!!!!!!!<br /><br />Also, remember this is an all-in finals course (unless you write paper, of which quota you need to compete with other volunteers&nbsp;&nbsp;&nbsp;by lucky draw)! If you fucked up in finals, you're going to fuck up your grades and it isn't fair for those who are constantly working hard but are a bit careless in finals.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HaQgIQ7Kze16AnTfxtJwWYfYpDFwFxx2",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ss0010",
            "date": "Jan 10, 2021",
            "title": "Good Grade and Interesting Content",
            "comment_content": "International law of different aspects:<br />Environment <br />History of International Law<br />Human rights<br />Peaceful Settlement<br />Sea, Air and Outer Space<br />States<br />Treaties<br />Use of Force<br /><br />You can choose to do a research paper yourself or with another classmate. In that case, 50% of your grade will result from the paper which will be at least 1 grade higher than the average grade of the final exam. So it is a good deal.<br /><br />Also, there is no homework and mid-terms. Final is not open notes though.<br /><br />It can be a bit boring sometimes. After all it's law...",
            "comment_teaching": "Barry is a kind and knowledgeable professor. However, in his teaching, students can easily sense Barry's bias against the US. His pro-China and anti-US stance is so strong that even the exam questions showed his bias, which further makes the questions a bit easier. I couldn't stop shaking me head and giggling during the exam.",
            "comment_grading": "Good grade even though you do not choose to do the paper. The exam is not open notes but only consists of MC questions.<br />I got an A with final exam of 56/80 and I did a paper, not sure what grade I got though.",
            "comment_workload": "Very little workload. Ideal for USTers. No homework or mid terms. But there are some readings which I didn't read too much but would recommend you all to read. It's good for your study after all.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "ezwP2SAapt7oEwZ60RN1XfEAageFsSYS",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lyndonsham",
            "date": "Jan 14, 2019",
            "title": "dont reg sosc 1270!!",
            "comment_content": "Different International Law of the world<br />E.g. Air Space Law, Sea Law, Use of Force Law",
            "comment_teaching": "Barry is a real heart professor, but the lecture is really boring. Onlt one-third of the students will attend the lecture.",
            "comment_grading": "not good grading<br />final marks below mean about 4 marks, at last I got a C<br />Midterm and final total will have 100 MC Questions.<br />1 Question = 1 % of the grade",
            "comment_workload": "NO workload. Only one midterm and one final, no assignments.<br />You can choose to write the paper and present it to the class, but it is not a requirement",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sua3duF9NPTuDHHPdlFMxHmqnnLCpOZM",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "clementchan",
            "date": "Dec 20, 2018",
            "title": "If you are not luckyenough to do the project, QUIT!",
            "comment_content": "Quite an interesting course but you have to understand a lot of cases. The logic is quite hard to understand. You can easily fail exams if don't have a good understanding of what is taught.",
            "comment_teaching": "the lecture notes are hard to understand and if you are a local, you can't catch up with the speed of the professor",
            "comment_grading": "Mean is around B- but getting a mean is hard. But if u have a project, you can easily get an A. I got an A for the project and B- for the 2 exams (my mark is around mean) and got a B+. There are so many non-locals and u will find it hard to pass the mean.",
            "comment_workload": "If you have a project, u will be super busy, if not you have 0 workload",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ho8gkrp2JB75qkoAg98vGGzYG1hlpRS1",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "科大小毒毒",
            "date": "Dec 14, 2018",
            "title": "Fair grading, but not lenient",
            "comment_content": "This course covers 8 chapters:<br />- Historical Development of International Law<br />- Customs and Treaties <br />- States and International Organizations <br />- International Human Rights<br />- Space Law&nbsp;&nbsp;<br />- Environmental Law<br />- The Use of Force<br />- Peaceful Settlement of Disputes<br /><br />The final exam will include questions about students' essay presentation as well.",
            "comment_teaching": "Prof. Sautman includes a rather large variety of contents that are not shown in the ppt slides. Jotting them down may help you understand the topic but isn't directly useful to your exams.",
            "comment_grading": "You can choose 2 pathways for your grading.<br />Pathway 1:<br />Essay (presentation inclusive): 50%<br />Mid-term exam + final exam: 50%<br />Pathway 2:<br />Mid-term exam + final exam: 100%<br />Normally people who could get into pathway 1 would have better grades but the quota is limited so not everyone who wanna write an essay can have the chance.<br /><br />Mid-term exam and final exam add up to be 100 marks. Each question in both exams is MC question and weighs the same. You need to pay attention to the ppt slides and the details of each case (e.g. held upon what principles), reading is not that necessary.<br /><br />Senior students tend to handle this course better.<br /><br />IF YOU CANNOT WRITE THE ESSAY, DROP THIS COURSE!",
            "comment_workload": "If you don't have an essay to write, you basically have 0 workload most of the semester except when you have to study for the exams.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "M0lHKDNeGdOuVi9hJ9kYLmEsZ4bUBZqU",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "coffeeandtea",
            "date": "Dec 14, 2018",
            "title": "",
            "comment_content": "Topics cover the most basic aspects of law, although it might be difficult for those who have no background in law studies to understand and absorb concepts taught.",
            "comment_teaching": "Barry's lectures are usually well articulated and elaborated, as it is easy to follow with his powerpoints. He explains concepts and cases clearly, as these will be tested in the midterm and finals. However, it is hard to focus during lectures, as the venue (LT-J) can be stuffy at times, and it is quite boring for most people. Attending lectures isn't a must, as no attendance is required. You can always catch up with lectures by watching the lecture videos.",
            "comment_grading": "Grading is very lenient if above mean. As for my case, I got 1SD below mean for both midterm and final exams. The final score was around a D range (~50%), which is unsatisfactory. I did write an optional paper, which got my grade from a D to a C+. My partner for the paper just got the mean score (C+) and eventually got a B+ with the paper. It proves that writing a paper does improve grades quite a lot. <br /><br />Mean for midterm: 30.01/48<br />SD: 5.15<br /><br />Mean for finals: 31.07/52<br />SD: 6.39<br /><br />Total exam score: <br />Mean: 61.15/100<br />SD: 10.24",
            "comment_workload": "I opted for the optional paper writing, which for me is quite of a challenge, as this would be my first academic paper. Expect to spend countless hours in the library, trying to surf through law review articles to support your argument. Also, you will have to prepare an 18-minute presentation, as these presentations contribute to 16 questions in the finals. For those who prefer to take an all-exam approach to this course, expect to memorize A LOT of data. Each exam counts for 50% of the whole course, so be well prepared beforehand. If you do the paper, each exam only counts 25%, and the paper itself is worth 50%. Although the workload is significantly heavier, it is worth the bonus.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pRuamDFJUm9O36t7nZ4B66eQt8NlinsU",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Patricia",
            "date": "Nov 12, 2018",
            "title": "",
            "comment_content": "Covers a wide array of topics and case studies. Could be a little too much to absorb in one sitting, given the way the professor kind of speeds through some case studies.",
            "comment_teaching": "Classic lecture type. Quite monotonous and very scripted.",
            "comment_grading": "Do the research paper - it will raise your overall grade. It's very competitive since there are only a few slots to do the paper, so make sure your proposed research topic is strong and concrete.",
            "comment_workload": "No attendance required but exams are challenging due to the immense coverage.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XBfgd5tT7udmF17foVmuRZnP5cej7szX",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hojai414",
            "date": "Aug 03, 2018",
            "title": "Poor course for common core",
            "comment_content": "Course content wasn't bad, after all it's about international law that includes different sub-topics. Quite interesting content actually.",
            "comment_teaching": "Interesting contents doesn't necessarily attract you without a good professor. This professor is a foreigner and I was expecting a more fun teaching environment. Though his boring and slow speech disappointed me so much. He spoke without using mic frequently but we were in LT-L. Only PPts were given.",
            "comment_grading": "Very poor. The final grade release showed all candidates' grades and you can see that most people got C to D range. Plus the exam questions were MCQs that were mostly asking very specific details that you could hardly remember if you didn't recite all the PPts.",
            "comment_workload": "Quite light. No homework if you didn't choose to do project and presentation. But people had no idea about how the exam would be like beforehand.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JoEUSYf8kdnBByxbQfF7un4XYFuCFf8X",
            "semester": "2016-17 Spring",
            "instructors": [],
            "is_author": false,
            "author": "FC",
            "date": "Sep 14, 2017",
            "title": "",
            "comment_content": "Talk about the basic concepts of the International Law. It is fruitful.<br /><br />The content of the course includes History of international law, Treaties, States, Human rights, The law of sea, air and outer space, Environment, Use of force, and Peaceful settlement.",
            "comment_teaching": "The professor is very great. He would give many examples and real cases to make sure the students can understand the concepts.<br />He is very nice, and can teach clearly. He usually encourages students to ask questions in the lecture.",
            "comment_grading": "Grading is fair.<br /><br />Course Requirement:<br />There is only one course requirement: to take two multiple choice (MC) exams totaling 100 bilingual questions (each question in both English and Chinese).&nbsp;&nbsp;About 84 questions will be based on lectures and 16 on student presentations.<br /><br />Volunteering to Write and Present a Paper:<br />You can volunteer to write and present in class a research paper on a current IL topic.&nbsp;&nbsp;If you do, the paper will be 50% of your final grade; your exam marks will be the other 50%.&nbsp;&nbsp;There are two benefits to doing a paper: 1) the average grade on papers is generally one full grade higher than the average grade by examination; for example, if the average grade by examination alone is B-, the average grade given to papers is A-; 2) in your career, you will likely have to do research and write papers or reports.",
            "comment_workload": "Basically, there are mid-term and final exams.<br />No assignment<br />Essay and presentation are optional.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rDUGhYywtn3edW2j9zIjcneeK83sK3dO",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "BrianHui",
            "date": "Feb 14, 2017",
            "title": "",
            "comment_content": "PowerPoint slides included most of the materials. Just so many case and example to remember. If you r interested in history maybe you will enjoy.",
            "comment_teaching": "The instructor share alot of related cases and history. He teaches quite well, easy to follow and understand. He welcome discussions in class and sometimes very political discussions in class.",
            "comment_grading": "Exam is mc only but the mean is so high and broken grade as like most of other sosc course.",
            "comment_workload": "No assignment and attendence. Unless you wanna do group presentations in class on topics given by him.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LhIAeMfwsonBF1ROA0ebkSVoZ94hM9Cf",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ljdjlalb",
            "date": "Dec 09, 2022",
            "title": "Actually good grade",
            "comment_content": "Same as reviews mentioned previously <br />Rich in content <br />content are fun and covering&nbsp;&nbsp;quite a wide scope with regard to international affairs",
            "comment_teaching": "Not interactive<br />Unorganized PPT <br />But professor is willing to answer any possible answer and passionate in teaching",
            "comment_grading": "One final exam + optional research paper <br /><br />I did not do the research paper<br />56/80 (A-) (one sd above the mean)",
            "comment_workload": "Low if you keep studying throughout the semester. But I only study 2 weeks before, that exerts quick a pressure. <br /><br />Recommend using anki app to revise the content as the content is so thick.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vv92fzEjYNOrahbGSO6rwIHkkEeHwEGj",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "amytheapplee",
            "date": "Sep 21, 2022",
            "title": "initial thoughts so far",
            "comment_content": "Found the content very interesting and comprehensive, all content is on the slides, nice that there is no extra reading in order to do well in the course.",
            "comment_teaching": "Not the most interactive, Prof is very knowledgeable and calls back to recent events. Mostly reads off the slides but provides supplementary readings. Nothing too bad to say about the prof so far.",
            "comment_grading": "Shame I wasn't able to write a paper, I am an exchange student so while it was not my biggest priority, it is a shame that there is a denied opportunity to allow students to do their best. Of a class of 100+ students... only 12 groups/24 students are allowed to write a paper?",
            "comment_workload": "Only one exam with an optional paper. Lots of memorization will be required.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1A89wWJQwlC1G0UfW6SEnwiWpqJ1dJgq",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Laurie0125",
            "date": "Aug 22, 2022",
            "title": "",
            "comment_content": "Cover briefly content on IL from treaties,environmental law,to use of force, iL of human rights etc.",
            "comment_teaching": "very rich content, both theoretical and vivid with all real-world cases.Barry is very experienced and always knows where he is going and willing to start discussions.overall a very nice man, i do enjoy his lectures.",
            "comment_grading": "final very challenging, contained detailed application and analysis of principals in class. 80 minutes to finish 80 MCs.<br />mean for final is little above 40, i got 64 and letter grade A+(I didn't do the project.",
            "comment_workload": "100%final ,no attendence, lucky draw for project to account for 50% of overall grade. To be better prepared for the final, i do advise hardwork throughout the semester, including taking notes/reviewing slides, asking questions. I even went through a IL textbook to prepare for the final.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zaxmHbAifnrtqeQTBlz1t9tjUiZREk9a",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "carolinee",
            "date": "Jan 24, 2022",
            "title": "",
            "comment_content": "Syllabus:<br />Historical Development of IL<br />Customs and Treaties<br />States and International Organizations<br />International Human Rights<br />Sea, Air, Space Law<br />Environmental Law<br />The Use of Force<br />Peaceful Settlement of Disputes<br />+ student presentations",
            "comment_teaching": "Barry clearly explained the concepts and you could really learnt a lot about international law from his lectures. He knew tons of knowledge and he could give you a really detailed explanation after asking him questions. But one thing is you could easily get boring as he spoke really really slowly",
            "comment_grading": "The grading is really great. I did not sign up for the paper and just take the 80-question MC final exam. Got an A.",
            "comment_workload": "Only one exam if you did not choose to write the paper.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QP9iBNtksP4Dw4mx2v3MyrY4RguH8dGS",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "FosL",
            "date": "Dec 20, 2021",
            "title": "Great Course",
            "comment_content": "1: Historical development of IL<br />2: Treaties, Customs, and other sources of IL<br />3: States and other entitles<br />4: International human rights<br />5: Law of sea, air, space<br />6: Environmental law<br />7: Sse of force<br />8: Peaceful settlements<br />9: Twelve student presentations",
            "comment_teaching": "His class might be a little bit boring, but if you are interested in law or politics, you would find the content very interesting. He's always ready to answer any questions and you can see how knowledgeable he is!",
            "comment_grading": "If you choose to take the presentation and luckily get the quota, your presentation and final exam respectively contribute 50% to your grade; if you don't, 100% on your final exam.<br />I did not take the presentation, and I got 59/80 in final exam. My letter grade is A which is really not bad.",
            "comment_workload": "Not much if you don't opt to write the essay and prepare for the presentation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JZIyl1FX7iM6DPlSoenMogsn5bM8nNBr",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hl00~",
            "date": "Aug 27, 2021",
            "title": "",
            "comment_content": "8 topics in total:<br />1. Historical development of International law<br />2. treaties, customs and other sources<br />3. states &amp; other entities<br />4. International human rights<br />5. law of the sea, air and outer space<br />6. environmental law<br />7. the use of force<br />8. the peaceful settlement of international disputes",
            "comment_teaching": "The professor is very professional in the field of international law and he can answer many questions in details. Yet, the lectures are kinda boring as his tone is somewhat soporific. To be honest I wasn't able to be attentive at all in most of the lectures or even skipped some of them. The powerpoint slides are super unorganised so you may have to sort them out yourselves.",
            "comment_grading": "there are two options provided: <br />1. essay &amp;. presentation (50%) + final (50%)<br />2. final (100%)<br /><br />I didn't sign up for the essay. For final, there were 80 questions. I got 58/80 and got an A. So I would say the grading is quite fair.<br /><br />Didn't spend too much time on preparing the final. Probably started doing revision like two or three days before it. If you are interested in international relations and have some sense in global affairs or international law it shouldn't be too hard for you to understand or memorise the content. Didn't really need to recite it.",
            "comment_workload": "No workload at all if you do not sign up for the project as there is only a final but no assignments or midterms at all. There are a textbook and some extra readings for you but it's totally fine even if you don't them at all. However, the textbook indeed helps you understand the lecture content more profoundly.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9gmXwd8Dtlzm7qbIc63i9Kv24PpmMI63",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hayoha",
            "date": "Aug 24, 2021",
            "title": "Need to memorize EVERYTHING",
            "comment_content": "International law<br />There are many examples to explain.<br />Topics:<br />Environment<br />History<br />Human Rights<br />Peaceful Settlement<br />Sea<br />States<br />Treaties<br />Use of Force<br />All lecture notes have Chinese version.",
            "comment_teaching": "Professor Barry is kind and patient. He is willing to answer student's questions. He explain all the concepts clearly. However, you need to be very focus on Lecture. It is easy to fall asleep if you are not interested in international law/ history. It is difficult for me to concentrate even i am a student who studied both History and Chinese History in high school. There are nearly 0 interaction in class. Maybe it will be better when it comes to face to face.",
            "comment_grading": "I think the grading is fair. I choose to not do essay report. Therefore 100% grade with the final (closed book). The final is all MC questions. I think it is easy if you have good memory. I spend a lot of time to memorize the Lecture notes but my memory is not good enough to get A. I remember my final score is slightly above mean. I got B at last. <br />If you choose to write an essay. The grading method will be different.<br />50% final<br />50% essay",
            "comment_workload": "Only need to do the final (for me)<br />Since i was not very concentrate on class (zoom), i needed to use much more time to reread the lecture notes( about 1 week). It is very light workload for a 3 credits course. <br /><br />If you choose to write essay, a groupmate will be assigned/you can choose to do your own paper/you can choose your friend. Presentation also needed. So i think the workload is depending on if you have a good partner.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HJffCZLqZvmGI9XzIbPBOWTFLrWBpynO",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rickey_JR",
            "date": "Jan 20, 2021",
            "title": "A good course if you work hard",
            "comment_content": "The content is well designed.<br />There are eight topics in this lecture and each of them are really important issue in today's world.",
            "comment_teaching": "Barry is a really nice teacher.<br />But I do hope he remember to update his note, many of them are out of date.<br />His teahcing may sometime a quite hard to understand and since it is a social science course, lots of word used in certain aspects of international law is spoken in the lecture and it is hard to understand.",
            "comment_grading": "REALLY GOOD GRADE!!!<br />2 marking scheme:<br />50%essay+50%final<br />100%final<br />Barry said the one who choose to write essay and present in class got better grade, deciding who could write the essay is by lucky draw.<br />However, if you didn't got the chance to write the essay, that's alright. Just prepare hard for the final! You will get good grades if you prepare hard for it.<br />I got the highest score (66/80) so I got A+. But the grades is really generous, I know someone got 58/80 and 62/80 also got A.<br />It is super easy to got A in this course.",
            "comment_workload": "Actually quite huge workload.<br />I prepare notes for about 30000 words in reviewing this course.<br />The question for online exam is really hard although it is written in both Chinese and English.<br />Beside hard preparation, you do need some good sense for law issue to got high grades.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H5fynPpuX6K84UGXpRuzqBkYHCqMkXWo",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "leolai1999",
            "date": "Dec 10, 2018",
            "title": "DO NOT REG THIS COURSE",
            "comment_content": "7 powerpoint which contains 40-50 slides each.<br />Final includes 13-15 presentations by students.<br />Yes, the powerpoint contains few words but it is what he mentioned in class that kills. you have to recite the law concepts, the result of an incident, the root causes of it and many other tiny unrelated matters.<br />If you think yourself is good at reciting, you will end up very bad. Because it is not a course that makes your effort paid. I trusted the comments below and worked hard, and this course consumes almost all the time of studying.",
            "comment_teaching": "He speaks really fast. and I guess that is the main reason why he is uploading lecture video every semester. Because tiny details will just go over very quickly and all the content mentioned in class will be within the syllabus.<br />despite his effort trying to make jokes in class, the attendance for a 300 people class size would end up with 20-30% attendance and those are the students who will get a range, not you.",
            "comment_grading": "Only one midterm and one final. Both consist of around 50MC.<br />Each of the MC q contributes to 1% of the total grade.<br />This implies midterm 50% final 50%. <br />The mean is similar across semesters. <br />Mean of midterm: 30/48; Mean of final: 30/52<br />If you perform in a mediocre manner, you will probably get a C+.",
            "comment_workload": "As the comments below mentioned, it is of light workload.<br />No attendance and assignment required. <br />Just 50% midterm 50% final. <br />but when it comes to studying for the exams, it demands an in-depth understanding of the issue. <br />and if you skip every lecture as I do, you probably end up with c range.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4uvb33tiowSoougmSPfbpjzkwQNQnpJH",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fifi",
            "date": "Jan 30, 2018",
            "title": "",
            "comment_content": "This course covered the basic topics of International Law and Barry illustrated concepts based on cases and daily life examples. Newspapers will be distributed for further reading (and sure will be covered in the exam). <br /><br />Midterm:<br />Historical Development of International Law<br />States and International Organizations<br />International Human Rights<br /><br />Final:<br />Sea, Air, Space Law<br />Environmental Law<br />The Use of Force and Peaceful Settlement of Disputes<br />Student Presentations' topics",
            "comment_teaching": "Barry is very knowledgeable in this area and willing to answer students' questions (((though not many :) but the powerpoint slides may be a bit messy and may need to get organized by yourself.",
            "comment_grading": "1. 50% Mid-term 50% Final<br />or<br />2. 50% (Mid-term + Final) 50% (Paper + Presentation)<br /><br />For exams, all are MCQs, one MC accounts for 1% of your final grade. You can choose to do a research paper (can work on the paper as an individual or in a team of two students) and need to present in class (after Mid-term). The content of student presentations will be covered in the final exam. Many try to sign up for writing paper and need to draw lots in the end :( <br /><br />**the average grade on papers is generally one full grade higher than the average grade by examination<br /><br />For Percentage: generous grading given the amount of workload!!!<br />A range = 25.6%<br />B range = 33.6% <br />C range = 28.2%<br />D range = 8.0%<br />F range = 4.5%<br />**the grade distribution for this fall sem is higher than for any of the preceding two dozen administrations of the course. The grades moreover are significantly higher than the normal and allowed distribution for large 1000-level courses at UST.",
            "comment_workload": "You need to attend the lectures or go through lecture videos uploaded weekly to understand the topics ( especially the concept and cases, correspondence in between)<br /><br />Around 87 bilingual&nbsp;&nbsp;MC questions (each question in both English and Chinese). You got the advantage in understanding the questions if you read both Chinese and English since wordings are explained more explicitly in Chinese sometimes.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vOElxh97CWggNwy4bTutrYmrzCg1VH7a",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sora200",
            "date": "Jan 29, 2018",
            "title": "easy comprehensive style lectures &amp; exams",
            "comment_content": "Interesting concepts about international law, especially if you like to learn about international relationships? The course felt more like a history course to me than law since it's more about how the int. law we use today were derived from past cases. I personally didn't like history in highschool, but this course was interesting because it didn't require memorisation of dates and names and places but rather focused on 'what' and 'how' and 'why'.",
            "comment_teaching": "Professor explains case studies really easily and recaps previous cases when they are addressed later in the lectures. The powerpoint has all the content both in English and Chinese but I think listening to the professor is much easier to comprehend the concepts than just reading lecture notes. He speaks slowly and very clearly, asks if there are any questions during lectures. good lecture environment.",
            "comment_grading": "It's important to remember the case studies mentioned in the lectures and lecture notes, but the &gt;dates and names of people/places are not necessary&lt;!!! Concepts of 'what law is used in such situation' is tested in the exam. Read the lecture notes several times and you'll surely make it above average!<br />50% mid-term<br />50% final<br />all MCQs (single answer)<br />got 39/43 in mid-term, less than mean in final = B+ (1 mark below A- :( <br />Generous grading, the professor tries to give better score rather than take away marks.",
            "comment_workload": "No coursework, no homework, no attendance, just mid-term and final to study for. If you want extra credit you can sign up for a research paper + presentation, but there is a limited quota for that so you need to decide within the first 2-3 lectures. the presentation and submission are due before finals.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AVIsGQ6IbKAocspnoHIfdam6HYv73JmT",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chelle",
            "date": "Jan 21, 2018",
            "title": "",
            "comment_content": "Topics to be covered:<br />Historical development of IL;<br />Treaties, Customs, and other sources;<br />States and other entitles;<br />International human rights;<br />Law of sea, air, space;<br />Environemntal law;<br />The use of force;<br />The peaceful settlements in international disputes;<br />Student presentation",
            "comment_teaching": "I love his teaching and he is very knowledgable in this area.<br /><br />*lecture notes; tutorial notes, lecture videos will be uploaded on Canvas so don't panic",
            "comment_grading": "2 MC exams totalling 100 bilingual questions (each question in both English and Chinese): around 84 will be based on lectures and 16 on student presentations<br /><br />I did not sign up for paper and I got A+.",
            "comment_workload": "*students may volunteer to write and present a research paper in class: if so, the paper accounts for 50% of the final grade and exam marks will be the other 50%<br />*may work as an individual/ as a team of two",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "e7stQmMbOjFF3AaIZ7zHLbpYVwGhQstf",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "infinitendless",
            "date": "Aug 22, 2017",
            "title": "",
            "comment_content": "it covers some fundamental&nbsp;&nbsp;topics of int law like law of see, use of force,envo law........ you will learn what an introduction should have",
            "comment_teaching": "sometimes boring sometimes interesting( story and case time) <br />Barry is nice and he is willing to answer all your questions",
            "comment_grading": "1. 50% mid term, 50% final OR<br />2.50 % 2 exams, 50% paper+presentation (popular as the avg grade is higher than doing exam)<br /><br />I did not sign up for paper and I kind of messed up the midterm (to me yes) but I did well in the final. I got A-. <br /><br />BUT<br /><br />Some friends think that the grading sucks, they all got C range. SO IT DEPENDS.<br /><br />ps, usually there are ppl get full points for mc exams but no one ever get full marks ( at least for the 2 exams I experienced. Obviously, it is NOT EASY.",
            "comment_workload": "0 workload in terms of assignment but you have to really figure out all the concepts and cases and this takes time",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "obHFTtS6TU4JPyPXmetvjLM4zmqwpoV1",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "emily870717",
            "date": "Jun 02, 2017",
            "title": "",
            "comment_content": "Interesting for those who would like to understand more of international law in historical examples around the globe. Not that interesting for those who regard it as &quot;memorizing&quot; work.<br />Topics for midterm:<br />-History<br />-Customs and Treaties<br />-States and International Organizations<br />-Human Rights<br /><br />Topics for final:<br />-Sea, air, space law<br />-Environmental law<br />-Use of force<br />-Peaceful settlement of disputes<br />-Student presentations",
            "comment_teaching": "Articulation is clear, great lecturer.",
            "comment_grading": "Grading is fair, pretty good.<br />Poor Students-about 15% of class <br />Ave./Good Students-about 60% of clas<br />Very Good Students-about 15% of class<br />Excellent Students-about 10% of class",
            "comment_workload": "Minimum workload<br />No assignments required<br />Essays are optional",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7XuwRuK0KJ0WGCNxP1pdj7VshmS2TbyG",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Jenny0104",
            "date": "Aug 18, 2022",
            "title": "",
            "comment_content": "The group project is OPTIONAL!!!<br />Ofz the workload will be higher if you choose to take the group project, but the grading will be higher in the final grade, it counts 50% of the final grade. (Highly recommend doing the group project) <br />Otherwise, you could only choose to take the final exam with 100% grading. <br /><br /><br />The final exam was all MC! You have around 11 - 13 lecture notes, but each of chapter has almost 100 slides! Really need to prepare for your exam in advance.",
            "comment_teaching": "Berry is a nice and well knowledgeable teacher in international politics.",
            "comment_grading": "My overall grade waas B-",
            "comment_workload": "This course workload is acceptable.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Tgx7WnjLRoEMVxQTGbKaDIwSWrWYbh7z",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Alexcc",
            "date": "Jan 21, 2021",
            "title": "C range easily",
            "comment_content": "This course basically talk about law in different aspects and their relevant history. Topics include Treaties, Use of Force, Peaceful Settlement, Sea, Human Rights, History of International law and Environment. Students who would like to learn the history and to have an overview of the legal system in the world or more specifically, in each continents, should take this course since it surrounded the main topic International Law and apply the basic principles of International Law in many different cases happnened around the globe.",
            "comment_teaching": "Barry is willingly to answer all questions asked by students via email and would share the Q&amp;A in the discussion forum. Therefore, the controversial questions in each topic can be learnt by all students. But students may feel bored and need to suffer from his accent.",
            "comment_grading": "If you want an A range, definitely choose to do a project and have a presentation at the end of semester. There is nearly no other way for a normal student to get an A range if you simply take his final exam with 100% MC. If you merely take the final exam, then you can expect a C range or a B range grade but not guaranteed.",
            "comment_workload": "No workload, only final exam ...",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OiG8omuQ2Cix04Uwu4YNMln3irYQHa72",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AntheaWY",
            "date": "Jan 17, 2021",
            "title": "",
            "comment_content": "It includes 8 modules in total, including history of international law, states and entities, and treaties and more. There were also few lectures for student presentations, and they would be covered in the final exam.",
            "comment_teaching": "The professor’s teaching was quite boring, but he didn’t just read from the ppt, talked about related content that were not written on ppt.",
            "comment_grading": "The final exam was quite challenging, closed book with 80 MC questions, which also asked about content in student presentations. I got 47/80, which was the same as the median and didn’t do the optional work, got a B- eventually.",
            "comment_workload": "Little workload, only need to revise for the final exam if you choose not to complete the research paper and presentation, but it was mentioned that students would get better grade by doing that.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cuTzZAJM8FtXpZ8q4LFxBvLauDy0DnZA",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AWY",
            "date": "Jan 17, 2019",
            "title": "Boring but good grade",
            "comment_content": "This course covers different types of international law.<br /><br />- History of International Law<br />- States <br />- Human Rights<br />- Sea, Air, Space Law<br />- Environmental Law<br />- The Use of Force<br />- Peaceful Settlement<br /><br />Contents of students' presentations will be examined in the final exam. Not all the presentation ppts will be uploaded to Canvas so you have to attend the class during the presentation period.",
            "comment_teaching": "I think the lectures were quite boring. I couldn't help falling asleep during some lectures.<br /><br />All PPT slides were given at the beginning of the semester. Tutorial materials and video for each lecture were also uploaded through Canvas.",
            "comment_grading": "There were only midterm and final. (50% each) All of the questions were in MC format.<br /><br />I didn't put much effort into this course. I got mean for both exams, but still obtained B range. The prof was quite lenient.",
            "comment_workload": "Very light. Some reading materials were given each lecture, but they would not be covered in the exams. All you have to do is to study the ppt and tutorial slides for the exams. (quite a lot to understand)",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1ec6B1X8JNSYINExEeEvUr8462dHXuKC",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "blublub",
            "date": "Jan 13, 2019",
            "title": "Decent course",
            "comment_content": "Content is about the international law, its mechanisms, and the occasional mention of organizations or cases. On the second half after midterm, the students who had gotten to do paper would present their topics. Lecture videos are provided for most of the teaching sessions. Mostly memorizing.<br />If you got the opportunity to do paper project, the professor said it would help your overall grade.",
            "comment_teaching": "The professor mostly teaches things that are in the slides (although said slides are unfortunately cluttered), and while he explains the concepts quite clearly, he speaks a little slowly. There would be a QnA session before the midterm and final.<br />The TAs are alright.",
            "comment_grading": "Grading is pretty generous.<br />Midterm: 50%<br />Score: 40/48, Mean: 30.01, s.d: 5.15<br />Final: 50%<br />Score: 39/52, Mean: 31.07, s.d: 6.39<br /><br />Got an A overall",
            "comment_workload": "With the exceptions of a few articles they sent out, there's no other assignments given. It will be different if you had gotten the paper project, however.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vDU0ws9LfssJFNVgp1ZsCIn1EYfckvGA",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "halo123",
            "date": "Jan 07, 2019",
            "title": "",
            "comment_content": "Various topics about international law is covered. Lecture video is provided. You have to memorise a lot for the exam though.",
            "comment_teaching": "He is an expert in law and is willing to answer your questions. He often encourage students to raise questions in class or give comments about issues. However he peaks super slowly and make the lesson a little bit boring. Overall he is a good teacher.",
            "comment_grading": "Got 1 sd above mean in midterm, below mean 0.5 sd in final. Overall above mean 0.5 sd and got a B+.<br />If you really want a good grade, strongly recommend you to do the optional paper.",
            "comment_workload": "Super low workload. Only midterm and final ( with an optional paper).",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wL19RrR3ibpK6EVsWU7jvXOJY0ywp7ox",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "pxxx",
            "date": "Dec 20, 2018",
            "title": "",
            "comment_content": "Different topics of international law. Many examples will be provided.",
            "comment_teaching": "He is very knowledgeable and willing to answer your questions.<br />But the lecture can be a bit boring if you are not interested in the topics he covered in class.",
            "comment_grading": "Fair grading, prepare for the two exams. The exams are not that difficult as long as you put time and effort to study. They are all MC questions. I got more than 1SD for both exams and got an A.",
            "comment_workload": "Very light, no attendance taking. But strongly recommend to attend all the lectures in order to help you understand the concepts and examples clearly.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gRN1yWCtAMev4dK2v2IYufGQS8MYMODZ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "maec_trash",
            "date": "Dec 19, 2018",
            "title": "Generously graded but challenging course",
            "comment_content": "The international law course is the same everywhere around the world. To me, the topics are quite interesting. Also, the ppt and exam papers are bilingual, English and Chinese. (But the Chinese translation is mostly wrong and mistranslated, so it's advised to read in English.)<br />Before mid-term: History of international law, Treaties, States, Human rights.<br />After mid-term: Law of the sea, Environmental law, Use of force, Peaceful settlement. <br />The content covered in both exams are not consecutive.",
            "comment_teaching": "Personally, the teaching is boring. I only attended less than 5 lectures (or even I attended, I fell asleep). Since lecture videos will be provided afterwards, it is suggested watching them with 1.5x speed rather than go to the lectures.<br /><br />There are voluntary tutorial classes. Unfortunately, both 2 sessions have time clash with my other courses so I'd never gone to them.",
            "comment_grading": "If you do not opt to write a paper, then both exams account for 50% with all MCQs. Each question accounts for 1 mark. (it's &quot;expensive&quot;) The questions are so tricky, so it's not easy to get high marks<br /><br />If you write a paper, then both exams account for 25% and your paper and presentation includes 50%. Also, your paper will be graded better. e.g. if 50% is C in exams, getting 50% in your paper is B! I regretted a lot for not cherishing the chance to write a paper.<br /><br />The grading is generous. My friend got above ~0.8 SD overall and got an A-. I screw up for both exams and overall below mean 0.5 SD and got a C. (though I do not put much effort into it.) Most of my friends got a C range.",
            "comment_workload": "0 workload. You have to sit for 2 exams only unless you opt to write an academic paper and presentation. (which I regretted not to) However, you have to spend some time to understand the content of the ppt. and remember some of the cases. <br /><br />No attendance, project, homework, quiz... But there are reading materials distributed every lecture. (though it is not examined too much)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "FZywye5jcRu7wGsCyY1EGjtkf0S1Ilxh",
                    "name": "ILSyllabusFall2018",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "1pqjFnI2CxiurKmxLxPx3DdCbsymWWaE",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "IY",
            "date": "Dec 18, 2018",
            "title": "Good choice for common core",
            "comment_content": "Basically as the name tells, this course is about International Law. You can expect to learn some basic principles which govern different countries in various aspects, such as sea, air, human rights. As it is a common core course, the content is not difficult to understand and it is quite interesting in my opinion. Also the lectures' powerpoint slides are bilingual (both Chinese and English). Yet, the Chinese version seems to be a Google translate which is sometimes hard to read and the powerpoint is not very well-organised. However, there are optional tutorials which can help as a supplement. Also, the lectures are video recorded so you can feel free to review after class on Canvas.",
            "comment_teaching": "The professor teaches quite well in my opinion. He explains the principles clearly and illustrates with quite a number of examples. He has a clear accent and doesn't speak extremely fast. After all, you can watch the lecture video on Canvas as many times as you want even if your English is not good enough to understand in class.",
            "comment_grading": "Grading is based on 2 exams. Each exam consists of around 50 MC questions so in total there are 100 MC questions. 1 MC question accounts for 1% of your total score. No other compulsory projects or assignments. No attendance taken as well. So as long as you do well in the exams, you will get a good grade. Of course, the downside is that if you do not do well in the exam, since 1% for each MCQ, you will easily mess up the whole thing.<br /><br />Remark: You can sign up for an optional paper-writing which you have to do a presentation as well. The professor says students who do the voluntary paper writing will usually get a better grade (I don't know if it is true or not as I didn't write). But if you write a paper, then 50% for the paper and the other 50% for the two exams.",
            "comment_workload": "Nearly no workload as no attendance is taken. You only have to sit for the two exams. As well as you do well, you will be fine.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ix7XBrVmEAGk9tsl2y9uAZ9lvdIRYdjF",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "couch_potato",
            "date": "Dec 13, 2018",
            "title": "Very good course that helps with basic law and international relations concepts",
            "comment_content": "The course, in chronological order, talks about:<br /><br />1. History of development of international law<br />2. Treaties<br />3. States<br />4. Human Rights (largely about legal systems in UN)<br />5. Environmental Law<br />6. Law of the Sea, Air and Space<br />7. Use of Force<br />8. Peaceful Settlements of International Conflicts<br /><br />There are a lot of pages in the lecture notes, but if you are able to understand the rationale behind the policies, it isn't too much to bear. I would keep an eye out for Human Rights and Environmental Law though, since I am unable to sort out any logical rationale behind most of the legal systems, so I had to resort to reciting 2 entire 70-page long lecture PPTs. These 2 sections are the reason why I refuse to give this part an A.<br /><br />In general, the content allows students to learn about standard international law concepts, and along with analysis of some infamous international law cases, it is, in my opinion, quite an enjoyable introductory course in law.",
            "comment_teaching": "The professor is a very good presenter, with very native English pronunciation, which makes it very easy and comfortable to listen to. The professor explains the concepts and the cases quite clearly, and provides a tutorial Q&amp;A session the day before the 2 exams, which allows students the chance to clarify their confusions before they walk into the exam venue LT-J.<br /><br />The professor is very supportive and quite willing to answer questions during and after lecture. Yes, I said during. The professor actually really likes it when students ask pertinent questions during class, and will actively ask if there are any questions or comments.",
            "comment_grading": "Don't be fooled by the promise of 100 MCs, coz as a matter of fact the questions are very difficult. Not only do you have to remember minute details, but your logical ability will be tested as well. The professor has explicitly mentioned that nobody has ever gotten a full mark in any of the exams.<br /><br />However, the grading isn't that harsh. <br />For standard students, the entire course consists of 100 MCQ, and each question counts for 1% of the course grade. For people who get to do presentations, their paper will count for 50% of their grades, while each MCQ counts for 0.5% of the course grade.<br /><br />Statistics will be provided later.<br /><br />My grade:<br />Mid-term: 33/48<br />Final: 41/52<br />Grade: A",
            "comment_workload": "There is basically no workload, unless you count studying for mid-terms and finals as course workload.<br />For a selected group of volunteers, they get to do a paper that counts for 50% of their grades, as well as a presentation, with their content covering 13 questions in the final exam. It is possible that these volunteers are poor presenters, and/or they may choose to keep their presentation PPT to themselves, a selfish act which a majority of the volunteer groups utilized. It is therefore advised that you register this course with the people you know, as this increases the chance of obtaining the presentation PPT to study. The presentation groups with good heart will upload their PPT onto Canvas.<br /><br />Attendance is not compulsory, and lecture videos are available on Canvas.<br /><br />In general, the workload isn't heavy, and most of the stuff can be crammed within 3-4 nights.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ThO2pj0B3zBySXPmOitXGxp2IMF8SnSK",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "seanryu88",
            "date": "Dec 11, 2018",
            "title": "Not Bad",
            "comment_content": "Covers the basic concepts of international law.<br />The concepts can be abstract and hard if you have no legal background<br />But just knowing what's going on is enough to excel in this course",
            "comment_teaching": "Teaching is not bad<br />The professor basically reads the ppt and often elaborates the materials by including his personal anecdotes or sidenotes. <br />You don't necessarily have to go to lectures; even if you do, I bet you will not focus on it as the lectures are boring.",
            "comment_grading": "If you do not choose to write the paper, then the grading is 100% exam<br />The exam is total 100 questions, so you can directly feel your overall grade fluctuating on your skin<br />If you choose to write the paper, then it will be 50% paper and 50% exam<br />Paper grades are generally known to be much more generous<br />Haven't received my grades yet, but I think I'll secure at least B+ or A-<br />If you are willing to do some memorizing, then you'll be fine",
            "comment_workload": "NO assignment at all<br />The only thing you have to do is take the two tests taken around Midterm and final weeks.<br />If you choose to write an optional paper, then you might have to do some work.<br />You have to write a 12~15 page paper and present it for 18 mins<br />If you do not have previous experiences with writing 15-page-long legal analysis papers, I don't recommend you volunteering to do so.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KEH5jHKmHovfdfZLTmVuOtELZKFriUD5",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Felix4444",
            "date": "Aug 21, 2018",
            "title": "",
            "comment_content": "Very interesting content if you want to know more about the international affair. At first glance, many things to memorize but much of it is common sense. You don't have to memorize every single detail, just the concept is enough.",
            "comment_teaching": "Very good professor. His explanation is very clear. Very friendly and cheerful. If you can attend his class and listen, you don't really need to study much for the exam since the concept he explained during class is very clear.",
            "comment_grading": "All mc questions. You need to understand the concept and memorize the cases if possible. But the questions are not tricky, Very straight forward,",
            "comment_workload": "No workload at all. No assignment. 0 attendance.&nbsp;&nbsp;But still, I recommend attending class.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "joDgOGaP9MOsrK8rxF1HjGKXZ0KaEBHk",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "occheung",
            "date": "May 28, 2018",
            "title": "",
            "comment_content": "Wide coverage of international law and geopolitics. This course covers some western historical event from 18th century to present day.<br />Topics: Historical Development of IL, Customs and Treaties, States and International Organizations, International Human Rights, Sea, Air, Space Law, Environmental Law, The Use of Force and Peaceful Settlement of Disputes.",
            "comment_teaching": "The professor spoke in well-managed pace, so it is easy for us to understand the topic.<br />*There are additional tutorial, which is totally voluntary. Tutorials are great for summarizing the teaching material from lectures, and to further understand the topic as well.",
            "comment_grading": "Very high chance to get into A range.<br /><br />The final grade distribution:<br /><br />A+ 81-87&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(Top 10)<br />A 73-79<br />A- 69-72<br />B+ 67-68<br />B 64-66<br /><br />B- 61-63<br />C+ 58-60<br />C 55-57<br />C- 52-54<br />D 47-51<br />F 27-46<br /><br />For Percentage:<br /><br />A's = 25.6%<br />B's = 33.6%<br />C's = 28.2%<br />D's = 8.0%<br />F's = 4.5%<br /><br />Test/Exam: My score (mean, SD)<br />Mid-term: 40/48 (Mean = 30.877, SD = 5.198)<br />Final: 38/52 (Mean = 31.44, SD = 5.57)<br />I got an A.<br />All mid-term and final questions are in MC. 100 MC in total for the entire course.",
            "comment_workload": "-Can choose to do international law paper and presentation.<br />(According to the professor, doing paper yields a better grade)<br /><br />Otherwise, workload in this course is quite low. The only workload is to study for mid-term and final.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GuvejYzPtCitVZvMlgzitSiVlcqhJX9H",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jroh",
            "date": "Feb 02, 2018",
            "title": "",
            "comment_content": "Background of International Law<br /><br />-History<br />-Customs and Treaties<br />-States and International Organizations<br />-Human Rights<br />-Sea, air, space law<br />-Environmental law<br />-Use of force<br />-Peaceful settlement of disputes<br />-Student presentations",
            "comment_teaching": "Professor reads his note. But make sure you take note of that.<br />Most of the exam questions comes from his notes and real life examples",
            "comment_grading": "Get everything right in multiple choice questions.<br />Then you will get high grade since Midterm and Final 50 50 or 48 52.<br />It is also good to participate in presentation since it will cover some of your grade.",
            "comment_workload": "No HW<br />No Project<br />No participation<br />Just 2 MPC Exams<br />Thats it.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tpRbWtewTrnxMrQSZMF4djb9h93VzmeU",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gerry",
            "date": "Jan 26, 2018",
            "title": "Easy Course with Little Workload. A bit boring, but very relevant content.",
            "comment_content": "All material needed for the midterm and final is in the lectures. His explanations are very easy to understand and quite concise. Content is very rich and a lot is covered without realising. Knows when to provide more explanations and when it's not needed. <br /><br />Interesting content if you enjoy international relations. Covers the history of international law and its evolution. Very relevant to important topics that appear on world news today.<br /><br />Lecture notes, tutorials and exam papers are offered in both English and Chinese.<br /><br />The professor also says that you have an advantage if you study the content in Chinese, as the legal terms are much more specific than in English.",
            "comment_teaching": "Professor has obviously taught this this material for a long time. Delivery seems repeated and scripted, but is also what makes his explanations quite concise. <br /><br />Unfortunately, the professor speaks rather slowly. Always seems a bit disappointed with the students' overall lack of engagement and participation. <br /><br />Attended most lectures, but find that the lecture videos are much better. Easier to focus and follow when put on 1.5x speed.",
            "comment_grading": "Really quite generous given the amount of workload. Easy to score well even if you do not study through the semester. Find that with other people last minute cramming is usually enough for at least a B/B+. But you have to at least attend the lectures or watch the videos.<br /><br />Grading depends entirely on the 2 quizzes, which are completely MCQ; unless you can also opt to apply to do a research paper on a case study. <br /><br />If so, you will have to do a presentation to the class, and the content covered in your presentation will be on the final exam. A lot of work, but good practice for research paper writing. I heard that on average it bumps up your score by an entire grade.",
            "comment_workload": "Extremely easy workload. Almost 0. Some light reading if you like, but again, basically no extra work to do well in the course. Reviewing the lectures is sufficient.<br /><br />Watch out for falling behind on this course though. Although it can be boring, a lot of content is covered.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SYJ9UNlQO3aGvizOSua5XdgU2DXmMfEd",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "238",
            "date": "Jan 26, 2018",
            "title": "Chur common core",
            "comment_content": "Content is quite interesting and close to daily lives. To students that like reading or English or societal issues, this course is for you. All powerpoint slides are covered in words and cases to be studied. But when doing a revision, there is far too much content to remember...",
            "comment_teaching": "Lectures are honestly quite boring. However, they do put up lecture videos on canvas so you can speed up the video to 1.5x for better lecture experience (so it would be less boring and easier to catch up). Anyways I recommend using lecture videos instead of going to class since you can always pause when you are not sure or can't catch up on some crucial cases. You need to note them down for further revision.",
            "comment_grading": "Grading is fair. The mean is around B- to B but to attain mean, you have a study heaps of words and cases. Be sure to remember that cases must be revised, at least have a concept of the most important cases explained in lectures. If you also do the presentation, it is almost secured that you can get a b or above.",
            "comment_workload": "If you are good at memorizing and doing mc questions, the workload is fairly light. There is only midterms and finals. But think twice if you do not like English, memorizing and MCS. There is also an option to hand in a paper and presentation, honestly if you write at a quick speed and is not afraid of presenting in front of a whole lecture hall, do it. You could learn so much from it and it guarantees your grade to be from a b range to a a range.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VO0zuwzavBPM90KDjwODfesahF0WzmC8",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gracewfy",
            "date": "Jan 26, 2018",
            "title": "",
            "comment_content": "personally i dont think its that interesting <br />though hes filled the course with loads of contents and good examples <br />the powerpoint doesnt even include half of his contents in class<br />but there're videos for review even if you skip the lessons so thats quite nice",
            "comment_teaching": "just boring <br />the contents are not really good <br />he looks like einstein and speaks very slowly <br />thus makes it super boring <br />but he's a nice guy<br />just may not be a very engaging lecturer",
            "comment_grading": "good wide A range",
            "comment_workload": "just one midterm and final <br />all MCQ<br />you're guaranteed of a good grade if you get to be picked for the essay and presentation but its just pure luck so good luck lol",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SL8OR47LE9EStstJol8BTzvXWKQL8CoH",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "EvelynPan",
            "date": "Jan 25, 2018",
            "title": "SOSC 1270 Review：Pretty Challenging!!",
            "comment_content": "各種領域的國際法，包括Use of Force, Treaties, Sea, Peaceful Settlement, Human Right, Environment等。同時包括許多case study， 我認為對於1開頭的課程來說，International Law的是很難的。",
            "comment_teaching": "教授邏輯清晰，認真聽的話其實很有趣，不過case study會比較難懂。TA非常盡責也很會教人。<br />教授PPT做的不好，就是把一堆內容扔上去，相比TA的PPT會更organized，建議去上optional的tutorial。",
            "comment_grading": "Mid-Term and Final（MC）<br />你可以報名參加optional的case study+presentation<br />會有一系列的題目供你選擇，通常是一人或二人小組<br />需要寫一份五千字左右的論文以及presentation，會佔比50%<br />The final grade distribution:<br />2017 Fall Sem成績如下<br />A+ 81-87 <br />A 73-79<br />A- 69-72<br />B+ 67-68<br />B 64-66<br /><br />B- 61-63<br />C+ 58-60<br />C 55-57<br />C- 52-54<br />D 47-51<br />F 27-46<br /><br />For Percentage:<br />A's = 25.6%<br />B's = 33.6%<br />C's = 28.2%<br />D's = 8.0%<br />F's = 4.5%<br /><br />我認為對year 1 學生來說這個course會很有挑戰性",
            "comment_workload": "有閱讀任務，但是不是強制性的，基本上溫熟PPT和上課的筆記就不會有太大問題。但是如果想要對課程內容有深入的了解的話，光是ppt和tutorial ppt是不足夠的，教授會推薦閱讀書籍。",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xBodmuCKh3IqH5y3nswzmb0xh91D2u1F",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "happyday",
            "date": "Jan 25, 2018",
            "title": "",
            "comment_content": "Topics to be covered:<br />History of IL;<br />States;<br />Human Right;<br />Treaties;<br />Environmental law;<br />Peaceful settlement;<br />law and treaties about sea and space;<br />use of force",
            "comment_teaching": "very boring<br />Lecture video are provided<br />many extra cases are discussed during the lesson<br />Powerpoint included both Chinese and English<br />Cantonese and English tutorial are provided separately<br />The tutorial is important!",
            "comment_grading": "the grading is good, as I only attended a few lesson, and slightly above mean in the midterm exam, mean in the final exam,<br />I got a B in final grading<br />midterm exam: 50% <br />final exam: 50%<br />all question are MC question<br />you need to remember the cases, treaties and the theories clearly",
            "comment_workload": "only midterm exam and final exam are required<br />essay writing and presentation is optional<br />attendance is not needed",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gw8xtGRQua8m1Ld0p4OQpPmISb4mI8Ht",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pinball",
            "date": "Jan 20, 2018",
            "title": "",
            "comment_content": "The course is about the basic knowledge about International Law, from which you can have a higher understanding to the current global political situation.<br /><br />There are 8 topics: <br />1. History — Development of I.L.<br /><br />2. States — Definition, constitution of a states<br /><br />3. Treaties — how states make treaties and rules about a treaty<br /><br />4. Sea, Air and Space — The territory to a state in different areas<br /><br />5. Environment — What has the globe done to protect nature<br /><br />6. Human Rights — The progress towards human equality<br /><br />7. Peaceful Settlements — How to stop a war<br /><br />8. Use of Force — What are the rules in war time<br /><br />Memorisation is necessary: mainly the principles behind each cases on international law level.<br /><br />In the last 2 weeks, there will be students to present their project in these topics, analysing the current affairs.",
            "comment_teaching": "The teaching is good for your deeper&nbsp;&nbsp;learning into this course, because professor talks a lot about the current issues and many other cases out of the syllabus to help your understanding of the materials. However, the powerpoints are not friendly to understand, so this may affect your study, especially before the exam.",
            "comment_grading": "Grading is quite good.<br />Around 1/4 of people can get a A range, starting from around 70% in total grade.<br />50% or lower is F",
            "comment_workload": "1 Mid-Term, 1 Final: 1% total grade for each Mc question in two exams<br />in this term, there were about 48questions in mid-term and 52 in final, i.e. 48% mid-term and 52% final.<br /><br />However, if you are lucky to do a project (including writing an essay and presentation, 2 per group), you may have one grade bonus (e.g. B to A) <br />And there's advantage in exam, because 1/4 questions in the final exam is based on the projects.<br />If you don't do the project, it's fine, you still can get a A+ if you put some effort to memorise many things, but workload I honestly think is not hefty.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ibGIInppe1TXXqWEFC1OoXT6ZzkUXcRC",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Trin",
            "date": "Jan 19, 2018",
            "title": "",
            "comment_content": "Very rich. In other words, many things need to be memorised. <br />Teaching assistants are very nice. They provide additional notes and tutorials which are much more understandable and interesting. <br />However, sometimes the concept on the tutorial notes and powerpoint may be contradicted...",
            "comment_teaching": "Little interaction during the lesson. Fast spoken English. Need to take many notes. Powerpoint is hard to read as the main points will not be emphasised.",
            "comment_grading": "The mean grade is B. This is quite nice if you compare the other courses' mean grade.",
            "comment_workload": "Very little. No homework. If you volunteer to do the project, your workload will probably be greater.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wlFxoauM5N0RQwnvetoBSWPj0uTahHFx",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lychee11",
            "date": "Jan 18, 2018",
            "title": "有讀就有分",
            "comment_content": "international law入門班<br />個人對law幾有興趣 所以覺得幾好玩",
            "comment_teaching": "有料prof 唔係照powerpoint讀<br />我覺得教得幾好 但我有朋友話悶<br />因為全英教 英文無咁好既話會有小小難catch up",
            "comment_grading": "Absolute grading<br />midterm同final都係全MC<br />我兩次都above mean但未夠一個SD<br />拉返有A-<br /><br />考試要溫notes 睇入面既case 明白個concept 唔洗點死背<br />要上堂抄notes 因為佢會考返小小上堂講過既野<br /><br />不過佢會UP返lecture video&nbsp;&nbsp;唔上堂考試前一定要睇返<br /><br />如果唔想考final可以做presentation <br />個prof有講過presentation會好grade<br />因為佢會比得好鬆手 至少有B＋<br /><br />Grading %<br />2x% A Range<br />3x% B Range",
            "comment_workload": "個人覺得極少 我基本上無點上堂 <br />考前睇lecture video抄返喲野 再溫就考",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "i0XdjemLM6Vrq23YDw1il1KmCzeiz0LR",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bean",
            "date": "Jan 15, 2018",
            "title": "",
            "comment_content": "History of International Law<br />States<br />Treaties<br />Human Rights<br />Sea<br />Environment<br />Use of Force<br />Peaceful settlement<br /><br />The topics are quite interesting. They are all basically about the history and the reasons how the laws evolved. It is not like memorizing the status of laws.",
            "comment_teaching": "The professor is very fluent in English. However, in terms of lecture, I feel like he is just reading through the powerpoints. It seems like powerpoint is like a script of his speech. There is no break between lectures and information is flooding, which makes you bit exhausted.<br /><br />I really like the powerpoints from TAs. They organized information very clearly and I really liked it. It will be very useful for you to attend tutorials.",
            "comment_grading": "Mid-term exams: (around) 48 questions<br />Final exams: (around) 52 questions<br />1 Presentation: optional (if you do, you will get higher mark, I guess)<br /><br />The number of mid-term and final exam questions are adding up to 100. Thus, your score is determined by the number of questions you got in both exams.<br /><br />The wording of the exam questions is very different from what it was written powerpoint. You need to make sure you study A LOT and memorize A LOT for the exams.",
            "comment_workload": "There are no workloads at all if you do not do a group presentation.<br />There is no homework at all. All you need to do is just read again the powerpoints that the professor used.<br /><br />No attendance is checked.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "t6jOp11gGmJ9lDTkiG44gX2GrGzQi24L",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "dondondon",
            "date": "Jan 01, 2018",
            "title": "Fair Course",
            "comment_content": "Mainly focus on history and principles of international law. Many cases are included under different topics. While the professor stressed that we don't need to remember factual details but just understand principles of these cases, you still have to remember some facts of them because in the exams, questions will be asking what is the principle demonstrated in these cases but nearly none of the details of the case except for its name is given.",
            "comment_teaching": "Pretty good. Powerpoint are mainly in point forms and not really that easy to understand by reading on your own. Professors link different points well so you can remember easily during lectures and tutorials slides are pretty useful too.",
            "comment_grading": "Two exams, 50% each.<br /><br />Pretty fair. I got above mean for about 1 SD in both exams and did not opt for the project which usually give a more fair grade. But finally I still got an A-.<br /><br />Second exam is held prior to the study break duing the last lecture this semester so be prepared for that. Presentations by students' research project will also be included in the second exam. Although lecture videos and powerpoints of them are uploaded to canvas, it is better to attend the last few lessons of students' presentations as questions raised by the professor, which is sometimes the main points for questions in finals, can not be clearly heard in the lecture videos.",
            "comment_workload": "Not heavy at all. Only 2 exams each account for 50% of the course grade and content is not cumulative. All questions are also MC so it should be okay as long as you understand the concept. You may have heavier workload if you choose to do the optional project for potentially better grade.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "b3VIVF80D0TWTnTiMu8OTybr06mIp5wi",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YSA",
            "date": "Dec 27, 2017",
            "title": "Must take if you're interested in international affairs, or for an interesting Common Core with very low workload",
            "comment_content": "Basic introduction to International Law (IL).<br /><br />Topics:<br />Historical development of IL<br />Customs and Treaties<br />States and International Organizations<br />International Human Rights<br />Sea, Air, Space Law<br />Environmental Law<br />Use of Force<br />Peaceful Settlement of Disputes<br /><br />The level of difficulty is very basic. No previous knowledge of any subject is required.<br /><br />Topics are interesting and made relevant by the use of many recent, real-life IL cases to demonstrate different laws.<br /><br />All lecture PPTs, tutorial PPTs, student presentations, exam questions, and multiple choice options are provided in both English and Chinese.",
            "comment_teaching": "The professor is an excellent lecturer, very enthusiastic and interesting. Explains all concepts very clearly and slowly, and helpful to answer any questions.<br /><br />All lectures are recorded and uploaded on Canvas, but it's worth attending in the lecture theatre if you have time.<br /><br />There are optional weekly tutorials in English and Chinese just to recap the week's lecture, not necessary to attend. Tutorial PPTs are also uploaded.<br /><br />The professor holds 1-hour long review sessions in a classroom the night before the midterm and the final, these are very helpful especially if you haven't been attending lectures. Many questions and tips discussed are similar to the exam questions.",
            "comment_grading": "Midterm: 48%<br />Final: 52%<br /><br />Both exams have only MCQs, each MCQ is worth 1% of the final grade.<br /><br />There is an optional student report+presentation. If you do that, 50% of the final grade is based on the report+presentation, 50% is the exams.<br /><br />In the final, 16 out of 52 questions are based on the student presentations.<br /><br />Grade distribution:<br />A's = 25.6%<br />B's = 33.6%<br />C's = 28.2%<br />D's = 8.0%<br />F's = 4.5%<br /><br />Grades are quite high for a large 1000-level course.",
            "comment_workload": "Only midterm and final. Both are during lecture time, so no separate exam during the final exam period. The exam questions are all directly from the content in the lecture PPTs, so it's not necessary to attend tutorials or do the recommended reading material. Just 4 topics for the midterm (~100-120 slides) and 4 topics + 9 student presentations for the final (~200 slides). Easy to get an A with just 4-5 hours preparation before midterm and final, without attending any lecture.<br /><br />There is an optional report+presentation if you want to do, in groups of 1-2 students. The report is 12-15 pages and presentation is ~20 minutes, so that would probably take a lot of time to prepare.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": [
                {
                    "key": "XIsjpyQpOxP7inH4dK9PB3BYFPqTJbJ4",
                    "name": "SOSC1270 Syllabus (English)",
                    "format": "pdf"
                },
                {
                    "key": "6QWREI1iVyEEZKFPCyhO3piStERvcB1M",
                    "name": "SOSC 1270 Syllabus (Chinese)",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "uwLIUn36cuPDUzWVxe6shokA4ji54jxJ",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mandy0605",
            "date": "Dec 12, 2017",
            "title": "",
            "comment_content": "The lessons are quite easy to understand and it is quite simple to know what is the lecture mainly tells about.<br />It is mainly a introduction class, rather than a detailed law class.<br />We had gone through these sections:<br />History<br />Treaties and customary international law<br />States<br />Human Rights and I.O.s<br />Sea, Air and Outer Space<br />Environment and Global warming<br />Conflict and War<br />Peaceful settlement",
            "comment_teaching": "Teaching is really interesting and the teacher often talks about his own experience, which is really great.<br />Also, there is video prepared for you after the class so that you can miss some classes if it is impossible for you to attend the class on time.<br />Extra tutorial classes are prepared both in English and Cantonese, thus you can choose whatever you like.",
            "comment_grading": "Quite good grading.<br />25.6% A range <br />33.6% B range<br />28.2% C range<br />the total points is 100 (48+52)<br />I got 43/48+40/52=83/100 Finally A+<br />the mean of the first exam is about 30<br />the median 31 and highest 43<br />the mean of the second exam is 31.44<br />median 31 and the highest 45<br />My paper is A and overall the paper's score are really high. 4 groups get A, 3 groups get A- and 2 groups get&nbsp;&nbsp;B+.",
            "comment_workload": "Well, I don't think the workload is light.<br />If you want to know the cases and definitions in great detail, you need to read a lot of books as well as articles.<br />Also, you need to review the lecture notes and students speeches as well as lecture videos, which may cost you a lot of time.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cHSqPQtvblXzJhF2qKJiLzpNsyw60PMB",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kabe",
            "date": "Dec 07, 2017",
            "title": "Great course",
            "comment_content": "The course focus on basic theory on International Law. About History, Treaties, States, Human Rights, Law of Sea, Air and Outerspace, Environmental Law, Use of Force and Peaceful Settlement. Student can also apply for writing essay on International Law and present it on class. Maximum 9 groups comprise of 2 students will be selected.",
            "comment_teaching": "Prof. Sautman is passionate about teaching as he kept on asking student for raising questions although students are not quite willing to ask. However the lecture ppt are not well organized and the Chinese translation is not accurate. Also, professor talked about a lot of extra material not included in the lecture powerpoint, but these materials are going to be asked in the exam. So attend lesson for good grade.<br /><br />There are also an English tutorial section and a Chinese tutorial section, Kevin, the TA for English tutorial section, prepare a detailed tutorial powerpoint which is better than the lecture powerpoint in my opinion.",
            "comment_grading": "Grading is very good. The grading this semester is even better than any semesters before and ~25% of students get A range. One midterm exam and one final exam, 100 MCs account for 100% marks in total. For students writing essay, the grading will be 50% essay &amp; presentation and 50% exam. <br /><br />Midterm: 41/48, mean = 30.87, SD = 5.19<br />Final: 45/52, mean = 31.44, SD = 5.57<br />Finally get an A+. <br /><br />For Percentage:<br /><br />A's = 25.6%<br />B's = 33.6%<br />C's = 28.2%<br />D's = 8.0%<br />F's = 4.5%",
            "comment_workload": "Very light, nothing except exam if choose not to do essay. There are newspaper reading distributed on lesson, but in fact not asked in the exam. Attend lesson, revise the lecture powerpoint and tutorial powerpoint is enough for satisfactory result in exam.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HsADH9sE3PE4jWCMm20UBJfRS2BciO7I",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yh.hohoho",
            "date": "Dec 05, 2017",
            "title": "a nice IL introductory course",
            "comment_content": "the entire course will cover:<br />1. History<br />2. Treaties<br />3. States<br />4. Human Rights<br />(tested in exam 1; midterm)<br /><br />5. Sea, Air, and Outer Space<br />6. Environment<br />7. Use of Force<br />8. Peaceful Settlement<br />(tested in exam 2; final)<br /><br />you really will learn sth if you're interested in social science, and especially law-related stuff and international relations.<br /><br />ppt slides are bilingual, although there will sometimes be translation mistakes. lecture videos are offered through canvas; no attendance taking. <br /><br />recommend watching those videos sth like one or two weeks before exams in 2.0x speed.",
            "comment_teaching": "the pace of teaching is a bit slow, and the ppt slides are not really up to date.<br /><br />yet, the professor is a nice Canadian professor... like his accent a lot. <br /><br />btw, he will reply students' email pretty fast and with detailed explanation/answers!",
            "comment_grading": "100 multiple choice questions<br />48 in exam 1; 52 in exam 2<br />: 1 question correct = 1 point in final score<br /><br />need to study and memorize thing<br />total score ~70 will get you into A range<br />[statistics]<br />exam 1<br />&nbsp;&nbsp;&nbsp;average 30.87<br />&nbsp;&nbsp;&nbsp;sd 5.19<br />exam 2<br />&nbsp;&nbsp;&nbsp;average 31.44<br />&nbsp;&nbsp;&nbsp;sd 5.57<br /><br />[bonus]<br />presentation and research report is optional, but you will need to go through a lucky draw process as people go for it for a sub-grade raise promised(?) by professor",
            "comment_workload": "the workload is pretty light, all you have to do is study the slides and lecture videos if you didn't attend the lectures. there are no assignments nor reading materials, and no need to prepare before the classes start.<br /><br />and the final exam is tested before [final period] which to me is an advantage.<br /><br />there are optional tutorials to attend; tutorials are separated into two sessions: a Cantonese session and an English session.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "i4bGwOJbvOO0J76M2KROonZdqzRpDbN7",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mattpyf",
            "date": "Aug 31, 2017",
            "title": "",
            "comment_content": "This course will teach you some basic knowledge of international law, including definition, enactment and some of it. Yet, you won't learn much based on the materials provided in the lesson. If you really want to know more about this IL, you need to read the reading materials on your own and it is completely useless for the quiz and examination.",
            "comment_teaching": "Honestly, I think the teaching is quite boring and it does not only because of the professor. As people do not need to take attendance in this course, you will soon find that there are not many people left in the lecture. Also, all the questions asked in the examination can be found in the notes provided so you can totally study it on your own and still have a good grading. That makes the whole atmosphere a little bit boring.",
            "comment_grading": "The grading is really good especially to those who are not good at English as all notes and quiz provided both English and Chinese versions. 35% of the grade is the quiz and 65% is the examination. All the questions are mc questions. There are 35questions in the quiz and 65 questions in the examination. It is not difficult to have a good grade if you read the lecture notes carefully.",
            "comment_workload": "As mentioned, you only need to do 100 MC questions throughout this course and you do not need to attend the class so the workload is extremely low.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NhcXyXkESpk07tpPpMI4Ueq74wXEJ49U",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "anniehahalala",
            "date": "May 16, 2017",
            "title": "Very Good",
            "comment_content": "Very interesting<br /><br />Topics for midterm:<br />-History<br />-Customs and Treaties<br />-States and International Organizations<br />-Human Rights<br /><br />Topics for final:<br />-Sea, air, space law<br />-Environmental law<br />-Use of force<br />-Peaceful settlement of disputes<br />-Student presentations",
            "comment_teaching": "Barry is a passionate prof. who always encourage us to ask questions. There are also tutorials offered after class.",
            "comment_grading": "Pretty good.<br />Poor Students-about 15% of class <br />Ave./Good Students-about 60% of clas<br />Very Good Students-about 15% of class<br />Excellent Students-about 10% of class<br /><br />You can volunteer to write and present in class a research paper on a current IL topic.&nbsp;&nbsp;If you do, the paper will be 50% of your final grade; your exam marks will be the other 50%.&nbsp;&nbsp;The average grade on papers is generally one full grade higher than the average.",
            "comment_workload": "No workload if you do not do the extra paper. Very Good!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7L7gWdXUKCHXNgabteWnYZYjvgoGXeTn",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Turtle",
            "date": "Dec 19, 2016",
            "title": "Introduction to International Law",
            "comment_content": "Content:<br />Historical Development of IL and Customs and Treaties<br />States and International Organizations<br />International Human Rights<br />Sea, Air, Space Law<br />Environmental Law<br />The Use of Force and Peaceful Settlement of Disputes<br /><br />In fact, this course is just a 1xxx level course, which means it is quite easy. The course only focuses on the basic concepts, which means that you do not need to memorise a lot of things. Attending the class, you will be safe.",
            "comment_teaching": "One of the best professors in ust who is willing to answer students' questions in class or after the lesson. He is really familiar with this topic and used a lot of examples in class. He can clearly deliver the ideas to you so that it is not quite hard to pick up all the things. Also the TA is really good. There will be some supplementary tutorial held by the TA to help students fully understand the topics and the concepts.",
            "comment_grading": "Grades:<br />Excellent Students = ~10%<br />Very Good Students = ~15%<br />Ave./Good Students = ~60%<br />Poor Students = ~15%<br /><br />If you take this course in the summer semester, actually the grading is much better. I think it is not that difficult to get an A range in this course as quite a lot of my classmates did so.",
            "comment_workload": "Grade Calculation:<br />Final Exam = 50%<br />Project = 50%<br /><br />Final Exam = 100 MCQs<br />Project = In-class Presentation + Essay<br />(Work shared by 2 students)<br /><br />The questions are quite straightforward. But it is quite intensive as it only take three weeks to finish the course (half of the summer semester). For the project, each group needs to pick a question and do the presentation in class at the end of the course, and submit the essay after the final.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "w8JjUK4CjDpfWvtZPPMuSNyv9ayTa0By",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Brenda ZHANG",
            "date": "Feb 02, 2016",
            "title": "",
            "comment_content": "Good class to equip people with a common sense of law. It covers a lot of topics such as human rights, sea, air, environment, etc. Not suitable for those who have no interest in law though.",
            "comment_teaching": "Professor is very nice! Will continue to do UROP with him this semester.",
            "comment_grading": "I wrote a 12-page essay with my partner and got A+. Lecture videos are released 10 days before exams so I didn't attend lectures much.",
            "comment_workload": "No workload at all if you skip the optional essay. Just review the ppt before exams and you are good.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "605428eNXVvv3l1LUFTyrjPlRdpvEDyl",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jason W",
            "date": "Jan 28, 2016",
            "title": "Essay saves your grade",
            "comment_content": "The course give you a lot of freedom, no attendance will be taken for both tutorial and lectures.Workload is also really low, with only one mid term and one final, both consist of MC questions only which make it a really low workload course. Your grade will be based 100% on your exam, however, you can write a voluntary essays and consist 50% of your grade, so exam will only consist of 50%.<br />For each units, professors will prepare a power point with main-points. Before exam, lectures videos will be provided. A special thing is for every material(including power point or exam etc.) It will provide Chinese translation.<br />However, for students like me, I find the lectures a bit boring as those cases and law is not so close to our daily life.",
            "comment_teaching": "The teacher is pretty humorous and can also answers most questions that the students has raise up. For teaching assistance, their English may not be that good, so when I attend the English tutorial session, it is not hard to notice the TA is having a hard time when presenting. However, their power point is pretty details and can help review the points mentioned and learnt during lectures.",
            "comment_grading": "From the stat I get, to get into B range, you need about 60% in your exams. Which is not too hard as the exam don't require you to remember many things but just the main points and reason behind. If you want a better grade, you should try to do the essay as the professor is pretty lenient in essays, the lowest he gave in our class is B, so I guess you can do pretty well in the essay part.",
            "comment_workload": "As I mentioned, the workload is really light as the work you have to do is only prepare for the two exams with MC questions only. However, if you decide to do the essay, get prepared for a heavier workload, but the professor will provide help whenever you ask so it should be bearable.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aZ93W2ai8ajAYYCTqhGTTaoqJpYnnLBI",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jellobeano",
            "date": "Jan 24, 2016",
            "title": "Interesting lesson but poor grades",
            "comment_content": "Mid terms and finals are all multiple choices.",
            "comment_teaching": "Lessons were all recorded, attendance is not required. Many things mentioned during the class are out of syllabus,&nbsp;&nbsp;just remember to study the powerpoint and be really familiar with the cases.",
            "comment_grading": "The grades are fixed, you can roughly predict your grades by counting the number of correctly answered&nbsp;&nbsp;multiple choice questions.",
            "comment_workload": "You can choose whether to do a paper or not. According to Berry, students get better grades when they apply to do a paper.There is no assignments yet you need to study really hard to get good grades.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GxMbNlgHBZ9M5nTahtNaoWRykdHKPGQw",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "queenb",
            "date": "Jan 22, 2016",
            "title": "Nice Course",
            "comment_content": "It's content focus on different aspects of international law. It got a quite sensible logic flow. From the history of International laws tp environmental aspects, military aspects, world peaces etc.<br /><br />The major revision point is to revise how the examples' related to the law principle. The details of each example are not required to recite. Clearly understanding is needed.",
            "comment_teaching": "The course is fun if you are interested in law. The professor use many examples to explain the principle or law.<br />If you are a bit confused in the course content, it is pretty common for students to raise questions.<br />And the tutorials are basically act as weekly review of lesson.",
            "comment_grading": "Many international students taking this course, they usually will finish a paper with their familiar knowledge, therefore they potentially get a higher grade. People doing paper nearly guarantee a higher grades.",
            "comment_workload": "0% workload.<br />No attendance record is taken, including both tutorials and lectures.<br />No homework at all.<br />Before mid-term and finals, the tutors will send all the videos link, so you and learn it all at home.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hkWOh0YrG0Uaa8H3szokx5T85IUfXdyU",
            "semester": "2015-16 Fall",
            "instructors": [],
            "is_author": false,
            "author": "FatFart",
            "date": "Jan 22, 2016",
            "title": "Generally speaking, it is a very good course for extra learning, but don't expect to have a very good grade",
            "comment_content": "It is quite inreresting if you are interested in law. It touched different apsects in law around the world and listed many cases and examples. You may need to know the development on a specific law as well.",
            "comment_teaching": "It is one of the best pof. I have ever met.&nbsp;&nbsp;His teaching is very clear and concise, and very interesting as well, since he will not simply read out the power-point, which a lot pof. do.",
            "comment_grading": "Maybe because there are too many students who are enthusiastic to the course, the grade is not very good.",
            "comment_workload": "All most zero workload. No homework, both exam only cover its power-point content.&nbsp;&nbsp;Also, final exam will not ask about the content before mid-term.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WH9gL07m6HzDAFvcF7bYAPeqmHIdcL8s",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gloria Chow",
            "date": "Jan 21, 2016",
            "title": "good grade if you can study hard on your own",
            "comment_content": "mainly concerns international affairs and of course, international law. Can learn a lot about the history of different countries, and get some basic concepts in I law. good to boarden your horizon.<br /><br />1 mid term, 1 final, optional paper with 1 partner.",
            "comment_teaching": "Prof Sautman teaches quite well. Class is interesting. But TAs can't help you much, probably because they don't know much about international law too.",
            "comment_grading": "Grading is fair. I got an A at last but I would say I still havent study very thoroughly before I went to exams.",
            "comment_workload": "Need to take a lot of time to study on your own. Really require hard work to get good grade.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7uOtgdSekgLPcO4iWqYDryMJj4kU5LpI",
            "semester": "2013-14 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gillian",
            "date": "Jan 07, 2016",
            "title": "",
            "comment_content": "It is quite inreresting if you are interested in law. It touched different apsects in law around the world and listed many cases and examples. You may need to know the development on a specific law as well.",
            "comment_teaching": "Barry is a very highly-qualified professor and he made jokes in class as well. You don't need to attend class since there were lecture video posted after the class. You may watch those videos few days before the exam and then you can get a decent grade.",
            "comment_grading": "It's not bad. I got B+ and one score to get an A-. You need to read and memorize all the materials in class and examples to answer all the eam questions.",
            "comment_workload": "there was no assignment and only had optional presentation for replacing your final exam grade.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "areHsDvTvc6NaHn5qzyx4o30WDJcqeVI",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Guillaume",
            "date": "Dec 14, 2015",
            "title": "",
            "comment_content": "Very interesting content: covers legal aspects of sea, land, sky, weapon regulations, and many other fields in a very short but informative class. For those who are interested in international affairs, this is probably the best class that UST has to offer. Those interested in MUN can also consider taking this class as this class provides a lot of background knowledge.",
            "comment_teaching": "Barry Sautman is one of the better professors in the SS deparment. This class took place in a lecture theater, but his voice is so audible that no form of auditory aid is needed. Sautman carries the class at an appropriate pace, and is always eager to answer students' questions. He is a lawyer who has advanced knowledge in the legal career, which is very rare in this university.",
            "comment_grading": "This class has a considerably large C and D range, and since assessment materials for this class is much fewer than that of other classes, it is relatively easy for a student to receive lower than A grades. If you become one of the lucky people to do a paper and puts in regular effort for this class, then it's almost guaranteed that you will have no less than a B. There are two exams, each counting roughly 50% of your final grade, and is entirely multiple-choice. Many of the questions come from lecture materials that is not explicitly mentioned in the powerpoints, so it is better to attend the classes regularly.",
            "comment_workload": "Almost no workload during the semester. Unless you chose to do a paper with a partner, there is virtually no assignment for this class.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SowaMV00XeNDcxpT4wZq06mftSlJebOJ",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ver",
            "date": "Nov 29, 2015",
            "title": "",
            "comment_content": "MIDTERM TOPICS:<br />- History of International Law<br />- Treaties &amp; Customs<br />- States &amp; Sovereignty<br />- Human Rights<br />FINAL TOPICS<br />- Sea, Air &amp; Space Laws<br />- Laws on the Environment<br />- Use of Force<br />- Peaceful Settlement<br />- Student presentation topics<br /><br />Generally, really interesting but dense topics.<br />The course tests you on understanding of concepts, but memorization is needed as well, especially of key case studies and their significance in international law.",
            "comment_teaching": "Professor Sautman's teaching is very clear, and he is a very engaging lecturer. He encourages students to ask questions during and after the lectures, and he answers every question very well. He definitely has a lot of knowledge on and experience in the field.<br />The TAs' optional tutorials were sometimes helpful in summarizing. The practice questions could be confusing at times, though. One time the TA gave us an answer we debated, only to have the answer changed once it was uploaded on Canvas.",
            "comment_grading": "Midterm: 48 MC questions<br />Final: 52 MC questions<br />9 people/pairs who volunteer and make the lucky draw can write a paper and present on a topic of their choice, accounting for 50% of their final grade. People writing the paper have plenty of resources during the course to help them write a good-quality paper, and they work hard, so their paper/presentation grades tend to boost their overall mark.<br />Grading was fair; boundaries seem pretty narrow. As long as you put in a fair amount of effort to go to lectures and do some reading, you should be able to earn a good grade.",
            "comment_workload": "Unless you need to write the paper and make the presentation, there isn't any mandatory work for the course. You don't even have to attend lectures if you don't want to; videos and lecture notes are uploaded before each exam. (Of course, it's recommended to attend the lecture.) The professor hands out readings on current/related events, and there are textbooks named in the syllabus, but these are optional readings. I'd recommend reading at least some of the articles or textbook chapters, though; they really help out during studying.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YVCLtjckn9kllKQND8V6u32vKq0LtUqE",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fierce_bad_girl",
            "date": "Sep 26, 2015",
            "title": "",
            "comment_content": "Probably the best course in UST for people interested in International Relations theory or who have some sort of background in law. Topics covered include treaties and customs, states and international organisations, human rights, sea, air and space law, environmental law and the use of force.",
            "comment_teaching": "Brilliant professor - he's a mildly funny Canadian and hence enjoys making occasional (hilarious) jabs at US politics. Cites engaging examples from current world news, integrates case studies with theory and manages to make a topics that could've been boring as heck interesting. He tends to be quite scatty and unstructured though in that his powerpoints are just random points (with bilingual translations, I'll give him that). <br />His TAs aren't the best though - their accents make the (optional) tutorials quite slow and difficult to understand, although their powerpoints are usually fantastically structured.",
            "comment_grading": "Fair. 9 pairs of students (chosen by lottery) get to write a paper on a topic of your choice related to IL, in which case grading will be 50% paper 25% midterm 25% final. On average this pushes your grade up by a whole letter. There are 48 MC questions on the midterm and 52 on the final, 13 of which are based on the student presentations.",
            "comment_workload": "Unless you choose to write the paper (which will be 12-15 pages plus a 25 minute presentation) there is pretty much no workload. All you have to do is keep (somewhat) up to date with the textbook chapters. Apart from the 2 usual lectures a week there's also a one hour optional tutorial which really helps you summarize the substantial info you've been presented with during the lectures.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 7,
            "attachments": []
        },
        {
            "hash": "26vSFCeUfbJfSmy8iRXN61eco0WtlGGQ",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "polarbear",
            "date": "Dec 15, 2020",
            "title": "If you like law or need SOSC Credit, it's a must",
            "comment_content": "It covers topics about International Law. Includes the history and sources of IL, states and international organizations; human rights; sea, air and space law; environmental law; the use of force; and the peaceful settlement of disputes.",
            "comment_teaching": "Barry is enthusiastic and passionate about this course. He gives lots of examples in his lecture. A couple of these come out on the finals (but not covered on the lecture notes). His lectures feel like barry's storytime (kinda mundane, but not as much).",
            "comment_grading": "You can choose from two options for your grading: 100% Final || ( 50% Final &amp;&amp; 50% Paper) Only a limited amount of people can write papers, and it is chosen by lucky draw. If you get lucky, it will be easier for you to get better grades than other people. <br /><br />Mean was 46.5 out of 80, with an SD of 9.5. The highest score was 66 for Fall 20/21. Barry does give a generous curve&nbsp;&nbsp;A: 23.8% B: 35.4% C:&nbsp;&nbsp;29.3% D: 6.6% F: 4.9% But it is easy to fall into the C range, so be aware of that.",
            "comment_workload": "The workload is generally 0. There is no attendance, quiz, or HW (if you are not writing a paper). But you might want to attend those classes where students give their presentations as those will also be on the final exam. If you study for a solid week for the final, that would be enough for you to get a good grade.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8Yt8DWcW1jYIlbtDpTmlrFvNtTYGTVII",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mushroom",
            "date": "Dec 30, 2019",
            "title": "",
            "comment_content": "Contents are interesting. Some are related to life, making it not difficult to memorize.",
            "comment_teaching": "Barry is very humorous, while his tone makes us sleepy. I prefer to watch lecture videos after class lol. Lots of information are not given in the slides, so make sure to take notes. His lecture videos require hours to go through (for me, more than 2 hours).",
            "comment_grading": "Can choose to do an essay or not<br />Do essay: <br />50% essay, presentation<br />50% midterm+final<br />No essay:<br />50% midterm<br />50% final<br /><br />Fall 19-20 doesn't have the presentation part since class arrangement, so the final exam only had 39 questions. <br />I did not sign up for the essay and got 1.3 sd above in midterm and 1.5 sd above in final. Got an A. Maybe people writing essays get a better grade as Barry said, but I still appreciate the grade for the workload.",
            "comment_workload": "Start studying a week before the exam is enough. The midterm exam comes soon after the add-drop period so study earlier.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XRL5pB8zHdr73eo3zbJI4BK3rjFWHTHy",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "whrchan",
            "date": "Sep 14, 2019",
            "title": "",
            "comment_content": "Basic International Law topics such as history of IL,treaties,law of sea, air, space etc.",
            "comment_teaching": "Very clear and ppt provided, maybe boring sometimes, but he is very nice and you may ask him questions.",
            "comment_grading": "Very good grade, you may get a better grade if you choose to do a voluntary presentation. But the grade is already good enough if you don't do it. Marks slightly higher than the mean could already get an A-.",
            "comment_workload": "Best among all courses. No attendance for lectures, no homework, all MCs for exams. You just need to memorize some ppt and some cases which didn't take much time",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QrstwxMZLysK6hEEiPdVHwLABl3xPcXW",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Timmy",
            "date": "Aug 29, 2019",
            "title": "Good Grade, Good Teacher and Interesting Content",
            "comment_content": "The content includes basic international law concept, and different areas of international law, like Sea, Air &amp; Space Law, Human Right, the Use of Force etc. There are a number of cases for each topic since the note comes in both Chinese and English, it should be easy to understand. Cases are interesting and some cases really surprise you (at least it surprised me).",
            "comment_teaching": "Barry is very nice, and he understands some topics are quite boring so he does provide lecture videos, so if you don't understand just go back and watch the video or just ask him directly. <br /><br />Since he is from the US, his English is very good and easy to understand, you can Google search for him, he really has a page on Wikipedia.<br /><br />Some lectures are boring, but it's really not the professor's problem, it's the topics and it's law how exciting can it be.",
            "comment_grading": "2 Exams (MC) (each question in both English and Chinese) <br />1 Research Paper (optional)<br /><br />According to the Prof people who do the research paper tend to have a better grade, I didn't do the research paper but I still got an A for this course, it's really just about memoizing, but to me, the course content is interesting so it's easier for me.<br /><br />Exams are just MC about 84 questions will be based on lectures and 16 on student presentations, so if you pay attention it won't be hard.",
            "comment_workload": "The tutorial is optional, no attendance is required, there are lecture videos, so if you don't do the research paper, there's is nothing to do at all, just a few readings and attend the class and that's it.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H4rsDIuQS1s0drHl50Gh3B5mlPzNYhN6",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Claire~",
            "date": "Aug 18, 2019",
            "title": "Convenient course!",
            "comment_content": "The course includes basic international law concepts along with classic cases in history. The contents are still valuable today as the law develops to suit today's situation and needs.",
            "comment_teaching": "Canadian instructor, no accent, obviously.<br />He tried his best to tell us more stories but his voice makes me want to sleep.<br />Good thing is that this course has lecture videos.",
            "comment_grading": "Amazingly great.<br />I was below mean in the midterm and finally got an A-<br />midterm+final = 100 MCs = 100 points<br />this is the only grading scheme if you dont want to write papers. No attend, no parti. Easy and convenient.",
            "comment_workload": "I can't say the workload is light because it requires a lot of memorizing. But that' all you need to do. Just remember everything then you can get the MCs right. There are only 2 tests. No quizzes, no assignments, no nothing. You don't need to attend the letures, just sit in the dorm and watch all the vedios and wirte down important notes. Then remember the cases and the principles they reflects. That's all he is gonna test you in the exams. No presen, no group work, just enjoy.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "G55RcXRY4cc5itfbhjCNInfwknw8z1ZL",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mzimmer",
            "date": "Jan 28, 2019",
            "title": "",
            "comment_content": "History and basic info about lnternational law. Nice if you don’t know much about law and international organisations (especially UN). Attending tutorials is quite useful, but TAs aren’t experts so don’t expect them answering difficult questions. Anyway - tutorial slides are a lot more useful, as those provided by prof. Barry are quite chaotic. Reading a book may be helpful but mesmerising the slides is enough for a good grade.",
            "comment_teaching": "After 20 minutes gets a bit boring (but come on - it’s law). He really likes it when students ask a lot of questions, so please do. Also professor quite dislikes the US and is way much “nice” when it comes to China, which may be seen as a bit unfair (he’s Canadian btw).",
            "comment_grading": "Some exam questions are a bit tricky, so you should read all the questions carefully. Generally - mesmerise all the slides and try to write a research paper, as it may affect your grade (positively of course). If you’re even a bit above the mean - expect a B. <br /><br />Generally good grading, but those who don’t study at all - getting C or D is highly possible.",
            "comment_workload": "For those who don’t have a research paper to write - not much at all. You don’t even have to come to the lectures, nor tutorials.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gAfPpClQ9vrhLYi7t1oWZP127X0X8XwR",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yymic",
            "date": "Jan 24, 2019",
            "title": "",
            "comment_content": "International law introduction and examples mainly. <br />Topics: History, Treaties, States, Human Rights, Law of Sea, Air and Outerspace, Environmental Law, Use of Force and Peaceful Settlement. <br /><br />A bit complicated and you really have to study thoroughly.",
            "comment_teaching": "He is an interesting professor. You can know some fun facts about international laws and stuff, and he gladly answers any questions.<br />His voice is low and the pace is simply slow. Many find that sleepy, and the slides are just boring to say it only has words and words. <br />Hate to say that watching the lecture videos is a better choice than attending his lectures. It is so long and in a sleepy afternoon. But if you have true interest and questions, you will find the course interesting.",
            "comment_grading": "I must say that only if you have a good understanding of this course, you will get a high score. I find the concepts quite confusing and need to look up wiki for every topic. The 5 practice questions for final is basically not a good example. And yup, I didn't get a good grade. But I know people do get good scores.<br /><br />Presentations seem to lead you to better gradings, but my friend doesn't seem to have a significant uplift in her marks, so.",
            "comment_workload": "If you skip those extra reading materials, you don't have any workload.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RCzIq2aJkzZ0C8tuwCaU5LgprsiClTUp",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "吖享",
            "date": "Jan 21, 2019",
            "title": "",
            "comment_content": "It simply introduces us the fundamental concepts of international law which are the same as the one people are taught in Harvard Law School. Much as there were lots of cases introduced during the lessons, they were simple and do not really need deep understanding or memorizing strictly.",
            "comment_teaching": "Professor Barry is one fantastic lecturer, not only he can explain everything in detail which makes everyone understands the conceptions of laws, but also he accepts all kinds of questions during and after his classes to make sure everyone can thoroughly learn the ppt.",
            "comment_grading": "It is without doubt that the grading is generous. 50% mid-term and 50% final, and only 100 mc in total, once you got 70% right, you got yourself an A grade. The questions were not hard and quite straight-forward, mainly related to concepts but not details of cases.",
            "comment_workload": "No particular workload I would say<br />No webwork<br />Optional essay and presentations<br />ONLY mid-term and final which consists of 100 mc in total",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SysrmzQ2LdVWWcyjx6Q674meKjIo7Ofi",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wahaha",
            "date": "Jan 20, 2019",
            "title": "very good cc course",
            "comment_content": "He said very year there will have one or two students who want to be a lawyer after his course XD<br /><br />Midterm:<br />Historical Development of International Law<br />States and International Organizations<br />International Human Rights<br /><br />Final:<br />Sea, Air, Space Law<br />Environmental Law<br />The Use of Force and Peaceful Settlement of Disputes<br />Student Presentations' topics",
            "comment_teaching": "He is open to questions and willing to give a small tutorial before mid-term and final so you can ask he questions or clarify some concepts.<br />There are also optional tutorials from TA, the ppt will be uploaded to canvas so no worries if you don't go.<br />He tried to make the lectures interesting but personally,I think it's still boring.<br />There are lecture videos!!!!!!!!!!!!!",
            "comment_grading": "approximate<br />50% mid-term<br />50% final<br />depend on how many mc questions. each mc 1%<br /><br />optional presentation which could count 50% of the final exam grade. the mean is one grade up than final.<br /><br />32/48 midterm mean: 30<br />40/52 final mean: 31-32? (not sure)<br />i didnt do the presentation<br />grade A-<br /><br />need to be talented in memorizing all the ppt, if you hate memorizing things, dont choose this course.",
            "comment_workload": "probably the lightest workload among all cc course. no attendance no project unless you want to do the optional presentation. reading materials are optional, won't appear in exams.<br />But content of student presentation will appear in final exam.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TcE78UiaJHDeLR25PB0O3AgANL7ZoxSY",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ArthurMorgan",
            "date": "Jan 19, 2019",
            "title": "",
            "comment_content": "So this is basically a history course more than a law course. You will learn the history of I.L. and how I.L. is being applied in different contexts. FYI, there will be tons of cases and details of treaties to memorize, but if you are good at memorizing things, then this course should not be a problem for you!",
            "comment_teaching": "Prof. Barry Sautman is a very kind professor and so enthusiastic about teaching. His tone in teaching is pretty acceptable and not boring. Even though some of the content of the lessons is boring, I can see he was trying his best to make things clear and interesting! Moreover, he loves students raising questions or bring up controversial topics.",
            "comment_grading": "If you are a hardworking student and have the ability to memorize all treaties and cases, then you might able to score a B. But if you want more than a B, then you will have to do more than just memorizing but also &quot;understanding&quot;. Because the questions in the test are usually situations and usually require the understanding of a certain topic more than the exact wording of the topic. All in all, the questions in the test/exam is rather easy.",
            "comment_workload": "ZERO workloads, no assignment, 1 midterm, 1 final exam. There is an optional paper writing though, you can either do it alone or team up with 1 person to complete the paper.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bvMh6EI3VALEg9Nqf9AYwyHeITYm2iTJ",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Xiaxy",
            "date": "Oct 11, 2021",
            "title": "Good Professor",
            "comment_content": "Interesting<br />1, 6, 8, 13 Sept. Historical Development of IL (A Ch 2; D Ch. 1; K Ch1; K-I Ch 1;Y Ch 1-2) and <br />Customs and Treaties (A Ch 3-4; B Ch. 2, 7; Di Ch 2-3; Do Ch 9; K Ch 2-3; K-I Ch. 2-3; Y Ch 12)<br />15, 20, 27, 29 Sept.: States and International Organizations (A Ch 5-7, 11-14; B Ch. 4, 6, 8, 9, 11, 16; Di <br />Ch 5-7; Do Ch 3-4, 8, 10; K Ch 4-5, 7; K-I Ch 5-7, 11; Y Ch 3,-6, 10-11)<br />Tutorial: To Be Arranged (TBA)<br />4, 6 Oct.: International Human Rights (A Ch 15-16; B Ch 10; Di Ch 12; Do Ch 7; K Ch 6; K-I Ch 12; Y <br />Ch. 9). <br />11, 13 Oct.: Sea, Air, Space Law (A Ch 8-9; B 12-13; Di Ch 8; Do Ch 5-6; K Ch 13; K-I Ch 8; Y, Ch <br />7-8)<br />18, 20 Oct.: Environmental Law (A Ch 17; B Ch 14; K Ch 14)<br />25 27 Oct.; 1, 3, 8, 10 Nov.: The Use of Force (A Ch 19-21; B 5, 18; Di Ch 11; K Ch 10-11; Y Ch 14)<br />and Peaceful Settlement of Disputes (A Ch 22-23; B Ch 17; 16; Di Ch 12; Do Ch 11; K Ch 8; Y Ch 13)",
            "comment_teaching": "Good English",
            "comment_grading": "Poor Students Ave./Good Students Very Good Students Excellent Students<br />about 15% of class About 60% of class About 15% of class about 10% of class<br />miss most lectures <br />never reads<br />not interested in <br />doing a paper<br />attends most lectures<br />reads little or nothing<br />may be interested in <br />doing a paper <br />attends most lectures<br />reads sometimes;<br />interested in doing a <br />paper<br />Attends almost all <br />lectures; reads a lot <br />very interested in <br />doing a paper<br />ILO (#1): get a grade <br />and have some idea <br />of what topics are <br />covered by IL <br />ILO (#2): same as #1;<br />+ at end of course, <br />able to understand <br />news articles on IL <br />topics <br />ILO (#3): same as #1 <br />and #2; + can <br />basically discuss key <br />social issues affected <br />by IL, in writing or <br />orally<br />ILO (#4): same as <br />#1,2 and 3; + has <br />basically grasped <br />how legal reasoning <br /><br />But the mean is not high",
            "comment_workload": "No Assignments at all.<br />There is only one course requirement: to take one multiple choice (MC) exam totaling 80 bilingual <br />questions (each question in both English and Chinese). About 64 questions will be based on lectures and <br />16 will be based on student presentations.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}