{
    "error": false,
    "course": {
        "id": 1166,
        "subject": "SOSC",
        "code": "2280",
        "name": "International Relations of East Asia",
        "description": "This survey course helps students understand interactions among states in East Asia since WW II. The course presents a multi-tiered conceptual framework to explain current problems in East Asia the key events that have occurred there since WWII. The first part of the course presents an historical survey of the major events in the region. The second part applies theories and approaches from international relations to these events. The third part looks at the key bilateral and multilateral relationships in East Asia. The fourth part analyzes key issues, including the Korean nuclear crisis, potential conflict in the South China Sea, relations between Taiwan and the PRC government, problems related to energy, the environment, migration, and the impact of China’s growth on the region. A simulation game will allow students to engage in a crisis management situation, bring real-time experiences to academic knowledge and demonstrate how theory can be applied understanding foreign policy decision making.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            1730,
            1630,
            1530
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.5,
        "rating_teaching": 4.33,
        "rating_grading": 4,
        "rating_workload": 2.5,
        "review_count": 6,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 670,
                "name": "ZWEIG, David Stephen",
                "count": 6
            }
        ]
    },
    "reviews": [
        {
            "hash": "vV6Jo8xqgT4TFOxStiZasy3TbSgRhOma",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 670,
                    "name": "ZWEIG, David Stephen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "helpme",
            "date": "Jul 02, 2017",
            "title": "Interesting course, but beware.",
            "comment_content": "Interesting contents, history buffs and social science lovers will love this course more than any other courses in HKUST. <br /><br />Despite its name, it does not only focus on 'the International Relations of East Asia' but also tend to focus on the United States and South East Asian countries such as the three indochina nations and Taiwan (it might count as East Asia but...)&nbsp;&nbsp;Well, does not hurt you, it is true that knowledge on these nations is crucial to understand the East Asian history and politics.",
            "comment_teaching": "The lectures are very interesting; partly because I am originally fond of social science, and mostly because professor knows how to tell interesting social science jokes which I enjoyed a LOT. <br />Sometimes, other lecturers from different institutions visit UST to teach us about special topics; they were quite enlightening. <br /><br />WELL, one thing that I should comment about this course is that I feel this course highly disorganized. the PPTs are often uploaded late, and we, overall, failed to follow what the syllabus indicated. Therefore, attend your lectures so that you know what the class is actually learning about (looking at the syllabus and self-studying is not likely to be a good idea)",
            "comment_grading": "Hard work pays off, this explains everything. <br />Read the lecture PPTs, reading materials (honestly, I had to skip some of them, who can even read all of them), and make it yours before the midterm and finals. Work constantly during the simulation game!&nbsp;&nbsp;participation does not seem to affect the grading, but prof makes some cold jokes about our participation, poking on our hearts. <br /><br /><br />(Nobody ever posted the curve for this lecture before, so hope it helps)<br /><br />The Midterm was actually quite difficult, but since the Professor will constantly tell the class that the exams are going to be hard as hell, you will feel less intimidated as you sit for the midterm.<br /><br />The average score for the midterm was 62.6, and the median was 63. The SD is 12.4, and the high and lows were 83 and 35. <br /><br />The Final was actually quite normal. Since the final is composed of essay questions, you would also be able to include information not discussed in class. This gives great advantages to students from the countries actually discussed during the lecture (Korea, Japan, Taiwan, PRC...etc.).<br /><br />The average for final was 76.4, and nothing else was released. <br />As a reference, a score of 87.7 ranked 4th place within the entire class. It might partially explain the distribution. Hope it helps.",
            "comment_workload": "Was contemplating between giving a C and a D, but gave an D in order to emphasize the horrifying workload of this bloody lecture. <br /><br />Unless you really like social science subjects like history, politics, international relations...etc, I don't recommend this lecture to you because you will really regret taking this lecture after seeing the shit ton of things you gotta read to get a good grade. <br /><br />If you are an exchange student, and this lecture counts as pass and fail. This lecture is literally designed for you since you would be able to participate in interesting discussions and learn fun things without being pressured by grade.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8b868xeNOYCRy3LGL7PNCL6vsuoYjxCo",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 670,
                    "name": "ZWEIG, David Stephen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kabul",
            "date": "May 26, 2018",
            "title": "Heaven for learning. Hell lot of workload.",
            "comment_content": "One of the best courses ever in UST. Starts with a brief post-WWII history of E Asia, and then moves to the broad picture of how we understand different countries' decisions using a few structured analytical frameworks, including the &quot;security dilemma&quot; under the Realist's school, the Dittmer's model of the strategic triangle, the roles of leadership and ideology, the two-level game of domestic politics, and the International Political Economy's (IPE) perspective. A very rewarding course that helps us understand the international relations of E Asia.<br /><br />Pre-midterm content mainly covers the historical perspective, whereas the final exam covers the rest, but you need to exemplify your statements with historical examples if appropriate. That's to say, you MUST be prepared to go through all these tedious histories after WWII cuz they are crucial to the understanding of the international relations.<br /><br />1️⃣ Historical Perspective<br />🔶 1 Introduction - Studying International Relations in East Asia<br />🔶 2 Historical Legacies<br />🔶 3 Origins of the Cold War in East Asia<br />🔶 4 Korean War<br />🔶 5 Geneva, Bandung, and Détente in East Asia<br />🔶 6 Sino-Soviet Split and Sino-Indian Border Wars<br />🔶 8 The US in Indo-China<br />🔶 9 Soviet Emergence and Sino-US Rapprochement<br />🔶 10 Third Indo-China War<br />🔶 11 Gorbachev and the End of the Cold War in East Asia<br />🔶 12 America Resurgent, the New East Asia, and the East Asian Financial Crisis<br />🔶 13 China in Ascendency<br /><br />2️⃣ International Relations Theory<br />🔶 16 The Strategic Balance in East Asia<br />🔶 17 Leadership and Decision Making in Foreign Policy<br />🔶 18 Domestic Politics and Foreign Policy<br />🔶 19 International Political Economy of East Asia<br /><br />3️⃣ Major Power Relations<br />🔶 20 China's Relations in East Asia<br />🔶 21 The US in East Asia<br /><br />4️⃣ Multilateral and Transnational Issues<br />🔶 22 Korean Peninsula &amp; North Korean Nuclear Program<br />🔶 25 The Future of East Asia<br /><br />Some say the content lacks organization / logical flow, but it's YOUR job to re-organize all the stuff, at least before the exams, e.g. in chronological order, or in terms of how each event affects each other. Throughout the spiral of history, multiple events happened at a certain time, and they can be inter-related or not related at all. There are multiple ways to organize the events, and no single way of organization can universally explain everything. With that in mind, the best way for you to have thorough understanding is to re-organize the materials yourself in your own way.",
            "comment_teaching": "Prof Zweig has a great sense of humor. He loves teasing us a lot, especially if you have the habit of adding the word &quot;like&quot; for every sentence, or if you start your question by saying &quot;I'd like to ask a question&quot;. And he loves mocking some countries as well, e.g. &quot;the Filipinos have the SUPERIOR capability to elect bad and corrupt leaders&quot;, or &quot;Brazil will have a bright future ahead, and always WILL be&quot;. LOL what a guy~ If you're 玻璃心 or you cannot stand your heart being ditched every lesson, then don't go for this course.<br /><br />The class is full of exchange students with so much passion for international relations. (I guess the purpose they came here for exchange because they really wanna understand E Asia. You've gotta understand their mentality.) If you aren't that type of students with that much enthusiasm or you don't watch any news you'll certainly fuck up the whole course cuz these guys will easily kick your ass.",
            "comment_grading": "✏️ 30% midterm<br />✏️ 40% final exam<br />💬✏️ 30% simulation game<br /><br />✏️ The midterm consisted of MCs, T/F questions and a map where you needa match the place with the correct position (easy marks here). It was actually quite hard and the prof might confuse you with the chronological order of the events in the MCs, or mislead you to put together two events that actually happened in completely different time-frame. Make sure when you prepare for the exams you re-organize yourself what has been taught.<br /><br />✏️ The final was a 2-hour exam in which we had to answer 4 essay-type questions out of 7 questions in the exam booklet, out of 15 questions the prof gave us in advance to prepare for the exam. However some of the wordings of the questions were changed, e.g. <br /><br />Original: What different distributions of power have existed globally and in East Asia (if they were different) since the end of WWII and how have these power alignments and shifts in those alignments affected the actions of individual states in East Asia? How does the rise of China affect East Asia, including the relationship of states to the U.S.?<br /><br />Actual exam question: What different distributions of power have existed globally and in East Asia (if they were different) since the end of WWII and how have these power alignments and shifts in those alignments affected the actions of Japan, South Korea and Vietnam (pick 2 countries out of 3)?<br /><br />So you'd better be flexible enough to reserve rooms for changes to what you've prepared. Time is limited, so budget your time carefully.<br /><br />See the attachment for possible exam questions asked in the final so that you have a sense of the level of difficulty you'll have to face in this course.<br /><br />I got 0.66 SD above mean in the midterm and that translated into an A- in the preliminary midterm grade. I thought I screwed up both the simulation game and the final exam, but maybe I didn't... <br /><br />💯 Final grade: A<br /><br />Much better than expected. The grading is really lenient.",
            "comment_workload": "Very heavy.<br /><br />Before each lecture we're expected to read about 20-40 pages of assigned readings flooded with unnecessarily confusing sentence structure and seldom-encountered vocabulary that drive us mad. This is daunting for a local guy, grown up under a stupid education system with the fucking stupid DSE, and had never read a single book for years (not even a single page). I skipped all the assigned readings, and I REGRETTED before the final exam.<br /><br />The simulation game is indeed the highlight of the course. We're expected to act as the role of a politician representing a country, or a journalist that keeps updating what's happened.<br /><br />Preparatory work:<br />🔶 x1 2-page individual role report in bullet points<br />🔶 x1 2-page group public strategy report<br />🔶 x1 2-page group private strategy report<br />🔶 x2 Meetings with the IA/TA<br />🔶 x1 Meeting with the country consul<br />The day before the game, as the progress of the Moon-Kim talk was unfolded in a surprising manner, everyone had to spend the whole night changing everything...<br /><br />During the game:<br />Meeting frenzy and tons of sidetracking issues. It took the whole game for the most important meeting to occur.<br /><br />After the game:<br />🔶 x1 6-page group final report<br />🔶 x1 1-page individual summary for each group member<br /><br />Joining a larger group does not mean lighter workload cuz you in turn get coordination issues with group members overlapping what others have written, when there is only that much content you can write.<br /><br />Just don't worry if you've made &quot;stupid&quot; mistakes in the game, e.g. initiating SECRET top-level meetings. You're rated in terms of your level of effort but not whether you've made the so-called &quot;correct&quot; judgments.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "OcCnpQjkkUAXCuY8KbLL2vikaqz5M4r6",
                    "name": "sosc2280.Final Exam Review.2018",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "h6TTsHakfX0Ig8px6ZcQaj3vKNFbhbf0",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 670,
                    "name": "ZWEIG, David Stephen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "anday",
            "date": "Jun 13, 2017",
            "title": "Worth taking",
            "comment_content": "Before midterm it was all about basic historic facts in E.Asia from the end of WWII. After the midterm, we went in depth to think more about the reasons behind the facts. We learnt to analyze from different perspectives.",
            "comment_teaching": "DZ is a good professor. Not only did he conveyed himself clearly in lectures, but also he showed much respect to every student in his class. For example, I guess he can tell 80% of the students' names. He is always patient to answer questions and encourages us to develop interest in what we learn through group work and a simulation game.",
            "comment_grading": "Attitude decides everything. Hard work will pay off.",
            "comment_workload": "Demanding. DZ has a high expectation of us so it makes me feel like I am taking a SOSC 4000 Level course. The amount of required reading is appropriate: around 30-40 pages every week. A simulation game is the most demanding part of the course, and be careful of FREERIDER cuz they can drive you mad when you have to work on numerous&nbsp;&nbsp;&nbsp;reports.......Final was like short essay writing. If you can recite as much required reading as you can, you will be fine. At least for me, I prepared and recited around 4000 words answer to prepare for the final.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xl5YKZXuKwiJjKGPIVqOtg24HJVWrsGV",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 670,
                    "name": "ZWEIG, David Stephen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "helloworld",
            "date": "Aug 13, 2016",
            "title": "",
            "comment_content": "The course is basically divided into 2 parts (arguably 2 and a half), separated by the midterm exam. A brief history of East Asia after WWII is outlined before the midterm, topics discussed include cold war (which will be a recurring theme in the course afterwards), korean war, vietnamese war, bandung conference, sino-india conflicts, sino-soviet split, sino-US relationships, reformation by gorbachev, etc. Midterm exam consists of MCQs only yet they are not easy, understandings on small details (eg. chronological orders of events in a certain war), readings (including comparisons between the arguments proposed by different scholars, meaning that thorough understanding and memory on readings are required, including the names of the author, FML), and something only mentioned in class but not on the slides are required. After the midterm exam, the focus of the course turns into explanation of historical events, different IR theories are introduced, explaining why a certain state would make certain decisions. The 0.5 part is the simulation game which the professor has put a lot of focus in, students are divided into groups, representing different countries and organisations and thrown in to a situation that a conflict may happen<br /><br />Final exam requires you to answer 4 out of 6 essay type questions in 2 hours, yet ~20 possible questions are given in advance so you can prepare a brief outline beforehand.",
            "comment_teaching": "The professor is enthusiastic and teaches with much passion, slides are used as outline only and details are either skipped or barely mentioned, he likes to ask questions and be asked during lectures, and would lightly mock you if you refuse to answer his questions. Logical flow is a bit lacking and the amount of information conveyed is quite large, but following shd not be too hard if do pay attention during lectures.",
            "comment_grading": "midterm 30%<br />final 40 %<br />simulation game 30%<br /><br />Grading shd not be too bad, I got an A in midterm and screwed up the game and yet still managed to get an A-",
            "comment_workload": "HEAVY or VERY HEAVY depending on your group size and quality of groupmates in the simulation game.<br /><br />Every lecture has ~40-50 pages of readings written in 'academically styled english' aka flooded with unnecessarily long sentences and rarely-encountered vocabs that will be specifically asked in exams (eg. 'What argument did XXX used to support his views towards YYY?') so you better try your best to finish them. For the game each student need to submit a personal role report discussing how he/she should act in the game (3 pages) and each group need to submit one public position and one secret strategy before the game and a 5-page report after the game discussing what they have done in the game. Considering that some group has larger size (each country has a fixed number of space for enrolling into) and more to do in the game, it is strongly advisable to join these groups for both better performances and lighter workload.<br /><br />That said, considering social science as an art of packaging common senses and bullshits into nice-looking scholarly theories, focusing on factual details during revision and bluff the theories could help you to get a decent grade.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vb4GdNj9chOFRCcgTK2hFiWIPwirhzzP",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 670,
                    "name": "ZWEIG, David Stephen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "1+1=2",
            "date": "Aug 24, 2017",
            "title": "",
            "comment_content": "In the first part, it pays more attention to relations between USA, Russia and China and examines reasons behind historical events.&nbsp;&nbsp;<br /><br />In the second part, it focuses on theories and strategies in political science.",
            "comment_teaching": "It depends. If you are interested in political science, you would say his teaching excellent, especially he has a sharp tongue. He basically follows the lecture notes and explain terms, theories and reasons of it.",
            "comment_grading": "Only mean, max. and min. marks(midterm) are announced. NO information on grades for simulation game, papers and final exam.",
            "comment_workload": "There are required readings at about10-20 pages for every lecture. Quit heavy though I don't think readings are helpful for exams. One of the readings is attached for your reference.<br /><br />There is a simulation game with two graded papers for the preparation of the game. Your group pretend the cabinet of a country and solve an international crisis. It is demanding as you need a lot of research and prepare strategies for the game.<br /><br />Final exam is all about essay. You need to answer why xxx happens or How yyy affects zzz's decisions towards somewhere. You need a deep understanding on the focus of the course and a lot of research.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "eErgjBMh0pHVzjd2aq6sgtJNUExAJggy",
                    "name": "L16-Thomson 98-110",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "WjRdJyWBMFZpAaiY7l3nr0wL5wysbG6J",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 670,
                    "name": "ZWEIG, David Stephen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "haida",
            "date": "May 05, 2017",
            "title": "very demanding",
            "comment_content": "The content is on the international relations of southeast asia. the course content is historical background and also update with current issues.",
            "comment_teaching": "He encourages active inclass participation. Also, he has a integrative mock-un kind of project at the end of the semseter. It is fun to do, but a bit demanding too. He has high expectations from us in both quality and quantity. The class in quite small but he still manages to ask all the students around the class to pick to answer questions. The lecture itself is on ppt and in class discussion.",
            "comment_grading": "Very harsh i think. He seems to have very high expectations for 2000 level course.",
            "comment_workload": "Very demanding, high workload. Since you have to actively engage in class partication, reading is required. Also, preparing for the mock-un is very hard to do as well.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}