{
    "error": false,
    "course": {
        "id": 1129,
        "subject": "SOSC",
        "code": "1110",
        "name": "Data Analysis for Quantitative Social Research",
        "description": "This course focuses on practical aspects and implementation of social data analysis by introducing basic techniques for presenting, analysis, and interpreting quantitative data, to Quantitative Social Analysis major students. This course is deliberately designed as complementary to formal and theory-based introductory  statistical courses and substantive and history-based social science courses. This course introduces basic knowledge about quantitative data analysis from a social scientific perspective, from data generating processes to causal inference. Devoted computing sessions, a signature feature of this course, demonstrate hands-on techniques, such as data extraction, data management, variable manipulation, and  descriptive analysis. Students will have the chance to implement ideas and methods from the lectures through in-class exercises, as well as a project, by applying what they learn from real-world data. Upon completion of this course, students should have acquired useful skills for social data analysis as well as better understanding of social science research. Enrolment is restricted to students admitted to BSc in Quantitative Social Analysis from 2022-23 and onwards.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            1610,
            1530,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.21,
        "rating_teaching": 4.47,
        "rating_grading": 4.58,
        "rating_workload": 4.58,
        "review_count": 19,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 650,
                "name": "BAARK, Erik",
                "count": 17
            },
            {
                "id": 1807,
                "name": "SHEN, Yifan",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "aRTB419kh7BmYKE2Uli28nHbR3brYEoS",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "underline",
            "date": "Jan 26, 2017",
            "title": "gr8 m8 i r8 8/8 dankest lecture ever",
            "comment_content": "It's really interesting if you would like to know more about how technologies evolve and why each of them evolve in a certain way. <br />Sometimes when you think about it it's fascinating. <br />Although if you are not a guy who's obsessed into history kind of stuff and remembering different facts and years you might find the content to be a bit boring some of the time but it should be fine.<br />The course is more about understanding concepts than recalling facts but either should be rather easy <br /><br />the professor play the dankest songs at the start of every lesson ayyyy lmao<br /><br />hey look at me i am trying to get that meter thingy into the satisfactory range its so close omg will the colour change it's getting closer and closer and it looks like it's g----oh shoot it changes into that eyegasm green color and it feels like im breathing in the freshest air in the universe and then all different kind of plants dance around me ty based ustspace for this amazing thermometer",
            "comment_teaching": "Like, the professor is really passionate and make jokes all the time. Will get taught again 11/10",
            "comment_grading": "this course is so easy that it's pretty competitive but if you are a normal person who spend a little bit of time on it you should get A range but since im too lazy to do anything whatever i just basically go to the exams like a sushi and do group discussions like a potato<br /><br />and i got <br />&nbsp;&nbsp;____&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br /> |&nbsp;&nbsp;&nbsp;__ )&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_&nbsp;&nbsp;&nbsp;<br /> |&nbsp;&nbsp;&nbsp;&nbsp;_&nbsp;&nbsp;\\&nbsp;&nbsp;&nbsp;&nbsp;_| |_ <br /> |&nbsp;&nbsp;&nbsp;|_) |&nbsp;&nbsp;&nbsp;|_&nbsp;&nbsp;&nbsp;_|<br /> |____/&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|_|&nbsp;&nbsp;<br />(i hope you can see this fascinating piece of dope ASCII art that says B+, web renders are tasteless nowadays)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br /><br />5/7 will get graded again",
            "comment_workload": "3-5 PRS every lectures so you cannot skip them and they count towards your final grade so don't skip them<br /><br />4 group discussions in total (need to read an article everytime)<br /><br />mid-term + final exam<br /><br />it's not harsh at all<br />pleb",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 7,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "qB7Wb3dbPAGoz6YFFq9bTKKm9slByoNF",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HELLO:)",
            "date": "May 29, 2017",
            "title": "",
            "comment_content": "Intro and overview<br />history of technology+industrial revolution<br />history of science+engineering and science<br />Technological Networks<br />Socio-technical Networks <br />Invention and innovation<br />Economics and technology policy<br />Defining the environment<br />Security+Politics<br />Gender<br />Culture<br />Ethics<br />Organization and assessment<br />Governance<br />Final Review",
            "comment_teaching": "Erik is very funny and the content of the lecture is quite interesting.<br /><br />There are 5 lecture sessions assigned for doing the group discussion reports. You have to finish the discussion report by the end of the class time.",
            "comment_grading": "Mid-term exam: 30% (MC)<br />Final exam: 35% (MC)<br />iPRS quizzes: 15% (~20-25 MC, select 15 best scores out of a pool of 17 questions to calculate grade)<br />Group exercises: 20% (5 group reports, related to case study material, 4 best one to calculate the grade)<br /><br />All the items touch the mean and got B, the competition is quite fierce",
            "comment_workload": "The workload is quite light actually as there is no take-home assignment. <br /><br />The reading for each class is assigned, entitled People in the Machine- An exploration of Technology and Society. It is available in Canvas website. After reading the book, you can have a clear understanding in the concept.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "J9GcpjRZ9eBeIWU2povoEP5ahFFn4eZ8",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yumi",
            "date": "Aug 17, 2016",
            "title": "good grade",
            "comment_content": "related to real life issue, content are clear and easy to understand. Each lesson include one new topic. If you understand all the basic contents, it is not hard to answer the questions and get high marks.",
            "comment_teaching": "The whole atmosphere is quite good and interacting, the professor is funny. He is a top professor in HKUST.",
            "comment_grading": "Two of my groupmates got A+",
            "comment_workload": "There are 5 in-class group discussion with a reading provided before the lesson, one midterm exam and final exam but all MCQs, so it does not require students to memorize all the terms. The attendance counts quite a lot, so remember to take PRS in lessons.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4Ss3gUGp9hufjXwTzSWYzJEAy7Pnx3cz",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1807,
                    "name": "SHEN, Yifan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mikey813",
            "date": "Jun 04, 2023",
            "title": "",
            "comment_content": "The main purpose is to analyze social data, and the front will use stata to perform simple analysis by inputting commands such as mean, standard deviation, etc. But only to teach some simple instructions, more complex data and instructions will need to learn in depth.<br />The course also teaches the normal distribution, half of the content is the same as the m1 course, and then add some in-depth content, in general, is relatively simple",
            "comment_teaching": "The professor is very boring and only speaks according to the PowerPoint, and sometimes he doesn't understand, so many students don't come to the class very much. Sometimes the class will record the attendance. But the teacher is very good and young, and will answer questions carefully, if you do not understand the class, you can ask him in Mandarin after class!",
            "comment_grading": "The assignments were relatively straightforward, but the total marks were relatively small and any missing point would have opened up a big gap.I did not sit the last exam for personal reasons and the professor was kind enough to help me make up for it.",
            "comment_workload": "The amount of homework is minimal, with only two assignments in the whole semester, but the time frame for completion is rather tight. It was basically done in chatgpt.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HxQSJbHTXGd9y0J9gwkh4uLxv1s9ss0b",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "smleeab",
            "date": "Feb 02, 2018",
            "title": "",
            "comment_content": "The course explores some of the interactions between science, technology and work. Topics include Technology, Power, and the Foundations of the Industrial Workplace, Technology and Power, Scientific Management, Machines and Deskilling.",
            "comment_teaching": "Nice professor, his powerpoint are precise and to the point. He is willing to answer any of the questions you have and shows his passion. He is sometimes funny and uses Cantonese time to time to tell those jokes.",
            "comment_grading": "If you do well in midterm and final, then not a problem to get an A. However, the in class essays are based on the group's performance so you want to be in a good group with students who are willing to put in the effort and as hardworking as you are.",
            "comment_workload": "Minimal workload. One of the highest workload course I've taken.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zDWw5WAFaGzmnpqXTQm5d3fAusr4YXWj",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Fernando",
            "date": "Feb 07, 2017",
            "title": "Great course",
            "comment_content": "The whole course is divided among four major sections, and each lecture covers one certain topic. <br />It generally speaks about the relationship between society and technology and how each of those is capable of shaping and be shaped by the other. <br />Covers topics like Industrial Revolution, Innovation models, Technological Networks, Security and Politics, Governance...<br />I personally really enjoyed the topics and thought they were quite interesting.",
            "comment_teaching": "Mr. Baark is ex-ce-llent. Totally love his teaching style. He explains everything in quite a lot of detail, is very funny during the lectures and is also happy to help you with any questions you might have. You can also send him an email if you have any doubt and he often replies quite fast. <br />TAs were also great, very friendly, and willing to help you out.",
            "comment_grading": "Mid-term and final exam, plus PRS and also some group discussions (4/5) that you prepare and submit in one single lecture. Just go over lecture notes and slides and you will be fine. Exams are MC questions and are not difficult, so be careful with silly mistakes because mean is somewhat high. <br />Class Discussion total (out of 20)<br />Mean=17.82<br />Median=18<br />SD=1.45<br /><br />PRS (out of 15)<br />Mean=12.14<br />Median=12.6<br />SD=1.99<br /><br />Final exam (out of 35)<br />Mean=26.79<br />Median=27.75<br />SD=4.12",
            "comment_workload": "I don't think the workload was very heavy. For people in SHSS it's a piece of cake. For people in other schools, you might be a little less used to a larger amount of reading materials, but the amount to read in SOSC 1110 is still quite small. The lectures slides are also posted before the lecture itself so you can actually go over it beforehand. As long as you go over these two things consistently, you are pretty much set for an A+. Consider the lectures as revision sessions.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZHv0esq4qbWRyC2rUZbnZNVmtSd2OjqX",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mandyho",
            "date": "Feb 06, 2017",
            "title": "2016-2017 fall",
            "comment_content": "The title of the course describes the content of the course pretty precisely. There are some terms and concepts introduced but most of the content is just common sense. However, the professor presented quite well so it is still an interesting lecture.",
            "comment_teaching": "The professor presented his point very clearly and the points in the powerpoint are very organized.",
            "comment_grading": "Good. Consists of iPRS, group discussion, midterm and final. All MCs for midterm and final. scored 80 sth nearly 90 can got a A.",
            "comment_workload": "Almost zero workload. Just do some reading before the group discussion and no homework.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RajGVLIyvItLJDAplDBKhF3OukDwcYvX",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JamesW",
            "date": "Feb 01, 2017",
            "title": "",
            "comment_content": "Textbook, Chapter 1<br />History of Technology + Industrial Revolution<br />Textbook, Chapter 2<br />History of Science + Engineering and Science&nbsp;&nbsp;&nbsp;Textbook, Chapter 3<br />Group Discussion&nbsp;&nbsp;“Men and Machines”<br />Textbook, Chapter 4<br />Socio-technical Networks<br />Textbook, Chapter 5<br />Group Discussion “The 40-Foot Container” <br />Textbook, Chapter 6<br />Economics and Technology Policy&nbsp;&nbsp;&nbsp;<br />Textbook, Chapter 7 <br />Defining the Environment<br />Textbook, Chapter 8<br />Group Discussion&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case: “Silent Spring”<br />Security + Politics<br />Textbook, Chapter 9 and 10 <br />Gender&nbsp;&nbsp;&nbsp;&nbsp;<br />Textbook, Chapter 11<br />Group Discussion&nbsp;&nbsp;Case: “Grameen Bank”<br />Textbook, Chapter 12<br />Culture<br />Textbook, Chapter 13<br />Ethics<br />Textbook, Chapter 14&nbsp;&nbsp;Group Discussion <br />Case: “GM Rice”<br />Textbook, Chapter 15<br />Governance<br />Final Review<br /><br />This course should provide you with fundamental knowledge about the interaction of science and technology in our life which will help you become more mindful of the mutual influence of science and technology on society.",
            "comment_teaching": "The professor assessed our understandings by asking us to apply the factual and conceptual knowledge we had learnt to case study analysis. This was done through case studies included in mid-term and final exams and through the assessment of case study reports from group discussion in class.<br /><br />During lectures, he would illustrate the mutual influence of technology and society with case studies and/or videos, and discuss those with students in class.<br /><br />a) Lecture notes/material<br />b) Assigned readings<br />c) Video clips shown in class",
            "comment_grading": "Mid-term exam : 30%<br />Final exam : 35%<br />Group discussion reports : 20%<br />PRS : 15%<br /><br />If you answer a PRS quiz correctly, you will receive: 10 points<br />If you answer a PRS quiz incorrectly, you will receive:<br />4 points<br />If you do not answer the PRS quiz at all, you will receive: 0 points",
            "comment_workload": "The readings for each class were assigned from a textbook written by Prof. Robert Ferguson, entitled People in the Machine – An exploration of Technology and Society. <br /><br />Attendance in class was essential.<br />PRS quizzes were conducted randomly and spontaneously. Questions in PRS exercises and exams might somehow be directly related to videos or various issues discussed during the lectures.<br /><br />During the five classes assigned, there would be ample opportunity to discuss various examples of technologies in society in a group (Group Project). A group report would have to be handed in before the end of the lesson to present the viewpoints of our group.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eqWlnLVdUeY8rePB0IoKrrrnx2ucJkyZ",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sx",
            "date": "Jan 20, 2017",
            "title": "",
            "comment_content": "Course Schedule and Assigned Readings<br />Part 1 – Defining Science and Technology: This part provides an introduction to the history of technological and scientific development, and discusses how our contemporary concepts of science and technology have been formed. <br />September 1, 6:&nbsp;&nbsp;Introduction and Overview&nbsp;&nbsp;&nbsp;Reading: Textbook, Chapter 1<br />September 8, 13:&nbsp;&nbsp;History of Technology + Industrial Revolution<br />&nbsp;&nbsp;&nbsp;Reading: Textbook, Chapter 2<br />September 15, 20:&nbsp;&nbsp;History of Science + Engineering and Science&nbsp;&nbsp;&nbsp;Reading: Textbook, Chapter 3<br />September 22:&nbsp;&nbsp;Group Discussion and Report&nbsp;&nbsp;&nbsp;&nbsp;Case: “Men and Machines”<br />Part 2 – Conceptualizing and Creating Science and Technology: This part develops key concepts for analyzing modern technology, and discusses various theories of technological innovation. September 27:&nbsp;&nbsp;Technological Networks&nbsp;&nbsp;&nbsp;&nbsp;Reading: Textbook, Chapter 4<br />September 29:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Socio-technical Networks<br />Reading: Textbook, Chapter 5<br /><br />October 4:&nbsp;&nbsp;Group Discussion and Report&nbsp;&nbsp;&nbsp;&nbsp;Case: “The 40-Foot Container” <br /><br />October 6:&nbsp;&nbsp;&nbsp;Review<br />October 11:&nbsp;&nbsp;&nbsp;Mid-term Exam&nbsp;&nbsp;&nbsp;October 13:&nbsp;&nbsp;&nbsp;Invention and Innovation<br />&nbsp;&nbsp;&nbsp;Reading: Textbook, Chapter 6Part 3 – Putting People in the Machine: This part shows how to analyse politics in technology, relationships of gender to technology, and cultural aspects of technological development. October 18:&nbsp;&nbsp;&nbsp;Economics and Technology Policy&nbsp;&nbsp;&nbsp;Reading: Textbook, Chapter 7October 20:&nbsp;&nbsp;&nbsp;Defining the Environment<br />&nbsp;&nbsp;&nbsp;&nbsp;Reading: Textbook, Chapter 8<br />October 25:&nbsp;&nbsp;Group Discussion and Report&nbsp;&nbsp;&nbsp;&nbsp;Case: “Silent Spring”<br />October 27:&nbsp;&nbsp;Security + Politics<br />&nbsp;&nbsp;&nbsp;Reading: Textbook, Chapter 9 and 10 November 1:&nbsp;&nbsp;&nbsp;Gender&nbsp;&nbsp;&nbsp;&nbsp;Reading: Textbook, Chapter 11<br />November 3:&nbsp;&nbsp;Group Discussion and Report&nbsp;&nbsp;&nbsp;&nbsp;Case: “Grameen Bank”<br />November 8:&nbsp;&nbsp;Culture&nbsp;&nbsp;&nbsp;&nbsp;Reading: Textbook, Chapter 12<br />November 10&nbsp;&nbsp;Ethics&nbsp;&nbsp;&nbsp;Reading: Textbook, Chapter 13<br />Part 4 – Decision Making and the Future: The final part develops theoretical perspectives on issues related to governance of scientific and technological development, including the management of risk and technology assessment. November 15:&nbsp;&nbsp;Organization and Assessment&nbsp;&nbsp;&nbsp;Reading: Textbook, Chapter 14 November 17:&nbsp;&nbsp;Group Discussion and Report<br />&nbsp;&nbsp;&nbsp;Case: “GM Rice”<br />November 22:&nbsp;&nbsp;Governance<br />&nbsp;&nbsp;&nbsp;Reading: Textbook, Chapter 15<br />November 24:&nbsp;&nbsp;&nbsp;Final Review",
            "comment_teaching": "Although he was quite funny, i still felt very sleepy in this lesson",
            "comment_grading": "mid-term: 30%<br />final: 35%<br />iprs: 15%<br />group discussion: 20%( you need to do five but only count the highest four)<br />my total: 85.04% =&gt; B+",
            "comment_workload": "five group discussion",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "J3XCg2cUvhnvUDw7tm1pUurH5TM6kn0Y",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hardwork",
            "date": "Jan 19, 2017",
            "title": "Good grade, quite boring materials, memorization game (come to get A range like me easily if you have sources)",
            "comment_content": "content is a bit boring to me, ppt+readings<br /><br /><br />REMEMBER TO READ THE READINGS BEFORE FOR MIDTERM AND FINALS IF YOU WANT TO GET A+/A",
            "comment_teaching": "Professor is nice and would occasionally crack out jokes, you can see the passion of the professor. <br /><br />Will play songs and video before and throughout the lesson, to make the boring materials less boring.<br /><br />funny professor, who is always proud of his home country",
            "comment_grading": "Group Discussion 1: 4.5/5<br />Group Discussion 2: 3.5/5<br />Group Discussion 3: 4/5<br />Group Discussion 4: 4.5/5<br />Group Discussion 5: 5/5<br /><br />Group Discussion Total: 18/20<br />Mean = 17.82<br />Median = 18<br />SD =1.45<br /><br />IPRS: 14.4/15<br />Mean = 12.14<br />Median = 12.6<br />SD = 1.99<br /><br />Midterm: 28/30 （higher 1.1SD)<br />Mean: 24.29<br />SD: 3.4<br /><br />Final: 29/35 (higher 0.54 SD)<br />Mean = 26.79<br />Median = 27.75<br />SD = 4.12<br /><br />Final Grading: A&nbsp;&nbsp;<br /><br />Comeptition IS FIERCE, and you need to keep all your marks in different category above average to get a good grade",
            "comment_workload": "5 In Class Group Discussions (maybe a bit too demanding for those that is not good at english), so find your groupmates wisely!!!<br />1 midterm<br />1 final<br />iPRS (i have source so not really a big deal for me, but it is quite difficut in times)<br /><br />best strategy for exams: memorize and highlight all ppts and readings 2/3 days before and you can use the least time to get the most results<br /><br />personally i revised just the day before for both exams but i really paid attention in class, read all readings for midterm, missed 1/2 readings for the final exam and get this grade, quite satisfactory i would say, should get an a+ if i do better in my finals",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NcV36nAjd3D5BVm13ikO5T5SzDqsfcqX",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "scarletblade",
            "date": "Dec 30, 2016",
            "title": "Easy Course, Quite Good Grade",
            "comment_content": "This course is basically talking about how society affects technology and how technology in turn affects society.<br /><br />The concepts are really easy to understand and it is quite an interesting course, apart from the history of technology at the beginning.<br /><br />He teaches from ppt slides although there is a free online textbook that the ppt is based on, and you may want to read it, as some questions might pop up on the exam that are not mentioned in the ppt but in the book.",
            "comment_teaching": "Professor Erik is a wonderful professor<br /><br />He makes jokes all the time, and makes his lecture very attractive<br />He plays his favorite songs everytime before class<br />He always mentions how he is so proud of Denmark, his home country lol<br />His ppt slides are also very easy to follow<br /><br />There is quite a lot of interaction between him and the students (compared to other courses I have taken)<br />He is going to retire soon in 1-2 years so hurry up if you want to take his course",
            "comment_grading": "Mid-Term Exam 30% <br />Final Exam 35% <br />iPRS Quizzes 15% <br />Group Report 20% <br /><br />I got Midterm above 0.9 SD from mean, final above 1 SD<br />Mean for iPRS, 0.8 SD above mean for group discussion<br /><br />Got A in the end",
            "comment_workload": "Very light workload<br /><br />Mid-term and Final all multiple choice questions, 30 questions for 1 hour and 70 questions for 2 hours respectively. You should have a lot of time left in each exam so chill. <br /><br />Final exam is cumalative, but you can cram everything in 1-2 days.<br /><br />IPRS Quizzes are randomly held during lectures, sometimes none but sometimes could even have up to 4 or 5 per lecture.<br /><br />The professor will choose a pool of 17 iPRS quizzes from the semester and select 15 of your best scores as your grade.<br /><br />Group report is done in class; the professor will send you an article few days before the group report workday so you can read before hand.<br /><br />Overall not much work at all: you do not need to study notes frequently during the semester; have your ebook textbook open during lectures to deal with the spontaneaous iPRS quizzes; find serious groupmates for group report; and you will be fine.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "u0v1Y1JuqhSuzY0WYhfYafeEttdLrpFr",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bugerm",
            "date": "Dec 26, 2016",
            "title": "",
            "comment_content": "The course mainly focuses on the relationship between science&amp;technology and society(people): how science and technology are embedded within the society and vice versa. The topics cover definition and history of science and technology, how they are interrelated, concepts such as technological networks and path dependence, and how technology influences and is influenced by gender, environment, ethics and security.",
            "comment_teaching": "The instructor is from Denmark and speaks good English. He is very friendly, approachable and often tries to make a comfortable atmosphere by joking and sometimes seeking thoughts from students. He is a democratic person; he is very willing to accept and reflect students' opinions.",
            "comment_grading": "Midterm:30%<br />Final:35%<br />Group discussion:20%<br />PRS:15%<br />The final grade hasn't been released yet, so I can not judge how the grading is. The grading is supposed to be good from what I have heard, but as the exams are not very difficult the mean is relatively high.",
            "comment_workload": "Workload is not so heavy. For the course, you have to read an on-line textbook, which is about 150 pages long, and there are about 16 lecture notes which mostly summarize important points in the textbook. Apart from the midterm and final exams, the instructor gives PRS questions almost everyday, which come from the textbook and lecture notes. Each student also has to participate in group discussions and the group should submit 5 group discussion reports during the course after reading group discussion materials.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SOy7sFWMAnjYsqjBun22MtLHgMToJPa8",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bakbak",
            "date": "Aug 20, 2016",
            "title": "",
            "comment_content": "內容cover唔算多,主要係由industrial revolution開始講科學發展,跟住講到之後既先開始多D社會同science既關係同影響<br />基本上睇一次lecture ppt會明既,睇埋ebook就明哂.",
            "comment_teaching": "如果有心聽prof講書既話佢都算唔錯,幾funny又唔悶 (雖然有時同content唔係幾關事)<br />佢最好既地方就係review做得好,上左堂review都捉到佢出題重點,同埋有D case study既quiz可以當溫書<br />但上堂會俾佢問問題 次次都好緊張,因為佢會行上最後個排問, 小小chur啦 不過答唔到又無事既",
            "comment_grading": "grade就麻麻啦 midterm final above mean都係得B,可能係PRS同group discussion無左D分<br />PRS答錯左得一半分,所以一定要岩",
            "comment_workload": "無咩workload<br />midterm final全mc<br />prs自己search書同ppt或者睇下附近(搵D可靠既人啦...)就知答案<br />group discussion係case study,有5次,4人一組.<br />都輕鬆既,用成堂答2-3題short questions,好似LS咁,限定一頁答哂,好精簡到point就得,如果有groupmate carry就更爽,因為其實1,2個人都輕鬆ko到.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "14g7PBMzdLwGjBOn4YXvM1cXZUKnKM1D",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "andhreyes",
            "date": "Aug 06, 2016",
            "title": "",
            "comment_content": "The content of this course is very easy to digest. It can be somewhat boring at the beginning but it gets more interesting afterwards. <br /><br />It starts off talking about history of science and technology and how technology has been developed throughout time, then it introduces to some technical terms and the process of adapting a technology to a new environment or society.",
            "comment_teaching": "Prof. Baark is very nice. He always plays songs at before starting and jokes throughout the lecture. I think he was pretty clear when explaining the concepts and tries to keep you engaged by asking some questions.",
            "comment_grading": "The grading for this course is pretty good because the content is easy, but that also makes it very competitive. <br /><br />iPRS quizzes (15%)<br />Midterm Exam (30%)<br />Final Exam (35%)<br />Groups Exercises (20%)",
            "comment_workload": "The workload is very light. There will be iPRS quizzes almost every lecture, but they are usually pretty easy. Also, there are 5 group discussions. You will have to make groups at the beginning of the semester and write 1-page essays related to some assigned reading material. <br />Studying for midterm and final doesn't require too much effort either.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "p1HHAkZ6IYEwZRyehmINMPYoeewWGHM4",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "maize",
            "date": "Jun 30, 2016",
            "title": "A nice blend of different discipline",
            "comment_content": "A little knowledge from many diferent fields, can get an introduction of different issues and the linkage between them.<br /><br />Some of the concepts are really interesting, like innovation models, technological networks etc.",
            "comment_teaching": "The professor is quite funny and I can see that he put a lot of effort in preparing the lessons and tried to make the lectures not as boring.<br /><br />There are music / funny videos before each lecture, and some of them are very nice :D<br /><br />There is no attendance requirement, but the in-class PRS is kind of an indicator.",
            "comment_grading": "Not sure what is the cut of line for different grade, but I got an A with midterm at mean, final above 1 SD, group discussion get 15/20 and full mark for PRS.",
            "comment_workload": "Just in-class PRS and group discussion. No homework at all.<br /><br />However, the PRS and discussions can be tricky. Revision is recommended before lessons",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NjoAkhAAiCBuFHxnVCpTnfIQ5w5J0buQ",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Stetanjung",
            "date": "Jun 28, 2016",
            "title": "Pretty easy course; good grade",
            "comment_content": "Here is the objectives in the syllabus:<br />&quot;The course aims to provide students with theoretical and conceptual tools to understand the way scientific and technological decisions are made, and the effects that these decisions in turn have on social development. It will encourage students to analyse technology from different perspectives, to ask informed questions about the driving forces of science and technology, and to form their own opinions about the role of science and technology in our contemporary society.&quot;<br /><br />In this course, I mostly learned about history in the first half semester, and some easy theoritical stuffs in the second half semester. <br /><br />Pretty interesting, and what you will learn is usually in line with common sense.",
            "comment_teaching": "He is quite good, and very nice. He always plays his favorite songs in the beginning of the lessons. He was always trying to make the class interesting, although sadly, he sometimes failed to do it. Overall, he was a very kind person.",
            "comment_grading": "Good grade, although quite competitive. Since both midterm and final are pretty easy, you need to score really high in order to get an A range. Group exercises and iPRS are graded as well, although I am not so sure on how the exact grading for them. As long as you ace both midterm and final, you will be just fine.<br /><br />1. Mid-Term Exam 30%<br />2. Final Exam 35%<br />3. Personal Response System (iPRS) Quizzes 15%<br />4. Group Exercises (5 in-class essays) 20%",
            "comment_workload": "I would say the workload is very light. You sometimes just have to read short materials before in-class exercises in order to make you work faster with your groupmate. You gotta choose your own one, so it will be better if you join this course with 3 of your friends (one group consists of 4 people). Other than that, you do not need to prepare anything or work on any project. Overall, compared to other courses I took in this semester, this course has the lightest workload.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HurfWrzU61l9ADanqdg2Rx25VAtrdAsh",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wwpy",
            "date": "Feb 05, 2016",
            "title": "Quite interesting course and good grade =)",
            "comment_content": "Mainly talks about the history of technological development from the Stone Age all the way up to the Industrial Revolution and now. Covers concepts such as technological momentum, social lag and the socio-technological system, which are very straight-forward and assessed many many MANY times in the final. In other words, as long as you understand a concept, you can get many questions correct in a row as they are basically asking about the same thing. The midterm and final both consist of multiple choice questions only, usually providing a scenario and asking you the name of the relevant concept. The most tricky part is that you have to recite the complete history of technology covered in the course down to the very last detail, as even the name of a prehistorical species mentioned in the first ppt slide of the first lecture may be assessed in the final. You also have to read the whole textbook provided on the course website, as some questions will be asked.",
            "comment_teaching": "Prof. Baark is a nice person, he sometimes jokes about himself during lessons and he even gave us cookies made by his wife. However, his talking speed is very slow and monotone so students may have to try harder to focus for a long period of time.",
            "comment_grading": "This course is quite competitive as the mean is usual very high. It is not difficult to get high marks but you must recite all the details from the powerpoints and remember the content in the textbook as much as possible. I scored 90% and got A+.",
            "comment_workload": "There are no after class assignments, but every few weeks there will be a group case study during class where each group needs to type up a one-page word document answering 2-3 long questions before the end of the lesson.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UaRjKRAtcwsd8eyc3xEN1ynOmewAAUqE",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ali",
            "date": "Sep 09, 2015",
            "title": "easy lecture, simple mc exam and funny professor",
            "comment_content": "Lectures are all about the 3 elements as stated in the course title: Society, Science and technology. It includes some history at the beginning and quite boring at all. After a few lectures, you may learn some terms about the topic and it's especially important for the exam and the group work essay. The content is very simple in overall.",
            "comment_teaching": "He speaks english very slow but he's nice. He is a responsible professor and try to be funny in class.",
            "comment_grading": "A+ very good grades for me and my group mates also have As. But it's quite tricky to think it is so easy to obtain good grades. The whole grading system is divided into a few parts: PRS quizzes(15%), Group work(20%), Mid term exam(30%) and final exam(35%). My total score: 93.5 but i have friends who have 8x just got C+. This means all of us got quite good score and the standard deviation is quite small. you may have poor grade if you lose some marks in a domain.<br />PRS: almost all get all correct(seems to pick 10/15 PRS for calculation)<br />Group essay: 5 marks for each essay, almost all people get5 and some 4.<br />Midterm and Final: the highest is always full mark-_- and losing a few marks is acceptable.",
            "comment_workload": "low workload. PRS quizzes allow us to chat with classmates and search the lecture ppt to get the correct answers. Group essay, having 2-3 questions, is done in class. The max. is one A4 page for a group. Midterm and final are so easy and all mc! but please do it carefully! just need to revise before exam.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QHcg5jVj4oUQNTKk7gNaNyf83j8rjioK",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 650,
                    "name": "BAARK, Erik",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "llc",
            "date": "Aug 31, 2015",
            "title": "",
            "comment_content": "The course mainly taught about how society affects technological development. A bit like history lesson so as level 1 course.<br /><br />There is a free online textbook and the content will be tested.",
            "comment_teaching": "The professor will teach with powerpoint and that's all the content will be tested. The videos will mainly be used in PRS but won't appeared in exam, so no need to spend a lot of time to watch them.",
            "comment_grading": "No projects and homework and all MC exams. The answer was straightforward, but sometimes the PRS is a bit tricky.<br /><br />The highest mark was 97 and even I got 92, I got A+. Thus, really good grade.",
            "comment_workload": "The workload is low but with super good grade.<br />There are only PRS and short essays in class, and if there is questions that lots of students answered incorrectly in PRS, the professor even would try to accept the answer that he is not expected.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}