{
    "error": false,
    "course": {
        "id": 2352,
        "subject": "SOSC",
        "code": "1200",
        "name": "Quantitative Social Analysis",
        "description": "This survey course introduces students to quantitative social analysis by showing how such techniques are used to examine important social science topics as health, business, education, inequality, family and kinship, careers, crime, migration, and economic, social and political change. For these and other topics, the class presents examples of classic as well recent studies that make exemplary use of data and methods, and which have advanced our understanding of the relevant phenomena. The class will also introduce the major sources of data for quantitative social analysis, with an emphasis on ones that are publicly available. Along the way, students will learn about the differences between the concerns, paradigms, and methodologies of the major social science disciplines. Strengths and limitations of quantitative techniques for the study of social phenomenon will be discussed, as will the relationship of quantitative approaches to other methodologies.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2110,
            2010,
            1910,
            1810,
            1710
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.2,
        "rating_teaching": 4.07,
        "rating_grading": 4.47,
        "rating_workload": 3.67,
        "review_count": 15,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 661,
                "name": "CAMPBELL, Cameron Dougall",
                "count": 7
            },
            {
                "id": 1375,
                "name": "TANG, Wenfang",
                "count": 6
            }
        ]
    },
    "reviews": [
        {
            "hash": "Uvt5RpK7bU7SnwFFf3OYzW7dTmWWRO98",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Joshc333",
            "date": "Feb 18, 2022",
            "title": "一個幾好嘅course",
            "comment_content": "佢個course 大改左 <br />同以前請啲professor 分享好唔同<br />變咗一個professor 係度教書<br />好brief overview咁教點做social science 嘅research 係一個比qsa同學知research 大概係啲咩嘅一科<br />會講到一啲politics/econ/psycho嘅research <br />就有好多專有名詞 英文有啲難 <br />冇咩上堂都可以做到佢啲assignment",
            "comment_teaching": "個professor 係第一年嚟UST<br />佢係有heart想教我哋野 同有料<br />佢有種美國大學feel <br />每兩堂就有一堂叫你上之前睇篇research <br />之後上堂就會討論 好interactive <br />如果認真上 問下又答下佢問題一定學到好多野 不過我冇咩:)<br />佢仲好有heart 每份assignment 都有好長好針對性嘅comment 係學到野嘅<br />我係final assignment 嗰時email 左佢問問題(~100words) 佢三個鐘內覆左千幾字 <br />雖然講書係悶左啲 不過咁有心教書 <br />已經算好好 功課有問題真係可以問下",
            "comment_grading": "超級靚grade ！！！！<br />Assignment 1: 92/100<br />Assignment 2: 94/100<br />Assignment 3 冇公布個分<br />Grade :A-<br />以我所知 好多人攞A-&nbsp;&nbsp;個A range 應該好寬<br />個mean 大約八十幾 所以算好靚grade",
            "comment_workload": "Assignment 1:~1000words(2h)<br />Assignment 2:~1000words(2h) <br />Assignment 3:~4000words(10h)<br />Workload 有少少多 不過其實幾好玩<br />有好大自由度 你可以自己諗個有興趣嘅topic (越有興趣做嗰時就越好玩 我個topic 係relationship of sleeping and academic results 我搵reference 嗰時對嗰topic 多左好多了解 幾好玩) 之後三份assignment 係幫你寫個research design 出嚟嘅essay 有個professor 咁幫你 學到好多野 又幾好玩 overall 做功課可能做左大約15個鐘 個professor 又咁幫你 冇唔洗final 還好啦",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6hfQaiIWdhbUBMw2AAxBeNNt6rNAElpB",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1375,
                    "name": "TANG, Wenfang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JundeHK",
            "date": "Jan 22, 2020",
            "title": "",
            "comment_content": "Designed specifically for QSA freshmen. The intentional outcome is to furnish students with a general picture of how social research is conducted, what are its components and how to construct them. The first month's worth of classes is devoted to explaining terms and fundamental knowledge, whereas in the second half of the semester, guest speakers, all professors from the division of social science, take turns to deliver lessons regarding their fields of research and also to advertise their current project.",
            "comment_teaching": "Interesting enough. Prof.Tang has the power of explaining complex things in a way that one could easily understand and grasp the crucial idea. Also, any questions raised by the students, even the most trivial ones, will always receive a most detailed and patient answer.<br /><br />One heads-up: Don't whisper or murmur or talk in any way during the class(except to ask questions of course), he hates that.",
            "comment_grading": "In-class exercise for taking attendance, pop-up quiz, no midterm, several essays, final exam canceled due to the protest.<br />Hard to get a good grade, don't miss any attendance, although if you do have a good reason for absent, you can always send emails to explain your situation to procure leaves.<br />One complaint is that the assignments, mostly essays, are not graded by the professor but by the TA. This said practice makes the grades a bit unprofessional and inaccurate.<br />The syllabus is enclosed for further references to the grading scheme.",
            "comment_workload": "Depends. At first, an essay of 500 words could be quite a time-consumer. Yet as time proceeds, I dare say that you'll find your faculty of both the intake and the output sharpens rapidly. So don't be so alarmed if you find facing an essay assignment consisted of more than ten pages. By that time, it would be merely a &quot;bedtime writing&quot; for you. :)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "dAj5csptqiE13KGFuEnibMGLoEYQKryF",
                    "name": "Syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "1tYMnurX0PwNuwDtHf6ynyg1FpPsTKk9",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "tjr1234",
            "date": "Dec 29, 2021",
            "title": "Instructor: HENDRY, David James",
            "comment_content": "睇attachment Syllabus改過嚟?<br />將sosci嘅嘢大概咁介紹下<br />教你點整research topic<br />整體都ok 唔係好難<br />好似由中間開始 會叫你翻去睇文<br />會有好多堂係大家討論篇文<br /><br />btw唔知係咪我問題<br />我覺得佢小小著重係psychology度<br />即係佢有時會係ppt最後擺條link 一齊睇片<br />通常都係啲psychology實驗 eg從衆行爲",
            "comment_teaching": "第一年喺ust教<br />改功課好慢 講嘢好悶 monotone<br />雖然認真聽係有料到 但係佢把聲搞到我勁想瞓覺<br />feel到佢有熱誠 但係講書真係唔太掂<br />有啲堂要討論 佢搞到好deadair囉<br />本身已經得一半人嚟上堂 又眼瞓 唔想討論<br />最後都係睇佢自己表演",
            "comment_grading": "又睇attachment<br /><br />15% Development of a Research Question<br />500字 簡單啦 求其揾個topic寫啦<br />20% Annotated Bibliography<br />揾相關research睇 寫大概内容+review+對你個topic有咩用<br />35% Research Design Paper<br />吹一篇文出嚟 design=有幾大吹幾大<br />10% Critical Questions for Research Spotlights<br />交5條問題上去 比全世界討論<br />10% Attendance<br />最多走兩堂<br />10% Class Participation<br />冇講點計<br /><br />Development of a Research Question:<br />mine: 78<br />low: 50 (我記得啱啱出分個陣我係low wtf 唔get點解改過嚟 又睇attachment啦)<br />mean: 89.4<br />high: 99<br /><br />Annotated Bibliography<br />mine: 95<br />low: 30<br />mean: 88.5<br />high: 98<br /><br />我滿Attendance<br />Research Design Paper冇出分<br />overall A- 幾開心 拎low都未死得",
            "comment_workload": "如果話lang1002係第一重workload<br />咁呢個course會係第二<br /><br />首先打字快真係有優勢<br />似IES複雜版 無限吹水<br />加上係咁用英文包裝下件事 會高分好多<br />之後reading又長又悶又難<br />個個禮拜睇幾千字 冇隻字明<br />Ps eng lv4 + lang B+<br />我知佢唔係逼你睇 但係唔睇你根本唔知上堂討論講乜(雖然冇咩人出聲)<br />而你最後份功課 佢guideline都係叫你參考翻個堆reading(然而我冇)<br />最後份4000字功課我搞咗成個禮拜 日日唔瞓覺係度google translate啲research<br />考完math+comp final 抖得半日就開始做<br />本身ddl係正final前一兩日 少癲<br />cite幾十篇文 即係最少睇過幾十萬字<br />dse操卷都冇睇咁多字 可能我自chur啦下<br />唯一好處就係 由於佢改功課好慢 會改遲ddl<br />唉唔識講 總之sem頭chill sem尾chur",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "XMqoaO3KssLD0CINFmaGdkf4BKWDZCzq",
                    "name": "SOSC1200Syllabus-Fall2021-V6",
                    "format": "pdf"
                },
                {
                    "key": "XtH2WPi5VCqMZufX8PxsDEduENqO7V9z",
                    "name": "Assignment01GradeDistribution",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "sbv9ocG3FJNcdvkY571XMjEMU0gjieIm",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1375,
                    "name": "TANG, Wenfang",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "CCcccccceeeee",
            "date": "Mar 20, 2020",
            "title": "course for qsa students",
            "comment_content": "different professors will come as a guest speaker in each lesson.<br />they will present what finding they did or they are doing.<br /><br />Also Prof.will teach some basic sampling theorem.",
            "comment_teaching": "Do not expect you can learn everything.<br />Do you expect you can learn one social issue within 1.5 hours???",
            "comment_grading": "grading scheme has totally changed. Professor Tang will probably change the grading scheme if he like. (eg. we need to write 3 reflections but the last reflections paper was replaced by research paper.)<br /><br />20% In-class exercises and homework assignments<br />30% Written reflections<br />15% Proposed questions for the final exam<br />20% Multiple-choice final exam<br />5% Suggestions for class discussion<br />10% Class attendance and participation<br /><br />Due to social movement, we didn't have exam.<br /><br />&gt;90% A range<br />&gt;80% B range <br />&gt;70% C range <br /><br />good luck!!",
            "comment_workload": "you need to prepare some discussion questions too.<br /><br />reflections with at least 500 words&nbsp;&nbsp;(2-3)<br /><br />Those are extremely annoying and hateful !!!!!",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 12,
            "vote_count": 24,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "L0uyBOOko52Sd9orHfx4hegDq1SDJnzu",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1375,
                    "name": "TANG, Wenfang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "garbage",
            "date": "Oct 03, 2019",
            "title": "OMG this is strenuous. Hard work pays off!",
            "comment_content": "The main part is the principles and the basic concepts of quantitative social analysis. There are guest speakers&nbsp;&nbsp;who introduce their fields of study. Overall, pretty practical and interesting, I guess?",
            "comment_teaching": "So far, I think the overall teaching is good. The main instructor explain the concepts clearly and most of the guests from the social science department have interesting topics.",
            "comment_grading": "The instructor has been changed and from the reviews in the past two years this is supposed to be a good grade class. If you got 80%+ and then you get an A-. However, due to the new grading system, which is shown in the course syllabus, you should get higher than 90% only to get an A-!<br />This year the final exam is changed into a project, which is a complete research project on one's own, taking up 30% of the final score. The mean for the project is 20.3.<br />The mean for the final grade is 83.2, which is a B due to the syllabus. Pretty good grade!<br />Personally I got 30/30 in the final research project and 98.5 for the final score, and it turned out A+! A dummy like me can obtain an A+! If you put your heart in it, which means submit EVERY HOMEWORK on time and choose interesting topics in the reflections and the final project, you would be fine and get a really good grade! It really depends on how hard-working you are instead of IQ.",
            "comment_workload": "Despite the fact that you have to compose a whole research report, which is about above 1500 words, you ought to finish 3 reflections. You should also read the materials given since there will be quizzes on them, which is about 150 pages in total. There are also frequently in-class quizzes which sometimes turn out to be tricky. But you would get the points if you answer, no matter correct or not. And you have to propose 15 questions for the final exam. <br />Since the last reflection is reduced and the final exam is reduced, the workload of the course this semester is pretty light! The final project contains about 4k-5k words, I think. (Mine has 4775 words and 14 pages.)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "jSIejwY7a99oevFQ866V0lUh0UsQnJYo",
                    "name": "SOSC 1200 F19 syllabus simplified (1)",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "qJUIT7kowCrmKsHL0L1tlz1YyOh3CmGM",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 661,
                    "name": "CAMPBELL, Cameron Dougall",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "girapkim",
            "date": "Jan 13, 2019",
            "title": "",
            "comment_content": "Content can be interesting according to the guest lecturer. But its boring in general.",
            "comment_teaching": "He brings other professors in SOSC department and to guest lectures every week. But Campbell himself teaches almost nothing and do some weird 'in class discussion' (but mostly it's about people ask a weird question and he answers weirdly)",
            "comment_grading": "Grading is very good. I think he uses subjective and objective grading at the same time.",
            "comment_workload": "Has minor work every week, can be annoying but in general, it is very light. Final was open book and final questions were prepared by students, therefore already posted on canvas.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "liQ9Ka8HVO6NckD0j0E8MBdd4rkgz8xf",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1375,
                    "name": "TANG, Wenfang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "FatCow",
            "date": "Jan 02, 2020",
            "title": "",
            "comment_content": "The course included different topics in various aspects. At the beginning of the course, the first 6-7 lessons would be held by Professor Tang and afterward the lessons were held by the invited speakers. Some topics were listed below as examples: social network analysis, environment and well-being, policy analysis, demography, relationship between natural resources and violence in Xinjiang... These all depend on the guest speakers (not sure whether Professor Tang will invite the same guests in the coming year).",
            "comment_teaching": "Professor Tang is nice. He would answer all your questions and even tell jokes in lessons. Our in-class test was not pretty well and he would go through and discuss the question once. The pathway of a research paper was clearly taught by him, students should be able to catch them up easier. For other guest speakers, some speakers were bored but you may still learn something from their research areas (not really much, if you find it interesting, you should enroll their courses, they must advertise their courses during lessons.)",
            "comment_grading": "The grading is pretty high in each assignment but it does NOT represent that you get a good grade. <br />In this semester, the weighting has been changed for a few times.<br /><br />There should be 3 reflections about the topics originally but we were required to write 2 only at last. The assignment 7.1 replaced the final exam and if you receive a nice mark it will rise your final grade.<br /><br />The marks that I got:<br />reflection 1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4/5<br />reflection 2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4.5/5<br />assignment 7.1&nbsp;&nbsp;&nbsp;30/30 <br />I even missed a mc question and other assignments got 3-4 out of 4<br /><br />My final got 94 and got an A <br />The mean probably got a B-/B",
            "comment_workload": "The workload was appropriate as I did not read all the research paper :( For the in-class quiz, you should revise your notes and REMEMBER to jot notes in each lesson. <br /><br />NO MID-TERM!!! NO PRESENTATION!!!<br /><br />The largest workload was your research paper. However, if you choose an adequate and your favorite topic, it will be fine.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zNtC6sDGZYWO9aWkRSC918njHW9XMt7o",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 661,
                    "name": "CAMPBELL, Cameron Dougall",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yfl",
            "date": "Sep 11, 2019",
            "title": "",
            "comment_content": "there will be guest sharing on each lesson. The sharing is mainly about the research methods in social science. After the sharing, there will be a Q&amp;A session. If there's no sharing on that day, the lesson is likely to become a Q&amp;A session, which is the professor might ask some of the students to ask their questions and he will answer them.",
            "comment_teaching": "not very well prepared course.",
            "comment_grading": "The grading is fair",
            "comment_workload": "The workload is quite heavy for me personally. Before each lesson, you have to ask a question on Canvas and your question will be graded from 0 to 5. On the lesson, after the sharing of the guests, you have to ask questions in order to gain the participation mark. You also have to write a reflection once a month.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fnsAWzxE1v2uXHsJsy92jH5hphZlRziS",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 661,
                    "name": "CAMPBELL, Cameron Dougall",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "PTMS",
            "date": "Jan 11, 2018",
            "title": "Compulsory course for year 1 QSA student",
            "comment_content": "It cover almost all social science discipline <br />Including psychology, economy, political science, public policy, demography and other disciplines.<br />It will be a interesting course if you like social science, and can provide you a brief and wide understanding of each social science discipline.",
            "comment_teaching": "As Cameron is the coordinator of this course, he will appear in this course every time, but all he does is just take attendance. So you better not skip your lesson as he can memorize who have enrolled in this lesson.<br />Every lesson will be featured with different guest lecturer, mostly from HKUST, but some of them are from other university as well, and they will talk about different social science discipline by talking about their research or briefly talk about the course content that they are teaching.<br />Although there are some boring lecturer, most of them are interesting and able to bring some new insights to me.<br />Also, because all of them use english as teaching medium, if you are not good at english you will find it quite difficult to follow (eg me)",
            "comment_grading": "It composed with 6 different part<br />according to canvas, the weighting of different tasks are:<br />3 Reflection 30%<br />Exam 20% ( mean ~65/80)<br />6 Proposed question for exam 20%<br />Attendance 10%<br />Uncountable discussion topics 10%<br />Participation 10%<br />I have got total 83.92% and turnout A-<br />for your reference, <br />my 1st reflection 3.5/5 2nd 4.5/5 3rd 4.5/5<br />exam 69/80<br />Discussion question full <br />All 6 Proposed question total&nbsp;&nbsp;25/30<br />attendance full<br />participation 0",
            "comment_workload": "The workload is quite heavy I would say.<br />Before every lesson you are required to read readings which are provided by the upcoming guest lecturer, and many of them are research paper that has a ton of difficult words and very long, if will be a hard time for people who not good at english. Also, after reading those papers, you are required to post a discussing question in canvas for the upcoming lesson.<br />Every two weeks you are requested to post a mc question that related to the topic in past two weeks that will appear in final exam. <br />Every month you need to write a reflection in 400- 500 words that is about your interested social science discipline which is about your thoughts, new insight etc about this discipline.<br />The easiest part for this course i think is the final exam, because you can bring your cheat sheet (A4 for both side) and all the question were posted and can be viewed in canvas.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IDLAHv1j7knNGXXaAbfoO8DzsBArKTWC",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 661,
                    "name": "CAMPBELL, Cameron Dougall",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "reosaki",
            "date": "Jan 09, 2018",
            "title": "Introductory to Quantitative Social Analysis - -",
            "comment_content": "It covers everything.<br /><br />The course can be divided into 2 parts. The first is the videos. You are required to watch them online. In the video, you can see how Cameron do the presentation... I'm just kidding. The video mainly focuses on introducing basic knowledge of social science research.<br /><br />The second part is the lecture. Different instructors with different research interests are invited to the class. Case analysis is the most interesting part of the lecture.",
            "comment_teaching": "Cameron is nice and patient. He served as a guide in this semester for QSA students.<br /><br />As for other instructors, once you concentrate on their research, you will never find this course boring.",
            "comment_grading": "Assignments are weighted by group:<br />Reflection\t30%<br />Discussion Topics\t10%<br />Attendance\t10%<br />Proposed Questions for the Final Exam\t20%<br />Final Exam\t20%<br />Participation - Assigned\t10%<br /><br />According to the critera:<br />Reflection\t\t90%\t13.50 / 15.00\t<br />Discussion Topics\t\t100%\t17.00 / 17.00\t<br />Attendance\t\t100%\t20.00 / 20.00\t<br />Participation\t\t95%\t19.00 / 20.00\t<br />Proposed Questions for the Final Exam\t\t86.67%\t26.00 / 30.00\t<br />Final Exam\t\t87.5%\t70.00 / 80.00\t<br />Excluded\t\t100%\t3.00 / 3.00\t<br />Participation - Assigned\t\t100%\t100.00 / 100.00\t<br />Total\t\t91.83%(A)<br /><br />It seems that A+ requires 95%+.<br />However, it's applicable to me.<br />So plz be modest and precise to every assignment.",
            "comment_workload": "It's OK for a social science course.<br /><br />On average every week you need to write 2-3 questions on Canvas, do the reading within 20 pages (and some of them are optional). Every month with a simple reflection.<br />That's all.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "5fPbxJurvAYtDA1tFDytPFmWWcpx0qRS",
                    "name": "SOSC 1200 2017 F syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "QEnMb7aERaHPKbilYcgobBq1NUzf5itJ",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 661,
                    "name": "CAMPBELL, Cameron Dougall",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "BBC",
            "date": "Jan 03, 2018",
            "title": "Good course, fun course",
            "comment_content": "Different professors will come and share, which is quite fun in my view. All professors talk about social science topics like sociology or psychology and stuffs like that.",
            "comment_teaching": "Cameron don't teach much directly since it is basically sharing of many guests but the flow of the class is alright.<br /><br />It is fun that professor gave us links of his online courses and told us to watch them, yet it is pretty much unrelated with the exam or whatsoever, and that most of the students just dont watch them at all. LOL",
            "comment_grading": "Just make sure you don't miss any online assignment (like I do) then you should be alright",
            "comment_workload": "Barely nothing at all honestly, some less than 50 words questions that if you ask something you are pretty much guaranteed to have all the point, some proposed questions for the final and some reflection.<br /><br />The questions student proposed will be the questions in the final exam, which you should do well if you read your classmates' work, but the problem is that sometimes the quality of the questions might not be very good.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5cleFEL0DhfsatG3Z2BScGNBqvhvCPGp",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 661,
                    "name": "CAMPBELL, Cameron Dougall",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Alexia",
            "date": "Dec 28, 2017",
            "title": "",
            "comment_content": "This course is quite interesting as we had a lot of guests thoughtout the semester who came to present their research and discuss with us important topics that can usually be linked to current events. It's a highly interactive course.",
            "comment_teaching": "Unfortunately, as most of our lectures were lead by the guests, we didn't really have the opportunity to learn many things from our professor directly. He has more of a passive role in this course, as he makes sure many guests will attend the course, but doesn't teach directly the course's content",
            "comment_grading": "There is no midterm.<br />Participation : 10% <br />Reflection : 30%<br />Discussion Topics : 10%<br />Attendance : 10%<br />Proposed questions for final exam : 20%<br />Final exam : 20%",
            "comment_workload": "Workload is alright, but be aware that you will always have something to prepare before the class. The discussion topics are questions that you have to post on canvas and that you will ask the guest who will be coming. To make them accurate to the content of the lecture, you will have to read his research, which might take you some time as it can be difficult to understand.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "17ZGjjw65fKCx9KKV9WDJIBbPiv93LC9",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 661,
                    "name": "CAMPBELL, Cameron Dougall",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SHSS rubbish",
            "date": "Dec 24, 2017",
            "title": "",
            "comment_content": "全部Social Science嘅嘢<br />有唔同Professor會黎講<br />令你了解唔同Social Science Topic<br />同埋上堂前有Readings/Videos<br />要睇完上Canvas做discussion Question",
            "comment_teaching": "通常係9個字左右講書 半個鐘左右問問題<br />問就有participation分",
            "comment_grading": "Overall 86% A<br />Participation Attendance Discussion Full<br />Exam 85%<br />Question 80%",
            "comment_workload": "Reflection3篇佔30%(每篇400-500字)<br />20% Question6條 Final會見返曬<br />10% Attendance<br />10% Participation<br />10% Discussion<br />20% Final 有cheat sheet<br />Workload大過Lang1002",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KRLhex6y6wfxUqliLcrO1P6VOFhE6dIy",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1375,
                    "name": "TANG, Wenfang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wksm",
            "date": "Jan 31, 2020",
            "title": "",
            "comment_content": "Though I am an SBM student, I enrolled in this course for interest. Prof Tang teaches some basic techniques about quantitative SA. Guest speakers talk about their researches.",
            "comment_teaching": "Prof Tang is nice and friendly. You can go to his office anytime when he is there (he will tell you when is his office hour). You can also email him for lecture videos in case you missed some lectures (reasonably).",
            "comment_grading": "I applied for the pass/ fail grade.<br /><br />Grading<br />20% In-class exercises and homework assignments<br />(7 assignments, quizzes excluded)<br />30% Written reflections<br />15% Proposed questions for the final exam<br />20% Multiple-choice final exam<br />5% Suggestions for class discussion<br />10% Class attendance and participation<br /><br />***Final exam changed to an assignment (research paper), cancelled some MCs and reflection<br />Pass/ fail grade --&gt; no need to do the final research paper",
            "comment_workload": "Attendance --&gt; Q&amp;A, quiz<br />Read materials given by guest speakers before lectures (their previous work included, but the ppt used for the lecture is not given so need to take notes for writing reflections)<br />Assignments --&gt; research proposals, data summary, etc.<br />Takes time, but so-far-so-good",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "B6XqvRGYB5PJKVXgPw9epZZvYpCvgfkG",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1375,
                    "name": "TANG, Wenfang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "04michelle19",
            "date": "Jan 23, 2020",
            "title": "",
            "comment_content": "Teach you how to write a social science assignment correctly.<br />Not interesting at all.",
            "comment_teaching": "Professor Tang is really nice, but his lessons are a bit boring. His teaching is fine. However, his instruction for the assignment is not clear enough. <br />Need to pay attention to the lecture. His powerpoint only got a few keywords (you won't understand if you do not attend the classes). Need to write down everything he said, or else you will score low in the inclass quiz.",
            "comment_grading": "The grading is fine. Fulfil the requirement and you will get an A.",
            "comment_workload": "It is ok...but not good at all.<br />Attendence is important.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}