{
    "error": false,
    "course": {
        "id": 1347,
        "subject": "SOSC",
        "code": "3000C",
        "name": "Social Theory and Modernity",
        "description": "The purpose of this course is to help students acquire familiarity with major social theories and theoretical traditions, the ability to think analytically and critically about the various social, political, and economic issues in modernity, and the skills to carry out  theoretically-informed research on modern society.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            1830,
            1510,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.67,
        "rating_teaching": 4.67,
        "rating_grading": 4.67,
        "rating_workload": 3.67,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 663,
                "name": "SO, Alvin Yiu-cheong",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "HgobReDoBZYEKkuvHGzCom2uHdMFtKyt",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sophie Chan",
            "date": "May 07, 2019",
            "title": "Best course ever!!!!!!",
            "comment_content": "Content are rich, it explains 3 major social theories, yet Professor So breaks down the theories and explain the theories to us very clearly, it is easy to catch up even you've missed a few lessons by just going through the powerpoint slides.",
            "comment_teaching": "I love the professor very much, he teaches well, explains well, and very hilarious which makes that lesson time never boring. Professor So is very kind and he is the best professor ever!!!",
            "comment_grading": "Professor So is very generous in rewarding marks to us! I got an A in the 1st exam with just memorising the points in the ppt slides, I didn't even finished all the readings. As long as you write something on the exam paper, you won't get an F. Even you haven't revised and missed most of the main points during exams he would still give you a C! Professor So gave us the study guide before the exam so it is clear that what will be examined on in the exams, by just following his study guide I have saved much time in revision.",
            "comment_workload": "The course consists of 3 major social theory, so the course is divided into 3 parts and there are total of 3 exams, yet the exams are not cumulative so even you've failed the 1st exam, you could still catch up by working harder in the 2nd and the 3rd exam. Besides the exams, there is only 1 short essay which only requires 500-700 words. The readings are easy to read and it just helps us to understand the theories more. The overall workload is very light compared to the other SOSC course. No quiz, project and attendance taken.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "r1yJfZ4dtkTvdYiHZt8tkmaC4PG8HWe5",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "petrovp",
            "date": "Jan 12, 2016",
            "title": "",
            "comment_content": "Provide fundamental knowledge of the ideas and the concepts of the three fathers of the Sociology - Marx, Durkheim and Weber. You will learn more how their theories can explain the socio-economical events nowadays and in the past. There are many contradictions between these three, however there are many similarities.",
            "comment_teaching": "A lot of examples from nowadays making it easier to understand the concepts. The teacher is very objective and he tries to cover as many points of view as possible. Professor So himself have US education background but he is also very &quot;local&quot; which may create better communication between him and the rest of the students. You can ask questions during the lectures but try not to ask too much. TA was not competent. No group project, nor presentations.",
            "comment_grading": "The grading was not curve-based but absolute, so you need to score 90+ to get an A-range grade. He never gives full mar to the long questions, so if you screw one of the three exams you won't have much chance for A-range.",
            "comment_workload": "Not the easiest SOSC course I have taken. If you are looking for easy courses this is not the right choice. However the content is quite interesting and in order to get an A-range grade you should pay attention to class and take notes especially when he explains the terms with examples.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9ug24uVZJTqVzghHWiiqiNYLulkLTXrZ",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Aglaia Wong",
            "date": "Aug 25, 2015",
            "title": "",
            "comment_content": "Provide an in-depth view into giant socialists: Marx, Durkheim, Parson and more. Ppts are well-written and comprehensible, relative to the original works of the socialists which are extremely difficult to understand.",
            "comment_teaching": "A funny and experienced professor who is capable of putting theories into practice in class to make them comprehensible. And professor welcomes questions and we always have mini discussions in class, in which we students engage to put the theories into applications, too :) So, the classes are highly interactive.",
            "comment_grading": "Work hard and you would be rewarded. The topics of the essay exams are released in advance and you have to prepare for the short questions and long essay questions at home prior to exams, though they are closed-booked. You would be rewarded if you prepare well.",
            "comment_workload": "Workload is huge. Firstly, there are 3 exams, one for each topic, along with a 1000-2000 words integrated take-home essay. Each topic is accompanied by at least 20-30 pages readings of original work. Both the English and the concepts present are difficult to understand. But once you get over it, you would have deeper understanding of the materials presented in class. You should be spending most of your time on the reading.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}