{
    "error": false,
    "course": {
        "id": 1157,
        "subject": "SOSC",
        "code": "2120",
        "name": "The Party-state System in China: Origins and Developments",
        "description": "This course is a comparative and historical study of the most powerful political structure and governing system in modern times. The Party-state system first emerged in the beginning of the 20th century in Russia after the 1917 October Revolution, then inspired parallel political developments in China during the 1920-40s, in Germany during the 1930-40s, and eventually spread to more Central-East European and Asian countries. Special emphasis will be placed on post-1976 China for three reasons basically: the Party-state system therein has been displaying some unique novelties despite the noticeable institutional and structural continuity; the system has been appearing more attractive to some parts of the world community amid the recent economic and financial crises affecting numerous countries; and the system has been exercising growing weight upon the lives and future directions of the Hong Kong population and politics.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            1710,
            1610,
            1530,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.5,
        "rating_teaching": 3.5,
        "rating_grading": 2.75,
        "rating_workload": 3.75,
        "review_count": 4,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 662,
                "name": "DING, Xueliang",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "TGLU4xGFMLzBcRsiMARATWsSpPU6RZ8c",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "lala2",
            "date": "Jan 24, 2018",
            "title": "",
            "comment_content": "Learn about how the Chinese communist party was established in this course!! It is an interesting lesson.<br /><br /> The assigned reading was interesting as well.",
            "comment_teaching": "He is very passionate about the course content and it shows through his teaching. It is interesting to hear about his stories of how he was in the cultural revolution.<br /><br />He teaches using marking pen on the whiteboard. Some of it is blow water.",
            "comment_grading": "Course consists of:<br />Participation 15%<br />Midterm 35%<br />Essay 50%<br /><br />Midterm:<br />The TA doesnt like to give marks, but the class size is so small that the professor also corrects the TA marks and therefore got some bonus points of it. It requires written responses about facts taught in class and in the readings.<br /><br />Final/Essay:<br />The final turned out to be a take home paper, i spent over hours on my paper to research the topic but i guess you can spend less time on it. Obviously, the better your essay is, the higher the grade. <br /><br /> If you are good at writing essays, consider taking this course. You must reference properly, proper format etc~<br /><br />Honestly I did put my effort for this course, took notes every lesson, went to every single class, read every single book on the syllabus, asked questions.<br /><br /> Got A range in the end.",
            "comment_workload": "Overall Workload is&nbsp;&nbsp;moderately ok, just have to memorize some concepts and events for the mid term. I made a summary of the books to help my revision. <br /><br />Give yourself time to write a good essay.<br /><br />Workload is very light throughout as only midterm and essay are required.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eebZlJR5BWKtw3DnBVVYVttoERSEoNpw",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 662,
                    "name": "DING, Xueliang",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "fai",
            "date": "Aug 22, 2016",
            "title": "",
            "comment_content": "This course is talking about the change of party-state system in different period. What Mao and Deng did have affect the development of the party-state system. Also, the course had talked about the characteristic of the party-state system.",
            "comment_teaching": "Prof's English is hard to understand and his teaching is boring. Sometimes he is making some jokes, which quit funny. But most of the time is boring",
            "comment_grading": "The grade is very bad. Prof requires high standard essay with many reference and convincing explanation.",
            "comment_workload": "Not many workload at weekdays. But two essay on mid-term and final is quite a heavy workload",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "pq5rpPSd8wyQTYKnp82YEFSwotgibRrY",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 662,
                    "name": "DING, Xueliang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "BBC",
            "date": "Jan 04, 2018",
            "title": "",
            "comment_content": "You are going to do a lot of readings, and you better already know a lot about Chinese and Communist history or you will be very very very painful in this course.",
            "comment_teaching": "Don't ask stupid questions, he speaks in a fun accent, which shouldn't be a problem for most. He knows well about Chinese history for sure but sometimes it is difficult to follow what he is talking about.",
            "comment_grading": "VERY VERY BAD, OH MY FXXKING GOD.",
            "comment_workload": "You have a mid-term exam and a final essay.<br /><br />Mid-term is about READINGS READINGS and READINGS. Final is a 12 pages essay in Chinese or English, no double-line spacing, font 12, make sure you quote well and write well and whatever you do or however hardworking you are, you could still get poor grade at the end.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2os0hWe1cSgyBgoP07GAXFwaJxsUlfke",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 662,
                    "name": "DING, Xueliang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chengchingyu",
            "date": "May 22, 2016",
            "title": "",
            "comment_content": "The content is general about the rise of Marxism, Lenin, German-like ROC system, the early stage of the PRC and comtempory China after 1989. You will love it as long as you are interested in communism or China's politics.",
            "comment_teaching": "The prof never uses any PPT, cause he said there are new things happened everyday. Actually he always tells us some related news happened a fews days before the lecture. He gives lecture just like telling a story, follwing the timeline, with a weird accent. He always asks us to raise question during the lecture, and remind us to do the readings on the reading list he given.",
            "comment_grading": "The grading mainly depends on two pieces of writing.<br />The midterm paper is a literature review on the party state system, with the materials given by the reading list. 10-12 pages. 33%<br />The final paper is given topics, and all topics are post-1989. 15 pages. 55%<br />Disscussion (Attendance actually) 15%<br /><br />The prof requires high-standard paper. I got C+ on both paper. Overall C+",
            "comment_workload": "Just depends on youself<br />Do as much readings as you can, it strongly helps the papers.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}