{
    "error": false,
    "course": {
        "id": 3727,
        "subject": "SOSC",
        "code": "3990",
        "name": "Health Psychology",
        "description": "Health psychology is the scientific study of how biological, psychological, and social factors affect health promotion as well as the prevention and treatment of illness. We look at how people stay healthy, why they become ill, and how they cope and recover when they are ill. This course is intended to introduce students to the theoretical models, research methodology, empirical findings, and current issues in health psychology. Students should complete the course with a fundamental knowledge in this young and exciting field of study.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2130
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"SOSC\" data-code=\"1960\" href=\"/review/SOSC1960\" target=\"_blank\">SOSC 1960</a> OR <a class=\"course-link\" data-subject=\"SOSC\" data-code=\"1980\" href=\"/review/SOSC1980\" target=\"_blank\">SOSC 1980</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.5,
        "rating_teaching": 4.5,
        "rating_grading": 5,
        "rating_workload": 5,
        "review_count": 2,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [
        {
            "hash": "xp1RcyC28P7oq0ulH3H4Zkqwn5FUuvyK",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Bone",
            "date": "Jun 02, 2022",
            "title": "",
            "comment_content": "This course is about how biopsychosocial factors interact with each other and affect health promotion, prevention and treatment of illness.<br /><br />- Introduction to Health Psychology<br />- Health Promotion/ Prevention<br />- Health Behavior Change<br />- Stress<br />- Coping<br />- Using Health Services<br />- Patient-Provider Relations<br />- Management of Pain<br />- Management of Chronic Illnesses, including <br />1. Circulation-related diseases<br />2. Immunity-related diseases<br />3. Emotional responses and coping",
            "comment_teaching": "Professor Annie Shu is new to UST. Her teaching was ok but the concepts in the PowerPoint slides were a bit disorganized. I would recommend you to refer to the textbook instead. But she is very nice and is very willing to answer student's questions.",
            "comment_grading": "The grading is quite nice.<br /><br />- Class Participation 10%<br />(fill in the Qualtrics link at the end of each class)<br />- Final Quiz 30%<br />(Make sure you go through the textbook, it's better to follow the textbook rather than prof's ppt)<br />- Group Project 30%<br />(Outline 5%, Presentation 15%, Presentation Participation 10%)<br />- Individual Paper 30%<br /><br />My score:<br />Class Participation 10/10 (Mean: 9.05)<br />Final Quiz 24/30 (Mean: 22.49)<br />Group Project<br />- Outline 5/5 (Mean: 4.63)<br />- Presentation 14.5/15 (Mean: 13.09)<br />- Presentation Participation 10/10 (Mean: 9.79)<br />Individual Paper 25/30 (Mean: 24.53)<br />Total: 88.5 (A-)",
            "comment_workload": "The workload is acceptable for a 3000-level course.<br /><br />Besides on answering 1 simple question in the Qualtrics link at the end of each class, there is only 1 quiz (in MC format), 1 group project presentation and 1 individual paper to hand in.<br /><br />For the group project, you just have to design a health promotion/ prevention program of one health-related behavior to the public. You can decide the topic and the target group yourself.<br /><br />For the individual paper, you have to write a reflection in 1000 words on 1 news article about any health issues and explain how it is related to health psychology.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XZeRkKmSvq1UwqIas5zJCkZ6DN2v1RtX",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Sfvpcwl",
            "date": "Jun 13, 2022",
            "title": "Reg it before the professor is contaminated by UST",
            "comment_content": "- Introduction to Health Psychology<br />- Health Promotion/ Prevention<br />- Health Behavior Change<br />- Stress<br />- Coping<br />- Using Health Services<br />- Patient-Provider Relations<br />- Management of Pain<br />- Management of Chronic Illnesses, including<br />1. Circulation-related diseases<br />2. Immunity-related diseases<br />3. Emotional responses and coping",
            "comment_teaching": "Professor Annie Shu is new in this university, and she was from CUHK. She is so nice and have well prepared content. Also, she is happy to interact with you during lecture time. She is also responsive for the email. Reg her to fulfils your requirements/electives before her kindness is being polluted by the evil grading system here.",
            "comment_grading": "Very loose grading<br />10% class parti: I didn't get full, like 9.06 as I accidentally slept over some of the lectures. Mean is 9.05<br />Final quiz 30%: quite common sense for most of the questions, open notes as well, its ALL MC and i got 27/30, mean is 22.49/30<br />Group Project 30%: Really graded so loose and depends on your effort, our group got highest. (29.5/30, mean is 27/30)<br />Individual Paper: Need to write something that let prof thinks its interesting, and copy and paste the keywords appeared in the ppt slides, thats it, I got slighly above mean for this. (26/30, mean is 24.53)<br /><br />Total: 91.56 % for A",
            "comment_workload": "As a business student, I think it is surprisingly easy for a 3000-level course.<br />Parti: 1-2 short questions.<br />Final quiz: Open books, 50 mins for 40 MC<br />Group project: Have guidelines, outlines and participation for you to grab grade (if you miss participation - which just give feedback on others' present; that's must be your issue 0..0 )<br />Individual paper: this one is ok, but there is an upper word limit of 1000 words, so you need not to be worrying about the need to review thousands of pieces of literature...<br /><br />Best 3000-level psychology courses that I have encountered, merely no workload except the necessary one.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}