{
    "error": false,
    "course": {
        "id": 2145,
        "subject": "TEMG",
        "code": "4950W",
        "name": "Special Project: Health Tech for Active Silvers",
        "description": "This is an experiential learning course for students to build an innovative product concept targeting wealthy silver market (age 50 and above) and pitch their idea to a panel of industry judges. Students will work in multi-disciplined teams, learn best practices in new product development and go to market planning; then, practice learned theory in their own chosen projects and receive feedback from corporate-sponsor subject matter experts. Course instructor has 25 years in the high tech industry and 10 years of consultant training and university teaching.  Course teaching assistant is an experienced startup enthusiast and corporate sponsors are Harman Industries (a global market leader in connected car infotainment systems, professional/consumer audio systems and cloud computing, currently undergoing acquisition by Samsung Corp.); and Culture Technology (a conglomerate of businesses including real estate, food & beverage, services hotel, nursing home and elder care equipment retail shops). Final deliverable of this course is a startup product pitch to a panel of judges. Design innovation techniques applied in this course includes “Design Thinking” and “Lean Launchpad” from Stanford University d.School; “Business Model Generation” and “Value Proposition Design”, by Alex Osterwalder, et al. This project does not require knowledge of electronic engineering nor programming, but passion for innovation and learning. Students who successfully complete the course may be offered internship or full-time position with the corporate sponsors. Enrollment in the project course requires approval of the course instructor.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            1630
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 0,
        "rating_teaching": 0,
        "rating_grading": 0,
        "rating_workload": 0,
        "review_count": 0,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [],
    "composer": []
}