{
    "error": false,
    "course": {
        "id": 1354,
        "subject": "TEMG",
        "code": "4950O",
        "name": "Special Project: Hunger Game: Survival Strategy for an Online Marketplace",
        "description": "Over the years, Hong Kong Trade Development Council (HKTDC) has been very successful with high double-digit growth until 2013 when China’s “BAT” (Baidu, Alibaba and Tencent) e-Commerce giants began focusing on overseas business.  The purpose of this experiential learning course is for students to have real-world experiences with best practices in business models (e.g. O2O, B2B), best practices in digital marketing technologies (e.g. social, location, mobile), and a consulting methodology from “McKinsey Engagement” by Prof. Paul Friga.  Students will work in small teams, guided by the course instructor and mentored by IBM Consultants.  Students will be organized into multi-disciplined teams.  The final deliverable are student-consultant recommendation strategies for how to increase the number of global buyers to source on hktdc.com. Upon completion of the course, IBM Global Business Services will offer either full-time position, 10-week summer internship or 1-year co-op placement to students who demonstrated they are fast learners, innovative problem-solvers and have passion for consulting. This project is opened to all HKUST students, but priority will be given to students from the Dual-Degree Program and Interdisciplinary Programs Office. Enrollment requires approval of the course instructor.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 0,
        "rating_teaching": 0,
        "rating_grading": 0,
        "rating_workload": 0,
        "review_count": 0,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [],
    "composer": []
}