{
    "error": false,
    "course": {
        "id": 1204,
        "subject": "UROP",
        "code": "1000",
        "name": "Undergraduate Research Opportunities",
        "description": "This course is developed under the Undergraduate Research Opportunities Program (UROP). It provides a platform on which students can gain some hands-on experience in conducting research in faculty-led projects during the summer session. Approval by faculty supervisor(s) is required. Students are required to submit a written report upon completion of the project. This course can only be taken once for stipend option only; no course credit is assigned. Graded P or F.",
        "categories": [],
        "website": null,
        "credits": 0,
        "semesters": [
            2040,
            1940,
            1840,
            1740,
            1640,
            1540,
            1440
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 4,
        "rating_workload": 5,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [
        {
            "hash": "qJIBfzgOuoKGeVYsD4RHCYhT0wXP2EKE",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "NCH",
            "date": "Aug 31, 2017",
            "title": "",
            "comment_content": "Sorry. This isn't a valid review. UROP has been well received by both students and faculty, and enrollment has increased every year since its establishment. To leverage upon the program’s success, and position it as a flagship program for HKUST, a new course series was introduced in Fall 2010, and UROP is now offered in all three semesters (fall, spring and summer). Students can now participate in rigorous research that spans the academic year.",
            "comment_teaching": "Sorry. This isn't a valid review. Students who opt for the tasting stream register for UROP1000 – a 0-credit course offered in the summer session alone. This stream is suitable for students who have never participated in UROP and who would like to get a taste of the research experience.<br /><br />Students who complete UROP1000 will receive a pass/fail grade. Those who gain a pass will be nominated for a stipend of HK$6,000 or HK$3,000, if any, at the discretion of their supervising faculty member. UROP1000 cannot be repeated in any circumstances.",
            "comment_grading": "Sorry. This isn't a valid review. To ensure that students have sufficient time to immerse themselves fully in quality research, they are restricted to one UROP project per semester. As a general guideline, students are expected to devote at least three hours per week to lab work on any given research project, although the actual level of commitment shall be determined by the supervising faculty member and the student.<br /><br /><br />Students who have successfully completed UROP2100 or above by the time of their graduation will receive a Certificate of Completion. Only one certificate will be awarded per student. For those who have completed more than one project, the project title with the highest course level will be printed on the certificate. If the projects are of the same level, students should choose which one they would like to use on the certificate.",
            "comment_workload": "Upon completion of the program, students are required to submit a report in conference paper or journal paper format. Reports should be written in English and restricted to 8-12 pages in length (Times New Roman font size 12, double-spaced, single column, with no more than four pages of figures or tables), including a 100- to 120-word abstract.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 86,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}