{
    "error": false,
    "course": {
        "id": 33,
        "subject": "CENG",
        "code": "2110",
        "name": "Process and Product Design Principles",
        "description": "Processes and process variables, engineering data, and process representations. The conservation principle. Material and energy balances on non-reactive and reactive unit operations and process systems with recycles. Introduction to chemical product design.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.72,
        "rating_teaching": 4.39,
        "rating_grading": 4.56,
        "rating_workload": 4.33,
        "review_count": 18,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 37,
                "name": "LAKERVELD, Richard",
                "count": 15
            },
            {
                "id": 27,
                "name": "LIU, Yuanshuai",
                "count": 3
            },
            {
                "id": 1566,
                "name": "LIU, Y.S. Marshal",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "UESLTHkSeLREXw4Eo4ERAwojz1qHgl6J",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1566,
                    "name": "LIU, Y.S. Marshal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ev",
            "date": "Feb 01, 2023",
            "title": "Good grading if you put in the effort",
            "comment_content": "The content is basically a continuation and expansion of CENG1000. Even if you didn't do that well in CENG1000, this class explains in more detail what's covered. I actually understood the concepts better in this class than in CENG1000. The course content can be summarized into 2 parts:<br />-Material Balance (Easier and is what makes up most of the content)<br />-Energy Balance (Harder but still worth studying)<br /><br />All the course content derives from the various textbooks listed in the syllabus.You don't have to use the textbook at all as lecture notes are provided, but you can find the textbook online in a PDF (I used https://archive.org/ to borrow it, which I actually used in the final exam)",
            "comment_teaching": "I personally liked Marshall's teaching as he demonstrates interest in what he teaches. He's ready to answer questions and isn't afraid to explain things in detail if further inquiry is needed. He also talks a lot about himself and does his best to have an entertaining atmosphere in the classroom.",
            "comment_grading": "10% Homework<br />15% Class Participation and Quizzes (5% for class participation, if you show up enough that Marshall knows your name, you'll get full marks) <br />15% Group Project<br />60% Open Book Final Exam<br /><br />Quiz Means: 10.5, 13, 9.73, 13, 6.97<br />Final Mean: 40.8 (sd: 17)<br /><br />My Quiz Scores: 14, 10, 11, 20, 6<br />HW scores: Probably 2 for all (Very easy to get)<br />I did alright for group project imo (Project scores never released)<br />Final Score: 54 (+0.76 sd)<br /><br />Final Grade: A-",
            "comment_workload": "4 HWs (Originally more, but Marshall reduced the number after listening to our feedback throughout the semester): The difficulty of the homework varies, the earlier homeworks tend to be more difficult than the later ones. While it may take time to understand them, fortunately you have around 2 weeks to do them. Since you're forced to show your homework to the TA in person, you can have them check your work multiple times until you get it right. As long as you tried, you get a minimum of 1 point out of 2. But even filling in some workings can boost your marks, up to 2 points if you seem to understand the concept and can explain it to the TA.<br /><br />5 Quizzes (Lowest score is not counted): Some quizzes are done on Canvas while some of them you do physically in lesson. Since all quizzes have equal weighting, I advise trying to score high on the online quizzes since you have ample time to prepare for them (1 day)<br /><br />Group Project: Some may think the group project on top of everything else is a bit much but personally it helps with revising for the final. It's also an opportunity to work with other people in your class and learn few things from them.<br /><br />Final Exam: It's a culmination of all the content in class. Exam slot is 3 hours but the actual exam is 2 hour 30 mins. It's hard but you're not expected to score extremely high. It's very important to attempt the questions, as working marks can make or break your grade.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IPOudEeEYJxnWrCKzbMqqpxlv4FQn46r",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1566,
                    "name": "LIU, Y.S. Marshal",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "huichloe",
            "date": "Jan 27, 2023",
            "title": "",
            "comment_content": "Interesting content covering chemical processes and product design, though most of the focus is put on chemical processes. Chemical product design was only mentioned briefly over the last 1-2 lectures.",
            "comment_teaching": "Interesting teaching but occasionally confusing, PowerPoints were inaccurate and misleading... be prepared to self-study and do additional research.",
            "comment_grading": "Many assignments and quizzes plus a project, but the final exam was still 60% of the grading.",
            "comment_workload": "1 assignment every 1-2 weeks, f2f check with TA, 1 quiz every 1-2 weeks, sometimes f2f sometimes online... 1 final project consisting of 4 sub-questions on one system and 1 final exam, open-internet. Combined with the grading, the relative effort does not justify the workload.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "biEEtoWPZ6wykmVkrjhCRA4RWOtHrkYk",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 27,
                    "name": "LIU, Yuanshuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "化工之鬼",
            "date": "Jan 08, 2023",
            "title": "Decent intro course",
            "comment_content": "I took CENG1000 in my yr 1 fall, and the content of this course is basically the same, IDENTICAL, as CENG1000, this course becomes literally zero workloads if you pay attention to CENG1000.<br />The course is in 3 extensive modules,<br />1: Material balance<br />2: Material balance with reactions<br />3: Energy balance<br />Easy peasy.<br />In my opinion, this course is even easier than CENG1000, they should swap the courses.",
            "comment_teaching": "Marshal got a bit of an accent, but it's easy to follow. Make sure to attend each lesson, as marshal literally recognizes each one of us, the main point of the attendance mark is to let marshal recognize you, so answer the questions proactively.",
            "comment_grading": "fair enough.<br />as what other CBE courses do, be the less shitty shit out of a bowl of shit, that grants you a decent grade.<br /><br />15%: 5 quizzes, omitting the lowest grade one (mean is around 70% for mc quizzes with a highest achievable mark of 15 and around 55% for written quizzes with a highest achievable mark of 20)<br />13/15 (highest 14/15)<br />18/20 (highest (18/20)<br />12/15 (highest 14/15)<br />12/20 (omitted, highest 20/20)<br />11/15 (highest 11/15)<br /><br />10% homework, easy work, can be finished within half an hour.<br />full<br /><br />15% group project, just a piece of longer homework. be careful of free-riders as this work is definitely burdening though it's not hard, it's released at the start of the exam month and due on the last day of the exam period. CHOOSE YOUR GROUPMATES WISELY.<br />didn't release the marks<br /><br />60% Final exam, extremely hard, try your best. I don't think they expect you to finish your paper.<br />63/100 (highest 71, mean 4x)<br /><br />Final grade A+.<br /><br />Couldn't say much about the grading, but I'm sure it's lenient enough as heard from my classmates.",
            "comment_workload": "As said above, decent.<br />Attend the lectures and you will understand. Everything is new to everyone (except those with CENG1000), it doesn't appear to say having someone to 屈grade. My class literally has 3 Ph.D. students (I don't know why they are required to enroll in this easy peasy course, but they are there) and some aren't with CBE background (I heard its an elective course for bioengineering minors), but the standard deviation doesn't appear to be large. Everyone has the same starting point in this course.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "K25p8vQmypIx124dTzBfL4ITdEgWbfpN",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GravityApple",
            "date": "Jan 24, 2022",
            "title": "",
            "comment_content": "Interesting content, before this course I had never done any chemical engineering courses, but I liked it. Amazing insights on the role of a chemical engineer. The content is not hard but it’s just scattered into many little bits and pieces. The difficulty of the course was not from the calculations, they were pretty basic, but it is from figuring out what calculations to carry out, there was so many of them! And so you need to make sure you review carefully and make sure you understand where everything goes.",
            "comment_teaching": "Richard Lakerveld in my opinion was very good, cared about the student even when everyone muted themselves. He seemed very passionate about his subject. I requested a lot of help from a tutor and he was also very helpful. The lectures can be quite hard to understand because a lot of the course will be calculations based and there will be many variables to grasp on. The tutorials were helpful to identify what you did not understand correctly.",
            "comment_grading": "As long as you put in work it will be really easy to score well, especially if you are someone who does not mind spending time on assignments. For the quizzes, there was unlimited attempts allowed.<br /><br />Weighting: <br />Canvas quizzes: 10%<br />Problem set 1: 15%<br />Problem set 2: 15%<br />Final exam: 60%<br /><br />Grades:<br />Problem set 1a: 50/50 (Mean: 35.7)<br />Problem set 1b: 50/50 (Mean: 36.9)<br />Problem set 1c: 50/50 (Mean: 28.5)<br />Problem set 2: 150/150 (Mean: 90.7)<br />Final exam part 1: 48/50 (Mean: 32.7)<br />Final exam part 2: 42/50 (Mean: 28.4)<br />Final grade: A+",
            "comment_workload": "I would say the workload is actually quite high if you finish all assignments entirely and if you care about scoring well. From what I know, to get high marks in the assignment you would need to spend&nbsp;&nbsp;several hours to complete them. But based on the mean I think many people did not bother to do that.<br />The good thing is, for this subject, as long as you work hard, you will get a good grade. Everything in the exam is taught in the lectures and can be easily studied. No ambiguity whatsoever. Often, you will get stuck in the lecture and you really need to make sure you understand everything after class. But that’s okay because you can easily find youtube videos on chemical engineering topics.<br />A great strategy for revision is to redo all tutorials and most importantly: Practice writing your answers in a certain way so that you are efficient during the exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PLgLrib8VFx27shNt7PhxUwdKAHB1bu5",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mmmmmmmmmmmm",
            "date": "Jan 05, 2022",
            "title": "",
            "comment_content": "Chemical process and product definition and classifications<br />Design and analysis of input-output diagrams<br />Process variables and diagrams.<br />Material and energy balances: concept and mathematical analysis applied to (1) processing systems with reactions, separations, recycles and purge streams and (2) chemical products.<br />Systematic design procedures for chemical products and processes.<br />Comprehensive case studies related to energy, chemicals, the environment, and pharmaceuticals",
            "comment_teaching": "Quite good! As long as do all the exercises can easily understand.",
            "comment_grading": "Problem set 1 (basic): Scenario-based questions focusing on basic skills&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Distributed and to be submitted in 4 separate parts (4×5%)<br />Problem set 2 (design): open-ended design case study&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Final Exam, all course material, open notes:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;60%<br /><br />Grades:<br />problem set 1:<br />a: 98/100<br />b: 68/100<br />c: 81/100<br />d: 86/100<br /><br />problem set 2: 72/100<br /><br />final grade: A (76.5/100)",
            "comment_workload": "The problem sets are easy to do can refer to tutorials or lecture notes. Recommend start working on problem set 2 earlier as it is quite long.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "doIuVO1LfDgB7Qgy0xO9PCJvhYYzGMBW",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "L.K.",
            "date": "May 27, 2021",
            "title": "An Introductory course in Chemical Engineering. Not good, not bad",
            "comment_content": "[Retrieved from canvas]<br /><br />Part 1:<br />&nbsp;&nbsp;a. Generation-Consumption Analysis<br />&nbsp;&nbsp;&nbsp;&nbsp;- Write the balanced equations<br />&nbsp;&nbsp;&nbsp;&nbsp;- Keep track of the stereometric coefficient<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;of compounds involved in the reactions.<br />&nbsp;&nbsp;b. Simplified economics<br />&nbsp;&nbsp;&nbsp;&nbsp;- Atom economy, etc.<br />----- ----- ----- ----- ----- ----- ----- ----- ----- -----<br /><br />Part 2:<br />&nbsp;&nbsp;a. Process Variables<br />&nbsp;&nbsp;&nbsp;&nbsp;- Mass fraction, mole fraction, etc.<br />&nbsp;&nbsp;&nbsp;&nbsp;- Unit conversion (E.g. Celsius to Kelvin)<br />&nbsp;&nbsp;&nbsp;&nbsp;- Dimensions (E.g. length, area, volume)<br />&nbsp;&nbsp;b. Process documentation<br />&nbsp;&nbsp;&nbsp;&nbsp;- Input-output diagrams<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(Treat all processes as a black box)<br />&nbsp;&nbsp;&nbsp;&nbsp;- Block diagrams<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(Treat each process* as a black box)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;* Mixing, reacting, separating, etc.<br />&nbsp;&nbsp;&nbsp;&nbsp;- Status of operations<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Steady-state (Constant input rate)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Batch (Input and output rate are zero)<br />----- ----- ----- ----- ----- ----- ----- ----- ----- -----<br /><br />Part 3:<br />Material balances<br />(Most essential Part of this course!)<br /><br />The topic involves:<br />&nbsp;&nbsp;a. Concept of material balances.<br />&nbsp;&nbsp;b. Calculations of material balances.<br />&nbsp;&nbsp;c. Degree of freedom (DOF) analysis.<br />----- ----- ----- ----- ----- ----- ----- ----- ----- -----<br /><br />Part 4:<br />a. Performance specifications<br />&nbsp;&nbsp;&nbsp;&nbsp;E.g. Fractional conversion<br />&nbsp;&nbsp;&nbsp;&nbsp;The mole ratio of reacted input compound<br />&nbsp;&nbsp;&nbsp;&nbsp;and the moles of that compound feed.<br />&nbsp;&nbsp;&nbsp;&nbsp;E.g. Fractional selectivity<br />&nbsp;&nbsp;&nbsp;&nbsp;E.g. Fractional yield<br />&nbsp;&nbsp;&nbsp;&nbsp;And more...<br />b. Equilibrium<br />&nbsp;&nbsp;&nbsp;&nbsp;E.g. Performance in changing temperature.<br />----- ----- ----- ----- ----- ----- ----- ----- ----- -----<br /><br />Part 5:<br />Basis of separation<br /> - Uses of separation technologies<br /> - Precedence of separating process<br /> - Separation + Equilibrium<br />----- ----- ----- ----- ----- ----- ----- ----- ----- -----<br /><br />Part 6 (NOT included in Final)<br />Mathematical tools and simulation<br /> - Use of solver in excel<br /> - Plot graph in excel<br /><br />This topic is newly added<br />for solving questions in problem set 2.<br />----- ----- ----- ----- ----- ----- ----- ----- ----- -----<br /><br />Part 7:<br />Energy balance with material balance<br />Most concepts are related to heat,<br />or so-called thermodynamics.<br />----- ----- ----- ----- ----- ----- ----- ----- ----- -----",
            "comment_teaching": "In my semester, 9 am classes...<br />Richard's tone sounds like a lullaby...<br /><br />I simply skip all lectures<br />and watch the videos instead...<br /><br />Actually, his teaching is not bad.<br /><br />But his tone...<br />I always fall asleep,<br />I just can't focus on his lesson.<br /><br />I hate online semester :(<br />----- ----- ----- ----- ----- ----- ----- ----- ----- -----<br /><br />I don't think I can digest the contents<br />without the videos.<br /><br />In his lecture,<br />he shows the PPT slides one by one.<br /><br />However, what he uploads on canvas<br />is the PDF files, which look messy.<br /><br />Maybe because he wants us<br />to participate in the lesson?<br /><br />IDK... Just remember to take self-notes.<br />Also, go and join the tutorials.<br /><br />Those exercises are really helpful<br />in terms of testing your understanding.",
            "comment_grading": "Assessment:<br />1. Regular quizzes on Canvas (10%)<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;4 Quizzes in total, all MCs.<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;Everyone score nearly full marks<br />&nbsp;&nbsp;&nbsp;&nbsp;since you can redo the quiz<br />&nbsp;&nbsp;&nbsp;&nbsp;as many times as you want<br /><br />2. Problem set 1 (15%)<br />&nbsp;&nbsp;&nbsp;&nbsp;Exercises based on regular topics<br />&nbsp;&nbsp;&nbsp;&nbsp;Separated in 3 separate parts (3×5%)<br /><br />3. Problem set 2 (15%)<br />&nbsp;&nbsp;&nbsp;&nbsp;Open-ended design case study.<br />&nbsp;&nbsp;&nbsp;&nbsp;Must solve with help of excel. <br /><br />4. Final Exam (60%)<br />&nbsp;&nbsp;&nbsp;&nbsp;All contents taught.<br />&nbsp;&nbsp;&nbsp;&nbsp;Part 6 is excluded since the main goal<br />&nbsp;&nbsp;&nbsp;&nbsp;of it is to help us to solve problem set 2.<br />----- ----- ----- ----- ----- ----- ----- ----- ----- -----<br /><br />Statistics on Grading:<br /><br />1. Quizzes<br />Mean = 33.6 / 40<br />SD unknown.<br /><br />2. Problem set 1<br />Mean ≈ 102 / 150<br />SD ≈ 50<br /><br />3. Problem set 2<br />Mean ≈ 91 / 150<br />SD ≈ 60<br /><br />4. Final Exam<br />Mean ≈ 66 / 100<br />SD ≈ 25<br />----- ----- ----- ----- ----- ----- ----- ----- ----- -----<br /><br />Overall Performance:<br />Mean ≈ 68 / 100<br />SD ≈ 25<br /><br />My performance (Reference only)<br />Score ≈ 80<br />Letter grade: B+<br /><br />Not as great as the past review claimed...<br /><br />Please do your best in your final<br />or you will feel regret, just like me...",
            "comment_workload": "The workload is pretty high<br />compared to past years.<br /><br />Based on the past reviews,<br />There are 2 quizzes and a final exam only.<br /><br />Problem sets are added<br />for recent year students.<br /><br />I should say that the questions are difficult.<br /><br />Especially for problem set 2,<br />you need to use the solver in excel<br />and guess a solution to certain problems.<br /><br />You are also required to plot graph,<br />analyze the changes, etc.<br /><br />I spend days on those problem sets.<br /><br />Therefore, if there is a problem set<br />in your semester...<br /><br />DO NOT LEAVE THEM<br />UNTIL THE DEADLINE!!<br /><br />I am so sure that<br />you cannot finish them within a day!",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CR7osXsbtSaKBZlRb1IYXFIBvwwuq0Ks",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LMM",
            "date": "Feb 03, 2019",
            "title": "",
            "comment_content": "Wonderful notes<br />6 piece of notes <br /><br />1. introduction (material balance with little money )<br /><br />2.Process variable ( unit conversion and some simple basic knowledge about the plant )<br /><br />3. Process flow calculation (material balance with special stream and degree of freedom)<br /><br />4. Accumulation ( material balance with specification like equilibrium)<br /><br />5. separation<br /><br />6. Energy balance with material balance<br />(most is energy ~~ thermodynamics)",
            "comment_teaching": "Teaching is little bit faster especially the speed of the speaking<br />like the video in youtube speed at 1.25 to 1.5 <br />simple ( easy to understand ) and fine <br /><br />TA <br />very good<br />nice to answer your question",
            "comment_grading": "if there have a lot of non-local and indome your grade will be worst<br />if local only grade is good and fair<br /><br />grade is by 2 quiz and final<br />quiz 1 20%<br />quiz 2 20%<br />final 60%",
            "comment_workload": "no workload no assignment <br />2 quiz and final only <br /><br />tutorial is the place for you to practice<br /><br />if there have something more assignment that will be more better<br />and hope there have around 2 assignment&nbsp;&nbsp;which is my opinion<br /><br />may be around 10% of the grade",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cEP1a8TgpMSS2mBgsaRpYJishiiDZm9S",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anisha",
            "date": "Jan 09, 2019",
            "title": "",
            "comment_content": "It covers almost all of CENG1000 content but is a bit more challenging and more detailed. From this semester onwards, we only had 2 quizzes and a final, closed book and closed notes. Only a formulae sheet was provided with 'potentially' useful definitions and formulae. It was pretty useful in my opinion.",
            "comment_teaching": "Professor Richard is a good teacher and knows what he is talking about. He explains stuff from the very basics and builds upon that. However, he gets a little monotonous sometimes.",
            "comment_grading": "Since the quizzes and exam became closed book, the difficulty level decreased and hence, the grading became more strict. So being a bit above the mean will get you a B range grade",
            "comment_workload": "Only 2 quizzes and a final. Just make sure to attend classes regularly and practice all the problems well.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2b5MCSpone5b5AqlAZD4gRLvPQFJ3DAZ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Robomaster",
            "date": "Dec 28, 2018",
            "title": "An useful course for CENG beginner",
            "comment_content": "The course talk about material balance, separation methods and energy balance. If you do well in PHYS1112, then this course will be a piece of cake for you sinc the difficult part is mainly about the energy balance.",
            "comment_teaching": "Nice lecture and tutor. They explain very well but the notes is too messy at first and lots of symbol made me mind-blown. I need half of semester to get used to them. Once you recognize most of the symbol, then I believe you already know 1/ 3 of notes material.<br /><br />Also I didn’t attend the tutorial. Not that useful",
            "comment_grading": "Very good grade. <br />My score: <br />Quiz 1: 20.25/25<br />Quiz 2: 18/25<br />Final: 84/100<br />Grade:81/100 (above 1 SD)<br />Final grade: A",
            "comment_workload": "No work load. Two quizzes and exam only. No midterm",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "F0HoYyhrxWJgmyAqK3aWtuXTMOuyIibo",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "snowyyy",
            "date": "Jan 10, 2018",
            "title": "Hard work pays off",
            "comment_content": "The courses uses one textbooks for 3 main topics<br />-Process Flow Calculations (Material Balance)<br />-Separation Technologies and Calculations<br />-Energy Flow Calculations<br /><br />The number of topics covered are definitely very manageable, yet content within topics goes quite deep and sometimes you might have to read the same question again and again to understand the algorithm of the solution.",
            "comment_teaching": "Richard:<br />Pros:<br />-Explain course content in really fine details no matter in lecture, tutorials or after class<br />-Very passionate and nice (It is very pleasant to hear he says &quot; You guys deserve a nice weekend after such hard work&quot; every Friday evening class, it is really warming to hear such words.)<br />-Exam paper based on what he taught (You know some of the professors dont)<br /><br />Cons:<br />-Really bad handwriting<br />-Dutch accent is a problem for some of my classmates<br />-He developed his own way to set variables in his lecture powerpoint which is not following what the textbook is using. So, you might need to ask a bit about the things he write in class",
            "comment_grading": "Lenient grading to say at least. <br />40% In-class quizzes (Best 2 out of 3)<br />60% Final Exam<br />*No Mid term exams<br /><br />There were 3 quizzes and 2 of the best scores within the 3 will be calculated, so it is alright to be unprepared for one of those. Each quiz will cover one of the 3 topics chronologically listed on above. The 1st one was really easy, the 2nd was super hard, the 3rd was alright for me. <br /><br />Exams were not that difficult as those questions are definitely taught in lessons and demonstrated in textbooks. However, they were really tricky questions and therefore you must be very cautious to answer those.<br /><br />My results:<br />Quiz 1<br />Me: 19.5/20&nbsp;&nbsp;Mean 16.4/20<br />Quiz 2<br />Me: 7.5/20&nbsp;&nbsp;Mean 9.9/20<br />Quiz 3 <br />Me: 19/20&nbsp;&nbsp;Mean 13.3/20<br />Final <br />Me: 80/100&nbsp;&nbsp;Mean 59.7/100<br />Overall: <br />Me: 86.5/100&nbsp;&nbsp;Mean 66.2/100, Grade: A+",
            "comment_workload": "Zero Workload .<br />The only workload I can think of is digesting the content taught in class as those content really needs time to understand. Practising class exercise and textbook exercise is optional. It helps you understand the rationale behind the calculations but it is not really crucial for getting good grades.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Y3r1hGw9kqlFQDHY1CYuB42JjSbDSLvX",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JAM",
            "date": "Jan 09, 2018",
            "title": "",
            "comment_content": "Content covers material balance and energy balance. The course is a bit harder than CENG1000 but if you have done well in CENG1000 this course should be relatively easy. Just need to do practices.",
            "comment_teaching": "Richard is really nice, always willing to answer questions - in class or even by emails. He has a bit of an accent though.",
            "comment_grading": "Grading is extremely lenient. I got +1.25SD for the final course grade and my letter grade was A+. <br />There should be 3 quizzes, but only the best 2 out of 3 would be counted towards final grade.",
            "comment_workload": "Workload was really little. No homework, no projects, no presentations. Tutorial is optional since Richard would upload the tutorial materials on Canvas anyway.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cD6uPzQiCcUt2RMwPx2waMYOCCNMqR92",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "calvinbun",
            "date": "Jan 09, 2018",
            "title": "",
            "comment_content": "There are only 6 topics, but some may require efforts to achieve a good grade. Topics are:<br />1. Introduction, Generation-Consumption Analysis, simplified economics<br />2. Process Variables &amp; Representations<br />3. Process Flow Calculations<br />4. Synthesis of Reactor Flow Sheets and Selection of Reactor Process Conditions<br />5. Separation Technologies<br />6. Process Energy Calculations<br /><br />I would like to say... take CENG1000 first before taking this course!! 1000 helps you develop skills for doing material &amp; energy balance problems.<br /><br />Another warning is that... don't skip any lessons. Richard is a good prof and he would explain the slides clearly. You can actually try to do self-study instead, but u may feel confused looking at those variables.",
            "comment_teaching": "As mentioned, Richard's teaching is good in terms of the clearness and pace. Although accents would annoy you a little bit, he is still nice in explaining the steps.",
            "comment_grading": "Towards the final grade, there are only 2 components:<br />-Quiz x 2 (out of 3)&nbsp;&nbsp;&nbsp;@20%<br />-Exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;60%<br /><br />Quiz 1: material balances (Lect 1-3)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;it should be the easiest. I scored almost full <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mark and the mean was 17/20<br />Quiz 2: again material balances and separation <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;processes(Lect 4-5)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Things are getting complicated. Mean score <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;is 10.6/20. Well I didn't attend those <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;lessons... so my result was slightly below <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mean.<br />Quiz 3: Energy balances (Lect 6)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mean: 13(?)/20<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Me: 11.5/20<br /><br />So only Quiz 1 &amp; Quiz 3 are used.<br /><br />For the exam, 3 hrs for 9 LQs. It seems good but time runs so fast... and I got 56.5 in the exam (mean:59.7)<br /><br />Overall, turns out a B+ (mean ~66, me 64.5)",
            "comment_workload": "Nothing to say about it... I can't think of any comments for a subject simply has exam and quizzes... BRAVO",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YtX9Lj8RZA6KKnrx8QB8fcnOyAzaknMS",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Irisleah",
            "date": "Oct 21, 2017",
            "title": "Process Principles",
            "comment_content": "Basic chemical engineering principles. Starts out with mass balances, extent of reaction, process flow problems, synthesis problems, separation technologies, and finally process energy calculations. <br /><br />None of it is too difficult if you go to class or study on your own. There is a textbook (Introduction to Chemical Processes by R.M. Murphy) but he doesn't require you to read it.",
            "comment_teaching": "He's very nice and really tries to help you understand any questions you may have. However he is a little boring to listen to in class. He also has a accent being from the Netherlands, but it's not too bad.",
            "comment_grading": "Three quizzes in class over the semester with a final exam. All three quizzes and the final are open book and you can use any notes or the textbook if you'd like. He also drops your lowest quiz grade. the final exam is cumulative. No grade for attendance for the class or the tutorial. <br /><br />Each quiz is worth 20% (with the lowest being dropped so your best two quizzes are 40% of your grade)<br />The final is worth 60%",
            "comment_workload": "Workload is really light. Not required to attend tutorial or class as he puts his slides up on canvas and the problems and solutions up on canvas as well. However it can be easy to fall behind if you don't attend class. His slides can also get a little confusing just reading them, so it's better to go to class so he can explain them.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WlqQGUWx0mzOLtZFU1jaZF2Nc21m4ldF",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Timothy Chan",
            "date": "Jan 14, 2017",
            "title": "Basic chemical engineering course teached by awesome professor from Netherland",
            "comment_content": "The course has three modules. Material Balance, Energy balance, and profitability analysis. For the first two, it is quite similar to that in ceng 1000, so it's better to enroll together with ceng 1000, or simply finish ceng 1000 before study this course. These two topics are easy to understand but also easy to conduct careless mistakes in calculation. For profitability analysis, it involves quite a number of business terms, so it's abstract to thoroughly understand them, but you don't need to do so as the exam is very straight forward, only based on formulas in this topic.",
            "comment_teaching": "Richard is a very nice and considerate professor who will answer every question after class. You could feel free to ask him question if you need. Richard' class is not extremely interesting as most of the course is knowledge oriented, not for cultivating interest. However, his lesson is definitely not boring because he organizes and prepares the lectures well.",
            "comment_grading": "I've mentioned there are 3 topics in this course. There is a quiz after every topic ends. Only the best 2 counts in the 3 quiz. Usually, students get low marks in energy balance quiz, so do pay more attention to the another 2 to secure your grade. The quizzes are conceptually very easy but easy to conduct careless mistakes so do pay extra attentions on that. The exam is not as easy a quizzes but still straight forward, make sure you know all the equations, even in small parts,&nbsp;&nbsp;in your notes before the exam will be enough. The grading of the course is good, so don't need to worry much.",
            "comment_workload": "The workload is very low for me. As I've complete ceng 1000 before enrolling in this, so the workload of ceng 1000 is quite heavy compared to this. Only have quiz and exam, no assignments or heavy exercises to practice.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "C7Uw50H07I3pZsCccYVgYC1bQMSibAjo",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ddd",
            "date": "Jan 08, 2017",
            "title": "",
            "comment_content": "Syllabus:<br />Process principles:<br />process variables and diagrams 10%<br />material balance 30%<br />reactor flow sheets and selection of conditions 10%<br />energy balance 20%<br /><br />Engineering economics:<br />costing 15%<br />project economic evaluation 15%",
            "comment_teaching": "Richard is a very good teacher, he explains everything properly and doesn't create unnecessary tension in the class; you can always ask him for help. Generally, absolute chill.",
            "comment_grading": "Assessment:<br />best 2 out of 3 quizzes, in-class, open book: 2*20% = 40%<br />final exam, open book: 60%<br /><br />For the quizzes I was slightly above the mean, for the final got around 85% ---&gt; overall: A<br /><br />Energy balance quiz is the worst, if you get your quizzes right you have a very good chance of A range; final tasks are very similar to quizzes.",
            "comment_workload": "I did literally nothing for this class. Just study one day before the quizzes, a few days before the final and you're done. No workload, easy good grade.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "taZgGpW8uydyymL2MFWpybEYMU5xC0vs",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 27,
                    "name": "LIU, Yuanshuai",
                    "rating": 1
                },
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CBME girl",
            "date": "Jan 25, 2016",
            "title": "",
            "comment_content": "A compulsory course of CBME students.&nbsp;&nbsp;<br />The course separate into two parts, and there are two professor in charge of different parts.&nbsp;&nbsp;Richard mentioned about something like material balance and energy balance.&nbsp;&nbsp;Richard's part hold around 2 months.&nbsp;&nbsp;<br />The second part is about engineering economics, which was taught by Marshal.&nbsp;&nbsp;You need to understand the theory of engineering economics well.&nbsp;&nbsp;&nbsp;(Most importantly!! Don't skip Marshal class...)",
            "comment_teaching": "Well... The tone of both professor is not really so good...<br />Richard has strong Netherlands tone and Marshal has his own special tone.&nbsp;&nbsp;(It is quite difficult to understand what Marshal really speak)<br />On the other hand, both professors have strong passion on their teaching.&nbsp;&nbsp;They provide good examples for us to learn the topics well.&nbsp;&nbsp;(Richard may give us some difficult out syllabus example but it is still fine)",
            "comment_grading": "Grading is good.&nbsp;&nbsp;There are 3 quizzes plus one final exam.&nbsp;&nbsp;They will count the percentage of 3 quizzes as optional (It depends on your total mark)",
            "comment_workload": "Quite low...&nbsp;&nbsp;But you still have to work hard on the quizzes.&nbsp;&nbsp;If you are clever enough then you only need very few time on this course.&nbsp;&nbsp;For those who always have misconceptions on energy balance like me, you better work harder:)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EApPMrXIaIxsfz449UXJqyuwqZLgtSW9",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 27,
                    "name": "LIU, Yuanshuai",
                    "rating": 1
                },
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bohr",
            "date": "Jan 17, 2016",
            "title": "CENG2110",
            "comment_content": "分開左2 part <br />Basics balances (material, energy) (ceng1000既深版)<br />1.Process variables and diagrams<br />2.Material balances: concept and mathematical analysis of processing systems with recycles and purge streams<br />3.Synthesis of Reactor Flow Sheets and selection of Reactor Process Conditions.<br />4.Selection of separation technologies and synthesis of separation flow sheets<br />5.Process energy calculations<br />Economics part (計下cost..) (本人建議要理解個concept先)<br />1.Costing<br />2.Project economic evaluation",
            "comment_teaching": "Richard 好好人 除左tutorial ex之外 佢都會比額外既練習+ans我地既<br />如果你覺得d練習5夠做既 建議賣reference book (同ceng1000一樣)<br />ref.bk : R.M. Murphy. (2007) Introduction to Chemical Processes, International Edition. McGraw-Hill, New York, NY, USA.",
            "comment_grading": "超好grade",
            "comment_workload": "冇assignment mid-term<br />不過每隔幾堂會有一個quiz (係tutorial 做) 都easy既 <br />quiz, final open book",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Cp5L4hgDmv2meLsGnb8Ct21B8SNJkyBQ",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "choithomas99",
            "date": "Oct 25, 2021",
            "title": "Moderately Easy Class",
            "comment_content": "Content<br /><br />Chemical process and product definition and classifications<br />Design and analysis of input-output diagrams<br />Process variables and diagrams.<br />Material and energy balances: concept and mathematical analysis applied to (1) processing systems with reactions, separations, recycles and purge streams and (2) chemical products.<br />Systematic design procedures for chemical products and processes.<br />Comprehensive case studies related to energy, chemicals, the environment, and pharmaceuticals",
            "comment_teaching": "Prof is a good teacher and the material isn't as difficult as other CENG courses. As long as you come to classes and tutorials, it should be an easy A range. Not much hard calculations, but a lot of variables and flow diagrams. It is just an advanced version of CENG1000.",
            "comment_grading": "Problem set 1 (basic): Scenario-based questions focusing on basic skills&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Distributed and to be submitted in 4 separate parts (4×5%)<br />Problem set 2 (design): open-ended design case study&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Final Exam, all course material, open notes:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;60%",
            "comment_workload": "Need to finish the problem sets which doesn't take that long. Each problem set should be doable within a day. No need to study that much for the course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        }
    ],
    "composer": []
}