{
    "error": false,
    "course": {
        "id": 2927,
        "subject": "CENG",
        "code": "2310",
        "name": "Modeling for Chemical and Biological Engineering",
        "description": "Modeling of physical, chemical and biological processes. Balance Equations. Dimensional and scaling analysis. Analytical and numerical solutions to initial and boundary value problems. Use of computer tools for engineering calculations. This course uses examples in the Chemical or Environmental Engineering disciplines. For CENG and CEEV students only.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MATH\" data-code=\"1014\" href=\"/review/MATH1014\" target=\"_blank\">MATH 1014</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1020\" href=\"/review/MATH1020\" target=\"_blank\">MATH 1020</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1024\" href=\"/review/MATH1024\" target=\"_blank\">MATH 1024</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.43,
        "rating_teaching": 4.57,
        "rating_grading": 4.71,
        "rating_workload": 2.57,
        "review_count": 7,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 21,
                "name": "LAM, Henry Hei Ning",
                "count": 7
            }
        ]
    },
    "reviews": [
        {
            "hash": "LaZpWP6lhXLpXDKALTjFeUOrMZciadNq",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "shiyu",
            "date": "Feb 03, 2023",
            "title": "Hard ass course with a good prof",
            "comment_content": "Good luck, this course is basically one of the few courses that made me go wtf after looking at the exam. It’s doesn’t really help that its open notes.",
            "comment_teaching": "The teaching is pretty good as i get all the math theory, but it’s just the matlab part that feels impossible to learn. Henry puts in a lot of effort to let students understand the content but tbh i feel bad for the guy, i dont understands the stuff 70 percent of the time",
            "comment_grading": "Pretty ok, the grading is fair and the exams are pretty generous since some lines of code can already earn you points.",
            "comment_workload": "You have assignments after assignments, each question is impossible to do by yourself so you better pray to god that the TAs have time to help you with your homework, if you didn’t finish your hw in lesson time then yeah prepare to sit in front of your computer for hours.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zrKyjgQsAm7vW2sqL1PtpPs3uhObhHxn",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wkwkwkkwkw",
            "date": "Jan 09, 2023",
            "title": "Amazing professor, but I have no idea why this course exists",
            "comment_content": "In this course, we were taught on how we could model real life phenomena and program them in MATLAB. Henry said that the purpose of this course is for us to acquire a transferable skill that would help us in our future careers. <br /><br />However, I honestly don't think this course was necessary at all. The content was admittedly interesting, albeit difficult. But I just don't see how this course is essential for aspiring chemical engineers.",
            "comment_teaching": "Henry is definitely the best professor I've had so far in UST. He is very very good at explaining the concepts to us. Furthermore, he is also a very approachable guy and is very kind.",
            "comment_grading": "The grading is fair.<br /><br />5% Class Participation<br />10% Online Quizzes<br />25% Homework<br />35% Exams<br />25% Project<br /><br />I got like slightly above mean in most of my assignments and got a B. W grading imo.",
            "comment_workload": "The worst part of this course lmao.<br /><br />This course is HEAVY. I spent so much time on this course alone because of the number of assignments that were given to us.<br /><br />We were given homework weekly, which may not sound bad, but trust me it is. The homework assignments were super difficult, without the help from the TAs and Henry it would be impossible to finish.<br /><br />The project workload may vary for different groups. If you are really ambitious and want a high grade then you'll definitely spend a lot of time gathering data and coming up with efficient ways on how to model your chosen phenomena. If you are lazy then you could choose a topic previously discussed on the homework and alter the code a bit.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5GmjEXLl5HdqSOxvxZ3zDLK3yLPUNRq3",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "化工之鬼",
            "date": "Jan 08, 2023",
            "title": "terribly hard course",
            "comment_content": "For details of the content, just refer to other comments. the content is the same throughout the years. I am just here to complain.<br />The content is just way too hard, I don't think I could handle it even in year 4. You may know already, this course is just about combining Matlab with other cbe knowledge, but the problem is both are new to you. Even though I took some outside just courses about odes, I could never understand what the question is about. My friend took isom2500, which is business statistics and still score low in the statistics part.<br />If you aim to learn, this course is definitely a failure. every bit of this course is just rushing you to swallowing without letting you understand. if you are in cbe, you may already know prof. Lam is a genius since he was young, maybe this was the case for why he teaches so fast, and maybe he is just thinking every night about why we stupidly could not understand.<br /><br />For the project, I learned nothing :) I just copy and paste the homework solutions and changed the scenario.",
            "comment_teaching": "it's fine, he is a nice guy.<br />couldn't understand the materials, so can't comment on how he teaches",
            "comment_grading": "though the content was hard, the grading was lenient.<br />averaging 50% on the before-class quizzes, scoring around 90% on 7 or 8 homework, and slightly above the mean in all three exams getting a B+.<br />I got no idea how it works, but nevermind:)",
            "comment_workload": "super duper hard.<br />I never finish my homework on my own, everyone is just asking the TAs for answers. I don't see the point in setting the homework this hard, but prof Lam said this helps us learn, so ok;)<br />exams is also extremely hard. Just don't be a perfectionist and copy and paste everything relevant, should at least get you a mean, as everyone is basically bullshitting too. <br />no matter what grades you got in MATH1014, COMP1021, COMP2011 and MATH2011, you still learn nothing from this course.",
            "rating_content": 1,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zPhsFoAWRjVcCAFvbAqz4uNhVDofnJyH",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kxjddj",
            "date": "Jan 22, 2021",
            "title": "",
            "comment_content": "basic skill of Matlab<br />(about the contents, please read other reviews)",
            "comment_teaching": "Henry is really good, his teaching is clear and easy to follow and he answers every questions.<br />We use flipped classroom style this semester, have to watch usually 2-4 videos before the lecture.<br />Henry will do the video demos and first one or two questions in homework in class",
            "comment_grading": "Class participation (5%)<br /> (just watch and grade other groups' project)<br />Online quizzes (10%)<br />Homework (25%)<br />Midterm exam (30%)<br />Project (30%)",
            "comment_workload": "quizzes have to be done every week before the lecture<br /><br />have homework every week (about 2-3 questions), but 1 or 2 questions will be solved in class (or Henry will give ideas about how to solve） and you can ask Henry or TA in the homework time.<br /><br />still quite high workload...... because it takes a lot of time to solve the remain questions even you have the basic ideas about how to do",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1c5ESTCXkoeqyttmPVXXEF1tTi73Ixzr",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bighead",
            "date": "Jan 07, 2021",
            "title": "",
            "comment_content": "The basic skill for MATLAB<br />cover topics are<br />ODE<br />PDE<br />transport phenomenon<br />statistic",
            "comment_teaching": "Henry is a really nice teacher, he answers all the question you ask <br />this semester we are doing flipped classroom so we need to watch the video before class. In class, Henry will do the demos and explain about the homework",
            "comment_grading": "Even though I did not get a good grade, the grading is fair.<br />I did not do well in my mid term and final<br />so I get a C+",
            "comment_workload": "the workload is just alright, every week there is a homework, except for the first week. <br />there is a quiz every week before the lecture",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PLWQ06hPz1rO1ZM4QfzZoyks17bHM84w",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "armstrong",
            "date": "Jan 05, 2021",
            "title": "The main challenge of this course is programming (using MATLAB).",
            "comment_content": "Coding mathematical models (equations) in MATLAB to simulate specific processes, phenomenon and real-life problems, these are some examples: concentration of solution, predator-prey population, projectile, heat transfer within the medium, probability......<br /><br />Within the class, you will usually deal with ordinary differential equations (ODE). The outputs of the models are usually (plots/ charts)<br /><br />Topics:<br />First-order ordinary differential equations<br />Vectors and matrices<br />Population dynamics/ Systems of ordinary differential equations<br />Chemical kinetics<br />Second-order ODEs<br />Transport phenomena/ Partial differential equations<br />Dimensional analysis<br />Introduction to statistics/ Stochastic modeling<br />Regression/ Parameter estimation<br />Inferential statistics/ Model validation",
            "comment_teaching": "Henry is a really nice person who are willing to answer our questions(or let say encourage us to ask questions) <br /><br />However, limited by the syllabus, the teaching is rushy. If you do not prepare for the class and review it afterward, you will learn nothing (it's normal that you dont know what's going on during <br /> the class).<br /><br />Also this is the first semester for this course to apply &quot;flipped class&quot; mode which is watch video yourselves about the topic, and do assignment together in class.<br /><br />in tutorial class, you will be placed in a &quot;homework group&quot; which you can discuss your work with others or ask Henry/ TAs question. But usually there will be silence because many of us dont even know what the question is asking. Also we don't know each other due to online teaching.",
            "comment_grading": "Class participation (5%)<br />Online quizzes (10%)<br />Homework (25%)<br />Midterm exam (30%)<br />Project (30%)<br />=======================<br />HW: all above mean(60-80%)<br />MT: just above mean(~30%)<br />Project:just above mean(~70%)<br />B<br />=======================<br />I feel like many of the students(including me) are not familiar whit this course. Moreover, Henry said that the midterm is planed to be hard and is expected with a relatively low mean.<br /><br />The grading is way better than I expected.",
            "comment_workload": "The major workload of that semester is from this course.<br /><br />total of 9 homeworks, almost one per week with 2-3 questions each. At least one question will be demonstrated in class. They are difficult IMO and take a looooooot of time to complete if you are not talented or are just a normal student like me. Asking question will definitely bring you advantages because Henry and the TAs will give you hints and help you to debug. <br /><br />There are videos introducing the topic that you need to watch before each module and finish a small quiz with 3 MC questions. It will usually take one to two hours.<br /><br />Understanding the fundamental of MATLAB (like how the data are stored) is sooooooo important. These were not explained well in class and caused huge difficulty to me while dealing with this course. <br /><br />I felt a lot of confusion and frustration with this course. This is tough and you should have mentally prepared for this.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "t2nMmC7nq5HXFK6oehwCiDAPbZcCtsvv",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 21,
                    "name": "LAM, Henry Hei Ning",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hyeongwoo",
            "date": "Feb 25, 2020",
            "title": "Great Course, Might be hard for those without programming backgrounds",
            "comment_content": "This course is Co-listed with BIEN2310, so review on BIEN2310 also applicable.<br /><br />By the end of this course, students should be able to:<br />&nbsp;&nbsp;&nbsp;&nbsp;Model simple physical, chemical and biological processes as mathematical equations<br />&nbsp;&nbsp;&nbsp;&nbsp;Develop and interpret differential equations in initial and boundary value problems<br />&nbsp;&nbsp;&nbsp;&nbsp;Solve ordinary differential equations analytical and/or numerically<br />&nbsp;&nbsp;&nbsp;&nbsp;Describe elementary concepts in statistics and perform simple hypothesis testing and regression analysis<br />&nbsp;&nbsp;&nbsp;&nbsp;Use computing tools for engineering calculations<br /><br />Chapters:<br />Balance Equations<br />Dimensional Analysis<br />First order ODEs (MATLAB)<br />MATLAB Vectors/Matrices<br />Systems of first order ODEs (MATLAB)<br />Second order ODEs (MATLAB)<br />PDEs (MATLAB)<br />Numerical Methods (MATLAB)<br /><br />Used to have Statistics also at the end, so there can be more for later terms<br />Your computer should be able to run MATLAB with Virtual Barn for your convenience (if not, it will be very inconvenient to do all the homeworks).<br />Getting familiar with MATLAB is the most important part of the course, since, in my opinion, 75% of the homework, Mid-term and Final are from MATLAB.",
            "comment_teaching": "Henry teaches very well, while the course is relatively new in this department.<br />He provides good examples and derivations of the questions.<br />Henry is very responsive with students, so asking him more will result in better result.<br />If you cannot attend the class, he will provide recordings of the lecture.",
            "comment_grading": "Class participation (5%)<br />Homework (25%)<br />Midterm exam (25%)<br />Final exam (45%)<br /><br />You do not get to know Class participation Score.<br />Homeworks: 2 well above mean, 1 just below mean, 1 just above mean<br />Midterm: 95/100 (High)<br />Final: 68/100 (+1.5SD)<br />Result: A+<br />Around 30 people in class (including BIEN and CENG), and I think grading should be lenient enough",
            "comment_workload": "Workload is quite high for the 2nd year fall term course.<br />4 Homeworks which takes a lot of time to finish, Mid-term and Final exam.<br />You can get help from either professor or TA for homework. They provide good hints. Tutorial sessions are solely for the homework discussion.<br />Homeworks should have precise parameter specification, derivation and explanation of your program.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}