{
    "error": false,
    "course": {
        "id": 26,
        "subject": "CENG",
        "code": "1600",
        "name": "Biotechnology and Its Business Opportunities",
        "description": "This course gives an introductory overview of biotechnology from both technical and business perspectives. It surveys the current landscape of medical biotechnology, discusses the significant milestones in this field, describes underlying scientific concepts, and emphasizes the impact of innovations on human health and economy. Case studies are used to illustrate the opportunities and limitations in current and future biotechnology development. In addition, experts from industry and academia are invited to give guest lectures on course-related topics.",
        "categories": [
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1630,
            1530,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.1,
        "rating_teaching": 3.66,
        "rating_grading": 4.61,
        "rating_workload": 4.01,
        "review_count": 71,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 19,
                "name": "SUN, Fei",
                "count": 63
            }
        ]
    },
    "reviews": [
        {
            "hash": "5QH6meaMLKpGgwgN17zPYo8M5bLLAkVJ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Joyce Fu",
            "date": "Sep 05, 2019",
            "title": "",
            "comment_content": "80% biotech 事<br />20% business 事<br />但係我無science底，所以老老豆豆唔知content有d乜。。<br /><br />不過project既presentation 都幾有趣既，role play 囉",
            "comment_teaching": "",
            "comment_grading": "零bio 底，零science底，零chem底<br />上堂完全唔知professor講咩<br />assignment 有人carry 都幾高分<br />project 都做得幾好<br />但係final係完全唔識左，做左大概30分鐘就走人<br />但係最後有B+ <br />真係好靚grade <br />極度推薦",
            "comment_workload": "總共有3-4份assignment<br />同埋group project <br />但係要做既野其實唔多，都幾輕鬆，又無mid-term 同quiz<br />不過會有iprs，但係我一個iprs都無做過，照樣有B+",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cZrniNal1A9KMBnFfy6bLBifyZDW07Rb",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ElioH",
            "date": "Jan 10, 2020",
            "title": "SUPER GOOD GRADE!!!!!!!!!",
            "comment_content": "Covering various aspect in the field of biotech.<br />You can learn a lot and have a basic understanding of those fancy breakthroughs/new treatments/ideas.",
            "comment_teaching": "Some times a little bit boring I have to admit...? Maybe it is because this course is at 12:00-1:20pm so it's easy to get sleepy for me la. And it's full of difficult biology and chemistry words...<br />But the professor himself is really patient and kind. You can ask for his suggestion on your project or anything you don't get in class after the lecture. Sometimes he will share with you his own stories and opinions XD.",
            "comment_grading": "The grading policy is like: A+ corresponds to 5%, A for top 15% and A- for top 20%. <br />The professor is super nice when giving grade!!!!!! <br /><br />(Just put in your effort and time and you will totally be fine. Also for the group project, carefully selecting your group-mates is really crucial. Better have 1-2 biotech major in your group and 1-2 business school. )",
            "comment_workload": "3-4 homework which I have to spend some time to look up some related articles and webpages.<br />Group project is kinda a big thing. Don't choose hard topics that no one has solved it yet.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4YZMrewaHIYvAnpeYQAwJ7aeHWds1aeE",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Michelle_1220",
            "date": "Jan 09, 2020",
            "title": "超靚grade course",
            "comment_content": "70%biotech<br />30%business<br />其實biotech啲野基本上之前教過曬<br />Business野都唔算好深<br />個PowerPoint其實好多版都係啲biotech例子<br />睇下就算 唔係幾考",
            "comment_teaching": "無點上過堂<br />基本上skip左90% <br />（因為佢講野真係有啲悶<br />自己睇notes仲好",
            "comment_grading": "超級超級靚grade！<br />當我仲expect緊自己有無B嗰時佢居然彈個A出來<br />完全surprisedddddd<br />所以先來寫個review讚下依個course<br />所有hw同group project都只係貼mean/高mean少少就有A<br />真係喜出望外",
            "comment_workload": "正常<br />4份功課加一個group project<br />個group project諗題目最麻煩<br />又成日比啲TA ban曬<br />我地嗰份都重新做左3次先交得<br />除左個group project 麻煩啲之外<br />其他都可以接收到",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "z58EeTGLdg7lDM8GOWLNIK6El5nBj4pE",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jeff Hu",
            "date": "Sep 04, 2015",
            "title": "CENG1600 Full of Surprise",
            "comment_content": "It is undeniable that this course is full of various sorts of useful content. The course mainly focus on how to take good advantage of Biotechnology for an eye to make great fortune. In spite of the fact that quite a few of the course contents are simply skim through some basic biology knowledge. It seems to me that the experience of learning is rather fruitful and improve your skill of considering on how to cheat people by selling your words, then your products, eventually your brand and mind. <br />The most unforgettable remarks put by Professor is that, &quot;You guys should know that. Even though developing and producing vaccine could help a lot of people throughout the world, it will definitely not make you a billionaire due to the price restriction policy enacted by the government and the pressure of Nonprofit Organization.&quot;<br />After the course, you will be disappointed if you hope to learn much about Biotechnology, but actually you are capable to distinguish from simply doing Biotechnology and doing Biotechnology for Business. That's what I learned.",
            "comment_teaching": "The Professor's accent is cute and acceptable for understanding. It is hard to fall asleep in class only if you stayed up all night yesterday.",
            "comment_grading": "Incredible nice!!! I think church might help. Help a lot!",
            "comment_workload": "A weekly assignment asking student to provide short paragraphs for three or four meaningful questions. It took about 3 hours to finish one assignment.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "VnZrpdBC4elpRFOIqQnZjXn5HeVZQkMN",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SmileQAQ",
            "date": "Feb 15, 2022",
            "title": "If you want to give up, please keep going as the result is exceed your expectation",
            "comment_content": "About gene, I just attended less than 3 lessons throughout the whole semester. I am a Business student. The content is not that difficult, and it is not required memory.",
            "comment_teaching": "reading ppt, speaking is slow",
            "comment_grading": "VERY GOOD!!!!<br />I almost gave up before the final exam. But when I checked USTSPACE to question myself why I chose this course, I found another person saying don't give up 'cause its grade is really good. <br />So I keep going and fortunately got an A.(I almost did not attend the class, and the final exam allowed us to use google.)",
            "comment_workload": "Not heavy. <br />I have spent a few hours on each homework (if you are good at searching, you may just spend 10 mins as it is all found on the web) and there originally are 3 (only count the highest 2)but prof gave us 2 hw eventually.<br />For the presentation and the report, a bit more effort you should put into them. As I heard, it relies more on deciding your grade.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lOrILMqlCNFzxb4WIUSXFQcEG7hizbcV",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LLLEE",
            "date": "Dec 30, 2021",
            "title": "Easy, not much thing to learn except the guest lectures",
            "comment_content": "Easy with a life science background.<br />Most classmates are biotechnology majors cuz this is their requirement course, but busi. students can still get good grades from this course though you may feel frustrated most of the time because the prof DID NOT explain the basic bio stuff before jumping to the biotech prt.<br />I m not a busi student so I can manage to understand most of the content with the help of google<br />Guest lectures are the best, he invited a professor who have start-up experience and a UST Mphil student who is currently running a start-up sponsored by UST (and prof. being the consultant of the company) for guest lectures. In total 3 guest lectures<br />Don't worry, content in guest lectures are not tested.<br />Someone recommend bringing the answer of your HW to the exam because some questions appear the same in the final (exact wordings), but this is not happening this year.<br />I recommend searching the answers before the final exam, paste onto the word doc, and copying the sentences to your written paper, it works",
            "comment_teaching": "okay la, acceptable, very hea<br />I feel like the professor is putting more focus on his business rather than teaching, recommend watching recording for 2X speed if don't want to waste time, he speaks superrrr slowwwww<br />he even did not upload the syllabus on canvas!!! (but previously he did)",
            "comment_grading": "My second A+ in UST!!!<br />Pretty good grade though I did expect that<br /><br />HW: Full (2 out of 3 are marked), easy with Google, don't copy answers from previous years samples (from your friends) though the questions are the same or you will be fucked up<br />Final: not released, open book and just google search for the answer xd<br />Project: not released, but we equally divided our work and everyone work well on their parts, no free riders in the team<br />Attendance: Full (shd be only counting the library workshop attendance only for this semester since there are not any iprs)",
            "comment_workload": "No need to review the lec materials regularly, that's great<br />Everything can be google search so you can just write down a list of topics covered and learn online (Wikipedia)<br />Project is the source of most of the workload, have to hand in 2 reports, one 5-mins presentation video. Need to read some research papers initially for topics brainstorm, the samples provided in Canvas is absolutely the best performers of last semester, just take it as a reference (e.g., format but no the depth of explanation)",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FWT3vAze1t0YwmPJm1xtjxreq25WlDQk",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "trashlife",
            "date": "Jan 27, 2021",
            "title": "",
            "comment_content": "Mainly <br />- Recombinant&nbsp;&nbsp;DNA technology and the birth of Genentech<br />- Monoclonal Antibodies<br />- Nucleic acids as vaccines and therapeutics&nbsp;&nbsp;<br />- Enabling Technology: <br />DNA microarray<br />- Delivery of New Therapeutics<br />- Tissue engineering<br />- regenerative medicines<br />- Enabling technology",
            "comment_teaching": "The professor seems to be nice but the mainland accent is really... I don't wanna listen lol and the content is too hard for a business student. I tried to pay attention in the first class but has no idea what he's talking about. It's not even basic stuff of biology even if the course description says it gives an 'introductory' overview. I wanted to catch up and understand what he's teaching but I didn't know where to start from so I basically just gave up and skipped all classes. I just followed the lecture notes to do assignments and exam.",
            "comment_grading": "Must attend library workshop<br /><br />Class participation: 5%<br />Homework: 10% (All will be graded but only the 3 best will be counted towards final grade)<br />Class project: 40% (Project plan + Final Report: 25%; Presentation: 15%)<br />Final Exam: 45%<br /><br />I don't participate in class at all so maybe I lost the 5%.<br />I did 3 HW only and most are at mean or a little bit above mean.<br />Not sure how i performed in project and exam.<br />At last got B. May be considered a bad grade since everyone says this course has good grading.",
            "comment_workload": "1. Assignment<br />2. Project<br />3. Final<br /><br />1. 4 assignments in total, not much workload, around 4 questions in each assignment<br /><br />2. Project has the biggest workload. Need to submit an 'interim report', briefly explain what the project will be about. The final written report is 20 pages long and there is also a presentation. This semester we had to make a video recording of the presentation and the video will be played on the 'presentation' day. Our faces are not required to be shown in the video. There is a format requirement for the report. Since we have 5 people in a group and the required format makes the report not-that-packed, it doesn't really take a long time to compile the report. We even had to cut words to fit in the page requirement. Most time are spent on doing research.<br /><br />3. There is a study guide for final exam and I just followed it to study for the exam. Reduces a lot of workload, though I'm not sure if this is a risky act.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "h0wVIran472JNBiw8eYHqBFwZBClnbJy",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "samsam02190",
            "date": "Jan 20, 2021",
            "title": "小心保重，搵多啲資料",
            "comment_content": "As like what others mentioned.",
            "comment_teaching": "佢講嘢真係有少少悶，至少唔係太有令人想聽嘅感覺。 但係佢教嘅內容如果你做功課嘅時間你想搵少啲資料，確實需要聽一聽唔係嘅話到時你做功課可能會有啲嘢寫唔足。",
            "comment_grading": "我覺得成個分數確實係好唔錯，因為工作量細同埋佢唔係咁要求你上堂記曬全部資料，更多係你會唔會識答佢嘅問題。 最尾嗰次考試就係開書，三個鐘做大概有12至15條題目，全部都係容易搵資料同埋比較簡單嘅 。<br />如果你組員冇拖累你，同埋大家都有心做到，就算你唔係定期溫書或者真係睇曬份簡報，你都可以有A range。 <br />唯一嘅建議就係請你份功課認真啲做同埋有一個滿意嘅分數。<br />我同一組有組員B+,A-,A+ ，所以記得盡力做同埋考試唔好放棄。",
            "comment_workload": "工作量唔算太大。因為即使佢有三份功課同埋一個小組嘅功課，要做20頁左右嘅報告，但其實好多嘢大家分工之下，唔算話真係咁辛苦。 同埋佢考試係開書嘅，你有三個鐘頭做，其實已經好足夠內容。好多嘢都其實已經係課堂或者功課入面睇到，然後去再換一個方式問返， 所以只要你正正常常有睇曬甚至係睇一睇佢份簡報已經唔算話咁難。 <br />真係搵唔到組員佢都會幫你自動分配，同埋成份小組功課差唔多一個月去做。",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uYtFPa8EY7amsvEtRXJ83fsLslMhDHVN",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yam",
            "date": "Feb 17, 2020",
            "title": "",
            "comment_content": "Mostly biotechnology, so it would be hard for non-bio students to fully comprehend the content. Only recommended to students who are interested in biotechnology and are self-motivated to spend extra time on the content.",
            "comment_teaching": "Unfortunately, the lecture takes place at noon (12:00-1:20) during which I seldom remain sober enough to not fall asleep. The professor is very kind to answer any of your questions but his rhythm of speaking sometimes lullabied me. <br />Besides, bio terminology confused me at first which made it even harder to focus on the lecture.",
            "comment_grading": "I didn't get a good grade but that's the price I have to pay without enough attention and respect towards assignments.<br />(Discuss with others on the assignment questions if you aim for a rather satisfying mark.过于自信，血的教训。）",
            "comment_workload": "-4 assignments which take 1hrs(or more if you want to present really good answers) each<br />-1 workshop<br />project:<br />-one midterm proposal <br />-one final presentation of your project (canceled due to online mode teaching)<br />-a few group meetings with group members.<br />The workload is not light but acceptable and I learned a lot by&nbsp;&nbsp;reading a dreadful lot of papers on biotechnology since I am a&nbsp;&nbsp;stupid SBM freshman:)))<br />Huge thanks to my group mates. We are all extremely supportive of each other even though I just randomly chose a group to join.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oPrqaBu7NKn0apiecEPvFns1hQ8pncRY",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pepper",
            "date": "Jan 14, 2018",
            "title": "Disappointed at first but grade is good(at least for me)",
            "comment_content": "More about how the technology is carried out and less emphasis on the business opportunity part. That is why I'm disappointed at first. Just talked about how much money the company earned and sometimes give reasons for the success or failure of that case. Talked about patent near the end of the semester and that is all about the business opportunity part. Final emphasize on the biotech part too.",
            "comment_teaching": "At first, I found the accent of the prof hard to understand and often fall asleep midway through the class. But eventually get used to it. His powerpoint usually just contains the key points and pictures about the topic and he would explain a lot more in class. He is willing to answer our questions after class.",
            "comment_grading": "The final exam includes both mc and long q. mc is quite hard but only 4 choices. More than sufficient time for you to complete the paper and babble for the long q. Completed them in 1 hr.<br />The project contributes to a large proportion of the grade and it really depends on your groupmates.<br />Better grade than I expected. Expect B- but end up with A-. Good grade or I am really lucky with the groupmates and mc.",
            "comment_workload": "5 homework but only count the best 3. I only did the first 3. Each took around one night to do with a lot wiki &amp; google because I did not pay attention in class and had to learn it from scratch.<br />The project includes a proposal, presentation(10min) and final report(20 pages). I was lucky and have others to carry me for the project. Prof would give solid suggestions after the proposal. Presentation and report are in the same week. The presentation is just reading the main points of your report and it's ok to prepare it 1 or 2 days before the presentation(if your groupmates are ok with it). The final report is double spaces and can include tables so very easy to meet the 20 pages target. Again, I'm very lucky to have these groupmates who give high quality work and tolerate my deadline fighting(but also high quality :D).",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9skweMFGJIYzuFLKvyPAiCV7QQk4FmPi",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "esterrrh",
            "date": "Aug 17, 2023",
            "title": "",
            "comment_content": "I didnt attend any of the lessons but it covers all common biotechnology topics that you will see in your lifs lectures. It also includes some knowledge about intellectual property and patents.",
            "comment_teaching": "Idk fr i didnt join one single lesson.",
            "comment_grading": "the grading for homework varies from TA to TA. they never really released any comments or how they grade the presentation and final as well. I got A at the end but it is probably because i have already learnt the biotechnology contents in my other lifs classes which i did attend.",
            "comment_workload": "There is a group project and a final open book and internet written exam. For the group project you have to come up with a new company and what biotechnology service you will be providing. The final exam is all written (no MC no T/F) but as you can look it up on the internet, most people use chegg to google the answers and directly copy.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TO73ZUvFDLKYFQNbxu9AaB3tjyD7uc9r",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "correctiontape",
            "date": "Aug 02, 2023",
            "title": "Join for good GPA",
            "comment_content": "Interesting content for science students, especially those in BIOT ot BIBU.<br />The science content can be complicated for non-science students, but it doesnt matter as the final exam is open book.",
            "comment_teaching": "Professor Sun Fei is a nice professor who is passionate about biotechnology (His field of research), although his teaching can get boring sometimes as he reads off the powerpoint of some chapters, he tries his best to explain the concepts in between.",
            "comment_grading": "The grading was wonderful for me, despite missing 50% of the morning lectures.<br />(Estimated studying time: 2-3 hours a week)<br />Letter grade: A+<br />However, this does not mean you are encouraged to skip lectures regularly. <br /><br />Since I already had a decent foundation for biotechnology, the content was relatively lightweight for me. I highly encourage those without science background to pay attention during lectures for better understanding, as the concepts will come in the final exam.<br /><br />The grade depends on both the presentation and final exam (open book), I have forgotten the exact weighting but dont take them lightly.<br /><br />Final presentation involves a biotech business start-up idea, exact details may vary depending on the prof. My group used nicely designed slides and presented online in zoom.<br /><br />Final exam is open-book, making it fair for all students from different majors. To get a good grade, make sure you understand the concepts first and apply them!!<br />Most answers can be done in a &quot;blow-water&quot; style, but make sure you are coherent and have applied the correct science/ business concept!!!<br /><br />Overall, a fun course with a rewarding grading system. If you pay enough effort consistently, a B+ to A is highly attainable.",
            "comment_workload": "Just make sure you spend some time to review the content, the slides are quite sufficient to explain everything.<br />Google the content if you dont understand them, this course will not dig too deep in the science tech stuff.<br /><br />I had 2 readings, a group business idea presentation and a final exam<br /><br />Overall, relatively light workload :)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7SX6MIHYvNYFx7RMrcvwr9FDPbGFgFjG",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cisssssssy",
            "date": "Mar 03, 2023",
            "title": "",
            "comment_content": "80% Biotech<br />20% Business<br />有好多start up company嘅example可以睇下<br />其實都幾無聊",
            "comment_teaching": "一般<br />我冇乜點聽書<br />但係professor把聲好催眠",
            "comment_grading": "好靚grade<br />真係好靚grade<br />project記得搵人carry 或者自己做carry人嗰個<br />做靚少少就會好高分<br />final係open book<br />可以參考網上同埋ppt<br />雖然ppt冇乜用<br /><br />最後A咗",
            "comment_workload": "Depends on 你 project groupmate俾唔俾力<br />除咗project就係final<br />所以workload真係好少",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "o490vXkM8mLJWALkzxds5MIR8YeUgUDN",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sakura:D",
            "date": "Feb 23, 2023",
            "title": "",
            "comment_content": "The content generally are related to biotechnology, only little related to business. For a student who enjoys studying in biology might find this course interesting. I think people who had studied E4 for HKDSE biology might find this course manageable, like mostly about the recombinant DNA technology. The scientific knowledge of this course is a bit advanced, so I would not suggest people who have no idea in biology to study, or you would find it a bit difficult to catch up.",
            "comment_teaching": "Honestly speaking is a bit boring... Especially the time slot of my semester was 9:00-10:30, with a lot of hard biology and chemistry word, quite amount of people fell asleep during lessons. However, the professor is actually quite nice and patient. He would be willing to answer your question. You could ask him for opinions especially when you do the project",
            "comment_grading": "Very very good grade<br />Even you do not understand the course material, please do not give up!!!<br />The final exam is open google so you could eventually find every answer online<br />I have studied biotechnology during high school so I am quite familiar with it.<br />Assignments: All above median around a sd<br />Project: didn't release <br />Final exam: didn't release<br />I don't think I did very well on the final exam, but I eventually got an A. I think the professor is very generous when giving grades.",
            "comment_workload": "Very light workload. <br />You only have to complete 3 assignment through out the whole semester. And for the project, you just have to present 1-minute content by recording. The hardest part of biology, in my aspect, would be memorising the scientific terms, But the final exam was allowed to open google, so you just have to scan through the notes once and understand something then everything would be fine!",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BWD4ZjfWLwGlcKPkR2KQMaxyqRqOn0oQ",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kent",
            "date": "Feb 16, 2023",
            "title": "",
            "comment_content": "Mainly focus on biotechnology. Not difficult for students with Biology background.",
            "comment_teaching": "It is kind of boring because he talks in a slow pace and monotonous. I skipped the lectures after midterm period.",
            "comment_grading": "Class participation: 5% (library workshop)<br />Homework: 10%<br />Class project: 40% [midterm project plan (6-page PPT) + final project plan (17-page PPT): 25%; presentation: 15%]<br />Final exam: 45% (open-book + Google)<br /><br />Don't need to study a lot for the final. You can find the answers on Google.",
            "comment_workload": "The workload is not heavy. Three assignments for this semester. Around 2 ppt slides for each person for the project.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OkiVYygZczC7WTIjUEyVDjNAuQq9yGxd",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ando",
            "date": "Feb 14, 2023",
            "title": "",
            "comment_content": "-Quite expansive, covers a wide range of biotechnology application s and products <br />-Greater emphasis on the science end rather than the business aspects of the course",
            "comment_teaching": "Early 9am lecture sessions twice a week but, the content itself was interesting. Prof. Sun ocassionally brings in guest lecturers from local biotech startups to introduce their firms and respective products.",
            "comment_grading": "Class participation: 5%<br />Homework: 10% (All graded but only the best 3 counted towards final grade)<br />Class project: 40% (Project plan + Final Report: 25%; Presentation: 15%)<br />Final Exam: 45%",
            "comment_workload": "Long-q/essay/mc homework questions.<br /><br />Group project will requires forming a proposal for a start up biotechnology company.<br /><br />Final Exam was open-book.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "F4KhQAS8elJXtRrfdiYnhc56kvo0jJnB",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jefferycph",
            "date": "Jan 31, 2023",
            "title": "Good grade, harsh for business students",
            "comment_content": "As a business student, I don't think that the word &quot;Business Opportunities&quot; is suitable for describing this course. In the final exam, all the questions are about biotechnology. 90% of the topic covered is advanced biology.",
            "comment_teaching": "If you want to look for a reading machine, here you got one. very slow pace and boring lecture.",
            "comment_grading": "The grading is based on 4 parts:<br />1. Participation: 5%(Attending the library workshop, then you can get full marks)<br />2.HW:10%, counting the best three homework, but what makes this fun is that He only gives us three homework. XD<br />3. Project: 40%<br />4. Final: 45%, even if u dunt study, it is still fine as it is an open-book exam. You can look for references via google but not cheXX.",
            "comment_workload": "The workload is still OK. HW can be solved within an hour and you can look for support online. For the project, you need to prepare a proposal and a 5-min video, together with a final report. The proposal and report can be handed in via the format PowerPoint. I didn't study much before the final as it is an open-book exam. What i got at the end is A.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Cs27Rh82lWXSc8uVVOcJrNsWraylE62z",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Financebro",
            "date": "Jan 31, 2023",
            "title": "You won’t regret",
            "comment_content": "90% Science 嘢<br />10% Business 嘢<br /><br />只要中學有讀過Biography睇powerpoint都應該好易上手，就算冇讀過都唔緊要，homework同final都可以比你上網直接google答案，唔需要擔心。",
            "comment_teaching": "去過上堂，雖然少少悶，但Professor幾好人，落堂有問必答。",
            "comment_grading": "Grading好好，係花得最少時間最少心力但Grade又唔差嘅course。",
            "comment_workload": "個人assignment只有幾份，每份隔好耐，好多時間做，答案powerpoint或者上網搵就有，唔會用好多時間。<br /><br />有一個group project，要交一份proposal，一份powerpoint同一段5分鐘嘅錄音，建議組隊時要搵定有science底嘅同學入組，因為都幾多technical野要考慮，冇science底做起上黎都會吃力。<br /><br />最後final可以帶ipad/電腦入去考試，基本上只要快手google搵答案，盡量抄曬落去就冇問題。",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UEWZELlCJXmWJTxiAYqTRbCYjskymiZx",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "poisyd7323",
            "date": "Jan 31, 2023",
            "title": "",
            "comment_content": "Content is pretty straight forwards, got to study a bit more if you don't have a good background knowledge on biology",
            "comment_teaching": "his lectures are really boring, most people just skips his class",
            "comment_grading": "his grading is so good, went to 4 lectures, but still pulled a B+<br />can bring a computer and use google cause it is an open book exam, mostly training your research skills and retention of that information into your paper for the exam.",
            "comment_workload": "three pieces of homework, all pretty straightforward and easy, doesn't have much work load",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EYDucJfnJRn9uM3kgsEMMwC0HcXiWSDK",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "cxtxc",
            "date": "Jan 30, 2023",
            "title": "",
            "comment_content": "If you have studied biology in DSE, it is not difficult for you.",
            "comment_teaching": "It is not boring.",
            "comment_grading": "The grading is very good. It is easy for you to get a good grade if you do your group project well. Attendance is required only for the library workshop. I did not attend the lessons except the library workshop. For the assignments, it is easy to get full mark. You can use google to search and it is not hard to understand the concept.",
            "comment_workload": "Workload is very light. No midterm. Assignments are easy and we are allowed to use google during the final, which is very comfortable for us. Group project is not a hard work.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SFepSI1tkEQ1IcfDj73xVJZ4kC54krOo",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "^^",
            "date": "Jan 25, 2023",
            "title": "",
            "comment_content": "This course gives an introductory overview of biotechnology from both technical and business perspectives. It surveys the current landscape of medical biotechnology, discusses the significant milestones in this field, describes underlying scientific concepts, and emphasizes the impact of innovations on human health and economy. Case studies are used to illustrate the opportunities and limitations in current and future biotechnology development. In addition, experts from industry and academia are invited to give guest lectures on course-related topics.<br />The course is divided into three main parts. Part I talks about the roots of biotechnology. The technological development of some classical biotechnology products is highlighted, in the context of the opportunities captured by the companies that are considered biotechnology giants nowadays in US. Part II presents the growth of supporting technologies and the emergence of new start-up companies. Part III discusses the key elements for building biotechnology companies and biotechnology clusters, with emphasis on the increasingly significant role of universities in technology transfer, and provides a glimpse of the biotechnology picture in China and the nearby regions.",
            "comment_teaching": "Average.",
            "comment_grading": "Quite good. Basically you will get a good grade when you put effort in doing the assignments, project and exam.",
            "comment_workload": "Class participation: 5%<br />Homework: 10% (All will be graded but only the best 2 will be counted towards final grade)<br />Class project: 40% [Midterm Project Plan (in 6-page PPT slides) + Final Project Plan (in ≤ 17-page PPT slides): 25%; Presentation: 15%]<br />Final Exam (open book): 45%",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Tuh7o3pzYrmHcveZFWLT8NleCNcZtTsm",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hopeIcanGrad",
            "date": "Jan 09, 2023",
            "title": "Great course if you want a good grade",
            "comment_content": "80% biotech 20% business <br />- not very interesting <br />- not too difficult to understand even if you don't have a biology background <br />- very basic concepts on both biotech and business part",
            "comment_teaching": "- quite boring <br />- prof just reads from the lecture slides",
            "comment_grading": "- very good grade <br />- didn't study for final but still got A <br />- don't know how they grade for the project tho",
            "comment_workload": "- no mid term<br />- 3 assignments that involve an biotech article, have unlimited attempt tho<br />- one group project (one ppt slides for midterm and one 5 minutes ling pre-recorded presentation for final) <br />- one final exam (open book that you can use searching engine as well) <br />- they didn't test on business part in the final",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qok7J5qxpaBKR26yjiWnpuetMBdF1iFj",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Trebmal",
            "date": "Jan 08, 2023",
            "title": "Good grade, but not a rewarding course",
            "comment_content": "The course content is too diverse, covering many topics without going into the details. But since it's an introductory course, I think this may be suitable for non-science students who want to have a glimpse of everything. For me, I learnt nothing from the course haha.<br /><br />85% science and 15% business stuff.",
            "comment_teaching": "Only attended first few lectures. It's just reading powerpoints, boring.",
            "comment_grading": "Participation: 5% from library workshop<br />Homework: 10% from 3 assignments<br />Presentation Project: 40%<br />Final Exam: 45%<br /><br />Final grade: B+, all scores except hw not released<br />Skipped almost all lectures and paid no effort except the class project. So perhaps you can say it's a good grade course.<br /><br />But I still have no ideas how people can get full marks in assignments as they are open-ended questions lol.",
            "comment_workload": "Not too high. You can finish each assignment within an hour. For the project, it highly depends on your groupmate. My suggestion is to find at least one person who have some business background to do the forecasting of your proposed start-up.<br /><br />For the final exam, I didn't waste my time in revision - and it's a wise decision. Because you will have nearly no idea what the questions are talking about. You can literally take out your laptop and Google the answers.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zPgPPnBFjDpnBTAe6msY0wQv27QK0GCt",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "forfor",
            "date": "Nov 28, 2022",
            "title": "",
            "comment_content": "If you are interested in biotechnology, you can reg this course. This course will also show you the potential of biotechnology in economic and commercial aspect. Very good to learn if you want to start a biotechnology company.",
            "comment_teaching": "Accent of professor is acceptable, sometimes you need to focus more when professor is speaking.",
            "comment_grading": "My group project got a good result and I am confident in my exam. However I only got a B at last.",
            "comment_workload": "Group project will require you write a proposal for a start up biotechnology company, you need to think a biotechnology product which can make money and how you can find the budget. <br />Exam is easy, you can use any thing you got in exam, even Google search.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0DaJOCNpoACBjgZKwWib8FYEiQLjcuXW",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "K8",
            "date": "Aug 13, 2022",
            "title": "Literally a Godsend",
            "comment_content": "Most of it is biotechnology rather than business, so if you don't have any sort of BIology background I wouldn't recommend this course. However, if you've taken bio in high school this shouldn't be difficult, and I personally found this course to be the most interesting one I've taken thus far, because you get to learn more about recombinant DNA and vaccine development etc.",
            "comment_teaching": "Professor SUN is goated, his lectures can be a bit boring but when it came to group projects he was happy to answer any questions we had, and gave us a lot of direction for the business proposal.",
            "comment_grading": "Exam was open-book (Hallelujah) and the project was a business proposal for a new biotech company, both were quite easy as I had hard-working teammates. Ended up getting an A :)",
            "comment_workload": "I didn't do much other than write a comprehensive summary of the course contents for the final open-book exam, and other than one group project (around 3-4 meetings worth) there wasn't much to do.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uSh7HFS2ex2OmoqATF5r79uHTvuqqW7D",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "oyeah",
            "date": "Apr 26, 2022",
            "title": "jeng dou bao im not joking if you can search stuff online fast then u will A",
            "comment_content": "I dropped DSE bio in sec school so I understand nothing but to answer the final questions you don't actually need to understand anything lmao",
            "comment_teaching": "No need to attend lessons, coz you won't understand anyways, and I personally think it is quite useless for a business student. He goes into quite in-depth topics that even those who studied DSE biology find it hard to interpret.",
            "comment_grading": "10% effort 100% return<br />Skipped all IPRS 0 parti marks,&nbsp;&nbsp;compiled all notes into one pdf one day before exam, finished exam without understanding the questions, got A at the end.<br /><br />How to prepare for exam:<br />1. compile all lecture notes into one pdf<br />2. windows: control + F; mac: command + F<br />3. copy everything you see from lecture notes and google results<br /><br />Note: you don't need to understand, you just need to copy and write ultra fast",
            "comment_workload": "I skipped all lectures and IPRS and my only effort paid in this course is the group project, which requires quite some research and time for a high quality one.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3q7TELJt3DNoIR1oMqnlh5AyEohJ8pX6",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "EdwardT",
            "date": "Mar 13, 2022",
            "title": "Easy for anyone taken Bio in high school",
            "comment_content": "About the commercialise of biotechnologies, such as vaccine, gene-editing.<br />80% Bio<br />20% Biz<br /><br />Quite easy if you have taken bio in high school.",
            "comment_teaching": "I believe Prof.SUN spares no efforts on this course, but as you can guess that the way he taught is quite boring. Highly recommend you to read on your own after taking attendance.",
            "comment_grading": "As this course is facing all students from different educating backgrounds and different stages, the grading is loose and comfortable in correspondence of the threshold of biology. <br /><br />What should be laid emphasis is that you should truly understand the technology used in the examples of class. With respect to the biz part, as long as you propose a not-so-ridiculous idea, it won't matter much. <br /><br />Easy to get A range if you have bio backgrounds or spend some time with this course.",
            "comment_workload": "I would say normal. If you haven't get much reach to bio, you may need more time on this course. But generally, quite comfy.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vhJl1Sc8uhjbBqjmQs1apj1QamX1a8WW",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "hmcheungal",
            "date": "Feb 04, 2022",
            "title": "",
            "comment_content": "70%biotech<br />30%business<br />其實biotech啲野基本上之前教過曬<br />Business野都唔算好深<br />個PowerPoint其實好多版都係啲biotech例子<br />睇下就算 唔係幾考",
            "comment_teaching": "無點上過堂<br />基本上skip左90%<br />（因為佢講野真係有啲悶<br />自己睇notes仲好",
            "comment_grading": "not so lenggrade actually, <br />HW *3 all highest<br />Group Proj seems to have a pretty high mark<br />Screwed up in finals, 1 MC = 4 Marks while 1 LQ is just 8 marks. As a busi student, the final is more of testing ur ability to read fast and research fast.<br />Didnt release the final mark<br />at last A-",
            "comment_workload": "quite low if there are friends to reg with you cuz hw can discuss tgt and mostly copy from lecture notes",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dAWk6FdP0JMduT9EI7o0sB5veuDIuLOp",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hillson",
            "date": "Jan 27, 2022",
            "title": "Good Grade Course",
            "comment_content": "mostly about biology stuff and little bit of business in company. But as I am the biot major student, actually the content in this course is basically similar as the biot major course. Also the business stuff is not hard and not specific, general stuff.",
            "comment_teaching": "I never attend the lesson and just look at the ppt before exam. The professor is like a primary student who is not ready for presentation. so many hesitations which makes me feel he is not prepared and boring.",
            "comment_grading": "The grading is definitely a good grade course! I haven't attend the lesson ever, but i can still get a B+. The project is quite important as it occupy quite large ratio.",
            "comment_workload": "There would be 3-4 Homeworks(unlimited attempt), and it told you to read the essay he gave you and answer the questions. But actually you can find literally everything in google, and also the grading of the homework is based on key words you answered, so you don't need to answer a long question like writing an essay. <br />Before the exam, maybe one to two weeks before, the professor would send out a &quot;important topic to revise&quot;, but not much to recite. So even if you are the person that hates reciting, this is also a good course for you. The only minor thing which needs to be making a little bit effort is your group project. But it would be so easy if you find some mainland students which is in sbm and also some students from lifs course.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kMdf5rlPDITFcMJ2TIUBCMBuiQnsbMkK",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kwai",
            "date": "Jan 25, 2022",
            "title": "",
            "comment_content": "80%biotech <br />20%business <br />不過我冇bio底都照讀<br />感覺差別唔大",
            "comment_teaching": "冇點上堂 都係自己睇notes<br />不過到考final open book都發覺有冇ppt都差唔多<br />Google有用過notes..",
            "comment_grading": "應該幾好grade<br />輕輕鬆松B",
            "comment_workload": "算低 三份hw 入邊有兩條mc加一條short question 唔洗好多時間就可以做完<br />有一份gp project 交一次proposal同final 中間有一次video 嘅present 可能因為gp有人carry 所以唔覺好重workload",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TGIwdMkc8LAkviS0Z7v5MeAy24NEU2bT",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "zoaeioue",
            "date": "Jan 24, 2022",
            "title": "",
            "comment_content": "Recombinant DNA technology and the birth of Genentech<br />Putting biology into a bottle: a Case Study on Insulin<br />Engineering of Magic Bullets – Monoclonal Antibodies<br />Immunotherapy: a revolution against cancer<br />Evolution of vaccines<br />Case studies in the modern vaccine development <br />Nucleic acids as therapeutics<br />Supporting Technology: Delivery of Therapeutics<br />Case studies in drug delivery business<br />Tissue engineering: organs from a shelf<br />Case studies in regenerative medicines<br />Enabling technology: Directed evolution<br />Intellectual property and regulations<br />Financing research and managing development<br /><br />Actually can treat as no business thing I think. Can understand a bit with DSE bio knowledge.",
            "comment_teaching": "Lessons a bit boring.<br />Professor is willing to answer your questions after lesson. However, he did not reply my email.<br />They like to change the deadline dates without noticing students immediately although they usually make the deadlines later.",
            "comment_grading": "Class participation (5%): no attendance, few iprs questions for the first few lessons, must attend one library workshop<br /><br />Homework (10%): All will be graded but only the best 2 will be counted towards final grade<br />I got all full marks and the mean is as follow:<br />Hw1: 47.7/60 <br />hw2: 73.6/80 <br />hw3: 34.6/40 <br /><br />Class project (40%): Project plan + Final Report: 25%; Presentation: 15%, no grading released<br /><br />Final Exam (45%): open book, allow to search the internet, no grading released too<br /><br />I think the grading is quite good, but the key of getting A range is final.<br />My grading: B+",
            "comment_workload": "Low workload. Don't have anything to do before mid term periods. Homework have a week time, but you can finish it in a few hours. <br /><br />Homework (originally said have 4 but turns out only have 3): easy to get full marks even as a business students, just search the internet and some from the lecture notes. Unlimited attempt so you can just guess the mc questions.<br /><br />Class projects: Find good group mates, better from different schools. You do not need to show your face for the short video presentation. <br /><br />Final: I do not have any questions that I am sure. All the answers copied from google. Maybe other discipline students can do it much better. One of my friend got A range.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tj2nv2JzrEk7CIMMN3bZYKcWpt3ebxjJ",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ChloeYu",
            "date": "Jan 24, 2022",
            "title": "HAPPY CLASS",
            "comment_content": "It includes a lot of interesting topics related biotech. No matter what major are you studying, you can understand it. And also 3 guest speakers will come and you can interact with them.",
            "comment_teaching": "Professor SUN is cute!! (but sometimes it is a little bit boring)<br />Anyway the professor is kind.",
            "comment_grading": "good grading!!<br />The final is an open book exam so you can google.<br />And the homework is easy and unlimited attempts.",
            "comment_workload": "slight!<br />one group project<br />3 homework<br />no midterm<br />one final(but open-book so you do not need to prepare for a long time)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VNwZffhKaxuG9rZdDkDtLTuy4uKhm0b3",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Moco",
            "date": "Jan 22, 2022",
            "title": "",
            "comment_content": "For the biotechnology part, it was quite easy to understand if you studied biology in secondary school. Each topic is elaborated with some examples. <br />Topics covered: <br />Recombinant DNA technology, Monoclonal Antibodies, Cancer immunotherapy, Vaccination, Gene therapies, Delivery of New Therapeutics, Regenerative medicine, Protein engineering and directed evolution, Brain Science.<br /><br />Business part: <br />Mainly talking about elements needed for a biotech company to run. I had totally no background with business and I didn't really understand it. But they are not that important compared to the biotech part.",
            "comment_teaching": "Students can choose to attend both zoom our face to face lectures.<br />To be honest, lectures were quite boring. And it was still fine to only look at the ppt. <br />The prof's accent was a little bit hard to listen and his vioce made me want to fall asleep especially when he turned the light dim in the lecture hall.",
            "comment_grading": "Homework 1: 57.6/60<br />Homework 2: 80/80<br />Homework 3: 35/40<br /><br />Didn't got the marks for project and final exam.<br /><br />Final grade: B+",
            "comment_workload": "There were a few iPRS quiz during lectures to record students' attendence. Questions asked were easy.<br /><br />Homework x3:<br />Read a passge and do the question. Make use of Google to find information about the asked questions and that will be fine. It took about one and a half hours for each homework. <br /><br />Project: <br />Midterm proposal, presentaion video with ppt, final report<br />We took most of the time having meetings to discuss the topic and what to include in the project, However, there was not much work for each person. Just do some research.<br /><br />Final exam:<br />Open book. We could bring our laptops and iPads and use common search engines such as Google. <br />If you are familiar with all the topics covered and know how to search for useful informations online, the exam will not be too hard. You may find the need to read through academic papers quickly so reading skills are required.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ev2L6usNzbutwTXXzQe0h4pWHd8DxlLB",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "whyeonis",
            "date": "Jan 21, 2022",
            "title": "",
            "comment_content": "有興趣biotech嘅人會覺得幾fun",
            "comment_teaching": "感覺好friendly會開下玩笑<br />但真係聽唔落大陸口音 差唔多走晒<br />final可以帶iPad laptop入去search資料睇返啲ppt<br />係咁抄就得 所以平時上唔上堂基本無所謂",
            "comment_grading": "只要project做得ok起碼會有B<br />但hw嗰啲有得上網睇 自己整合下再copy<br />final會有5條大題 分題會有幾條MC <br />可以Google所以唔使溫書 溫書係無用的<br />做唔晒唔識做好正常 早走去食個早餐算",
            "comment_workload": "無乜野做 得幾份功課同group project<br />全部都係Google下就會有嘅資料 <br />最重要一定要揾ssci人carry個group project",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cpIhwx9svOtldVOCPBd3KYJZVO5PP5Ol",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kaisa",
            "date": "Jan 05, 2022",
            "title": "Great course.",
            "comment_content": "Easy for mainland student who takes biology in high school. Much included. Businness part is not hard and NOT INCLUDED IN FINAL EXAM. Almost no need to attend lectures because you can understand everything by reading ppt. BUT you have to go for attendance...<br />But the knowledge has not much relation to exam questions since they are too difficult and professional. You know the way to solve these biotechnology problem but you never know details required in certain situation. So you need to search. Searching ability is really important.<br /><br />This course will allow students to:<br /><br />- explain the basic technical concepts, scientific and engineering principles in medical biotechnology<br /><br />- describe the opportunities and challenges facing the industry<br /><br />- analyze the potential and impact of modern biotechnology on human health and economy<br /><br />- identify the key components contributing to biotechnology of commercial interest - research topics in biotechnology and its current development - communicate technical ideas more effectively<br /><br />- develop the ability to work in a team with complementary strengths",
            "comment_teaching": "Clear English, accent is not hard to understand, but really slow, I always fall asleep.<br />Fei is a great prof and devoted. He tried to make us active. Guest lectures are also great. I love Angela.",
            "comment_grading": "Class participation: 5% (iprs questions, I remember twice. MUST attend library workshop and record your attendance)<br />Homework: 10% (All will be graded but only the best 2 will be counted towards final grade)<br />Class project: 40% (Project plan + Final Report: 25%; Presentation: 15%)<br />Final Exam (open book): 45%<br />Project plan=midterm,so we do not have a midterm exam.<br /><br />Grading is fair? I think. Teammates are important. You MUST have reliable scie teammates or you will die at technology part of final report. Busi part is actually also challenging for yr1 sbm student I think. But by searching and paying effort you will also do it well. First homework is disaster, but just get used to it. You can discuss with friends. But one thing is interesting: you may find your answers similair to your friends' but you get different score because of details. Hard to find the rule for grading, I did not succeed to conclude one till the end of sem.<br /><br />My grade:<br />Homework<br />40/40(mean 47.74) <br />80/80(mean73.58)<br />35/40(mean 34.59)<br />Project plan&amp;presentation(recording mode, not face to face) not released<br />Final not released.<br />Final score A-. In my team there is A, A-, B+. So you also need to work hard for final exam.",
            "comment_workload": "Light for the whole sem except before Project plan and Presentation. You need to work for a long time for these parts. Final exam is late(Dec 18) so you have enough time to review(Although I think reviewing does not help much). Final report's ddl is on Dec 20. Enough time to do.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "X2tKCmdRsq7BqSb8lkZkC66ClkhoWIm4",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "GuAlan",
            "date": "Jan 05, 2022",
            "title": "",
            "comment_content": "主要講下 biotech 發展，好多野都係吹水，好多內容其實唔使理，你只要大約明白個原理就得，因為其實佢講藥廠好多，但得個知字就得，全部功課考試之類都同d野無關",
            "comment_teaching": "其實我覺得佢講得幾好，但吹水成份真係多，主要可能係要你自己思考一下呢個行業未來發展，基本上無乜人上堂，上左幾堂之後得返1/3左右，因為係天地堂問題，我都走左好多",
            "comment_grading": "最後羅左B+，最後係open book+ google，無錯，係可以用電腦google，所以一定一定要帶notebook，ipad之類野去做，考試好似係5題long question ，3個鐘，基本上note 無用，如果唔帶野去google 成份野係唔知做緊乜，真心係鬥快google 同抄落去，我以為錯曬，頹左，因為唔知自己答左乜，但最後出來係B+<br /><br />另外仲有個participate分，唔知點計，中間係有workshop 要去，可能去左就直接滿分<br /><br />雖然我呢科係major ，但呢科同時都係common core ，可以一戰",
            "comment_workload": "得幾份功課，workload 極細，我係2021 fall讀，功課得3份，最後選2份最好高，功課無限交，隨便做都一定有9成，我係全部都滿分，功課大約1個鐘就做完，得2~3題 short question<br /><br />主要問題係group project，5人一組，最後20頁左右，唔太難，中間要交一次proposal仲有一次presen，但個presen 係交movie 就得，5分鐘，最後由TA問問題",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EzyVGEJIscoPbZeFJslQUH1ayXOjZoJs",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jerrylo",
            "date": "Aug 23, 2021",
            "title": "",
            "comment_content": "80%bio野<br />20%busi野<br />ppt主要都係睇過就算，基本唔考<br />內容幾有趣",
            "comment_teaching": "有小小口音，上堂幾有趣<br />prof幾好人",
            "comment_grading": "hw同project全部高過mean唔小<br />但係最後B+左，派grade有啲奇怪",
            "comment_workload": "workload唔算好大，幾份hw加上project<br />個project TA會俾意見，但多數靠自己選材<br />唔計attendance，但係guest lecture一定要參與",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "a42CVAqkRKNl5tyW5TWmi2dNrBEGZaCM",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Siyoon",
            "date": "May 01, 2021",
            "title": "",
            "comment_content": "It's a course that integrates biotechnology and business. <br /><br />On the syllabus, it says that no prior knowledge is required, but if you don't have any biology/chemistry background, this course might be difficult. <br /><br />1. Course outline Overview of current biotechnology. <br />2. Recombinant&nbsp;&nbsp;DNA technology and the birth of Genentech<br />3. Putting biology into a bottle<br />4. Engineering of Magic Bullets – Monoclonal Antibodies<br />5. Evolution of vaccines and their societal impact<br />6. Case studies in the development of vaccines and social medicines <br />7. Nucleic acids as vaccines and therapeutics <br />8. Enabling Technology: DNA microarray<br />9. Delivery of New Therapeutics<br />10. Case studies in drug delivery business<br />11. Tissue engineering: organs from a shelf?<br />12. Case studies in regenerative medicines<br />13. Enabling technology:Directed evolution<br />14. Funding research and managing development <br />15. Intellectual property and regulations<br />16. Biotechnology development in China and Asia",
            "comment_teaching": "The lectures were satisfactory. It's mostly the professor reading the powerpoint and adding some extra explanations.&nbsp;&nbsp;The professor invited three guest lecturers to expand on the topic.",
            "comment_grading": "Class participation: 5%<br />Homework: 10% (All will be graded but only the 3 best will be counted towards final grade)<br />Class project: 40% (Project plan + Final Report: 25%; Presentation: 15%)<br />Final Exam (Online proctored, open-book) : 45%<br /><br />No Midterm exam. <br />Final exam was open-book. Mostly essay questions, similar to the ones given for homework. <br /><br />Exams weren't very difficult. <br />For projects, we had to write a business plan about starting a new company and proposing a new technology. <br /><br />Grading is okay.",
            "comment_workload": "For projects, we had to write a business plan about starting a new company and proposing a new technology. <br /><br />This was time-consuming and required a lot of effort. <br /><br />Other than that, the course workload was manageable.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "osdf4ZODIKkMsh2GT3p775JoDF7pR4Rt",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kangdrew",
            "date": "Jan 26, 2021",
            "title": "EZ A grade course",
            "comment_content": "Basics on biotechnology and business. <br />The course involves various presentations from fellow professors and alumni -&gt; none appears in the final exam so don't go.",
            "comment_teaching": "The videos are given, so watch with 2x speed. <br />Easy to follow, only basics.",
            "comment_grading": "There's a proposal to submit instead of midterm exam.<br />1 Project (consisting of 4-5 people) which involves 5 min presentation and 20 page-long report. <br />1 Final Exam <br />4 HW with unlimited attempts-&gt; work with friends. <br />some attendance (iprs, meeting with a librarian) <br /><br />The final exam was really easy, and Professor does not require much for the project as it is a first-year course. <br />Final grade: A",
            "comment_workload": "The only workload is the project. <br />Make sure you pick the teammates who do their own stuff.<br />I was lucky to be involved with colleagues with business majors, who were very nice. She did most of the job.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DMxcSqK3fpSeiGSaYeJnBSPW6wdyinQK",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lizzie25",
            "date": "Jan 23, 2021",
            "title": "",
            "comment_content": "The journey was really impressive. We had to submit business proposal as group project. It contained group report and group presentation. Also, there were a few lectures of graduates or other professors who are actually working in biotechnology start-up firms. There were about 5 assignments which each contain about 3 questions and one question was like writing a short essay. All of them were given a short journal or an article which was out of our syllabus. There is also one optional bonus assignment. There is no midterm exam but only final exam. The final was open book and open source exam. Since group project takes much time and effort, your group mates are really really important. There are participation marks as well. Overall, I regret my decision of taking this course..",
            "comment_teaching": "It is quite boring.. I just did not listen to him..",
            "comment_grading": "Not bad. I did not expect but got B+. I messed up at assignments and attendance..",
            "comment_workload": "I think that it is a little bit heavy for common core lecture. It has assignments, group presentation, group report, and final exam.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "E3j5b0MKI1BqEUSSXcScihwBJhukmwXt",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Q20",
            "date": "Jan 22, 2021",
            "title": "Grading based on your brain power",
            "comment_content": "Although some content about biological concepts overlaps with the HKDSE Biology syllabus e.g. Antibodies, DNA replication, etc, most of them especially the technology &amp; business part are not covered in previous studies. But I still believe that it would be favorable for DSE biology students. For pure business students not recommended as the exam and homework contents are about 45% biology concepts 45% biotech and 10% business.",
            "comment_teaching": "Boring(slept on every lesson) but clear accent. <br />I do not think it is a must to attend lessons though. Except for concepts of biotechnology, those business examples which occupy a large portion of his teaching are not really examined in the exam. <br /><br />Other than his teaching, he is really a nice and cute professor who always awaits and is willing to answer any questions from students.",
            "comment_grading": "Not remember much but about<br />45% Final Exam<br />40% The f***ing group project <br />10% Homework done by yourself<br />and the remainings are class performance. No attendance requirement. <br /><br />The final exam is easy if you get used to the homework's question mode and have a brain to surf the net analyzing what to copy back on your canvas.<br /><br />The group project's grade depends on you and your groupmates' brain too.<br /><br />My result: B+, with not much hard work put on the final exam, rubbish project done by me and my rubbish groupmates believed not even deserve a B and full marks for all homework.",
            "comment_workload": "There were 3-4 homework throughout the semester each includes a short essay question(regarding assigned reading material, you can just directly search the answer on google though).&nbsp;&nbsp;<br /><br />For the group project, it is about setting up a biotech company which resolves sociatic problem. You will have to submit a summary, final report and do a group presentation for your idea. Again, the final project occupies 40% of the marks. So just to remind you finding trustable groupmates, otherwise those brainless mates will push you into hell no matter how you put effort into your own stuff.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QKwhgQQatOjE1gJLRPZfotlIPtrNHrMv",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yuko Poon",
            "date": "Jan 20, 2021",
            "title": "靚Grade！",
            "comment_content": "同中學bio學過嘅biotech差唔多，business嘢幾common sense",
            "comment_teaching": "跟ppt讀，但係好慢，有時有guest speaker",
            "comment_grading": "冇上足都做到功課、考到final，最後幾靚grade，如果上多兩堂/睇多少少ppt可能仲靚grade",
            "comment_workload": "3份asm，第4份optional<br />一個grp project，要自己搵grpmate/真係冇嘅話佢會assign你入組<br />一個final，類似asm咁答，多數long q，幾題mc，有幾題同asm一樣",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sFWnx8J6yg3cIU54zOiL3frC2uF9xTNR",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Julieimida",
            "date": "Jan 19, 2021",
            "title": "difficult for students with no Biology background",
            "comment_content": "Most of the content is biology related, which introduces current biotechnology such as recombinant DNA and also covers real-life application such as how to scale up production. This course covers a little part of business, most of which might be common sense for business students. For instance, the professor has covered about concepts of patent, fund raising.<br /><br />Group project asks students to prepare a start up of biotechnology, so it's better to have business students for financial planning and other business aspects.",
            "comment_teaching": "Though Professor SUN is knowledgeable, his teaching is terrible. He often used biology terminology in class, which I had no idea about as a business student not taking Biology class in high school. In short, I felt like he was creating an oral essay in class.",
            "comment_grading": "To my surprise, the grading is fine. But the time I spent on final review is indescribably painful.<br /><br />Class participation 5% (no attendance but library workshop is required)<br />Homework: 10% (4 homework but 3 best counted)<br />Class Project: 40% (Project Plan+Final Report 25%+Presentation 15%)<br />Final exam: 45% (open book)",
            "comment_workload": "Heavy.<br />3 assignments are so difficult for me. You have to completely understand what professor has taught in class.<br />Group project is not easy but fruitful. I learnt a lot from the samples provided.<br />Final exam is fair where some of the questions are similar to assignments.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kk7nAexYgiQ5We3wcFvlu2P1MEUxh7G8",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "zn",
            "date": "Jan 17, 2021",
            "title": "good grade, easy and light workload course",
            "comment_content": "biotech 7: business 3<br />(business very little)<br />all of the content is in the ppt, literally<br /><br />i took dse bio, level 4, used to hate it (didnt take biotech elective)<br />quite easy to catch up by the ppt, didnt attend 90% of lecture, didnt go back to recording<br /><br />final exam open book, exactly like hw<br />no attendance i think",
            "comment_teaching": "funny accent but will get used to it<br />really responsive and willing to answer your questions<br />i think ta are helpful but i didnt find them for help",
            "comment_grading": "nice, but get good teammates and choose a easier topic for it, dont dig too deep or else you gonna bury yourself into it<br /><br />first hw is disaster <br />others all above mean<br />project and final exam grade are not released<br /><br />final grade b+<br />(didnt study much, just read the slides and know/get familiar where the main points are, then you may go back to it during final)",
            "comment_workload": "light light and light<br /><br />make sure you start your project early, disucss and divide workload at an early stage, so you can finish bit by bit, not all of the stuff at the end.<br /><br />no midterm test but will have midterm project draft submission, so you need your main ideas and stuff before it.<br /><br />make sure to do hw nice and properly, because it is crucial for the exam. (better make a copy of your answer so you can refer to it during the final exam / ask people who get good grades in hw)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "u9EwiIyC3b5GSwxYXMdUPOv5id3e3oo9",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "arianator",
            "date": "Jan 14, 2021",
            "title": "A bit hard for year 1, but super good grade",
            "comment_content": "90%biotech<br />10%business<br />Very hard for students who didn't study biology before.",
            "comment_teaching": "Read the ppt by yourself is more efficient as the lectures are quite boring. but the teacher is kind and is willing to answer your questions after every lecture.",
            "comment_grading": "It has always been LLLLLLLLEEEEEEEENNNNNGGGGG grade.<br />I didn't revise much but still get a B.",
            "comment_workload": "Normal. 4hw (1 is optional), 1 group project<br />It is hard to think a topic for the project as the TA always ban the idea...As for other stuff, google can help you, so it is ok.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zJ4NjCyxDKQkZNnG053hvCth0c8oVM1F",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sonic12",
            "date": "Dec 30, 2020",
            "title": "CENG1600 Review",
            "comment_content": "1. Overview of current biotechnology<br /><br />2. Recombinant DNA technology and the birth of Genentech<br /><br />3. Putting biology into a bottle<br /><br />4,5. Engineering of Magic Bullets - Monoclonal Antibodies<br /><br />6. Evolution of vaccines and their social impact<br /><br />7. Case studies in the development of vaccines and social medicines<br /><br />8,9,10,11. Nucleic acids as vaccines and therapeutics<br /><br />12. Enabling Technology: DNA microarray<br /><br />13. Delivery of New Therapeutics<br /><br />14. Case studies in drug delivery business<br /><br />15. Tissue engineering: organs from a shelf<br /><br />16.&nbsp;&nbsp;Case studies in regenerative medicines<br /><br />17. Enabling Technology: Directed Evolution<br /><br />18. Funding research and managing development<br /><br />19. Intellectual property and regulations<br /><br />20. Biotechnology development in China and Asia<br /><br />-Additional guest lecture from other professors or TAs<br />-Library Workshop<br />-Presentation",
            "comment_teaching": "Professor Sun's English is OK and after class, he answers questions from students. If you don't understand some concepts, just ask the professor after class or send an email to the professor or TA.<br /><br />Also, if you need some help with a group project, don't hesitate to contact him. He is keen to help and may give your team some golden advice.",
            "comment_grading": "Homework (10%)<br />-read the given article related to biotechnology and answer the questions( questions can be multiple choice or descriptive problem)<br />-4 homework, one is optional (only 3 best is counted to your grade)<br />-homework can have limited or unlimited attempts<br /><br />Class project (40%)<br />- main topic is to set a company related to biotech based in China or HK<br />-need to submit a project plan, presentation slides, and final report<br />Final exam (45%)<br />- open-book exam<br />- some questions were MCQ and the majority of questions were descriptive problems<br /><br />Class Participation(5%)<br /><br />HW1(49/60) (mean: 49.6)<br />HW2(70/80) (mean: 68.0)<br />HW3(40/40) (mean: 34.7)<br />HW4(30/30) (mean: 23.9)<br /><br />The grade for the class project and the final exam is not released<br /><br />Overall: A+",
            "comment_workload": "Homework<br />: May need to take some time to read the article and understand concepts. The articles' contents may be a bit more challenging than those from lectures. Read thoroughly and search the web to understand and solidify your logic.<br /><br />Class Project<br />: It's good to have final year students in your group if you can. As they are more experienced, they might help you to give shape to a plan and more professional touch on the final report and presentation. Also, forming a team with members from various departments may also helpful.<br />&quot;Some tips for project topic&quot;<br />- don't do typical therapeutics thing, everyone also has the same or similar ideas(ex- COVID19)<br />-in the real-world, many biotech ideas can be unsubstantial or may take a very long time for approval. Choose a topic and plan that is viable and realistic. (e.g. a tech that can be applied to the world asap)<br /><br />Final Exam<br />: Just make sure to understand the concepts from the class and write down the details on your notes or iPad, whatever you are convenient. Read them occasionally when you have time. No much burden for the finals if you write and understand the concepts well. Also, performing well in your homework can be helpful for your exam.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JLw8ZpaVtK63z38JUnfFk3UIqIzTApUt",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Angry bird",
            "date": "Dec 30, 2020",
            "title": "",
            "comment_content": "its half biotech half business.",
            "comment_teaching": "I almost did not attend any lessons as its 9am. I watched the lecture videos and he's ok. Sometimes he assumes everyone has a basic knowledge about biotech. If u revise a bit, it is easy to understand.",
            "comment_grading": "Take this course!!!<br />I am a business student. Altho i don't know much about the content, the exam is open-booked and pretty straight forward as in questions are pretty similar to HWs.<br /><br />At the end, got an A.",
            "comment_workload": "one project. (if you have source, thats nice)<br />4 HWs, pick the best 3. <br />one final.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TZvsT2tLYCn1yedgwpL5Sfm5utgJbbWG",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Crysvan",
            "date": "Feb 21, 2020",
            "title": "",
            "comment_content": "70% biotech <br />30% business <br />Since this course doesn't have the midterm exam, all the lecture material (18 lecture notes, around 40 slides per one) will be tested in the final exam simultaneously. So it would be hard for non-bio students to fully comprehend the content. But for the science student, it should be easy to handle.",
            "comment_teaching": "No Comment <br />Since skipped all the lectures<br />The lecture is quite boring for students with a science background",
            "comment_grading": "Nice Grade<br />Class participation: 5% (iprs)<br />Homework: 15% (3 out of 4)<br />(Best 3 will be counted towards the final grade)<br />Class project: 30% <br />(Midterm Project plan + Final Report)<br />Final Exam: 50%<br /><br />My results<br />Homework 1: 41/60 (Mean: 43.9)<br />Homework 2: 55/80 (Mean: 68)<br />Homework 3: 37/40 (Mean: 27)<br />Homework 4: Did not do <br />Final exam: 81/100&nbsp;&nbsp;(Mean: 81.8)<br />Final report: 91/100 (Mean: 89.1)<br /><br />Final grade: B+<br />Therefore, Mean = B ~ B+",
            "comment_workload": "iprs<br />library workshop<br />4 online homework (3 compulsory + 1 optional)<br />(The homework required to read the given article and answer the question (MC &amp; long question) )<br />Group project: <br />midterm proposal (5 pages)<br />poster present (cancelled) <br />final report (20 pages)<br />Final exam<br />No mid-term exam<br /><br />Workload mainly comes from the group project, especially the 20 pages final report. Hence, good and responsible groupmate is necessary for this course.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DyC00IhxGEsCs9UhuqJMIdPK3o8aY5bE",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "huski",
            "date": "Jan 28, 2020",
            "title": "Good grade!!",
            "comment_content": "Biotechnology and Its Business Opportunities<br /><br />Topics:<br />1. Overview of current biotechnology<br />2. Recombinant DNA technology and the birth of Genentech<br />3. Putting biology into a bottle<br />4. Engineering of Magic Bullets - Monoclonal Antibodies<br />5. Evolution of vaccines and their societal impact<br />6. Case studies in the development of vaccines and social medicines<br />7. Nucleic acids as vaccines and therapeutics<br />8. Enabling Technology: DNA microarray<br />9. Delivery of New Therapeutics<br />10. Case studies in drug delivery business<br />11. Tissue engineering: organs from a shelf?<br />12. Case studies in regenerative medicines<br />13. Enabling technology: Directed evolution<br />14. Funding research and managing development<br />15. Intellectual property and regulations<br />16. Biotechnology development in China and Asia<br /><br />There were 2-3 guest lectures in between regular lectures.<br /><br />The content is easy for business students as well.<br /><br />The project is to create a biotech company and its product.",
            "comment_teaching": "Professor Sun's English is acceptable. You will get sleepy during lectures, but he answers our questions patiently. He is also aware of the presence of business students so he teaches slowly and actively asks us questions about the concepts during lectures.<br /><br />There are many helpful TAs in this course, they answer your questions and give advice for your project. <br /><br />You will mostly contact these TAs if you have questions about this course, it is hard to find professor.",
            "comment_grading": "Class participation: 5% (PRS)<br />Homework: 10%<br />(Best 3 counted towards final grade)<br />Class project: 40%<br />(Project plan + Final report: 25%; Presentation: 15%)<br />Final Exam: 45%<br /><br />My results:<br />Homework 1: 36/60 (mean:43.9)<br />Homework 2: 68/80 (mean:60)<br />Homework 3: Did not do (mean:27/40)<br />Homework 4: Did not do (optional)<br />Final exam: 83/100 (mean:81.8)<br />Final report: 91/100 (mean:89.1)<br /><br />I didn't attend 80% of the lectures<br />Final grade: B+<br /><br />As you can see, I did not put much effort but still a good grade.",
            "comment_workload": "You will need to do the following:<br />1) Attend a library workshop<br />2) 4-5 Online assignments<br />3) Mid-term proposal (5 pages)<br />4) Final report (20 pages)<br />5) Sales pitch of your product (Presentation)<br />6) Make a poster for your product<br />7) Final exam<br /><br />As you can see, the workload seems high. But the assignments are weekly to bi-weekly, and these are short and easy. You can finish these within half an hour.<br /><br />For the group project, it is important for you to find good group mates. You can pick your own but if you fail to do so you will be randomly assigned.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EVL17fW7a78b4CD7vZHZmGyHVMi9lgBA",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JHLI",
            "date": "Jan 03, 2020",
            "title": "",
            "comment_content": "The content is interesting if you are into biology and is a bit challenging for those who haven't studied biology before. About 80% of the content is about biotechnology and only 20% is about business. If you are a business student, be careful to consider whether you can catch up with the content.<br /><br />Course outline <br />Overview of current biotechnology. <br />Recombinant&nbsp;&nbsp;DNA technology and the birth of Genentech<br />Engineering of Magic Bullets – Monoclonal Antibodies<br />Evolution of vaccines and their societal impact<br />Case studies in the development of vaccines and social medicines <br />Nucleic acids as vaccines and therapeutics <br />Nucleic acids as vaccines and therapeutics <br />Delivery of New Therapeutics<br />Case studies in drug delivery business<br />Tissue engineering: organs from a shelf?<br />Case studies in regenerative medicines<br />Enabling technology: Directed evolution<br />Funding research and managing development <br />Intellectual property and regulations",
            "comment_teaching": "He is a nice professor who is willing to answer questions and extend deadlines for students to finish the assignments. However, his tone when teaching is extremely boring and this always makes me fall asleep halfway during the lectures.",
            "comment_grading": "The grade hasn't come out yet. But the previous students said this course's grade is quite good.<br /><br />Class participation: 5%<br />Homework: 10% <br />Class project: 40% <br />Final Exam: 45%",
            "comment_workload": "The workload is average as there is only 3-4 homework. The homework may require you to read an article or draw knowledge from previous lessons to answer some MCs, fill in the blanks and short essay questions about proposing a biotechnology to solve a problem.<br /><br />The heaviest workload is from the project that accounts for 40% of the grade. You need to write 5 pages for the proposal and 20 pages for the final report. Make sure you choose some responsible teammates, otherwise you will have a lot of work to do.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gGs4U98Vb8ElDIp6TG1L4RntTfOoW7JY",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DJ22",
            "date": "Jan 23, 2019",
            "title": "",
            "comment_content": "Mostly biotechnology, hardly any business aspects included other than patenting processes etc.&nbsp;&nbsp;<br />Easy for Biotechnology majors content wise but can be challenging for someone without background.&nbsp;&nbsp;<br />Includes topics like stem cells, Gene therapy, RNA therapy, Drugs, Recmbinant DNA tech, patenting and some guest lectures from Hong Kong science park etc.",
            "comment_teaching": "Boring. He just read from lecture slides and went on about random boring stuff at times. A good teacher who can improve. If you go to him personally to ask doubts he can be resourceful",
            "comment_grading": "Surprising, when you might expect decent marks you may not get them and vice versa. <br />Overall- A",
            "comment_workload": "Gets tough towards the end of the semester with the poster presentation and the final exam. No mid term.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "992I8G8PuqJ5mbL8Wz1npEx2gXWKRC08",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cloao",
            "date": "Jan 20, 2019",
            "title": "surprisingly good grade",
            "comment_content": "introductory overview of biotechnology from both technical and business perspectives which include lots of data, a brief introduction to many biotech companies.<br />quite hard for those who have not took bio in the high school<br /><br />from the syllabus: <br />The course is divided into three main parts. <br />1) Roots of biotechnology. The technological development of some classical biotechnology products are highlighted, in the context of the opportunities captured by the companies that are considered biotechnology giants nowadays in US. <br /><br />2) Growth of supporting technologies and the emergence of new start-up companies.<br /><br />3) Discusses the key elements for building biotechnology companies and biotechnology clusters, with emphasis on the increasingly significant role of universities in technology transfer, and provides a glimpse of the biotechnology picture in China and the surrounding regions.",
            "comment_teaching": "well, I can tell he paid efforts in teaching but Isorry that I always got distracted cuz his voice is so boring and got a confusing accent ...<br />But he put almost everything on his powerpoint, fair enough?",
            "comment_grading": "overall: A-<br /><br />missed all the iPRS because he didn't do it regularly.<br />one of the groupmates free-rided and I didn't appear on the presentation.<br />count the best 3 homework (which is all 85 marks)<br />revise the final exams on the last 3 days, I think the grading is fair.<br /><br />-<br />Class participation: 5%-<br />iPRS + a library workshop that counts attendance<br /><br />Homework: 10% (All will be graded but only the 3 best will be counted towards final grade)<br /><br />Class project: 40% (Project plan + Final Report: 25%; Poster Presentation: 15%)<br /><br />Final Exam: 45%",
            "comment_workload": "homework *4<br />poster<br />group project<br />presentation<br />final<br />(no midterm)<br /><br />workload mainly come from group project which has to type a 20 pages report on your biotech invention, need poster presentation as well.<br />4 homework that most of the answer can be found online so you don't really need to read the long passage provided.<br />BUT<br />all the homework need to submit to his office in person, no online submisson lolllllll",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "C81GxRC39qR68M0zOzvAqpwHDUnVV20m",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Amy_wkk",
            "date": "Aug 24, 2018",
            "title": "",
            "comment_content": "Biotech and business stuff. <br /><br />Most lessons introduce different kinds of biotechnology, for example, recombinant DNA technology, stem cell, nRNA, immunotherapy, vaccination...<br />Only last few lessons about business and regulation stuff.<br /><br />A bit hard for those who have no background on Biology and Biotechnology in Secondary School.<br /><br />Interesting to me. Recommand.",
            "comment_teaching": "Professor is nice and passionate on teaching. However, I cannot get used to his accent. So I got sleepy in most of his lessons. <br /><br />I like his ppt--informative.",
            "comment_grading": "I got B+. This is quite surprising to me. <br />The professor is quite nice and give me good grade.<br /><br />Work hard for your project+ good groupmates = good grade<br /><br />Oh, there are PRS questions in random lessons. Better not skip the lessons or get a friend to help you.",
            "comment_workload": "Not high.<br />The main worload comes from the group project+presentation. <br />Utilise the ppt from professor for your project!<br />Just be smart and find good groupmates from different schools and willing to spend a few hours on the&nbsp;&nbsp;research for your topic.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DXH1NNSgXfpMHpV3YlLMuAJugS3zqqP9",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "E.H.  丁一赫",
            "date": "Jun 09, 2018",
            "title": "",
            "comment_content": "Interesting teaching materials for year one students and those who interested in Biotech.<br />Lots of examples about the application of the biotechnology in medicine, agriculture, and etc.",
            "comment_teaching": "The instructor is passionate. He explained the course materials in detail. Inviting experts for students to explore the biotechnology in Hong Kong.",
            "comment_grading": "Effort = Grade.<br />The grade for group project might not matched to the above statement.",
            "comment_workload": "Proper amount of workload. Usually need 1 hrs for assignment.<br />The workload in group project is at right amount if the group mates separate the job equally.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yjspwmF113lxyXJzsLhlpqAwShpKGV4m",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Vivian_coco",
            "date": "Jan 25, 2018",
            "title": "",
            "comment_content": "内容biotech部分與business部分7比三分配，ppt内容非常豐富，有些專有名詞要提前查下聽課會更好。老師講的很用心，課上總會放一些視頻，幫助理解一些生物知識。之後還會有一些guest speech内容多樣。課上講的東西也還蠻有趣，内容很充實，可以學到東西。",
            "comment_teaching": "老師教的挺用心的，英語口音很可愛。非常耐心，課後問問題解答都十分詳細。去office找他也是面帶笑容，脾氣很好。課上講的東西也還蠻有趣，内容很充實。",
            "comment_grading": "龜的話，homework ，group project ，final都要看。group project比重挺大，所以隊友挺重要的。最好在project之前就把隊組好，不然就會隨機分配。沒有midterm，final會有一些術語，可能會對閲讀造成一些影響。",
            "comment_workload": "每兩周有一個homework，midterm的時候要交project plan，final的時候要交proposal，做pre3，workload在final的時間感覺還是有點大的。但是沒有midterm還是蠻好的。",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BNuLD6QP7rCPGXYDmL6GQnTCdSbNrunV",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yayyyy",
            "date": "Jan 25, 2018",
            "title": "",
            "comment_content": "Mostly Biotech Stuff (I found it quite difficult given my bio background in high school) despite being rather difficult for a non-science student, I have really learnt a lot more on different biotech developments and found it quite interesting. <br /><br />Very little business content (mainly on patents, fundings, exit strategies) Very easy to understand.",
            "comment_teaching": "Professor has an accent that may be quite hard to understand at first, but the more you listen to him you will get used to his accent and it will be acceptable. He tried to explain really simple biology concepts at first since he assumed more than half of the class don't have biology background, but after a few classes started to speed up and I didn't understand what he was saying and had to watch lecture videos again to understand. But he and his TAs provide a lot of assistance after class and are very willing to help.",
            "comment_grading": "I would say very good. <br /><br />With my limited biology background and not fully understanding all of the contents, my final grade was higher than I expected. <br /><br />There will be homework which you can take reference from the internet and powerpoint slides. The finals was quite easy with some of the questions being exactly the same as the homework. The project is also very important so better find good group mates.",
            "comment_workload": "Very high I must say. <br /><br />There will be iprs during lessons sometimes so better attend them, but there will be lecture videos on canvas too. Homework takes around a few hours per week to complete. The project is the most time-consuming being 20 pages long. Finals is alright.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "akx62ssrZeOtZIRu5H7WrmKRcJrswYx2",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wslee",
            "date": "Jan 25, 2018",
            "title": "",
            "comment_content": "The content is quite broad. It covers many biotechnological applications and the theories behind the applications. It also covers the parts related to business, like capturing funds. Year 1-2 students might find it hard to understand all the topics in a short time.",
            "comment_teaching": "The lecturer tried to explain the concepts in a clear and fun way, but it didnt turn out to be like that during lectures. However, he and also the TA were very helpful.",
            "comment_grading": "The final exam mainly focused on some of the main topics mentioned repeatedly as well as assignments. So if you study the assignments well, you will do just fine in the exam. <br />The project also matters as it contributes ~50% of the course grade.",
            "comment_workload": "The workload is quite huge. <br />Attendance is important, as there will be iPRS in most of the lectures.<br />There are 3 assignments in total. <br />Also, there will be a project, including a presentation, contributing ~50% of the course grade.<br />And lastly, there will be a final exam, which the result will lead to the last 50% of the grade.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QxpR4JmjwVx3MHwojoix9tczZk68JHrk",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jinker",
            "date": "Jan 24, 2018",
            "title": "",
            "comment_content": "The content is not hard. What you need to know will all be in the lecture powerpoint but there is a lot of information you have to remember for exam. <br />Lecture videos are provided ,but very lately. <br /><br />The exam questions are not so difficult if you study hard and remember all the stuff. There will be long questions and they are basically the same with the assignments. <br /><br />Answers of the assignments, however take quite a moment to be searched on internet.",
            "comment_teaching": "Really boring and quite hard to understand what Sun Fei said. <br />Better watch lecture videos.",
            "comment_grading": "The grading is good. Just finish all the assignments, PRS questions, project reports.",
            "comment_workload": "Quite a lot of stuff to do, project , proposal report, final report and presentations. However Sun Fei and TAs help a lot too.<br />It is better if you have friends study together and you can be partners.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hoRUJcjRILDk7wkhRtQ77R85MwvcTH5W",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cynnie",
            "date": "Jan 22, 2018",
            "title": "",
            "comment_content": "The whole course is mostly about biotechnology, just little business, so if you haven't studied biology in your high school, please do not take this course or you will feel like an illiterate in the class. P.S. I haven't studied biology in high school, I have no freaking idea what is ATGC even, I literally dun understand a thing and I needa do some research in class immediately or after class if I have time. The course will teach you all the biotech knowledge you need in your life if you are a business student, trust me. So if you are not really interested in biotechnology, do not take this course, or it will make you feel like an idiot.",
            "comment_teaching": "The professor is very nice, he always answers students' question after class. His accent may be a little bit hard to hear sometimes since he mispronounces some words. However, 80% of the things he said in class are not included in the powerpoint so if you dun understand biology, you will have a hard time, like a really hard time. No worries though, most of the extra stuffs he said are not tested so if you just want good grade, you can still consider this class.<br />But in general, he is a good professor I will say.",
            "comment_grading": "Absolutely good grading, I got a B+ despite knowing nothing in the course. So business students if you got nothing good to register, try this maybe it can help pull up your grade.",
            "comment_workload": "The workload is absolutely heavy. The assignments are really hard to me since I don't understand a thing. But the real bad part is the project, which is nearly half of the course grade. You need to do a 20-page proposal, this is such a hell and if you are unfortunate enough to meet some freeriders like my case, I can just say God bless mate.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9x3FpNRPxJ2rtYkeyDDrDFNl6HWhFcsU",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JosephDing",
            "date": "Jan 16, 2018",
            "title": "Mostly biotech, little business",
            "comment_content": "It is an interesting course and helpful course if you wish to have more knowledge on the bio-technology and its trending now. But it could turn out to be pretty hard to follow for someone who major in business and have little knowledge on biology. Don't let the name fool you, it's CENG at the end of the day.",
            "comment_teaching": "Brilliant professor. He makes biotech easy to understand. Pretty strong Chinese accent but understandable.",
            "comment_grading": "The final exam is really difficult. You really have to have some decent knowledge about biology, there is no way to get pass this exam which takes 40% of the total grade with little work.",
            "comment_workload": "The usual homework takes about 2 hr each weeks. If you are working on the group project, then you may spend some time depending on how much work you take within the group.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hG7RWEyNFdq13kl8KISFsp6GmzDQEt0Q",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JJJJJJJ",
            "date": "Jan 09, 2018",
            "title": "有bio background不妨考慮",
            "comment_content": "內容偏biotech多, 係後尾先講多左同business有關既野, 大致上唔難理解, lecture notes算係簡單易明同有條理. 本身讀Bio既人會比較容易handle.",
            "comment_teaching": "有咩唔明問PROF. 佢都好樂意答你, 而且樂意討論. 而且佢唔會照ppt咁讀, 講解部分都清晰易明. 不過有咩問題最好落堂問, send email未必立即答到你.",
            "comment_grading": "其實真係幾好grade, 因為我都係考之前一日先開始溫同背. 而且佢份卷係assignment d friend, 係mc比較難, 但long questions只要有認真做assignment係唔可能唔識. <br /><br />assignments: 10% (only the best 3 will be counted)<br />project: 40%<br />PRS: 5%<br />Final exam: 45%",
            "comment_workload": "workload算係中上, assignment total 有5份, 但只count best 3. 唔算太難做.<br />project有再分proposal, presentation 同final report. 其實都幾趕, final report 20頁左右. project 反而比較著重business, 所以分工個方面要小心D. 最主要都係有好groupmates同定好題目, 題目要求自己念. 想做得好D可能就要花多小小時間睇下papers 同有關biotech既新聞.<br />無mid-term.<br />PRS唔係堂堂有.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mPbycY3e90ojBeJMbWuP00Lhw7MSyjOy",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cathleen",
            "date": "Dec 02, 2017",
            "title": "",
            "comment_content": "This course gives an introductory overview of biotechnology from both technical and business perspectives. It surveys the current landscape of medical biotechnology, discusses the significant milestones in this field, describes underlying scientific concepts, and emphasizes the impact of innovations on human health and economy. Case studies are used to illustrate the opportunities and limitations in current and future biotechnology development. In addition, experts from industry and academia are invited to give guest lectures on course-related topics.<br />The course is divided into three main parts. Part I talks about the roots of biotechnology. The technological development of some classical biotechnology products are highlighted, in the context of the opportunities captured by the companies that are considered biotechnology giants nowadays in US. Part II presents the growth of supporting technologies and the emergence of new start-up companies. Part III discusses the key elements for building biotechnology companies and biotechnology clusters, with emphasis on the increasingly significant role of universities in technology transfer, and provides a glimpse of the biotechnology picture in China and the surrounding regions.<br />This course will allow students to:<br /><br />- explain the basic technical concepts, scientific and engineering principles in medical biotechnology<br /><br />- describe the opportunities and challenges facing the industry<br /><br />- analyze the potential and impact of modern biotechnology on human health and economy<br /><br />- identify the key components contributing to biotechnology of commercial interest - research topics in biotechnology and its current development - communicate technical ideas more effectively<br /><br />- develop the ability to work in a team with complementary strengths<br />對於冇BIO底人簡直堂堂都發夢....",
            "comment_teaching": "感覺上有用心教<br />問問題都肯答<br />但上堂都幾催眠<br />尤其對於冇bio底人<br />我堂堂都唔知做乜",
            "comment_grading": "Class participation: 5%<br /><br />- PRS (Personal Response System) assessment: open-ended questions and quizzes about key concepts from readings and lectures<br /><br />- Class forum: posting questions online to invited speakers on Canvas<br /><br />Homework: 10% (All will be graded but only the 3 best will be counted towards final grade)<br />Class project: 40% (- Project plan: 10% - Presentation: 15% - Final Report: 15%)<br />Final Exam: 45%<br /><br />對於LIFS,BIOTECH major學生可以刷grade",
            "comment_workload": "有5份功課<br />一份project，要20+頁<br />冇midterm",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "e0lYYpHhWs5bYBMVRNLsoptmINKJvl30",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ameen",
            "date": "Jan 03, 2023",
            "title": "easy course",
            "comment_content": "The course primarily covers the technical and business perspectives of the biotechnology industry. It is an introductory course, so the content is not really covered in depth. However, the instructor does cover a significant range of topics that are relevant to the field of public health and medicine. Although it is meant to be a blend of business and biotech concepts, in my view the course was a little biased towards the bio aspects. This was a bit redundant for me since I'm a BIEN major, but learning the business fundamentals of biotech startups was certainly interesting to me. Also, the guest lectures were quite informative.",
            "comment_teaching": "I would say that Fei Sun is the not best professor when it comes to content delivery. I found it kind of difficult to focus during the lectures since his speech is monotonous and the pace of the class was quite slow. This is why I decided to skip lessons after a certain point in the semester and just study the lecture slides independently. Although this is not the best way to study, it somewhat worked for this course since the final was open-book (including Google) and attendance is required only for the library workshop that takes place around the start of sem.",
            "comment_grading": "Class participation: 5% (library workshop)<br />Homework: 10% (top 2/3 assignments)<br />Class project: 40% [midterm project plan (6-page PPT) + final project plan (17-page PPT): 25%; presentation: 15%]<br />Final exam: 45% (open-book + Google)<br /><br />The grading of the course was not too bad, although the group project evidently constitutes a huge chunk of your grade. In my case, all but one of my teammates were free-riders. This was very frustrating for me since I had to work on their parts as well at the last-minute. However, I contacted the TA to ensure that my contribution is accounted for and does not lead to a bad grade. <br /><br />The final exam is entirely composed of long-answer essay questions predominantly related to the biotech aspects of the course, along with a few business-related ones. Since we are allowed to access Google during the exam, it shouldn't be too difficult to do it right as long as you manage your time optimally to ensure that you answer all questions.<br /><br />There are three assignments in this course - which are mostly fill-in-the-blanks, multiple-choice, and long-answer questions. As there are multiple attempts possible for the assignments, you can essentially reverse-engineer the answers to questions that are instantly graded. This will give you time to work on the extended response questions, which are obviously graded from a slightly subjective standpoint.<br /><br />The class participation only involves scanning your HKUST student ID card twice during the library workshop, which is conducted around week 4-5 of the semester. Although some lectures have IPRS quizzes, these don't count for participation. <br /><br />my scores:<br /><br />Class participation: 5/5 <br />Homework: 10/10 <br />Class project: unknown<br />Final exam: unknown<br /><br />Final grade: A-",
            "comment_workload": "The course has a fairly low workload. It is very manageable since you can afford to skip almost all the lectures and still somehow get an A range. The assignments should ideally not take longer than one-hour each.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ubLYInTD9UtXEDXkZUM9ecQVDE1b3BEf",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "oscarlamhah",
            "date": "Nov 28, 2022",
            "title": "best course",
            "comment_content": "like what others mentioned<br />70%biotech<br />30%business<br />其實biotech啲野完全唔識as a business student<br />Business野都唔算好深<br />個PowerPoint其實好多版都係啲biotech例子<br />睇下就算 唔係幾考",
            "comment_teaching": "tbh skip most of the classes. a bit of accent but not hard to catch.（因為佢講野真係有啲悶<br />自己睇notes仲好",
            "comment_grading": "超級超級靚grade！<br />As a year1 student knowing nothing <br />complete the hw and do normal at the final",
            "comment_workload": "light as long as you have a good team. hard for having a good topic to do the project though",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RgPtYxsEjxeDSinq5JpRuHDdbkRqW7Up",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tiffanycyl",
            "date": "Mar 16, 2022",
            "title": "Quite Good Grade",
            "comment_content": "Content is interesting and science students are at an advantage for taking this course. For non-science students, you'd better study harder for the content so you can still contribute to the group project. Otherwise, you could do not much in this course.",
            "comment_teaching": "",
            "comment_grading": "The grading is quite good. I got B in this course even though I dont pay much effort in this course.",
            "comment_workload": "The workload is quite heavy for me since there are two freeriders in my group ( 5 people a group) and I am the only science student. Therefore, I am responsible for quite a large part for the project.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cvbiIw9v1HhlBtK1OLu3lOmianibkrUz",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": ";))",
            "date": "Jan 04, 2021",
            "title": "",
            "comment_content": "Mostly about biotech, including stuff like recombinant DNA technology, gene therapy, etc.",
            "comment_teaching": "Since it is 9 am lesson so I did not pay much attention during lessons. I think rewatch the lecture videos + do research on the topics will be fine.",
            "comment_grading": "Homework: 10% (total 4 but 3 best will be counted towards final grade)<br />- MC + essay<br />- Articles will be given<br />Class project: 40% (Project plan + Final Report: 25%; Presentation: 15%) <br />Final Exam (Online and open-book) : 45%<br />- Mostly essay questions <br /><br />The grading is pretty nice~",
            "comment_workload": "I am a business student with no biological background, so I spent lots of time on doing research to understand how each biotechnology works and also for the group project.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jCjUDwKZLWvmb7EygR1H4G5LA7XBO3uH",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "grizelyt",
            "date": "Dec 30, 2020",
            "title": "靚grade",
            "comment_content": "Plz refer to others.<br />80% biotech<br />20% business <br />最好有biotech底 如果唔係幾難跟到<br />基本上如果你係lifs major唔使點溫，啲嘢其他major course cover曬，溫翻busi部分就夠",
            "comment_teaching": "算幾清楚嘅ppt，考試淨係溫ppt都夠用。<br />英文唔使講，大部分prof都係差唔多level",
            "comment_grading": "1.功課睇你答中point，本人英文差都可以滿分<br />2.project最緊要有busi嘅frd carry，prof係project方面算幾重視business plan，寫得詳細d會更好<br />3.final溫熟d ppt同功課<br /><br />prof冇出final同project分，直接出grade，最後A+",
            "comment_workload": "算輕鬆，每次出功課先去做都ok，通常功課內容會出翻個個禮拜岩岩教完個課，copy重點都夠攞滿分，Project presentable就ok了，final似HW格式咁出",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DbBDbq7hKNu6siAVBigrswKEjNJOmEXo",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "A-LA",
            "date": "Feb 28, 2020",
            "title": "",
            "comment_content": "Basically about biotech, small proportion of business stuff.<br />Drug delivery<br />Vaccines<br />Gene therapy<br />Monoclonal antibodies<br />DNA microarray<br />Tissue engineering<br />Intellectual property and regulations",
            "comment_teaching": "A bit boring.<br />You can simply read his ppt and you will be fine.<br />He leaves 5 minutes for you to ask questions, so the class is only 75 minutes instead of 80.",
            "comment_grading": "Very good grading.<br />The final test is okay, not very difficult if you have revised his ppt.&nbsp;&nbsp;And the exam is mainly about biotech and no business part I think.<br />Some questions even appeared in previous homework.",
            "comment_workload": "4 assignments (1 optional):<br />The articles you have to read in order to complete the assignments are very demanding.&nbsp;&nbsp;I spent hours and hours to read them and still couldn't understand most of the content.&nbsp;&nbsp;During class, the content is quite easy and you don't have to dig deep.&nbsp;&nbsp;But for the assignments, they are in a completely different level compare to content during class.&nbsp;&nbsp;Just remember you can always ask TA for anything.&nbsp;&nbsp;They are very keen to help.<br />one group project (choose any topic you want, as long as it is easy to do research and it is approved by the TA):<br />It could be fun if you choose a topic that you are interested in.<br />Some iPRS questions:<br />not much and not difficult",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EYfFwR8LzvGd2bijtIDtkcunr4afthtu",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "鐫仔",
            "date": "Mar 05, 2019",
            "title": "good grade",
            "comment_content": "many slides and notes, but you don't need to memorize all of them. some contents are interesting but some not. if you are&nbsp;&nbsp;a science student, you should handle it very well as it just cover the easy part of other course in science. If you are studying biotechnology, you have to take this course. It's pretty easy for biotech-student since it just simply mention a few techniques of biotechnology and won't go deeply. you should get a good grade with no effort.",
            "comment_teaching": "fair, prof is passionate. the presentation is quite fun.",
            "comment_grading": "very good. largely depend on the project!! can get a good grade even though you only get half marks in final",
            "comment_workload": "really low, only need to hand in some homework and prepare the project.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QSqAvBExGse3mWUwPlimTt8SSURSXn6a",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "JAM",
            "date": "Jun 19, 2017",
            "title": "",
            "comment_content": "Content covers mainly about biotechnology in the drug industry. Some of the topics include genome engineering, drug delivery, vaccines, etc. There are a lot of biological terms, so perhaps having a strong background in biology will be an advantage. I don't recommend this course for someone who is taking this for the sake of fulfilling common core, though.",
            "comment_teaching": "Sometimes, it was hard for me to understand what the professor was saying because of his thick accent. He sometimes popped up questions to students, but only few student responded usually.",
            "comment_grading": "I'd say the grading was quite lenient. Midterm mean was 51.4, final mean was around 50ish. Project mean was 68. I didn't do well on midterm, but was above average in project and final, but still got an A-.",
            "comment_workload": "Individual proposal of applying biotechnology in society and the business opportunities of the company. 20 pages, double spaced.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "alkzIJZ68S2b9UxAsedXqNY1V75sq3KX",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 19,
                    "name": "SUN, Fei",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "lyl",
            "date": "Jan 09, 2020",
            "title": "CENG 1600",
            "comment_content": "Topics:<br />Overview of current biotechnology<br />Recombinant&nbsp;&nbsp;DNA technology and the birth of Genentech<br />Putting biology into a bottle<br />Engineering of Magic Bullets – Monoclonal Antibodies<br />Evolution of vaccines and their societal impact<br />Case studies in the development of vaccines and social medicines <br />Nucleic acids as vaccines and therapeutics <br />Enabling Technology: DNA microarray<br />Delivery of New Therapeutics<br />Tissue engineering: organs from a shelf?<br />Case studies in regenerative medicines<br />Enabling technology:Directed evolution<br />Funding research and managing development<br />Intellectual property and regulations",
            "comment_teaching": "I just attended a few lessons at all.<br />The lessons are quite boring.",
            "comment_grading": "The grading policy for this course has changed in this semester.<br />- Library Workshop: 5% <br />- Assignments: 10% <br />- Project: 40% <br />- Final Examination: 45%",
            "comment_workload": "Very heavy.<br />Mainly comes from the project which consists of 20 pages.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}