{
    "error": false,
    "course": {
        "id": 56,
        "subject": "CENG",
        "code": "4670",
        "name": "Pharmaceutical Engineering",
        "description": "Survey of western pharmaceuticals; pharmaceutical processing technologies including reactions and separations; enantiomers and chiral separations; polymorphs and solid state pharmaceuticals; pharmaceutical dosage forms including tablets, capsules and transdermal patches; traditional Chinese medicine processing.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2030,
            1830,
            1630,
            1530,
            1430
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"CHEM\" data-code=\"1010\" href=\"/review/CHEM1010\" target=\"_blank\">CHEM 1010</a> OR <a class=\"course-link\" data-subject=\"CHEM\" data-code=\"1020\" href=\"/review/CHEM1020\" target=\"_blank\">CHEM 1020</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.33,
        "rating_teaching": 3.67,
        "rating_grading": 4,
        "rating_workload": 3.67,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 37,
                "name": "LAKERVELD, Richard",
                "count": 3
            },
            {
                "id": 38,
                "name": "TONG, Henry Hoi Yee",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "6kqADTpBenHFN2bIqzkrhNzIA7GOklfQ",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                },
                {
                    "id": 38,
                    "name": "TONG, Henry Hoi Yee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ahahahahahaha",
            "date": "Jun 01, 2021",
            "title": "Learnt a lot",
            "comment_content": "Introduction: <br />General principles of drug action and Overview of pharmaceutical industry <br /><br />Active Pharmaceutical Ingredients (APIs) - Impact, discovery, synthesis, environment, safety <br /><br />Solid-state properties of APIs <br /><br />Industrial formation and purification of APIs <br /><br />Future trends in API manufacturing <br /><br />Solutions, emulsions, and creams <br /><br />Guest Lecture: Prof. Aviva Chow, Department of Pharmacology and Pharmacy, Li Ka Shing Faculty of Medicine, The University of Hong Kong. Topic: Dosage form design <br /><br />Controlled-release formulations <br /><br />Guest Lecture: Prof. Henry H.Y. Tong (Professor &amp; Program Coordinator, Division of Biomedical Sciences, Macao Polytechnic Institute). Topic: 1) Overview of pharmaceutical industry in Pearl-river-delta, 2) Research and development in generic pharmaceuticals, 3) Drug Development Process<br /><br />(Most interesting topic should be the modified release of drugs)",
            "comment_teaching": "Professor Richard Lakerveld is a really nice professor. He responds to email quickly and answers very detailedly. He is more of a CENG guy and he works with crystallization for years. He elaborates quite a lot in class. Although sometimes his low monotone makes it harder to concentrate, the lecture video helps you recap what he said in class, and they're pretty useful. Both guest lectures by Prof. Henry and Prof. Aviva are both interesting. They both have experience in pharmaceutical industry, one works in formulation of drugs in Jacobson and one works as a consultant for investment in pharma industry. All three professors are helpful and knowledgeable and I did learnt a lot in this course. The TA is also very helpful and he responds quickly and in details. He also marks our assignments and HW pretty quick.",
            "comment_grading": "CENG grading is always fair. As long as you put in effort the grading won't be too bad. <br />Homework (40%, 10% each)<br />Midterm (20%, 50% MC, 50% LQ)<br />Final (40%, 65% MC, 35% LQ)<br /><br />Homework: 90.5 (Mean: 75.22 , SD: ~6.8 for each HW)<br />Midterm:<br />MC: 7/13 (Mean: 6.56, SD: 2.1, Median: 6.5)<br />LQ: 12/13 (Mean: 10.79, SD: 2.4, Median: 11.5)<br />Final: <br />MC: 57.5/65 (Mean: 43.16, SD: 10.8, Median: 46.3)<br />LQ: 24/32 (Mean: 19.03, SD: 7.7, Median: 19.0)<br /><br />Overall &lt;1 sd above and I got A. I would say it's pretty good since I expected more of an A- than A. CBE always has good grading though so I think this is fair ahaha.",
            "comment_workload": "Four homework, one midterm and one final. For 4 HW, you are expected to read three papers and answer his questions. The papers are not too long plus you don't actually need to read the whole paper, just focus on the parts that can help you answer the questions. Exams are split into MCs and long questions. MCs can be tricky, so make sure you have clear concepts in mind (as long as you pay attention in class, you should be fine). Long questions are calculations and explanations and they're not difficult.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oco81on1o1pCHzoiSExbsFSbejMnw4mo",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JJLL",
            "date": "Dec 21, 2022",
            "title": "Pharmaceutical Engineering -- A good introductory course",
            "comment_content": "Introduction to Pharmaceutical Engineering:<br /><br />L1: Introduction (Difficulty: Easy)<br />Some basic stuff, such as pharmacodynamics, pharmacokinetics, agonists and antagonists, controversies in generic drugs<br /><br />L2: APIs (Difficulty: Easy)<br />Synthesis pathways, Semenov diagram, Green chemistry (concepts: Atom economy, E-factor)<br /><br />L3: Crystals formation (Difficulty: Easy-Normal)<br />Emphasis on the stable and metastable forms of crystal, Hydrated crystals, co-crystals, crystal shape and size, and introduction of crystal moments and statistics (treating like a dimensional analysis)<br /><br />L4: Industrial formation and separation of API powders<br />(Difficulty: Easy)<br />Explaining mechanisms of primary and secondary nucleation, industrial and laboratory techniques dealing with crystals, including filtration, drying (+ freeze drying)<br /><br />L5: PAT technologies and Continuous Pharmaceutical Manufacturing (CPM) (Difficulty: Easy-Normal)<br />Introduction to PAT technologies, emphasis on feedback method, advantages in CPM <br /><br />Guest Lecture from Aviva: API Manufacturing (Normal)<br />Oral tablets, Excipients: Filler, Wet/Dry Binder, Disintegrants, Lubricants, Glidants, Manufacturing process: Dry+ Wet granulation, Tablet compression, Coating. Problems encountered in manufacturing.<br /><br />L6: Continue from the Aviva lecture (Easy)<br />Further explanation of the precautions of manufacturing pathway, focusing on random mixing.<br /><br />L7: Liquid dosage form (Easy)<br />Solution: The difference in micelles and cyclodextrin<br />Emulsion: Emulsifiers measurement and mechanisms<br /><br />L8: Controlled release (Easy)<br />Basics on controlled release, introduction to specialized&nbsp;&nbsp;release method (hydrophilic gels, hydrophobic matrix, membrane-coated release, osmotic pump)<br /><br />Overall exciting and new course content",
            "comment_teaching": "Although Professor LAKERVELD's teaching is a bit boring, he always thoughtfully answers students' questions. He encouraged people to understand the textbook concepts, which was quite helpful to me. I think he can include more case studies in manufacturing to broaden students' horizons on complicated manufacturing processes.<br /><br />Aviva, the guest lecturer, is pretty great at teaching. He used some jokes while teaching complex manufacturing concepts.",
            "comment_grading": "The mid-term quiz covers Ch 1-5, while the final exam covers everything.<br /><br />Mid-term quiz: (20%)<br />Me: 17.2/20, Average: 11.17/20<br />Final exam: (50%)<br />Me: 42.5/50, Average: 32.13/50<br /><br />Three assignments: (30%) <br />Me: 54.5/60 <br />Result: A+<br /><br />Although it is not a challenging course overall, students need to PAY CLOSE ATTENTION to the lectures since the most tricky and difficult questions require an excellent understanding of the lecture materials, especially the mid-term exam.<br /><br />Both exams involve MCQs and Open discussion questions. MCQs are for tricky concepts, while open discussion questions focus on long calculations and concepts easier than the MCOs. Beware: Long calculation questions require a great understanding of materials rather than memorizing the formulae.",
            "comment_workload": "Light to medium workload.<br /><br />For the mid-term quiz, you pay attention to lecture materials and revise them. It would be alright.<br /><br />For the final exam, you must memorize and understand all the functions of excipients. Other things would be similar to the mid-term quiz.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8PYhfWxOwj5AbeXAsObzHrk3G3GM6l71",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 37,
                    "name": "LAKERVELD, Richard",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "RIbtSU",
            "date": "Dec 21, 2022",
            "title": "Bad Grade engineering course",
            "comment_content": "Introduction:<br />General principles of drug action and Overview of the pharmaceutical industry<br /><br />Active Pharmaceutical Ingredients (APIs) - Impact, discovery, synthesis, environment, safety<br /><br />Solid-state properties of APIs<br /><br />Industrial formation and purification of APIs<br /><br />Future trends in API manufacturing<br /><br />Solutions, emulsions, and creams<br /><br />Control and modified release",
            "comment_teaching": "He speaks English in a monotone and in a fast pace and you always find it hard to catch up with what he says. His ppt is not quite useful he expands a lot during the lecture. Also, he assumed you have taken previous ceng courses about separation process (CENG3210 and CENG 2220) before taking this course so the prerequisite of chem1020 is totally fake. The content has much to deal with engineering stuff. If you are Biotech major, I think you better not take this course as an elective. 90% content is about engineering.",
            "comment_grading": "The grade is not good.<br />Homework (30%, 10% each)<br />Midterm 20%<br />Final 50%<br /><br />HW: 23/30 (Mean: 22/30)<br />Midterm: 12/20 (Mean: 11.3/20)<br />Final: 33/50 (Mean: 32/50)<br /><br />Grade: B-<br />Overall above mean but only B-, sad",
            "comment_workload": "3 hw, 1 midterm, 1 final<br />For hw, papers are given for you to read and answer his questions. The papers are in an engineering/manufacturing perspective.<br />A lot of calculation questions are involved. If you are not good at maths, dun registers for this course.<br /><br />He said things in guest lectures will be tested but it is fake. None of the stuff is tested.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        }
    ],
    "composer": []
}