{
    "error": false,
    "course": {
        "id": 72,
        "subject": "CHEM",
        "code": "2110",
        "name": "Organic Chemistry I",
        "description": "This is the first part of the organic chemistry course series designed for students taking a major/minor in chemistry/life science under the four-year degree. Topics covered include: structure and bonding; regio-, geometric, and stereoisomerism; polar and radical reactions of alkenes and alkynes; substitution and elimination reactions; synthesis and reactions of alcohols and epoxides.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"CHEM\" data-code=\"1030\" href=\"/review/CHEM1030\" target=\"_blank\">CHEM 1030</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"CHEM\" data-code=\"2111\" href=\"/review/CHEM2111\" target=\"_blank\">CHEM 2111</a>",
        "rating_content": 3.46,
        "rating_teaching": 2.9,
        "rating_grading": 3.88,
        "rating_workload": 3.46,
        "review_count": 50,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 43,
                "name": "TONG, Rongbiao",
                "count": 47
            },
            {
                "id": 1570,
                "name": "NAKAMURA, Hugh",
                "count": 6
            }
        ]
    },
    "reviews": [
        {
            "hash": "mft49Y0ciFs6dIvjbcCyf8mARV4KuGUC",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "石頭",
            "date": "Dec 10, 2018",
            "title": "DO BELIEVE THE COMMENTS(not the good ones, its a trap！ )",
            "comment_content": "before mid term it was normal stuff like everyone expected, wont say it again as it is already in other comments.<br /><br />after mid term, its like hell.<br /><br />like 60 reactions with specific catalyst/reagent/solvent taught in a month<br /><br />for bcb students, you have to choose analytical or organic chem as your major requirement,&nbsp;&nbsp;DO NOT choose this course<br /><br />you will regret<br /><br />for bcb who choose this course<br />be happy<br />this will be the last required chem in your UG",
            "comment_teaching": "I attended all lectures before mid term, but once only afterwards.<br /><br />i think only NDS can understand his language fully and i cant really understand him much even as a local.<br /><br />He talks real fast and skipping everything important, and spend plenty of time talking about shit which you wont understand if you dont understand those important concepts, and end up by saying this wont be in the exam. <br /><br />i think the only use of the notes are the questions and exercises, which you can solve if you understand the mechanism<br /><br />He said there wont be any lecture videos(its a 0930 class) but actually he recorded it and sent it to us 2 days before the exam,&nbsp;&nbsp;which is definitely not fucking helpful.(probably someone asked him to send them out, the only explaination is the person never attended his lectures, i believe he wont watch the second after finishing one)",
            "comment_grading": "actually i worte this right after the final so i dont know yet.<br /><br />the final is 3 hrs and half of the class left at 2hr, other half sleeping or scratching reactions from the bottom of their memory.<br />hand full of them looked like they have taken drugs&nbsp;&nbsp;and addicted to chemistry already.<br />i see the future .<br /> <br />40%mid term<br />60%final<br /><br />the mean of the final is about 40%, making me wonder &quot;why this course/ professor is not fired yet?&quot;<br /><br />previous statistics show if you get overall 50% you probably get a B or so<br /><br />actually its not about the grades, when the mean has failed i really think UST should think about deleting the course/ change the material/ change the instructor, students cant learn much from the course, it felt like DSE style of learning to me.<br />i got a B , and the mean has failed as expected,<br />good luck",
            "comment_workload": "nothing to talk about mid term, just normal.<br />if you want to get a decent grade for final, I STRRRRONGly advise you to have one whole week for revision.<br /><br />I didnt give a shit to the course after midterm and i found myself miserable with the god damn lecture notes, and i have 3 days left before exam. <br /><br />3 whole days (like 10hrs a day) for me to understand all the chapters(of course inclucing time for me to search for the appropriate way to lean) and few hours to do little examples, i cant do the inhumane last 30 marks which you have to synthesize something through dozens of reactions.<br /><br />actually i borrowed the old version text book(new one is only for 2HR reservation)&nbsp;&nbsp;and and i saw there were a few more left which i think explains why the mean for the finals had failed.<br /><br />youtube is the savior, learnt everything about Sn1,2 and E1,2 from there. and maybe i should learn everything from there in the first place.<br /><br />P.S. i noticed some comments with quite good ratings <br />THOSE ARE ILLUSIONS<br /> as they were written right after the mid term,not the finals, be careful.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 23,
            "vote_count": 25,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LFwd33Ux8tRweR7crP2IiF4KE5MCIebo",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "shaolinmonk",
            "date": "Jan 07, 2020",
            "title": "Good cure for insomnia",
            "comment_content": "Same as other posts. Way too much useless things condensed into a semester. No interesting content at all.",
            "comment_teaching": "Prof Tong's voice has been able to cure my insomnia, every class I am able to fall asleep within minutes. Teaching is done way too fast and without enough explanation. No lecture video is provided but it would be useless anyways.",
            "comment_grading": "Midterm 55%<br />Final 45%<br /><br />Midterm relatively alright compared to final. Even though final is take home it is impossible to finish. Basically just pages and pages of reactions and mechanism questions. <br />Almost impossible to get good grade if you have other rigourous courses and you want to have a life.",
            "comment_workload": "Lectures are kinda like introduction only, you spend way too much time outside of class watching videos and self-reading to learn the material. Impossible to complete all the recommended questions if you are studying hard for other courses too.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 10,
            "vote_count": 10,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nlTT3UTLR3kX9SwmTB5GWpII9OQt6VZN",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "EZgene",
            "date": "Nov 22, 2021",
            "title": "Terrible course, course of death, and a hostile trash talking instructor",
            "comment_content": "There is so much content, and he teaches way too fast, lot to remember lot to learn, you need to remember every type of reaction like how to convert a alkene to epoxide, Sn1 Sn2 E1 E2 with all the gibberish mix in, his accent is shit so you will have trouble even understand what is taught the first place. Just read the materials to know what will be tested and then watch videos related to the topic, you will have better luck this way",
            "comment_teaching": "A disaster, I can't get through his accent, I need y4to replay the recordings a few times just to understand him, what's worse is that his Zoom recording have no pointer so you will have no idea which carbon or Hydrogen he is pointing at, and he claims that is for being fair to people who attend live lecture, but that means no way to revise effectively, he also fucked me over for being a SEN slow learner, he even called me a shame, after refusing to provide me with my needs, I recommend Crashcourse chemistry, it covers everything, and the tutor actually knows how to teach properly without trash talking https://www.youtube.com/watch?v=bSMx0NS0XfY&amp;list=PL8dPuuaLjXtONguuhLdVmq0HTKS0jksS4",
            "comment_grading": "Nothing out of normal, a disaster for me, he goes out of his way to personally fuck my grades over as I asked him to provide better recording for revision, and he blames me for not remembering everything within the lecture, if you got a bad grade, don't worry it isn't your fault, it is this course and the professor, and did I mentioned how he fuck the SEN over in final? The test actual start time is 8:30am and he told the SEN the start time is 7:45, and we end up waiting an entire hour in front of the locked room till the janitor let us and the TA in at 8:00am, not to mention how I had to wake up 4am to get to UST at 7, he live in the dorm and have no consideration for those who don't.<br />Update: I got a B from my own hard work, props to me and screw you RongBiao",
            "comment_workload": "No home work, you need to revise and learn everything yourself, while having such an inadequate professor who can barely provide you with any help, he won't reply to emails so don't bother, it will take him a few days just to reply, and when he do it is nothing good, usually a &quot;watch Zoom RCV&quot; or &quot;Why didn't you listen in live lecture&quot; go ask question on Reddit homework forum, the answers may not be good but at least you will get something",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iVBmHRmh8dtoeuvvfI3495MHZJe2HjZX",
            "semester": "2014-15 Summer",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Hyeri",
            "date": "Aug 05, 2015",
            "title": "",
            "comment_content": "呢個course除左reaction就係reaction，midterm前你會覺得d野好似好淺咁，alkane 加 小量<br />alkene，大部份都應該會識，主要都係stereochemistry<br /><br />midterm之後就另一個世界，主要講synthesis，除左出現過嘅alkane同alkene之外，alkyne halides alcohol ester都紛紛登場，絕對可以教成個sem嘅野，唔駛半個sem教晒<br /><br />Final難度唔係講笑，mc仲算正常，第二part開始各種reaction，寫product，reactant，condition，最吹漲係會no reaction....之後Long Q, mechanism 多step reaction，只要你夠creative....",
            "comment_teaching": "雖然係LT上堂，不過真係坐中間都聽唔清佢講咩，之後就去左自修...",
            "comment_grading": "Chem 靚grade course真係唔多，呢科mean大約 C+ to B-",
            "comment_workload": "冇assignment唔代表workload唔重，真係太多reaction要背，要溫熟只能不斷做exercise，可以去拉把借書，answer有另外一本，記得借埋，new version 數量有限，要借就早d",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "w1dZnHcb6SvcVixIvI66udK5uyoIvcmj",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Sonic12",
            "date": "Dec 26, 2021",
            "title": "Miserable and Irresponsible Course",
            "comment_content": "LT-1:&nbsp;&nbsp;Introduction to Organic Chemistry, Structure<br />LT-2:&nbsp;&nbsp;&nbsp;Atomic Bonding<br />LT-3/4: Polar Covalent Bonds, Lewis Acids and bases<br />LT-5: Alkanes and their stereochemistry<br />LT-6: Cycloalkanes and their stereochemistry<br />LT-7/8: Stereochemistry at tetrahedral centers<br />LT-9/10: Overview of organic reaction<br />LT-11/12: Alkenes—structure and reactivity<br />---------------------Midterm exam -------------------------<br />LT-14/15: Alkenes—reaction and synthesis<br />LT-16/17: Alkyne—Introduction to Organic Synthesis<br />LT-18: Organic Halides<br />LT-19/20: Reactions of Alkyl halides <br />LT-21/22: Alcohol and Phenols<br />LT-23/24: LT-24/25: Ethers and Epoxide, Thiol and sulfides<br />LT-25: Organic Synthesis<br />------------------------Final Exam----------------------------<br />Typical coverage of contents in organic chemistry I. Some say it's too excessive but that's what all organic chem courses actually are.",
            "comment_teaching": "Lot's to say about teaching. I attended all the miserable lectures so I'm pretty sure that I am qualified to criticize the teaching problem.<br /><br />In a nutshell, just don't attend the lectures. The only things you need to do to prepare for the exams are self-study and suggested exercises at the end of each lecture slide.<br /><br />The professor just reads off the slides and wastes time in explaining his research (which no one cares about) and other unnecessary complex reactions which are not covered in the exams.<br /><br />In learning organic chemistry, a good explanation of the electron flow mechanism is a must. That's why an appropriate utilization of a whiteboard or pen is needed. However, this guy just points out the reaction mechanisms by his laser pointer, and turns out no one understands it.<br /><br />I know the &quot;professor&quot; Rongbiao Tong took charge of this course for a long time. However, considering a tone of bad reviews on ust space and witnessing that there's no improvement in his teaching, there can be only two possible conclusions.<br /><br />He does not willing to improve his teaching after all these years because of his stubbornness or he just sucks at teaching.<br /><br />A change in instructor to other faculty is required.",
            "comment_grading": "Midterm and Final exams, the percentage for each exam is not announced even at the end of the course.<br /><br />Midterm <br />low: 31, mean: 72.9, high: 115.5, std: 18.8<br />me: 97/120<br /><br />Final<br />low: 16, mean: 77.45, high: 175, std: 41.8<br />me: 135/180<br /><br />Overall: A<br /><br />Some say the grading is good but hey, just do the math. Even though I got an A grade if you see the std for exams, especially the final exam, distinction for students' performance is shit. <br /><br />A high std such as 41.8 means the students' performance is severely divided into two groups, ones who are good at org chem and the others who are not familiar with org chem. <br /><br />Which in turn, could mean high performers already know a lot about org chem even before they take this course, and low performers haven't learned anything about organic chemistry through this course.<br /><br />Overall, irresponsible teaching and irresponsible grading.",
            "comment_workload": "Only midterm and final exams. But considering the lectures do not provide you with any help for preparing for the exams, the workload could be quite high. <br /><br />If you are already familiar with organic chemistry that's fine, but if you are a newcomer, just like most of the students who attend this course, use youtube lecture videos. <br /><br />The difficulty of exams is almost similar to organic chem olympiads so brace yourself and prepare as much as you can to survive this course. <br /><br />Good Luck",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "l22XYwWazbk24lGOEeDJNXsZnklunG9W",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "綿綿頭上飛花",
            "date": "Dec 16, 2020",
            "title": "RIDICIOUS COURSE",
            "comment_content": "Unacceptable length of content. Before the midterm was actually still tolerable -- if you study the notes with the aid of youtube each week. After midterm, it becomes a whole new world which is like hell. With unlimited reactions for you to rememorize. And not to mention he put the most bulky part towards the end of the semester... Turns out skipping through 8x ppt page in a 80 mins zoom lecture due to the limited teaching week. My only question during the zoom classes: WHY ON THE EARTH CAN'T YOU CUT THE SYLLABUS??????????&nbsp;&nbsp;ITS RIDICIOUS.<br /> <br />Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />-----MIDTERM-------<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiols and Sulfides",
            "comment_teaching": "Don't expect that he can teach you anything. I basically self-studied with the aid of youtube. All he do during zoom lecture is pointing around the molecules. He can teach Stereochemistry (S/R configuration) by just pointing around the molecule. What can you expect???? <br /><br />Start your youtube self-study journey as early as possible. The usage of his lecture is actually informing me which slides are not required. He actually did put labels on not required slide at first. But stopped at I think LT19. Beware of that, as he has many not required slide mixed into his ppt.&nbsp;&nbsp;<br /><br />And towards the end of the semester, as he cannot finish the unreasonable length of ppt, he just start to skip (self-learning again). The last 4 ppt had more than 80 pages, he had to rush 1 of these per lecture. 80 mins with more than 80 pages. Anyone with a bit of math knowledge will know the outcome :)",
            "comment_grading": "Midterm: 40%<br />With an average of 75.4 marks. s.d. unknown<br /><br />Final:60%<br />No statistic can be given yet coz I wrote this review after the exam.<br /><br />***No past paper will be given.<br />All you have is the sample questions merged inside the ppt sides. And ofc, tones of textbook exercises which he will suggest at the end of each ppt.",
            "comment_workload": "Don't be happy to see that there are no assignment for this course. The workload is HUGE just to understand the reactions and know how to propose a 10-15 step mechanism for the final exam. Many self- practice is needed and all you have is the textbook exercise or other sources which you can get. Prof. only uploads 22 pdf. file as lecture notes.",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GuoP8IWiguLsnC7yBenIjuFLH4wYmQ5l",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "myosin",
            "date": "Jan 06, 2020",
            "title": "Prof is more lenient starting from 2019(not a bad grade course anymore)",
            "comment_content": "Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiols and Sulfides",
            "comment_teaching": "I cannot say prof is bad, but he teaches too fast. <br />There are too many new concepts.<br />I need to always go to the Youtube channel to self-study and to clarify those concepts.<br />Youtube is really useful. If you don't understand then go to youtube to learn. <br />My recommendation is to go to find lech4sci video.<br />You should also do exercise regularly from the book to clarify the concepts. Don't accumulate until the very last minute.",
            "comment_grading": "Starting from 2019, Prof lowers the difficulty of the course. It is no longer a challenging course for bcb and chem major students. So students can choose this course if you don't want to calculate anything.<br />But the first thing is that you must be diligent enough to do more exercise in order to get good grade.<br /><br />Midterm is very easy. You must be able to know how to answer all the question if you study hard enough.<br />He is quite lenient in midterm.<br />But because final is an open book take home exam, final exam is very difficult, which is impossible to complete in 4 hrs.<br /><br />Again think carefully before choosing this course. <br />But I think it is not a bad grade course anymore.<br />Study hard and you must get a good grade as prof lowers the difficulty already. It is now an alternative of an chem.<br /><br />My score:<br />Midterm: 110/120 (55%)<br />Final: 131.5/160 (45%)<br />Overall: 87%<br />Grade: A+",
            "comment_workload": "The workload is extremely high. <br />But there is almost no calculation in this course, which is a good thing for students who are bad in Maths.<br />Before midterm it is already very demanding, as there are 10 chapters, with each chapters have lots of things to memorise and learn, especially cyclohexane, <br />R&amp;S configuration.......<br />After midterm it is crazy, there are tonnes of chemical reactions needed to memorise. Although it is open book exam, you won't have enough time to find the appropriate reaction in the notes. <br />You need to spend more than 10 days before each exam for revision. But I think it really worths.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9qikk6XDkU8wLo9sEwC3XJoUIePhKkeg",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ym7135",
            "date": "Dec 27, 2017",
            "title": "I apologize in advance for the loss of your sanity if you have to take this",
            "comment_content": "Before mid-term:<br />Bonding, Lewis Acid and Bases, Alkanes, Cycloalkanes, isomerism, Alkene structure, organic reaction principals. <br /><br />After mid-term: <br />Alkenes, Alkynes, Organohalides, Alcohols, phenols, Ethers, Epoxide, Thiol, Sulphides <br /><br />So you may be looking at all this and wondering - I know some organic chemistry from highschool, this shouldn't be tooo hard, or how hard can this be?? Well I was just as naive as you, but in reality this course starts of really easy and just skyrockets, nothing makes any sense after the 4th or 5th chapter, and after the mid term you have to remember over 60 different reaction mechanisms, each of which has their unique condition and the mechanism drawings are too complicated, while almost all the reactions look the same. Whats worse is that you don't even understand the purpose of these reagents - like why this temperature, why this metal, why can't another metal be used? and even for the same reaction there may be 3 or 4 different conditions for them. Be expected to be able to recall some 500 pages of textbook which all look the same.<br /><br />There was far too much content for such a short amount of time, and issue is none of it makes sense, you are only memorising them for exams thats it. This is made worse with the &quot;teaching&quot; that goes with it, the professor is just like a museum exhibit person - 'this is the reaction that converts ... to ....' points at it for a few seconds and moves on, without actually elaborating??&nbsp;&nbsp;yet we need to know how to draw it. The textbook itself has sooo much details (the textbook is the lifesaver) yet the ppts had more details which he just skims through. He spends so much time describing his own lab research, which nobody is actually interested in, and ends up saying 'this is not needed for exams'. While there is a bunch of stuff which are just randomly there, do we need it or not? most of the ppt is actually just copied and pasted from the textbook, however excluding the important parts which actually attempt to explain it. <br /><br />And then comes exams - after you gone mad from trying to remember the content, he creates these super hard exam which looks nothing like what you studied. Like in the mid-term he expected us to recall the structure of some organic molecules from the top of our heads ?? like we were never told to memorize this? and the finals was just much worse - the last few questions we had to design this 14-15 step pathway - I can't even get a lot of the reaction mechanisms right and you expect us to derive 14-15 step mechanism?",
            "comment_teaching": "I am going to be objective here rather than straight up dissing (trust me soooo many have done so already), lets analyse the facts!<br /><br />1) The mean of the mid-term and finals has failed (below 50%) <br />2) Out of over 200 people in the class, the attendance is less than 20 (take a hint)<br />3) Lecture notes are unclear and has too much irrelevant stuff that nobody cares about. While the important parts lack detail and are exactly copied and pasted from the textbook. <br />4) A majority of students solely use the textbook or youtube videos for revision, and this is one of the most well known 'self-taught' course <br />5) Most students don't actually understand the content after the lecture (I mean those that attend) - many have stated that it is partially because of his dull and mundane teaching style. <br />6) At the end of the course, we actually have no clue how these organic synthesis reactions occur in the lab, we only memorize so many reactions yet have no idea how this is done in the lab.",
            "comment_grading": "Mid term - 40%, Final exam - 60% <br /><br />I have to be a bit nicer here, the grading is decent - because everyone else does horribly so the mean is low (as expected). Like the mid-term mean actually failed (56/120) which I found hilarious. I have actually seen people cry after the mid-term, which is not very surprising because the exam looks like it was written in Swahili or something, absolutely nothing like what is in the textbook or the &quot;lecture materials&quot;. While the final exam has a mean of 78/180. <br /><br />The exams had some MCQs, a lot of it were short questions, but the finals had the long mechanism questions. The MCQs were okay, but the longer questions just seem unrealistic and inhumane. <br /><br />The mean is around a B-, getting a 50% overall is enough for a B, 60% is about a B+, and over 65% is already an A-. The standard deviation is actually quite high for this course as some students actually do well (most likely good self-studying techniques)",
            "comment_workload": "Mainly just preparation for mid-term and finals, however there is a lot of self-studying and revision so workload is quite high. Most of the content is not clear from the get-go so you may need to spend so long to understand. Do get the textbook though it will save your life. <br /><br />Be prepared to think you finished one chapter and move to the next and then forget that entire chapter completely. And then at the end you think you studied everything and then you get to the exam to experience this huge mind blank. Enjoy~",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rPOFjs6SQdqBIyqPTBWfoaxkfZpnNR7L",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "chantelle98",
            "date": "Dec 08, 2017",
            "title": "WARNING: this course may be hazardous to your mental health",
            "comment_content": "- way too much content in a short amount of time, especially after the mid term. Estimation of probably 55-60 pathways/mechanisms that needed to be learnt AND applied to complicated molecules in the exam. (PS if you have done IB HL chemistry and thought this wont be too bad, you'll be proven wrong- the HL content will probably be the easiest stuff that will be covered in this course)<br />-each lecture powerpoint is very lengthy- he covers a lot of content in a short amount of time-- too fast and may be difficult to take in so much all at once. <br />-exam content is way more difficult than the textbook, which he claims to be following for teaching this course.<br />-ppts sometimes include complicated pathways that arent in the textbook- ppts also lack explanation. ~85% of ppt are diagrams with no explanation.",
            "comment_teaching": "-skims through powerpoint, lots of irrelevant info on the powerpoint that he may spend time explaining, only to tell you its not needed for the exams.<br />-suspected to tip off certain students about exam info. Eg: last question on the final exam was seen worked out in the scihome whiteboard before the exam. (which was a 10 mark question on synthetic pathways, the right solution having 13 steps)<br />-expect to be your own teacher if you take this course!! :) free youtube lectures and the textbook is your savior",
            "comment_grading": "-mid term 40%, final 60%. <br />-Multiple sections within paper, ranging from simple / MCQ to (for the final) complicated 10 mark questions asking you to design the synthetic route from 1/ more starting molecules to a final, more complicated one. <br />-mid term mean was roughly 47%",
            "comment_workload": "- E= because you have to self study everything. we were encouraged to do textbook end of chapter questions. Exam questions are different in style so I didnt find it helpful to work on them even though I finished all in preparation for the midterm.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iUI40Ewypxa5qokBMrvdvrmR39QhJkUN",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "cyc_yin",
            "date": "Aug 25, 2015",
            "title": "",
            "comment_content": "有好多款唔同org compounds既reactions，但係最弊係佢地之間無咩相連既pathway，而中學學過個network map又唔同佢教咁，靠死背其實好辛苦。仲有關乎geometry既基本mechanism，SN1、2，E1、2個D，佢教咁快，塞左好多野入黎搞到理解唔切。",
            "comment_teaching": "好在有video睇返，如果唔係都唔知上堂講咩。標叔成日飲cafe既咖啡（非重點），係LT講野有咪都咁細聲，又講勁快，要追上佢既思路好難。最好預先自習下今次講既ppt先。",
            "comment_grading": "因為同埋bich major 既人一齊讀，比較多人，所以就算跟排名比grade都頗靠運氣。仲有個course有D中學生泥讀，有個仲攞最高分，拉高曬mean，真係喊出黎。Final高mean半個SD都係B。<br /><br />Grade\t# of Students<br />A+ &gt;=80\t7+1<br />A &gt;=75\t12<br />A- &gt;=70\t15<br />B+ &gt;=65\t20<br />B &gt;=60\t33<br />B- &gt;= 50\t59<br />C+ &gt;=45\t19<br />C &gt;=40\t12<br />C- &gt;=35\t3<br />D &gt;=30\t1<br />F &lt;=30\t1",
            "comment_workload": "無功課，但係連練習題目，mock paper都無就比唔上inorg chem個D prof lor，甚至孫耀威（org chem 2）都有mock paper做下，唉⋯⋯",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6Uey6cg4xtYUO5MCKw4U2g6zrYlfXxJP",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yanee",
            "date": "Feb 02, 2022",
            "title": "",
            "comment_content": "Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their <br />Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and <br />Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiols and Sulfides<br /><br />Suggested textbooks:<br />“Organic Chemistry” 8th Edition by John <br />E. McMurry<br />“Organic Chemistry Study Guide with <br />Student Solutions Manual”, 8th edition <br />by John E. McMurry",
            "comment_teaching": "What Prof.TONG taught was exactly following the textbook. Sometimes I found his lesson was boring, I would read the textbook instead, and I think the textbook was much clearer than what he said. However, it is still important to join his lecture and listen carefully since he might mention which part would not be tested or which part would be more important for the exam, and those things would not be mentioned again right before the tests or in the review sessions.",
            "comment_grading": "Midterm:<br />Mean: 72.86\tHigh: 115.5\tLow: 31 (out of 120)<br /><br />Final:<br />Mean: 77.98\tHigh: 175 \tLow: 0 (out of 180)<br /><br />Hope this help!",
            "comment_workload": "It all depends on you. There are only midterm and final. Professor will leave some practice questions after each lesson, but those practice are not compulsory. For the midterm, those practice questions will help; but for the final, the textbook questions are easier than the questions in real test. So you may need to search for more extra practice. To prepare for the final, it will be better for you to start the review earlier because you need to memorize and apply around 40 reactions. So fighting (Gayau)!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "ZVCqO8cdZ5Csh9Gez4gVh2B5lX9smEC0",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1570,
                    "name": "NAKAMURA, Hugh",
                    "rating": 1
                },
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Geoff Tsang",
            "date": "Jan 27, 2023",
            "title": "Barely any difficult concept but quite some content.",
            "comment_content": "Bonding<br />Polar Covalent Bonds<br />Acid and Bases<br />Alkane and Stereochemistry<br />Cycloalkanes and Stereo chemistry<br />Stereochemistry on Carbon<br />Overview of Organic Reaction<br /><br />Midterm<br /><br />Alkene Structure<br />Alkene<br />Alkene Reactions<br />Alkyne<br />Organic synthesis<br />Alkyl halides<br />Alkyl halide reactions<br />SN2 substition <br />SN1 E2 E1 E1cb reactions<br />Alcohol<br />Epoxides and Ethers<br /><br />Final",
            "comment_teaching": "Professor Tong tends to teach in a very detailed manner. He explains the concepts quite clearly. The teaching pace is moderate. Tong part teaches mostly conceptual contents in this course, which means you might wanna spend some time understanding the content rather then pure memorization.<br /><br />Professor Nakamura is quite enthusiastic in teaching organic chemistry and try to make people enjoy learning it. But sometimes when he is trying to explain the examples in ppt he might go through it very quickly as he thinks its very straight forward and easy. Depending on how quickly you understand to content, this may be good or bad to you. (Since Nakamura part is mostly about organic reactions, not a lot of concept wise content. Most of it is indeed straight forward indeed)",
            "comment_grading": "Midterm 40%<br />Final 60%<br />No attendance requirement<br /><br />Final (at least as stated by the Prof) consists of&nbsp;&nbsp;90% of content taught after midterm. And roughly 10% of content taught before midterm. But the truth is the content sometimes are closely related. (E.g. concept taught before midterm might help explaining the rationale which some of the organic reactions occurs in such a way.)<br /><br />Midterm is a mix of short question, mcq and matching the answer. Final is somewhat similar but a lot lot more lenghty. Both midterm and final are at similar difficulty I would say. (If you remember 80% of the content and at least understands the basic concept you will get at least B+)<br /><br />Midterm: 88/120 (Mean is 71 or 7x, highest 107 or 10x)<br />Final: 267/400&nbsp;&nbsp;(咁大個仔第一次見400分一份卷, Mean 171.9, Low:15, High 385(不如你去教？))<br />Letter grade: A-<br /><br />I would say the grading is quite good.<br />Many many contents for you to memorize for final, and MCQ only counts for ~10% for final. Others all short question or draw the sturcture of compounds after reaction. But fortunatly not a lot of difficult questions, if you understands the basics, you will get a acceptable score.",
            "comment_workload": "Before midterm barely any. Since some concepts are covered (or at least taught in someways) in other introductory chemistry courses.<br />After midterm acceptable workload. If you are willing to spend around 20-30 mins to memorize the reactions path then you will be just fine. As long as you are not going to pile every chapter's content until the last few days (especially among other exams)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iR4FXt7msjo7wlJb8DB9OSYrBisVqcZZ",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "mc_cch",
            "date": "Jan 18, 2022",
            "title": "Terrible Professor",
            "comment_content": "We had to recite a lot of stuff, especially the reaction conditions and reagents...... Luckily, many exercises could be found in the textbook which were extremely useful for us to get familiar with the chapters. Therefore, I strongly recommend u guys to get one from the bookstore and read through all content at least 2 weeks before the exam!!!<br /><br />Also, students should pay more attention to the chapter about nucleophilic substitution and elimination, as this involves the most important concept.",
            "comment_teaching": "TONG could be very obstinate at times, he DID NOT show any respect to OVERSEAS students. Because of the pandemic, ZOOM was the only way for us to learn. Even though the situation got improved later, some students still continued to rely on ZOOM during lecture time. However, not only did he ignore the messages in the chatbox, but he also forgot to adjust the camera position so none of us could see the real-time demonstration done by him.&nbsp;&nbsp;&nbsp;&nbsp;Despite the fact that we had sent him many emails to raise our concern, he was still in a nonchalant manner&nbsp;&nbsp;&nbsp;!!!<br /><br /> In the class, TONG just read through the PPT slides with his monotone, and everyone stayed silent. Our insomnia could definitely be cured.<br /><br />&nbsp;&nbsp;When it came nearly the end of the semester, TONG once said 'I will only benefit students who attend the f2f lecture, I know students on ZOOM can't see the laser point on the screen, so don't complain to me!' <br /><br />ABSURD!<br />RIDICULOUS!",
            "comment_grading": "Fair grading, both the score of the mid-term and final exam would be released. <br /><br />Mt: 83/120 (Avg= 72.35)\t\t<br />Final: 70.5/180 (Avg=77.45)\t\t<br /><br />Finally: B-",
            "comment_workload": "Do spend plenty of time to prepare yourself. The textbook was quite useful because it explained many essential concepts that were skipped by TONG.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "XdeZKuqPx8wQW13KQWGCX74HQuf7smfD",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "michaelho147",
            "date": "Dec 11, 2021",
            "title": "full of content",
            "comment_content": "midterm is quite easy just normal general chemistry thing plus some new thing<br />a lot of content many reactions need to memorize",
            "comment_teaching": "not so good always include not related things in power point like something he is doing in research.<br />his lesson is boring so don't even attend the class",
            "comment_grading": "40 midterm 120 is full mark mean is around 73<br />60 final<br />the final is super hard with 180 full marks<br />normally final only have mean around 60 out of 180<br />with shit grading",
            "comment_workload": "no homework <br />only exam<br />but it requires you study so many hours <br />and",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2iDjlI6IEPQbeIa3SNBrXk30sAVpQmzd",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "phyllissssss",
            "date": "Jan 17, 2021",
            "title": "",
            "comment_content": "Contents are acceptable when you listen to the lectures, but when you begin to review all the reactions just a few days before the exam, you will find this course is literally a disaster. You need to memorise mountains of organic reactions. But for the students who have learnt organic chemistry before in the high school, it is ok and even simple. But for those without the fundamental knowledge about organic chemistry and first time to learn, you need to pay lots of effort to understand the mechanism and recite all the reactions.<br /><br />Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />-----MIDTERM-------<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiols and Sulfides",
            "comment_teaching": "The lecture is okay. He will explain most contents on the powerpoint but a little bit boring and sleepy. but the slides are very useful, you can learn it by yourself.",
            "comment_grading": "40%mt+60%final<br />final grade:A+, i got very high marks on both exams<br />tbh, if you put effort, you can easily get good grade since the mean is extremely low and prof will curve the mark up.",
            "comment_workload": "no hw at all but you need to memorise all the reactions. it costs lots of time. don’t just listen to the lecture, you need to do the additional exercise after each chapter on textbook.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "p4otN1kL5NhMhCdwXWwGy8Q6PMLA07S7",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cabbi",
            "date": "Jan 03, 2020",
            "title": "",
            "comment_content": "before midterm it was mostly high school stuff: naming conventions/lewis structure/ calculation of degree of unsaturation/ inductive effect/acidity,basicity... <br /><br />after midterm there are loads of reactions and more mechanisms, important concepts include: carbocations, regioselectivity, m's rule, sn2/sn1/e1/e2 reactions.....",
            "comment_teaching": "speaks a bit too fast and flat toned and is hard to keep up with during the lesson. the lecture videos are posted after the termination of face-to-face lessons and I still have to pause and re-listen to many parts of the video to grab what he explained..",
            "comment_grading": "seemed fair. he mentioned giving around 20 percent of a range (including a-). I did averagely in midterm and pretty horribly in final and probably got what I deserved hh<br /><br />btw the slides are really important!!!! I completely ignored the slides before midterm and was told by the ta that lots of questions in midterm actually come from the questions on the lecture slides during paper checking session... <br /><br />and to really learn the course well, preview is recommended (if I&nbsp;&nbsp;had done it!!) it was simply impossible for me to go in blank minded and catch up with him for the whole lecture",
            "comment_workload": "no assignments, only midterm and final are counted towards the final grade. however you have to spend long time understanding the mechanisms. strongly recommend saving one week for final preparation (especially if you plan to PREVIEW everything just before the exam). I spent 3 days previewing and felt like my stomach was about to explode and could vomit at any moment due to the compulsively rapid intake of information",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OiE1vXcEv7Sob8HJvKEOfDrhFzIA7toh",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "biochemisttt",
            "date": "Jan 02, 2019",
            "title": "Rubbish course",
            "comment_content": "Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiolsand Sulfides",
            "comment_teaching": "He actually just uses a very boring tone to read the contents once in every lecture. He explains his research topics in detail which eventually won't appear in your exams. However, the content you need to understand thoroughly he would still go through it very quickly.&nbsp;&nbsp;<br />He used to say no lecture videos would be uploaded and suddenly uploaded all lecture videos one day before the final. Still, u won't be able to finish or even digest some of them in such a short time.",
            "comment_grading": "Final grading:<br />A+ (12 persons): &gt;=73.7<br />A (9): &gt;= 66%<br />A- (9): &gt;=60%<br />B+ (15): &gt;=65.17%<br />B (20):&gt;=48.17%<br />B- (18): &gt;= 41.33%<br />C+ (22): &gt;=36%<br />C (17): &gt;= 31.33%<br />C- (13): &gt;=28.33%<br />D (15): &gt;= 23%<br />F (7): &lt;23%<br /><br />Final Exam: <br />Average: 70.12/180<br />Highest:155/180<br />Lowest:15/180<br />Std Dev: 34.29<br /><br />Midterm:<br />Average: 64.795/120<br />Highest: 103/120<br />Lowest: 31/120<br />Standard Deviation: 16.6.<br /><br />I did not study chemistry in my high school and I study Chem 2110 before I study Chem 1030. I got both midterm and final below a SD and eventually got a D.<br />Go study Chem 2311 with understandable materials and better grading and never get suffer in those reactions when u are reading my comment.",
            "comment_workload": "This course has too much content to study in just a semester.Midterm is average, if you understand the concepts and do those exercises, you should get a good mark. However, the final exam is horrible, cumulative exam with many reactions that u won't understand all and memorize all and the final exam is so difficult also. With many marks on the organic synthesis, each question with around 15 steps.",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NRkgS41qeTSOmuQ8XWAHFLXL7T5Nm7xd",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "cantdouni",
            "date": "Jan 24, 2018",
            "title": "This course will make you cry",
            "comment_content": "This course has a very detailed content covering most of high school organic chemistry. the topics start off easy, giving you a false sense of security, but literally make your life miserable later. some of the topics covered include: structure and bonding,acids and bases, alkanes, cycloalkanes, alkenes, alkynes,alkyl halides, complex reaction mechanisms, alcohols and phenols, ethers and epoxides.<br />Basically an awful lot to cover in a short time.",
            "comment_teaching": "Horrendous, monotonous, just plain boring. The content is very complicated in itself, and his teaching style does not help in any way. it is very hard to follow what he's saying and explaining. There are no lecture videos, and trust me, you wouldn't want to watch them anyway. I literally studied most of the content myself from the book, which does a fairly decent job.",
            "comment_grading": "This course has only a midterm and final:<br /><br />midterm is 40%:<br /> mean= 56.39/120&nbsp;&nbsp;&nbsp;sd= 18.36<br />final is 60%:<br />mean=75.89/180&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;sd=36.99<br /><br />The fact that the mean is so low, is possibly the only saving grace.",
            "comment_workload": "since this course only has a midterm and a final, workload around that period increases by a massive amount due to all the memorisation required for the reactions and the structures. <br />The final is cumulative, so be prepared to give a crazy amount of time for preparation.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "97SagqUuFnWgLJ6F3IG2puQY7er3gL7H",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "monkoala1120",
            "date": "Nov 25, 2017",
            "title": "",
            "comment_content": "its difficult. the mechanisms were complicated and the powerpoint notes did not show the mechanism clearly and there was no lecture videos provided so i couldn't watch and pick up easily.",
            "comment_teaching": "he got accents and he couldn't illustrate his points clearly. But I could see Tong did try hard in making us to learn something.",
            "comment_grading": "I am not quite sure about the grading but i literally get everything below mean, and I got a C.",
            "comment_workload": "I think the workload was fine, after all, its just a midterm and final, no assignment",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FyyTl34PrWsfZjn3UH7e00KHd9NE0FmV",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                },
                {
                    "id": 1570,
                    "name": "NAKAMURA, Hugh",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "omghhhh",
            "date": "Jan 11, 2023",
            "title": "",
            "comment_content": "LT 1: Introduction to Organic Chemistry, Structure<br />LT 2: Atomic Bonding<br />LT 3/4: Polar Covalent Bonds, Lewis Acids and bases<br />LT 5: Alkanes and their stereochemistry<br />LT 6: Cycloalkanes and their stereochemistry<br />LT 7/8: Stereochemistry at tetrahedral centers<br />LT 9/10: Overview of organic reaction<br />LT 11/12: Alkenes structure and reactivity<br />Mid-term<br />LT 14/15: Alkenes reaction and synthesis<br />LT 16/17: Alkyne Introduction to Organic Synthesis<br />LT 18: Organic Halides<br />LT 19/20: Reactions of Alkyl halides<br />LT 21/22: Alcohol and Phenols<br />LT 23/24: LT 24/25: Ethers and Epoxide, Thiol and sulfides<br />LT 25: Organic Synthesis<br />Final",
            "comment_teaching": "Fair, but the pace is too fast because everything is packed into a 3-month course, especially for the lectures after mid-term cuz it's all about reactions",
            "comment_grading": "Mid-term: 40%<br />Final: 60%<br />Memorise the reaction and its mechanism, final exam is just pages of boxes to draw organic structure, loads of hexagon",
            "comment_workload": "No homework or quizzes, no attendance required but it does require a lot of time to revise if you want to get a good grade",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "G87l7HIgZB0GVBT6I9JVlsZ1pr6E320Y",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                },
                {
                    "id": 1570,
                    "name": "NAKAMURA, Hugh",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "www.com",
            "date": "Jan 05, 2023",
            "title": "Not an easy course but you can handle the exams by reciting all the reactions.",
            "comment_content": "Chapter 1: Structure and Bonding <br />Chapter 2: Polar Covalent Bonds; Acids and Bases <br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry <br />Chapter 4: Organic Compounds: Cycloalkanes and Their Stereochemistry <br />Chapter 5: Stereochemistry at Tetrahedral Centers <br />Chapter 6: An Overview of Organic Reactions <br />Chapter 7: Alkenes: Structure and Reactivity <br />Chapter 8: Alkenes: Reactions and Synthesis <br />Chapter 9: Alkynes: An introduction to Organic Synthesis <br />Chapter 10: Organohalides <br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination <br />Chapter 12: Alcohols and Phenols <br />Chapter 13: Ethers and Epoxides: Thiols and Sulfides",
            "comment_teaching": "TONG, Rongbiao: B<br />Nothing special. He just read out the content in the powerpoints. <br /><br />NAKAMURA, Hugh: C<br />I think it was hard to understand what he was saying because of his accent.",
            "comment_grading": "Midterm: 40%<br />Mean: 72/120&nbsp;&nbsp;Highest: 109/120&nbsp;&nbsp;<br /><br />Final: 60%<br />Mean: 170.5/400&nbsp;&nbsp;Highest: 397/400",
            "comment_workload": "Acceptable. No quizzes or assignments. No attendance requirements. Only midterm and final exams.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vTpE1FqsMVEHMrEJGpKJBvz75IWwdNgN",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                },
                {
                    "id": 1570,
                    "name": "NAKAMURA, Hugh",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HoLik",
            "date": "Jan 02, 2023",
            "title": "",
            "comment_content": "All of the lessons contains many concepts for memorising, which you have to work really hard if you want to attain a high score in both exams. Especially hard for Tong’s part, so please do think twice if you want to take this course instead of the Analytic Chemistry.",
            "comment_teaching": "Tong was horrible in his teaching and you will easily fall asleep in his teaching part, especially the course is at the early morning; Where Nakamura have many in-class exercises, helping to understand the concepts.",
            "comment_grading": "I did messed up very hard in both my midterm and final exam. Turns out the grade was higher than my expectations.",
            "comment_workload": "Only a midterm and final exam, which both require a lot of memorising. The synthesis chemical pathway and also requirements will be confusing so do work hard in remembering all the stuff in materials. Especially the part of Nakamura because final exam takes 60% of your grades.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9TLp4vguVyXYhVkm0rDIUqUtVeDyHMHT",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                },
                {
                    "id": 1570,
                    "name": "NAKAMURA, Hugh",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ggg_",
            "date": "Dec 30, 2022",
            "title": "",
            "comment_content": "LT1: Introduction<br />LT2: Bonding<br />LT3: Polar covalent bond<br />LT4: Acids and Bases<br />LT5: Alkane and stereochemistry<br />LT6: Cycloalkanes and stereochemistry<br />LT7&amp;8: Stereochemistry on carbon<br />LT9&amp;10: Overview of Organic Reactions<br />LT11: Alkene Structure<br />--------------------Midterm (TONG) -----------------------<br />LT12: Alkene<br />LT13&amp;14: Alkene reactions<br />LT15: Alkyne<br />LT16: Organic Synthesis<br />LT17: Alkyl halides<br />LT18: Alkyl halides reactions<br />LT19: SN2 substitution<br />LT20: SN2, E2, E1, E1cb<br />LT21: Alcohol<br />LT22: epoxides and ethers<br />---------------Final (Nakamura) -----------------",
            "comment_teaching": "Almost all comments I read said that TONG teaches badly and there's no need of attending his lectures. However I think he explained things quite clearly and the teaching is ok. <br />As for Nakamura, it is really hard for me to get used to his accent at first. I sometimes didn't realize he was speaking English and thought he was speaking Japanese. But it is ok after you get used to his accent and strange pausing and rhythm. His lecture is more lively than professor TONG as he sometimes walk around and interact with active students. （He says funny things when no one respond, like &quot;you don't give a sh*t?&quot;)<br />I usually prefer textbooks comparing to lecture notes, but the professors said that some contents on the textbooks are wrong, and the lecture notes also provide more details somehow.",
            "comment_grading": "Midterm: full mark 120, 40%<br />MCs and short questions (ranking) and a few long questions on mechanism and explanation for phenomena<br />Mean: 71.99&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Median: 71\tHigh: 109&nbsp;&nbsp;&nbsp;&nbsp;Low: 35<br />Upper Quartile: 81\tLower Quartile: 64<br /><br />Final: full mark 400, 60%<br />MCs, short questions (ranking), filling in products of reactions, 2 long questions for mechanism, 1 long question for organic synthesis<br />Mean: 170.49&nbsp;&nbsp;&nbsp;Median: 157\tHigh: 397&nbsp;&nbsp;&nbsp;&nbsp;Low: 0<br />Upper Quartile: 249.75\tLower Quartile: 93.75\t<br /><br />Me <br />Midterm: 84/120&nbsp;&nbsp;&nbsp;FInal: 319/400<br />Letter Grade: A<br /><br />Actually the grade I got is better than I originally expected. I thought I would get A- at most since I didn't do well in midterm but got A.<br />I heard that final is more difficult than midterm so I was quite fructrated when I messed up the midterm. However, final was not as difficult as I thought it would be. Don't know if it's because Nakamura teach the course for the first time, his final questions are way more easier than those from pastpapers of TONG. Nakamura said the summary slides after each lecture slides are important and &quot;the exam will be exactly like that&quot;, and the part for filling in products is indeed exactly the same, which is quite surprising. The questions for mechanism can also be found on slides, but unfortunately I didn't managed to remember those two mechanisms. I also didn't know how to do the synthesis, but TAs are very kind and gave me part of the marks.",
            "comment_workload": "The workload is quite high in my opinion. The contents are manageable for midterm, but in final there are many reactions to memorize. More importantly, long questions of organic synthesis definitely require lots of practice. (It is really lucky for me that there is only 1 long quetion of synthesis this year and the majority is blank-filling of products, otherwise I will die) (But don't know if it is still like this next year) I didn't spare time for the optional after-class exercise, but I think it would be helpful if you spend time doing it. Try to memorize some of the contents daily, so you won't be too miserable when preparing for the final exam.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NSaLhGYADs4samzhD7H0kEMJViGALVdD",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "letmegohome",
            "date": "Jan 24, 2022",
            "title": "Fair grading but boring teaching",
            "comment_content": "Organic Chem 1 <br />Basic stuffs, not hard to understand if you go through the textbook yourself.",
            "comment_teaching": "I would put it this way: at the beginning of the semester, the lecture theater was full; after a couple days or weeks, there were no more than 20 students showing up physically.<br />It is undoubtedly that Prof Tong excels in academic, however, I don't think he is a good teacher.<br />I didn't go to his lectures after 2 or 3 weeks.",
            "comment_grading": "I think the grading is fair.<br />I have to say it was my fault that I didn't study for a whole semester. As mentioned, I didn't go to his lectures, however, I didn't listen to most of his recordings either...though I still managed to get a B+ finally. I messed up my mt because I just can't imagine the 3d structure of a molecule and thus I found it really hard for me to determine the S or R or whatever...<br />This course, from my perspective, is mainly about memorizing. I pulled an all nighter the day before final, and tried my best to cram all the reactions into my brain...and it actually worked!! Though I forgot most of the reactions half way through the exam, I still managed to score above mean in final.<br />&nbsp;&nbsp;<br />mt:84/120 mean: 72.86<br />Standard Dev. 18.8<br /><br />Highest: 115.5/120<br /><br />Lowest: 31/120 <br />final: 115/180 <br />Average: 77.45<br /><br />STD: 41.8<br /><br />Highest: 175<br /><br />Lowest: 16 <br /><br />Absence: 1",
            "comment_workload": "YOu need to STUDY YOURSELF BECAUSE THE LECTURES ARE USELESS",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BwsytvK4BP0tcW6Qnsuqq08h6gqirPFP",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kemist",
            "date": "Dec 31, 2021",
            "title": "Fair course",
            "comment_content": "Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their<br />Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiols and Sulfides",
            "comment_teaching": "Prof's voice is the best cure for insomnia. In the second half of the semester, only ~30 persons came to lecture. Everyone can learn all the content by reading lecture notes themselves, and prof just read the lecture notes, so there's no need to come to the lectures. However, he is willing to answer all the questions and is quite nice.",
            "comment_grading": "Midterm 40%<br />low: 31, mean: 72.9, high: 115.5, std: 18.8<br />me: 104/120 (+1.65sd)<br /><br />Final 60%<br />low: 16, mean: 77.45, high: 175, std: 41.8<br />me: 169/180 (+2.19sd)<br /><br />Overall: 91/100<br />Final grade: A+<br /><br />According to prof, &gt;85%=A+ (10 persons), &gt;77%=A (11 persons), &gt;70%=A- (12 persons), so around 20% got A range, not too bad<br /><br />For the final exam, many just don't study so they got shit scores, like 20-40 sth over 180, but the hard-working students did so well that, quite a few got more than 160/180, so basically two extremes.",
            "comment_workload": "No homework and quizzes<br />nearly 0 workloads, just make some notes for yourself before the exams and revise them should be enough. However, as there is no hw for revision, students need to be self-motivated to study the mechanisms of organic synthesis. If you want to get good grades, the best way is to seek resources.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5Fd6O5owRmFcGE8uldcnCWmWDzGsVgT4",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lucien11",
            "date": "Dec 29, 2021",
            "title": "",
            "comment_content": "Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their<br />Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiols and Sulfides<br /><br />----------------------------------------------------------<br /><br />Nothing special :)",
            "comment_teaching": "Skipped all lectures (except the first).<br /><br />Don't know how Prof. Tong taught Org Chem<br /><br />Honestly speaking, lecture notes are quite easy to read, thus nice for you to go over and review before the midterm and final.",
            "comment_grading": "No homework. No attendance.<br /><br />Total = 40% Midterm + 60% Final<br /><br />Midterm:<br />Very easy, but some questions about basic concept are extremely annoying. Be careful.<br /><br />Final:<br />Easy. Synthesis may take quite long time to figure out one reasonable route. MCs may not be so easy as you would expect.<br /><br />My score:<br />Midterm 115.5/120<br />Final 173/180<br />(Final Grade A+)<br /><br />Seems that the grading is quite good as 10 people got A+ according to Prof. Tong's email.",
            "comment_workload": "Almost 0 workload (no HW,project,pre,etc.)<br /><br />If you know nothing about Org Chem, attending the lectures may be necessary. I guess the lecture would be not very hard to follow as the lecture notes look logic enough.<br /><br />(Make sure you finished all indicated practice questions in McMurry textbook, Prof. may use some of them in his exam papers. Although I didn't do any of course lol.)",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XHekJfeSpsMcKYRuXBjYNJKTbOgRnNCI",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "RIbtSU",
            "date": "Dec 26, 2021",
            "title": "If you are lifs major, better not choose this course",
            "comment_content": "Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their<br />Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiols and Sulfides",
            "comment_teaching": "I almost attended all lecutres before the midterm, almost skipped all after midterm. Prof's voice is soft which always made me sleepy. He didn't like to reply emails. I once asked him the date of midterm (just said to be confirmed in outline), and didn't receive a reply at all.",
            "comment_grading": "Grading is quite good actually.<br />Midterm: 40%<br />Final: 60%<br /><br />Midterm is quite easy actually, no big difference as chem1020/1030, concept-based<br /><br />My score: 104/120<br /><br />Final is hard. Tones of reactions need to be remembered. I am a biotech student and have already had several lifs courses to study. (You know, lifs courses are all with heavy content) Therefore, not enough time for me to study for the final and I failed in the final. The highest one scored near full mark without studied much before the exam so maybe I am too stupid . As a lifs student, If I can choose again, I will take chem2311 instead of this course<br /><br />My score: 135/180<br /><br />Overall: 79/100, A<br /><br />Though I failed in the final, still have A which I didn't expect.<br />For lifs students, dun take this course to fulfill lifs requirement because you need to study with chem major students and they are all very strong. Take chem2311 to fulfill requirement as no chem major students here (chem people take chem2310, not the same course)",
            "comment_workload": "No assignment is required. There are some question numbers that he suggested from the textbook on the last page of ppt. But I didn't do any of them so I dunno if textbook exercises are useful.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "l4TeH3Bsp0m3MMnCsUsNuvR5FgEVnbWq",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "山並先生",
            "date": "Dec 17, 2021",
            "title": "too much content and to remember",
            "comment_content": "Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their <br />Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiols and Sulfides",
            "comment_teaching": "I recommend self-learning. <br />If you attend the lecture on Zoom, you will not see the pointer and which carbon, bonding, etc. he was talking about. Even if you attend f2f, it is difficult to see the pointer in the lecture theatre. <br />Also, he will mention something not required in this course, like the research results from his lab, which are not included in the exam, so just ignore them. <br />The most serious problem is his accent!",
            "comment_grading": "It is fair. <br /><br />Mid-term: <br />mean:72.35/120<br />The mid-term exam is not difficult; it's just the concepts in orgchem. Some questions were discussed in the lecture. <br /><br />Final:<br />mean:77.8/180<br />It had four parts: basic concepts and principles (20 Qs for 40 pts, multiple choice), organic mechanisms (3 Qs for 30 pts), Organic reactions (15 Qs for 60 pts), and organic synthesis ( 3Qs for 50 pts).<br />When compared to the online examinations from the previous year, it is simple to complete if you recall all of the reactions.",
            "comment_workload": "Only have mid-term and final. <br /><br />But you need to remember all the reactions, and the content for the final is too much.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oIpT2Fj9BnOj7LrBdGJm6xeah5sdup1C",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hahahaaa",
            "date": "Nov 29, 2018",
            "title": "Chem2110",
            "comment_content": "Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiols and Sulfides",
            "comment_teaching": "quite bad<br />His English accent a bit fuzzy and&nbsp;&nbsp;hard to follow",
            "comment_grading": "midterm 40%<br />from chapter 1 to chapter 6 (9 lecture ppt) <br />final 60% <br />from chapter 7 to 18 (14 lecture ppt)",
            "comment_workload": "No assignment <br />only midterm and final",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SJCG78zvX1qjGs4N1ixDkXnzwNK4U3GC",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LukaModric",
            "date": "Nov 04, 2018",
            "title": "",
            "comment_content": "Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiols and Sulfides",
            "comment_teaching": "Fair.<br />In most of the time, Prof. Tong is explaining the powerpoint but no additional information from the notes.<br />Teaching assistants are terrible. They correct the midterm paper carelessly that I got 9 more points after checking the paper. However, the final is fine.<br />The grading of midterm is strict. You get marks only when you got it all correct in some questions.<br />Lecture video will be provided just before a few days of final exam.",
            "comment_grading": "Midterm<br />Mean: 65.3/120<br />SD: ~16.6<br />Max: 106/120<br /><br />Final<br />Mean: 69.8/180<br />SD: 34.29<br />Max: 155/180<br /><br />Midterm: 40%<br />Final: 60%<br /><br />A+ (12 persons): &gt;=73.7%<br />A (9): &gt;= 66%<br />A- (9): &gt;=60%<br />B+ (15): &gt;=55.17%<br />B (20): &gt;=48.17%<br />B- (18): &gt;= 41.33%<br />C+ (22): &gt;=36%<br />C (17): &gt;= 31.33%<br />C- (13): &gt;=28.33%<br />D (15): &gt;= 23%<br />F (7): &lt;23%",
            "comment_workload": "No Assignment but quite lots of things got to remember.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Evsdj3YoDFfORWeOMo3Q5SU4TB4NEDZV",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hfchanae",
            "date": "Mar 01, 2017",
            "title": "",
            "comment_content": "The content was mainly about some basic properties of organic compounds and function groups, such as alkanes, alkenes, alkynes, etc. Many synthesis would be covered in the final part.",
            "comment_teaching": "Very unfluent and hardly understandable English. The time slot was bad (4:30pm-5:50pm). Therefore, very few people is willing to attend the class. For me, mostly was based on self-study.",
            "comment_grading": "The grading was quite good, 5 marks margin for each sub grade. Mean is around 50, which would get B-. At least 70% to get A range.<br /><br />40% Midterm<br />60% Final<br /><br />Both midterm and final exam would consist of MC, True or False, Mechanism, Reaction and Synthesis.<br /><br />Synthesis is the most important to define whether u can get an A range or not. Other part are easy to handle if you have good memories from the notes and textbooks. MC are simply basic concepts.",
            "comment_workload": "Light if u only want to pass. A lot of effort must be paid if you want to achieve higher course grade. It is because there is still a lot of functional group and their reaction to remember.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YaqelnWtCkd62eCo6IjW311SQjqeWqus",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Leo Han",
            "date": "Jan 19, 2017",
            "title": "Organic Chem I (good grade??)",
            "comment_content": "Basically talked about the structures and properties of different functional groups. The content is easies before midterm, mainly including few concepts such as bonding theory and acid and base. After midterm, more specific reactions and mechanisms are covered, which also needs a lot of time to remember.",
            "comment_teaching": "Prof Tong's teaching sometimes could be boring, especially discussing the reactions, but generally is not too bad.",
            "comment_grading": "40% midterm<br />60% final<br />(The grade is good actually. 20% A range in total and nearly 5% A+. One of the best courses I've ever had.)<br />The midterm is easy, however, the final is a little bit tricky, requires many mechanisms and reactions.",
            "comment_workload": "Only midterm and final means you have to spend quite a lot of time on reviewing be exams. It's better to remember those reactions after lectures, or it will be nightmare in the study break.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wftbupLY0zCdKYbFJ8wrvRan9ZkYLSFw",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JustyAbbie",
            "date": "Jan 05, 2017",
            "title": "",
            "comment_content": "Pre-midterm:<br />主要係basic organic chemistry需要知嘅野，例如：structure and bonding, stereochemistry, acidity, etc. <br /><br />Post-midterm:<br />(1) Reactionssssss：<br />差唔多大部分都要記晒：alkene, alkyne, halide, alcohol, epoxide, ether, 夾埋大約40個<br />(2) Mechanisms,：<br />主要係SN1, SN2, E1, E2 &amp; 某D reactions嘅mechanisms (e.g. electrophilic addition of HX to alkene, m-CPBA epoxidation of alkenes)<br />(3) 最難亦都最少接觸，但final佔30分嘅Organic Synthesis",
            "comment_teaching": "上堂其實都幾悶，一來唔係好聽得明佢嘅口音；二來去到post-midterm嘅課題，佢會加勁多textbook以外嘅reactions入去混淆視聽（包括好多佢自己lab嘅research）。通常都啲人都會走堂，或者入去唔小心瞓著咗，有聽書嘅都未必聽得明。<br /><br />佢final前有announcement講大概考D咩，溫習範圍有比較清晰（起碼知道有邊D reactions/ mechanisms較重要）。但佢第一句係：&quot;I have received many email inquiries on the topics covered in the final exam. Herein, I give an overview to all students for the sake of fairness.&quot;，所以想知多啲應該send下email去問穩陣啲。",
            "comment_grading": "有比想像中好。<br />根據Canvas嘅announcement, grading如下：<br />A+: &gt;=80%; A: &gt;=72%,<br />A-: &gt;=67% (19.1% of students)<br />D: &gt;=28% (&lt;35% of&nbsp;&nbsp;students)<br />F: &lt;=28% (4.1% of students)",
            "comment_workload": "輕鬆。<br />1 midterm exam, 1 final exam",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PIiCZfcCdu5GKF9Rcb7SvhuTogwOJhj9",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fierce_bad_girl",
            "date": "Nov 30, 2016",
            "title": "",
            "comment_content": "Pre-midterm: inorganic chemistry and concepts (bonding, stereochemistry, shit like that)<br />Post-midterm: reactions x n (mind you, all of which need to be utterly and completely memorized for the final)",
            "comment_teaching": "He has the most laughably Chinese accent I've heard, and it's monotonous, dreary and sounds like he has a mouthful of shit. <br />Good luck trying not to drop dead in class. <br />Half the class skived off, even when he sent out notices that were like &quot;I'll be talking about important shit tomorrow/the exam/if you don't come I'll flunk your ass&quot; so yeah, you can probably guess how terrible he is",
            "comment_grading": "Fair, I suppose. I hear you can get another five or ten marks on your midterm and/or final if you're (a) somewhat hot and (b) female, which most of us at UST unfortunately aren't. <br />Lucky souls who fit into (a) and (b), go find him in his office on a quiet day and reap those benefits",
            "comment_workload": "Ambivalent. What do you say about a course which you can choose to (a) not work and flunk the fuck out of or (b) eat the book, memorize your ass off and get a mediocre grade?",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "99o4ly9qRaHYUmusAi5rgSq5W7apdNU1",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mike Lam",
            "date": "Aug 27, 2016",
            "title": "",
            "comment_content": "To me, the content is just right, not too many, and not too few. <br />&nbsp;&nbsp;The first part is the basic things, which includes orbitals, drawing structures, orbital hybridization, formation of bonds, molecular shape and bond polarity. Then comes acid and bases, with detailed discussion on the factors affecting acid strength. After that would be alkanes and cycloalkanes, in which their limited amount of reactions are mentioned. Conformations of both cyclo- and aliphatic alkanes are discussed, which is followed by stereochemistry. A brief discussion on the various types of reaction and how to draw reaction mechanisms is taught before midterm. <br />&nbsp;&nbsp;After midterm is comes the physical chemistry of reactions, including kinetics and energetics. Then, various functional groups and their typical reactions are discussed. Functional groups mentioned include alkenes, alkynes, alkyl halides, alcohols, epoxides, ethers, thiols and sulfides. An in depth discussion on SN2, SN1, E2 E1 and E1cb mechanisms is inserted after the alkyl halides.",
            "comment_teaching": "Quite good. The instructor is from mainland, so he speaks with an accent, but his english is still quite clear and understandable. Pace not too fast. At the start of every powerpoint is a summary of the last powerpoint and a revision question, which facilitates consolidation of knowledge of the past powerpoint. Very patient on answering questions, often a long queue would appear after class, waiting to ask questions. It is not rare to take half an hour for the queue to disappear.",
            "comment_grading": "I am not sure about the others, but I got an A+ with an overall 95+%. Midterm 40%, Final 60%. According to announcement, overall 50% is B-, then each 5% more (less) is a subgrade higher (lower, resp.). Statistics before paper checking for final shows that most people got B-, followed by B. Updated statistics not given, but is estimated to be similar.",
            "comment_workload": "Very light workload. At the first few lessons, assignments are assigned, but as declared in the first lesson, these assignments are neither collected nor graded. Studying for exams is quite useful, especially for final. However, he focus on testing our understanding rather than memory, so not much to memorize except for the reactions and the reagents used. As a result, the overall workload is very light.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IBGXBtjbcXz6vKxZe2FIeDeLpeXwPibU",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "EdogawaC",
            "date": "Aug 22, 2016",
            "title": "Lots of reactions, not enough time to learn them all",
            "comment_content": "A lot of new knowledge on organic reactions, mechanisms, syntheses, but not enough time to master them. Course is taught too fast and too many things crammed into one semester.",
            "comment_teaching": "Prof teaches fast, talks too fast, doesn't update pdf with in-class questions, so if you can't follow in class, well...",
            "comment_grading": "Surprisingly not too bad grade, a little above 70% was enough for A-. If do enough practices from textbook, getting a high grade should be achievable.",
            "comment_workload": "No homework, no quizzes, have mid term and final, both accounting to 50 % of final grade. my advice is to work hard for mid term, since there are a lot fewer reactions learnt compared with final.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2zdWgwBgVkv6PPLANvXgclC9k7W2FHeH",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yuu",
            "date": "Jan 26, 2016",
            "title": "",
            "comment_content": "The course give me a glance how organic chemistry looks like. If you try to clear the concepts after every lesson, it can be easier when it comes to midterm and final exam.",
            "comment_teaching": "Professor's accent was relatively hard for me to understand what he was talking about. I skip nearly all the lessons after midterm.",
            "comment_grading": "Midterm - 40%<br />Final - 60%<br /><br />I got ~60% for the whole course and I got a B+.<br />It is better to get high marks in midterm as final exam is really difficult.",
            "comment_workload": "No hand-in assignments. Students can do the suggested exercises listed on the last page of the powerpoint.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JnuaRvNsa7lrs5T1MMwzOCWnPjSFkTws",
            "semester": "2015-16 Fall",
            "instructors": [],
            "is_author": false,
            "author": "qorhvk",
            "date": "Jan 26, 2016",
            "title": "",
            "comment_content": "Overall useful. Content before midterm was fairly easy (I mean easier than what I heard of). Final exam portion was difficult, mainly due to mechanisms which require a great amount of time to memorize it.",
            "comment_teaching": "Professor's English was not the worst, but sometimes it was hard to understand due to his Chinese accents. His voice was monotonic, easily falling into sleep.",
            "comment_grading": "40% midterm and 60% final. MCQ, short questions and long questions are included. Final is extremely hard. You have to memorize all mechanisms and deduce how one particular compound ends up with a different compound.",
            "comment_workload": "Not that much. It's purely exam based. Depends on how well you can memorize.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YaH3ai9eAXcxQRFbkKKVPcdKQVRmCwXJ",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "fghfdhfh",
            "date": "Feb 07, 2022",
            "title": "",
            "comment_content": "pretty okay.&nbsp;&nbsp;good basic coverage. fully understood everything and important basis to come back to for further courses.",
            "comment_teaching": "i liked his style. something about his voice makes it very interesting to listen to and i sometimes fantasize of soothing into his lecturing room. pretty jenggg.",
            "comment_grading": "grading was fair and consistent with the peers.",
            "comment_workload": "medium workload and revision was easy but lengthy. i liked that i could balance my time off with his lecture courses and often read them on the bus back home. i met a random guy.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9rk5wuPhlsIVlNBLEb13qDEVWdkVSVXj",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "diudiu",
            "date": "Dec 21, 2018",
            "title": "Don't go to the lectures, it's not worth it",
            "comment_content": "The ABCs of organic chemistry. Covers all the things you'll need in higher level orgo - naming, stereochemistry, functional groups, thermodynamics, some fundamental reaction mechanisms, and then some more reaction mechanisms.",
            "comment_teaching": "It only took me one lecture to decide not to go in all subsequent lectures. His English is atrocious and he wasn't exactly too competent in explaining stuff. The powerpoint slides were pretty information-heavy, and I appreciate the effort to put in his own lab's work as examples, but his delivery ultimately made them more confusing than inspiring.<br /><br />Don't rely on him to learn anything. Just read the textbook and do some exercises yourself and you'll be fine.",
            "comment_grading": "Tong was extremely lenient with his grading if you do well enough. This probably had something to do with the exquisitely low average score though (it's in the low 40s). The average grade was on par with the University average at B-, but once you get to A range (~20%, or 30 people) he's impossibly nice. 60% overall is enough to score you an A-. The thresholds for A and A+ were 66% and 73.7% respectively. 12 (!!) people got A+.<br /><br />My grade: 98/120 midterm; 126/180 final; overall 74.7%, A+.",
            "comment_workload": "No assignment or attendance requirements whatsoever. You do have to put in the effort after the midterms though, since memorising all the subtle details of organic reactions is no easy task. It's not just memorising though, you will actually have to apply them in the final exam, as a significant part of the exam would be devoted to coming with reaction mechanisms and synthetic pathways. You either need to (1) practice a lot; or (2) be very creative.<br /><br />I don't think I'm particularly creative, so I had to cram a lot of exercises instead; luckily the instructor did list out selected questions for practice at the end of each chapter, that was pretty helpful.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JmkB8FWk1Y9tTHn43xybPObsHKAmTylS",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Fickdeinemutter",
            "date": "May 25, 2018",
            "title": "Best Course I have ever taken",
            "comment_content": "Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their <br />Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral <br />Centers<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br /><br />Mid-Term Exam (mid October)<br /><br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: <br />Thiols and Sulfides<br />-----------------|-----------------<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;v<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Organic Synthesis<br /><br />Final Exam (mid-late December)<br /><br />MUCH MUCH harder than high school Org. Chem.<br />Memorization and regurgitation. <br />Fairly simple.",
            "comment_teaching": "Dr. Tong is a very kind and friendly person. He is very popular among science students. He answered very patiently all questions that the students asked after class. <br /><br />There was a queue of asking questions outside the lecture hall almost after every lesson.<br /><br />He would talk about his own organic chemistry's research during lesson, which would certainly appear in the exam as at least one or two 20-marks long question(s) of figuring out the reaction mechanisms.",
            "comment_grading": "My Performance：<br /><br />Mid-Term Exam：95/120 (mean：76.9/120)<br />Final Exam：86/180 (mean：79.2/180)<br />Weighed Total：181/300 ≈ 60.33%<br /><br />Eventual Grade：B+<br /><br />Dr. Tong hands out grades really leniently. It would be your best fortune to have taken his course.<br /><br />This is the major course that I performed the best, and perhaps the best course I have ever taken.",
            "comment_workload": "Memorize all types of reactions (revolving around SN1, SN2, E1, E2 etc.) <br />Practice the drawing of mechanisms. <br /><br />The long questions in the exam paper that require you to draw reaction mechanisms can be tortuously difficult.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xjjXAQCeD4HWhSldeYKrjd6tGJ35O9Uw",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "0.0.....",
            "date": "Dec 22, 2017",
            "title": "份ppt乜都冇",
            "comment_content": "Mid term前後係兩個世界<br />Mid term前主要係中學學過嘅野再加少少新野 基本上肯背下書都會識<br />Mid term後開始一大堆reaction 淨係alkene已經有廿幾個reaction<br />仲有alcohol alkyne ether<br />仲要記個reaction啲product出邊種isomer 成個課程安排好chur",
            "comment_teaching": "佢講英文有accent 要好專心去聽<br />冇lecture video<br />另外佢份ppt基本上係空嘅 <br />唔會好似professor jia份ppt咁詳細<br />冇任何嘅support 唔會有pastpaper/ex比你做<br />唔上堂自修嘅人一定會好辛苦<br />同2210嘅professor 比真係差好遠",
            "comment_grading": "Mid term mean 58/120<br />Final mean 75/180<br />大約係咁 記唔清楚<br />佢grading算唔差 mid term final各below mean一個sd --&gt; D<br />mean就b-左右",
            "comment_workload": "冇assignment<br />Mid term 40%<br />Final 60%<br />不過final會考埋mid term前嘅野<br />Mid term後已經超多野背 再加埋mid term前嘅野 我覺得workload算大",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Hw8VpuXaVppwdx3WDdQ5UCuTNHThoxPb",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                },
                {
                    "id": 1570,
                    "name": "NAKAMURA, Hugh",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Milktea",
            "date": "Jan 03, 2023",
            "title": "LEAVE if you are a BCB student",
            "comment_content": "If you are a BCB student or a LIFS student who unfortunately got this course during prereg, PLEASE LEAVE and check if you can study analytical chemistry. If you, unfortunately, have to study this course, I will warn you right now, the road ahead is a cycle of cluelessness that requires you to be efficient in self directed learning. <br /><br />No matter if you are a BCB student or a CHEM student, the consensus is the same. NO ONE UNDERSTANDS THE MATERIAL. Be a good student and learn everything by yourself.<br /><br />Summary of contents:<br />Midterm: Strength of acid and base, Stereochemistry of organic compounds, Reactivity of alkenes<br />Final: Reactions of alkene, alkyne, alkyl halide, SN1, SN2<br /><br />Midterm content: C<br />Tolerable. Do not expect to learn much during class, the teaching pace is way too fast and TONG will briefly mention important concepts in a few words. The content is not hard in the sense that the materials for learning are all in PowerPoint. It is a must to learn EVERYTHING IN DETAIL via youtube.<br /><br />Final content: E<br />Absolute HELL. Imagine DSE organic reactions but instead of 10 reactions, there are now 100+ reactions that have different reagents. <br /><br />The PowerPoint includes images with extremely low resolution that includes important concepts about organic reactions between alkenes, alcohols, esters. There is little to no explanation on all the slides, so good luck with understanding the concepts, the only way to understand anything is through googling the name of the concepts. Lectures won't help either, NAKAMURA just mentions what happens in the PowerPoint &quot;This attack this and end up like this&quot; As you can see, &quot;extremely useful&quot;.<br /><br />If you are on a time crunch, go revise SN1 and SN2 alcohol reactions by finding youtube videos by Prof Dave explains. Don't bother with the PowerPoint for that part",
            "comment_teaching": "TONG Rongbiao: C<br />His accent is tolerable, a lot better than Jia. He also speaks at a normal pace which helps a lot.&nbsp;&nbsp;Unfortunately, he assumes that students would know the content by mentioning a few words. The good thing about this professor is that he would answer questions after lessons and he actually cares about students. His accent is tolerable and I could mostly understand what he says.<br /><br />NAKAMURA, Hugh: E<br />I could not understand what he was saying after the second lesson. His Japanese accent makes it even worse. I also asked a few different students and came to the same conclusion. NO ONE UNDERSTANDS HIM. He also really likes to say &quot;You don't give a sh*t?&quot; when no one asks questions. DO YOU EXPECT ME TO RAISE MY HAND AND SAY &quot;I DON'T UNDERSTAND ANYTHING, PLEASE TEACH AGAIN!&quot; I got so annoyed that I did not attend any lectures after Chapter 17",
            "comment_grading": "The grading was the best thing about this course. Because all the students did not know what was going on, and the grading was curve based, it would be hard to get F. <br /><br />I even heard students after the final exam say that they did not know what they were doing during the exam, the same goes for me, I did not know what I was doing. <br /><br />I was 2 marks below the midterm and 6% below the mean for the final.<br /><br />I ended up getting a B-, which was much better than I expected. I felt like I did not learn much from all the lectures.",
            "comment_workload": "Many would say workload is low as there are no assignments or quizzes. There is just midterm and final. <br /><br />However, it does not mean that your actual workload is low, much time is needed for studying this course. Allocate your time wisely.<br /><br />I suggest doing exercises from the organic chemistry book suggested at the back of each powerpoint.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lOy3PqkDa9zns4wBEmvNCKMonmesNZBO",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "茜",
            "date": "Dec 17, 2022",
            "title": "Basic level organic chem",
            "comment_content": "pretty okay.&nbsp;&nbsp;good basic coverage. fully understood everything and important basis to come back to for further courses.",
            "comment_teaching": "good. i liked his style. something about his voice makes it very interesting to listen to and i sometimes fantasize of soothing into his lecturing room. pretty jenggg.",
            "comment_grading": "grading was fair and consistent with the peers.",
            "comment_workload": "medium workload and revision was easy but lengthy. i liked that i could balance my time off with his lecture courses and often read them on the bus back home. i met a random guy.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ClzYOq85E8v9ZmvPdtrXXkA5EnyZlefM",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tommylau",
            "date": "Dec 28, 2021",
            "title": "Take this course or you will regret",
            "comment_content": "Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiols and Sulfides<br /><br />More importantly, these contents would lay a solid foundation for the study of bcb students. So don't hesitate to take this course if you are from LIFS division",
            "comment_teaching": "Prof. Tong is a very experienced scholar in the field of Total synthesis and he often provides useful synthesis. Also he got great accent, so no need to doubt if you could understand his teaching or not",
            "comment_grading": "Very good grades, even for lazy students.<br />&gt;70% = A range",
            "comment_workload": "Nearly zero, just do your revision the day before the exams is enough to secure an A",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "aDA7VWoQk7hnhLc3PEbcUSGnCwlBCZs7",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "カロメル",
            "date": "Sep 01, 2020",
            "title": "course for researchers",
            "comment_content": "A lot of content related to his previous research topic. Give more than knowledge but the sense of doing chemistry and even total synthesis researches.",
            "comment_teaching": "Keep conscious (sleep early) during class to make the teaching not bad. Teaching logic quite clear, if you can understand the examples makes you even easier to understand. Not quite hard to follow the teaching (as long as being conscious), and following makes good results.",
            "comment_grading": "A really good grade course. Prof. does not really care about grades. Got 2/3 of the total absolute grade and harvest an A. If you can find the sense of organic chem, the sense of total synthesis, particularly how to develop synthetic routes for a compound using the knowledge taught then it becomes really simple, and not being hard to get 2/3 of them right. The only problem is just the ability to find it. Might be challenging for 2-year CHEM students and BCB students in every academic year.",
            "comment_workload": "Can be much and can be low. Only 2 tests existing but require lots of time to review for them. may need more than 2 whole nights to remember all the reactions and that is quite important. Do remember all reactions before the final, makes it stick in your mind, and can recite in 1 second.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XVmQigHIazcoEUzsB5fPJqz0BZsDAWsI",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ViggyPiggy",
            "date": "Jan 17, 2019",
            "title": "I Loved the course, i'm particularly interested in organic chemistry and so maybe thats why i didnt find it as hard as other reviews suggest.",
            "comment_content": "The Content is relevant and fundamental to organic chemistry. No issues whatsoever here. You might say that the content is too heavy but thats on you.<br /><br />Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiolsand Sulfides",
            "comment_teaching": "I feel like professor Tong is great at teaching the concepts and i understand him fairly well despite the slight accent. His lecture slides are comprehensive and he does give suggested questions at the end of each lecture. He even provides examples of the reactions he teaches through his own research work, showing how they piece together in an organic synthesis pathway.<br /><br />I do however feel that he rushes the content a bit much, especially nearing the final examination. And although he gives suggested questions from the textbook for us to work out, it would be better if he solved a few examples to show us how its done.",
            "comment_grading": "Grading is real nice, atleast it was for me. The paper is hard in general, so the mean is real low<br /><br />Midterm: 82/120&nbsp;&nbsp;&nbsp;&nbsp;Mean - 65.3&nbsp;&nbsp;(40% weightage)<br />Final Exam: 139/180&nbsp;&nbsp;&nbsp;&nbsp;Mean - 69.8&nbsp;&nbsp;(60% weightage)<br />Final Grade: A+",
            "comment_workload": "Amazing course in terms of workload - theres absolutely none. All you need to do is study for the midterm and final examination and youre set.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MTgBfN9jSoUi2l4YiByDdYJiTDb4rjFG",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "biochemnerd",
            "date": "Jan 22, 2018",
            "title": "Don't take this course unless absolutely necessary, you will have PTSD (like me)",
            "comment_content": "Begins with basics like drawing lewis structures, newman projections, naming, R/S stereochemistry and resonance structures. Then its about certain functional groups like alcohols, thiols, ether, epoxide, alkene, alkyne, aromatics. Its all what basic organic chemistry courses entail in most unis probably.<br />I have attached the file with the intro stuff.<br />The issue is not with that, but the amount of memorization and actual practice required to master these concepts. What I found the worst was that we begin with making C-C-O-H and are expected to master synthesizing compounds within a span of 3 months, which is INSANE.",
            "comment_teaching": "Okay, this one is tough. He's unclear and monotone = recipe for disaster when it comes to teaching us easily bored students.<br />Prof's accent is super hard to understand most times, unless you specifically pay attention to every word (which takes a LOT of energy). His explanations are further worsened by simple, unclear statements with terminology thrown around. There is no lecture video, which wouldn't help anyway since his <br />He does try to make class interesting by adding &quot;real-life&quot; examples or applications made by his students in the lab BUT it only confuses students further.",
            "comment_grading": "No clue on the grading tbh. The only thing we were told were the means and SD.<br />Midterm (40%): <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mean= 56.39/120&nbsp;&nbsp;&nbsp;sd= 18.36<br />Final (60%):<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mean= 167/180&nbsp;&nbsp;&nbsp;sd= 36.99<br />The good thing was the mean was super low, yet there was a grading scheme devised even if you were within +/- sd, which I'm not sure about.",
            "comment_workload": "Even though its only midterm and final, you can only hope to get a good grade is if you are a computer who can remember a 100 reactions and their catalysts/conditions (I'm serious) in the time of ~1.5 months. If you can, well done. If you can't, then I'd suggest you make your peace with a bad grade or drop this course while you have the chance. I knew people who did well too, but I'm not sure how they managed to do that, given I worked at least 8 hrs a week on this content and still managed to almost fail.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "LJTptBI6ajjN9lYS2ZurWf5dRNpv6Dnx",
                    "name": "LT- 1_updated",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "k6AqmdlcLYIyoSWlzrwS3PZDiZcyESy5",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "holymama",
            "date": "Dec 04, 2018",
            "title": "",
            "comment_content": "Chapter 1: Structure and Bonding<br />Chapter 2: Polar Covalent Bonds; Acids and Bases<br />Chapter 3: Organic Compounds: Alkanes and Their Stereochemistry<br />Chapter 4: Organic Compounds: Cycloalkanes and Their Stereochemistry<br />Chapter 5: Stereochemistry at Tetrahedral Centers<br />Chapter 6: An Overview of Organic Reactions<br />Chapter 7: Alkenes: Structure and Reactivity<br />Chapter 8: Alkenes: Reactions and Synthesis<br />Chapter 9: Alkynes: An introduction to Organic Synthesis<br />Chapter 10: Organohalides<br />Chapter 11: Reaction of Alkyl Halides: Nucleophilic Substitution and Elimination<br />Chapter 17: Alcohols and Phenols<br />Chapter 18: Ethers and Epoxides: Thiols and Sulfides",
            "comment_teaching": "Did not attend any lesson, so can't give a legit comment.",
            "comment_grading": "Midterm 50%<br />Final: 50%<br /><br />Midterm mean: 64.8/120, highest 106/120<br />SD: 16.6<br /><br />Final mean: 70.1/180, highest 155/180<br />SD: 34.29<br /><br />My result:<br />midterm: 99/120<br />Final: 151/180<br />A+",
            "comment_workload": "0 workload coz no homework. Pay attention to the memorisation of reaction, try to understand every mechanism and you will find it easy to remember.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QhGyoYK3qsEUwGjqdhGEMZhNapVXxgA8",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 43,
                    "name": "TONG, Rongbiao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "percy509",
            "date": "Jan 02, 2020",
            "title": "This course is good",
            "comment_content": "1) electronic structure and bonding<br />2) Acid base<br />3) stereochemistry<br />4) alkanes<br />5) alkenes<br />6) haloalkene<br />7) alcohol<br />8) synthesis and retrosynthesis<br />9) Delocalization and resonance<br /><br />Basically stuff you learn in high school",
            "comment_teaching": "Professor is trying to be fun in lesson, and he speaks pretty accurate English, there should be no problem in understanding his lecture. Also he welcomes students to ask him question if you do not understand",
            "comment_grading": "Midterm is easy<br />Final need more time as it is online exam.<br /><br />Midterm: 119/120<br />Final: 151/160<br />Grade: A+",
            "comment_workload": "There is no workload for this course, you don't have to do any homework or quiz, all you have to do is study for midterms and finals.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}