{
    "error": false,
    "course": {
        "id": 81,
        "subject": "CHEM",
        "code": "2310",
        "name": "Fundamentals of Analytical Chemistry",
        "description": "Fundamental and practical aspects of chemical analysis, including titrimetric, electrical and spectroscopic methods, analytical separations by GLC and HPLC.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"CHEM\" data-code=\"1030\" href=\"/review/CHEM1030\" target=\"_blank\">CHEM 1030</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"CHEM\" data-code=\"2311\" href=\"/review/CHEM2311\" target=\"_blank\">CHEM 2311</a>",
        "rating_content": 3.11,
        "rating_teaching": 2.72,
        "rating_grading": 3.11,
        "rating_workload": 3.61,
        "review_count": 18,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 46,
                "name": "CHAN, Wan",
                "count": 18
            }
        ]
    },
    "reviews": [
        {
            "hash": "9pbyEmajPbOw90FHdTexzN5xF4c0wfyx",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "燃燒中的GPA",
            "date": "Jan 18, 2020",
            "title": "發泄文",
            "comment_content": "23份PPT, cover晒全本textbook<br /><br />Midterm: L1-L10<br /><br />L1-Introduction<br />L2-Chemical Measurements<br />L3-Math Toolkit, Sig Figs, errors<br />L4-Statistics<br />L5-Quality assurance and Calibration methods<br />L6-Volumetric analysis: Good Titrations<br />L7-Gravimetric and Combustion Analysis<br />L8-Acids and Bases<br />L9-Buffers and Indicators<br />L10-Acid-Base Titrations<br /><br />Final: L11-L23<br /><br />L11-Polyprotic Acids and Bases<br />L12-Deeper Look at Chemical Equilibrium<br />L13-EDTA titration<br />L14-Introduction to Electrochemistry<br />L15-Potentials and Potentiometry Electrode Measurements<br />L16-Instrumental Electrochemistry<br />L17-Introduction to Optical Spectroscopy<br />L18-Instruments and Applications of Spectrophotometry<br />L19-Atomic Spectroscopy<br />L20-Introduction to Chromatography<br />L21-Introduction to Liquid Chromatography<br />L22-Introduction to Gas Chromatography<br />L23-Introduction to Mass Spectrometry<br /><br />之後要讀CHEM3320既人最好趁讀CHEM2310果陣讀好d L3-L5, L14-19, L23呢幾課, 打好個底到時讀CHEM3320會無咁辛苦",
            "comment_teaching": "9點堂+神柱, 淨係上過佢幾堂, 所以無咩印象<br /><br />據我所知, 呢個course以前係有2個Quiz, 由呢個sem開始佢將果2個Quiz改左做2份assignment, 每份佔10%, 合共20% (你無睇錯, 係每份10%)<br /><br />大部分CHEM courses每份assignment 3%-5%,考試前deadline, 跟住會upload solutions幫你準備考試, 成個安排好合理<br /><br />佢呢2份assignment就真係世界級, Assignment 1 個deadline係midterm之後2日, 佢話俾多d時間你做喎, 點知個midterm就出返Assignment 1既野, 頂你assignment都未識做, midterm又點會識做? Assignment 2仲衰, deadline係考final果日, 而最好笑既係呢2份assignment都係“佛系assignment” (無答案, 唔出分, 做完攞唔返), 除左攞果20% assignment分之外, 做完之後係乜都學唔到<br /><br />Midterm前一堂佢上堂果陣show過一份midterm past paper, 呢份野佢唔會upload上網, 不過就算你影低左份野都無咩用, 因為呢份野係無答案既<br /><br />Final前會upload一份final past paper, 無錯, 呢份野都係無答案既<br /><br />講真, 睇textbook自學可能仲好<br /><br />「師者，所以傳道、受業、解惑也。」(師說)<br /><br />提供答案係解惑既一種方法, 偏偏CHEM Dept 好多instructors就係鍾意唔提供答案, CHEM3320 份past papers係咁, CHEM3555 果7份lab reports都係咁, CHEM4310 既group projects又係咁, 我就係唔識先要睇答案吖嘛, 你地答案都無份, 咁我要你地班instructors黎做咩? 我自己用Google, 睇textbook自學唔好? 各位CHEM major自求多福啦!",
            "comment_grading": "Assignments (10% x 2): 無出分<br /><br />Midterm (30%): 80 minutes, 50 marks<br />Format: 10 MC (20 marks), 5 SQ (30 marks)<br />Mean: 27.5/50, SD: 7.0<br /><br />Final (50%): 3 hours, 100 marks<br />Format: 10 MC (20 marks), 5 fill in the blanks (5 marks), 9 SQ (45 marks), 1 LQ (15 marks), 1 essay type question (15 marks)<br />Mean: 56.7/100, SD: 15.0<br /><br />我:<br />Midterm: 36.5/50 (+1.29 SD)<br />Final: 45.5/100 (-0.75 SD)<br /><br />Grade: B-<br /><br />Grading算正正常常啦, mean應該係B-",
            "comment_workload": "一份有用既assignment係會出分, 考試前改完俾返你, 就算改唔切都會出答案,佢既目的係幫你理解個course既內容同埋幫你考試既, 而CHEM2310既assignment就啱啱相反, 一份原本應該係幫你準備考試既assignment, 個deadline竟然係考試當日甚至之後, 令到份assignment失去原先既意義, 甚至變成workload既一部分<br /><br />由於2份assignment都無答案, 而midterm同final又會出返類似assignment既題目, 所以最好都係考之前做完份assignment, 然後搵d勁人對下答案, make sure你考試之前識做assignment既題目<br /><br />Final可以帶1張A4 size既手寫cheat sheet, 考final之前你有3樣野可以做: 準備cheat sheet, 做佢果份無答案既Assignment 2同埋past paper, 都係記得搵d勁人對下答案先 (呢個sem final份卷有部分題目同past paper好似, 甚至一樣) <br /><br />Midterm考比較多calculations, final就少d",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "N3D7vTAz98ydsBXD1AOIyfJ284ZPuyJ4",
                    "name": "CHEM2310 Course outline",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "7aYMNvBoD9oOifCevlg1v4LomSLFui9t",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "[DATA EXPUNGED]",
            "date": "Jan 21, 2021",
            "title": "Online mode is boring, but you can get good grade if you read the text book",
            "comment_content": "No midterm nor final for this semester, but there are quizzes in irregular intervals, pay attention to canvas notification if you do not plan on attending every lecture.<br />L1-Introduction<br />L2-Chemical Measurements<br />L3-Math Toolkit, Sig Figs, errors<br />L4-Statistics<br />L5-Quality assurance and Calibration methods<br />L6-Volumetric analysis Good Titrations<br />L7-Gravimetric and Combustion Analysis<br />L8-Acids and Bases<br />L9-Buffers and Indicators<br />L10-Acid-Base Titrations<br />L11-Polyprotic Acids and Bases<br />L12-Deeper Look at Chemical Eq<br />L13-EDTA titration<br />L14-Introduction to Electrochemistry<br />L15-Potentials and Potentiometry Electrode Measurements<br />L16-Instrumental Electrochemistry<br />L17-Introduction to Optical Spectroscopy<br />L18-Instruments and Applications of Spectrophotometry<br />L19-Atomic Spectroscopy<br />L20-Introduction to Chromatography<br />L21-Introduction to Liquid Chromatography<br />L22-Introduction to Gas Chromatography<br />L23-Introduction to Mass Spectrometry<br /><br />Lecture 16 is taught by Professor Stefen NAGL instead of Professor CHAN, he has enthusiasm but his English has heavy German accent, so it is a bit difficult to follow.<br /><br />Professor CHAN talk about a lot of trivia that may or may not appear in the quiz, and the powerpoint is incomplete most of the time in terms of contents. So either take notes and attend lectures, or take a look at the textbook, or do both to fill the gap.",
            "comment_teaching": "I can only assume that in normal teaching mode the lecture would be more exciting, with lab instruments demonstration and other things. But in online mode, it is quite boring to just listen to what equipment is used without letting us see how it is done, therefore less than half of the class attend lectures, unless there was a quiz that day. Occasionally there were live video demonstration but that was either of low quality. I can tell that Professor CHAN was trying his best to make the lectures interesting, but it was difficult to achieve in online setting.",
            "comment_grading": "There are 7 online quizzes (60%) throughout the semester without conducting midterm or final exam. Only 6 of the 7 quizzes would be counted, but most of us( including me) botched the first quiz, so there was no slacking off for me for the rest of the semester.&nbsp;&nbsp;<br /><br />Two handwritten assignment (20%)would have to be submitted, it is alright to use ipad to complete the assignment as long as they are handwritten. <br /><br />One essay assignment(20%) that replace the final exam. You can choose from 3 predetermined topics, and write for at least 4 pages, you can write the essay on computer, unlike the two assignments above.<br /><br />Bonus Score(+2%): For student who keep answering questions, 2 bonus points would be added to the final grade.<br /><br />Quiz(60%):<br />Quiz 1: 5/10, Mean: 5.4/10 <br />Quiz 2: Data was deleted when I was writing this <br />Quiz 3: 5/6 ,Mean: 4.5/6&nbsp;&nbsp;<br />Quiz 4: 5/6 ,Mean: 2.9/6 <br />Quiz 5: 6/6 ,Mean: 4.5/6 <br />Quiz 6: Data was deleted when I was writing this <br />Quiz 7: 9/10 ,Mean:&nbsp;&nbsp;6.5/10<br /><br />Assignment (20%)<br />Assignment 1: 8.9/10&nbsp;&nbsp;Mean 8.6/10<br />Assignment 2: 9/10&nbsp;&nbsp;&nbsp;Mean 8/10<br /><br />Essay (20%)<br />16/20 , Mean 13.1/20<br /><br />Bonus Score(+2%)<br />I think I got 1.5 bonus points in the end.<br /><br />Final Grade: A+",
            "comment_workload": "Most of the time low workload, it is completely acceptable to study a few hours before the quiz, as they are all open book quiz. The essay is a bit difficult, but the submission time was very lenient, which was set at the end of the final exam period.<br /><br />The most tedious task is the hand written assignment which is just time consuming. You can type on computer much more quickly and effortlessly",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IdBd2OVbTjqkGYQqgkIMGlW9pHuPDOqv",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "LukaModric",
            "date": "Nov 04, 2018",
            "title": "",
            "comment_content": "The content at the beginning of the course is very boring.<br /><br />Measurements and the tools of an analytical chemist <br />Math Tool-kit, Significant Figures and Errors <br />Statistics<br />Least Squares and Quality Assurance <br />Gravimetry<br />Titrations<br />Acids and Bases<br />Buffers and Indicators<br />Acid-Base Titrations &amp; N-Analysis<br />Polyprotic Acids and Bases<br />EDTA Titrations<br />Introduction to Electrochemistry<br />Potentials and Potentiometry: Electrode Measurements<br />Redox Titrations<br />Instrumental Electrochemistry<br />Optical Spectroscopy and Applications<br />Chromatography<br />Mass Spectrometry",
            "comment_teaching": "The teaching is not good that at most of the time, Dr. Chan is reading the powerpoint or just explaining the powerpoint which is trivial.<br />No lecture video is provided.",
            "comment_grading": "The marking of midterm is careless.<br />You can simply find some questions which is corrected wrongly to add more points.<br /><br />10% HW1<br />10% HW2<br />30% Midterm<br />50% Final<br />2% Bonus<br /><br />Midterm:<br />Mean: 29.1/50<br />SD: 8.34/50<br /><br />Final:<br />Mean: 51.2/100<br />SD: 17.6/100",
            "comment_workload": "Not heavy but quite a lot of things to be remembered.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6Bi126FFuAgGZBH8L9we6CKv8H4yLrFU",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Fickdeinemutter",
            "date": "Dec 18, 2017",
            "title": "",
            "comment_content": "One of the Awfullest course I have ever taken since secondary school. Obscure teaching foci showcasing a landfill of topics. <br /><br />Some people, including me, may commonly find that we simply don't know what have been learned from this course as if we have been injected with unknown sedatives and knocked unconscious for some time until being able to wake up after the final. <br /><br />It's hard to illustrate explicitly, but it may not be necessary to draw characters transparent enough to see their intestines.&nbsp;&nbsp;&nbsp;<br /><br />Powerpoints are quite messy. Too much dazzling newspaper clipping between pages, virtually severing the important points and making it really difficult to grasp them. <br /><br />So many key concepts required for assignments and exams are not included in the lecture slides. <br /><br />You may argue that learning is a process of self-exploration, but it may not be responsible for a professor to expect the student gets everything on his own, despite it probably being within his capacity, because the student does not only take your course. <br /><br />All in all, this is the worst course in the 4-year Chemistry curriculum and perhaps throughout my career as a student.",
            "comment_teaching": "Prof. Chan is adorably corpulent. His baldness is funnily obvious that he seems to be an exemplar of a feverishly dedicated scientist having his senescence accelerated by decades. <br /><br />Listening to his preaching may be kind of enjoyment if your concern is not completely about how good he teaches. <br /><br />I should be honest to mention, for others' good sake, that he tends to read directly from powerpoints, discouraging student's persistent attendance, except for those who are highly immune to boredom.",
            "comment_grading": "No comment.",
            "comment_workload": "Two assignments, one before mid-term and one before final. They total 20%. Better hand them in on time or it may cost your final grade.",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QlIfRmL9AIoPt8IyvJKOtCwbW0L86gS4",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cim12333",
            "date": "Feb 01, 2023",
            "title": "Passionate Instructor who wishes to increase class interaction",
            "comment_content": "The instructor adjusted the order of the content. The sessions about various kinds of LC and GC techniques were interesting. Other contents are some basics of analytical chemistry. Adequate but definitely wants more.",
            "comment_teaching": "Tried to relate course contents to some real life examples. Lab tour is a plus to the course, as not much classes offer that. There is a room for improvement for teaching.&nbsp;&nbsp;Gave incentive to motivate us for learning.",
            "comment_grading": "Not bad, better than a lot of other UST courses. Listen to class and read the reference book are recommended.",
            "comment_workload": "2 assignment only.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2rt28PbGKo2faFYcajFnxoRxmHuf4scS",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "33Sigmatropic",
            "date": "Jan 05, 2023",
            "title": "no idea what I learnt",
            "comment_content": "1 Introduction<br />20 Introduction to Chromatography<br />21 Introduction to Liquid Chromatography<br />22 Introduction to Gas Chromatography<br />2 Chemical Measurements<br />3 Math Toolkit, Sig Figs and Errors<br />4 Statistics<br />---Midterm---<br />5 Quality Assurance and Calibration Methods<br />6 Volumetric Analysis and Good Titrations<br />7 Gravimetric and Combustion Analysis<br />8 Acids and Bases<br />9 Buffers and Indicators<br />10 Acid-Base Titrations<br />11 Polyprotic Acids and Bases<br />12 Deeper Look at Chemical Equilibrium<br />13 EDTA Titration<br />14 Introduction to Electrochemistry<br />15 Potentials and Potentiometry Electrode Measurements<br />16 Instrumental Electrochemistry<br />17 Introduction to Optical Spectroscopy<br />18 Instruments and Applications of Spectrophotometry<br />19 Atomic Spectroscopy<br />23 Introduction to Mass Spectrometry<br />---Final---<br /><br />Started with chromatogrpahy so &quot;it would be less boring&quot;",
            "comment_teaching": "Mediocre. Goes in too much detail for irrelevant sections but not enough for the parts that matter. Giving bonus for participation and rearranging the teaching order is commendable I guess.",
            "comment_grading": "Shit.<br /><br />Assignment 2x10% (20%)<br />then<br />Midterm 30% and&nbsp;&nbsp;&nbsp;Final 50% OR<br />Final 80%<br />depending on which one is higher<br />additional 5x1% bonus for answering questions in lectures<br />you basically have to answer 10 because you only get half a point unless you recite a whole wikipedia page with sources<br /><br />Midterm:<br />Mean: 33.52 Median: 36<br />High: 55.5 Low: 0<br />Upper Quartile: 43.5 Lower Quartile: 25.25<br />out of 60<br /><br />Final:<br />Mean: 57.22 Median: 60<br />High: 84.5 Low: 23.5<br />Upper Quartile: 68 Lower Quartile: 45.25<br />SD: 15.91<br />out of 100",
            "comment_workload": "only 2 assignments. tedious but not difficult.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wDfuQHeoRkDOr2qxG1ydNB9EhYdcLoD3",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YareYaredaze",
            "date": "Jan 01, 2023",
            "title": "幾乎冇數計既ANCHEM",
            "comment_content": "因為過去跟次序去教太悶，Professor 今年一開始教Liquid 同Gas chromatography (LC/GC) 先，跟住再由頭教到落尾。<br /><br />頭一個月就淨係教LC/GC MS 所以去到gravimetry 開始飛書，一堂教兩課(不是重點，所以考試都冇乜出)，直到Optical Spectroscopy 再放慢嚟教。<br /><br />詳細內容請參考其他Review。<br /><br />Extra: 温書記得跟住textbook 温，齋lecture notes 唔夠用。",
            "comment_teaching": "Local Professor ，上堂跟佢個思維去唸野有啲難度，唔明落堂廣東話問就好易get 到，特別係hplc ，其他儀器就還好。",
            "comment_grading": "兩個Scheme ，計邊個高分啲。<br />Both Scheme: Assignment 20% (1x10%) (two of them)<br />Scheme1: Midterm(30%), Final (50%) + 2 assignment (20%)<br /><br />Scheme2: Final exam (80%) + 2 assignment (20%)<br /><br />AND VERY IMPORTANT : 5% bonus for answering questions during the lecture, usually 0.5 point each. <br /><br />assignment 比分好鬆手，所以20%幾乎係送既<br />exam 還好，計數出左relative uncertainty 同埋單位轉換。<br /><br />Means ; High<br />Assignment 1 : 9.7/10 ; 10/10<br />assignment 2 :9.9/10 ; 10/10<br />midterm: 33.5/60 ; 55.5/60<br />final: 57.2/100 ;84.5/100<br /><br />FYI: <br />bonus point 太高 (5%)，平時唔搶答靠考試只會攞到A- <br />both assignment 10/10<br />mid term: 43/60<br />final: 78/100<br />得個A-&nbsp;&nbsp;¯\\_(ツ)_/¯",
            "comment_workload": "冇乜workload ，係考試前幾日温就得，呢科只要有野唔明儘快問，唔拖超過兩個禮拜都可以輕鬆追返。<br />Good luck.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "u0MZJjNVvgl2QoFCAreCHQCuvJJRKVz8",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "yo~",
            "date": "Dec 30, 2022",
            "title": "",
            "comment_content": "This year a bit change in teaching sequence<br />L1-Introduction<br />L20-Introduction to Chromatography<br />L21-Introduction to Liquid Chromatography<br />L22-Introduction to Gas Chromatography<br />L2-Chemical Measurements<br />L3-Math Toolkit, Sig Figs and Errors<br />L4-Statistics<br />-----Mid Term-----<br />L5-Quality Assurance and Calibration Methods<br />L6-Volumetric Analysis and Good Titrations<br />L7-Gravimetric and Combustion Analysis<br />L8-Acids and Bases<br />L9-Buffers and Indicators<br />L10-Acid-Base Titrations<br />L11-Polyprotic Acids and Bases<br />L12-Deeper Look at Chemical Equilibrium<br />L13-EDTA Titration<br />L14-Introduction to Electrochemistry<br />L15-Potentials and Potentiometry Electrode Measurements<br />L16-Instrumental Electrochemistry<br />L17-Introduction to Optical Spectroscopy<br />L18-Instruments and Applications of Spectrophotometry<br />L19-Atomic Spectroscopy<br />L23-Introduction to Mass Spectrometry<br />-----Final (Accumulative)-----",
            "comment_teaching": "He tries his best to be make the lecture interesting to us by letting us to think more and he is generous in giving many marks to people asking questions and answering his questions, but his teaching is still very bad. Although he did not read aloud the ppt slides directly, but I think jotting down some notes from his ppt slides will be enough to get above mean for the final exam, at least for me.",
            "comment_grading": "2x 10% Assignment, 30% MT, 50% Final or<br />2x 10% Assignment, 80% Final<br />Use the scheme with higher score<br />I got the mean and above 0.3 SD in MT and final respectively, but still only get a B-, expecting to get at least B instead, very disappointing.<br /><br />This year's Statistics for reference: (Low, High, Mean) / Full Mark<br />HW1: (5, 10, 9.72)/10<br />HW2: (8, 10, 9.86)/10<br />MT: (0, 55.5, 33.52)/60<br />Final: (23.5, 84.5, 57.22)/100",
            "comment_workload": "Workload is low. Only 2 easy assignments and in the final exam, you are allowed to bring an A4 paper with both sides written notes, the amount of things to memorize beforehand has highly reduced.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VcykfQsyI0RkDYnwMLBVXqTsHt4gC3JK",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ustishit",
            "date": "Dec 28, 2021",
            "title": "this course is fking suck",
            "comment_content": "same as previous semester<br />Midterm: L1-L10<br /><br />L1-Introduction<br />L2-Chemical Measurements<br />L3-Math Toolkit, Sig Figs, errors<br />L4-Statistics<br />L5-Quality assurance and Calibration methods<br />L6-Volumetric analysis: Good Titrations<br />L7-Gravimetric and Combustion Analysis<br />L8-Acids and Bases<br />L9-Buffers and Indicators<br />L10-Acid-Base Titrations<br /><br />Final: L11-L23<br /><br />L11-Polyprotic Acids and Bases<br />L12-Deeper Look at Chemical Equilibrium<br />L13-EDTA titration<br />L14-Introduction to Electrochemistry<br />L15-Potentials and Potentiometry Electrode Measurements<br />L16-Instrumental Electrochemistry<br />L17-Introduction to Optical Spectroscopy<br />L18-Instruments and Applications of Spectrophotometry<br />L19-Atomic Spectroscopy<br />L20-Introduction to Chromatography<br />L21-Introduction to Liquid Chromatography<br />L22-Introduction to Gas Chromatography<br />L23-Introduction to Mass Spectrometry",
            "comment_teaching": "one word---&gt; shit(like grading)",
            "comment_grading": "Hw1:9/10 mean 9.76<br />hw2:10/10 mean 9.76<br />mt:24/30 mean22<br />final 85.5/100 mean58<br />Grade: B+<br />this course A range should be less than 15%<br />Plz dun take this course and take chem2311=)",
            "comment_workload": "only hws which were very easy<br />midterm and final only need to do revision 2days before the exam.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "c0ccdeZ4iwemjhP8EuUYFbbsLbPt3MQ8",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "supermin",
            "date": "Jan 19, 2021",
            "title": "Pretty alright course as long as you study with good amount of time!",
            "comment_content": "- Measurements and the tools of an analytical chemist<br />- Math Tool-kit, Significant Figures and Errors<br />- Statistics<br />- Least Squares and Quality Assurance<br />- Gravimetry, Titrations<br />- Acids and Bases, Buffers and Indicators<br />- Acid-Base Titrations &amp; N-Analysis<br />- Mass Spectrometry<br />- Polyprotic Acids and Bases<br />- EDTA Titrations<br />- Introduction to Electrochemistry<br />- Potentials and Potentiometry: Electrode Measurements<br />- Redox Titrations<br />- Instrumental Electrochemistry<br />- Optical Spectroscopy and Applications<br />- Chromatography<br /><br /><br />Overall, not difficult topics, but you need to memorize quite a bit on how the machinery works and some calculations are required.",
            "comment_teaching": "He tries his best to be enthusiastic.<br /><br />First three or so lectures are absolutely boring, but is more interesting as you learn more instruments and how they work.<br /><br />His lecture style is pretty similar to any usual professors, talking on the ppt slides and explaining a bit more on the side.<br /><br />My recommendation is either print out the ppt slide and write on it, or make separate notes, as many parts of what he says (but not on his slides!) are on his quizzes.<br /><br />He likes getting questions asked either in class or after class, and will happily reply.",
            "comment_grading": "Pretty good. Much better than I definitely expected.<br /><br />- TWO assignments, 10% each&nbsp;&nbsp;&nbsp;&gt;&gt;&gt; 20% total<br />- ONE essay, 20%<br />- SEVEN quizzes, 10% each, but ONE lowest quiz grade is not counted&nbsp;&nbsp;&nbsp;&gt;&gt;&gt; 60% total<br />- EXTRA CREDITS of 2% for answering his questions in class<br />(for his extra credits, it is maximum 2%, and he will say how much percentage he will give, e.g. 0.4% if you answer this question. Answer frequently to get full 2%)<br /><br />My grades:<br />Assignment 1: 9.8/10&nbsp;&nbsp;&nbsp;&nbsp;Mean 8.6/10&nbsp;&nbsp;Low 0/10&nbsp;&nbsp;High 10/10<br />Assignment 2: 8.5/10&nbsp;&nbsp;&nbsp;&nbsp;Mean 8.0/10&nbsp;&nbsp;Low 0/10&nbsp;&nbsp;High 10/10<br /><br />Quiz 1: 8/10&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mean 5.4/10&nbsp;&nbsp;Low 0/10&nbsp;&nbsp;High 9.5/10<br />Quiz 2: 6/8&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mean, Low, High not shown<br />Quiz 3: 4/6&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mean 4.4/6&nbsp;&nbsp;&nbsp;&nbsp;Low 1/6&nbsp;&nbsp;&nbsp;&nbsp;High 6/6<br />Quiz 4: 2.33/6&nbsp;&nbsp;&nbsp;&nbsp;Mean 2.9/6&nbsp;&nbsp;&nbsp;&nbsp;Low 0.3/6 High 6/6 <br />Quiz 5: 6/6&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mean 4.5/6&nbsp;&nbsp;&nbsp;&nbsp;Low 1/6&nbsp;&nbsp;&nbsp;&nbsp;High 6/6<br />Quiz 6: 8/8&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mean, Low, High not shown<br />Quiz 7: 7/10&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mean 6.5/10&nbsp;&nbsp;Low 3/10&nbsp;&nbsp;High 9/10<br />(overall, Quiz 4 was discarded for me)<br /><br />Essay: 19/20&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mean 13.1/20&nbsp;&nbsp;&nbsp;Low 0/20&nbsp;&nbsp;&nbsp;High 19/20<br /><br />Extra credit: +2%<br /><br />Final grade: A-",
            "comment_workload": "Not much in the beginning, but grows larger at the end because of the essay.<br /><br />Quizzes are basically notes/slides revision, and were open book!<br /><br />Assignments are sometimes challenging but pretty okay once you read up the textbook.<br /><br />Essay was quite painstaking, as we were supposed to formulate a lab report/procedure of a specific process. Took me 2 weeks full during finals, and you need thorough research if you want the best grades.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jtXCIqz3ZRjDY9zc3YsHhDVr0HObzF7m",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Gordon28",
            "date": "Oct 09, 2019",
            "title": "A Shitty course",
            "comment_content": "The content is not difficult. If you are hard working you should understand them.(You can even understand it without attending CHEM 1020 AND CHEM 1030. Also, although statistics will be taught in this course, the maths is not too hard, which is really frustrating for me, but a relieve for those who struggle with mathematics. In midterm and final exams all you need is to memorise the slides.",
            "comment_teaching": "The teaching is very bad. Although he is quite passionate about teaching and he patiently answers questions, I'd rather spend time reading the textbook than to attend his courses because he skipped so many details.",
            "comment_grading": "Idk cuz I have't taken the midterm test yet. Something special is that he has 2 calculation methods for your performance(the method which gives a higher mark will be used.)<br /> 1st: 20% assignment, 30% midterm, 50% final<br /> 2nd: 20% assignment, 80% final<br />Basically you don't have to worry as long as you do well in your assignment and final.",
            "comment_workload": "Only 2 homework in this course. Very light workload.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RK8JeYSBS41orogjFSK0CyEaK9FUYBEp",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kill me heal me",
            "date": "Feb 02, 2019",
            "title": "Need a strong memory",
            "comment_content": "Measurements and the tools of an analytical<br />chemist, Math Tool-kit, Significant Figures and Errors, Statistics, Least Squares and Quality Assurance, Gravimetry, Titrations, Acids and Bases, Buffers and Indicators, Acid-Base Titrations &amp; N-Analysis, Polyprotic Acids and Bases, EDTA Titrations, Introduction to Electrochemistry, Potentials and Potentiometry: Electrode Measurements, Redox Titrations, Instrumental Electrochemistry, Optical Spectroscopy and Applications.....etc.",
            "comment_teaching": "He is willing to answer students' questions patiently after class which is quite good.",
            "comment_grading": "The means of mid-term and final are around 60%<br />The competition is quite intense I think",
            "comment_workload": "Two assignments, Mid-term and final",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0XWA0Awn5N1eVoDLmsTe7DVI6KnMkET7",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hamburger Milk",
            "date": "Jan 02, 2019",
            "title": "",
            "comment_content": "become harder after midterm",
            "comment_teaching": "Actually, because the course started in the afternoon when I took it, so there's no problem of can't get up early enough to go to the class. Although I can't stop getting distracted cuz the content of this course is kind of boring and honestly the professor's teaching didn't make it better.<br /><br />However, the material before midterm is pretty easy and some of them are covered in gen chem. So i actually thought that I may get a higher score if I hadn't gone to the classes. Because I thot I went to the class so I didn't need to study that hard on these course compared to the most of student in this course. BUT the truth is, I just went to the classes and not so concentrated. So actually I have no privilege than other students. <br /><br />So my advice is stop go to the class immediately if you can't follow the kind of boring class, or you're just wasting your time.",
            "comment_grading": "not very good, i think the mean is about C+.",
            "comment_workload": "just a regular 3-credit course",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "blgPRtQatbcuRjGRRoSgaBaID5t4erkI",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hfchanae",
            "date": "Mar 06, 2017",
            "title": "",
            "comment_content": "The content is all about the general chemical analytical methods. F-test , <br />T-test, closely related to the required textbook.",
            "comment_teaching": "The professor liked to ask question to some students. He could even remember some of their names. He would ask for yr name too in order to know who u are. Remember to attend the class if the professor could recognise you.",
            "comment_grading": "Chem course with the highest mean. <br />Midterm: 35.9/50<br />Final exam: 65.7/100<br />Mean: C+ to B-",
            "comment_workload": "The midterm is quite easy if u remember the notes. Some are even copied as the exam question. Quiz consist of MC. Final Exam would be MC, fill in the blanks and long questions. Lastly, he would ask u to write an essay on how to tackle some analytical issues by the skill learnt from the course. It consists of almost 30 marks. Remember to memorise all the notes, especially the working principle of the instruments. I don't like to memorise those kind of stuff!! This course put me to a disadvantage.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9ZijWx12ufNdOiwYO6vBzZpKtLGZmsMQ",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "andyasdfadfhadt",
            "date": "Jan 12, 2017",
            "title": "",
            "comment_content": "midterm前既classical methods有啲悶同埋無乜用<br />midterm後既instrumental就好啲 但係唔知點解好focus喺啲機器既某啲零件<br /><br />overall黎講都幾淺可以自己睇<br />不過ppt notes有好多out c嘢<br />要上堂／sources先知會考咩重點",
            "comment_teaching": "一般啦 英文好香港 答問題唔清晰",
            "comment_grading": "+~1.2個sd A<br />應該算好 我諗",
            "comment_workload": "無功課 可以自修",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UcgqLYY574CRgtC15J2Ct49ozI82iHFo",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nebbi",
            "date": "Dec 16, 2016",
            "title": "",
            "comment_content": "Cover almost the entire textbooks. 13 chapters for midterm and about 10 chapters for final. Mostly about understanding and less calculation. Very practical knowledge and not as difficult to understand compared to organic chemistry.",
            "comment_teaching": "Going to his class will be helpful, because the lecture notes itself is quite abstract and not much information written on it. Most of the materials can be understood easily, but sometimes his explanation can be quite long and not so efficient. Asking him questions will help.",
            "comment_grading": "2 quizzes, midterm and final. The quizzes are quite easy as long as you prepare for it. Midterm is not hard, cover 13 chapters until EDTA but each chapter is very short. For final, 1 paper cheat sheet handwritten is allowed. He puts unexpected questions, last question is designing an experiment for quantitative analysis. But if you go to his class, you probably can guess the compound he is going to ask for the experiment design because he mention in class quite often. Do the past paper because some of the questions are similar.<br /><br />Either 40% midterm 60% final or 30% midterm, 50% final and 2* 10% for quizzes.<br /><br />Mean about ~60% for both midterm and final. Not sure about the grading because I did pretty good. 87.6% total grade and got A+.",
            "comment_workload": "Compared to organic chemistry, the workload doesn't feel heavy at all. Maybe preparing for quiz but the materials are easy to understand. Most questions are practical and understanding, so no need to think too much about calculations especially after midterm.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uiG08dtDYJIh8crwazYZtJqZOXnoQSH9",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "EdogawaC",
            "date": "Dec 15, 2016",
            "title": "A whole textbook for one semster is a bit too much!",
            "comment_content": "Almost all chapters from Harris textbook was covered. 13 chapters for mid-term, mostly on data analyses, unit conversions and statistics, but not much calculations. Final was the rest of the chapters, mostly on different analytical techniques, GC, LC, MS etc. Cheat sheet allowed but wasn't too useful,&nbsp;&nbsp;quite a few questions on parts and functions of analytical instruments which I hated, plus one essay question on devising an experiment.",
            "comment_teaching": "Average, understandable but sometimes it was quite hard to catch everything the instructor said. Lecture notes were typical and not very inspiring, but if you dont pay attention in class there will be areas you won't understand fully, and he would probably test it in exams.",
            "comment_grading": "2 quizzes, one mid term, one final. Final grade determined by quiz+mid term+final(10,30,60) OR mid-term+final(35,65) if I am not mistaken. Quizzes are not difficult but the questions are quite strangely designed, and sometimes difficult to understand. Both mid term and final did not cover many calculation-type questions, unexpected for an analytical chemistry course.",
            "comment_workload": "Although there is no homework or assignments, those would be very helpful in my opinions, I would prefer to have some homework to consolidate lecture materials instead of being allowed to have cheat sheet. And covering a whole textbook in one course is just too much.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yv6BcMQxMEqs0efrS4Bu6fyI7SV3tpb1",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 46,
                    "name": "CHAN, Wan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "VictorEs99",
            "date": "Sep 05, 2016",
            "title": "",
            "comment_content": "垃圾屎,<br />content多得黎又教唔晒,<br />成日話an chem 2 (chem3320)先教,<br />咁使鬼學咩,<br />個content可以再衰啲,<br />咩都學唔到",
            "comment_teaching": "非常非常非常非常非常非常非常非常非常非常非常非常差,<br />又係垃圾屎嘅作品,<br />而且英文又差,<br />永世都聽唔明佢講咩,<br />靠佢上堂教書死硬,<br />chem major自求多福啦!",
            "comment_grading": "差!<br />final一條essay 30分,<br />無人知佢點比分,<br />聽閒條垃圾屎比女就勁高分,<br />男就無架啦,<br />自己努力用gpa硬接啦......",
            "comment_workload": "兩個quiz,<br />一midterm,一final,<br />workload大唔大就睇人啦,<br />不過垃圾屎堂勁多人出貓,<br />你地唔好期望佢會幫到你,<br />自己諗清楚先去讀啦",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}