{
    "error": false,
    "course": {
        "id": 2601,
        "subject": "CIVL",
        "code": "1150",
        "name": "Climate Change Impacts and Extreme Weather Events",
        "description": "As the extreme weather events emerge as one of the most prominent global risks, climate change and the accompanying natural disasters are no longer a side agenda, but play a critical role in maintaining sustainable societies and economies. This course aims to inspire students to take a broader perspective on environmental issues, in addition to advancing the scientific knowledge of climate change and extreme weather. To effectively achieve this purpose, the course introduces the case studies that emphasize the huge implications of extreme events (e.g. drought, flood, heat waves, typhoon) and their linkage with the warming due to greenhouse gases. This course also assesses the potential impacts of climate changes and extremes on social, economic and environmental sustainability through a multidisciplinary approach.",
        "categories": [
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.25,
        "rating_teaching": 3.5,
        "rating_grading": 3.69,
        "rating_workload": 3.81,
        "review_count": 16,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 973,
                "name": "IM, Eun Soon",
                "count": 13
            }
        ]
    },
    "reviews": [
        {
            "hash": "63FQ6ZoqJbev98cjlCgMFbt8trkkXnrU",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hot soy milk",
            "date": "Dec 26, 2021",
            "title": "An inspiring course",
            "comment_content": "Basically, this course is about is about how to project climate change, different extreme weather events and how climate change's impacts. Before mid-term, we focus on climate models and some background knowledge like energy balance, greenhouse effect, which are quite impressing. After the mid-term, we focus on the impact of climate change and why 2°C warming matters.",
            "comment_teaching": "She has a very heavy Korean accent. At first, I could not understand what she was saying. But after 2 weeks, I got used to her accent. <br /><br />I think sometimes she oversimplified some details so it might&nbsp;&nbsp;be a little bit difficult to catch up if you have no background knowledge about weather and climate. But she was passionate and willing to answer your questions after classes. So you would be fine if you know nothing about climate change.",
            "comment_grading": "Project I Data Analysis: 30%&nbsp;&nbsp;(need to use excel) <br />Project II Short essay: 10% <br />Mid-term Exam: 25% <br />Final Exam: 35%<br /><br />Tip 1: Attend the classes <br />No attendance but High recommended to attend the lesson as at the beginning of every class, she would help you to the review what you learnt in previous class by explaining some true false questions, which may appear again in both mid-term and final exam!!! <br /><br />Tip 2: Ask questions <br /> If you do not know how to do your data analysis report, don't be shy and ask questions. Our TAs even record a video after we asked how to use excel to calculate heat mortality risks. <br /><br />Tip 3: Please recite those abbreviations and the equation for energy balance for your mid-term and final <br /><br />I am not sure whether the grading is lenient but here is my scores. <br />Project Report I: 90/ 100&nbsp;&nbsp;mean: 65.28<br />Mid-term: 70/ 100 mean: 61.31 <br />Final Exam: 91.5/ 100 mean: 76.28<br />Eventually got an A-",
            "comment_workload": "In general, the workload is fair. I spent couple of time on data analysis as I needed to try different ways to present the same set of data. But for report II, it only took me a few hours. <br /><br />Btw, although the final exam was cumulative, we were allowed to bring a one-sided A4 cheat sheet, which was very useful.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nX29pZfWCPyYq9llXEMql9gKOT07l43b",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "horo",
            "date": "Jan 07, 2019",
            "title": "It's good if you come for learning but not grades",
            "comment_content": "The content is inspiring.<br />It talks about how heat stress and weather extremes affect human health and the natural environment, and analyze the factors that change our climate as well as how we can adapt and mitigate the impact of changes.<br />The content is really interesting and useful for my understanding of the world.",
            "comment_teaching": "I know the instructor has a poor accent, it took me two lectures to catch up what she was saying but at the end of the day, you will know what she's talking about.<br />I appreciate her passion for teaching coz she really loves interacting with the students and raising some inspiring questions. I enjoyed her lesson.",
            "comment_grading": "That has made me a bit angry. <br />At the beginning she said she would give out 25% A range but at last only around 10% of us got A range. <br />10% is really so selfish.",
            "comment_workload": "One project in a ppt, one piece of short essay, mid term and final x1.<br />Doesn't seem so much but were quite challenging<br />No attendance is required but you won't know whats going on if you skip classes",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0RI2ZRZRcwi5TIHir9QM9jkqtw9nluZN",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jazper",
            "date": "Dec 19, 2018",
            "title": "",
            "comment_content": "Although it is only a 1000-Level common core course, the content is not easy, especially for non-CIVIL or EVMT major students. Lessons must be attended in order to understand the content. Pure reading of lecture notes by yourself is not enough for this course.",
            "comment_teaching": "The Korean teacher got some accent which made it hard for some students to understand. However, the teacher was pretty good as she explained the content in details and provided a lot of examples for better understanding in class.",
            "comment_grading": "Grade is not distributed yet.",
            "comment_workload": "The workload was just fine. It includes one mid-term, one final and two individual assignments. No MC for both mid-term and final. The first assignment required a lot of time as it was individual work and it was a analysis project. The second assignment was pretty easy.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ULXpqtQEYcVfhBXH5mTbQeObijDXro1m",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chleungba",
            "date": "Feb 07, 2023",
            "title": "",
            "comment_content": "Mid-term Exam (30%)<br />70 min / Closed book<br />T&amp;F and short answer questions<br />Final Exam (40%)<br />2-hour / Closed book<br />Project Report I (data analysis)<br />Project Report II (short essay)",
            "comment_teaching": "Fair enough, but it sounds like Korean English. For your reference, for me, I cannot know all she is saying, but the content is good in the lecture notes.",
            "comment_grading": "There are some tricky questions in the mid-exam and in the final. The bad news is, there are no past papers and references about the mid-term and final. And you need to know all the stuff in the lecture notes.<br />***T&amp;F will have mark deducted if you wrong answer***",
            "comment_workload": "I think it is quite light.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KvGCvCO8ZJZKMspofUR4Rm2CtQqCz3Ep",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "chasiu",
            "date": "Aug 22, 2022",
            "title": "",
            "comment_content": "Extreme climate change<br />cover different kinds of extreme climate change events",
            "comment_teaching": "Fair<br />she gives some of the useful cases in class and gives student sufficient time to discuss and raise questions",
            "comment_grading": "Poor<br />The mean is extremely high and the grading is so sensitive to the participation level you have. If you do not have active participation in class, do not expect a get a decent grade on transcript.",
            "comment_workload": "Light<br />Basically you do not have much to do except final group project and some coursework. But it is quite fair.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "64mkkMRRKnPHvkKGudg2cgrCHEZhAkYW",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cyan42",
            "date": "Feb 06, 2022",
            "title": "good for who are interested in climate change, but not for good grade courses",
            "comment_content": "about climate change, mostly contain geography stuff, need some basic knowledge in physics also <br /><br />01 Natural and anthropogenic climate change<br />02 Climate change projection <br />03 Climate change attribution and <br />detection <br />04 Changes in temperature extremes <br />05 Intensification of the hydrological cycle <br />06 Changes in drought and floods <br />07 Global sea-level rise <br />08 Changes in tropical cyclones <br />09 Freshwater systems and coastal systems <br />10 Food security and food production system&nbsp;&nbsp;&nbsp;<br />11 Public health and urban system <br />12 Climate change adaption <br />13 Climate change mitigation",
            "comment_teaching": "her accent is ok, but you need to hear her attentively ( as a student, basic responsibility la )",
            "comment_grading": "midterm :&nbsp;&nbsp;60/100 , mean 61.3 <br />final : 82.5/100 , mean 76.28 <br />report 1 ( data analysis )&nbsp;&nbsp;: 70/100 , mean 65.28 <br />report 2 : not disclosed <br />overall B",
            "comment_workload": "Mid-term Exam 25%<br />Final Exam 40%<br />Report (Data analysis) 25% <br />Report (Essay) 10%",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MPyXsj2gJh4cm9PWdZJk0zABIMbH9rtz",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "slothslover",
            "date": "Dec 27, 2021",
            "title": "",
            "comment_content": "The first few lessons mainly talked about how climate change and global warming is happening. Later, the instructor had introduced a lot of extreme weather events(drought, flooding, heatwave, extreme cold events, typhoon...etc). The lectures would mainly focused on their characteristics, features and impacts. The last part of the course covered the solutions on dealing with climate change.",
            "comment_teaching": "The instructor came from Korea so she had a typical Korean English accent. I think it required some lessons to adapt and get used to her accent. Although the course did not take attendance, it was important take every lectures since the professor would give detail explanation on each topic which the PPT slide did not appeared. the professor was also very willing to answer questions from students.",
            "comment_grading": "The grading is fair but the contents would be kind of beneficial to those students who studies geography in secondary school. Since some of the contents appeared in the DSE syllabus. <br />Mid-term consist of (T/F questions, short questions) which counted 25% of the course and it was close book. The mean was around (60/100) <br />Report 1 was a report using excel to complete statistic analysis. The mean was around (65/100) and it contributed 30% of the course. <br />Report 2 was a very short essay(within 250 words) about ted-talks which counted 10% of the course. <br />The final exam allowed student to prepare 1 page of A4 size of cheat sheet(hand written), the mean of final exam is quite high( around 75/100). It counted 35% of the course.",
            "comment_workload": "I think the workload started to be heavy after the mid-term exam. Since the 2 reports that counted large weighting for the course required high effort to complete. Their submission date would surrounded the whole November which would takes you time to do, especially report 1. Therefore, if you register courses that had lots of submission date on November, it would be a disaster. Meanwhile, if you are good at handling time, it would be a piece of cake for you.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "m2fCiQDaQGAXWPGHzQvYcfWE03DdSJYl",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "YumeSekai",
            "date": "Oct 07, 2021",
            "title": "Nightmare accent",
            "comment_content": "Content is ok, pretty interesting, and inspiring",
            "comment_teaching": "Worst accent I've ever heard in my life. I cant understand most of the words she says and it is very tough and needs a lot of strength to &quot;guess&quot; whats she is saying. The review below says the accent can be &quot;get used to&quot; but I don't think so. Nightmare.",
            "comment_grading": "NA, this review is written in week 5, no assignments are graded yet. Will be a comeback for a full review after finishing the course.",
            "comment_workload": "Seems OK, but the excel seems tough. Will be a comeback for a full review after finishing the course.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5adlc3nmnA8Lq6FfEkheYhJi3mgQyNwD",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hr8259",
            "date": "Jan 23, 2021",
            "title": "A good course for those who are interested about environment",
            "comment_content": "Rich content. Interesting for those who like studying climates as it goes quite in-depth. Difficulty is appropriate but it may be hard to catch up if you don't have some very basic knowledge about statistics, geography and physics.",
            "comment_teaching": "The instructor is very passionate in teaching and is willing to explain anything as long as you ask. She also likes asking inspiring questions.<br /><br />However, the instructor has a very strong Korean accent, which may be confusing for some. If you feel that you really can't understand what she says after adapting for several lessons, you better drop the course since just referring to the powerpoint slides is not sufficient for a good grade.",
            "comment_grading": "60% open-book quizzes (5x 30-min quizzes, each carrying 10 or 15%)<br />30% Data analysis report<br />10% Essay (~300 words)<br />No attendance, but attending lectures would give some direct answers for quizzes, so it is highly recommended to attend the lectures (or at least watch the lecture videos)<br /><br />I got an A+ so it would be biased for me to say the grading is lenient or not. Here are my scores and some stats:<br />Quizzes: 86/100 mean ~72<br />Project 100/100 mean ~70<br />Essay scores are unknown<br /><br />The instructor did not provide stats for the grades.",
            "comment_workload": "Depends. If you do not revise for the quiz then the only workload are the 2 reports. However, since there are 5 quizzes in the course, you need to spend quite a bit of time revising each of them if you want to get a good score.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QvW2ZQ2qvMTvncboh6ASXP1SJq3PBpQ9",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hahamcdull",
            "date": "Jan 21, 2020",
            "title": "Quite Good",
            "comment_content": "Content:<br />General introduction to climate change and extreme weather events like drought, flooding, heatwave etc. Powerpoint will be provided for each topic and she will review the content of last lecture at the beginning of each class.<br /><br />Policy:<br />Won't take attendance but the answer to review questions will not be uploaded online so have to attend classes. She will also give out some tips on exams during lessons.<br /><br />Grading:<br />midterm exam: 30%<br />project report: 22%<br />Short Essay: 8%<br />final exam: 40%<br /><br />Midterm exam:<br />T/F questions and some short questions. <br /><br />Some T/F questions may appear in the review questions. Revising them will help.<br />Short questions covers contents in the notes so have to recite them. Some may be related to the TED talk that she played during class. Have to look at the videos and understand them before exam.<br /><br />Project Report:<br />Analyse data given by instructor and write short report on it. This year is on identifying climate change hot-spots of extremely heat under global based on climate data provided and socio-economic data which we find on our own.<br /><br />Short Essay:<br />Watch 2 TED talk videos and provide supporting and opposite opinions about the two videos.<br /><br />Final Exam:<br />The format should be the same as midterm but this sem, it is changed to writing 200-300words essay to some short questions. Have plenty of time to research online so not too difficult. Focus less on lecture notes, but understanding still required.",
            "comment_teaching": "Some may say her accent is bad, but it is easy to get used to it. She teaches quite well. Quite funny and will ask for response from students yet not demanding. You can ask questions and she is very patient to answer them. Quite passionate.",
            "comment_grading": "I think if you study the course material well, you can do well in exam. Some T/F questions appeared in notes, revising them will help. T/F questions not very difficult, mostly ask definition of some terms, not very tricky. Short questions are manageable, just recite the notes and some answers of review questions.<br /><br />The grading of short project is reasonable. I put some time in analyzing data and do little research online and little elaboration, then i get 90%.<br /><br />Marks of short essay and final exam not released.<br /><br />midterm: 82/100<br />report: 90/100<br /><br />overall grade: A",
            "comment_workload": "Not very heavy, just have to invest relatively more time on the report, because there are a lot of data and you have to generate graphs and write short descriptions. <br /><br />Other than report and essay, no other assignments. Lecture notes also not lengthy, about 20 slides each with some graphs occupying space. About 20 notes so in total is manageable.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iTVZyrqSjXBDjCZDi2eokthf4IW49boo",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Waiwai666",
            "date": "Jan 06, 2020",
            "title": "Moderate course",
            "comment_content": "There are total 22 lecture materials, and two lectures will be explain the essay and assignment. Although there are 20 lecture materials, each chapter cover pages, which are 10 to 20 pages. You should attend all the lessons as the instructor will show some questions and answers in the lesson which are useful in midterm or exam. For the excel assignment, I think you should attend the lesson and listen the assignment requirements because it is hard for me. The other essay is easy which is doing a conclusion after watching two ted talks. The word limit is 300 words. It is easy to finish it. The mid term exam is easy if you have study all the materials and attend all the lessons. The final exam is changed to essay document because of the suspension. The essay is also easy which covers 1 short question and 4 long questions and each long questions cover 200 to 300 words.",
            "comment_teaching": "The accent of the instructor is poor because she came from Korea. In the lesson, it is hard to understand her pronunciation.",
            "comment_grading": "Excel assignment:22%<br />Essay:8%<br />Mid term exam: 30%<br />Exam: 40%<br />This course will be given a letter grade which are A, B, C, D or F, which will not be given any + or - grade.<br />Mid term below mean 7 marks.<br />Excel assignment below mean 10 marks.<br />Essay and final exam are hidden. <br />Total: C",
            "comment_workload": "There is a mid term, one essay, one assignment by using excel and final exam. The excel requirement is quite difficult to fit the requirements. Therefore, you should attend the lesson. The word limit for the essay is short which you can finish it in one day.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dGBAQrUwFFoP8uome3vOPe1EoJnNChQM",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JellyInfty",
            "date": "Jan 20, 2019",
            "title": "",
            "comment_content": "&quot;This course is basically to persuade you that climate change is actually happening&quot;, quoted from the lecturer.(Of course a lot more)<br />This course is mostly based on IPCC(Intergovernmental Panel on Climate Change) report AR5<br />The content in this course is very ample, especially for someone who is interested in climate change.<br />Other than facts about climate change and extreme events, you can also know more about how a part of the environmentalist community present the science, vulnerability and adaptation of climate change in a scientific way.<br /><br />Before mid-term:<br />Mostly about the science behind the climate change and some introduction to climate models<br />-Facts about climate change<br />-Some basic concepts about climate models<br />-Trends, indicators and other facts about extreme weather events and climate change(drought, flooding, heatwave, sea level rise, cold wave, hurricane)<br />After mid-term:<br />More focused on the risks, vulnerability and adaptation(which means less scientific facts but more related to human)<br />-Impacts of climate and social changes on freshwater systems, urban/rural areas, health, crop production and etc.<br /><br />Also some ted talks about related topics, which some of them were tested.<br /><br />During the course, there were many new concepts and complicated graphs introduced. Understanding all of them may be very difficult to some people, but the conclusions behind them were quite simple and repeated a lot of times, so no need to dwell on them if they are too difficult.",
            "comment_teaching": "The lecturer is from Korean, but quite passionate about answering students' quiries.<br />Become used to her accent after 2-3 lessons",
            "comment_grading": "30% mid-term<br />40% final<br />20% data analysis<br />10% essay<br /><br />As long as you put some effort on doing the two assignment, the mark should be fine, since the lecturer is not that strict<br />Mid-term and final may be a bit difficult to somebody, as there is some calculation in mid-term( but either can be recited from ppt or is provided in the exam paper) and no MCs at all.",
            "comment_workload": "1mid-term, 1 final which both includes True-False questions(need to correct the wrong words) and long questions(she called them short questions though)<br />Two assignments which are 1 data analysis report and an esaay <br />-Data analysis is about evaluating the most vulnerable region(given by the lecturer) in terms of heatwaves based on climatic and socio-economic data, and the mitigation impacts of greenhouse gases <br />Climatic data was provided, and you need to find yourself extra one and socio-economic data<br />The data you find do not have to be 100% accurate, but the way you analyse the data and the way you present the report worth a lot of marks<br />The report have to be written in ppt in 4pages.<br />You will have an opportunity to shortly present your report to all students if you have done well.<br />-The essay is about commenting two ted talks with opposite opinions(not exactly) in 300words.<br /><br />Did not take attendance, but quite a lot of things were not included in the ppts she put in canvas<br />You can understand the whole course by reading the materials (not exaggerating), but it takes a long time<br />The 'text books' are in fact IPCC reports in https://www.ipcc.ch/report/ar5/syr/<br />Most of the content (except the part about climate models) in this course is found there<br />Reading all the materials may not help you gain high marks in mid-term and final since most of the points tested are in ppt or talked about during the lecture(that's why attending the lecture is recommended)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fKwvIe5XhqJMetEb7fEmX2dfb10CiV68",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rt5",
            "date": "Jan 18, 2019",
            "title": "",
            "comment_content": "The content is really useful and informative. Much useful knowledge about global warming and weather would be taught where you would actually feel like learning new things instead of just memorizing the content for exams. The content isn't really that hard and pretty suitable for students to take it for a common core.",
            "comment_teaching": "Except the fact that she has a heavy accent, she is quite passionate on her teaching. She is willing to answer many questions as long as you understand her content. She could repeat some content and slides over and over again just for students to understand that chapter. For her accent though, it takes time to get familiar with her accent but it wouldn't be a big problem later on.",
            "comment_grading": "Not really sure about the grading though i think it is pretty reasonable at least. Since i was still graded a B with some of my work and midterm/exam with score around the mean score only.",
            "comment_workload": "1 data analysis, 1 short essay report, 1 midterm and 1 final exam. Not really a huge workload but quite challenging for a first timer learning about environmental science like the data analysis report requiring skills of excel and some kinds of calculation.While for the essay report, it's not hard as the required content is only your opinion towards certain Ted Talks. No attendance is taken but it is the best for you to attend the lectures as she would talk about the content of the slides in detail which would help you understand better.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "z7z1GuwoAgSBp0B6tMiG3XBpdHDu7fNK",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "studyIsSoHard",
            "date": "Sep 05, 2018",
            "title": "Disaster if u are taught by a Korean teacher",
            "comment_content": "Content is ok , like different climate impacts and how to analyse the impacts by using three factors",
            "comment_teaching": "I couldnt understand a whole sentence. . . the teacher has a very strong accent .....<br />for example, <br />'model' is pronounced as' mother' <br />'is' is pronounced as ' i; and 's'<br />'observation' is pronounced as 'ob' ;jo' 've' 'sion' ...<br />No one can understand even for foreigners...<br />HOWEVER, she has passion in teaching students and she like raising meaningful questions to let us answer and think logically.",
            "comment_grading": "na",
            "comment_workload": "mid term , exam, presentation with ppt and excel",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "0kyngcFgfxPSZSxjDcXQ1iighjqqdZGO",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Woo Hyun",
            "date": "Jan 18, 2021",
            "title": "Review",
            "comment_content": "The content taught in this lecture is actually quite useful in the current society. I think it is an interesting topic to learn about.<br /><br />Climate Change related contents are covered, such as extreme weather events (heatwave, cold wave, etc.), RCP Scenarios, Future Climate Projection and more. If you have any background in geography, this course would be easy for you.<br /><br />Attendance is not necessary, but it would be very challenging to follow the entire course without attending the lectures. She gives a lot of information in lectures and it is not the same to just follow the lecture slides without attending the lectures. I recommend taking all the lectures if possible.",
            "comment_teaching": "She has a hard Korean accent and even as a Korean student, it was not easy to understand as well in the beginning. However, I think it is easy to get used to her accent.<br /><br />In general, her teaching was decent but there were times where it felt very awkward because of the way she teaches. For example, it was when she was giving us feedback for our reports. She picked some samples to show us some good and bad examples and decided to reveal whose report it is and asking them to unmute their mic. I understand she wants to make interactive lectures since she wants you to turn on the webcam for the lectures and tries to randomly pick out students once in a while. However, I do not think she should reveal other students' works in front of the class for obvious reasons.<br /><br />There were more incidents where students were confused. When we took the first quiz, it was challenging to finish the quiz, as time was very limited. It was a quiz where we had to type in our reasoning for the true/false questions, and we had about 20 minutes for answering around 30 questions or more. Also, it was a pop quiz which made it even more challenging. After the quiz, students wanted to discuss the logistics of the quiz, requesting for more time for the future quizzes. However, the way she responded to the students was, &quot;I am the professor and I have the authority to choose the type of the quiz. If everyone felt that they were short in time, everyone is in the same situation so it should not matter.&quot;<br /><br />I personally think the course was not too bad but I personally do not recommend this course because I think there are better courses to take over this course. However, if you are very knowledgable in this area or have a deep interest in this area, it would be a piece of cake for you.",
            "comment_grading": "There are 5 quizzes instead of mid-term exam and final exam. Each quiz is either 10% or 15% worth the final grade. The first 3 quizzes are worth 10% and the remaining 2 quizzes are worth 15%, so in total, it is worth 60%. There are 2 reports to write, one being a data analysis report, worth 30% of the grade. The other report is writing a short essay after watching 2 TED talk videos, worth 10% of the grade.<br /><br />At the beginning of the course, she mentioned that she is a generous grader but I think she grades quite reasonably. She is not a harsh grader for sure but I cannot say she is super generous.",
            "comment_workload": "There are 5 quizzes and 2 reports for the course. Initially, I thought having 5 quizzes might be better than having a mid-term and a final exam but I think it would have been better to have exams instead of quizzes. Each quiz is very short in time and the coverage for each quiz accumulates, meaning that on the last quiz, you are being tested on everything you learned for the term. For the reports, it is probably not as demanding compared to other courses' essay assignments. There is some data analysis to do using Microsoft Excel but then applying the knowledge onto the report is not too difficult. There is quantitatively quite a bit of assignment (quizzes+reports) but they are not super demanding and should be manageable.",
            "rating_content": 5,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "46Q40yOtRqfK63oSDnh6BFLYZMhy2Osj",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 973,
                    "name": "IM, Eun Soon",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Honest Review",
            "date": "Nov 15, 2018",
            "title": "Could not understand the teacher's accent, dropped the course",
            "comment_content": "First few lectures were about climate models, quite boring. Having a physics background would benefit, cos the course talks about the green house effect, albedo etc.",
            "comment_teaching": "Teacher was enthusiastic and engages students by asking questions, but I really had trouble trying to understand her accent. Dropped the course because of this. However, if you manage to understand what she's saying, her teaching is actually not bad.",
            "comment_grading": "Not sure, but my friend who skipped all the lectures and didn't revise much got above mean for the midterm.",
            "comment_workload": "There is a midterm and final exam, plus a presentation.<br />No attendance",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        }
    ],
    "composer": []
}