{
    "error": false,
    "course": {
        "id": 2158,
        "subject": "COMP",
        "code": "3632",
        "name": "Principles of Cybersecurity",
        "description": "This course is an introduction to the principles of cybersecurity. Cybersecurity, also called computer security or IT security, refers to the study of techniques to protect computing systems from attacks that threaten data confidentiality, system integrity and availability. By modeling, analyzing, and evaluating the security of computer systems, students will learn to find weaknesses in software, hardware, networks, data storage systems, mobile applications, and the Internet, and identify current security practices and defenses to protect these systems.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1810,
            1710,
            1630
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"2012\" href=\"/review/COMP2012\" target=\"_blank\">COMP 2012</a> OR <a class=\"course-link\" data-subject=\"COMP\" data-code=\"2012H\" href=\"/review/COMP2012H\" target=\"_blank\">COMP 2012H</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.42,
        "rating_teaching": 4.42,
        "rating_grading": 3.67,
        "rating_workload": 3.17,
        "review_count": 12,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1276,
                "name": "WANG, Shuai",
                "count": 7
            },
            {
                "id": 910,
                "name": "WANG, Tao",
                "count": 5
            }
        ]
    },
    "reviews": [
        {
            "hash": "l21UxfYDVMu34sETfWUG2rfIBfiqm1j3",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1276,
                    "name": "WANG, Shuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "B.T.",
            "date": "May 27, 2021",
            "title": "Prof抄上年final搞到要re-do 之後有得揀用前面啲嘢去weight 不過爛grade",
            "comment_content": "正常contents 同其他 review一樣<br />Contents廣而唔深 會好似走馬看花咁 冇咩問題嘅 反正呢個course係intro course <br /><br />好多時上堂notes教嘅contents唔足以應付homework, exams 同 hacking practice 要自己google搵資料",
            "comment_teaching": "一般 有熱誠 口音勉強ok <br />教得有啲悶 試過唔小心瞓著 不過佢教教下會攞紙出嚟畫 都會解答學生問題 只係時間控制方面麻麻地<br /><br />Tutor TA會俾好多功課同hacking practice嘅hints &gt;&gt;&gt; 話時話 咁樣有冇unfair呢<br /><br /><br />———————————————<br />Updated 28/5: (from “C” to “B”)<br />喺make up final開考前約24個鐘<br />Prof send 咗email 俾大家揀 option 1/2 可以all in midterm+hw 唔計final<br />見到 Prof真係有認真睇哂每一封email 有去將我哋講嘅嘢記低 再同上頭反映雖然件事佢點都有錯 但起碼有考慮學生意見 都算係咁 其他嘅嘢應該都唔係佢話事 暫時都算可以接受",
            "comment_grading": "Scheme係<br />5% in-class quizzes (5 random)<br />20% midterm<br />30% final<br />40% hw x4<br />5% hacking practice<br /><br />屌你老母<br /><br />4份assignment midterm 同 final 係copy and paste 上個sem 改個日期就release俾我地做<br /><br />其實呢 我自己對佢係咪copy&amp;paste 冇乜所謂 反正以往嘅assignment exams 都係冇release solutions 上網搵到坊間答案都唔知啱定錯 所以都係要自己思考<br /><br />其實都唔止<br />連in-class quizzes 都係抄上年<br />冇quiz嘅日子得30-40人上堂 有quiz嘅日子有差唔多70人上堂 明明random喎 點解嘅？咪聽上個sem個friend講咗邊日有quiz囉<br /><br />Hacking practice 係咪抄我唔知 我估應該都係 即係話呢個course有超過95%嘅嘢係抄上個sem<br /><br />仲有5%？ midterm好似加咗幾條T/F 另外加咗一個in-class quiz 以前好似4個 大概係咁<br /><br />————————————<br />Updated 8/6: from “E” to “E” (I hope I can select an F)<br />Grade我諗係跟normal distribution 正常curve派<br />唔計final 我overall高mean 4分左右 食B<br /><br />派grade係正常嘅 應該冇特別派得差 但係都冇特別派得好 而呢個就係個問題囉<br /><br />你要重考final 首先就算重考 時間唔同咗未必每人都有相同嘅發揮<br />其次 有得用先前嘅嘢去乘大weight 變相midterm+hacking practice做得好與唔好就定生死<br />再者 你出到份重考卷都唔太容易 而assignment 嗰啲例牌全班滿分 基本上冇乜人用得著計final嗰個scheme 變咗全個course Midterm+hacking定生死 咁公平咩？<br />有啲人可能擅長某啲topic 或者之前就係見後來有嘢可以追 冇出全力 而家搞到佢地爛grade 咁樣公平咩？<br /><br />特殊情況下 派多幾個%嘅A真係咁難？<br />搞到重考final咁大件事我覺得派30%A 甚至35%都唔過分 <br /><br />我知道ust對派grade嘅要求 但我都知道instructors係可以喺特殊需要之下寫justification要求派多啲A 例如一啲honor course或者以前社運嗰陣都試過<br /><br />既然社運嗰陣因為改grading scheme可以派多啲A 而家都有改scheme點解唔可以派多啲A呢？係instructors問題定係department問題？我都唔知，總知全件事就好有問題",
            "comment_workload": "好啦 全個course都係抄<br />而家話final因為抄上年所以要重考<br /><br />首先 點解final重考 midterm唔係重考? Assignments 唔洗重做? In-class quiz 唔洗重新上過25堂1.5小時再random揀日子？唔通30%可以代表一切？唔fair就唔fair 唔會因為重考而fair咗 lol<br /><br />第二 喂大佬完撚咗sem先講 仲要得兩日通知 溫好哂書都唔記得啦 得&lt;48小時點pick up? 我屌你老母 考完試已經好攰 好多人plan咗做其他嘢 我地冇責任預留exam period以外嘅時間嚟考試 我地肯考係人情 唔考係道理 就算我地一直send email話唔得閒考 你都冇得強行逼我地考<br /><br />第三 你話因為reuse paper 所以驚cheating + plagiarism, 你要重考一樣係唔洗join zoom 又 open everything ，咁就算份paper係全新 學生一樣可以請槍做 唔洗自己識做 咪一樣係cheating 仲要你冇可能捉到㗎喎<br /><br />第四 而家都冇人話份考試有問題係你自己話自己有問題 聽Professor email口吻 多啲似係CSE head / ARR 主動叫佢重考 而唔係有學生覺得unfair之後投訴 其實本身份卷係reuse我諗大家都知 但冇人會覺得unfair因為呢科所有野都reuse都係大家都知 reuse咪有reuse嘅玩法囉 冇問題㗎都係fair喎 喂而家你突然通知兩日內再考試咪仲唔fair? 如果有人請槍 呢個時候請槍 趁其他人溫唔切 佢地咪仲有用<br /><br />完全唔明乜嘢邏輯 佢地嘅目標係想fair 定係想玩9我哋班學生呢?<br /><br />本人諗到可行+有效嘅方案：<br />Assume學生都係乖 冇cheat<br />1. 跟番原有scheme 當冇事發生<br />Assume 部分學生有cheat<br />2. Organise 個 oral exam 解釋番做過份卷 解釋正確先有分<br />3. 係較後時間 (下個月/下sem頭) 俾學生有充分準備先重考 ARR要official publish一個日子 而考試應該係以ZOOM Proctor Mode 先有意義<br /><br />————————————-<br />Updated 28/5: from “E” to “D”<br />本身呢個course workload都算重重地 功課偏長 hacking practice又要自己摸索<br />Worklod 應該值 “C”<br /><br />而家可以選擇唔考redo exam, workload可以算係冇加過 唯一點解俾”D” 係我地好多學生花咗時間同心機寫email反對強行考redo final, 呢啲都係workload :/",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 30,
            "vote_count": 31,
            "voted": false,
            "is_upvote": false,
            "comment_count": 3,
            "attachments": []
        },
        {
            "hash": "mlJHwn4DaSK77Jv8CQ2QVe9yQw9xAa8B",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1276,
                    "name": "WANG, Shuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tommy Li",
            "date": "Dec 27, 2019",
            "title": "HACK101 Introduction to Hacking",
            "comment_content": "This is mostly a conceptual course about cybersecurity. Lots of interesting theories in cybersecurity are introduced. There are five main parts in the course:<br /><br />1. Security basics: CIA principle, threat models<br />2. Cryptography: Stream and block ciphers, RSA, hashing<br />3. Software security: Buffer overflow, obfuscation, malware, security testing<br />4. System &amp; web security: Authentication, access control, side channel attacks, firewalls<br />5. Security on emerging platforms: Blockchain, smart contract, IoT, machine learning<br /><br />Have you ever imagine you can infer the password by recording the sound while encrypting? How to fool a machine learning AI to label a dog as 'cat'? How does a hacker steal all the cryptocurrency from badly designed code? Cybersecurity is always an interesting topic in computer science. For the level of this course, it only gives a general introduction but not heavy maths nor programming. It should be suitable and fun for most CS students.<br /><br />The only hands-on experience for hacking is the optional project. We are given a vulnerable website to conduct different types of attacks. For example, bypassing the login, stealing the passwords, or even hang up the site. Although the way to hack is not covered in class, it is fun to explore around and learn by yourself. You will be rofl when you have found a stupid vulnerability in the site.<br /><br />P.S. &lt;b&gt;Be ethical. Don't attempt to hack others without permission.&lt;/b&gt;",
            "comment_teaching": "The prof. seems to be a nice and passionate guy. I haven't talked with him in person. But he sometimes asks us questions and tells some funny things in class. He also left a &quot;well done, thanks for your effort.&quot; comment on my exam submission. Maybe I did well in questions that are his research topic. (My classmate and I found his research paper when searching for info in final lol) I only sent him email once and he did not respond. Maybe he missed it by mistake.&nbsp;&nbsp;<br /><br />He teaches okay. He is not a &quot;PowerPoint&quot; reading guy. He usually will put some time explaining the slides. But it is dubious whether everyone could understand the explanations as they are quite messy.&nbsp;&nbsp;And his tone is ..., I think I slept quite a few times in his lecture. :C<br /><br />Martin, the course TA, is a weird but funny guy. He likes joking about how lazy he is. &quot;The worse TA in UST&quot; he claimed. He don't know how to teach and always give out the answers &quot;accidentally&quot;. He gave us some midterm tips but they are not that useful......&nbsp;&nbsp;Anyway, I admire his courage to speak &quot;______, ______!&quot; when he was testing the mic. Hope he won't be silenced or get fired.",
            "comment_grading": "The grading curve seems to be similar or better than a standard course. However, being one of the top students is not easy that it requires some luck and effort. <br /><br />The midterm and exam is quite difficult. Since there is not any paper checking session (and answers are not given), you would not be able to argue your marks. IMO the TA seems to be quite strict with the marking, you won't be able to get score for alternative answers. As this is a cybersecurity course, the questions are mainly case-studies which multiple answers may arise. <br /><br />There is an optional project that can pull up your score. It seems only a few people have attempted it. It is difficult for first time hacker (like me). But still, there should be no problem completing it with some googling (for hints). The weighting is quite high (completing it equals 15 points in midterm!) so it should secure you from getting a bad grade. My scores in midterm and final are under the top (max score) student quite a bit but I still got an A.<br /><br />Score stats and my score:<br />Assignment 1 (10%): <br />116/124 (Mean: 103.9, Max: 120) =&gt; 9.35/10<br />Assignment 2 (10%): <br />219/224 (Mean: 204.2, Max: 224) =&gt; 9.78/10<br />Assignment 3 (10%): <br />43/43 (Mean: 38.1, Max: 43) =&gt; 10/10<br />Assignment 4 (10%): <br />36/38 (Mean: 32, Max: 38) =&gt; 9.47/10<br />Midterm (20%): <br />47/75 (Mean: 41.1, Max: 61.5) =&gt; 12.53/20<br />Final (30%): <br />110/128 (Mean: 85.8, Max: 120) =&gt; 25.78/30<br />Participation (10%): <br />10/10 (Mean: 8.3, Max: 10)<br />Optional Project (4%, bonus): <br />100% completed, score unknown<br />Overall: <br />86.91% (+?.??% project) =&gt; A <br /><br />All SD are not released. Optional project score is not released.<br />(I have sent an email to both the prof. and TA asking the optional project score (on Dec 18). There is still no response as of the time writing this review.)",
            "comment_workload": "The workload of the course is moderate. <br /><br />The assignments are quite long. You usually cannot find the answer directly in the slides. You have to recall the things talked in class and understand the content in order to answer. Alternatively, you can ask Martin to get the answer directly...... <br /><br />As the prof. is new, the course format has revamped and there isn't any past paper. Most likely, you won't have materials for revision. I think reviewing the materials once should be fine since there isn't anything more you can do. Just write the answers and hope for the best.<br /><br />There are in-class quizzes. The dates of the quizzes are not announced. The questions are easy (~2 questions, answers can be found in slides) as those are simply for attendance checking. Make sure to attend the lectures or ask your friend to submit it for you.<br /><br />The optional project took me two days to complete. You have to do self-learning for the project. With hints from Google and some trial and error, it should be feasible to complete the project. It takes some time to get the attacks right. It is fun to craft up the attack tho, and you will feel a sense of accomplishment when you successfully attacked the target. I AM A MASTER HACKER HAHA! (just kidding)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Nb0Z0dqi0MvEgF55jvdTQnfly08PyPys",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1276,
                    "name": "WANG, Shuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ptrknow",
            "date": "Dec 28, 2020",
            "title": "COMP4901Q - Competitive Essay Writing in Cybersecurity",
            "comment_content": "Highlights of the content:<br />- Focus on a lot of attacks<br />- Main focus on software exploitation<br />- Blockchain and smart contract introduced<br />- Machine learning security introduced<br /><br />Please refer to other posts for the full syllabus. Although this course is only scratching the surface of many areas, I suppose this is fair enough for an introductory course.",
            "comment_teaching": "His explanation is kind of detailed, although he does not speak in the most direct and concise way.<br /><br />His tone might make you sleepy.<br /><br />He used a microphone with low capturing volume. Be aware if you tune up your computer volume, because someone might accidentally unmute and blow up your ears....",
            "comment_grading": "Assessment&nbsp;&nbsp;&nbsp;&nbsp;Mean&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;My result<br />==========&nbsp;&nbsp;=====&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;=======<br />Ass1(10%)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;108.7/124&nbsp;&nbsp;&nbsp;&nbsp;124/124<br />Ass2(10%)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;256.6/278&nbsp;&nbsp;&nbsp;&nbsp;272/278<br />Ass3(10%)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;55.9/61&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;58/61<br />Ass4(10%)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;36.7/46&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;38/46<br />MT(20%)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;45.4/71&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;59.5/71<br />Final(30%)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;123.4/165&nbsp;&nbsp;&nbsp;&nbsp;140/165<br />Quiz(10%)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4/4<br />Bonus(5%)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1.25/5<br /><br />Grade = A-<br />Obviously, the grading curve is far from the best, and the competition is fierce.",
            "comment_workload": "Apart from the concepts of cybersecurity, you will also learn how to do paraphrasing, generalization, googling, and learning new things on the fly. <br /><br />I don't want to repeat what other reviews have already mentioned. I just want to ask, is it the real &quot;Technical Communication&quot; course?",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qljgbn6edsjsJ2yWQcobAfbQ75iRJv29",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1276,
                    "name": "WANG, Shuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Threch",
            "date": "Dec 28, 2020",
            "title": "",
            "comment_content": "Mainly concepts, not many mathematical calculation.<br /><br />1. Crypto: Symmetric Key, Public Key<br />2. Reverse Engineering<br />3. Malware<br />4. Software Exploitation and Protection<br />5. Software Security Analysis: Dynamic and Static<br />6. Side Channel Attack<br />7. Authentication: Password and Biometrics<br />8. Network Security<br />9. Authorization<br />10. Blockchain and Smart Contract<br />11. Machine Learning Security<br /><br />HAPPY HACKING!",
            "comment_teaching": "Prof. Wang will explain the concept in detail and using extra handwritten diagram :D in explanation. He is also willing to answer students questions and TA will be in the Zoom meeting during lectures to answer student questions. If you have any questions on the contents during lecture, just ask them and they will explain to you which is good.<br /><br />Last thing, Professor can you speak up when you are teaching in classroom using zoom. Every time I need to turn the volume to 100 to listen Professor's voice D:",
            "comment_grading": "In class quiz 10%<br />Assignments x 4 40%<br />Midterm 20% (Open Book)<br />Final 30% (Open Book)<br />Bonus Homework extra 5%<br /><br />In class quiz is very easy. All of you should be able to get full mark in this part. <br /><br />Each assignments mean is around 80 - 90%.<br /><br />Assignment 1 124 / 124<br />Assignment 2 278 / 278<br />Assignment 3 61 / 61<br />Assignment 4 40 / 46<br />Bonus: 1.25 / 5 (total 4 flags)<br /><br />Midterm 52 / 71, mean 45.4<br />Final 145 / 165, mean 123.4<br /><br />Note for final examination: Check out Professor homepage in CSE, you may find something useful :D.<br /><br />Grade: A- :(",
            "comment_workload": "Assignments are like essay writing competition. They claims that if you hit the point then you can get the mark, no long answer is needed. However you never know have you hit the point they want even you google a lot. So it is still an essay competition for each assignment and exam.<br /><br />Assignments are not difficult, you can google the answer or just find it in lecture slides.<br /><br />Bonus homework is about Capture the Flag (CTF). It is fun to play with it. If you have background of CTF, then you probably get this 5 marks easily.<br /><br />Midterm is held during normal lecture time, professor claims that we can finish it in time and it is not difficult. <br />But it is not.<br /><br />Final is a take home examination. Professor gives us 24 hours to finish it. Again, he claims that question are not very difficult and we can finish it within 3-5 hours.<br /><br />I have done it by using 15 hours.<br />Outstanding Move Professor.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WcDikC8wmw4KV0WB2NTnREaxTgD0RNmF",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1276,
                    "name": "WANG, Shuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Argen",
            "date": "Jan 03, 2020",
            "title": "Nice Prof., Updated Content, Interesting HW/Project",
            "comment_content": "Wang Tao focuses on &quot;Principles&quot; of cybersecurity, while Wang Shuai's content is more biased to &quot;Practice&quot; and &quot;Examples&quot;. The theoretical part of the course is cut to a large proportion, and replaced with content related to his own research — Cybersecurity in Software Engineering. <br /><br />If you would like to learn more about software safety, security analysis, and possible leak holes in different applications, this course with Shuai is an eye-opener for you.<br /><br />A brief outline of the content<br />1. Introduction (same principles)<br />2. Symmetric Keys Cryptography<br />3. Public-private Key Cryptography and Hashes<br />4. Reverse Engineering<br />5. Malware and Attacks<br />6. Software Obfuscation<br />7. Fuzzing, Taint Analysis and Side-Channel Attacks<br />8. Biometric Passwords<br />9. Network Security<br />10. Blockchain and Smart Contracts<br />11. IoT and Machine Learning Security<br /><br />Upon the topics, I think (6), (7) and (11) are unique topics of Shuai.",
            "comment_teaching": "Not bad, if you are fine with his accent. His lecture is slightly boring but informative. He is eager to know any feedback on his teaching and content as he does not have much teaching experience. And he responds to emails very quickly. <br /><br />In the lecture, he explained things pretty well and usually discussed a lot using the whiteboard. Content of elaboration written on the whiteboard might be tested and not necessarily mentioned in the notes. So attending the class is important not to mention the in-class quizzes.<br /><br />General speaking, Shuai is not bad, though some may suggest Tao teaches better.",
            "comment_grading": "Don't underestimate the importance of assignments and participation. They matter a lot in this course, especially when there are only 3 in-class in my semester (edited: you will get 7 + number of completed quiz for your mark.)<br />10% - Participation and in-class quizzes<br />40% - Assignments<br />20% - Midterm exam<br />30% - Final exam<br />4%&nbsp;&nbsp;&nbsp;- Optional Project<br /><br />Shuai tried to distribute good grades but got rejected by the department. In the end, he strictly follows the distribution suggested by the university.<br />~15% A<br />~35% B<br />~40% C<br />If you get mean or slightly above mean, you can expect a C+/B-.",
            "comment_workload": "Fair.<br /><br />4 Assignments: each ~8 long questions and can be finished within 3 hours. For some questions you are expected to google for answer/hint. Shuai likes to ask whether some techniques solve/improve certain issues very much. Some questions in the assignments can reappear in midterm/final.<br /><br />In-class exercise (attendance): just to answer 2-3 simple questions. They can be found easily in the notes.<br /><br />Optional Project: Some web penetration to the OWASP project. It requires a lot of self-learning and effort for trial-and-error. It provides an opportunity for beginners to keep in touch with tools in the cybersecurity field like elasticsearch (logging tools), Burp Suite (web hacking), hashcat (password crack), etc. For the solution, Google it and you'll find everything.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 4,
            "attachments": []
        },
        {
            "hash": "yP88RDjw1LBQDXK48TG8OGt3aYtazgEX",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1276,
                    "name": "WANG, Shuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Xelopie",
            "date": "Dec 12, 2020",
            "title": "!!!!!!Fair Conceptual Course!!!!!!",
            "comment_content": "--------------------------Spoiler warning here--------------------------<br />If you are aiming to learn real hacking stuff or CTF thingys, I suggest you not to take this course and stop reading now. If you are aiming to improve your knowledge of security for workspace, then you might consider this course. Personally I have little background on game hacking.<br />--------------------------Real Content here----------------------------<br />(I just type out the topic according to syllabus, skip this part if you just want to read comments)<br />1. Symmetric key crypto<br />2. Public key crypto<br />3. Hash function<br />4. Reverse engineering<br />5. Malware<br />6. Software exploitation &amp; protection &amp; analysis<br />7. Side channel attacks<br />8. Authentication &amp; Authorization + Network security<br />9. Protocol<br />10. Bitcoin stuffs (blockchain + smart contract)<br />11. Machine learning security<br />-----------------------------Comments--------------------------------<br />1. Lots lots lots of concept, very high level stuffs and ideas<br />2. Just very basic and simplified idea taught in lectures<br />3. Real implementation is relatively not important in this course<br />4. IDEAs are important, POSSIBILITIES too !!!!! (but how are you gonna know if your idea is possible if you don't implement it)<br />5. Rely to GOOGLE, please google everything<br />6. Ideas in crypto/side-channel are really hard to just imagine<br />7. Other topics are fairly fine to me<br />---------------------------Final reminder------------------------------<br />Really don't expect too much from this course. It won't help you write a simple modern hacking tool. It just brings you concepts (or even mindset? who cares?)",
            "comment_teaching": "I can say it's quite good although the content may seems boring and it's putting me asleep (always). This semester is online teaching so I can always pause the video and go to sleep when I get bored. Prof. Wang gives a very detail explanation. He would illustrate the examples with hand drawing and writing. You must follow very closely if you only rely on lectures. DON'T miss a single part as it would break the connection between the ideas. Prof. Wang is also enthusiastic to answer question. Normally he would respond to email in 1 day. Anyway for homework you can just ask TAs.",
            "comment_grading": "Didn't received the grading when I was writing this review. (may update it later if possible)<br />Homework mean is ~80%. Short HW means can be ~90%<br />Midterm mean is ~50% even though open everything (i.e. google).",
            "comment_workload": "Quite a lot TBH.<br />I don't really like doing essay-type questions/short questions. But in most homework there are such questions. You need to hit the key points for marks (even though you can google, you might not hit the key).<br /><br />- 4 Homework Assignments (2 Long, 2 Short)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&gt; Long ~half day<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&gt; Short ~3 hours<br />- 1 Bonus homework (CTF challenges)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&gt; Just google everything and hopefully you can get solutions<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&gt; Personally I did 3 CTFs out of 4 in 9 hours starting with no CTF background<br />- Midterm (open-all)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&gt; Limited time (2hrs)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&gt; Quite hard concept questions (Professor said it's easy.....lol)<br />- Exam (take-home 24hrs exam)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&gt; I spent 10 hrs (without any revision because it's take home)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&gt; Professor said 3-5 hrs should be enough.....lol",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jeCQu6pDYumvR8Iatq3u1ZoKWZrELaAl",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 910,
                    "name": "WANG, Tao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LG7",
            "date": "Jan 15, 2018",
            "title": "Heavy workload but easy exam",
            "comment_content": "Mainly about:<br />- Cyber attacks<br />- Encryption<br />- Defence of attacks<br />- Intellectual Property<br /><br />It is a plus that the lecture material are very up-to-date. They are not old attacks or text-book like examples. The professor includes many new exmples.",
            "comment_teaching": "- Many interesting stories, good examples and illustrations.",
            "comment_grading": "Good grading, with &gt;30% A ranges.<br />The final and mid-term is quite easy, but accounts for limited weighting for the overall grade.",
            "comment_workload": "Workload is high. The 3 programming assignements take efforts and time to finish. Be prepared to deal with comparatively low level coding, e.g. bit-wise operations, encrpytion, etc..",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QooEL3YPWIF31peo8FYS5j0nrRoWtcAT",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1276,
                    "name": "WANG, Shuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nemoblue",
            "date": "Feb 03, 2021",
            "title": "",
            "comment_content": "Basically it is good to learn things related to cybersecurity from this course. The contents is not complex but can be much more than you think, from RSA to Bitcoins.",
            "comment_teaching": "Prof.WANG's teaching is just above the average. Some may want to fall asleep if they don't really like the topic. But if you are interested in it, you'll have fun with him.",
            "comment_grading": "The grading is not so good for an unclear grading scheme. My grade is generally above average and get full marks for bonus and get B+ finally. It seems everyone can get full marks for bonus. The exam is open book but you have to answer carefully with fully understanding to get full mark for every question.",
            "comment_workload": "The workload is not so high if you have a basic backgound on computer science. But if you haven't learnt machine languages and python, you may find it difficult to finish the bonus part since there is no hint for&nbsp;&nbsp;you.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GUwe32fwF8bYBzeUeuzwlMUVS7sr9XFy",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 910,
                    "name": "WANG, Tao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jda0",
            "date": "Feb 26, 2018",
            "title": "",
            "comment_content": "The content was dry, but appropriate for the course and the PowerPoints are of an efficient level of detail both for learning and for revision.",
            "comment_teaching": "The course is well taught; enthusiastically and in good English. Tao is clearly interested in his field and this shines through in his positive demeanor and in taking the time to take extra questions and discussions on after class and by email.",
            "comment_grading": "Grading was fair.",
            "comment_workload": "The assignments are challenging but not unjustly so. They are also relevant to the course, implementing techniques learned in class in two sections (knowledge and programming implementation). However, they can be time consuming and I think having less questions would still be adequate given the programming assignment as well.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KPho36AkFXg6QttCcbsshgi1YCHE73Kh",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 910,
                    "name": "WANG, Tao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "阿道",
            "date": "Jan 23, 2018",
            "title": "",
            "comment_content": "The content is somewhat boring as it is all principles and not much application. However, its a good primer if you want to get into the cybersecurity field and just general IT knowledge.",
            "comment_teaching": "His English is great and he does a wonderful job explaining ideas and sharing stories. I enjoyed class when I went to it and never fell asleep like I do for most engineering classes.",
            "comment_grading": "The grading was fair. I didn't get a good grade, but that's because I was only able to partially complete some of the assignments, but the exams are still simple multiple choice or fill in the blank type questions.",
            "comment_workload": "The 3 homework assignments are definitely very challenging. You definitely need good C++/programming skills to apply the theory he teaches. Otherwise, the tests are pretty easy.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9yVhYt5LeLsOOFyHwSk6Yr9Z2szgJyrM",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 910,
                    "name": "WANG, Tao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nar",
            "date": "Dec 29, 2018",
            "title": "professor 係 cs 清泉",
            "comment_content": "Modules:<br />- Principles of Cybersecurity: &quot;CIA&quot;, secure design<br />- Software Security: intentional flaws, unintentional flaws, malware classificiation, defensive strategies<br />- Internet Security and Privacy: cryptosystems (SKE, PKE), integrity verification and authentication (cryptographic hash, MAC, PKI), cryptosystem attacks<br />- Network Security and Privacy: network basics, impersonation attacks, DoS attacks, defences (firewall, VPN, Tor)<br />- Data Security and Privacy: data security (access control, error checking/correction, backup), data privacy (inference attack, k-Anonymity, differential privacy, secure multiparty computation, private information retrieval), bitcoin<br />- Human Cybersecurity: socio-legal cybersecurity, cybersecurity in business, usable security and privacy<br />留意返呢個 course 真係講 principles，唔會涉獵到太深入嘅技術層面或者係 implementation。其實幾合理，淨係講 cryptosystems 已經可以係一個 course。<br />attack examples 由舊(定係叫classical?)到新都有<br /><br />Assessment:<br />- Assignment * 3 (45%)<br />- Self-Assessment (for each module) (5%)<br />- Midterm (20%)<br />- Final (30%)<br />下次 course offering midterm 同 final 嘅比重會係一樣，因為考試係 non-cumulative<br /><br />slides 幾精簡冇廢話<br /><br />每份 assignment 都有分 written + programming parts<br />programming 嘅 tasks 幾盞鬼，有 attack (exploiting buffer overread/overflow, crib-dragging)、有 application (叫你用 PGP, AES 加密, Tor) 同埋 implementation (hamming code)，唔係悶嘅 assignment<br />require 自己打 code 嘅 task 幾自由，可以用 c++/python/java or 無特別限制<br /><br />self-assessment 係 canvas 嘅 mc quiz，無限 attempt",
            "comment_teaching": "professor 啲英文幾好聽，上堂內容好豐富，會補充返 slides 嘅內容，唔係照讀<br /><br />可以用 1.5x 速度 睇 lecture video 當溫書",
            "comment_grading": "Mean:<br />- A1: 69.1/75<br />- A2: 60.8/75<br />- A3: 60.5/75<br />- Midterm: 52.9/80<br />- Final: 65/90<br />- Overall: ~77.64%<br />prof 話畀 grade 會考慮到今年份 midterm 比較難，唔知最後有冇好 grade 咗呢 (?)",
            "comment_workload": "workload 嚟自 assignment 同 上堂/睇lecture video<br />prof 上堂講幾多 lecture slides 冇寫低嘅嘢，不過會考返，所以一定要上 lecture jot notes，slides 只係輔助<br />Assignment 佔分極重，畀啲心機做+做埋啲bonus question有著數",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "doIlTFF1GnWVOHWLgQipQGIq8TOihfwW",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 910,
                    "name": "WANG, Tao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "delf",
            "date": "Dec 16, 2018",
            "title": "Great Instructor, Appropriate Content, Fun Programming Assignments",
            "comment_content": "The content for the course was well selected and taught at an appropriate level for an introductory course to cybersecurity. A large number of topics were covered but the material did not go too in depth so it was all easy to understand. Will help you get a good idea of the current cybersecurity landscape and the practices followed.<br /><br />Taking this course was very useful for internship/job interviews because interviewers usually asked some simple cybersecurity related questions (public key cryptography).",
            "comment_teaching": "One of the most interesting and motivated lecturers I have had at UST. He was very well versed in the course materials and was available to explain things in depth after class. Lectures were always interesting as there was a lot of discussion and he would supplement the lecture materials with his own experiences and real world events.",
            "comment_grading": "Grading was quite fair. Exams required you to know the lecture materials well, taking notes in class was necessary as lecture slides do not contain a lot of information.<br /><br />45% - 3x Assignments (15%)<br />A1 mean: 67.3/75<br />A2 mean: 51.8/75<br />A3 mean: 50.8/75<br /><br />5% - Online Self-Assessment<br />Questions were pretty straightforward<br /><br />20% - Mid-term Exam<br />Mean: 58.7/80<br /><br />30% - Final Exam<br />Mean: 76.8/120",
            "comment_workload": "The assignments were not trivial, they required some time to think about, but they were also well thought out and at an adequate level of difficulty. Working on the programming tasks was a lot of fun and there was also a lot of freedom in the implementation of the assignments.<br /><br />Going to class is necessary since most of the information came from what the professor said in class rather than slides. The whole value of the course came from the lecture though so it would be pointless to take this course and not go to class.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}