{
    "error": false,
    "course": {
        "id": 227,
        "subject": "COMP",
        "code": "3721",
        "name": "Theory of Computation",
        "description": "This course is an introduction to the foundation of computation. Topics covered include set theory and  countability, formal languages, finite automata and regular languages, pushdown automata and context-free languages, Turing machines, undecidability, P and NP, NP completeness.",
        "categories": [],
        "website": "https://course.cse.ust.hk/comp3721/",
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1530,
            1430
        ],
        "prerequisites": "(<a class=\"course-link\" data-subject=\"COMP\" data-code=\"3711\" href=\"/review/COMP3711\" target=\"_blank\">COMP 3711</a> OR <a class=\"course-link\" data-subject=\"COMP\" data-code=\"3711H\" href=\"/review/COMP3711H\" target=\"_blank\">COMP 3711H</a>) AND (<a class=\"course-link\" data-subject=\"MATH\" data-code=\"2111\" href=\"/review/MATH2111\" target=\"_blank\">MATH 2111</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2121\" href=\"/review/MATH2121\" target=\"_blank\">MATH 2121</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2350\" href=\"/review/MATH2350\" target=\"_blank\">MATH 2350</a>)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.36,
        "rating_teaching": 4,
        "rating_grading": 4.27,
        "rating_workload": 3.91,
        "review_count": 11,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 105,
                "name": "ZHANG, Nevin Lianwen",
                "count": 9
            },
            {
                "id": 106,
                "name": "TAI, Chiew Lan",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "5y1MQsi2WVTXbWHPbixTfuGy0I4cH95F",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 105,
                    "name": "ZHANG, Nevin Lianwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ptrknow",
            "date": "Dec 31, 2020",
            "title": "Philosophy of Computer",
            "comment_content": "Main Outline of the Content:<br /><br />Part 0: Preliminaries<br />Set theory, function, relation, language, countability<br /><br />Part 1: Automata Theory<br />1.1 Regular Language (RL), Regular Expression, Finite Automaton, and their equivalence<br />1.2 Context-free Language (CFL), Context-free Grammar, Pushdown Automaton, and their equivalence<br />1.3 Closure Properties of RL and CFL<br />1.4 Pumping Lemma of RL and CFL<br /><br />Part 2: Computability Theory<br />2.1 Turing Machine<br />2.2 Church-Turing Thesis<br />2.3 Recursive (Decidable) and Recursively Enumerable (Semi-decidable) languages<br />2.4 The Halting Problem<br />2.5 Reduction<br /><br />Part 3: Complexity Theory<br />3.1 Decision Problem<br />3.2 Certificate and Verification<br />3.3 P and NP<br />3.4 Polynomial-time Reduction<br />3.5 NPC and NP-hard<br />3.6 Approximation Algorithm (extra)<br /><br />Remark:<br />- Contents are neat, since only the basics are introduced<br />- Contents are well-structured<br />- The three major proof techniques in this course, namely diagonalization, pumping lemma and reduction, are all based on contradiction/contrapositive<br /><br />Personal comments:<br />The course could become much more abstract when going to part 2. But I think this course is still much more manageable than 3711 because you won't be required to know a large bunch of algorithms or write a very tedious proof (especially induction proof...) or dry-run on some large example (e.g. graph with at least 10 vertices).<br /><br />This course does not quite focus on practical aspect, e.g. scalability, language design, paradigm, pattern, reusability, etc. Even though there is a part talking about time complexity, the distinction between efficient and inefficient is whether the algorithm runs in polynomial time or exponential time, but not whether it is O(n) or O(n^3). In other words, O(n^1000) would be considered efficient in this course.<br /><br />However, this course focuses on more primitive, or you can say, philosophical things. What is the mathematical definition of regular expression (the thing that you might use to search strings in some specific form)? What does it mean for a device to compute something? Is there anything that a computer cannot compute? What does it mean for a problem to be hard? What problems are the hardest among hard problems? <br /><br />This course will give you a completely different mindset to think about computer and a better appreciation of abstract maths. Indeed, I found this course to be beautiful (or lovely?) when all the nontrivial things/concepts are developed just based on the basic naive set theory.",
            "comment_teaching": "The professor is certainly not the best presenter, but his approach of teaching is simple and intuitive. Attending the lectures did clear up some concepts for me.<br /><br />The teaching of TA is also quite good. He is quite attentive to students' comments to improve his teaching.<br /><br />BTW<br />At the start and at the end of semester, the professor raises some interesting comments about the course. One of them goes like this: &quot;This course is kind of useless to your research or anything unless you really want to know the concepts. For PG students, they have to take this course anyway, but I would advise UG students to take other courses.&quot; (He later added, &quot;I do not mean UG students cannot handle this course. Just that there are more interesting things out there to explore.&quot;)<br /><br />This is my first time hearing a professor to actually discourage students from taking a course (well, in other courses you might hear something like &quot;you should think whether you want to proceed&quot; instead of &quot;go to take other courses instead&quot;). My opinion is that, if you love abstract thinking, or if you hate programming, or even better, if both, then go for this course.",
            "comment_grading": "The grading scheme of this semester is rather different:<br /><br />Attendance - 10 points (Mean 8.5/10)<br />Written homework x4 - 20 points (Mean ~90/100)<br />Part 1 presentation - 30 points (Mean ~85/100)<br />Part 2 presentation - 25 points (Mean ~89/100)<br />Part 3 presentation - 25 points (Mean ~89/100)<br />========================<br />Total - 110 points<br /><br />The grading curve itself is quite nice. Full in attendance, almost full in homework, getting mean in all three presentations =&gt; A-<br /><br />The course seems rather tempting, right? No exam, just present something, try to get a mean score, and then you have an A range.<br /><br />But you should note that, a large proportion of students are PHD students who probably have more presentation experience (in thesis defense) than UG students, since this course is primarily for them. Also, judging from the Zoom meeting, many of them are NDS who are probably good at maths. So, don't treat the course too lightly.<br /><br />The presentation scores are concentrated around the high 80s/90s. It is a bit competitive, but I think as long as you really comprehend the concept, generalize the details and give a big picture, and say something intelligible, then the TA should not be harsh in giving your grade. In other words, you don't need to have extraordinary presentation skills to obtain a high mark.<br /><br />The professor seems to like this kind of grading scheme. So there is a chance that he retains this scheme even after the pandemic has gone.",
            "comment_workload": "Attendance:<br />You need to be present in Zoom, but if you like, you can afk. I do advise you to pay attention, though.<br />(The professor would give out some answers for homework 3 and 4 at the end of two of the lessons, with the recording switched off.)<br /><br />4 Homework:<br />Intermediate difficulty. If you don't know how to do, go google or find source (or listen to the professor's hints/answers).<br /><br />3 Presentation:<br />You need to design your slide, write a script, and then do a recording. It is okay to just read aloud your script (better in a natural way, of course).<br /><br />The workload should be quite manageable.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "fK5CcIjH2wWnGDJVCVGt1IW7Je2zcWwF",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 105,
                    "name": "ZHANG, Nevin Lianwen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Jeff Sun",
            "date": "Dec 27, 2021",
            "title": "Theory of Presentation: Don't take it unless you are a CS RPG",
            "comment_content": "The topics are indeed interesting. <br /><br />See https://home.cse.ust.hk/~lzhang/teach/comp3721/ for details.<br /><br />But this has been my nightmare of the semester, see the other sections.",
            "comment_teaching": "Not very good.<br />He speaks monotonically, with heavy clothes, a hat, and an exaggeratingly large and thick mask, even if it was in the summer. I never saw his face. It feels like a robot paraphrasing the notes on the iPad and reading them out.",
            "comment_grading": "Random grading under a strange scheme.<br /><br />4 Homework Assignments: 4% x 4 = 16%<br />Part 1 video presentation:&nbsp;&nbsp;30%<br />Part 2 video presentation:&nbsp;&nbsp;24%<br />Part 3 video presentation:&nbsp;&nbsp;20%<br />Class participation:&nbsp;&nbsp;10%<br /><br />This is a CS theory course, so I do not think this makes any sense. What kind of CS theory course counts attendance, and uses presentations as its major evaluation scheme. And, seriously, there are no exams, in this course? <br /><br />The main point of the presentations is compressing everything he has taught in 15/12/10 minutes, and you are graded probably by how well the ppts are designed, whether you look good, or simply the mood of the grader. You don't need to think, just compress everything.<br /><br />There is a similarity check for each presentation and homework, and harsh penalties apply. BUT, it never works! On the one hand, you may get high similarity scores for original works, due to the nature of the contents in the course, and, the assignments are never changed over the years. They rerun Turnitin after the DDL so that the similarity scores go up again, and that's why I messed up HW1. On the other hand, those who are really good at plagiarism have tricks to circumvent the similarity checks. They may &quot;borrow&quot; the presentation materials from those in the past offerings with good grades, and use their tricks to get high scores and low similarities at the same time.<br /><br />The attendance policy is also crazy. You are regarded as present iff you log in to the zoom. This means that if you attend in person with focus, but somehow the zoom got logged off, you don't get the attendance mark. If you &quot;pretend&quot; to attend by logging in your zoom in your bed, you get the attendance mark. <br /><br />Believe me, many guys who got good grades do not understand most part of the course. They just reverse engineer according to the ridiculous grading scheme. I would be kicking their asses had there been an exam.",
            "comment_workload": "Random. Mainly depends on how much you want to polish your presentation, but I really have no idea how to polish it. But it seems that it's important not to use the old-school plain-white ppt backgrounds, probably one of the reasons why I got below mean for all the presentations.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 6,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "P1ZB4Z8Ro1efe0WcPJhRwF2k2TNG7J8D",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 105,
                    "name": "ZHANG, Nevin Lianwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Unicorn1",
            "date": "Feb 02, 2023",
            "title": "",
            "comment_content": "CONTENT<br />Content has not been changed for a long time. The referenced book was published before 2000. <br />- Regular Expressions<br />- Finite Automata<br />- Pumping Theorem<br />- Context Free Language<br />- Pushdown Automata<br />- Turing Machines<br />- P and NP",
            "comment_teaching": "I like his teaching style. Explain it at a good speed. Easy to follow but not bored.",
            "comment_grading": "The grading is very good. I was around the upper quantile for the all homework and the final was sightly below the upper quantile. I got A as a result",
            "comment_workload": "The workload is very light. Homework is not difficult and video presentation is also light.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YQcjVbKfi1MxoTulad9ES50w4gmKVDgr",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 106,
                    "name": "TAI, Chiew Lan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "QI",
            "date": "Aug 11, 2016",
            "title": "The Teaching is boring but the content is interesting",
            "comment_content": "Topics covered include set theory and countability, formal languages, finite automata and regular languages, pushdown automata and context-free languages, Turing machines, undecidability, P and NP, NP completeness.<br />(Directly copied from the course info.)<br />Actually it is quite interesting, with a lot of theoretical things involved in. It will make an awesome COMP elective if you do not like coding.",
            "comment_teaching": "The lectures are really boring since the prof. is just reading the notes. But the tutorials are actually quite interesting. TA will pop up some interesting question every tutorial (that I attended, at least).",
            "comment_grading": "I don't remember it very clearly, I think it is about 30% midterm, 50% final and 20% homework.<br /><br />It is not really hard to get good marks in the midterm and final since not many details are involved in the exams. So as long as you get your solution clear and correct, you will get full marks for that problem. By the way, the exams are all open book, so you do not need to memorize anything.<br /><br />The grade is actually quite good. You do not need to get a super high score to get an A+.",
            "comment_workload": "Well, the workload actually really depend on your maths basis. It is really a COMP view of math. So if you are good at math, this is going to be a piece of cake.<br />By the way, some additional information, there is over a half of the students in this course are actually PG student. That usually means they do not that care about their grades, but they are really good. So actually the workload is pretty okay.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "75GootCzFvEDzpVzrjkEUSdf6ooFvn9g",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 105,
                    "name": "ZHANG, Nevin Lianwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Andyyip",
            "date": "Jan 28, 2023",
            "title": "",
            "comment_content": "- Regular Expressions<br />- Finite Automata<br />- Pumping Theorem<br />- Context Free Language<br />- Pushdown Automata<br />- Turing Machines<br />- P and NP<br /><br />Contents are not too difficult but you may get lost sometimes during lectures as Nevin goes through the notes rather quickly.<br />Don't expect the course to be like other COMP courses. The focus is on proving. The contents are mostly based on previously taught materials. Make sure to ask Nevin if you have any questions. He is nice and don't be afraid to ask.",
            "comment_teaching": "Basically reading the notes directly. But notes are clear and easy to understand. A lot of examples were given as well so should not be difficult to follow.",
            "comment_grading": "Very lenient grading. You will get a B+ even getting mean in the final.",
            "comment_workload": "3 Homework<br />2 Group presentations<br /><br />Homework is usually 4-5 questions and it takes around a day to complete.<br />Group presentation takes around 2 days to finish. If you have good teammates that shouldn't be a problem.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uIkay4TjlunG98rGc3iziwKoVUrpsGWz",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 105,
                    "name": "ZHANG, Nevin Lianwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "agoti",
            "date": "Jan 22, 2022",
            "title": "&quot;A-&quot;-pumping theory of computation",
            "comment_content": "Automata Theory (up to CFG) and Decidability. Then some brief P and NP problems. <br /><br />90% of the course is probably common sense for people who played in programming competition, and the rest 10% if you are interested in computing theory by yourself anyway.<br /><br />It's always the part that the course decides to skip through being the ones that I wanted to know. Always.<br /><br />Safe to say I learned nothing new from this course.",
            "comment_teaching": "Never really paid that much attention, but as mentioned in some of his own(?) surveyed review of the course, he really makes mistakes in his written notes quite often, and that does make the teaching hard to follow at times.",
            "comment_grading": "Zhang said that he gives everyone &quot;at least an B+ unless they screwed up&quot;, so I give him at least a B symbolically. (otherwise I would've given this C or lower)<br /><br />Never in my life have I looked at a written exam and thought &quot;i wish i could be doing that as exam&quot; so bad though.<br /><br />Aside from the HWs that don't really weigh that much, the grading mostly depends on presentations on the lectures taught. But the grading seems to be at mean for like 80% of the students anyway, which means almost everyone gets an A-, probably a handful of B+, A, and A+.<br /><br />Upon request the TA did give some response on how the presentations are graded, which besides whether &quot;one covers everything taught in the lecture&quot; (remark: The videos are like ~12 minutes long covering 7-8 lectures), it is graded based on:<br />- whether you &quot;show knowledge of the content taught&quot;<br />- whether you &quot;can provide examples and explain them&quot;<br /><br />Doing the &quot;coverage&quot; part gives you mean, and doing the extra points allegedly gives you higher than mean. I did exactly that and I got lower than mean.<br /><br />The TA also provided a high-mark student example (while stating that &quot;most highest mark students don't want to show their work&quot;), but the presentation literally reiterated the lecture notes (and recycled the examples, verbatim) with some colored slides, which the professor states as &quot;good organization&quot;.<br /><br />And from a discussion with the professor, he seems to really like this grading format and will not change it anytime soon.",
            "comment_workload": "Undecidable. The amount of workload does not scale at all with the final grade. You will get below mean regardless.<br /><br />It's more load on your mental health than an actual workload.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YGxJYIUD0Vi4neNT0lEV4J3vaIAIFejw",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 105,
                    "name": "ZHANG, Nevin Lianwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Aelheim",
            "date": "Dec 13, 2021",
            "title": "If you love abstract thinking",
            "comment_content": "Set theory<br />Countability and Uncountability<br />Languages (regular, context-free, recursive, recursively enumerable)<br />Associated Grammars<br />Automata (DFA, NFA, Pushdown Automata, Turing Machine)<br />Closure Properties (RL, CFG)<br />Pumping Theorem (RL, CFG, Recursive L)<br />Undecidable Problems<br />P vs NP<br /><br />The content is theoretical and there is a good deal of discrete math.",
            "comment_teaching": "The teacher will provide lecture notes on his website before the actual lecture, the lecture supports what was explained in the teaching material by providing examples and detailing proofs. <br />The best way to apprehend this course is to read the teaching materials concerning the lectures before them.",
            "comment_grading": "Grading Scheme<br />4 Homework Assignments: 4% x 4 = 16%<br />Part 1 video presentation:&nbsp;&nbsp;30%<br />Part 2 video presentation:&nbsp;&nbsp;24%<br />Part 3 video presentation:&nbsp;&nbsp;20%<br />Class participation:&nbsp;&nbsp;10%<br /><br />One of the Homework Assignments was cancelled and as of now, we don't know yet how it will affect the Grading Scheme.",
            "comment_workload": "We had three homeworks of&nbsp;&nbsp;medium difficulty, it took me one day to finish each of them. The homeworks allows students to directly apply the concepts learned in the course and understand them better. <br /><br />Instead of a final, students are required to work in groups of 2 and make 3 video presentations to explain the contents of the course.<br />The course is divided into three parts: <br />Part 1 - lecture 1 to 13 : 15-minute video<br />Part 2 - lecture 14 to 20 : 12-minute video <br />Part 3 - lecture 21 to 23 : 10-minute video<br />This is challenging because the videos should cover all materials seen in the corresponding lecture and the video's target audience are new students about to study the material.<br /><br />A similarity score is computed for each submission and it can sometimes be challenging to be under the threshold because your transcript for the videos essentially quotes the course contents. <br /><br />I put a C Grade for the workload because while the difficulty is not that high: <br />- writing transcripts meeting the similarity score requirement <br />- creating the slides for the videos<br />- getting a record where you speak very quickly without stammering (you usually need several takes)<br />- editing the video <br />does take a good amount of time.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "KiYvKTWBh0acOQbqp5q5sf4WfJeqUBKw",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 105,
                    "name": "ZHANG, Nevin Lianwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CW",
            "date": "Dec 19, 2018",
            "title": "Recommended for CS students",
            "comment_content": "Content is very structured and taught coherently. You can feel that everything is connected and have a glimpse on how computer scientists and mathematics look at these computing problems.<br /><br />The entire course is mathematical, even more abstract than COMP2711 and COMP3711. In 3711 you might need to come up with a O(n logn) algorithm for points. In 3721, polynomial time is fine :) O(n^100) is good enough.<br /><br />Recommended for all CS students. <br /><br />Content: <br />- Sets, Relations, and Functions<br />- Languages and Regular Expressions<br />- Countability and uncountability<br />- Deterministic Finite Automata<br />- Nondeterministic Finite Automata<br />- Regular languages<br />- Pushdown automata<br />- Context-free grammars<br />- Pumping Theorem for CFLs<br />- Turing Machine<br />- The Halting Problem.<br />- Undecidable Problems<br />- P and NP<br />- NP-Completeness",
            "comment_teaching": "Teaching is clear. The instructor upload all lecture videos online. Personally I went to almost all the lectures and found them quite useful. Simply looking at the note doesn't give me the required intuition and/or insight.",
            "comment_grading": "4 Assignments: 5% x 4 = 20%<br />Midterm&nbsp;&nbsp;&nbsp;30%<br />Final:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;50%<br /><br />Last assignment is for self practice and everyone automatically gets full marks. As a lot of PhD are taking this course (if they havn't take it before, it is required by the CSE department), you can expect high mean in both midterm and final. Problems in exmas are generally not *very* difficult. Sometimes problems in homework can be even more challenging.<br /><br />Cannot say much about grading in general as I don't have many samples. I think 90+ in both midterm and final can get you an A+.",
            "comment_workload": "Four assignments to be submitted in hard copy in class. The last assignment is waived for self practice. Each one took me one or two days. <br /><br />Two single-sided A4 cheatsheets are allows in midterm/final. There are not much to memorize.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VgHnwHaHR0Zj7reUl6L4vfhd1hcpmBDU",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 106,
                    "name": "TAI, Chiew Lan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Aloha",
            "date": "Jun 04, 2016",
            "title": "計算機嘅數學模型",
            "comment_content": "Countability<br />regular expression (language)<br />finite automa<br />pushdown automa<br />context free grammar (language)<br />pumping theorem<br />turing machine<br />decidability<br />NP-completeness<br /><br />呢個course嘅內容比較mathematical 比3711更加mathematical<br />讀過MATH2033嘅人應該會易上手啲<br />考試/功課會有啲題目叫你design regular expression/context free grammar/finite automa/turing machine去compute一啲language 呢part比較考IQ<br />亦都有啲係要你Prove嘢 如prove 某decision problem is decidable/NP complete 呢part感覺上直接啲<br />但final個mean比midterm低10幾分 睇嚟多數人都比較擅長玩IQ題<br /><br />一開始由最simple嘅regular expression講起 然後就係finite automate (類似finite state machine嘅嘢) 跟住就加個stack落去提升computation power嘅pushdown automa 到最後就係擁有與real computer同等計算能力的turing machine. midterm打後嘅內容都係圍繞住turing machine.",
            "comment_teaching": "prof把聲好悶 教得都好悶 自己睇好似過癮啲<br />no comment to the tutorial as I skipped all of it",
            "comment_grading": "20% homework * 4<br />30% midterm *1<br />50% final exam *1<br />Mean應該 ~ B/B+",
            "comment_workload": "總共4份功課 每份4題左右 題目難度中等 唔識可以google<br />考試open book, open note 題目難度大部份同tutorial homework相近 算係幾有良心嘅exam<br />有少量turtorial題目可供操練<br />workload總括而言唔大",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LgHRzFzZfdQSEajd5ynXZj0U0aXJkqUe",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 105,
                    "name": "ZHANG, Nevin Lianwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "henryhc",
            "date": "Aug 24, 2021",
            "title": "Useful course",
            "comment_content": "Includes regular language, context-free language, automata, set theory and complexity.<br />It feels like a mix of discrete math and compiler.<br />The content is useful if you are interested in theoretical computer science or you want to sign a programming language.",
            "comment_teaching": "The professor make clear explanation on the concepts and so as the TA.<br />The course was delivered online and the situation may be different in this year.",
            "comment_grading": "The grading is friendly. I don't think I am a hardworking student but I got an A+.",
            "comment_workload": "Four homeworks with median difficulty, I spent one day to finish each of them. They are useful because they will drive you to understand the course from a different prospective.<br />Also there are three presentations of 5 to 10 minutes. The content of the presentation are your understanding of the concepts learned in this course. I spent one or two days preparing for each of them.<br /><br />There is no final exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uaFP841WR37onqQxZeYr0rlmJn25vO8h",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 105,
                    "name": "ZHANG, Nevin Lianwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "pca",
            "date": "Jan 09, 2021",
            "title": "",
            "comment_content": "Standard stuff:<br />Computability theory: regular expression, context-free grammar, Turing machine, halting problem, ...<br />Complexity theory: polynomial time, NP, and NP-complete.<br /><br />Grab a textbook, read the proofs, and you would be fine.<br /><br />Would be better if LL/LR language and parser stuff can be included.",
            "comment_teaching": "The teaching is pretty good, the professor explained the ideas and proofs clearly and did have interaction with students.",
            "comment_grading": "Another post provided very detailed statistics so I would not repeat them. <br /><br />Homeworks: 98, 91, 100, 94.<br />Presentations: 96, 97, 98.<br />Grade: A+<br /><br />Pretty good grade indeed. Recommended even if you suck at math like me.",
            "comment_workload": "The 4 assignments are simple, require at most 2 hours for each.<br /><br />3 presentations, students have to prepare the slides, write the transcript, and record the video. This can take a long time.<br /><br />Tips for presentation: use beamer, they seem to like it. I've got a relatively good score even with my poor presentation skills...<br />(I spend 2 days for each presentation, as I draw every single diagram with LaTeX... as a bonus, my LaTeX skill for beamer is greatly improved)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}