{
    "error": false,
    "course": {
        "id": 3629,
        "subject": "COMP",
        "code": "2211",
        "name": "Exploring Artificial Intelligence",
        "description": "This course aims to give a gentle introduction to the basic elements of artificial intelligence (Al) through understanding examples from various applications and hands-on experimentation using Al software tools. In addition to covering the technical aspect of Al through such topics as search and problem solving, knowledge representation, probabilistic reasoning, machine learning, computer vision and image processing, speech and language processing, and robotics, this course will also study the historical perspective, social and ethical implications, as well as potential and limitations of Al.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"1021\" href=\"/review/COMP1021\" target=\"_blank\">COMP 1021</a> OR <a class=\"course-link\" data-subject=\"COMP\" data-code=\"1029P\" href=\"/review/COMP1029P\" target=\"_blank\">COMP 1029P</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"3211\" href=\"/review/COMP3211\" target=\"_blank\">COMP 3211</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"4211\" href=\"/review/COMP4211\" target=\"_blank\">COMP 4211</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"4221\" href=\"/review/COMP4221\" target=\"_blank\">COMP 4221</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"4331\" href=\"/review/COMP4331\" target=\"_blank\">COMP 4331</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"4332\" href=\"/review/COMP4332\" target=\"_blank\">COMP 4332</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"4421\" href=\"/review/COMP4421\" target=\"_blank\">COMP 4421</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"4471\" href=\"/review/COMP4471\" target=\"_blank\">COMP 4471</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"4901K\" href=\"/review/COMP4901K\" target=\"_blank\">COMP 4901K</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"4901L\" href=\"/review/COMP4901L\" target=\"_blank\">COMP 4901L</a>, <a class=\"course-link\" data-subject=\"ELEC\" data-code=\"4130\" href=\"/review/ELEC4130\" target=\"_blank\">ELEC 4130</a>, <a class=\"course-link\" data-subject=\"ELEC\" data-code=\"4230\" href=\"/review/ELEC4230\" target=\"_blank\">ELEC 4230</a>, IDPO 4110, <a class=\"course-link\" data-subject=\"ISOM\" data-code=\"3360\" href=\"/review/ISOM3360\" target=\"_blank\">ISOM 3360</a>, <a class=\"course-link\" data-subject=\"MATH\" data-code=\"4336\" href=\"/review/MATH4336\" target=\"_blank\">MATH 4336</a>, <a class=\"course-link\" data-subject=\"MATH\" data-code=\"4432\" href=\"/review/MATH4432\" target=\"_blank\">MATH 4432</a>, <a class=\"course-link\" data-subject=\"RMBI\" data-code=\"4310\" href=\"/review/RMBI4310\" target=\"_blank\">RMBI 4310</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"5211\" href=\"/review/COMP5211\" target=\"_blank\">COMP 5211</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"5212\" href=\"/review/COMP5212\" target=\"_blank\">COMP 5212</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"5213\" href=\"/review/COMP5213\" target=\"_blank\">COMP 5213</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"5221\" href=\"/review/COMP5221\" target=\"_blank\">COMP 5221</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"5222\" href=\"/review/COMP5222\" target=\"_blank\">COMP 5222</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"5223\" href=\"/review/COMP5223\" target=\"_blank\">COMP 5223</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"5331\" href=\"/review/COMP5331\" target=\"_blank\">COMP 5331</a>, COMP 5421",
        "rating_content": 4.9,
        "rating_teaching": 5,
        "rating_grading": 4.29,
        "rating_workload": 4.1,
        "review_count": 21,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 846,
                "name": "TSOI, Yau Chat",
                "count": 20
            }
        ]
    },
    "reviews": [
        {
            "hash": "Lt8IHF4129Rgp3KK1bbXWXUQTo0Rwy2h",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "落車請早揚聲",
            "date": "Jun 04, 2022",
            "title": "It's still good old desmond",
            "comment_content": "This is the first offering of this brand new course, the original content plan was the following:<br /><br />1. Brief History of Artificial Intelligence<br />2. Naive Bayes<br />3. K-Nearest Neighbour<br />4. K-Means Clustering<br />5. Perceptron and Multi-Layer Perceptron<br />6. Fundamentals of Image Processing<br />7. Convolutional Neural Networks<br />8. Minimax and Alpha-beta Pruning<br />9. Reinforcement Learning (Value Iteration)*<br />10. Artificial Intelligence Ethics<br /><br />*Later on, desmond realized that there is just not enough time to cover reinforcement learning and decided to leave that to summer. <br /><br />As a brand new AI related course designed with a course code less than COMP4211 and COMP3211, I can see that desmond tried his best to maintain the balence ---- he tried to make the content decent but at the same time not too complicated to scare students away. So I should say the content is well designed and brings a good overview to different aspects of AI and ML.<br /><br />I do think there are two possible improvements to the content:<br />1. I undestand things are meant to be kept simple so as to not scare students away, but there are some math that isn't that complicated but from my perspective should not be skipped. Such as for the backpropagation of MLP, the formula provided in the slides were just like things to simply memorize (although memorization was not required as the formula is provided in exams). But in fact that formula should only be applicable to sigmoid activation since even the derivative was pre-computed as a part of it. It's not even the general learning rule. The math behind this is simply chain rule, which is something understanable as long as we took MATH1013 I suppose(which is probably a course every single ust student takes?) So maybe it's better to explain about the deatailed math behind back propagation as it is essential for understanding gradient descent behind MLP. <br />2. The Numpy tutorial was really good. It is almost same as the python tutorial of CS231n. But I really also hoped to learn how to properly use pytorch or tensorflow when enrolling this course. Seldom do professional researchers use Keras in machine learning research, it's just too wrapped up and provides little flexibility. Pytorch and Tensorflow (not tensorflow keras) plays a greater role. I hope that the main library chosen for the PAs can be changed into pytorch or tensorflow in the future.",
            "comment_teaching": "Desmond is always passionate about teaching. I can feel that he just literally loves to teach. He tries his best to make sure that every concept is explained clearly, and also engages actively with the chat&nbsp;&nbsp;to answer questions. So very good teaching!<br /><br />The only downside is that he always asks &quot;Am I going too fast&quot;, when in fact, probably he knows it, that he is going too slow. Too much time are spent on telling jokes in Cantonese and Putonghua. And then additonal lectures need to be offered, and one topic had to be left till summer. I mentioned this in the review of another desmond's course and got a great bunch of down votes though. I don't know if everyone else find this amusing but for me sometimes it just really feels time consuming and just encourages me to watch recordings in 2x speed=(",
            "comment_grading": "Desmond is probably the most lenient grade giver in CSE.<br /><br />He gives 25% A range in COMP1022p and COMP2012 (Since that is already the maximum A range allowed for non-H courses according to ust policies) (BAD GUY UST, allow for larger A range nah! :&lt;) and gives an astonishing 60% A range in COMP2012H (because that's an H course and this is allowed). And Desmond also promised 25% Arange for this course as well. <br /><br />So you can see that desmond is really pushing to the limit against the policies to give more As. Indeed a lenient grade giver.<br /><br />Also I am so grateful that he provides 2 grading schemes to provide us a try and error chance in the midterm since there weren't any pastpaper available. It was so so so thoughtful of him to provide the second scheme so that we get a chance to get used to the exam question types for this course. One thing I learnt from this is don't give up even if you failed in the midterm. Cause if you prepare well for the final you can still do a great job. Thank you again desmond for the 2 schemes option!<br />Scheme 1: Lab(10%) + PA(30%) + Midterm(20%) + Final(40%)<br />Scheme 2: Lab(10%) + PA(30%) + Final(60%)<br /><br />The higher one will be automatically chosen for you. <br /><br />The distribution of both exams can either be found in Yogesh's review here: https://ust.space/review/COMP2211/view/o5SQis0xkdkDZzwGVlO8gqUHZ2mw28qX or in the course website under exam section here: https://course.cse.ust.hk/comp2211/#exams",
            "comment_workload": "Workload can be divided into Labs, PAs, and exam revision.<br /><br />10 labs, 5 out of which are graded. Each lab takes around 1-3 hours to finish depending on complexity.<br /><br />2 PAs, both graded. PA1 was obviously more complicated and takes about one whole day (from morning to night, non-stop). But PA2 can be done in just 2 hours, it was even simpler than lab6 and lab8 which was probably the two most lengthy labs. <br /><br />Expect one day each of full revision for the midterm and final exam. Pay attention to calculating image convolution and calculating number of parameter in CNN and MLP layers. (by one day, I also mean one whole day, from morning to night, non-stop)<br /><br />Therefore, the overall workload is very small.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 7,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "JdF4nQR0I5jrvxcKQBkuv9u9qVRKagnA",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CS水泡",
            "date": "Jun 02, 2022",
            "title": "One of the best first-year COMP course you can take",
            "comment_content": "The content is from the ground up as if students has zero prior knowledge regarding Python, AI, or even programming. You need nothing other than proving you already know what is variables, if-else and loop in a quiz.<br /><br />Everything are super detailed, even more detailed than 3211/4211 in terms of the implementation, math and rationale behind some AI designs.",
            "comment_teaching": "Teaching is about as good as you can get in a COMP course. In one word, Desmond.<br /><br />Try to email him before add/drop to see which session he would be free afterwards, and make a 1-hour gap after the session for post-class discussion. The post-class discussion is sometimes even more fruitful than the lecture itself, with Q&amp;A, foresight in upcoming topics and academic counselling.<br /><br />There are many TAs in this semester, and the variance of quality/clarity is rather large. Always email the TA or ask on Piazza for clarification.<br /><br />If you really want to pursue AI, don’t opt into the AI minor or try to rely on UG AI courses. Just read research papers made available by HKSUT library.",
            "comment_grading": "Grading is fair. Despite the PAs looking like a power curve, which means basically everyone got full or near full scores, the midterms and finals scores are some of the best fitted bell curves in HKUST. See attachments by others for more details.<br /><br />Desmond said top 25% will be A range and mean would be B range. Absolute cutoff for passing is 40% overall.<br /><br />Update: You'll be personally emailed by Desmond if you get A range, just like A+ in COMP2012H",
            "comment_workload": "5 graded labs 2% each<br />2 PAs 15% each<br />Midterm + Final (20% + 40%) or (0% + 60%)<br /><br />Most people scored higher in midterms than final so just take the latter weighting. <br /><br />My view on workload is biased because I have super low workload this semester and had too much fun messing around.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "o5SQis0xkdkDZzwGVlO8gqUHZ2mw28qX",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "toki",
            "date": "Apr 29, 2022",
            "title": "Yet another very strong course by Desmond",
            "comment_content": "The topics cover a large range of AI techniques and applications, which may seem quite challenging but as they said in the course description, the content does not go too in-depth, giving you the gentle introduction you need to get excited about AI. Labs and PAs give you the chance to apply what you have learnt.<br /><br />The course will help you begin communicating with others about AI, and also gives you an idea for what techniques are available to use for your own projects. It is a great intro course to anyone who is not too familiar with AI, but wants to learn what's available in the field. <br /><br />You will need a good Python foundation to begin with, **familiarity with Numpy is preferred**. Lectures will include python code explanation, and the final exam will also involve writing your own code. Although the lectures reviewed Python at the beginning of the course, Desmond goes quite fast, basically like a COMP1021 crash course.<br /><br />Keyword Syllabus<br />- History of AI<br />- Naive Bayes<br />- K-Nearest Neighbour<br />- K-Means Clustering<br />- Perceptron and Multi-Layer Perceptron<br />- Fundamentals of Image Processing<br />- Convolutional Neural Networks<br />- Minimax and Alpha-beta Pruning<br />- Reinforcement Learning (Value Iteration)<br />- Artificial Intelligence Ethics",
            "comment_teaching": "For a pilot course, I'd say there is no better professor to kick it off than Desmond. He is the type of professor that can take something very boring and still make it interesting. Even though the lessons are in online-mode, his lectures are extremely lively, continuously asks the class questions and responding to questions in chat. He is very open to questions after lesson, even if it is out-of-syllabus. I can only imagine how much fun it would be when the lessons are held face-to-face.",
            "comment_grading": "=====<br />Exams<br />=====<br />Midterm is quite tricky, you will need a solid understanding on the topics covered to perform well. So DO NOT SKIP LECTURES, and make sure you know how to do all the labs from scratch before you take the exam.<br /><br />=====<br />Grading Scheme<br />=====<br />There are two different ways to assess your performance.<br /><br />Laboratory exercises (10%) + Programming assignments (30%) + Midterm exam (20%) + Final exam (40%)<br />Laboratory exercises (10%) + Programming assignments (30%) + Final exam (60%)<br /><br />They will automatically choose the higher score of the two for you.<br /><br />=====<br />Score Distribution<br />=====<br />Midterm Distribution<br />- Mean: 65.42%<br />- SD: 12.87%<br />- Median: 64.9%<br />- Max: 94.9%",
            "comment_workload": "Total 10 labs, 5 of which needed to be submitted.<br />2 Programming Assignments, workload a bit similar to COMP2011 PA assignments.<br /><br />Labs are quite simple, PA assignments will take time but not as hard as COMP2011 assignments. <br /><br />But since it involves machine learning, everyone's models will need to be trained and tested after submission. With so many people submitting, the ZINC servers may not be able to handle all of them quickly. Word of advice, finish your labs and assignments as early as possible to avoid crashes.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 7,
            "vote_count": 10,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TnpjqeiiqYfhYILY43U5LA8soK06V1Vq",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "UnconMarketeers",
            "date": "Dec 07, 2022",
            "title": "Good introductory course indeed, but very competitive!",
            "comment_content": "An introductory course to A.I. I tend to divide the course into four parts:<br /><br />----- Part Zero: Some soft stuff -----<br />-&gt; History of AI (First part of the course)<br />-&gt; AI ethics (Last part of the course)<br /><br />----- Part One: Simple algorithm -----<br />1. Naive Bayes (Evaluate probability to predict class)<br />2. K-nearest (Predict class by majority voting)<br />3. K-means (Do grouping to a set of data)<br /><br />----- Part Two: Artificial Neural Network -----<br />4. Multilayer perceptron<br />5. Image processing <br />6. Convolutional neural network<br /><br />----- Part Three: Game Theory related -----<br />7. Minimax<br />8. Reinforcement learning (Optional)<br /><br />Personal comment:<br /><br />1. Before Naive Bayes, an introduction to Python is given (with many extra lessons!) Therefore there is no need to worry if you are not familiar with Python. <br />2. This is really an introductory course, in the sense that the requirement of math is even fewer than Andrew Ng's AI course in Coursera... But I find this course better anyway.<br />3. The part for reinforcement learning is actually a good starter to learn (discrete time) &quot;stochastic process&quot;, which is an interesting topic in math. I personally find the related material in this course is more readable than that in MATH3425...",
            "comment_teaching": "1. Enthusiasm: Desmond's enthusiasm in teaching makes the class lively. Because of that, this is the first course that I seldom feel bored or refused to attend the F2F class.<br /><br />2. Extra material: Desmond is willing to distribute advanced detail to related topics through email. This is frequently done in first half of the course.",
            "comment_grading": "1. As usual, Desmond's course promises as large A range as possible.<br />2. Warning: This semester is more competitive than the last one! Given that the midterm exams in two semesters are about the same (in terms of style, difficulty...), last sem's mean is ~65, and this sem's mean is ~80... <br />3. However, the final exam in this semester is much harder. It requires deeper understanding (than last sem's final paper) to get high score, and there are more parts requiring you to hand-write codes.<br /><br />Update: Fast grading! The final statistics is released in 3 days. Mean ~60 (confused, since Desmond says 59, but Canvas says 56), SD ~14, Highest score is 86. Comparing to the result in previous semester, you can see that this year's paper is apparently more challenging.",
            "comment_workload": "Assignments: Only 5 labs and 2 programming assignments are required to submit. The labs are simple. <br /><br />The only tricky assignment in this semester is PA1: It requires you to do modification to your code well to get full score, which strictly needs to apply vectorization everywhere instead of loops; PA2 is another extreme: You even do not have to think because the architecture is given - Because of that, this PA is even easier than regular lab...<br /><br />Preparation for exam: Since necessary math formulas and codes commands are given in exam, the only thing which is essential to memorize is the rationale behind each algorithm. Indeed there are some other tricky things like broadcasting rule, do convolution or calculating number of trainable parameters and so on, but they can be understood once you are willing to practice.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MEcrQmVNe97DhqNPb0QDINUhzYb6n3il",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rigbones",
            "date": "May 31, 2022",
            "title": "Despite many &quot;gg nah&quot; posts on Piazza, it's a good course!",
            "comment_content": "Good content nah!&nbsp;&nbsp;Opens your eyes to AI~<br /><br />Python Fundamentals for AI&nbsp;&nbsp;(Steep learning curve!!)<br />Naive Bayes Classifier<br />K-Nearest Neighbors<br />K-Means Clustering<br />Artificial Neural Network - Perceptron<br />Artificial Neural Network - Multilayer Perceptron<br />Digital Image Processing Fundamentals<br />Convolutional Neural Network<br />Minimax and Alpha-Beta Pruning<br />Ethics of Artificial Intelligence (ethics boring lol, AI should just kill all humans)",
            "comment_teaching": "Most handsome, friendly, and supportive professor ever!!&nbsp;&nbsp;Every engineering school student should experience Desmond's teaching at least once.<br /><br />If you have questions, post on piazza (forum used for comp courses) or send Prof. Desmond an email!&nbsp;&nbsp;The TA's and Professor are very willing to provide support and answer your questions.<br /><br />Desmond also responds actively to chat box on zoom, lots of interactions with students during lessons.<br /><br />Probably the hardest topic in this course is the first one, Python Fundamentals for AI.&nbsp;&nbsp;In this topic, you will learn Numpy, and most importantly Numpy broadcasting.&nbsp;&nbsp;Lots and lots of practice and experience is needed to master broadcasting, and whether or not you master it will make or break your grade.&nbsp;&nbsp;Personally, I found it challenging because it's not related to programming, instead it really needs imagination.&nbsp;&nbsp;You need to be able to visualize 2D or 3D data in your head and think about how you can reshape/ multiply them together to achieve your goal.&nbsp;&nbsp;So the 2 semesters spent in 2011/2012 won't help you.&nbsp;&nbsp;9 out of 100 marks from midterm are related to broadcasting, and whether you master it or not will determine if you pass many test cases for PA1.",
            "comment_grading": "Grading is subjective...&nbsp;&nbsp;As a regular 2000-level course, the A range is small.&nbsp;&nbsp;Desmond promises he will give as much A range as possible though (25% A-range).<br /><br />Midterm statistics (after appeal)<br />Mean = 67.91<br />Standard deviation = 13.04<br />Median = 67.65<br />Max = 97.25<br /><br />Finals statistics (before appeal)<br />Mean = 66.48<br />Standard deviation = 13.82<br />Median = 67.00<br />Max = 94.50<br /><br />2 Grading schemes<br />10% Labs<br />30% Programming assignments<br />20% Midterm<br />40% Finals<br /><br />10% Labs<br />30% Programming assignments<br />60% Finals",
            "comment_workload": "Normal 3 credit course workload.<br /><br />5 graded labs, 4 optional labs<br />2 Programming assignments<br />1 Midterm<br />1 Final",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EAz6F2ObZazBWpA5AUOPsKvcSPIKiB42",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mango Pudding",
            "date": "Jun 07, 2023",
            "title": "",
            "comment_content": "▷ Introduction to &amp; History of AI<br />▷ Python Fundamentals for AI<br />&nbsp;&nbsp;&nbsp;&nbsp;• Python basics (COMP1021 + List comprehension, set?, parallel iteration, class)<br />&nbsp;&nbsp;&nbsp;&nbsp;• Libraries used in AI<br />&nbsp;&nbsp;&nbsp;&nbsp;• ***NumPy*** nD array reshaping and broadcasting can be confusing but are very important to fully understand!<br />▷ Naive Bayes Classifier<br />▷ K-Nearest Neighbours KNN<br />▷ K-Means Clustering KMC<br />▷ Artificial Neural Network - Perceptron<br />▷ Artificial Neural Network - Multilayer Perceptron MLP<br />▷ Digital Image Processing Fundamentals<br />▷ Convolutional Neural Network CNN<br />▷ Minimax &amp; Alpha-Beta Pruning<br />&nbsp;&nbsp;&nbsp;&nbsp;• AI in perfect information, zero-sum, deterministic games like tick-tac-toe<br />▷ Ethics of AI<br />▷ Reinforcement Learning (Additional, optional lecture after exam)<br /><br />Overall very practical and interesting content, and can be useful for capstone projects. Mostly on machine learning (a subset of AI), only minimax &amp; alpha-beta pruning is classic AI.<br /><br />A little overlap with COMP1942 (a data mining course) on Naive Bayes, KNN, and K-means clustering, but since this course does coding, I'd say 2211 is more practical, while 1942 is more in-depth with the theory and manual execution of the algorithm.",
            "comment_teaching": "Interesting teaching by Desmond as expected, explaining the content very well (even sometimes repeating in English, Cantonese, AND Mandarine). Quite deserving to be praised by many COMP students. Some may find the pacing slow, but I feel like it is about right to understand and follow along.<br /><br />Quick support from TAs on Piazza as well.",
            "comment_grading": "= Grading scheme =<br />▷ Lab exercises 10% (5 graded labs, 2% each; 4 ungraded labs additionally)<br />▷ Programming assignments 30% (2 PAs, 15% each)<br />▷ Midterm exam 20% OR 0%<br />▷ Final exam 40% OR 60%<br />(The more beneficial one will be chosen for you automatically)<br /><br />Desmond promised 25% A-range and ~46% B-range THIS semester. It is pretty competitive with many apostles coming for Desmond's teaching (seeing that the classroom of 126 capacity was packed on the first day and the quota had to be raised two times from 80 to 120).<br /><br />Exams pretty much determine your grade, and you should **focus a lot on the concepts** instead of programming since ~75% of the exams will be short questions where you have to explain things. Often I feel stupid for not being able to answer those with total confidence, and since math equations and library functions (w/ documentation) will be provided, study even more on the concepts and rationale instead!<br /><br />I got an A-, but considering my scores, I reckon I'm right on the edge of the A range.",
            "comment_workload": "5 graded labs (~bi-weekly) + 2 PAs<br /><br />= Time &amp; Braincells spent =<br />Can be time-consuming and even frustrating to figure out. Lab 2, 4, and PA 1 were the most painful since we manually implement the algorithm with only NumPy while being unfamiliar with it. Later on, we can use libraries like SciKitLearn and Keras, BUT fine-tuning the training model hyperparameters will take the majority of the time instead of coding.<br /><br />= The code =<br />The programs were saved in Jupyter Notebooks (.ipynb) and executed on Google Colab. No setup is required for GColab but for later labs where you need to train a model, you need to be wary of the limited GPU usage quota. If you have a decent PC, I highly recommend setting up your local Anaconda environment and VSCode so that you can train on your own GPU w/ Tensorflow GPU (which in my Lab 8 is 4s/epoch on RTX3060 compared to 11s/epoch on GColab's Nvidea T4). Yes, it will be quite a hassle, but you will thank it for speeding up training by a margin and allowing you to test more model configurations.<br />▷ Anaconda Navigator: https://docs.anaconda.com/free/navigator/index.html<br />(Note that Tensorflow GPU needs to specifically be installed through your environment's terminal and then &quot;pip -install tensorflow-gpu&quot;. It might be different for you, but that's how I got mine working)<br /><br />= ZINC =<br />Be VERY CAREFUL in checking your code! ZINC will NOT generate a grading report when you submit so you won't know if your code is bugged or wrong. Batch grading in 2211 has crashed ZINC multiple times this semester :P.<br /><br />= Labs (G for graded) =<br />1. NumPy<br />2. Naive Bayes Classifier (G)<br />3. KNN<br />4. KMC (G)<br />5. Simple Perceptron<br />6. MLP (G)<br />7. Digital Image Processing Fundamentals<br />8. CNN (G)<br />9. Minimax &amp; Alpha-Beta Pruning (G)<br />10. Reinforcement Learning (Optional, after the exam for additional self-learning)<br /><br />= Programming Assignments =<br />PA1 KNN Classifier for Sentiment Analysis<br />PA2 Retinal Vessel Segmentation using CNN",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "x7RwEI23X7Xd3IiCyCmJxcCMdvLAXvdu",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AHZHONG",
            "date": "May 30, 2023",
            "title": "",
            "comment_content": "Topics Covered:<br />1. Brief history of Artificial Intelligence<br />2. Search and problem solving<br />3. Knowledge representation<br />4. Probabilistic reasoning<br />5. Machine learning<br />6. Computer vision and image processing<br />7. Speech and language processing<br />8. Robotics<br />9. Social and ethical implications of AI<br />10. Potential and limitations<br /><br />Lecture:<br />1. Introduction to Artificial Intelligence<br />2. Python Fundamentals for Artificial Intelligence<br />3. Naive Bayes Classifier<br />4. K-Nearest Neighbors<br />5. K-Means Clustering<br />6. Artificial Neural Network - Perceptron<br />7. Artificial Neural Network - Multilayer Perceptron<br />8. Digital Image Processing Fundamentals<br />9. Convolutional Neural Network<br />10. Minimax and Alpha-Beta Pruning<br />11. Ethics of Artificial Intelligence<br />12. Introduction to Reinforcement Learning",
            "comment_teaching": "Desmond is good. He explained some concepts well and in different languages include English, Cantonese and, Mandarin. He loves to repeat the concepts again and again for us to understand.<br /><br />He promises top 25% (A range), top 60% (B range).<br />Good grade course",
            "comment_grading": "Lab: 10%<br />PA1: 15%<br />PA2: 15%<br />Midterm: 20%<br />Final: 40%<br /><br />There is 2 types of grading<br />1. Lab(10%) + PA(30%) + Midterm(20%) + Final(40%)<br />2. Lab(10%) + PA(30%) + Final(60%)<br />The second grading ignore the midterm score.<br /><br />There is a total of 10 Labs. But only 5 of the labs counts as grade.<br />So each lab 2%.<br />Lab 1: NumPy<br />Lab 2: Naive Bayes Classifier<br />Lab 3: K-Nearest Neighbors<br />Lab 4: K-Means Clustering<br />Lab 5: Simple Perceptron<br />Lab 6: Multilayer Perceptron<br />Lab 7: Digital Image Processing Fundamentals<br />Lab 8: Image Classification(CNN)<br />Lab 9: Minimax and Alpha-Beta Pruning<br />Lab 10: Reinforcement Learning<br /><br />Grade<br />Lab 2: Score: 2/2, Mean: 1.64, Median: 1.8, UQ: 2, LQ: 1.8<br />Lab 4:&nbsp;&nbsp;Score: 2/2, Mean: 1.7, Median: 2, UQ: 2, LQ: 2<br />Lab 6:&nbsp;&nbsp;Score: 2/2, Mean: 1.51, Median: 2, UQ: 2, LQ: 1<br />Lab 8:&nbsp;&nbsp;Score: 2/2, Mean: 1.49, Median: 2, UQ: 2, LQ: 1.5<br />Lab 9:&nbsp;&nbsp;Score: 1/2, Mean: 1.62, Median: 2, UQ: 2, LQ: 1<br />Lab Total: 9/10<br /><br />PA1 (K-Nearest Neighbors Classifier for Sentiment Analysis): Score: 11/15, Mean: 11.81, Median: 12.5, UQ: 14.5, LQ: 11<br /><br />PA2 (Retinal Vessel Segmentation using Convolutional Neural Networks): Score: 100/100, Mean: 91.58, Median: 95, UQ: 100, LQ: 90<br />PA Total: 26/30<br /><br />Midterm: Score: 66.5/100, Mean: 63.2, Median: 64, Max: 88, Standard deviation: 12.59<br /><br />Final: Score: 70.75/100, Mean: 71.81, Median: 75, Max: 93.25, Standard deviation: 14.27<br /><br />Overall: 77.45/100 (B) (Use second type grading)",
            "comment_workload": "5 labs and 2 PA are graded. The first graded lab is the hardest as we need to build the Naive Bayes Classifier model from scratch by using NumPy. At that time everyone did not familiar with NumPy and spend a lot of time to write code.<br /><br />Overall the workload is not too heavy.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7DSXu4Hl1bap3J5vudTH4rwrdCZoC7Q2",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Newstarts",
            "date": "May 26, 2023",
            "title": "Good course but may not be suitable for u to get a gd grade",
            "comment_content": "Syllabus:<br /><br />0. History of AI <br />1. Naive Bayes <br />2. K-nearest <br />3. K-means <br />4. Multilayer perceptron<br />5. Image processing<br />6. Convolutional neural network<br />7. Minimax (Tic-tac-toe)<br />8. Reinforcement Learning (Optional)<br />9. AI ethics<br /><br />Content is quite good for a beginner to have a taste of AI study, and also a good course for u to decide whether continue ur study with an extended major in AI.",
            "comment_teaching": "Desmond is a talent! He can express everything logically and vividly with many examples and in three languages (English, Cantonese and <br />Mandarin)<br /><br />I love his teaching style and would say he is the best lecturer ever at UST!",
            "comment_grading": "Desmond promises that there would be a 25% A-range. That's why the students are so competitive, I think that at least a quarter of the students have taken something related to this but not in school before.&nbsp;&nbsp;<br /><br />Two marking schemes (He truly hopes that everyone could get a satisfying grade at the end):<br /><br />Lab(10%) + PA(30%) + Midterm(20%) + Final(40%)<br />or<br />Lab(10%) + PA(30%) + Final(60%)<br /><br />For reference:<br />Labs: 8% (underestimate the difficulty of lab 2 and only last one night to deal with it, resulting in a missing)<br />PA: 13% + 14%<br />Midterm: Due to covid, performance is rly bad, below mean 1.5 sd<br />Final: Above mean 1.x sd (Forgot it)<br />Final grade (with marking scheme 2): B+&nbsp;&nbsp;&nbsp;<br /><br />Ok, some true words：<br /><br />If u are a genius or have already been familiar with the COMP course or have some sense related to coding (Like u have studied the COMP2011 or some high-level COMP courses but are not on the exclusion list), otherwise, I would suggest u audit the lectures instead of enrollment.<br /><br />Please also remember one thing: students with unsatisfied grades would seldom comment on courses, sometimes, comments with an A-range letter grade may not reflect the real scenario.",
            "comment_workload": "Rly heavy for a beginner if u only take COMP1021 before.<br /><br />There would not be any step-by-step instructions in labs and PAs which are as easy as COMP1021 labs (I would say its style is more similar to COMP2011).<br /><br />My friend who has an extended major in AI (their required course) and had taken this course in the 22-23 Spring told me that every lab is much more difficult than COMP1021 (Of course, a single lab would cost me 1-2 days to finish it, but make sure that you can finish it at least 6 hrs before ddl, because the home-made (Sorry that I may be mean but I rly hate its efficiency) ZINC often collapses and drives you crazy, but they would postpone the ddl lol) <br /><br />But for PA, they would say the difficulty is just ok (BUt I DoNt bEliEVe this because they spent a week on that)<br /><br />For me, I would say that the workload comes from the self-study for some extra codes and logic in PA and Labs, the exam would only cover the material on ppts.<br /><br />(But I thought PA1 is terrible because at that time I needed to be multitasking as I had many midterms and other lab homework but PA2 was just copy-and-paste (CV engineer hhh))",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RGw8Ivqa4gXoidzLVMM97SUIg39P3sdH",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GaveUpGPA",
            "date": "May 25, 2023",
            "title": "IN DESMOND WE TRUST",
            "comment_content": "An introductory course to A.I.<br /><br /><br />0. History of AI (First part of the course)<br />1. Naive Bayes (Evaluate probability to predict class)<br />2. K-nearest (Predict class by majority voting)<br />3. K-means (Do grouping to a set of data)<br />4. Multilayer perceptron<br />5. Image processing<br />6. Convolutional neural network<br />7. Minimax<br />8. Reinforcement learning (Optional)<br />9. AI ethics<br /><br />I would say the content is interesting. It have some topics overlapped with COMP1942, such as Naive Bayes, KNN, K-means, MLP. <br />Actually this course are mostly machine learning, Minimax is the only classic AI in this course.",
            "comment_teaching": "As a year 2 CS student, I would say Desmond is one of the best instructors. Hard concepts are explained well. Although he would keep repeating certain concepts until you get it, it really helps for me. <br />Big Big recommends to stay after the lecture to ask him questions. Not only for clarification of lecture concept but also to chat with this wonderful guy. Also, find him during office hour to seek help for labs and PA, he will give some useful hints.",
            "comment_grading": "As Desmond promised, his would give out 25% of A range. But keep in mind this course is quite competitive because there are many crazy people reg this course. Also, Desmond teaching is too good. Recommended to attend all lectures, really helps a lot. <br /><br />One big reminder is that while using Python's class if you forgot to use &quot;self.&quot; to access data members, you may declare a new global variable and the whole program still works. But when you put it in Zinc, the program would crash (f*** intepreted language). For my PA1, my whole program ran well locally but were f***ed while running in zinc, which MADE ME LOSE 7% OVERALL PERCENTAGE OF THIS COURSE JUST BECAUSE I MISSED A &quot;self.&quot;.<br />I would recommend making these insignificant sub tasks with fewer marks as this really f***ed my grade. Even if I got mean in both of my MT and Finals, my grade would probably be f***. <br />I have appealed this case and the TA respond these cases were treated the same for everyone due to FAIRNESS. The most unfair is how come one such small task could nearly cost me 2 sub-grades LOL. So, really be careful and check your program.",
            "comment_workload": "There are 5 labs and 2 PAs needed to be submitted. <br />First 2 labs and PA1 are HARD AF. I've spent a couple of days to do those labs and PA cuz it required us to build it from scratch. But this gives us the opportunity to practice how to do numpy. I would say it's chur and rewarding at the sametime.(Although I hate to implement from scratch using Numpy...)<br />For real, this shouldn't be a 3 cred course with such heavy workload.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "YM2JfY1lcSMScIP6mReKG6JNmzpqlpga",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "居",
            "date": "Jan 30, 2023",
            "title": "",
            "comment_content": "all useful knowledge <br />directly related to AI<br />basically it's a simplified version of the advanced course about AI",
            "comment_teaching": "Prof TSOI is really good at creating a good atmosphere<br />I enjoy taking his classes<br />It's a real fun",
            "comment_grading": "the content is difficult <br />need great effort to learn well<br />I got a bad great at last. But the grading scheme is fair<br />If you learn well you can get good mark",
            "comment_workload": "kind of big work load<br />take time to really understand the knowledge and apply them to your lab and assignment",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xydySxUGCS453dhARU5K9Vke6RWLuGxC",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "vert178",
            "date": "Jun 25, 2022",
            "title": "Good guy na",
            "comment_content": "- Python Fundamentals (aka Numpy)<br />- Naive Bayes Classification<br />- K-Nearest Neighbour<br />- K-means Clustering<br />- Perceptrons and Artificial Neural Networks<br />- Fundamentals of OpenCV<br />- Convolution Neural Network<br />- Minimax algorithm for games<br />- AI Ethics<br /><br />... with an additional chapter on reinforcement learning to be taught on 27th June. The materials are somewhat comprehensive - you have to talk to Desmond frequently after class to get the most out of his teaching. <br /><br />You are also recommended to find some interesting applications for the materials taught in class on top of finishing all labs (including those ungraded ones). The best way to learn the materials is by applying it many times.",
            "comment_teaching": "The instructor is very attentive to different students' needs - even through zoom. He would check in on our progress frequently and make sure most students understand the materials before proceeding. As a result his teaching is rather slow. However, it is never boring as he also tells a lot of jokes and trivia about the course content.<br /><br />Overall, the course, despite being a first-offering, is quite well managed. The department even bought dedicated GPU servers for grading the labs of this course.",
            "comment_grading": "There are two grading schemes:<br /><br />(1) Laboratory exercises (10%) + Programming assignments (30%) + Midterm exam (20%) + Final exam (40%)<br /><br />(2) Laboratory exercises (10%) + Programming assignments (30%) + Final exam (60%)<br /><br />whichever is higher.<br /><br />Midterm: mean 67.9, sd 13.0<br />Finals: mean 68.5, sd 13.2<br /><br />Desmond promised a top 25%-26% will give you an A range.",
            "comment_workload": "5 Labs, 2 PAs, not too much workload for a 3-credit course. However, if you want to get an A, please be prepared to spend much more time on getting yourself familiar with the course materials.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7vbcVV9ZxsIbpXPXdp8ncKGVoNspU8MA",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "quentin301205",
            "date": "Jun 09, 2022",
            "title": "",
            "comment_content": "History of Artificial Intelligence<br />Python Fundamentals for Artificial Intelligence<br />Naive Bayes Classifier<br />K-Nearest Neighbors<br />K-Means Clustering<br />Artificial Neural Network - Perceptron<br />Artificial Neural Network - Multilayer Perceptron<br />Digital Image Processing Fundamentals<br />Convolutional Neural Network<br />Minimax and Alpha-Beta Pruning<br />Ethics of Artificial Intelligence",
            "comment_teaching": "Desmond good guy :)<br />Desmond explained the content in detail and in a fun way, lecture is never boring<br />You can send an email to ask Desmond if you don't understand the lecture materials, Desmond would also often further explain the concept via email <br />TAs are good too, if you ask questions in piazza, usually you would get a response very quickly",
            "comment_grading": "Super good<br /><br />2 grading scheme:<br />Laboratory exercises (10%) + Programming assignments (30%) + midterm exam (20%) + Final exam (40%)<br />Laboratory exercises (10%) + Programming assignments (30%) + Final exam (60%)<br /><br />PA1: 14/15<br />PA2: 27/27<br />midterm: 69.5/100<br />final: 83.5/100.5<br /><br />finally get an A",
            "comment_workload": "2PA + midterm + final<br />PAs are easy, you can probably do it after reading the lecture notes even if you don't go to the lecture :) The first one is about Naive Bayes Classifier and testing your skills of NumPy. The second one is to build a multilayer perceptron model using libraries, you can check lecture notes for code examples. Both PA can be done in 1-2 days<br /><br />Midterm and final are a bit difficult, it tests a lot of concepts. Some concepts are sometimes not explained in detail and you need to attend the lecture if you aim A range.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "69pk2EDQJVeoU6pjoVPdpKodUbmg2GWP",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Johnnyabc",
            "date": "Jun 01, 2022",
            "title": "New course in 2021-22 spring",
            "comment_content": "A Brief History of Artificial Intelligence<br />Naive Bayes<br />K-Nearest Neighbour<br />K-Means Clustering<br />Perceptron and Multi-Layer Perceptron<br />Fundamentals of Image Processing<br />Convolutional Neural Networks<br />Minimax and Alpha-beta Pruning<br />Artificial Intelligence Ethics<br />(reinforcement learning is also included, but due to the limited time, Desmond did not teach it in spring, and no exam for this part, but he promised to teach this after the final)",
            "comment_teaching": "This is the first time I have registered for Desmond's course. The teaching is quite funny. He would use different languages to explain the concepts. Besides, he is willing to answer students' questions. I emailed him quite a number of times. He always replied to me within one day with a detailed explanation. The TA is also helpful as well. I sometimes ask some programming questions for the lab. They are willing to help me.",
            "comment_grading": "Desmond promised a 25% A range and if u get mean, you may get a B range. <br /><br />There are two different ways to assess your performance.<br />Laboratory exercises (10%) + Programming assignments (30%) + Midterm exam (20%) + Final exam (40%)<br />Laboratory exercises (10%) + Programming assignments (30%) + Final exam (60%)<br />They will automatically choose the higher score of the two for you.",
            "comment_workload": "The workload might be heavy( compared to the other 3 credit courses).&nbsp;&nbsp;There are 5 graded labs and 2 programming assignments. Besides, Desmond offered around 4-5 additional classes and each class lasted for about 1 to 2 hours. You might need to spend some time on this course if u are completely new to AI.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NgOjkRf8u6lUC0uCUabS1c6l4d2QJoLw",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "ohhh",
            "date": "Aug 21, 2023",
            "title": "very good prof and nice course",
            "comment_content": "a little heavy and Desmond will give several additional lectures. however, his class is exciting, and the content is easy to understand. However, if you have taken comp2011 and comp1021, it will you to better understand the course. Also, you need to learn the basic idea of the matrix (course Math 2111) and probability&nbsp;&nbsp;(Math 2411/ElEC 2600/ ISOM 2500)",
            "comment_teaching": "Really interesting! <br />Notice: there will be additional lectures that are important for those who do not have fundamental Python concepts.",
            "comment_grading": "gooooooooood! <br />however ZINC has some issues, but Desmond still gives a really good grade. rank nearly 50% get B-.",
            "comment_workload": "Heavy. Otherwise, you can use GATGPT to help. But all the task is useful for optical using.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GH80IWEZFVupYgBu7GNLPhgAYMs1VPw0",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "emperorpenguin",
            "date": "Jun 13, 2023",
            "title": "a good AI introductory course but very competitive",
            "comment_content": "Quite good and it raised my interest in AI.<br />Python Fundamentals for AI (Steep learning curve!!)<br />(Desmond told me he will increase more contents in vectorization. :)<br />Naive Bayes Classifier<br />K-Nearest Neighbors<br />K-Means Clustering<br />Artificial Neural Network - Perceptron<br />Artificial Neural Network - Multilayer Perceptron<br />Digital Image Processing Fundamentals （many optional contents to explore）<br />Convolutional Neural Network (CNN)<br />Minimax and Alpha-Beta Pruning<br />Ethics of Artificial Intelligence",
            "comment_teaching": "Desmond was so good. <br />Easy to understand the CNN and the whole AI definition.<br />Not pretty much deep in Machine Learning.<br />If you ask him questions f2f, he can reply to you with 3 languages (English, Cantonese, and mandarin).<br />You can find praises from others' comment. <br />I won't go into details here.",
            "comment_grading": "There is 2 types of grading<br />1. Lab(10%) + PA(30%) + Midterm(20%) + Final(40%)<br />2. Lab(10%) + PA(30%) + Final(60%)<br />The second grading ignore the midterm score.<br />There is a total of 10 Labs. But only 5 of the labs counts as grade.<br />So each lab 2%.<br />PA1 (K-Nearest Neighbors Classifier for Sentiment Analysis): Score: 11/15, Mean: 11.81, Median: 12.5, UQ: 14.5, LQ: 11<br /><br />PA2 (Retinal Vessel Segmentation using Convolutional Neural Networks): Score: 100/100, Mean: 91.58, Median: 95, UQ: 100, LQ: 90<br /><br />Midterm: Mean: 63.2, Median: 64, Max: 88, Standard deviation: 12.59<br />Final: Score: Mean: 71.81, Median: 75, Max: 93.25, Standard deviation: 14.27<br />My overall 83.2%, B+<br />My complaints on PA and final exam:<br />In PA1, the pre-grading got stuck. In the pre-grading, I make mistake and got 12/15. Then I have fixed the problem. In the final grading, Zinc use another sample and I only got 12/15 because the missing of getting the absolute value. (the problem didn't appear in the pre-grading, so I am quite annoying)<br />And in final exam, I think there is more subjective problems and less objective problems than expected.&nbsp;&nbsp;&nbsp;If you know why but don't explain well on paper, you will get no points in the questions. I think too much emphasis is laid on details of explanation in subjective questions, contributing to narrow score difference in final. <br />Desmond is very good; he guarantees 25% A range and a large B range (a large proportion of B+).<br />But the class is too competitive, so I give a C here.",
            "comment_workload": "5 graded labs (~bi-weekly) + 2 PAs<br /><br />Can be time-consuming and even frustrating to figure out. Lab 2, 4 and PA 1 are the most painful since we manually implement the algorithm with only NumPy while being unfamiliar with it. Later on, we can use libraries like SciKitLearn and Keras, BUT fine-tuning the training model hyperparameters will take the majority of the time instead of coding.<br /> <br />Before mid-term, the workload is like a 4-credit course, it is extremely painful to code the program. So I give a C here. After mid-term, since PA2 doesn't cost too much time, the workload is really a 3-credit course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iOj0Od1QRrHX5S24HjreYP9C9qgTWh9C",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "postexampls",
            "date": "May 30, 2023",
            "title": "nice AI course with desmond",
            "comment_content": "- History of AI<br />- Naive Bayes<br />- K-nearest neighbours<br />- K-means clustering<br />- Multilayer perceptron<br />- Digital Image processing<br />- Convolutional neural network<br />- Minimax and alpha-beta pruning<br />- Reinforcement Learning (not in final exam)<br />- AI ethics<br /><br />Content is okay, but may be a bit difficult to understand at times, but desmond explains it well enough for you to get the general idea",
            "comment_teaching": "desmond is a great professor ofc <br /><br />he explains things really well but i end up skipping lectures to watch it in 2x speed so that i can save time because he sometimes goes a bit slow (which is good sometimes)",
            "comment_grading": "SCHEME 1<br />Lab - 10%<br />PA1 - 15%<br />PA2 - 15%<br />MT - 20%<br />Final - 40%<br /><br />SCHEME 2 <br />Lab - 10%<br />PA1 - 15%<br />PA2 - 15%<br />Final - 60%<br /><br />MT:<br />Mean = 63.20<br />Standard deviation = 12.59<br />Median = 64<br />Max = 88<br /><br />Final:<br />Mean = 71.81<br />Stdev = 14.27<br />Median = 75.00<br />Max = 93.25<br /><br />Me: <br />Lab - 9.3/10<br />PA1 - 14/15 <br />PA2 - 85/100 <br />MT - 72/100 (+0.7sd)<br />Final - 86/100 (+0.99sd)<br /><br />Total: 87.65% (A-)<br /><br />i really thought i'd get B+ because of my labs and PAs (definitely below mean because a lot of people get 100% in lab &amp; PA) but desmond came through and gave me A- :D thanks desmond &lt;3",
            "comment_workload": "from my experience, labs and PAs are way more time-consuming compared to comp2011 and comp2012 labs<br /><br />first few labs you have to create things from scratch without using any libraries, but after lab6 you'll be able to use libraries. the problem is with training time, it takes a really long time to train a model (after lab6 i think) so beware if you're a deadline fighter because the code could run for ~10 minutes before you get your results<br /><br />PA1 was way harder than PA2, but they're pretty much just longer labs. the problem was that labs and PAs were also mixed with a bunch of deadlines and midterms so i wasn't able to achieve the best score in most of them, i guess thats just due to my poor time management, or i can blame it on ust :)<br /><br />anyways on the brighter side, i'd say the stuff you learn from labs and pa are really useful if you're trying to get into machine learning for your career path",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GUSknq65YslqgMHHowMjvWB8tJGmhDxK",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DiamondFung",
            "date": "Apr 01, 2023",
            "title": "IN DESMOND WE TRUST",
            "comment_content": "An introductory course to A.I.<br /><br /><br />0. History of AI (First part of the course)<br />1. Naive Bayes (Evaluate probability to predict class)<br />2. K-nearest (Predict class by majority voting)<br />3. K-means (Do grouping to a set of data)<br />4. Multilayer perceptron<br />5. Image processing<br />6. Convolutional neural network<br />7. Minimax<br />8. Reinforcement learning (Optional)<br />9. AI ethics<br /><br />Personal comment:<br /><br />1. Before Naive Bayes, an introduction to Python is given (with many extra lessons!) Therefore there is no need to worry if you are not familiar with Python.<br />2. This is really an introductory course, in the sense that the requirement of math is even fewer than Andrew Ng's AI course in Coursera... But I find this course better anyway.",
            "comment_teaching": "Most handsome, friendly, and supportive professor ever!!&nbsp;&nbsp;Every engineering school student should experience Desmond's teaching at least once.<br /><br />If you have questions, post on piazza (forum used for comp courses) or send Prof. Desmond an email!&nbsp;&nbsp;The TA's and Professor are very willing to provide support and answer your questions.<br /><br />Desmond also responds actively to chat box on zoom, lots of interactions with students during lessons.<br /><br />Probably the hardest topic in this course is the first one, Python Fundamentals for AI.&nbsp;&nbsp;In this topic, you will learn Numpy, and most importantly Numpy broadcasting.&nbsp;&nbsp;Lots and lots of practice and experience is needed to master broadcasting, and whether or not you master it will make or break your grade.&nbsp;&nbsp;Personally, I found it challenging because it's not related to programming, instead it really needs imagination.&nbsp;&nbsp;You need to be able to visualize 2D or 3D data in your head and think about how you can reshape/ multiply them together to achieve your goal.&nbsp;&nbsp;So the 2 semesters spent in 2011/2012 won't help you.&nbsp;&nbsp;9 out of 100 marks from midterm are related to broadcasting, and whether you master it or not will determine if you pass many test cases for PA1.",
            "comment_grading": "Midterm is quite tricky, you will need a solid understanding on the topics covered to perform well. So DO NOT SKIP LECTURES, and make sure you know how to do all the labs from scratch before you take the exam.<br /><br /><br />There are two different ways to assess your performance.<br /><br />Laboratory exercises (10%) + Programming assignments (30%) + Midterm exam (20%) + Final exam (40%)<br />Laboratory exercises (10%) + Programming assignments (30%) + Final exam (60%)<br /><br />They will automatically choose the higher score of the two for you.",
            "comment_workload": "Very big work load<br />As a year 1 student I took days to finish a lab and there are 5 graded lab in total.<br />Workload much heavier than any 3 cred course in yr1",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "w0mddyfHwPXyQmporEHL08vI0LSviolV",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hyunji",
            "date": "Jan 17, 2023",
            "title": "",
            "comment_content": "The basic concept of machine learning<br />CNN<br />Regression<br />k-nearest<br />kmean-clustering<br />Perceptron<br />Mini-batch game<br />python basic functions",
            "comment_teaching": "Desmond was so good<br />Easy to understand the CNN and the whole AI definition<br />Not pretty much deep in Machine Learning",
            "comment_grading": "[write later]<br />Lab(tutorial)-100<br />Mid<br />Final<br />Assignment(Project)",
            "comment_workload": "Pretty easy to follow if you take the class and tutorial<br />Based on python<br />If you have an experience in programming, you can do it easily<br />The project is kind of filling tasks in python<br />If you take this course before 4211, it would be really helpful for you.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vd4EHTVD2CtBxP3C4eS4kz4rW8KgqYro",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mekako",
            "date": "Jun 07, 2022",
            "title": "Good AI intro course",
            "comment_content": "Brief History of Artificial Intelligence<br />Python Fundamentals<br />Naive Bayes<br />K-Nearest Neighbour<br />K-Means Clustering<br />Perceptron and Multi-Layer Perceptron<br />Fundamentals of Image Processing<br />Convolutional Neural Networks<br />Minimax and Alpha-beta Pruning<br />Artificial Intelligence Ethics",
            "comment_teaching": "Desmond is good. I think I do need to talk too much about Desmond?<br />TAs are helpful.<br />Feel free to ask questions in the lecture or lab session.",
            "comment_grading": "Midterm statistics:<br />Mean = 67.91<br />Standard deviation = 13.04<br />Median = 67.65<br />Max = 97.25<br /><br />Final statistics:<br />Mean: 66.48<br />Stdev: 13.82<br />Median: 67.00<br />Max: 94.50<br /><br />Two grading scheme, the higher one will be automatically chosen for you<br />Grading scheme 1: Lab (10%) + PA (30%) + Midterm (20%) + Final (40%)<br />Grading scheme 2: Lab (10%) + PA (30%) + Final exam (60%)",
            "comment_workload": "9 labs in total, but only 5 labs (even-numbered labs) will be graded labs<br />2 programming assignments<br /><br />Lab can be finished in 1 to 2 hours. PA can be finished in 1 to 2 days.<br /><br />Desmond said he wants to let the students know how to implement the algorithm by themselves in case there are no suitable libraries, or want to do some modifications to the algorithm.<br /><br />Therefore, for the Lab1-Lab5 and PA1, libraries are not allowed to use, you may need more time to implement the algorithm from scratch. Starting from lab 6, there is no such limitation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yNb8AxtkoB5VE05sMmFl6yEiO8XQYVRQ",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "WSQ",
            "date": "Dec 29, 2022",
            "title": "Exploring Artificial Intelligence",
            "comment_content": "Course Logistics &amp; Introduction to Artificial Intelligence Python Programming Fundamentals for AI<br />Naive Bayes<br />K-Nearest Neighbours<br />K-Means Clustering<br />Perceptron<br />Multi-layer Perceptron Fundamentals of Image Processing Convolution Neural Networks Minimax and Alpha-beta Pruning AI Ethics<br />Reinforcement Learning (Optional)",
            "comment_teaching": "好！！！！！！<br />Desmond交的是真的好，上课有趣，讲解详细，生动形象，还有三语教学（bushi",
            "comment_grading": "两种grading<br />Laboratory exercises (10%) + Programming assignments (30%) + Midterm exam (20%) + Final exam (40%)<br />或<br />Laboratory exercises (10%) + Programming assignments (30%) + Final exam (60%)<br />虽然Desmond保证有25%的a range，50%的b range，但是选这门课的人都很强，所以即使是前25%也相对其他课来说更难拿",
            "comment_workload": "9个lab（5个算分）<br />2个PA<br />mt+final",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6iHWRXHf5NpUJG2UEWdX5KVthuxZpJwf",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mark_",
            "date": "Feb 28, 2022",
            "title": "Rewarding course",
            "comment_content": "Very rewarding, content/understanding-heavy AI crash course. Even if you come into this course knowing nothing about AI like myself, you will end up being able to understand most AI research, freely converse about it, and apply it in many areas of your future projects.<br /><br />I would only recommend this course to anyone with a good background in programming and is willing to learn AI. That is, if your programming experience is only limited to COMP1021, you may find this course difficult, especially when you get to Numpy. I'd argue you cannot focus on the ideas of AI itself if you are hindered by the programming.<br /><br />Python skills:<br />- Python basics<br />- Numpy<br />- Scikitlearn<br />- Keras<br />- Tensorflow<br /><br />Content:<br />- Definition and history of AI<br />- Naive Bayes Classifier<br />- K-Nearest Neighbours<br />- K-Means<br />- Perceptron<br />- Multilayer Perceptron<br />- Convolutional Neural Network<br />- Minimax / Alpha-beta pruning<br />- (Not taught this semester) Reinforcement learning<br /><br />The hard theory and maths behind the more complex stuff will not be tested, but supplementary slides were provided for more advanced students.",
            "comment_teaching": "Desmond is very lively and explains concepts well. He repeats concepts to make sure you understand them. He's also open to questions after the lecture and also responds to emails timely.<br /><br />I would recommend staying after class to participate in post-class discussions and Q&amp;A's. You can also attend his Zoom office hours if you just want to chat with him, even if it may be off-topic.<br /><br />The pace was not fully optimised this semester as this is the first offering. However, I am sure these issues will be ironed out in future semesters.",
            "comment_grading": "There are two different ways to assess your performance.<br /><br />Laboratory exercises (10%) + Programming assignments (30%) + Midterm exam (20%) + Final exam (40%)<br />OR<br />Laboratory exercises (10%) + Programming assignments (30%) + Final exam (60%)<br />(Basically, midterm+final or just final)<br /><br />Desmond said he would try to give 25% A-range. Assuming the distribution remains normal, around 74% in the midterm indicates a good chance for A-range.<br /><br />MIDTERM<br />--------------<br />Mean: 67.91<br />SD: 13.04<br />Median: 67.65<br />Max: 97.25<br /><br />The midterm is quite tricky. You will perform better in the exams if you play with the code that you've written in the Labs and PAs as well as example ones to gain a more intuitive understanding of AI.<br /><br />It may just be because it's the first exam of this course, but time in the midterm was extremely tight. I finished with barely 5 minutes remaining, and had no time to check most of my answers. My friends had a similar experience with the timing.<br /><br />FINAL<br />--------------<br />Mean: 66.48/100.5<br />SD: 13.82<br />Median: 67<br />Max: 94.5<br /><br />In the final, time is not as tight as the midterm. However, there are quite a few more conceptual questions which really test whether you understand the idea behind the concepts and whether you can extend them. It's also a bit more evil, in the sense that many questions depend on answers from previous parts.<br /><br />Oh, I should also mention Desmond is one of the few profs who gives written feedback for every question on your exam, releases the markscheme/paper, and lets you appeal every question. This is becoming a rarity at UST and is very welcome.<br /><br />OVERALL GRADE:<br />The overall mean is about 76% (don't have an exact figure) and should be about B range.<br /><br />Seems that 87-88% overall can secure A-, 90 can secure A, and 92-93 can secure A+.",
            "comment_workload": "- 9 Labs, 5 of which are graded<br />(There were 10 labs planned, but we ran out of time and couldn't do the reinforcement learning lab)<br />- 2 programming assignments <br /><br />There may be supplementary lessons (sometimes at 8PM-10PM) that you are expected to attend.<br /><br />The labs are a good way of learning and applying the ideas taught in class. They are submitted to ZINC, and your submissions are auto-graded every time you upload, unlike COMP1021.<br /><br />The programming assignments take some time, and you *are* expected to develop your own test cases. They require a solid understanding of the material to complete. Also, as another review mentioned, try to get them uploaded to ZINC before the deadline, because the server tends to get overloaded near the due date.<br /><br />PS. If you have a computer with a CUDA-supported GPU, I would recommend setting up Jupyter up on your local machine and doing the Labs/PAs there instead of Google Colab. It will make the code for the later labs/PAs run much faster, and of course you have no GPU quota unlike Colab. They even set up a 3080Ti for the grading of Lab 6 :P",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 9,
            "vote_count": 25,
            "voted": false,
            "is_upvote": false,
            "comment_count": 5,
            "attachments": [
                {
                    "key": "FAtihX5jaHHX9WkPttWNtXD2A7G86V1u",
                    "name": "comp2211-midterm",
                    "format": "png"
                },
                {
                    "key": "USQbgtMByInGvH01u9H17P5dFNth5oA9",
                    "name": "finaldist",
                    "format": "png"
                }
            ]
        }
    ],
    "composer": []
}