{
    "error": false,
    "course": {
        "id": 3750,
        "subject": "COMP",
        "code": "2633",
        "name": "Competitive Programming in Cybersecurity I",
        "description": "Cyber-attacks mounted by malicious attackers have been creating significant damage to various companies and individuals around the globe in the recent years; cybersecurity is now a high priority consideration for the major businesses worldwide. To deepen the practical knowledge in fighting against the cybersecurity threats, cybersecurity competitions are being organized every year by various institutions and organizations. This course prepares interested students with the practical knowledge for taking part in cybersecurity contests. The course will be offered as a 0-credit course in the Fall semester. Enrolled students will learn the common topics in the first 5 weeks of the Fall, getting trained in fundamental knowledge of cybersecurity. Then they will divide into two tracks in the remainder of the Fall. One track will be concentrating on topics like binary analysis, reverse engineering, the other track will be concentrating on topics like web exploitation, cryptography, computer forensics, and other miscellaneous topics. Graded P or F.",
        "categories": [],
        "website": null,
        "credits": 0,
        "semesters": [
            2210
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"3633\" href=\"/review/COMP3633\" target=\"_blank\">COMP 3633</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"4633\" href=\"/review/COMP4633\" target=\"_blank\">COMP 4633</a>",
        "rating_content": 5,
        "rating_teaching": 4,
        "rating_grading": 4,
        "rating_workload": 2,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": true,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [
        {
            "hash": "eZYYSpsl62ws0MLRK5KwgbDRp8R2whVk",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "ycohui",
            "date": "Oct 26, 2022",
            "title": "Don't get faked by no prerequisite, but it's fun if you know what you are doing",
            "comment_content": "(Previous Course code COMP4901N, check out more review from there)<br /><br />It's Capture the flag and only CTF.<br /><br />You could get some taste by visiting https://intro.firebird.sh to get some flagsss.<br /><br />Main content:<br />Week 1-2 (Add-drop period): Introduction to CTF. Teaching the basics of playing CTF.<br />(Drop it if you can't even understand first two weeks classes. It would just getting harder)<br /><br />Week 3 and afterwards: More Drilled into topics and split into Track A &amp; B<br />(You could attend either or one)<br /><br />Track A is Pwn/Binary/Reverse<br />Track B is Web/Cryptography/Misc<br /><br />All of those are just teaching how to solve CTF with different tools and ideas. Go visit first few lessons to know more on that.<br /><br />The main content for this course is not how the teachers and course materials. It's how much you've put your passion into this course. (aka Reading hours and hours of write-ups and googling.)",
            "comment_teaching": "Taught by Firebird Team Member / COMP4633/4901P UG Students.<br /><br />The teaching style would differs, as different students teaching different topics. <br /><br />But it's generally good enough to told you what you gonna learn from (reading write-ups.)",
            "comment_grading": "It's P/F grade this year.<br />Passing is at or above 60%.<br />50% is attendence flag (Attend lesson = free attendence flag)<br />other 50% is Homework &amp; Exercises<br />(Solving related topic CTF questions) <br /><br />Don't cheat and you would learn it<br />(Probably not me, can't really understand what's going on after week 3)",
            "comment_workload": "Workload is depending on how much time you put into the course.<br />AND your prior knowledge in COMP field<br />(OR you are already a CTF king/queen. Then workload isn't your problem.)<br /><br />This course don't have any prerequisite but yeah I wouldn't suggest trying in yr1 fall semester. Most of the concepts are mainly 3000+ level or above.<br />(Some solving don't required to understand the concepts but using tools, but you had to know where and how to use tools.)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}