{
    "error": false,
    "course": {
        "id": 3752,
        "subject": "COMP",
        "code": "4633",
        "name": "Competitive Programming in Cybersecurity III",
        "description": "The course will be offered as a 2-credit course in the Fall semester. A proportion of senior student members who have finished COMP3633 in a previous Spring semester could join the course in the Fall semester after getting instructor consent. They will further enhance their leadership and practical knowledge by taking part in the experience sharing and training of the freshly joined COMP2633 students. The students will get 2 credits for successfully completing COMP4633. Instructor's approval is required.",
        "categories": [],
        "website": null,
        "credits": 2,
        "semesters": [
            2210
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"3633\" href=\"/review/COMP3633\" target=\"_blank\">COMP 3633</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 5,
        "rating_workload": 4,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 799,
                "name": "LAM, Ngok",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "KGRi1VhqIjaElavH4p3J3FhswVEwlrRy",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 799,
                    "name": "LAM, Ngok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TrebledJ",
            "date": "Jan 25, 2023",
            "title": "Rare opportunity to teach, design challenges, and participate in CTFs with other experienced students",
            "comment_content": "This course is tightly linked to COMP2633; you’ll be teaching students in that course.<br /><br />Not much cybersecurity knowledge is introduced. If it is, it would be mostly self-taught. Some things you might pick up are:<br /><br />- Presentation skills <br />- How to design CTF challenges (depends on which area)<br />- How to use Docker (for hosting certain challenges)<br />- Friends/Acquaintances<br /><br />If you get invited, then definitely consider enrolling.",
            "comment_teaching": "Regular weekly meetings from 21:30-22:30 to prepare for the upcoming COMP2633 lessons, update the team on CTF developments, listen to ASMR sounds from your teammates eating dinner, and whatnot.<br /><br />Pretty chill overall. Alex is rather organised and makes sure everyone is up to speed, even reminding students to join the meeting—in case some forget.",
            "comment_grading": "Two main components: teaching + CTFs. Attendance in meetings and assigned sessions are also important.<br /><br />I forgot the weightings, but it shouldn’t matter, as everyone who enrols is pretty dedicated and gets A range (I think…).<br /><br />You’ll be expected to teach 2-3 sessions and participate in at least 2 CTFs. Doing well in the CTFs will provide Alex leverage and justification for better grading (when arguing against CSE). So make sure to stay sharp and learning. :)",
            "comment_workload": "One thing I was concerned with before enrolling were the presentations. I get nervous when presenting… Fortunately, the presentations were delivered online (closed cam). Each student is expected to lecture 2-3 sessions and standby in 2-4 sessions to answer chat questions and provide assistance. Each session lasts for 1.5-2 hours. Even if you’re afraid of presenting, I would recommend you take the opportunity to practice teaching/communication, whilst having fun with the occasional CTF.<br /><br />I give workload a B-C, as preparing presentations + challenges consumes time.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}