{
    "error": false,
    "course": {
        "id": 232,
        "subject": "COMP",
        "code": "4221",
        "name": "Introduction to Natural Language Processing",
        "description": "Human language technology for text and spoken language. Machine learning, syntactic parsing, semantic interpretation, and context-based approaches to machine translation, text mining, and web search.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2010,
            1930,
            1830,
            1730,
            1630,
            1510
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"ELEC\" data-code=\"2600\" href=\"/review/ELEC2600\" target=\"_blank\">ELEC 2600</a> OR <a class=\"course-link\" data-subject=\"IELM\" data-code=\"2510\" href=\"/review/IELM2510\" target=\"_blank\">IELM 2510</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2411\" href=\"/review/MATH2411\" target=\"_blank\">MATH 2411</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2421\" href=\"/review/MATH2421\" target=\"_blank\">MATH 2421</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2431\" href=\"/review/MATH2431\" target=\"_blank\">MATH 2431</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"5221\" href=\"/review/COMP5221\" target=\"_blank\">COMP 5221</a>",
        "rating_content": 2.13,
        "rating_teaching": 2.13,
        "rating_grading": 3.13,
        "rating_workload": 2.5,
        "review_count": 8,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 104,
                "name": "WU, Dekai",
                "count": 8
            }
        ]
    },
    "reviews": [
        {
            "hash": "aTAXnBfwKZCtx1jH7YDYvenKwr5gMqNf",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 104,
                    "name": "WU, Dekai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Stan1ey",
            "date": "Jun 05, 2019",
            "title": "The best(worst) course of HKUST?",
            "comment_content": "What I expected:<br />Human language technology for processing text and spoken language. Fundamental machine learning, syntactic parsing, semantic interpretation, and context models, algorithms, and techniques. Applications include machine translation, web technologies, text mining, knowledge management, cognitive modeling, intelligent dialog systems, and computational linguistics.<br /><br />What I have:<br />2019.01.31\t1\tLecture\tWelcome; Introduction; Survey<br />2019.02.05\t1\tHoliday\tLunar New Year<br />2019.02.07\t1\tHoliday\tLunar New Year<br />2019.02.12\t2\tLecture\tImpact of AI on ethics and society<br />2019.02.13\t2\tLecture\tDoes God play dice? Assumptions: scientific method, hypotheses, models, learning, probability; linguistic relativism and the Sapir-Whorf hypothesis; inductive bias, language bias, search bias; the great cycle of intelligence [at tutorial]<br />2019.02.14\t2\tLecture\tLanguages of the world<br />Administrivia (honor statement, HKUST classroom conduct)<br />2019.02.19\t3\tLecture\tLearning to translate: engineering, social, and scientific motivations<br />2019.02.20\t3\tLecture\t&quot;It's all Chinese to me&quot;: linguistic complexity; challenges in modeling translation [at tutorial]<br />2019.02.21\t3\tLecture\tIs machine translation intelligent? Interactive simulation [at tutorial]<br />2019.02.26\t4\tLecture\tEvaluating translation quality: alignment; aligning semantic frames: Interactive exercise\t<br />2019.02.27\t4\tLecture\tEvaluating translation quality: HMEANT [at tutorial]\t<br />2019.02.28\t4\tLecture\tEvaluating translation quality: MEANT\t<br />2019.03.05\t5\tLecture\tEvaluating translation quality: semantic role labeling (SRL), case frames, semantic frames, predicate-argument structure\t<br />2019.03.06\t5\tLecture\tAutomatic semantic role labeling (ASRL) [at tutorial]\t<br />2019.03.07\t5\tLecture\tImplementing a feedforward neural network based part-of-speech tagger Assignment 1 due 2019.03.15 23:59; context-independent POS tagging\t<br />2019.03.12\t6\tLecture\tI/O representations for feedforward networks; context-dependent POS tagging\t<br />2019.03.13\t6\tTutorial\tBasic probability theory; conditional probabilities; Bayes' theorem\t<br />2019.03.14\t6\tLecture\tExample-based, instance-based, memory-based, case-based, analogy-based, lazy learning for classification; translation via nearest neighbors (NN); k-NN; weighted k-NN\t<br />2019.03.19\t7\tExam\tMidterm (closed book; handwritten notebook only)\t<br />2019.03.21\t7\tLecture\tMidterm review; machine translation techniques\t<br />2019.03.26\t8\tLecture\tLearning vs performance components in machine learning; supervised learning; Word sense disambiguation; lexical choice; example-based prediction models; nearest neighbor classifiers; similarity metrics; kNN classifiers\t<br />2019.03.28\t8\tLecture\tExploring different feedforward neural network architectures for POS tagging; model design following scientific method for machine learning in practice Assignment 2 due 2019.04.10 23:59; AI ethics\t<br />2019.04.02\t9\tLecture\tNaive Bayes classifiers for WSD and lexical choice\t<br />2019.04.04\t9\tLecture\tModern approaches to SRL; corporate responsibility in AI\t<br />2019.04.09\t10\tLecture\tImplementing chunkers and shallow parsers via IOBES tagging plus a POS tagger Assignment 3 due 2019.05.10 23:59\t<br />2019.04.11\t10\tLecture\tChunking via IOBES representations; shallow bracketing\t<br />2019.04.16\t11\tLecture\tShallow syntactic parsing; shallow semantic parsing; language bias of IOBES representations, bags of words, and one-hot representations\t<br />2019.04.18\t11\tLecture\tIntroduction to word embeddings\t<br />2019.04.23\t11\tLecture\tVector space models; classic word vector approaches\t<br />2019.04.25\t11\tLecture\tLearning word embeddings via prediction tasks; skip-grams; word2vec; Assignment 3 discussion\t<br />2019.04.30\t12\tLecture\tRecursive autoencoders (RAEs) and recursive auto-associative memories (RAAM); learning word embeddings by making RAEs predict; AI ethics in China; utilitarian and consequentialist ethics; Asilomar AI principles\t<br />2019.05.02\t12\tLecture\tContext-free grammars (CFGs); generative vs parsing models; top-down vs bottom-up parsing; dynamic programming based chart parsing; Cocke-Kasami-Younger (CKY) parsing\t<br />2019.05.07\t13\tLecture\tFrom CFGs to ITGs (monolingual vs bilingual modeling); how bilingual conditions make grammar induction easier; the mystery of the magic number 4 in semantic frames; simple and full syntax-directed transduction grammars (SDTGs); introductioon to inversion transduction grammars (ITGs); tree vs matrix constituent alignment visualizations\t<br />2019.05.08\t13\tLecture\tITG characteristics; stochastic ITGs; polynomial-time transduction and learning; resolving the mystery of the magic number 4\t<br />2019.05.09\t13\tLecture\tFrom RAAM to TRAAM (transduction RAAM); recursive neural network realizations of ITGs; a self-learning rap battle bot\t<br /><br />The real content:<br />AI ethics, AI ethics and AI ethics with some small proportion of AI theory.<br />If you want to learn RNN, back propagation, gradient decent or Markov chain etc. Congratulation, please take another AI course, you won't learn anything from these course other from AI ethics or personal achievement of Dekai. Well done! <br /><br />However, if you want to use professor's achievement to masturbate. Good! The best course of UST! Please enroll it at once.",
            "comment_teaching": "Dekai WU. Umm, A good-looking man. Long hair, beard and well-taste dressing. Besides, he is probably the only Chinese who can articulate English accurately. <br /><br />If you want to enjoy his pronunciation, this is the best course of UST.<br /><br />Okay, let's back to real performance. <br />Please first refer to #Fys2557 <br />COMP4221真係唔屌唔安樂<br />上次屌完上堂啲嘢無謂再講<br />今次一於屌份assignment 3<br />即係咁 你成份嘢分 3 parts<br />由四月尾出做到5月13號交咁係幾合理嘅<br />始終每part都有一個星期工作量咁<br />要用C++打下堆code<br />但係可唔可以做齊啲嘢先一次過release啊<br />咁問題係邊呢? 先由part A講起<br />本來個個都以為係十幾號先交啦<br />點知佢又無啦啦set 個checkpoint要我地係4月就要交part A<br />唔交就直接無嗰一PART嘅分<br />雖然我一早做左無趕Deadline呢樣嘢發生啦<br />但係有其他人可以會拖住先，結果咪要當突然多份assignment咁趕囉<br />跟住就到part C啦<br />個TA 話part C一直都話未做完未set up好啲嘢<br />直到呢個星期一先真係放份zip比我地做<br />雖然離deadling得返5日 咁我當Dekai知做啲嘢同part A,B差唔多<br />勉強都夠時間嘅<br />但係你用黎trian data 個server唔係502就504<br />連極都連唔撚到<br />屌你仲差撚過UBISOFT同EA個薯仔SERVER<br />咁點撚做份assignmrnt啊 連一定要用到嘅工具都炒飛機咁<br />我知你因為咁而extend左個deadline一日<br />但係extend 完後個server都仲係連唔撚到<br />即係咁 手遊斷server都起馬有石賠啊<br />結果份assignment 照舊今日dead但係無論琴日定今日個server都連唔撚到<br />咁extend 黎有撚用咩<br />都係嗰句 見到DEKAI啲COURSE一定掉頭走<br />本人就係柒左嘅例子<br /><br /> and #Fys2260&nbsp;&nbsp;<br />Dekai Wu 真係ON9嗰喎<br />都唔撚明個3211同4221明明寫AI assignment<br />竟然叫人用C++都唔用python呢啲更常用嘅<br />咁都算啦，你個C++要行2017都算啦，g++compiler要用到8.0都算啦<br />但係你仲要係得LINUX機RUN到你個model<br />Eclipse, VS都run唔到，逼你用PuTTY link 學校server或者自己download LINUX 落黎用<br />算啦，咪當學多左囉。<br />不過最ON9嘅都係上堂竟然唔派 lecture notes 但係又唔upload 啲lecture notes同powerpoint 放上網，逼你上堂手抄<br />咁手抄唔係問題，抄唔切咪用相機影落黎先。落堂再抄返落去<br />但係據我所知，佢連lecture material 都唔比TA。連TA都要問我攞返我影低啲相同手抄notes去做preparation。咁TA點先可以教到我地嘢啊?<br />又講下答問題啦。上堂問佢問題，佢會帶你遊花園，然後唔直接答你問題，連學生問題都答唔到，你點教人啊。<br />如果你落堂問佢佢會叫你行埋一邊先，然後仲要好唔禮貌咁用串柒柒嘅語氣黎撚學生，好似覺得你有嘢唔明係你問題咁。<br />都唔撚知佢無老豆點先可以係UST度教到書。<br />我淨係想講句：你唔識教人就返去做你research啦，唔撚好害人啦<br />These two articles are written by me. These two articles has already contains most of my thought about this course. <br /><br />Sorry foreigners. Originally I want to use the machine learning for translation which should be taught in this course to translate those paragraphs. However, as I haven't learnt anything, this become impossible.&nbsp;&nbsp;:(",
            "comment_grading": "Well. I don't know what should I graded in this section because I don't know my final score and the score of assignment 3 and assignment 1. What I know is I get a B eventually.<br /><br />For reference:<br />I got full with 5%bonus in assignment 2 and get 80% in midterm exam.<br /><br />There is one thing to remind all of you who want to take this course. Please write the correct name of Dekai, Wu in the midterm and final exam. Otherwise, your paper won't be graded or mark deduction. <br /><br />Besides, midterm will mainly cover what his said during the lecture instead of lecture slide. You can bring hand written note&nbsp;&nbsp;during exam. So, you should drop note every lectures or steal your friend hand written note directly or force him to help you drop note.<br /><br />Final will mainly cover what he don't teach during lecture. Believe in your luck. <br />緣分到了，你自然會識做份卷。",
            "comment_workload": "The most heaviest workload course in HKUST. Even heavier than all LANG courses or SOSC and HUMA common core. There a three assignments. <br />The first assignment will waste you about 5 days to complete.<br />The second assignment will waste you about a week to complete it.<br />After the deadline of second assignment, the third assignment will release. The workload is three times of the second assignment, which mean you have to use about 3 weeks to complete a single assignment individually. <br />Even worse, there are many system maintenance. Your assignment progress will force to stop during maintenance. Eventually, the time for you to complete the assignment will reduce. <br />Another serious issue is an assignment will divide to three parts. Each part will release each week, which mean you cannot finish the next part before it release. So, you won't be able to plan finishing all parts during its release. <br />As assignment 3 is released at the last of the semester. you will be very busy.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 54,
            "vote_count": 56,
            "voted": false,
            "is_upvote": false,
            "comment_count": 4,
            "attachments": []
        },
        {
            "hash": "mfX02EVOLJdlZI6xr2DsZfVbzcAv9soT",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 104,
                    "name": "WU, Dekai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "2042XXXX",
            "date": "Jun 04, 2019",
            "title": "if (professor == dekai) { students-&gt;course.drop();}",
            "comment_content": "The content of this course is supposed to be rich, giving students ideas what NLP is.<br /><br />There are 3 assignments, midterm and final in the course.<br /><br />The assignment in this course is full of idealism that Dekai wishes the TA to design yet the TA has no time to do it at all. I personally felt bad for the TA as <br />1. The TA don't even have any materials sent by Dekai<br />2. The TA is asked by Dekai to asked question that he never mention and define in class (Search Bias), so basically the TA doesn't know what does it mean either.<br /><br />All in all, there are 3 assignments in this course for this semester, in which assignment 1 was a easy and basic one, and I already get lost in assignment 2 and 3 as I have no way of catching up and understanding his ideas.<br /><br />As a sidenote, the assignment 3 was broken up into Part A, B and C and suppose we would hand in part by part. This caused a lot of confusion to the class at first and the deadline was unclear at the first.<br /><br />The Midterm consists of discussion in class about ethnics and some basic hazards he thinks AI could do to humanity (not strictly related to NLP but that's his style), some POS tagging which he spend only one lecture and giving no exercise to us and suppose we will achieve 100% marks from that after weeks of introduction. Seriously is this set up to fail us? I don't know, but most of us can't even understand the POS tag basics during that lecture.<br /><br />Let's be clear that I did not study for the final because I have already given up the course by that point. It consists of a lot of pseudo programming using C++ syntax and also some question yet again discussed in class.<br /><br />All exams are open handwritten notes (although the definition of &quot;handwritten notes&quot; is not clearly defined by the professor and TA)",
            "comment_teaching": "Although I gave the grade E here, but let's admire him for one of the very few professor that in UST who teaches with passion and energy. I do think he really does a great job of enhancing the atmosphere of the classroom.<br /><br />These traits, however, is neglected by how unclear, messy, unstructured and unreleased lecture notes to further help understanding to the deep and wide knowledge I wish the course provides to me.<br /><br />I wish he knew that not all and actually most of his students are not genius and would like step by step approach to have a better introduction to this matter. While I'm okay with his introduction of the backgrounds, his content and difficulty skyrocketed as he is skipping many ideas without even explain it slowly, and not having any contents on what he's trying to say in class just made everything worse and worse.",
            "comment_grading": "Dekai never gave any clear definition of the grading scheme of the course, but I got C-. He does say you will get guarantee grading on achieving certain point, but I saw some reviews already include this so I am not bothering to repeat here.<br /><br />Let just say it is relatively good as I didn't do 75% of assignment 3, and most things I wrote in the final, I actually have no ideas what I am doing. I was expecting to get an D or F, but C- was really unexpected.",
            "comment_workload": "Very heavy. with assignments released and due in a week, many students found it hard to complete with in time. He, however is willing to extend the deadline often as quite clearly the class has stated that we all have no idea what you homework is all about.<br /><br />And lastly to those who read all of my grumble till to this very end, thank you and please, if you want some introduction to NLP, don't take this course. It is not worth your time to waste here.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 14,
            "vote_count": 14,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "FwFklphRlqrdDqia1s9H8eUI0s145mnv",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 104,
                    "name": "WU, Dekai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "A0",
            "date": "Jun 13, 2020",
            "title": "DO NOT TAKE THIS COURSE!",
            "comment_content": "DO NOT TAKE THIS COURSE!<br /><br />Do not take this course if you want to learn natural language processing. Go to MIT / Standford / Coursera / Udemy instead.<br /><br />What I learnt:<br /><br />1. How to use Dekai's forum. <br />We spent 2 lectures to register our account in the forum.<br />And spent 2 lectures doing discussions on the forum.<br /><br />2. How to play Dekai's translation game.<br />We spend 2 lectures playing his translation game.<br />I understand that this game teaches us about the difficulty of language translation, but sorry, playing the game for two lessons feels like a waste of time.<br /><br />3. How to simulate Dijkstra Algorithm with washers and strings",
            "comment_teaching": "DO NOT TAKE THIS COURSE!<br /><br />Well, this semester's teaching is done through ZOOM so you won't have the problem of missing a lecture or write notes since you can just re-watch the lecture recordings.<br />So the problem of not giving out lecture notes mentioned in previous reviews would not be as big of a problem than normal face to face lectures.<br />But it would be better if Dekai can released the lecture notes since without the lecture notes, I needed to type the lecture notes myself in a word document during the lecture, which is annoying.<br />Some students asked Dekai during lecture to release the lecture notes, because the equations are quite complicated, he agreed, but never did.<br /><br />His English is okay, but it is hard to understand the content, since some of the content is difficult such as the Hidden Markov Model, CKY parsing, ITG hypothesis...",
            "comment_grading": "DO NOT TAKE THIS COURSE!<br /><br />Grade weighting<br />Exams \t0% (due to university coronavirus measures)<br />Pop quizzes\t~10%<br />Class participation \t~15%<br />Forum participation \t~10%<br />Assignments \t~65%<br /><br />My grades for pop quiz:<br />I don't know, there were no pop quizzes in the whole semester. And Dekai didn't mention where the points from pop quiz is allocated to. So it is a mystery.<br /><br />My grades for assignment:<br />Assignment 1: 100/100 (Some students obtained 5 more points for bonus)<br />Assignment 2: 100/100<br />Assignment 3: 100/100<br />Assignment 4: 100/100<br /><br />My grades for class participation:<br />I don't know my grades for class participation, because Dekai never released the grades for this part.<br />I would just guess that I get a mean mark for this part, since I would consider my participation in the class would be normal.<br />But still, I don't know how this part is graded because a clear marking scheme for class participation is not there for us to see.<br />So if he wants, he can just gives you bad grade just because you look ugly, or gives you good grade, if you kept on liking his boots.<br /><br /><br />My grades for forum participation:<br />I don't know my grades for forum participation, because Dekai never released the grades for this part.<br />But I would just guess that I got a pretty good grade for forum participation, since I would say that I was quite active in the forum, answering questions and asking questions.<br />Again, no one knows how this part is graded, since he never released the marking scheme for this part.<br /><br />My grade: B+<br />Overall grading was not good.<br />Only 13 students enroll in this class, and in the first lecture, he said he was quite lenient for giving A range grade that he usually need to beg ARR for allowing him to give out more A ranges than usual.<br />So I figured that for grading 13 students in a curve, a lenient A range, full marks assignment, okay class participation and good forum participation, then I would expect an A-. But he gives B+ for me, lower then I expected.<br /><br />With no grading detail and mark release for class and forum participation, weighting percentage (with the disappearing pop quiz). The grading was not transparent at all. So expect your final grade to be marked subjectively.",
            "comment_workload": "DO NOT TAKE THIS COURSE!<br /><br />Mid-term/Final:<br />No mid term and final for this semester, so you don't need to memorize how Dekai Wu is spelt. (To be honest, I think every CS student in HKUST knows his name since he was quite infamous for his teaching, just look at the other reviews)<br /><br />Assignments:<br />Assignments are due in one week ~ 1.5 weeks, and it is quite hard to finish them in time especially if you are year 4 with FYP or took a lot of courses in that semester.<br /><br />Assignment 1: Dijkstra Anagram<br />Assignment requirement is to write a program to do Dijkstra algorithm for generating anagram.<br />This first assignment is okay, not too difficult. <br />But for getting the 5 points bonus it is quite hard, since your program need to run fast enough within 20s for 14 character length word, which required you to use some sort of pruning to achieve that efficiency.<br /><br />Assignment 2: HMM<br />Assignment requires to write a program for Hidden Markov Model backward forward algorithm.<br />This assignment is hard, since the concept and equations of backward and forward algorithm and HMM is quite difficult and complicated. So you need to spend a lot of time to understand it.<br />And with the complicated equations, debugging takes a long time.<br /><br />Assignment 3: Feedforward POS Tagger<br />Assignment requirement is to loop through the scientific method for feed forward part of speech tagger.<br />This assignment is easy in terms of coding, since for every hypothesis, just a few lines of code is needed to be changed.<br />The annoying part is that you would need to write observations of the training set, description of hypothesis, and do error analysis for each hypothesis.<br />And because I didn't know whether the answers are correct or not, I tried to write as long as possible for the description and explanation, which I used a lot of time to do. I don't know whether it is necessary to write so long, but in the end I got 100/100<br /><br />Assignment 4: RNN <br />Assignment requirement: create bidirectional RNN, LSTM, and bidirectional LSTM model for tagging part of speech for the training set with the starting code of RNN.<br />I would say this is the most useless and annoying assignment because the machine learning framework used in this assignment is LEGO, which is developed by Dekai and his TAs.<br />Why the hell would you ask the students to use C++ and your own LEGO machine learning framework, but not python with state-of-the-art machine learning framework such as pyTorch or Tensorflow?<br />Not to mention that because the framework is developed by Dekai and his TAs, there are no documentation that you can refer to understand how LEGO actually works.<br />So you would spend a lot of time trying to understand the starting code with the comments, do trial and error to understand how different function works and the output of different variables.<br />Basically, this assignment teaches you to use LEGO machine learning framework, which you would never ever use again in your whole life. (Unless you decide to do postgrad and become his TA)",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 8,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eMU9fh15I4FrZ7a0L3DoHvO8hKNG11hJ",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 104,
                    "name": "WU, Dekai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Luoshu",
            "date": "Jul 11, 2019",
            "title": "I have no idea what the hell dekai is talking about.",
            "comment_content": "The course title about the course is &quot;natural language processing&quot;. However, I have no idea what the professor is talking about.<br /><br />The course material related to the NLP is taught after the midterm exam. Before the midterm, it is all about some historical staff. (In fact, I am not a fan in history and humanity. I cannot remember what exactly it is taught.)",
            "comment_teaching": "Normally, in one lecture, the professor will talk something about himself or the AI ethics (such as some buzz word about him being elected to some council). Afterwards, he may deliver some jibber jabber about the language history or some other boring staff.<br /><br />To be honest, at the first two weeks of the semester, I think it was my problem that I cannot understand the content and the purpose of his teaching. However, after several weeks, when I realized that the teaching is not understandable at all.<br /><br />Ultimately, if you are really a huge fan of painful experience (or &quot;抖M&quot; in Chinese), I strongly recommend you to take this course.",
            "comment_grading": "To my great surprise, the grading is astonishingly good. For your information, the weight of assignments are very high, so please make sure you complete all assignments in a serious attitude.<br /><br />After checking my final exam, I have scored below the mean score. However, I am still able to obtain an A- grade. Anyway, this is a course that you don't have any idea about the grading detail.",
            "comment_workload": "There are 5 assignments in total. Due to the fact that I need to count on those assignments, I need to finish them in a deep and complete way. In fact, I have no idea how these will affect me. Therefore, all I can do is to write my report as long as possible.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8spb52PQ9F0jeAcCb93D4HMpdz1ogIQ6",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 104,
                    "name": "WU, Dekai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "gossipgirl",
            "date": "Jun 02, 2018",
            "title": "Weird course",
            "comment_content": "Content covers the following topics: <br />1. Bigram models<br />2. Anagramming<br />3. HMM<br />4. IBM Models for Machine Translation<br />5. ITG Models for Machine Translation<br />6. CFG/PCFG/CYK Algorithm for parsing<br /><br />The content is quite old. Agreed that some of these are important topics in this field but I expected an introduction to Neural MT or something.",
            "comment_teaching": "I didn't like the teaching whatsoever. People say he's very passionate about the field etc etc. Agreed, but while teaching a course there should be a solid structure of content and way to assess students. 12 weeks of classes feel like a blur when you heard a lot of things but don't quite understand them too well.<br /><br />There are no lecture notes as such. In class, a pdf of his book (should have been printed 3 years ago)&nbsp;&nbsp;is used an then a printout is given before the exams. This makes it very difficult to take good notes and clear doubts during the semester.",
            "comment_grading": "Dekai's grading scheme is very flexible and changes almost every year he teaches. He doesn't tell us the final scheme he used but a rough idea is<br />5% participation<br />50% assignments<br />20% midterm<br />25% final<br /><br />Depending on how many assignments he gives, he adjusts the weight of the exams. He originally planned to teach scheme but due to lack of time, gave only 1 programming assignment and 1 written assignment. Also, he doesn't release the score of the final. (Yes, quite a few unknowns in the course)<br /><br />I would say the final grade isn't that bad. His midterm is very easy and scoring. Final is definitely a bit harder. A range should not be very difficult.",
            "comment_workload": "Very light workload this semester.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "M6leWeutbrfyAvRCc8cQN2uXPUSiznUz",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 104,
                    "name": "WU, Dekai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "readalot",
            "date": "Jul 31, 2018",
            "title": "old fashioned contents",
            "comment_content": "The content was very old because he did not handle with deep learning such as Neural MT. <br /><br />The content covered the following topics: <br />- Bigram models<br />- Anagramming<br />- HMM<br />- IBM / ITG Models for&nbsp;&nbsp;Machine Translation<br />- CFG/PCFG/CYK Algorithm for parsing",
            "comment_teaching": "He was passionate but I don't like his teaching style. He did not share his lecture note such as pdf.",
            "comment_grading": "He did not said the final scheme clearly, but said a rough idea <br />- 5% participation<br />- 50% assignments<br />- 20% midterm<br />- 25% final<br /><br />A midterm was easy and scoring. A final was felt a bit harder.",
            "comment_workload": "considerably light workload.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3iSKkS9r8eIAhBqZgKQhiGSj1IfO1ixD",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 104,
                    "name": "WU, Dekai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "RZ",
            "date": "Feb 02, 2021",
            "title": "",
            "comment_content": "The content was interesting. But he didn't have time to address most of them, cause it was easy for us to start chatting. The content started from the history to some algorithm.",
            "comment_teaching": "Teaching was fair and sometimes interesting. But Dekai never uploads the slides so it's always hard for me to follow in most of the time.",
            "comment_grading": "Absolute grade:<br />Participation<br />Tutorial participation<br />Forum participation (He has set up a forum for this course)<br />Assignments<br />In-class quiz",
            "comment_workload": "Workload was fair but the ddl was always tight. And it always costs much time to think about the right way to solve the problems. Assignment is released on his forum without noticing you on canvas, so make sure to check the forum frequently.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rNbieR1qFuCTfHkY89QqmZWO6vGlbBHo",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 104,
                    "name": "WU, Dekai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Frederica",
            "date": "Jan 15, 2018",
            "title": "",
            "comment_content": "He gives an interesting perspective on Natural Language Processing as he is one of the ground-breaking researchers on translation. You will learn a lot about the Chinese &lt;-&gt; English translation.",
            "comment_teaching": "You will learn lots of theory as with every CS class in HKUST and some functional programming. He's a great teacher and his class is secretly a philosophy class as well. He encourages students to take NLP from other professors too if given the chance because he believes that each professor who teaches NLP gives a different perspective on it. It is not as hard to fall asleep in his class because he has quite a personality.",
            "comment_grading": "In terms of grading, the breakdown for his class is: <br />85%\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A<br />75%\t\tB\t<br />65%\t\tC\t<br />55%\t\tD\t<br /><br />Midterm exam\t~20%<br />Final exam\t~25%<br />Participation\t~5%<br />Assignments\t~50%<br /><br />Exams are not open book.",
            "comment_workload": "",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}