{
    "error": false,
    "course": {
        "id": 222,
        "subject": "COMP",
        "code": "3211",
        "name": "Fundamentals of Artificial Intelligence",
        "description": "Foundations underlying design of intelligent systems. Relations between logical, statistical, cognitive, biological paradigms; basic techniques for heuristic search, theorem proving, knowledge representation, adaptation; applications in vision, language, planning, expert systems.",
        "categories": [],
        "website": "https://course.cse.ust.hk/comp3211/",
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2010,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1530,
            1430
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"2011\" href=\"/review/COMP2011\" target=\"_blank\">COMP 2011</a> OR <a class=\"course-link\" data-subject=\"COMP\" data-code=\"2012\" href=\"/review/COMP2012\" target=\"_blank\">COMP 2012</a> OR <a class=\"course-link\" data-subject=\"COMP\" data-code=\"2012H\" href=\"/review/COMP2012H\" target=\"_blank\">COMP 2012H</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"5211\" href=\"/review/COMP5211\" target=\"_blank\">COMP 5211</a>",
        "rating_content": 4.14,
        "rating_teaching": 3.57,
        "rating_grading": 4.64,
        "rating_workload": 4,
        "review_count": 14,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 108,
                "name": "LIN, Fangzhen",
                "count": 9
            },
            {
                "id": 104,
                "name": "WU, Dekai",
                "count": 3
            },
            {
                "id": 909,
                "name": "SONG, Yangqiu",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "hku6LOUdl6ReBvoBZzAaiN1XlKRnKlEX",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 108,
                    "name": "LIN, Fangzhen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "smallpotato tom",
            "date": "Jan 23, 2020",
            "title": "A good grade course but not a good AI course",
            "comment_content": "Most materials are very similar to Comp5211 (PG version of AI course)<br /><br />Before Midterm:<br />1. Introduction<br />2. Reactive Agents*<br />3. Agents that Search*<br />4. Markov Decision Process and Reinforcement Learning*<br /><br />After Midterm:<br />5. Introduction to Machine Learning<br />6. Knowledge Representation and Reasoning*<br />7. Reasoning Under Uncertainty*<br />8. Game Theory and Auction*<br />9. Natural Language Processing<br /><br />* = Important<br /><br />As course title said, it's about &quot;fundamentals&quot; of AI<br /><br />A lot of theories, plus a few of Comp2711 and Math2411. 60% are interesting and the remaining parts are quite boring.<br /><br />Require some fundamental codings as well.",
            "comment_teaching": "The teaching of the instructor is not satisfactory.<br /><br />You may try to attend the lesson to follow the teaching progress but I didn't learn much from Prof. LIN. Most of us relied on self-study and Google.<br /><br />Some tutorials are useful but I didn't attend all because the notes would be released after each lesson. The notes are useful for assignments.",
            "comment_grading": "Original grading scheme:<br /><br />30% - 3 assignments<br />25% - midterm<br />45% - final exam<br /><br />As 2019 Fall had special arrangements, the grading scheme had been modified as follows:<br /><br />30% - 3 assignments,<br />40% - the midterm,<br />30% - take home final exam<br /><br />My statistics:<br />Assignments - 93.3%<br />Midterm - above mean ~0.85 sd<br />Take home final - above mean 11 marks (should be &lt; 1 sd)<br /><br />Finally got an A-",
            "comment_workload": "3 assignments, each includes a written part and a programming part. Each requires 1-2 days to be completed.<br /><br />Midterm and final should be easier than assignments.<br /><br />You may find many &quot;resources&quot; and &quot;references&quot; online.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "o7M98SuWFBbvNStUcr7vdhDzXTmuyFlQ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 108,
                    "name": "LIN, Fangzhen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gerald W. Liu",
            "date": "Jan 18, 2019",
            "title": "Easy Elective with Good Grades",
            "comment_content": "Fundamentals of AI, including:<br />- Simple Intelligent Agents<br />- Search (Uniformed, Heuristic, Adversarial)<br />- Learning (MDP, basic ML concepts)<br />- Knowledge Representation, Reasoning, and Planning<br />- Game Theory and Auction<br />- Uncertainty<br />- NLP (only brief intro)<br /><br />Assignments included a lot of tasks from the AI project of Berkeley CS 188, which can be found here:<br />https://inst.eecs.berkeley.edu/~cs188/fa18/<br /><br />P.S.: It has a lot of overlap with the PG course COMP 5211. Basically their slides are mostly the same. So, if you fail to enroll in this class, you may try the other one instead: email Prof. Lin and he will get you in.",
            "comment_teaching": "Prof. Lin can explain things clearly. The only problem is that he speaks in a monotone, which makes the lecture quite boring especially when the content is easy.<br /><br />I only went to the first lecture and found it a bit boring for me, so I skipped all the classes afterwards and might not be able to judge his teaching fairly.",
            "comment_grading": "The course is the easiest COMP course I have ever taken, so you can get a very high score if your are careful enough in your exam and homework. My grades are as follows:<br /><br />Assignments (10% x 3): 100, 90, 100 (out of 100)<br />Midterm (25%): 71 out of 74<br />Final (45%): 93 out of 100<br /><br />Total: 94.84%<br />Grade: A+",
            "comment_workload": "The exams are not difficult and extremely similar to past papers (go to your senior friends and find more, since he will only provide one sample), so you can get familiar with the questions with very little preparations before exams.<br /><br />The written assignments can take you a while, but you will excel if you follow the lecture notes carefully. The programming questions are easier, and you can find most of them (those from Berkeley CS 188) on GitHub, so you can check your output before submission.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fWM68RcQepTQmDmH71odTJmQLXE61beS",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 108,
                    "name": "LIN, Fangzhen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tommy Li",
            "date": "Dec 28, 2020",
            "title": "Okayish Intro to AI",
            "comment_content": "This course is a standard introductory course to AI. It covered most of the basics for an AI system and you would be able to learn how to build some simple AI systems (such as a simple pacman agent). <br /><br />Syllabus:<br />1. Introduction<br />2. Reactive Agents<br />3. Agents that Search<br />4. Markov Decision Process and Reinforcement Learning<br />5. Introduction to Machine Learning<br />6. Knowledge Representation and Reasoning<br />7. Reasoning Under Uncertainty<br />(copied from other reviews, modified according to the current semester's syllabus)<br /><br />I would say the topic chosen in the course is quite standard. It covered most of the stuff needed in an intro AI course. It is not particularly interesting or particularly boring. The content is not difficult too. It should be suitable for most CS students, even for those who are not that good at programming.",
            "comment_teaching": "The professor sounded enthusiastic but his tune is kinda... boring? I don't know how to describe that. It is weird lol. He is passionate in teaching and willing to answer student's question. Just the way that he sounds make me hard to focus in lectures.<br /><br />He tried to give lots of examples and explain them step by step. If you follow the lecture closely, you would be able to understand the content. Anyway, let me include some useful links here in case you need them ;)<br /><br />Genetic Algo: https://www.youtube.com/watch?v=MacVqujSXWE<br />A*: https://www.youtube.com/watch?v=ySN5Wnu88nE<br />MDP: https://www.youtube.com/watch?v=9g32v7bK3Co<br />RL: https://www.youtube.com/watch?v=HpaHTfY52RQ",
            "comment_grading": "The grading should be a little bit better than normal. I expected a B+ or lower due to my midterm result (&lt; +0.5 s.d.) which is weighted 40%. There is some leniency for careless mistakes if you want to aim for A range but you need to work fast and accurate for higher grades.<br /><br />Score breakdown and statistics:<br />Assignment 1: 100/100 (Mean: 87.3)<br />Assignment 2 (written): 75/75 (Mean: 71.5)<br />Assignment 2 (programming): 25/25 (Mean: 18.9)<br />Assignment 3: 98/100 (Mean: 73.4)<br />Assignment Subtotal (15%): 298/300<br />Midterm (40%): 62/73 (Mean: 57.4, SD: 12.45, Max: 73)<br />Final (45%): 93/100 (Mean: 73.4, SD: not released, Max: 100)<br />Overall: 91.2% =&gt; A",
            "comment_workload": "No attendance is taken in this course. Watch the lecture videos at your own pace (maybe skip some easy parts). It would be good to spend some time to watch extra resource videos on MOOC/YouTube if you could not connect the ideas.<br /><br />For assignments, you can find sources in coursehero and GitHub. Most problems are from old assignments. However, it did take some time to complete as it is a little bit long.<br /><br />2 years of past papers are provided. However, the exam paper this year is much longer and more difficult than previous years. Do spend some time to practice and try your best to write faster.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "80ZjrdR9CR1ccY55SFQGrICWR2XCpxgj",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 104,
                    "name": "WU, Dekai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Douglasthc",
            "date": "Aug 10, 2019",
            "title": "[COMP3211] See whether u want to learn sth or want to have good grade.",
            "comment_content": "I don't know what is he teaching and I think he did not know what he wanted to teach. At the end of the semester, he will teach very thing so fast, you do not have enough time to write down sth for you to study.<br /><br />This course will not have any lecture notes uploaded , u need to jot down yourself.",
            "comment_teaching": "He has good English and good presentation skills.<br />I think he wants to educate student how to learn and how to become better whether telling students what is AI.",
            "comment_grading": "The grading is very good, It is absolute grading, 85% and above then can get a A range",
            "comment_workload": "3 assignments 1 midterm and 1 exam.<br />the assignments is not hard if you ask TAs.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MQnrNuQa3pjDnNdzWtggJC5nc7ZW0mGl",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 108,
                    "name": "LIN, Fangzhen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "高海千歌",
            "date": "Jun 01, 2023",
            "title": "COMP2211+COMP2711 but more theoretical and abstract",
            "comment_content": "1. Introduction<br />2. Reactive Agents<br />-&gt; Perceptron<br />-&gt; Genetic programming<br />3. Machine Learning<br />4. Searching<br />-&gt; DFS &amp; BFS<br />-&gt; A* Search<br />-&gt; Minimax<br />-&gt; Alpha-beta pruning<br />5. Markov Decision Process and Reinforcement Learning<br />-&gt; Expected reward (Bellman's Equation)<br />-&gt; Value iteration<br />-&gt; Monte Carlo method<br />6. Game theory<br />-&gt; Nash Equilibrium<br />-&gt; Auction<br />7. Knowledge Representation and Reasoning<br />-&gt; Propositional logic<br />-&gt; Predicate logic<br />8. Reasoning Under Uncertainty<br />-&gt; Bayes Theorem (Conditional probability)<br />-&gt; Bayes Network<br />-&gt; D-separation<br /><br />The key topics are listed above.<br /><br />(Disclaimer: I am not ordered or paid by Desmond to commercial or boast his AI course. But...3211 is kinda the AI intro course before 2211 comes out. I think it is not bad to compare the &quot;AI intro course in the past&quot; and &quot;Current AI intro course&quot; and see which is more suitable as &quot;AI intro course&quot;)<br /><br />In my opinion, this course is a hybrid of COMP2211, COMP2711 and any game theory course (IEDA2010, etc.) with some extra materials, but the contents are explained in a more theoretical and mathematical way. This course covers broad topics related to AI (But not limited to machine learning). If you have some experience with AI before, you may be able to know more about the theory behind these topics. However, it is not suitable for beginners. It is because the coverage is too broad while the ideas are explained in a too abstract and theoretical way. Each concept is not explained practically and in-depth enough.<br /><br />For example, both 2211 and this course covers perceptron and minimax / alpha-beta pruning. However, this course only covers single layer perceptron. The activation function are all binary function (if sum&gt;=theta then true, otherwise false). Other activation function like Sigmoid, ReLU are not taught. For minimax and alpha-beta pruning, they only appear in the lectures notes for a few pages. The prof explains the minimax and alpha-beta pruning algorithm in an too abstract way but he didn't even give one complete tracing example for us (Then somehow the exam requires us to trace it...damn 2211 really saves my life).<br /><br />Moreover, this course does not teach you any coding. No labs, no hands-on experience. However, they will appear on the assignment. You need you figure out what are you doing by yourself, which is not friendly for people who are not familiar with AI.<br /><br />As a result, I feel like I didn't learn many things as I do not have a big brain to digest that much abstract and mathematical ideas efficiently. I always get lost in the lecture. In terms of AI knowledge, I think I have learned more from 2211 rather than from this course.<br /><br />What I want to say is that: If you are new to AI, you will easily get lost in this course and lose interest in AI quickly when facing a bunch of abstract ideas and math notations. Therefore, if you are new to AI, I strongly suggest you to take Desmond's COMP2211 first (Enjoy Desmond class :) ). Desmond tries to eliminate all the abstract ideas and math in his class. You will have a more in-depth understanding, as well as hands-on experience regarding AI. This may somehow enhance your interest on AI rather than being ruined at the beginning. Desmond really gives us a better starting point for learning AI :) .<br /><br />Moreover, make sure you have taken COMP2711 before so that you can know the logic and probability parts well (There are many overlaps). If it is available, having studied game theory from other course like IEDA2010 is also an advantage (If you know what is Nash Equilibrium then it is quite enough for prior knowledge). <br /><br />If you can gain some solid foundation before taking this course, you will have a large advantage as the exams focuses back on practical application while the lecture gives you a bunch of abstract ideas. For me, my prior knowledge in COMP2211, COMP2711, IEDA2010 really helps me a lot in performing in this course as when I attend the lecture, I always get lost because of the abstract ideas and the prof bad delivery...<br /><br />One significant example is that in this course, K-means clustering is not explained in-depth. It only appears in the ML lecture notes for 1-2 pages and the prof passes it very quickly in the lecture. However, in the final exam, the prof gives us a surprise by asking us to trace the K-means clustering algorithm. Fortunately I studied that in 2211 so I just finish it easily. Desmond really carry 10 points in my final exam!<br /><br />Therefore, I would say thank you Desmond, thank you Kenneth, thank you WANG, Xin",
            "comment_teaching": "Not really good...<br /><br />I would say prof.Lin is pretty enthusiastic in AI and he tries to share and explain as much information regarding AI as he can. However, his delivery ruins all the thing. His tone is monotone and the pace is quite slow. When I watch the recording and turns a 1.25x, I found no difference from a normal person speaking. As a result, the lecture is not appealing and the attendance is quite low. <br /><br />Moreover, he focus a lot on theory level but does not focus a lot on practical level. He uses a lot of time to explain the theory but does not give sufficient practical example. I often got lost because of this.<br /><br />For the TAs, most are mediocre. However, I would give extra credit to ZHU, Fengming. He is pretty good at explaining the concept with sufficient examples.",
            "comment_grading": "1. Assignment (15%)<br />2. Midterm exam (35%)<br />3. Final exam (50%)<br />4. Implicit attendance (??%)<br /><br />Simple grading scheme. Nothing special. Just try your best to get the scores.<br /><br />The only tricky part is the implicit attendance. This is mentioned by &quot;Bonus points for active participation in class discussions and other worthy contributions.&quot; on Canvas. For actually how it works, as the attendance of the lecture drops drastically near the end of the semester, the prof randomly picks two lessons to offer the students to write down their names on a piece of paper. I will see this as an attendance. How significant does it affect the grade? I don't know. <br /><br />My result:<br />Assignment 1: 100/100<br />(Mean: 76.42/100 Median: 85/100 LQ: 69/100 UQ: 100/100)<br /><br />Assignment 2: 62/100<br />(Mean: 77.76 Median: 87/100 LQ: 67/100 UQ: 97/100)<br /><br />Assignment 3: 25/100<br />(Mean: 75.17/100 Median: 88/100 LQ: 61/100 UQ: 100/100)<br /><br />Programming assignment: 85/100<br />(Mean: 75.67/100 Median: 86/100 LQ: 70/100 UQ: 100/100)<br /><br />Midterm exam: 68/100<br />(Mean: 66.06/100 Median: 66.75/100 LQ: 58/100 UQ: 78/100)<br /><br />Final exam: 73/100<br />(Mean: 66.54/100 Median: 70/100 LQ: 54.5/100 UQ: 83/100)<br /><br />Final grade: B<br /><br />Actually pretty good. I didn't catch up the lecture very well and screw up several assignment because I spent a lot of time on FYP but I still didn't drop to C range. For this course, exams take a huge proportion so please treat them seriously.<br /><br />The mean of exams are not extremely high as well. I just mostly rely my prior knowledge from COMP2211+COMP2711+IEDA2010 and I manage to get above mean. It looks like the mean for this course is B-. Slightly higher may achieve B. It is decent for a COMP course, which has a high competition environment. <br /><br />One more time, thank you Desmond, thank you Kenneth, thank you WANG, Xin",
            "comment_workload": "Pretty light for an elective COMP course<br /><br />1. Assignment<br />Three ordinary assignment and a programming assignment for this semester.<br /><br />For the ordinary assignment, it will be split into written part and programming part. The programming part is shorter than the PAs you see in other programming courses. (Note: You can find most of the questions on internet)<br /><br />For this sem, the prof add another programming assignment, it asks us to implement a simple CHatGPT model by using the APIs. I think it is quite interesting.<br /><br />2. Midterm+Final exam<br />Just ordinary exam. It is close book so make sure you remember the thing. The prof provides several set of past papers. MAKE SURE YOU KNOW HOW TO DO THOSE QUESTIONS, AS WELL AS ALL YOUR ASSIGNMENTS; as the prof will literally replicate some questions in these two things into the real exam. In our final, there is one question that is directly copied from the assignment (The prof even stated &quot;Adopted from assignment 2&quot; explicitly on the title lol)<br /><br />One more reminder, don't merely focus on computational problem. You may need to recite some conceptual content as well as the prof may test those things as well. For example, in the midterm, the prof asks you to explain the difference between gradient descent and stochastic gradient descent in plain words.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UnabcND91z1nZxooi16J7fCxBAi9kqsJ",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 108,
                    "name": "LIN, Fangzhen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GUO,JR",
            "date": "Jun 07, 2022",
            "title": "Good Grade COMP 3000-level course",
            "comment_content": "Most material is similar to COMP 5211 and CS 188 (Berkeley A.I. Course):<br /><br />Lecture 1. Introduction<br />Lecture 2. Reactivate Agents<br />Lecture 3. Search (*)<br />Lecture 4. MDP<br />Lecture 5. Games<br />Lecture 6. Knowledge Representation and Reasoning<br />Lecture 7. Uncertainty<br /><br />It is a very basic course about AI and the main theorem of this course was purposed around the 90s to 00s.<br /><br />** In the game theory part it is very unclear. So if you are in MATH 4321 Game Theory course, you will get the benefit of understanding AI versions of game theory.",
            "comment_teaching": "During the lecture, The professor give a very abstract concept which is very hard to understand for this course level and the example is also very abstract and did not relate to the assignment problem. Thanks to the online semester, I can watch videos, otherwise, I would definitely fall asleep on his course. <br /><br />(Advice: If you are watching the lecture video, please try to use 2x to play the video).<br /><br />Further, during tutorials, TAs will answer your questions about projects and homework very clearly. And TAs will give another &quot;Lecture&quot; clearly for this week's lecture. Basically for their explanation. I give a B for teaching.",
            "comment_grading": "Assignment *3 5% each<br />Project 20%<br />Final 65%<br /><br />Due to the online semester, we cancel the final midterm exam and make assignment 3 self-exercise finally. So the final grading scheme:<br /><br />Assignment*2 5% each mean:~85%<br />Project 23% mean:~54%<br />Final 67% mean:~53%<br /><br />(Only for reference)<br />Me: full marks in the assignment, high in an individual project, ~75 in the final exam. Letter Grade: A-<br /><br />I think it is a comparable good grade to COMP 3111 or COMP 3021 or COMP 3511.",
            "comment_workload": "We only have to submit two assignments, and each assignment will cost you around ~8-12 hours to finish. <br /><br />Project: Multi-agent system to find the optimal path without collision. The project is separated into individual versions and group versions. Since the most of students are in an individual project and I also recommend you to join the individual project since it is much easier in my implemented method. For the group version, you will face some difficult problems.<br /><br />Final exam: Prof. LIN will offer you a set of final exam past paper, and the final exam are quite like &quot;AI with past paper&quot;. If you get familiar with the past paper, it guaranteed you to get an acceptable score.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "KGjxfUxD2bH70sbxAkYc3tWc07XN6Lh7",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 104,
                    "name": "WU, Dekai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wilson Yau",
            "date": "Jan 22, 2020",
            "title": "Take this course if you are smart enough",
            "comment_content": "A brief intro of AI, nothing special.",
            "comment_teaching": "His English is good. But he taught too fast, very hard to catch up. Also, he didn't distribute lecture notes most of the time, students are required to jot notes. In the meantime, he always shows some complicate graphs drawn on a whiteboard, without giving us a copy of the photo or enough time to copy all the contents. <br />If you are smart enough, you might be able to understand.<br /><br />The only good point is Dekai has a forum for this course, so student can ask TAs any questions and other students may join the discussion too.",
            "comment_grading": "Still giving me a C- even I didn't hand in an assignment. Maybe many people also did a bad job in this course :D",
            "comment_workload": "There are three assignments only, but all of them are very hard. And all of them are not practical since we need to use a library written in C++ which developed by Dekai and TAs. Besides, Dekai wants us to do some improvements to a workable AI system by manipulating the neural network. That was impossible for me since I think I don't even know how to develop a neural network with their library.<br /><br />The exam is not easy too because of Dekai's teaching.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zetZM5c3cAUIMF6yUiQSopU2J1pIwsMJ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 108,
                    "name": "LIN, Fangzhen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jack Qian",
            "date": "Dec 23, 2018",
            "title": "Great elective course for cs major",
            "comment_content": "This course is a general overview of artificial intelligence, including agents, searching, MDP, QLearning(this is the first semester that prof.lin add this part), game theory, knowledge reasoning and natural language processing.It's really general, not much about coding, not even algorithm in some part.However, this course gives an overview of artificial intelligence, that will let you know every aspect of AI, this course can be really helpful if you want to do some research in this field.",
            "comment_teaching": "Prof.Lin is a really nice instructor. He is very patient in answering question.The teaching pace is medium, and he will raise some interesting example to help the student to understand some key concept.The examples are very important because the exam question might be more or less the same. However, Prof.Lin likes to represent the concepts in a mathematical way, and he did not explain the meaning of some variables, which is difficult to understand if you only read the lecture notes but do not go to the lecture.",
            "comment_grading": "Grading is good.<br /><br />3 * 10% assignments, each consists of Witten part and programming part.<br />25% midterm<br />45% final<br />unspecified bonus points for giving response to his questions in lectures.<br /><br />programming assignments are directly copy from Berkeley AI course, CS188.<br />written assignment problem is not very difficult.If you can catch up with professor's progress, it will be a piece of cake.<br />midterm and final questions are easier than the problem in assignments and are more or less the same to the problems in assignments. if you.can finish all the problems in assignment, you will get good marks in the exam.<br />midterm mean 52/74<br />final mean 65/100<br />assignments are all around 80/100<br />midterm final assignments all above 1 sd will get A or A-, grades is really good compare to most of the comp course in UST.",
            "comment_workload": "professor gives sufficient time in doing the assignment, around 2-3 weeks for each assignment.You don't have to spend a lot of time on this course if you attend every lecture, the concepts are not that difficult.However, if you skip the lecture, you might in great trouble in reading the lecture notes.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "amhAgd8o1ZS9Z9toYqVz5fLJNwLPEL3u",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "nikita_h",
            "date": "Dec 05, 2017",
            "title": "",
            "comment_content": "Very interesting content - up-to date and relevant, with a good mix of theory and mathematics. Not very difficult to understand the content.",
            "comment_teaching": "Teaching can be slow, but there are a lot of online materials to help. Lecturer is helpful if anyone has any questions.",
            "comment_grading": "Generous grading with the midterm - average score was above 90. Most assignments are quite easy to get good marks.",
            "comment_workload": "Not too much workload. Short assignments every couple of weeks, with one group project with a presentation and a report at the end of the semester.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CL2e6kozhLXyFr1GxD5GtWyIkF1Y48lg",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 108,
                    "name": "LIN, Fangzhen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DrainGang",
            "date": "May 25, 2023",
            "title": "Not bad",
            "comment_content": "1. Introduction<br />2. Reactive Agents<br />3. Agents that Search<br />4. Markov Decision Process and Reinforcement Learning<br />5. Introduction to Machine Learning<br />6. Knowledge Representation and Reasoning<br />7. Reasoning Under Uncertainty<br /><br />Broad overview of AI, quite interesting in my opinion! There's of course a good deal of math here, but nothing too rigorous or challenging. The rigorous proofs aren't needed in the exams anyway.<br /><br />The assignments would have you implement your models, which is quite fun and useful.",
            "comment_teaching": "Decent.<br /><br />As expected with most COMP courses, he just reads off the lecture slides, which wouldn't be a problem if the slides weren't also poorly made. A lot of the concepts given aren't actually explained clearly, and the examples don't help.<br /><br />With the specialization of 3000 level courses, some topics (particular the last few in the lecture) can't really be Googled through clearly, so get ready to spend time going through the lectures.<br /><br />Luckily, professor Lin is pretty helpful, and is willing to answer any questions, while he does try to teach and seems to be enthusiastic about the lecture material, the lectures remain quite boring, and attendance ends up at like 15% halfway into the semester.<br /><br />There's a tutorial, but no one really cares.",
            "comment_grading": "Assignments (15%): 4 Assignments, 3 relating to the lecture material, and one based on ChatGPT, all of them are pretty easy, and for the lecture-based ones answers can be found online (Including the programming questions!)<br /><br />Midterm (35%): Long questions all similar to the assignments, difficulty is similar to the assignments and therefore averages are high, NOTE: There could be questions BASED on the lecture materials directly, so do study. (Something like &quot;Explain Supervised Learning&quot; for example) (Mean: 66/100)<br /><br />Final (50%): Same thing as the midterm. Difficulty similar to assignments again.<br /><br />Finally, from the CANVAS website: &quot;Bonus points for active participation in class discussions and other worthy contributions.&quot; Percentage of grade unknown, but I assume this is attendance, since the professor asked the remaining students at the lectures to write their names down. (Quite few names on the piece of paper regardless.)<br /><br />-3% over mean, B-, quite good!",
            "comment_workload": "Pretty nice for a COMP course.<br /><br />Assignments are not that hard, and the programming parts are also pretty easy. Each would take maybe half an afternoon to do.<br /><br />As for the exams, past papers for both the midterm and the final are graciously given by professor Lin, meaning that you can do them, and also go over the assignments, taking a day or two maybe.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1UA9bZwn2oeokepYSFDBLpG4C5wQG8fM",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 909,
                    "name": "SONG, Yangqiu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "刘殊玥",
            "date": "Jan 09, 2018",
            "title": "",
            "comment_content": "AI basic--search, learning...and finally the logic basic. Some videos on youtube is useful when learning this course. No other material is needed. The powerpoint is enough to learn this course.",
            "comment_teaching": "the content is from other school and the prof just copy them and teach them to us. But some videos in the powerpoint can make it easier to learn.",
            "comment_grading": "Assignment and midterm is easy to get full marks. The grade is very good.",
            "comment_workload": "6-7 individual assignments which is easy to finish, and a final group project with a group report.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3fZeFPdDuAsnuxrq9GiezvCDXSWlxPG8",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 108,
                    "name": "LIN, Fangzhen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tat",
            "date": "Aug 23, 2018",
            "title": "Good Course",
            "comment_content": "Some basic knowledge about AI, logic and probability",
            "comment_teaching": "It is easier to understand by following the examples in the notes. Better attend the class to know the steps to solve the problems.",
            "comment_grading": "Good grade. Don't know why I got so high marks in the Gomoku project (I cant even beat my friends' program)",
            "comment_workload": "The problems in the assignments are acceptable. <br />Mid term and the exam are basically based on the assignments. Try to understand the problems when doing them and have nice marks in both mid term and exam.&nbsp;&nbsp;&nbsp;<br /><br />The project is quite difficult but I think the project is different each year.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4bIyxY1HjAiiGuzNteU1yz1Yj2WWmpf2",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 108,
                    "name": "LIN, Fangzhen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "salahalzubi",
            "date": "Nov 16, 2018",
            "title": "",
            "comment_content": "Simple intelligent agents<br />&nbsp;&nbsp;&nbsp;&nbsp;Search (Uniformed, Heuristic, Adversarial)<br />&nbsp;&nbsp;&nbsp;&nbsp;Learning<br />&nbsp;&nbsp;&nbsp;&nbsp;Knowledge Representation, Reasoning, and Planning<br />&nbsp;&nbsp;&nbsp;&nbsp;Introduction to game theory and auction<br />&nbsp;&nbsp;&nbsp;&nbsp;Uncertainty<br />&nbsp;&nbsp;&nbsp;&nbsp;Natural Language Processing<br /><br />Marking Scheme<br /><br />30% for assignments (including programming assignments), 25% for the midterm and 45% for the final exam. Bonus points for active participation in class discussions and other worthy contributions.",
            "comment_teaching": "The professor definitely knows his stuff. Clear, concise and straight to the point in delivering the material.",
            "comment_grading": "Grading is good. We have 3 assignments and the average grade was around B overall. I think it's fair.",
            "comment_workload": "Workload is average, with 4 assignments.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Rp4XibgcjXE8NLvUvU2uJEgVwefek1ia",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 104,
                    "name": "WU, Dekai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hautonjt",
            "date": "Sep 09, 2016",
            "title": "Do it if you are disciplined enough to not skip class (also Dekai is the best)",
            "comment_content": "Dekai's interest lie in natural language processing, and that really shows in this class. A ton of AI techniques are introduced, but they are usually in the context of translation or processing languages. People that have taken the course have probably heard &quot;Time flies like an arrow&quot; or &quot;Fruit flies like an apple&quot; a billion times. (BTW in case &quot;fruit flies like an apple&quot; doesn't make sense to you, a fruit fly is a type of fly.) There is also some random Chinese thrown in there sometimes, but it's not strictly necessary to know it to understand the class. It'll just increase enjoyment of the material somewhat.<br /><br />There are two major topics in AI: searching/updating and knowledge representation. For searching/updating, you'll revise naïve search methods (BFS, DFS, Dijkstra's) and then be introduced to heurstic search, EM algorithms, forward backward algorithms, Knuth's algorithm, etc. For knowledge representation, you begin with hidden Markov models (HMMs) and then weighted finite state automata (WFSAs), unrolled HMMs and FSAs, progressing to AND/OR graphs and finite state grammars (FSGs). There is also a small taste of inversion transduction grammars.<br /><br />Oh and because it's Dekai you also have Scheme thrown in there randomly in the beginning.",
            "comment_teaching": "If you can't tell, I'm a big fan of Dekai's teaching style. He's really enthusiastic and is willing to force students to break that mold of &quot;never asking questions&quot; a lot. He will try his best to force you to speak in his class. His classes have a sort of &quot;American&quot; atmosphere to them, if that makes sense.<br /><br />He also loves going on tangents related to his research, and he loves functional programming and cool things. He also makes use of the whiteboard a lot, which really beats the &quot;reading the powerpoint&quot; professors. I'm sure you know which ones I'm talking about.",
            "comment_grading": "I ticked &quot;attendance&quot;, but there is no attendance in the course. However, if you don't attend class, you'll be 100% screwed for the midterm and final simply because the notes are not going to be online and are only given when the topic is fully covered. He also does examples on the whiteboard, which are NOT in the notes, and he will test you on them.<br /><br />There are also a bunch of other smaller assignments that apply what are taught in class. Those are not very difficult and can be done in about 30 minutes.<br /><br />I didn't study for the midterm outside of just doing the assignments and taking notes in class and got a really decent grade, so the midterm is not very hard. The final exam is open handwritten notes, and since I took notes for every class I did really well. There was a scheme question at the end, but since almost everyone forgot their scheme they were just given marks for attempting it.<br /><br />The distribution of grades is standard Dekai:<br />Midterm exam: ~20%<br />Final exam: ~25%<br />Participation: ~5%<br />Assignments: ~50%<br /><br />Since it's Dekai, you have his typical marking scheme, which is a curve with the following guarantee:<br />&gt; 85% is at LEAST an A<br />&gt; 75% is at LEAST a B<br />&gt; 65% is at LEAST a C<br />&gt; 55% is at LEAST a D",
            "comment_workload": "There was one programming assignment that was really easy if you knew a small amount of Scheme. The other homework is written and really easy. I think pretty much everyone just got those marks for free as long as your answer makes some sort of sense.<br /><br />As long as you don't mind attending every lesson and copying diagrams on the board while listening to really awesome material about AI the workload is really light. No need to study very much for either the midterm or the final. The homeworks are easily completable within 30 minutes, and there are not that many.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 19,
            "voted": false,
            "is_upvote": false,
            "comment_count": 5,
            "attachments": []
        }
    ],
    "composer": []
}