{
    "error": false,
    "course": {
        "id": 210,
        "subject": "COMP",
        "code": "2012",
        "name": "Object-Oriented Programming and Data Structures",
        "description": "To learn the fundamental concepts and techniques behind object-oriented programming. They include: abstract data types; creation, initialization, and destruction of objects; class hierarchies; polymorphism, inheritance and dynamic binding; generic programming using templates. To learn the object-oriented view of data structures: linked lists, stacks, queues, binary trees, and algorithms such as searching and hashing.",
        "categories": [],
        "website": "https://course.cse.ust.hk/comp2012/",
        "credits": 4,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"2011\" href=\"/review/COMP2011\" target=\"_blank\">COMP 2011</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"2012H\" href=\"/review/COMP2012H\" target=\"_blank\">COMP 2012H</a>",
        "rating_content": 4.3,
        "rating_teaching": 4.62,
        "rating_grading": 4.08,
        "rating_workload": 3.46,
        "review_count": 74,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 846,
                "name": "TSOI, Yau Chat",
                "count": 49
            },
            {
                "id": 102,
                "name": "MAK, Brian Kan Wing",
                "count": 12
            },
            {
                "id": 103,
                "name": "QUAN, Long",
                "count": 7
            },
            {
                "id": 753,
                "name": "CHAN, Ki Cecia",
                "count": 4
            },
            {
                "id": 1106,
                "name": "PAPADOPOULOS, Dimitris",
                "count": 2
            },
            {
                "id": 130,
                "name": "CHAN, Gary Shueng Han",
                "count": 1
            },
            {
                "id": 131,
                "name": "QU, Huamin",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "lKCEsuwyKZPDJEOqlpzeAKVVmZG78f6W",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 103,
                    "name": "QUAN, Long",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "xdlok",
            "date": "Jan 09, 2019",
            "title": "y u do dis, long?",
            "comment_content": "This course looks deeper into the world of OOP and introduces some more data structures.<br /><br />Contents that will be tested (Not completely in order):<br />OOP:<br />Class constructors, destructors, Order of construction/destruction<br />Operator Overloading<br />Abstract Data Type<br />Static member<br />Generic Programming<br />Inheritance (public, protected, private)<br />Polymorphism: Overriding, virtual, ABC<br />Data Structures:<br />Stacks and Queues (again)<br />BST<br />AVL trees<br />Hash tables<br /><br />Contents that are not tested (Only taught in Professor Quan's session):<br />Basic algorithm analysis (big O)<br />Insertion sort, Merge sort<br />Counting sort, Radix sort (As application of Queues)<br />Heap, Heap sort, Priority Queues<br /><br />The stuff not tested here are basically 3711/H stuff.",
            "comment_teaching": "Ah the teaching. As I always said: 厲害了，我的龍.<br /><br />I have attended all his lectures except for one. And I would say that, his teaching is actually not that bad. His accent is ... Interesting, but I have no problem understanding. He sometimes give us the motivation behind something, like for operator overloading, we want the operation to be closed (return value be the same type), and he goes off to say something about group, rings and fields, etc. Definitely not useful for exam, but interesting.<br /><br />Speaking about usefulness in exam, oh my god there is not much. Often he goes over the important topics so fast that you couldn't see his taillight. Inheritance is done in ONE lecture. You read that right, ONE, as in less than two, so that there is more time for him to talk about the extra stuff. The thing is, he will go on to say that something is not important, but then that something appeared in the exam! I guess you can see that the exam papers are prepared mostly by Desmond, and not Long. For example, he said that private and protected inheritance is not important, so he didn't go over it. Then in the exam, it appeared. Surprise! Long said that he looked over the paper to make sure that only the content taught by both lecturers will appear on the exam, but the word 'TAUGHT' is used very loosely, as some topics are technically 'taught', but even as a person who attended almost all of his lectures, I don't remember it (E.g.: const-ness). When I asked him, he said: It was in one of the page in my slides! 厲害了，我的龍. He often talked about the concept, and rarely the code, which is basically what the whole exam is about.<br /><br />By the way, around midterm, only 20 people are present. Near the finals, 5. 5/around 90 people attended his lectures. I guess the rest watched or attended Desmond's lectures (the smart choice). Keep in mind though, this is a 9am lecture. But I couldn't help but imagining the face of him when he invigilate the final exam (for the students from his lecture) and saw that holy shit, there were 90 people registered in his session.<br /><br />What I would suggest is, to just go with Desmond's lecture or videos. If you are really stubborn like me and stuck with Long's lectures, do the past papers. It will save your ass in the midterm and final. It was only when I was attempting the past papers do I realize how screwed I am, and how 厲害 my 龍 is.<br /><br />I guess one of the problems of this course is that, questions in exam are often stuff that Desmond have mentioned in his lecture, but not in Professor Quan's.<br /><br />The labs could be time-consuming, so at least read the site before coming. Not much to say.",
            "comment_grading": "Remark: try to take this course in fall to avoid the CS guys!<br />Check other people's review for the scheme.<br />I got below mean in PA1, &gt;=1sd for PA2 and 3, full marks in lab, 8x in midterm, 89 in finals and got A. Although my friend, with only 1 or 2 points higher than me in midterm and final and almost the same everything else, got A+. It leaves you to judge the grading.",
            "comment_workload": "The workload is fine. The labs don't take too long to finish; the PA takes more time to debug, but still manageable.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 20,
            "vote_count": 20,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UD7nLP8rfB2yWkJzDBTod8olJRKAHC8V",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Shounainai",
            "date": "Jan 24, 2017",
            "title": "Best instructor ever",
            "comment_content": "",
            "comment_teaching": "Instructor人特別擾特別耐心 每次下課都會為所有要問問題的人留到最後一個問題都問完<br /><br />此外 他特別認真&nbsp;&nbsp;加了很多課深怕有同學一開始基礎不好的 上了好幾堂pointer 把觀念解釋的非常清楚 project前也都會特別開session協助同學們完成<br /><br />還是特別感動的 科大能有一個那樣好的instructor",
            "comment_grading": "",
            "comment_workload": "",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 11,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hNRjp2WbXFQDEOmyyA7COFNDatmWtxWL",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 753,
                    "name": "CHAN, Ki Cecia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rind",
            "date": "Jun 07, 2021",
            "title": "Very good Instructor",
            "comment_content": "Continuation of COMP2011<br />1. Intro, review, const-ness, lambda<br />A brief review of what have been learnt from 2011, introduction to lambda expression.<br /><br />2. Constructors and Destructor<br />OOP concept. It is very important to distinguish different kinds of constructors and their use-cases. Like: why a conversion constructor only take one parameter? Ans: for implicit conversion when we are doing something like: Word a = &quot;abcd&quot;<br />This topic plays an important role in the next topic when discussing Inheritance (like order of constructions), do remember to do more practice and understand each constructor thoroughly<br /><br />3. Inheritance and Polymorphism<br />OOP concept again.<br /><br />4. Generic Programming<br />The power of template for code re-using. Do pay attention to the syntax.<br />Operator overloading is a very important part of this course. Make sure you know how to write the function declaration of each operator (like &lt;&lt; , [ ] requires two function signature...)<br /><br />5. STL<br />Application Programming Interface (API) for extremely useful data structure (vector, stack, queue, map...) You don't have to memorize all the things, but better get more practice.<br /><br />6. Hashing<br />More theoretical. Something you will see again in COMP3711. Very basic and there is basically no Math behind this chapter. (They just teach you the method)<br /><br />7. Binary Search Tree<br />Another data-structure.<br /><br />8. Rvalue reference and Move Semantics<br />Better use of resource: temporary objects, move constructor, move assignment operator",
            "comment_teaching": "It is the first time Cecia teaches this course. Probably because Desmond won't teach 2012 next year.<br /><br />Since my COMP2011 was taught by Cecia, I get used to her pace and style. I would say Cecia is a great instructor in this course also (Besides Desmond :D).<br /><br />I don't know how do people learn programming, but for me it starts from the basic: make sure you understand every line of code, what is the meaning/usage of such design, what if I change something, will the program still works? (You have to be &quot;naughty&quot; and use your imagination to change the codes and give an explanation of the new result. 中文講就係舉一反三)<br /><br />Therefore, Cecia should be the one you look for if you want your basics to be stronger. Usually she will give a more simpler example compared to the lecture note when starting a new topic. And there will be some &quot;tricky&quot; polling questions that allows you to understand more about the mechanism.<br /><br />Since it is her first year teaching COMP2012, her pace is a little bit slower than expected. Resulting in rushing the last few topics, but I think it is still ok to handle given you have solid understanding in all the topics before.<br /><br />I don't have any experiences on programming besides the intro course. But from COMP2011 to 2012, two A+s, the only thing I can do now is a big appreciation on her ;)",
            "comment_grading": "Grading Scheme:<br />Programming Assignments 40% (4PA in total, each 10%)<br />Lab 8%<br />Midterm 12%<br />Final 40%<br /><br />For me:<br />PA: almost full (the mean for PA is around 80-90 something, majority of students get in the range [90, 100]<br />Lab: fill<br />Midterm: 71.25/100 (mean: 53.93, SD: 16.26)<br />Final: 91/100 (mean: 62.93, SD: 16.80)<br />Total: ~92.5/100<br />Final Grade: A+<br /><br />The final this time is better, allowing 2 tabs so that we don't have to scroll up and down so frequently.",
            "comment_workload": "The workload of this course mainly comes from PA and lab that requires you to catch up with course material.<br />PA1, 3 are easier but PA 2 and 4 are much difficult. Especially PA 4 costs me around 2-3 days to finish.<br /><br />The labs are quite boring. In Comp2011 we usually have some logic demanding labs that requires like 2-3 hours to finish. However the lab this semester is too easy. Maybe you change 2-3 lines of code, or copying other functions to finish the tasks. Usually it takes 15-60mins for each lab. Sometimes you don't have to understand anything new to finish the lab.<br /><br />The way I learn 2011/2012 is develop reasonable explanations for all the phenomenon. (Not applicable for everyone, just if you are interested.)<br />E.g. It is very hard to memorize the order of construction/destruction<br />Then you can think of building a house. You have to gather all the components before you can really have a house. If your house requires a component from other class (own other class object), then ask someone to build the component for you (class constructor); If your house is base on another house (inherited), then ask other to build the base for you first (base class constructor), then you can stack the components one by one and finally create a house.<br /><br />By some &quot;stories&quot; or &quot;analogy&quot;, try to come up with a reasonable mechanism for all the things in this course. Just like building a house, your base determines how tall you can build.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IDOMgPEbj4HdSAt3EA71WpczokCh9pQ8",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1106,
                    "name": "PAPADOPOULOS, Dimitris",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Chino",
            "date": "Jun 07, 2021",
            "title": "Great instructor",
            "comment_content": "Basically follow the stream from COMP 2011.<br />the course focuses more on the OOP part features of C++.<br />Mainly include:<br />1. Order of constructor and destructor<br />2. inheritance and abstract class<br />3. generic programming and template<br /><br />It also includes some basic concept of algorithm and data structure:<br />1. Binary search tree and AVL (AVL part self learn, not examined)<br />2. hash table<br /><br />Some small yet important feature of C++ is also included but in a smaller fraction<br />1. constness of variable<br />2. lambda function<br />3. STL library<br />4. static keyword (self learn, not examined)<br />5. namespace (self learn, not examined)<br /><br />Overall well structured, easy to manage if you takes time to read through the lecture note and play around all the features.",
            "comment_teaching": "Very well teaching, teach in a moderate pace and allows you to think and ask questions after each short sections and after lectures.<br /><br />Explain in detail of every piece of code in the example clearly and points out all the important points that should be handled carefully.<br /><br />p.s. his tone is easy to follow, don't be scared by his name lol.",
            "comment_grading": "Quite competitive.<br /><br />lab + assignment: 8% + 40%<br />midterm: 12%<br />final: 40%<br /><br />The midterm is tricky and final will be easier (at least for my year and past paper I did). Final is more important if you aim high grade.<br /><br />try to aim at 90+% for A+, 80/85% for A.<br /><br />the score is highly deviated, so scoring a mean might just be around B-/C+.",
            "comment_workload": "Lab is very easy if you pay attention on the lesson, basically just focus on one features taught previously, follow the instruction and attend the lab on time then you can get the marks.<br /><br />Assignment is a bit challenging, try to understand every parts of the given skeleton code before go directly into the tasks. Do it at least a week before the deadline and leave enough time for you to debug, piazza is a good place for you to find some of your potential bug.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ERDsSw0ujXu2LQ7fAblrImn7cS2d3j0w",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                },
                {
                    "id": 753,
                    "name": "CHAN, Ki Cecia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sune",
            "date": "Jun 01, 2023",
            "title": "Its fame is well-deserved",
            "comment_content": "1. Intro, review, const-ness, lambda<br />2. Constructors &amp; Destructor <br />3. Inheritance and Polymorphism<br />4. Generic Programming<br />5. BST<br />6. Hashing<br />7. rvalue References and Move Semantics<br /><br />Self-study (Not tested in midterm and finals):<br />1. Makefile<br />2. Namespace<br />3. Static Class Data/Methods<br />4. AVL<br />5. STL<br /><br />But, it's just a lot of classes, a lot of trying to be a human compiler, then some sort-of-fun-and-sort-of-makes-you-want-to-murder things.",
            "comment_teaching": "Both instructors teach well, but they have different styles. I recommend those who take it to try both lectures and see which one suit you more (or go to both, no one's stopping you). Desmond's fame is obviously widespread, but Cecia's teaching is clear as well.<br /><br />Dinh, Anh Dung is also a very good IA, he explains things in a concise and detailed manner in labs, especially during the questioning, which contributed to my understanding of course material.",
            "comment_grading": "3 PAs, each 9%<br />Labs 10%<br />Midterm 25%<br />Finals 38%<br /><br />My score:<br />PA1 - 100%<br />PA2 - 100%<br />PA3 - 97.5%<br />Labs 100%<br />Midterm - 82.25% (Mean 59.12, Median 60, SD 15.47)<br />Finals - 72.65% (Mean 59.24, Median 61.23, SD 14.07)<br /><br />Grade: A",
            "comment_workload": "Time management is very important, the PAs can be gnarly, particularly PA3. One should plan when a PA is released.<br /><br />Considering you can sit any other lectures, I would recommend one to register the course according to their availability for the lab section, because they can be time-consuming. Lab sessions are also where the attendance matters, same as COMP2011.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gRwvRjTPoXqLGNcXcmRboegk700DSwiX",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ahzzzz",
            "date": "May 24, 2023",
            "title": "Fruitful Course",
            "comment_content": "----Content----<br />1. Intro, review, const-ness, lambda (week 1-2)<br />2. Constructors &amp; Destructor (week 2-4)<br />3. Inheritance and Polymorphism (week 5-7)<br />4. Generic Programming\t(week 7-9)<br />5. Binary Search Tree (week&nbsp;&nbsp;11-12)<br />6. Hasing (week 12-13)<br />7. rvalue Reference and Move Semantics (12-13)<br />---Self-Study Topics---<br />1. Makefile<br />2. Namespace<br />3. Static Class Data/Methods \t<br />4. AVL <br />5. Standard Template Library (STL)<br /><br />Content in self-study topics will not appear in the exam. But I highly recommend studying AVL trees before final. As in this year's final exam, they put AVL tree in the last sub-question. (Still, please note that without knowledge of AVL tree you can finish that question, just that prepare more is better than less)",
            "comment_teaching": "Desmond God. Done.<br /><br />But the TA in lab section are just PowerPoint readers. Don't bother to listen to them lmao.",
            "comment_grading": "Grading Scheme<br />Programming assignment - PA1\t9%<br />Programming assignment - PA2\t9%<br />Programming assignment - PA3\t9%<br />Laboratory exercises\t10%<br />Midterm examination\t25%<br />Final examination\t38%<br /><br />---Statistics and my Grade---<br />PA1: 100/100 (mean = 82.8, sd = 24.3)<br />PA2: 100/100 (mean = 93.9, sd = 19.2)<br />PA3: 97.5/100 (mean = 83.1, sd = 24.7)<br />Lab: 23.5/24<br />Midterm: 74.5/100 (mean = 59.12, sd = 15.47, median = 60, max = 94.5)<br />Final: 87.75/100(mean = 59.24, sd = 14.07, median = 61.23, max = 87.75) (I didn't know what is AVL tree before the exam, so without knowledge of AVL tree you can still score great)<br />Final letter grade: A+",
            "comment_workload": "Workload is pretty immense to be honest. <br /><br />Desmond provides 5 additional lectures it total, 2 hours each. <br /><br />And there comes the 8 labs. On average it takes roughly 2 hours to finish one lab. But for some labs related to self-study topic, it takes more time.<br /><br />3 PAs. Each PA takes around 1-2 days to work on. As almost half of the class get full in every PA, you eventually will have to work your ass off to save your grade.<br /><br />To conclude, work hard if you register this course. It will be fruitful",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "06FMRpB3SHPoNDvCUqe7fRXGdglTBWM9",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MEMENTO",
            "date": "Dec 28, 2017",
            "title": "",
            "comment_content": "The content are as follows:<br />0 logistics<br />1 oop intro<br />2 class basics<br />3 preprocessor and const<br />4 constructor and destructor<br />5 static function<br />6 generic programming<br />7 stl<br />8 inheritance <br />9 namespace<br />10 bst<br />11 avl<br />12 hashing<br />The contents are very important in understanding the OOP concept and data structure",
            "comment_teaching": "Desmond was my favorite lecturer. His lectures were amazing, and he made several additional classes to help us understand the course material deeper. He was very passionate in lecturing, and he taught us in a way that was very easy to understand. You will find yourself very lucky if desmond turns out to be your lecturer.",
            "comment_grading": "The grading was slightly tough, since the sd tends to be very high, and it is difficult to get A+. This semester, the mid-term had very low mean of 52.70 and sd of 18.12, whereas the final had very high mean of 81.64 and sd of 15.11. The assignments mean ranged between 75-90. (for all 3) <br />I got 1.8sd on the mid-term, 0.7sd on the final, and got an A.",
            "comment_workload": "The workload was more than moderate, because the course material might feel very tricky. You need to spend extra time reviewing the lecturer or reading through the lecture notes to get familiar with the concepts. However, the assignments do not take very long to finish.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dKB86Sxf5ssgSlB1fLDy9h80fe8VVOce",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "briansee",
            "date": "Aug 22, 2017",
            "title": "Good course and useful",
            "comment_content": "Comp 2012 should be take if you is interest in CS<br />You can learn all the basic data structures such as Tree.<br />Also, you can learn other knowledge such as class",
            "comment_teaching": "Desmond is a very good lecturer.<br />You should take his class. <br />You can feel free to ask everyone you want such as your study plan, your U life or something.",
            "comment_grading": "The mean should be C or C+<br />My mid term is mean.<br />My exam score is above mean around half sd ah<br />then my grade is B-",
            "comment_workload": "very chur<br />three assignment and lab",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EkOPYLwXEicYO0TO9kuLAab8lf13hMEE",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LuckyTiger",
            "date": "Aug 16, 2023",
            "title": "Epitome of teaching excellence",
            "comment_content": "They can be found here if you are registered in the CSE network<br />https://course.cse.ust.hk/comp2012/<br /><br />Week 1-2: Intro, review, const-ness, lambda<br />Week 2-4: Constructors and destructors -&gt; classes<br />Week 5-7: Inheritance and polymorphism -&gt; classes<br />Week 7-9: Generic Programming<br />Week 10-11: Hashing<br />Week 11-12: Binary Search Tree<br />Week 12-13: rvalue and reference and Move Semantics<br />Week 13: Standard Library Template (not covered in exam)<br /><br />Self study (not covered)<br />Makefile<br />Namespace<br />Static Class Data/Methods<br />AVL<br /><br />Overall, surprisingly not as much of lecture notes compared to 2011. I really appreciated that they took a lot of time to review the 2011 stuff in the beginning because the foundation I had was pure trash ngl.",
            "comment_teaching": "Why is Desmond the best instructor that I have ever learned from in HKUST?<br /><br />In terms of technical efforts, It’s clear he has tried to make the tragic idea of sitting through or watching lectures as smooth as possible. Crisp and clear sounding mic? Done. Punctual lecture recording uploads? Done. Lecture recordings with mic connected to the audio? Done. Lecture recordings all compiled in a website? Done. Lecture recordings all compiled in a website plus progress of lecture slides (e.g. topic XYZ p.23-48) next to each video? Done. What more can I ask for? I have not once waited for him to upload his lecture videos if I missed class. And for revision, if I forgot some topic, I didn’t have to spend an hour opening fifteen tabs of zoom recordings to figure out which video it was. <br /><br />Desmond is unparalleled, compared to most instructors. The others simply don’t pay attention to minute details like this that make it easier for students to consume their knowledge.<br /><br />His teaching is also powerful. Each sentence he speaks is so dynamic and meaningful; he could literally become a voice actor. There are some professors who speak like a robot for half the lecture to explain a topic, and then suddenly express a slight hint of their quasi-personality to show that the topic they’ve taught is indeed, remarkable or interesting. Desmond doesn’t speak like a robot at all. He teaches with the curiosity of students in mind and in a way, he is sort of performing when he does so. <br /><br />Aside from his oral delivery, his ideas are very intuitive. He is not reading lecture notes most of the time but instead giving these very simplified and dumbed-down programs. Surprisingly, his programs cover most of the lecture notes. He has consistently (and jokingly) thrown shade on some of Professor Mak’s complicated example programs that reside in the lecture notes, which I live for. <br /><br />When Desmond teaches, he has shown immense empathy to the students. For one, I think he knows that people lose focus normally. Every time I lost focus in class, Desmond would literally repeat his latest sentence, word for word, as if he could sense that I was zoning out to another dimension. On a serious note, I think if I had some attention deficit, this class wouldn’t be that bad. This obviously may have increased the time of the lectures but I don’t think Desmond cares. I mean, it is clear that he isn’t there because he is a professor and needs to finish the syllabus before the end of the semester because it is his job. He is there because he wants to teach. Desmond also knows that students struggle and acknowledged the difficulty of the course on multiple occasions. He has made it so clear that help is found whenever needed and this made it much easier to complete this course.&nbsp;&nbsp;<br /><br />Desmond also has a website where you can see his weekly schedule. If you can’t make it to his office hours, and you missed TA’s office hours, you can email him to perhaps book an appointment and your name will be on the schedule. Like what? This guy is just so detailed.<br /><br />Overall, I think Desmond is an excellent teacher and he knows that. I hope he never stops teaching.",
            "comment_grading": "3 PA’s<br />PA1: 53/100 Mean: 70/100<br />PA2: 90/100 Mean: 79/100<br />PA3: Full Mean: 85/100 <br /><br />PA1 was hard and Desmond said it too. I started around 1 week or less before the due date so this may have been my problem.<br /><br />PA2 and 3, I started quite early maybe 3,4 days after it was released so I could ask for help easily. When I did so, I had pathetic implementations like “delete this” in my destructor, which doesn’t make any sense, so going to the TA’s for help was good. They will definitely help you point out silly misconceptions. <br /><br />Midterm<br />58/100 Mean 65/100<br />Exam<br />53/100 Mean 53/100<br /><br />Final grade: C+<br /><br />I wish I could have done better, but I have learned a lot from this course and enjoyed it very much regardless. This grading is satisfactory for me. I guess the main thing is, don't give yourself the chance mess up any of your assignments.",
            "comment_workload": "8 Labs: <br />Sort of easier than the 2011 ones I feel. Lab 2 and 7 were the hardest for me. For Lab 2 I went to TA Joe and he was so helpful and understanding. For Lab 7, I went to Desmond and he was amazing as expected. I had an amazing conversation with him after he helped me.<br /><br />3 PA’s: takes me at least a week to do.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pDN6vfYOMIP21XqgWBimS8Xmj22f3MKF",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 102,
                    "name": "MAK, Brian Kan Wing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SARSalad",
            "date": "Jun 22, 2020",
            "title": "Unpredecented online lecture and assessment experience!",
            "comment_content": "(The midterm wasn't conducted in this sem due to online teaching mode, so this is my assumption of the topics covered before and after the midterm in normal teaching schedule)&nbsp;&nbsp;&nbsp;<br />Before mid-term:<br />0. Revision of COMP 2011 (const-ness, dynamic array, linked list &amp; C++ Class Basic): since this course is the continuation of COMP 2011, lecturers will review on the topics covered after the mid-term of COMP 2011 to ensure everyone is ready for what is coming.&nbsp;&nbsp;<br /><br />1. Constructor &amp; Destructor: You have seen them for the first time in COMP 2011, but they actually take several forms. You are going to understand how these forms of Ctor and Dtor mix up in the object construction and destruction.<br /><br />2. Inheritance and Polymorphism: The lecturers from now on will groan about code re-use and introduce these two major OOP topic in order to clear way such frustration, they are also reflected in reality too!<br /><br />3. Generic Programming: I have mentioned the hatred of the lecturers against code re-use. With templates, we have virtually no other means of duplicating similar-looking codes. If you don't think certain operators (+,-, +=, &lt;&lt;) work well for user-defined data types, you can even re-define them by operator overloading.<br /><br />After mid-term:<br />4. Hashing: the mechanism behind searching. Without coding, this is the easiest data structure to learn. <br /><br />5. Binary search tree (BST): The pain of recursion curses my body once more when implementing this data structure. You are also going to learn the three ways of traversing the tree, it's great that it couldn't be directly examined in the online exam!<br /> <br />6. AVL: Just BST plus balancing, so make sure you understand BST beforehand. <br /><br />7. rvalue Reference and Move Semantics: the story of temporary objects attempting to extend their lifespan with rvalue reference but end up being abused by move semantic. This final topic can possibly &quot;move&quot; down your grades if being taken lightly of, be cautious!",
            "comment_teaching": "The lab session on the first three weeks and the last week were used for revision of COMP 2011 and teaching move semantic, which is brilliantly planned in my opinion as they are crucial for us, they act as the building block and the finisher to 2012 respectively. <br /><br />Dr. Mak elaborates concept very clearly and is willing to answer students' questions in-class and post-class, especially with the teaching mode. I feel pity for the one leaving right at the end of class and missing precious learning time. The interaction between students with lecturers bucked the trend. I wish we can maintain the same learning vibe However, he is very strict in terms of quizzes and teaches very fast (only held one make-up class). If you are a proficient programmer, go for Dr. Mak's class. <br /><br /><br /><br />OTHERWISE, GO FOR DESMOND AT ANY COST! WORTHY AND YOU WILL GAIN MORE THAN ADEQUATE!",
            "comment_grading": "(The item marked with '*' is only applicable in this sem)<br />PA1 - Database Queries: 10% <br />PA2 - Harvest Moon: 12% (Looks like I am nowhere ready for game development...)<br />PA3 - Infection Analyzer:\t13% (This is going to be the most complicated one,it became the most manageable)<br />Laboratory exercises: 10% (With the online teaching mode, we have to attend all of that, in contrast to two-off grading in normal circumstance.)<br />Polling: 10% (* Done at the end of the 29 lectures, counts the 20 highest one. The COMP department finally cares attendance with the online teaching mode) <br />Quiz: 8% (* This is conducted after the revision of COMP 2011, so you know the syllabus and it is similar to the one we had in 2011 on September last yr, marked *&nbsp;&nbsp;since it is believed to replace midterm)<br />Final examination: 37% (use Canvas for assessment, 3 parts 45 mins each, recess between each part)",
            "comment_workload": "Heaviest ever!!!!!!!<br />1. We have to attend almost every lab and lecture to get the lab score and polling score respectively (at most 20 of the latter if you get all of them right)<br />2. Speaking of lab, unlike the normal one where we can ask TA for help, demo is the only thing we could do in the lab session, so the code needs to be error-free before attending the zoom meeting. <br />3. The difficulty of PA is unstable: PA1 is probably the hardest one yet we're given the least amount of time to complete it, whereas PA3 became manageable after a few days of the amendment.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9DLoR55nszBYB5PE39b7MOt1HdJUWJHD",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bearrr",
            "date": "Jun 03, 2017",
            "title": "Best Lecturer = Desmond",
            "comment_content": "As a CS year 2 student without cs base, I think that this course is the most valuable and meaningful course for me in the past 2 years. <br /><br />Content:<br />Part 1: OOP<br />1. Constructor/Destructor of class<br />2. const-<br />3. generic programming (template, STL)<br />4. dynamic binding<br />5. Polymorphism<br />6. inheritance<br />7. Namespace (not included in the exam in this semester)<br />8. static method<br /><br />Part 2: Data structure<br />1. ADT<br />2. Tree (BT, BST, AVL)<br />3. Hashing<br /><br />Basically, if you really spend time in this course, the content is not difficult at all even you're not good in Comp2011. I think at least for the exam, comp2012 is much easier than comp2011. Students who are not performing well in comp 2011 can perform quite good in comp 2012.",
            "comment_teaching": "Desmond's teaching is very very clear and attractive.<br />I usually fall asleep in lectures, but not in Desmond's. <br /><br />For those who are talended or very good in OOP, his teaching maybe too slow and duplicate, but for ordinary students like me, can follow the key concepts easily.<br /><br />As he really taught so detailed , he always provides makeup classes. For this semester, 3 2-hour makeup classes were held.",
            "comment_grading": "Similar to Comp 2011.<br />MIDTERM:<br />Mean = 62.16; SD = 17.02<br /><br />FINAL:<br />Mean = 67.87; SD = 18.10<br /><br />My mid-term got 74.25 and final got 83.5, overall ~80% get B+<br />It is a great improvement for me as I got C+ in comp 2011, thanks to Desmond.",
            "comment_workload": "Similar to Comp2011.<br />9 labs, 3 PA, midterm, final.<br /><br />The labs are quite easy in this semester, spend less time with respect to comp 2011.<br /><br />PAs ARE HARD, especially the last one. The content is not yet taught when the PA is released.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DD56rrL2y4aC9BzXsQdfLjfoRQNQWpOs",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "C.C",
            "date": "Jul 18, 2023",
            "title": "excellent data structure + programming course",
            "comment_content": "Asides from teaching you many useful C++ features, I think a big focus is on language concepts and how to explain various C++ standards e.g. why shouldn’t you declare a pure virtual destructor without implementation in a class hierarchy?, why can’t you use a rvalue reference to initialize another rvalue reference ? etc. <br /><br />Of cause as the course title suggests, they will also teach you some useful data Structures like BST &amp; hash table and you will have plenty opportunities to practice applying those data structures in PA and labs. <br /><br />You’ll find out in other courses many more application of those data structures like hash table can be used to improve run time of sorting. Overall the content is very important and interesting. <br /><br />Exams are quite competitive, in addition to assessing your mastery on course material and problem solving skills, they also test your stamina ie. Can you code for long hour even when you’re tired? exam is ~3 hrs you know. <br /><br />Also in exam time allocation is key, I got low mark in final because I spent too much time challenging the hard question and rushing through easy questions, this resulted in tons of careless mistakes. So allocate your time more rationally. <br /><br />Speaking of the final exam, in the last question (AVL), If you have very good concept of pointers (COMP2011 topic) I think you can solve the problem without using any AVL technique which is out syllabus. So make sure you do through review on pointer and how they may be creatively used.",
            "comment_teaching": "Very good teaching from Desmond, he explained complicated topics in a way you can understand e.g. when he taught move semantics, instead of following the slide he gave us the big picture (resource stealing) first, he also illustrated using actual examples.<br /><br />Also his passion in teaching is highly contagious, you'll suddenly be very motivated too when you attend his lecture lol<br /><br />TA team is also very good, especially Dinh Anh Dung (the lead TA i guess) he answer questions on Piazza very fast and concise. I also like the 2 PAs he designed which is PA2 tournament matching and PA3 tic tac toe with minimax, at least for me they're really fun. <br /><br />In PA3, interestingly the TA made an important logical mistake in the hash table optimization for alpha-beta pruning that made the algorithm incorrect,&nbsp;&nbsp;however the mistake is ... super tricky and technical, so (unsurprisingly) no one (a whole class of few hundred people!) found out until the TA later found out himself lol. But that error is really just an exception, they don't make mistake 99% of the time. Still when you're doing assignment, you should think more critically and actually understand the purpose of the code and the logic behind it. I too thought I'd throughly understood the code, but I still couldn't spot that huge mistake, so I actually didn't throughly understand the code ... lol<br /><br />There're around 700 questions on Piazza and only 13 unanswered. So the teaching team did a great job.",
            "comment_grading": "PA and lab almost full mark <br /><br />midterm exam: ~83% (~+1.6 sd)<br />final exam: ~76% (~+1.5 sd)<br />overall ~86%<br /><br />grade: A+<br /><br />thanks for the leniency!",
            "comment_workload": "5 mins lab attendance each week and&nbsp;&nbsp;3 PAs. On average, you can finish labs within 1 hour PA within a day, but I always spent additional time to triple check and make sure there's no mistake. <br /><br />Also do more past papers to train intuition on exam questions, this's key to answer questions very fast in exam. Note that intuition != logical thinking and there're good videos on Youtube explaining how to take advantage intuition in competitive exams. But over reliance on intuition may backfire as it's error prone.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "r8tKC2RVn152vGQ5ImZ4ofbgeEWfTTfy",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AHZHONG",
            "date": "May 31, 2023",
            "title": "",
            "comment_content": "Topic Covered:<br />1. Revision of dynamic data structures<br />2. C++ class basics<br />3. Separate compilation and makefile<br />4. Constructors, destructor, initialization<br />5. Inheritance, polymorphism, and dynamic binding<br />6. Generic programming<br />7. Namespace<br />8. Static member functions/data<br />9. Hashing<br />10. Binary search trees<br />11. rvalue reference and move semantics<br />12. STL: containers, iterators, algorithms<br /><br />Lecture:<br />1. Intro, review, const-ness, lambda<br />2. Constructors &amp; Destructor<br />3. Inheritance and Polymorphism<br />4. Generic Programming<br />5. Binary Search Tree<br />6. Hashing<br />7. rvalue Reference and Move Semantics<br /><br />Self-study Notes<br />1. Makefile<br />2. Namespace<br />3. Static Class Data/Methods<br />4. AVL<br />5. Standard Template Library (STL)",
            "comment_teaching": "Desmond is good. He explained some concepts well and in different languages include English, Cantonese and, Mandarin. He loves to repeat the concepts again and again for us to understand.",
            "comment_grading": "PA1: 9%<br />PA2: 9%<br />PA3: 9%<br />Lab: 10%<br />Midterm: 25%<br />Final: 38%<br /><br />There is a total of 8 Labs<br />Lab 1: Makefile and Separate Compilation<br />Lab 2: Constructors and Destructors<br />Lab 3: Inheritance Basic<br />Lab 4: Polymorphism: Virtual Functions<br />Lab 5: Template and Operator Overloading<br />Lab 6: Abstract Base Class, Static Data Members/Member Functions and Friend<br />Lab 7: Binary Search Tree<br />Lab 8: Hashing<br /><br />Grade<br />Lab 1: Score: 3/3, Mean: 2.87, Median: 3, UQ: 3, LQ: 3<br />Lab 2:&nbsp;&nbsp;Score: 3/3, Mean: 2.57, Median: 3, UQ: 3, LQ: 2.5<br />Lab 3:&nbsp;&nbsp;Score: 3/3, Mean: 2.81, Median: 3, UQ: 3, LQ: 3<br />Lab 4:&nbsp;&nbsp;Score: 3/3, Mean: 2.59, Median: 3, UQ: 3, LQ: 3<br />Lab 5:&nbsp;&nbsp;Score: 3/3, Mean: 2.7, Median: 3, UQ: 3, LQ: 3<br />Lab 6:&nbsp;&nbsp;Score: 3/3, Mean: 2.57, Median: 3, UQ: 3, LQ: 2<br />Lab 7:&nbsp;&nbsp;Score: 3/3, Mean: 2.45, Median: 3, UQ: 3, LQ: 2<br />Lab 8:&nbsp;&nbsp;Score: 3/3, Mean: 2.48, Median: 3, UQ: 3, LQ: 2<br />Lab Total: 10/10<br /><br />PA1 (Tournament Organizer): Score: 100/100, Mean: 82.8, Standard deviation: 24.3<br /><br />PA2 (LegoGPT): Score: 100/100, Mean: 93.9, Standard deviation: 19.2<br /><br />PA3 (Weighted Tic-Tac-Toe with Minimax): Score: 97.5/100, Mean: 84.1, Standard deviation: 24.7<br />PA Total: 26.775/27<br /><br />Midterm: Score: 82/100, Mean: 59.12, Median: 60, Max: 94.5, Standard deviation: 15.47<br /><br />Final: Score: 71.15/100, Mean: 59.24, Median: 61.23, Max: 87.75, Standard deviation: 14.07<br /><br />Overall: 84.312/100 (A)",
            "comment_workload": "1 lab per week.<br />Every PA give you 2 - 3 weeks<br />OK la. Not too heavy",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PFwdJdpthdvJpJd1q6tJhrULb6IU2piS",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                },
                {
                    "id": 753,
                    "name": "CHAN, Ki Cecia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "L.T.",
            "date": "May 26, 2023",
            "title": ";) Haha Course (Recommend to take followed with COMP2011)",
            "comment_content": "Details on other post<br />Quick Summary ➡️<br />1️⃣ Advanced Techniques on class (i.e. inheritance/ generic programming)<br />2️⃣ Data structure (i.e. Hast Table/ Tree)",
            "comment_teaching": "✅ Both professors can explain thing very clearly<br />✅ Professors and TA are very friendly and easy accessible<br /><br />❌ self-learning topic will only be guided very limitedly (coz some of them might be very important concept/ content)",
            "comment_grading": "❗️C++ is a tricky language, therefore there can be a lot of different type of tricky questions in exam (especially debugging)<br /><br />📊 Statistic<br />Lab: 21/24 (should be easy full, i just forgot to go some lab 😅)<br />Pa1: 92/100 (MD 96, UQ 100)<br />Pa2: 100/100 (MD 100, UQ 100)<br />Pa3: 100/100 (MD 96, UQ 97.5)<br />Mid: 80.75/100 (MD 60, UQ 70.88, SD 15.47)<br />Final: 73.7/100 (MD 61.9, UQ 71.13, SD 14.07)<br />Total: ~83/100<br />Letter Grade: A-",
            "comment_workload": "☃️ Lab should be some easy score to get, Pa will indeed demand u time (especially in debugging and if with runtime requirements) but there are fun to me! If you review everything scientifically every lecture and assignment, then preparing exam shouldn't be that difficult and time consuming in case u just want an B-A range",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dWE8UMgRatktgfZn7NCnYBYBWpRPLFBl",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                },
                {
                    "id": 102,
                    "name": "MAK, Brian Kan Wing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "postexampls",
            "date": "Dec 20, 2022",
            "title": "desmond &lt;3",
            "comment_content": "1. intro, review, const-ness, lambda<br />2. constructors and destructors<br />3, inheritance and polymorphism<br />4. generic programming<br />5. hashing<br />6. binary search tree<br />7. rvalue reference and move semantics<br />8. standard template library (not tested in final)<br /><br />self- study (not tested in midterm or final, but is in the labs):<br />-makefile<br />-namespace<br />-static class data/methods<br />-AVL<br /><br />the content is just a continuation from comp2011, it gets harder but with desmond teaching he makes it much easier to understand",
            "comment_teaching": "desmond is good guy, brian is also good guy",
            "comment_grading": "PA1\t9%<br />PA2\t9%<br />PA3\t9%<br />Laboratory exercises 10%<br />Midterm examination 25%<br />Final examination 38%<br /><br />Midterm statistics (out of 100):<br />Mean = 64.59<br />Standard deviation = 19.16<br />Median = 67.15<br /><br />Final statistics (out of 100):<br />Mean = 53.43<br />Standard deviation = 17.75<br />Median = 56.25<br /><br />my scores:<br />PA1: 97.73/100 (mean: 67.51)<br />PA2: 85/100 (mean: 76.72)<br />PA3: 100/100 (mean: 79.97)<br />Lab: full<br />MT: 93.4 (+1.5sd)<br />Final: 63 (+0.5sd)<br />overall %: 82.74%<br />grade: B+",
            "comment_workload": "lab every week<br />3 PAs <br />midterm and final<br /><br />some weeks are packed with <br />lab and pa so that sucked",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YHpuOa8OOohT6eAV06uPD6APEYtgQvaR",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "operator=",
            "date": "Dec 28, 2021",
            "title": "Desmond is a god",
            "comment_content": "The content mainly covers deeper learning in OOP.<br />First some reviews about pointers, const and lambda<br />Next new things about OOP<br />1.different types of constructors and destructors<br />2.Inheritance and Polymorphism<br />3.Generic programming<br />4. STL<br />5. BT and BST algorithm<br />6. Hashing<br />7. some self learning topic like static...",
            "comment_teaching": "Desmond focuses on the logic of each piece of knowledge(in his word, xxx is sth beautiful) and likes to repeat some important points(sometimes in English, Putonghua and Cantonese) and demo important procedures like (&quot;Can we go into the body now? No, we have to first initialize all its data member!&quot;,&nbsp;&nbsp;bst node delete bst tree, node, tree, node,tree....) This teaching style really facilitates my understanding of new stuff. Honestly speaking, although the content in comp2012 is a bit less harder than the pointer part in 2011 when you first learn it, the overall difficulties is much harder than 2011. Although some students with good foundations and talent may find that the speed a little bit low, I first think that if desmond spent less time in saying sth like &quot; do you want to learn sth new please say yes!&quot;, we can speed up our teaching progress and there will be no addition class( I don't really hate addition class but when it is conducted on Fri evening or the day when you have a whole day class it really breaks your mood.), when the difficulties of the content is increasing, it acts as a buffer for you to recall and catch up. The power of brainwashing is so strong and I believe everyone who takes his class will remember some typical lines.Another feature of his class is that he encourages us to response and ask questions in class and it is really beneficial to learn from classmates' questions. Maybe for some students they don't like this kind of hyperbole, but for students who get below mean in 1021 this teaching style really enables us to have a better understanding of new content and builds a good foundation.",
            "comment_grading": "Unlike comp2011 where they require you to think of some algorithms like merge sort, or how to locate the parent of a tree in a short period of time under the condition that you know nothing about algorithm and are unfamiliar with the data structure such as linked list, both midterm and final in comp2012 requires you a full understanding of the content desmond teaches in class and you may find that the exam is much more doable.&nbsp;&nbsp;<br />I guess the grading is not bad because I think desmond is a good guy.<br />Lab(10%):&nbsp;&nbsp;full&nbsp;&nbsp;<br />Assignment(30%) : -0.024, nearly full<br />midterm(20%):&nbsp;&nbsp;mean:63.5, sd:16.5&nbsp;&nbsp;&nbsp;median: 64&nbsp;&nbsp;me: 88<br />final(40%):&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mean:63.78 sd: 16.9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;median: 65 me: 92<br />(the mean and sd is before appealing because an answer <br />of T/F is incorrect and they regrade Q2 so I think the mean would be slightly higher.)<br />grade: A+",
            "comment_workload": "The workload is nearly the same as comp2011(may be slightly heavier because of pa2)<br />The labs are easier than 2011.<br />For pa1, it requires us to think of some algorithms which means the difficulties don't lie in how to write a constructor...<br />For pa2, whether you know where to add a virtual keyword or add public inheritance does no help to the solution. We have to read a lot of .h files to guess what the game rules and how to implement it. Although I know that the intention is good because it is what real life does and I do revere the hard work of the designer who spends a month to design this game, there are still some bugs and umm the clue is a little less and in Chinese, it is sth like 对牛弹琴 because the designer thinks we can understand him but it is obvious that we haven't reached that stage, and finally, this homework turns into a task filling assignment with clear instruction and it loses all its meanings and this assignment becomes totally a failure.<br />For pa3, it is just some basic training of BST and template so it is much easier than the first two assignments and it is really nice when there are lots of ddl approaching final.<br />For exams I do recommend doing past papers because desmond likes to follow the style of the past.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1YY5yF8kosIDsNOP0HKOK20FYieJduid",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DrainGang",
            "date": "Dec 27, 2021",
            "title": "Good required course",
            "comment_content": "Continuation of 2011, not much to comment on, you should learn these anyway since they are very important concepts in programming.<br /><br />Class constructors, destructors, Order of construction/destruction<br />Operator Overloading<br />Abstract Data Type<br />Static member<br />Generic Programming<br />Inheritance (public, protected, private)<br />Polymorphism: Overriding, virtual, ABC<br />Stacks and Queues (again)<br />BST<br />Hash tables",
            "comment_teaching": "Simply excellent, Desmond is the best instructor you can possibly hope to get in a programming course, he gives many examples and constantly asks questions to make sure you understand what he is saying, and even repeats in 3 different languages just so he can explain his ideas more clearly. <br /><br />He also sends a lot of emails out to further explain the concepts. One of the most enthusiastic lecturers I have ever seen in UST.<br /><br />Lab sessions are conducted orderly and swiftly, the TAs do a good job.",
            "comment_grading": "3 Programming assignments (10% each): 3 assignments, each about a different area, (for this semester: class, inheritance and BST), difficulty is acceptable other than assignment 2 where the TA made the assignment far too complex and had to spend about a week reworking the assignment to make it easier.<br /><br />Laboratory exercises (10%): 1 lab per week, finish the code and attend the session, you may be asked a question by the TAs regarding the lab, the questions are mostly easy and TAs are lenient with the score, not difficult to get full marks here.<br /><br />Midterm (20%): True or False questions and short answers, mostly about constructors and destructors. Doing the past papers here is key. <br /><br />Final examination (40%): Same as the midterm, covers the entire course equally, again doing the past papers is key.<br /><br />I got slightly above mean in the midterm, mean in finals, attended all labs and got around 95% in all 3 assignments, ended up with a B, decent grading.",
            "comment_workload": "OK for a 4 credit course.<br /><br />Labs do not take very long to complete and is not too difficult, often its just completing a simple class definition.<br /><br />Assignments are also manageable, however time needs to be spent debugging and making sure you are ready for all of the test cases. In my opinion, 2012 has easier assignments than 2011, since what you need to do is more clear in this course.<br /><br />Exams require you to be very clear on the concepts related to the course, and doing the past papers is extremely important since the questions in the exam are closely related down to the way they are asked. However some questions rely on your programming skills, and no amount of studying and doing past papers can help there.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LzzY8DkFfODHM7Vx03bTcSvOssJkCJmD",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 102,
                    "name": "MAK, Brian Kan Wing",
                    "rating": 1
                },
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nicho",
            "date": "Jun 23, 2021",
            "title": "",
            "comment_content": "1. Intro, review, const-ness, lambda (const-ness is hard)<br />2. Constructors &amp; Destructor (medium)<br />3. Inheritance and Polymorphism (medium)<br />4. Generic Programming\t(medium)<br />5. Standard Template Library (STL) (medium)\t<br />6. Hashing (easy)<br />7. Binary Search Tree (hard)<br />8. rvalue Reference and Move Semantics (hard)",
            "comment_teaching": "Enrolled in Prof. Mak's class at the beginning of the semester but decided to not attend any of his class after the first 2 months, instead, joined Prof. Tsoi class. The reason why I did this is because I think that Prof. Tsoi has a more in-depth explanation. He also gave lots of examples outside the lecture notes so that students can understand more. Furthermore, he sent emails regarding advance details.<br /><br />The zoom links are all given in Canvas so it is quite easy for students to jump from one class to another. Also, all the recording links are given which makes it convenient to revise.",
            "comment_grading": "Grading scheme:<br />Programming assignment - PA1\t10% : 100/100<br />Programming assignment - PA2\t10% : 100/100<br />Programming assignment - PA3\t10% : 100/100<br />Programming assignment - PA4\t10% : 100/100<br />Laboratory exercises\t8% : 22/24 (missed one lab)<br />Midterm\t12% : 66/80<br />Final examination\t40%: 88.5/100<br /><br />Final grade: A+<br /><br />Details:<br />Lab (total 8 labs): Max points: 3, 1 for zinc submission, 1 for attendance, 1 for answering a question during the lab",
            "comment_workload": "The workload of the labs are not really that bad. Only need to fill in the blanks in the skeleton codes that are already provided.<br /><br />For the Programming Assignments, each of them focuses on different topics, and truthfully it is kind of hard. Always need to be diligent to be aware of the minor things because they grade using Zinc with hidden test cases.<br /><br />the midterm was basically a review of 2011 with some additional content such as constructor and destructor.<br /><br />The final exam focuses on the latter part of the course. Mainly STL and BST.<br /><br />Overall, a nice course to start your computer science journey. Once you are done with this class, all the other programming languages that you learn will look more understandable.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "V8tkcFAisEPj2kfYzkssIL96K3DH75Hn",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 1106,
                    "name": "PAPADOPOULOS, Dimitris",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ASmallPotato",
            "date": "Aug 22, 2019",
            "title": "",
            "comment_content": "Review (reference, const);<br />Makefile;<br />Class (constructor, destructor);<br />Inheritance;<br />Generic programming;<br />STL;<br />Namespace;<br />Static method-data;<br />Hashing;<br />Binary search trees;<br />AVL tree;<br />rvalue reference and move semantics",
            "comment_teaching": "Explain concepts clearly;<br />Always make demos to explain difficult parts;<br />Always take revisions after every topic;<br />Always answer questions patiently after lessons",
            "comment_grading": "Quiz 5% (sd 2.57)<br />Midterm 25% (sd 18.36)<br />Final 36% (sd 15.24)<br />PA1\t6%<br />PA2\t9%<br />PA3\t9%<br />Lab exercises 10%",
            "comment_workload": "lab exercises should finished before tutorial (some may take time to digest, usually very easy). After demoed the program, you can leave (sometime need to answer a question regard the topic).<br /><br />PAs should start 1 or 2 weeks before the deadline, much more challenge than labs. It is important to read the documents clearly.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XNiIPvkybTFGEdAqgPB4tusqxEZQV5J5",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 102,
                    "name": "MAK, Brian Kan Wing",
                    "rating": 1
                },
                {
                    "id": 130,
                    "name": "CHAN, Gary Shueng Han",
                    "rating": 1
                },
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cshime",
            "date": "Aug 16, 2018",
            "title": "",
            "comment_content": "Linked course after COMP2011. The course focuses the concepts on both OOP and data structures, which are important if you want to be a developer.<br /><br />Same as Fall 2017 COMP2011, the course starts using C++11 standard, new features are included on course syllabus. Therefore, some contents taught before were cut in this semester due to limited time. Here are the topics covered:<br /><br />1. MakeFile (self-learning)<br />2. Class basics<br />3. Constructors and destructors (important in answering exam question)<br />4. Inheritance<br />5. Generic programming and operator overloading<br />6. Namespace (self-learning)<br />7. Move semantics (C++11 new topic, very important)<br />8. BST<br />9. AVL (self-learning)<br />10. Hashing<br />11. Static members and member functions<br />12. STL (Self-learning, but Desmond held additional class to teach this)<br /><br />So many topics are provided as &quot;self-learning&quot;, it proves that the contents are fruitful and even need to cut much of them.",
            "comment_teaching": "The lecturers of this course are all very good, I can feel their heart in teaching students semantics on C++. They have tried all the methods to elaborate the rich contents in C++11, although they finally need to cut many of them, they really want to teach all of them to student. Credit for Desmond, he held additional class after final exam because he think STL is important.<br /><br />TAs keep the same high-quality performance as COMP2011. They are always available in answering your questions, no matter on Facebook, email, or personally find him.",
            "comment_grading": "Fair grading. A range is not impossible if you really pay efforts studying lecture notes and papers. I think you can have a sure A if you got 85% above in your final grade.<br /><br />Here are grading proportions and some stats in this semester:<br /><br />Assignments (6%, 9%, 9%)<br />Lab Exercises(10%)<br />Midterm(26%), mean 58.9, SD 14.9, max 91.5<br />Final(40%), mean 60.11, SD 17.7, max 95",
            "comment_workload": "Heavy.<br /><br />Weekly lab exercises, monthly PAs, also for challenging midterm (limited time) and final (tricky questions). Some topics are even taught after final exam because of limited time. Many topics + tough exam = high workload...<br /><br />With the fruitful contents this semester, it can be very challenging to master all topics, no matter the topics are for self-learning or not.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VFd1bJB7UFC6fjr6nlfHHFWkjtXISONm",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 102,
                    "name": "MAK, Brian Kan Wing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "anonymousSheep",
            "date": "May 25, 2018",
            "title": "Professor was actually good",
            "comment_content": "Content is structured around the ++ aspect of C++. Unlike COMP2011 where most of the teaching revolves around teaching students the basics of programming, COMP2012 starts getting down into the nitty gritty features and workings of C++.<br /><br />Starting this year, the course curriculum switched from C++98 to C++11. Think about that.... That's 11 years of development experience that programmers used to improve the language. So, you'll get all the fun features that supposedly make life a little easier than when compared to the old revisions of C++/<br /><br />You will learn the following:<br /><br />- Pointers! (Absolutely crucial. If you're unfamiliar with pointers. better be ready before the semester starts)<br />- Classes and Objects (70% of the course revolves around classes and the properties of classes)<br />- Templates<br />- Abstract Data Structures (Linked Lists, Binary Trees, Etc)<br /><br />Mostly a continuation of COMP2011. But rather than teaching you how to use the tools of C++, you'll be learning how to use the tools to create something, like creating a bootleg version of UNO! in the console (Really! It was the second assignment.)<br /><br />I personally liked the course, but it might be a little challenging for some especially if you're weak in pointers and recursion. It's an integral part in this course. If you can't handle it, you can consider dropping the course. But that also generally means dropping your major since I don't think anyone does this course for fun. So don't drop the course and just suck it up.",
            "comment_teaching": "Brian was an excellent teacher. He was always punctual and well prepared for his lectures. He spoke well with clear diction and with an easy to understand accent. He makes frequent use of diagrams overlayed on notes to illustrate examples and content. There are also many places where students get the opportunity to answer questions that promotes learning. It was a shame that I didn't really start paying attention until near the end of the semester. I would 10/10 recommend taking this course with Brian. <br /><br />The TAs were also generally helpful in the labs and would patiently assist us in debugging our programs when stuck. I would say that this course easily has one of the better teaching staff.",
            "comment_grading": "Grading can be a little strict sometimes, especially with regards to the assignments. You can't really know what to expect sometimes. Many times, the assignments will give you 10 test cases that you'll work so hard to get right. But then you get over confident about how your program will perform under scrutiny designed to make your program fail. Mid-term exam was also hard as you'd really really have to understand it well in order to debug other people's mistakes.( One of the questions was to spot errors in code ).<br /><br />Grading distribution is as follows:<br /><br />1. Assignments 1, 2, 3 (6%, 9%, 9%)<br />2. Lab Exercises and Attendance (10%)<br />3. Mid-term Exam (26%)<br />4. Final Exam (40%)",
            "comment_workload": "As with any programming course and even language courses. You can't learn the language just by reading the lecture notes of cramming just before the exam. You have to use it, write it and even dream of it in order to do well on the exams. Therefore, you'll have to spend time every week working on the lab exercises and upcoming assignments. On average, each assignment takes around 6-9 hours of work depending on your experience and effort. Sometimes more if you really want to score well. You'll also spend lots of time tinkering with the Eclipse IDE as it really freaking sucks. I never EVER got it to work properly on my computer at home, so I had to work on the assignments at school. Because if it don't compile on their machines, you be damned. <br /><br />Also, pro tip, install Linux, install Valgrind, and install eclipse or any IDE of your liking (I personally use CLion since it's not dumb like eclipse), that way you can check for memory leaks before you submit your assignment.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DbqqabxV1JcuSJ5i513P9Kb2QX39LhLi",
            "semester": "2012-13 Fall",
            "instructors": [
                {
                    "id": 102,
                    "name": "MAK, Brian Kan Wing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wilson Liu",
            "date": "Aug 25, 2015",
            "title": "Introduction course of computer science",
            "comment_content": "If you have some programming backgrounds, this course is very elementary for you. But if your don't, this course would be the entrance of programming world.",
            "comment_teaching": "The professor is funny and the presentation is well planned.",
            "comment_grading": "If you study hard days before exams you would not score a good grade.<br />This course requires regular study to build a basic knowledge about object oriented programming.",
            "comment_workload": "There are 4 assignments about the same topic. The first one was counting numbers and basic plus and minus calculation. <br />The remaining parts were building a calculator to deal with times. div, mod, big integers and so on. The difficulty increases as you progress the course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LTXDhwKjzucp17l6i2rn6X0xWu8DT2wu",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AP2112",
            "date": "May 31, 2023",
            "title": "Good guy course",
            "comment_content": "OOP, binary search tree and hash map<br />see other<br /><br />https://www.youtube.com/watch?v=BvR1Pgzzr38<br />this youtube channel explain C++ very well, <br />and cover most of the topics",
            "comment_teaching": "Desmond is good guy<br />very interesting lectures<br />Must reg Desmond or sit Desmond lesson<br /><br />Cecia also good, I had her COMP 2211 lesson<br />Also explain things good",
            "comment_grading": "Good course:<br />Final grade: A+<br /><br /><br />Item\tPercentage<br />Programming assignment - PA1\t9%<br />Programming assignment - PA2\t9%<br />Programming assignment - PA3\t9%<br />Laboratory exercises\t10%<br />Midterm examination\t25%<br />Final examination\t38%<br /><br />---<br />&lt;before appeal, so real statistics is higher&gt;<br />Statistics of the Midterm Exam<br />Mean = 59.12<br />Standard deviation = 15.47<br />Median = 60<br />Max = 94.5<br /><br />Statistics of the Final Exam <br />Mean = 59.24 <br />Standard deviation = 14.07 <br />Median = 61.23 <br />Max = 87.75<br />---<br /><br />PA1: 96/100<br />PA2: 100/100<br />PA3: 80/100<br />Lab: total 8 labs, 23/24, forget to go to lab to take attendance<br />MT: 86.75/100<br />Final: 81.4/100<br /><br />So if u forget lab and not full marks in PA, can still A+<br />BTW, if u Desmond session, Desmond will send u email tell u A range<br />Good Guy :D",
            "comment_workload": "3 PA<br />8 lab every week, since this semester, <br />you need go to lab and answer question to get marks<br />remember go lab<br /><br />MT &amp; Final:<br />try to understand wt the lecture notes mean<br />and other syntax things, like <br />[mil, default value, const, final, friend, virtual, override,]<br />each of them, which put at .h file, which put at .cpp file, or .tpp, or all.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FrppeZqeobk94AB1bRAZcC0etaS9ANOF",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "成",
            "date": "Feb 20, 2023",
            "title": "Comp2012",
            "comment_content": "Basic concept of C++ and oop, will review some basic concepts taught in comp2011, so no need to be afraid if you forgot or not familiar with some concepts",
            "comment_teaching": "In Desmond we trust<br /><br />But seriously, though Desmond taught very detail, extra lectures may occupy lots of your time, and he might not be able to taught some imprtant topics such as stl because he spent too much time on previous topics.<br /><br />But still best teaching in UST",
            "comment_grading": "Got a B+, both final and midterm around 70%, most hw fullmarrks.<br /><br />Too many crazy people, hw mean + sd always &gt;= 100, difficult to have good grade",
            "comment_workload": "Fair workload, a bit more than comp2011, not too difficult, will be challenging for some",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "opjtScvYjf3uCRblO393a7z77hWpJqoG",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 102,
                    "name": "MAK, Brian Kan Wing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Shivvorz",
            "date": "Jan 23, 2023",
            "title": "",
            "comment_content": "Starts off with previous knowledge (comp 2011) and starts with classes.<br /><br />The hardest things topics imo are templates (stl), object pointers (how to deal with null pointers/ pointers of an ABS etc), and move semetics",
            "comment_teaching": "Brian just goes over the slides and will supplement it with a bit of demonstration, nothing special.<br /><br />I find myself learning more doing the assignments rather going through the lecture slides. And I wish that there are more practice in for templates (STL) and move semetics",
            "comment_grading": "Got a C but flopped both midterm and finals, if you can get 70%+ on both midterm and finals you should get an b or more easily.<br /><br />Homeworks and assignments are straight forward, you should expect to get full marks in those",
            "comment_workload": "We got 3 assignments in total and 10 labs in total, I would say they are pretty straight forward if you don't mess up and end up having to debug.<br /><br />Each Assignment would take you 3-5 hours in total and a lab would take you &lt;1 hour, they are pretty easy anyways and won't be super hard. (Unless you messed up and have to debug, which would take you a lot of time)<br /><br />You should test your code as soon as possible.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IBSdkMtRi9gwj4RpIWORbJx1EiGsNqWY",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 102,
                    "name": "MAK, Brian Kan Wing",
                    "rating": 1
                },
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Indo Mie",
            "date": "Dec 22, 2022",
            "title": "",
            "comment_content": "1. intro, review, const-ness, lambda<br />2. constructors and destructors<br />3, inheritance and polymorphism<br />4. generic programming<br />5. hashing<br />6. binary search tree<br />7. rvalue reference and move semantics<br />8. standard template library (not tested in final)<br /><br />self- study:<br />-makefile<br />-namespace<br />-static class data/methods<br />-AVL",
            "comment_teaching": "I joined Desmond's class throughout the semester. Personally, I enjoyed his in depth teaching style, but my only problem is it's 9AM class and I'm still half awake. I also see a lot of passion and excitement when he teaches :)). I believe that 2012 is more manageable than 2011 because for some reason the PAs this semester are relatively easy compared to COMP 2011 spring semester hehe.",
            "comment_grading": "Labs: 8 labs total, Got full in all but missed one.<br /><br />PA1: 84.09/100, mean 67.51<br />- Mainly 2011 topics<br /><br />PA2: 100/100, mean 76.72<br />- Inheritance.<br /><br />PA3: 100/100, mean 79.7<br />- BST + a little bit of Hashing<br /><br />Midterm: 89.3/100, mean 63.82<br />Finals: 86.75. mean 51.36<br /><br />Grade: A+<br /><br />Though I receive a good grade, I did hear from Brian that gradig is pretty fierce in this course, i.e. mean - C+ so better do well in exams and gudluck !",
            "comment_workload": "Workload is high cause of labs and PAs, but generally, if you have taken 2011, you should not be surprised.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "i2VMsrBETGvF9ihYnE7uRLI0MwO5JDZ7",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gdhdsv",
            "date": "Dec 26, 2021",
            "title": "",
            "comment_content": "basic c++, class(constructors), inheritance, c++ templates, binary search tree, stl, hash function<br />no avl and move this semester.<br /><br />You need to have a good foundation at comp2011 to get good result in this course.",
            "comment_teaching": "great. He taught interestingly. I think the most important thing I learnt from him is his teaching skill. Like how to make your presentation sounds more engaging.",
            "comment_grading": "fair grading. Neither very good nor bad.<br />final grade: A<br />overall ~91%<br />20% mt: 81.8/100<br />40% final: 88/100<br />both mid-term and final are not hard overall. 80% is guaranteed if you understand concepts well and are careful enough. 20% depends on luck because they are usually tricky questions.<br /><br />10% labs: 23/24 <br />8 labs total. 3 points per lab, 1 for attendance, 1 for finishing lab assignment, 1 for answering question if you need to.<br /><br />10% pa1:100/100<br />10% pa2:98.5/100<br />10% pa3:100/100<br /><br />pa 1 is about basic c++ like pointers and classes. But the tasks are tricky.<br /><br />pa 2 is about inheritance. They would give you many .h and .cpp fils. But you only need to implement 3-4 of them.<br /><br />pa 3 is about bst. Just use recursions.",
            "comment_workload": "Not high.<br />only 8 labs this semester.<br />one of them is a lecture.<br /><br />The time needed to finish the lab or programming assignments varies among different people. <br />If you are very clever, you may only need few hours.<br />If you are normal people, you may need more time.<br />If you are very bad, you may need much more time and still be below mean.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H9zKMLUPl3uIl70drpiVIa3c4t0cRFU9",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 753,
                    "name": "CHAN, Ki Cecia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fhy_priscilla",
            "date": "Aug 23, 2021",
            "title": "Very good professor",
            "comment_content": "C++ foundation+OOP+DS, the outline is the same as 2011+2012, but it goes deeper and more detailed. As a C++ course without algorithms, the algorithms previously learned by the competition students will basically not be used, and the data structure will only learn a more basic part, and new learning OOP (about 50%) is required. In addition, 2012H has one more group project than 2012, which is more difficult to find and has a larger share. It needs to be prepared as soon as possible.",
            "comment_teaching": "The lectures are very detailed, the Q&amp;A after the class is very patient, the emails are answered within seconds, and also often group emails are used to explain some points that are not covered in the class or are not clear enough.",
            "comment_grading": "",
            "comment_workload": "The workload of this course is really big, mainly focused on PA and Project.<br />Most of the group's Group Project will involve learning the basics of Qt to make GUI.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qkOC8evdTIfOatpsLQTWZTqP9HPEezsb",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 102,
                    "name": "MAK, Brian Kan Wing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CEJ",
            "date": "Aug 15, 2021",
            "title": "",
            "comment_content": "1. Intro, review, const-ness, lambda <br />2. Constructors &amp; Destructor<br />3. Inheritance and Polymorphism <br />4. Generic Programming <br />5. Standard Template Library (STL) <br />6. Hashing <br />7. Binary Search Tree <br />8. rvalue Reference and Move Semantics",
            "comment_teaching": "Enrolled in Prof. Mak's and I really enjoyed his pace of teaching. Prof Mak would provide appetizer quizs for us every time before he started his lecures, and he also show examples during classes and was always willing to answer questions no matter you type in the cahtbox or answer is out with your mic on.",
            "comment_grading": "PA1(10%)-98.28/100 <br />PA2(10%)-100/100<br />PA3(10%)-98/100<br />PA4(10%)-100/100<br />Lab(8%)-24/24<br />Midterm(12%)-57.5/80<br />Final(40%)-93/100<br /><br />Final Grade:A+<br /><br />Messed up my midterm exam, but thanks god it worth only 12%.<br />The final exam this time was really easy, one can pass easily with basic understanding with course material and enough practice.",
            "comment_workload": "Both labs and PAs led you to understand basics of each course materials, and for PAs you would need to pay more attentions or you will make small mistakes like me. For both the exams just put more effort to course materials, and remember to do enough exercises or usually you will need to spend more time in coding question during the exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "N17IyGeQVJA54xNKRGik6e7ZRrIfFeJj",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Joshuachung0122",
            "date": "Jan 21, 2021",
            "title": "",
            "comment_content": "The content is quite good. It covers OOP and data structure.&nbsp;&nbsp;Those are useful for the career. Especially the STL is quite common in any C++ project.",
            "comment_teaching": "Desmond is wonderful. The best professor in CSE. He would repeat the important concepts several times to ensure every student understands.",
            "comment_grading": "The Grading is ok. It's curved grading. I got about 1 sd above mean and I got A-. Although the final exam is extremely difficult and time-pressing, others will face the same circumference so it's still fine.",
            "comment_workload": "The workload is a little bit heavy as like comp2011, every week has a lab, and the assignments are quite time-consuming.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ucfL3oMYaVXMqLotjbsoLhlvhLSuWx1Z",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "amyriad",
            "date": "Jan 20, 2021",
            "title": "Victim of Online Learning",
            "comment_content": "Refer to other reviews for details.<br /><br />(Basically STL and OOP concepts)",
            "comment_teaching": "Desmond's teaching is Interesting.<br /><br />Also, he may guide you through many common mistakes that might appear in the exam.<br /><br />He may explain important concepts in different languages (English, Cantonese, Mandarin(, and learning Korean(?)))",
            "comment_grading": "Originally there are mid-term exam and final exam.<br /><br />Due to the sudden change to online learning, the final exam is removed, and the score distribution is changed to an extra assignment and more weighting of previous stuffs. That's what the nightmare happens (specifically for this semester):<br /><br />The midterm exam was not giving enough time for students to finish in normal writing speed. (If you think you have finished half of the pages in 45% of time. you are not suppose to finish it on time before the exam ends), so most students complained that the exam cannot even be finished, this caused the grade less dependent on the course expected outcomes, but rather whether you realised that you need to write extremely fast from the start of the exam. Everything sucked. Many students had reflected this situation to Desmond, and he promised to set the questions better in the final exam. However, fate gave no chance for everyone. There was no exam, meaning no hope for rescue, since basically people can get close to full marks in homeworks and labs, so it became the so-called 一試定生死 (a single exam deciding your fate) and the worse is that this was unexpected. That made you suddenly lose all your passion into the course since you knew it is of no return, and your grade was going to be rotten. You knew this is destiny, and you knew this is unfortune. That's all.",
            "comment_workload": "Need to submit programming assignments using the recently taught structures, also there are labs every week.<br /><br />The lab may be late at night, but once you demonstrate the working result to the TAs, you can leave immediately. (So better choose the seat closest to the TAs to get reviewed earlier)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5QUAtwtcng9POCejBu2VjMu0IwWbVQzW",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hohoWARD",
            "date": "Jan 01, 2021",
            "title": "final compulsory programming course",
            "comment_content": "Topics Covered<br />1.Revision of dynamic data structures<br />2.C++ class basics<br />3.Separate compilation and makefile<br />4.Constructors, destructor, initialization<br />5.Inheritance, polymorphism, and dynamic binding<br />6.Generic programming<br />7.STL: containers, iterators, algorithms<br />8.Namespace<br />9.Static member functions/data<br />10.Hashing<br />11.Binary search trees<br />12.AVL tree<br />13.rvalue reference and move semantics",
            "comment_teaching": "Desmond veryvery good, <br />give a clear example in the lesson, provide a detailed explanation of the program via email/ website.",
            "comment_grading": "Programming assignment - PA1\t10%<br />Programming assignment - PA2\t12%<br />Programming assignment - PA3\t13%<br />Laboratory exercises\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />Quiz\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />Final examination\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;45%<br /><br />All assignment close to full marks<br />Lab full marks<br />Quiz Mean: 17/25 sd: 3.89 me: 15/25<br />Final Mean: 47.73 sd: 15.04 me: 54.25/100<br />Total 73.46/100 <br />Final Grade: B+<br />Grade is reasonable",
            "comment_workload": "Lab is easy, more like a concept check and keep you on progress<br />The assignments are hard for me, I take a few days to complete and debug but rewarding <br />As everyone could get near full marks in lab and assignment, exams are pretty hard. If you don't pay enough time to revise, you would be like me, get below mean in quiz. For final exam, the format is similar to past papers, please revise 3 recent past papers as detail as you can.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "adBs9wgMGPEJUiKpbmnQukkcUKjv4M24",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "上海灘龍虎鬥",
            "date": "Dec 29, 2020",
            "title": "Handsome Desmond God!",
            "comment_content": "- Review: Pointer, Reference and const-ness<br />- Object Initialisation, Construction and Destruction<br />- Inheritance and Polymorphism<br />- Generic Programming<br />- Standard Template Library (STL)<br />- rvalue Reference and Move Semantics (not taught and examined in this semester)<br />- Static Function and Data Member<br />- Binary Search Tree<br />- AVL Tree<br />- Hashing<br /><br />Self-study:<br />- Makefile<br />- NameSpace",
            "comment_teaching": "Desmond's teaching is excellent and superb. You will never feel bored in his lecture. He is very humorous when teaching different kinds of topic, such as order of construction and destruction, pointer, reference and you can easily understand all the concepts behind. His teaching pace maybe a bit slow such that we have three additional class this semester :( but it is absolutely worth to attend all the lectures anyway. You can still refer to lecture video if you are busy or you still have come content that you do not understand.",
            "comment_grading": "Grading is good.<br />Three PAs: Almost full mark<br />Lab: Full Mark<br />Quiz: Slightly above mean<br />Final: Higher than mean 0.8sd<br />Grade: A-",
            "comment_workload": "Compared to 2011, workload of 2012 is much more manageable :-)<br />Labs are easy and just need less than one hour to finish it<br />Three PAs also easier compared to 2011",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VcfpVuuvCGHEj1Tjb33RsIK5MJN57Fqj",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Icez",
            "date": "Sep 08, 2020",
            "title": "",
            "comment_content": "Class and Inheritance (OOP)<br />Pointers and references.<br />Memory Allocation<br />Generic programming<br />Hashing<br />Some search method<br />Move operation<br />Useful language",
            "comment_teaching": "Desmond's teaching is excellent. He explains clearly and may teach some extra knowledge in order to let the students understand the course material thoroughly",
            "comment_grading": "Normal grade but unlike other low level course, don't expect this course can easily get a normal grade without putting effort in it.",
            "comment_workload": "Many labs and assignment so consider this before enrolling into this course.<br />Labs can be finished first before the tutorial class, average time to finish: 1 hour<br />Assignment will take much longer than labs so do it asap",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BqPfDiEEdBcL84eEoFp2USPerJynxnZf",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GodJJ",
            "date": "Aug 16, 2020",
            "title": "",
            "comment_content": "Desmond is a GOD<br /><br />Adequate content for you to learn C++ knowledge, data structure, and practice with OOP.<br />Need more focus on the concept and more practice in coding, but not complicated.",
            "comment_teaching": "Desmond is a GOD<br /><br />His teaching was very fantastic and vivid, which got you into the dramatic world of C++. Also, many lab-time classes and make-up classes for you to enjoy.",
            "comment_grading": "Desmond is a GOD<br /><br />Quiz: Mean: 10.19/15<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Stdev: 2.24<br /><br />Final Exam:&nbsp;&nbsp;Mean: 66.20/100<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Stdev: 19.08<br /><br />Grading Scheme:<br />Programming assignment - PA1 10%<br />Programming assignment - PA2\t12%<br />Programming assignment - PA3\t13%<br />Laboratory exercises\t10%<br />Polling\t10%<br />Quiz\t8%<br />Final examination\t37%",
            "comment_workload": "Desmond is a GOD<br /><br />1 very easy quiz(all MC) in the very beginning of the course.<br /><br />3 PAs are set at a normal level with the helpful skeleton code,&nbsp;&nbsp;if you try your effort on it you will get a full mark.<br /><br />8 simple Labs to practice what you learn in the lesson.<br /><br />30 Polling questions to make you be perfect, counting to the attendance.<br /><br />1 Final to let you know about the reality of this course.<br /><br />Overall, good enough for me to get a B+<br /><br />Last but not least, Why the school teaches OOP with C++ first?<br />Desmond said: So that you can easily learn another programming language after survived from the most difficult one(C++).",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "l8lunpOMyDKWnHSez4GnfwjPltPe1DQ2",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yn",
            "date": "Apr 24, 2020",
            "title": "",
            "comment_content": "This course is fun and you can surely gain more understanding of programming. Moreover, the assignment is long, but you can certainly gain a lot from it. By the way, the lecture section is certainly a must-go.",
            "comment_teaching": "I could not give even better comment for this pro. He is always a &quot;bad guy&quot; but just wait and see how detail and clear explanation he can give. Moreover, he would also provide some live example, that aid our understanding, like the &quot;const&quot; security guard.",
            "comment_grading": "The grade is fair. However, since this term is a bit tough, without the final exam which is changed into one more assignment, the grading become difficult.<br />However, for the midterm, things are detail and test you on detail understanding. So you have to be pretty careful about the details.",
            "comment_workload": "Through the workload is a bit high, but if you are willing to put more time in it, you will enjoy what you learn and understand.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MQflVQkV5zRreQW16wSPN6pgu9pYsV6z",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JIHOO",
            "date": "Oct 03, 2019",
            "title": "",
            "comment_content": "There are more content which is tougher than COMP 2011. It is very detailed, but following the detailed instruction by lecturer, you will finally understand everything.",
            "comment_teaching": "Best lecturer I ever met in UST. Trust him while you take this course.",
            "comment_grading": "Quite fair grade.<br />Full marks in all the labs,<br />Assignment 1 - 95/100<br />Assignment 2 - 90/100<br />Assignment 3 - 90/100<br />0.7 sd above in midterm and 1 sd above in final<br />Got overall A-",
            "comment_workload": "There are some assignments and lab works to do. I spent a lot of time on assignments and labs. Other than this, it took me another long time to understand what is taught in the lecture",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cZpvKHw1aU9Li8mG1Kqn060deqAaIlWS",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "huangchen",
            "date": "Sep 04, 2019",
            "title": "",
            "comment_content": "Very detail oriented course, much harder than COMP2011 but explain a lot of concepts in a better way. Not hard to understand, and even you find it hard, you still have the class video to go to.",
            "comment_teaching": "The best COMP teacher I have ever met in UST. SO cute!",
            "comment_grading": "Fair grade, even did bad in projects, still manage to get an A range. The more time you spend, the better the grade, the exam is harder compared to assignment, usually you cannot finish all the questions during exam time.",
            "comment_workload": "Make me occupied for the whole semester",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2ydtv8if8GrDEAlotVnFGDU5gNa52eTu",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ptrknow",
            "date": "Jun 05, 2019",
            "title": "",
            "comment_content": "If COMP2011 focuses on programming logic, then COMP2012 focuses on the syntactic issues and the behind-the-scenes operations related to OOP. Basic data structures (mainly about binary trees) are also introduced, in the perspective of OOP.<br /><br />I myself do better on programming logic, so I like the data structure part of this course much more than the OOP part. (This in turns means I like 2011 more than 2012.)<br /><br />But of course, the contents are fruitful.<br /><br />P.S. Be sure you don't forget pointers and recursions...",
            "comment_teaching": "",
            "comment_grading": "3 PAs 24% (6 + 9 + 9%)<br />9 Labs 10%<br />Quiz 5%<br />Midterm 25%<br />Final 36%<br /><br />PA2 and PA3 have tricky parts. Better spend more time thinking about (and improving on) your solution so that you would have fewer problems on the actual test cases.<br /><br />Labs are generally easy. One of the labs (which is about STL vector) can be quite challenging.<br /><br />Quiz is conducted in early February, consisting of 19 MCQs testing on pointers, reference and constness. Some of them are really tricky.<br /><br />Midterm and Final are not very difficult, but the mark distribution is quite concentrated around the mean. In this semester there is no T/F question (maybe because of the existence of quiz). I suggest you pay more attention to inheritance and operator overloading.<br /><br />Statistics:<br />Quiz: Mean 13/19, SD 2.5<br />Midterm: Mean 56/100, SD 18.3<br />Final: Mean 69/100, SD 15.2<br /><br />My result:<br />PA: 23.64/24 (fail one test case each in PA2 and PA3)<br />Lab: 10/10<br />Quiz: 13/19 (mean)<br />Midterm: 77/100 (+1.1 SD)<br />Final: 84.5/100 (+1 SD)<br />Grade: A (Overall: ~86/100)<br /><br />Leave you to judge the grading.",
            "comment_workload": "Not very light workload, but acceptable.<br /><br />PAs (especially PA2 and PA3) can be time-consuming if you want to accomplish &quot;perfection&quot;.<br /><br />Labs are generally much easier than those in COMP2011.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "qm254FXMv2B4VttuTuFubzxdsmUTe03J",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Chilam.y",
            "date": "Jan 14, 2019",
            "title": "",
            "comment_content": "inheritance<br />class template<br />function overloading<br />virtual function<br />virtual class<br />function overriding",
            "comment_teaching": "Good instructor with funny tone.<br />interactive teaching.<br />highly recommend to attempt the lecture",
            "comment_grading": "fair grading.<br />if you get mean for the midterm, assignment and final, you can get a B.",
            "comment_workload": "1 lab per week. easy pieces.<br />3 assignment,1 midterm, 1 final.<br />assignment need reasonable time to finish.<br />if you have attempt the leature, It should be easy to answer the midterm and final.<br />However, you may not be able to finish the midterm and final as it takes sometimes to understand the question and analysis for the coding part.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ip05FglYiMNSaCbIt6RWBti75hBbbRgX",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "3301",
            "date": "Jan 02, 2019",
            "title": "Better than 2011 by a country mile",
            "comment_content": "Unlike 2011, this course focuses on the nuances of C++; rendering it more of a &quot;programming&quot; course, than a logic-biased course like 2011. Data Structures (trees onwards) were explained really well, and I don't think I need to add to attestations of other reviews to the quality of Desmond.",
            "comment_teaching": "Desmond. Enough said. <br />Interactive, replies to questions via email at ungodly hours, has a supplementary resources page, the list goes on and on. Video lectures at 2x are a massive help.",
            "comment_grading": "Competitive, but decent.<br />Midterm - 25%<br />PA1 - 7%<br />PA2 - 9%<br />PA3 - 9%<br />Labs - 10%<br />Final - 40%<br />Was an SD or so above mean in all categories and ended up with an A-.",
            "comment_workload": "Not much at all. 3 PAs are somewhat time consuming. <br />PAs require you to read through laborious documentation and complete the implementation of member functions.<br />Pay attention to the PAs, the first two were interlinked and shared several pitfalls. PA3 was tricky but fun to work with. <br />Lab materials were released every week between Friday and Sunday, making it a slog for those impoverished Monday lab-goers, and a breeze for those blissfully ignorant Thursday-slot holders. It takes a special skill to not get 3/3 on the labs, even when questions are asked once every three sessions.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JP7jY4sQRqD5yyDNeHDeG9R6TuGn4r27",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "zhangzruoyan",
            "date": "Dec 21, 2018",
            "title": "Effort pays off",
            "comment_content": "To learn the fundamental concepts and techniques behind object-oriented programming. They include: abstract data types; creation, initialization, and destruction of objects; class hierarchies; polymorphism, inheritance and dynamic binding; generic programming using templates. To learn the object-oriented view of data structures: linked lists, queues, stacks, trees, and algorithms such as searching and hashing algorithms.",
            "comment_teaching": "Desmond is the best instructor ever in ust I have ever met. He is always reachable and rather eager to answer any questions even though they may be repetitive and rather simple. He is used to illustrate some sophisticating concepts by some vivd example.",
            "comment_grading": "7% 1st Programing Assignment <br />9%&nbsp;&nbsp;2nd PA<br />9%&nbsp;&nbsp;3rd&nbsp;&nbsp;PA<br />10%&nbsp;&nbsp;lab<br />25%&nbsp;&nbsp;midterm<br />40%&nbsp;&nbsp;final",
            "comment_workload": "Very fair workload. Be careful of three PA! They take the same percentage of midterm in your final score! <br />Revision will pay off.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lSN2A4L13g8Dgv4mPjJmZaE6BGupiunf",
            "semester": "2012-13 Fall",
            "instructors": [
                {
                    "id": 103,
                    "name": "QUAN, Long",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kyle M",
            "date": "Sep 23, 2018",
            "title": "Easy and good grade",
            "comment_content": "The course is designed for who has taken COMP2011 with C++ background. You will know about data structures (array, queue, stack, heap, tree, hash table) and basic algorithms (sorting, basic worst-case analysis).",
            "comment_teaching": "The ppt is all purple and prof's accent is not good.",
            "comment_grading": "Full mark in all PAs, all Labs, and midterm <br />About 90% final exam<br /><br />A+",
            "comment_workload": "3 assignments and labs every week. The difficulty of the assignments depends on which TA designed. In my semester, they are all straightforward. You should have a good understanding of polymorphism in C++.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xlUZnIAWy0xDrZPQCbyH2QIsdnDwmLfo",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yusless",
            "date": "Sep 10, 2018",
            "title": "Overall a good course",
            "comment_content": "The prerequisite for this course is COMP2011. It expands upon COMP2011 as you delve deeper in the world of OOP and data structures.",
            "comment_teaching": "Desmond is an amazing lecturer. He really goes in-depth with his lectures, making sure to give numerous examples to really make his point. It is a joy to be taught under him, as he explains in a clear and easy-to-understand manner, and he exudes lots of passion for teaching. Best lecturer I've had for COMP courses so far.",
            "comment_grading": "It is really strict in my opinion, as the assignments are given to you beforehand with some test cases, usually 10 of them. In general, these test cases are the bare minimum you need to obtain a passing grade as your program can run. However, your assignment will be marked on more than 10 test cases, making debugging your code and avoiding memory leaks an utmost importance in order to obtain a good grade in the assignments.<br /><br />Labs were more lenient, as the lab assistants usually just look at the console output of your program. However, you may be asked some questions regarding your code or some potential problems if something is added/removed, etc. For those labs, you'll need to complete both the lab program and answer the question for the full mark for the lab part. <br /><br />Mid-term was quite early, so we had to make sure your logic is perfect and you understand the chapters well. Even though there wasn't a lot of content in terms of chapters taught, the depth of the midterms should not be underestimated. Make sure to study hard, preferably as much as possible for the exams and midterms.<br /><br />Grading distribution is as follows:<br /><br />1. Assignments 1, 2, 3 (6%, 9%, 9%)<br />2. Lab Exercises and Attendance (10%)<br />3. Mid-term Exam (26%)<br />4. Final Exam (40%)",
            "comment_workload": "The workload is quite heavy. There are labs for every week. In addition, the assignments need to be perfect in order to obtain a full mark. That means that the student has to spend lots of time debugging the code and make sure it's free of any memory leaks.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pLGZCi6nRAVlA8yTnmfSflEYTlF1EEJB",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 103,
                    "name": "QUAN, Long",
                    "rating": 1
                },
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mandy728",
            "date": "Jan 27, 2018",
            "title": "Good course to improve understanding on C++",
            "comment_content": "In my opinion, 2012 is actually better than 2011 because it really comes into the core and spirit of C++. 2011 only tells you how to use some structure but 2012 teaches why we use such thing such as link list. And it really makes me understand what is the advantage of object-oriented programming.",
            "comment_teaching": "I was in Quan Long's lecture. He is a very good and knowledgeable professor, but sometimes I cannot follow his step... Desmond taught very well and I watched all his lecture video to catch up with the teaching speed.",
            "comment_grading": "Comp course usually doesn't&nbsp;&nbsp;give good grade. But it's acceptable because everyone is skillful and it's very competitive.",
            "comment_workload": "1lab per week, 3 Programming assignment, midterm and final. Workload is a little bit heavy but it really helps you with your programming and the application of knowledge.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "A1q0AxZGdwMAvXQYziW4w6uEAKFKUUdn",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "haoran",
            "date": "Jan 26, 2018",
            "title": "",
            "comment_content": "this course's content also cover the main topics in comp2011, which gives you a comprehensive review ( probably too detailed that it used so much time that the second half of the course was a bit in a hurry) <br />but it do give you the basic ideas about c++ progarmming",
            "comment_teaching": "desmond was really helpful. videos were alse useful to review before the mid and final.",
            "comment_grading": "since it's a compulory course for cs major students. it demond hard working for other major students to get a good grade",
            "comment_workload": "the assignments may takes some time, do them ahead of time then it will be fine",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VMFUZsP0KwyWkMmFyebI2uP6dZ58r83x",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chinchi",
            "date": "Jan 24, 2018",
            "title": "",
            "comment_content": "const<br />constructors, destructors<br />STL<br />generic programming<br />inheritance <br />namespace(out of scope)<br />tress(avl, bst)<br />hashing",
            "comment_teaching": "Desmond is a passionate in teaching.&nbsp;&nbsp;He will use different ways to let you understand the materials.&nbsp;&nbsp;He loves moving around and make jokes to get people's attention.&nbsp;&nbsp;He has a supplementary website that provides FAQ session and practise problems to students.",
            "comment_grading": "Lab 10%<br />assignments 25%<br />midterm 25%<br />final 40%<br /><br />Lab counts attendance as 1 mark and finishing the lab will get another mark<br />assignment mean is around 80%<br />midterm mean is 52% (tricky) <br />final mean is 81.75% (easy) <br />As the mean in final is quite high that you need to work hard on every mark that you can gain if you aim for a good grade.",
            "comment_workload": "Labs are sometimes easy sometimes tricky but you can eventually finish it with the help of TAs. Do it before the lab and you can leave so early by showing them your demo.&nbsp;&nbsp;<br />Workload is slightly tough as you got 3 assignments in every 2.5 weeks.&nbsp;&nbsp;You may get your next assignment just after the submission of the previous one.&nbsp;&nbsp;The last one is quite challenging as it combined all covered materials that requires you to reuse all of it.&nbsp;&nbsp;Prepare and finish earlier.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "A1qsB7VeJ2MZBBl5PoK2HWPkprt9X04G",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "T.S.Chan",
            "date": "Aug 24, 2017",
            "title": "",
            "comment_content": "There are too many content through the cycle, somethings not important but use too many time to talk about it.<br />Around 2/3 lecturers time use to talk about OOP and 1/3 for data structure. Therefore, the time spend on both parts of lectures is inadequate.",
            "comment_teaching": "The instructor is good, we can ask many question before/after the lesson. His lectures are clear enough, and he known the teaching material well.",
            "comment_grading": "Grading is not good enough, no strong programming background will easily get a low grade(C/D range) or even fail.<br /><br />choose fall semester to take this course may be got a better grade than spring semester",
            "comment_workload": "workload is too high, 3 assignments each with 2 weeks to finish.<br />the second/third assignment is about game, it is not difficult but the concept of OOP is used widely in the assignment.<br />One assignment is about data structure, it is the most difficult one, because it combined the concept of OOP and Data structure, but the teaching of data structure part is not clear enough, so it is hard to do this assignment",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hXYgVJAHBRIejbI8vci4S2zB8iqCWBeJ",
            "semester": "2016-17 Spring",
            "instructors": [],
            "is_author": false,
            "author": "好似冇人問我叫咩名",
            "date": "Aug 10, 2017",
            "title": "More or less the same as comp 2011",
            "comment_content": "The content in COMP 2012 is actually easier than COMP 2011 and less memorisation is required in my opinion. Things come to you pretty intuitively.",
            "comment_teaching": "Teaching is not good, i know he tried really hard to make it fun for everyone but it didn't work out. I feel really bad for him as well. <br />I studied this course through reading all the ppt.",
            "comment_grading": "The Grading is normal, all mean you will get a B.<br />Midterm &amp; Final both Above mean, all lab full mark, assignment mean i got A-",
            "comment_workload": "Workload is heavier than 2011, with the last two assignments are being pretty difficult and you need to spend a considerable amount of time on it.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VwIMULD3XGrVdtx9D3eYyVnz6xezWDd9",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "arya",
            "date": "Jul 31, 2017",
            "title": "",
            "comment_content": "Rich Content. Covers everything from stack queues to linked lists and so on.",
            "comment_teaching": "Great teaching, very patient, answers questions well.<br />He likes to explain with paper and goes through each function line-by-line.",
            "comment_grading": "Average, could be better. The average is really high and the standard deviation is small.",
            "comment_workload": "Quite high workload, labs weekly, 3 big projects. The labs cover whatever is taught that week so is easy enough to follow. The TAs are understaff (long wait), so do not expect them to help you during the lab. Just finish everything before going to the labs.<br />But for the three projects, its quite hard to get support and clarifications.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "u0ofaPgpLhXtjRTL7MGIUFTw5NCXjFoc",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "dearmrkris",
            "date": "May 16, 2017",
            "title": "",
            "comment_content": "这门课是Comp2011的延续，前半学期很多内容和2011重合，但是讲的比2011更深入、细致一些。这课难度没有想象中那么大，lab和三个大assignment写的程序都不算太复杂，skeleton code也给的挺详尽的，主要是训练学生如何完成一些大的program成为一名习惯良好的程序猿。不过作为学渣真的是不能相信cwiki上comp课的评价，oop的难度还是在那里的，workload不小，一个sem下来这门课投入的时间最多（当然还是烂龟了hhh）<br /><br />我主要是来推荐instructor的，desmond真的是我见过的最好的cs老师，人特别nice很有耐心。教授上课很注重syntax细节， 重点的地方会重复两三遍，所以上课完全可以理解；课堂上很鼓励学生发言，每堂课都会脑洞大开测试各种syntax error；他自己还会抽休息时间给学生补课pointer/reference之类的，所有lecture都有录video，office hour之内之外都可以去找他，特别supportive &amp;&nbsp;&nbsp;reachable。大家也知道，在这种初阶编程课上，出bug的很多时候不是logic structure而是syntax，所以desmond的讲课方法我觉得还是挺科学的。<br /><br />不知道是不是受instructor影响，这堂课的TA也是普遍非常helpful水平很高，会给一些指导，上lab的时候比2011好多了",
            "comment_teaching": "Desmond is the best professor in cs department.",
            "comment_grading": "moderate..",
            "comment_workload": "Should work hard on labs and assignment.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vGzmThwbglH3LtP1UnOfFnh10LG7EZz9",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 102,
                    "name": "MAK, Brian Kan Wing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anttivii",
            "date": "May 07, 2017",
            "title": "Good instructors, but don't take it by choice",
            "comment_content": "C++. If you are not going to become a software developer and can find a way to avoid the course, do it. So many better languages to learn with your time.",
            "comment_teaching": "Teaching is the only good thing about this course. Mak is an interesting lecturer and does well to make the content appear interesting in theory.",
            "comment_grading": "All exams are in the classic braindead format of writing code by hand on paper with a pen. Having a hard time figuring out how that could be any dumber for a course that teaches programming.<br />Assignment grading is fair, though takes quite a while. We only received marking schemes for 1 of the 3 assignments beforehand.<br />Average is around C I think.",
            "comment_workload": "Assignments are the usual computer science department &quot;fill in the blanks&quot;, usually coupled with code we haven't been taught outside the blanks, which makes the assignments more annoying than anything else.<br />Midterm/finals are quite difficult.<br />Weekly labs require attendance and are easy, but do them before the session.",
            "rating_content": 1,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ud8ezM74O8RgfMowPLxWp8dTgEYpRZa2",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 103,
                    "name": "QUAN, Long",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rilakuma",
            "date": "Jan 23, 2017",
            "title": "",
            "comment_content": "Although parts of the content in this course are closely related to COMP2011, the content is easier. If you are familiar to the basic content of COMP2011, like pointer, it can help you to study this course in a relax way, especially for the data structure parts, like tree. But if you not, you can still work on the new part, like inheritance.",
            "comment_teaching": "The lecture is quite boring. The lecture notes are also not clear, especially for the color tone of the notes. It makes the content unclear.",
            "comment_grading": "The lecturer gives some tips for us before the examination. The tips are VERY useful. The grading is much more related to the marks of assignments.",
            "comment_workload": "1 mid-term exam 25%+1 final exam 40%+3 assignments 25%+lab marks 10%.<br />The assignments are quite difficult and complicated. As it gives a lot of guidelines and restrictions on developing codes, it restricts the creation of students. It will take almost a week to finish the assignment.<br />As usual, lab is necessary and 1 marks for attendance, 1 marks for completion of lab. Some labs are very difficult. You will need to finish the lab before going to the lab session.<br />It is quite normal that you need to spend time on the assignment and the lab task at the same period of time.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4rT9ldin1Hy5WIpvon5HCLZsIK7CgxDL",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "LinkedList",
            "date": "Dec 22, 2016",
            "title": "Be careful for those assignments",
            "comment_content": "Content is inherited from COMP2011,STL,DS that common use such as Stack , BST...",
            "comment_teaching": "I taught by Desmond and he is an excellent teacher,especially he taught concept precisely and clearly.But extra lessons are needed.",
            "comment_grading": "Grade curve is same as COMP2011 especially this semester PA is extremely tricky,and make sd very large,especially PA3 trapped me a lot.<br /><br />I don t think that 2012 is easier (except lab)and&nbsp;&nbsp;better grade than 2011,but their level are similar",
            "comment_workload": "Workload is slightly better than COMP2011 but still high.<br /><br />3 Programming Assignment :&nbsp;&nbsp;<br /><br />PA1 : Matrix (I think is okay but seems tricky)<br />PA2 : Multiset(the management of this assignment is the best among 3 assignments,at least its instruction is clear and easy for implement those test cases.)<br />PA3 : LOL(tricky and easy make people feel confuse,especially the TA 's test case is all input should be correct,otherwise no marks given).Althrough I just pass the base case,i still lose all marks on the other section afterwards and I never learn Python before and TA used python for testing).<br /><br />Lab is much easier than COMP2011.That 's the things that is better.<br /><br />Exam 's difficulity as same as COMP2011.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gIXmyDSsKI6gxvnInJ4IERAlobBjhdVL",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "takecare",
            "date": "Dec 22, 2016",
            "title": "void* const CPPexcellentlecturer = Desmond; // :)",
            "comment_content": "This term is a bit different from previous semesters in the order:<br />1.C++ class basics, <br />2.makefile and const-ness, <br />3.constructors &amp; Destructor,<br />4.generic programming <br />(template, operator overloading, friend function), <br />5.Static Data and Methods<br />6.STL<br />(containers, iterators, and algorithms)<br />7.Namespace, <br />8. inheritance, <br />9. Abstract Data Types (doubly linked list), <br />10.Binary Search Trees<br />11. Hashing, <br />12. AVL trees<br /><br />Desmond goes through all materials in detail, although not all materials are useful.",
            "comment_teaching": "OMG It's Desmond!<br />He is very enthusiastic in teaching the course. People who used to understand VERY LITTLE about programming and computer knowledge can have a great improvement on completion of his teaching.<br /><br />He is humorous and helpful in lessons. His additional materials (C++ FAQs, lecture videos, etc.) really are so handy for guys who do not read textbooks often like me. :P<br /><br />The only slip is that he teaches at a slower speed and you are expected to join many makeup classes. Hence, 學霸 or people who love coding challenges are advised to take COMP2012H instead. (Actually I don't know why people getting A/A+ from prerequisite courses are not automatically branched into honour courses.)",
            "comment_grading": "Programming Assignments\t25%<br />Lab\t10%<br />Mid-term Exam\t25%<br />Final Exam\t40%<br /><br />mid-term stat.: <br />mean 62, SD: 19<br /><br />final stat.:<br /> mean 64, SD: 19<br /><br />Luckily I earn a good grade at a profit of A- of overall 86% (it is much better than COMP2011 which is just B grade, so I have no idea why people say no to take COMP2012 in fall semester.)",
            "comment_workload": "Definitely not as hard as COMP2011. The assignments are not that difficult and the lab tasks are acceptable. To be honest, I think the course should focus more on OOP and data structures as equals since <br />1.C++ class basics, <br />2.makefile and const-ness, <br />3.constructors &amp; Destructor,<br />are supposed to be taught in COMP2011 so that important concepts like multiple inheritance, balanced trees, B trees, union-find data structures should have been included.<br /><br />P.S. Generally grading of COMP2011 will normally be stricter on Fall semesters and grading of COMP2012 will normally be stricter on Spring semesters, especially there are instructors other than Cecia, Desmond and Quan Long...so...plan your study path well. ;)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zWHtPLd2OylCxnlSsBCmiP8kwjCeWjRC",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 131,
                    "name": "QU, Huamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Raymond Lui",
            "date": "Sep 03, 2016",
            "title": "",
            "comment_content": "Focus on fundamental concepts of OOP, e.g. class constructor/destructor, inheritance, polymorphism, abstract data type(= create a data type of your own), template(same code, different return type or class)",
            "comment_teaching": "Quite comprehensive, have some supplementary video tutorial to make us easier to understand the concept.<br /><br />Prof Qu always end the lesson earlier as he teaches so quickly. :)<br />P.S. beginners for programming may find difficult when the teaching pace is fast",
            "comment_grading": "Quite difficult midterm and final if students don't have adequate hands-on practice on writing code.<br /><br />Overall for me, both midterm and final above 1 sd + all assignments done 80~100% --&gt; A",
            "comment_workload": "Light workload for developers because they can complete the assignment within hours.<br /><br />Most important concepts might be combining inheritance and polymorphism with templates.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8RCwG9y11XYe2PLNcG0aEVNSxJSBA57z",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 102,
                    "name": "MAK, Brian Kan Wing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gossipgirl",
            "date": "Jun 10, 2016",
            "title": "",
            "comment_content": "Content is mostly interesting except a few topics here and there. Most difficult topics would be Inheritance and STL.",
            "comment_teaching": "He does teach well, spends time on examples... open to questions for discussion and encourages participation.",
            "comment_grading": "Grading is similar to most COMP courses... Generally slightly better than COMP 2011. Mean would be around B. Mean + sd B+. <br /><br />Mean of the midterm tends to be high (~65) and that of the final is not very low either (~60).",
            "comment_workload": "1 Midterm 25 %<br />1 Final 38 %<br />3 Programming Assignments 24 %<br />1 Written Assignment 3 %<br />10 Labs 10 %<br />High workload... Assignments may not be very challenging but there is quite a bit of code to read...",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iMorScUEj1Rk17IpMBYvPCpERPMPrw2m",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Vivian Lee",
            "date": "Jun 06, 2016",
            "title": "",
            "comment_content": "每課topic 如下<br />C++ class basics, makefile and const-ness, constructors &amp; Destructor, inheritance, generic programming, STL: containers, iterators, and algorithms, Namespace, Static Data and Methods, Abstract Data Types, Hashing, Algorithm Analysis, Binary Search Tree",
            "comment_teaching": "Desmond 很有教育熱情，很受其他學生喜歡。<br />我不太適合這風格，上他課只是因為時間表。<br />他教得較慢，會review COMP2011，會講笑話，而且用廣東話跟普通話重覆。上他的課請有心理準備會有不少額外補課。<br />他還額外建了自己的course website，當中的FAQ很有用。",
            "comment_grading": "Programming Assignments\t24%<br />Written Assignment\t3%<br />Lab\t10%<br />Mid-term Exam\t25%<br />Final Exam\t38%<br />mid-term mean 67<br />final mean 62<br />我overall 89% A+",
            "comment_workload": "今年的3份PA都較容易。<br />assignment只要是Kevin出的就會較難，提早開始做。<br />PA2額外有個GUI design比賽，自行選擇參不參加。還頗有趣的，我的final的較遲，所以在revision week玩了一下，還頗有趣的，但輸了，我的審美實在不太行吧...",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rnKBRphrajDltRc9wiy6j0s7hQsVGA4n",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 103,
                    "name": "QUAN, Long",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SVM",
            "date": "Jan 27, 2016",
            "title": "The difficult elder brother of COMP2011",
            "comment_content": "Let me say that in spite of having studied C++ for 3 years now (started in high school), the content of this course has rather difficult for me, so I can only imagine how the non-CSE students or beginners would find it. Some of the topics are Vectors, Templates, STL, recursion etc. So yeah, take the course knowing that the journey won't be smooth.",
            "comment_teaching": "Professor Quan Long is really zealous and full of energy, which is a good thing. On the other hand, he tends to spend too much time on the simple easy basics and then rush through the complicated stuff later.",
            "comment_grading": "Typical CSE grading curve. Distributed over final, midterm, assignments, and weekly labs.",
            "comment_workload": "Assignments require effort, but are released well in advance, which makes it easier.",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TFDMcgCQFhkqjTGnqu1VRQU369hqR9W8",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 103,
                    "name": "QUAN, Long",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Aloha",
            "date": "Aug 26, 2015",
            "title": "一命二運三風水四積陰德五讀書六名七相八敬神九交貴人十養生",
            "comment_content": "COMP2011 嘅延續 一開始會溫返2011嘅野 之後就講Object, class, operator overloading, inheritance, polymorphism, generic programming, standard template library, sorting algorithm, binary tree, etc...<br />難度唔算太高",
            "comment_teaching": "lecture: instructor 英文發音有點性感 不過上堂有啲悶 教得又有啲慢 所以上咗兩堂就冇再上 自學好似有效率得多<br />lab: 講得唔錯 不過睇佢啲description 有效率得多",
            "comment_grading": "10%*3 assignment<br />10% lab<br />25% midterm<br />35% final<br />筆者lab assignment 全full mark midterm&amp;final 各above 1.2sd 最後好似拎A",
            "comment_workload": "lab: 好易做 <br />PA: 一個字: 煩&nbsp;&nbsp;要哂唔少時間去debug 但難度唔算太高 唔需要過分嘅思考<br />midterm: 淺 但佢居然考sorting 咁就中咗伏 (唔同past paper which is冇考)<br />final: 同midterm難度相近 但寫嘅code好煩",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3FZeHCDvb0w4O4wy2iES2dN1E85KqoO5",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Alan Lai",
            "date": "Sep 07, 2022",
            "title": "Best Professor best course",
            "comment_content": "Based on my understanding, the structure of CPP can categorize into more than six parts. Type, Function, Objects, Inheritance, Operator overloading, Template(STL), etc. Each abstracts the language features into a fundamental concept (not necessary) for all Object Oriented languages. In COMP 2011, you are supposed to have a solid understanding of Type, Function, and Struct. In Comp 2012, you will learn the rest of them.<br /><br />Some syntax<br />int array[5];<br />int const* const* p = new int*;<br />int (*arrPtr) [5] = &amp;array;<br />int (&amp;arrRef) [5] = array;<br />int* (&amp;ptrsRef) [10] = ptrs;<br />int (*fptr) (int, double) = function;<br />int (*const fpArr[]) (int, int) = {f1, f2, f3};<br />int (*fptr) (int) = [] (int x) -&gt; int {};<br />int (* func(int))[10];",
            "comment_teaching": "Suppose you are interested in the CPP language itself. Then, I strongly recommend the book &quot;C++ Primer,&quot; which elaborates on more features and detailed explanations. After this book, Effective CPP by Scott Meyers should be your best choice, which gives you suggestions on how to write clear and compelling codes. Finally, if I remember correctly, there is also an exprimental course in UST for those interested in Compiler, Comp 4901N Principles of Programming Languages. Sadly I haven't taken this course yet. So I don't know the details.",
            "comment_grading": "19/21 Labs<br />100/100 Ass1<br />98/100 Ass2<br />100/100 Ass3<br />82.5/100 Mid<br />80/100 final<br />88/100 Overall<br />Final Grade A<br /><br />I have a friend who got 87 overall and was only A- in the final grading. If you want a good grade, full marks in assignments and labs are necessary.",
            "comment_workload": "Labs were simple. If you find them difficult, review the Comp 2011 or read the website learncpp.com immediately.<br /><br />Each assignment takes me about 6 hours to code and a few more hours to debug. Don't wait until the last minute. The grading system will be slow hours before the deadline.<br /><br />Exams require you a lot of effort to practice. Unfortunately, I didn't have enough time for the past papers. Maybe that's why I had a bit low scores on exams.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "G7zsYcSFRkvBO6M8YrHZ1fxySyi1Qv2X",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "ZHANG,Hao",
            "date": "Jan 24, 2021",
            "title": "",
            "comment_content": "The main content is the OOP of C++.<br />Knowledge of class, Polymorphism, template, STL, BST is taught in this course.",
            "comment_teaching": "Desmond is very very nice!<br />He is very patient.",
            "comment_grading": "Very good<br />the mean is already B+<br /><br />There is no midterm this semester. But there is a small quiz (counting 10% of the final grade)<br /><br />The final exam is a little bit difficult.",
            "comment_workload": "not too much. need to finish a Lab every week. I think the lab only takes maybe 1~2 hours. And there are 3 assignments this semester. Roughly every semester will take 6~8 hours (depending on personal ability).",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "U7rsthaGFHn21rFnqeoNggKlF39w2IJS",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TommyWong",
            "date": "Aug 31, 2020",
            "title": "",
            "comment_content": "Review on pointers and references.<br />Class and Inheritance<br />Constructor and Destructor<br />Generic programming<br />Hashing<br />AVL and BST<br />Move operation",
            "comment_teaching": "Desmond is a good lecture. He will design a lot of extra learning material and explain the concept clearly to student. Lot of fun during the lecture",
            "comment_grading": "Fair grade. <br />Full Mark on 3 Assignments<br />1 sd higher on Midterm and final. Overall A-",
            "comment_workload": "3 Individual Assignment. Well designed to clear the concept.<br />1 Assignment is using about pointer and references.<br />2 Assignment is using about OOP such as Class, Inheritance, Constructor and Destructor<br />3 Assignment is using about Data structure such as AVL, BST<br />Remember to check the memory leakage to prevent penalty mark.<br /><br />Midterm all MC question. Online Final exam just like the past paper.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lsj71v31D3NjIpr1EVMgOZLIFEMVdMW2",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MIYANO",
            "date": "Jun 17, 2019",
            "title": "Desmond is so good",
            "comment_content": "Topics covered:<br />C++ Class Basics<br />Separate compilation and makefile (self-study) -&gt;lab， pa1<br />Constructors, destructor, initialization<br />Inheritance, polymorphism, and dynamic binding<br />Generic programming<br />STL: containers, iterators, algorithms<br />Namespace (self-study) -&gt;final<br />Static method/data (self-study) -&gt;final<br />Hashing<br />Binary search trees<br />AVL tree<br />rvalue reference and move semantics<br /><br />I love the last topic. It is really interesting and makes many things clear.<br />Have to mention that lecture notes are super good.",
            "comment_teaching": "Desmond is much better than A. I would give him SSS if possible. <br /><br />He assumes you have no foundation when teaching you. It was really helpful since I forgot everything about pointer after winter break.<br /><br />I could understand what he said in class and never got sleepy even though it was my third class in the morning. This is not the case for any other course.",
            "comment_grading": "Programming assignments - PA1\t6%<br />Programming assignments - PA2\t9% (a game about class)<br />Programming assignments - PA3\t9% (about hashing and tree)<br />Laboratory exercises\t10%<br />Quiz&nbsp;&nbsp;5%(19)&nbsp;&nbsp;&nbsp;&nbsp;Mean: 13.09&nbsp;&nbsp;&nbsp;Stdev: 2.57<br />Midterm examination&nbsp;&nbsp;&nbsp;&nbsp;25%&nbsp;&nbsp;&nbsp;Mean: 56.4&nbsp;&nbsp;Stdev: 18.36 (before paper checking)<br />Final examination\t36%&nbsp;&nbsp;&nbsp;&nbsp;Mean: 69.34&nbsp;&nbsp;&nbsp;Stdev: 15.24 (before paper checking)",
            "comment_workload": "PA2 and PA3 require some efforts. Cannot figure out how to start them at first and second glance especially pa2.<br /><br />Past paper and lecture notes are extremely important for midterm and final. Questions are similar every year. Start reviewing midterm early and do all the past papers...",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IzKYaQUt8Qs8QiekucpRNo7UNAPtsExN",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 103,
                    "name": "QUAN, Long",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "別問我是誰",
            "date": "Aug 07, 2015",
            "title": "COMP2011 進階版",
            "comment_content": "大多數人 fall 讀完 2011 spring 先會讀 2012，但我比一般人早左個sem讀<br /><br />呢個course係 COMP2011 既延續，教番d C++ 獨有 syntax 既 topics, e.g. class, generic, string, vector，去到後期再深入d 教埋 OOP 既 inheritance, polymorphism。<br /><br />assessment 方面 3 PA + Lab (計1分attendance) + MT + Final",
            "comment_teaching": "",
            "comment_grading": "9 個 labs 只係網上 submit 所以無左3分1 attendance 分<br />3 PA 都 full marks<br />MT 75/100<br />Final 79/100<br />印象中2次exams都係 above mean ~0.6-0.7 SD<br />最後得 B+",
            "comment_workload": "lab 要上齊 (如果唔係好似我咁扣分)，PA 難度同 2011 個d差唔多",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "G5R4xJczjtgfhVXp9ek7f6oETcqxVUmq",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YumeSekai",
            "date": "Apr 04, 2023",
            "title": "Desmond God. TA CHAN, Namkiu worst.",
            "comment_content": "Undoubtedly, the topic can be quite challenging and daunting, particularly for individuals who may not have a strong foundation or extensive experience with pointers, which are a crucial aspect of many programming languages and can require a thorough understanding of memory management and data manipulation.",
            "comment_teaching": "Desmond god. But the lectures notes skipped too much thing so you should prepare your own notes.<br /><br /><br />CHAN, Namkiu &lt;-------WROST TA EVER!!!!<br />WROST TA EVER!!!!!!!!!!!! DO NOT TAKE HIS LAB.<br /><br />NG, Chak Sang &lt;----- Good UG TA",
            "comment_grading": "Average",
            "comment_workload": "Students who enroll in this course can expect to face a significant workload throughout the semester, which may include a multitude of labs, programming assignments, as well as midterms and a final exam, that require diligent time management, strong organizational skills, and the ability to balance competing demands and priorities in a fast-paced and rigorous academic environment.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vGjN75K0EMDZVXTrtgMqPDxG3qcj7bZH",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "想當年",
            "date": "Jan 10, 2021",
            "title": "【I don’t have time to finish writing it now, modify later】",
            "comment_content": "【modify later】",
            "comment_teaching": "【modify later】",
            "comment_grading": "****************************************<br />I'm thinking whether I should rate A or B here.<br />****************************************<br />statistics:<br />PA1 (10%) <br />mean 88.6 , SD 21.1 (for submitted works only)<br />PA2 (12%)<br />mean 72.7 (out of 90) , SD is 23.8 (for submitted works only)<br />PA3 (13%)<br />(sorry, I forget)<br />online quiz (10%)<br />mean 17, SD 3.89 (out of 25)<br />online final exam (45%)<br />mean ~ 48 , SD ~ 15 (out of 100)<br />____________________________<br />my grade:<br />programming assignment , lab (45%) : full<br />online quiz (midterm) (10%) : 23/25<br />online final exam (45%) : 65.75/100<br />grade = A",
            "comment_workload": "amazing！Desmond，辛苦了！<br /><br />Regular lessons : 25 lessons<br />有一日係假期，唔使問都知要補返 : make-up class = 2 hours<br />Dr Desmond Tsoi 教唔切，要額外上多 3 x 2.5 hours<br />【Conclusion: There are 32 lessons this semester】<br /><br />Dr Desmond Tsoi 好好，有optional嘅 COMP2011 review class，幫你溫返pointer及reference<br />2 x 2 hours<br />他又俾埋交唔切嘅rvalue reference，共2堂時間<br />【Conclusion: If you attend all these, in total the time spent is around 37 regular lessons (with each lesson 80 mins)】",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ijy6rr4IWuwxtwhFSdf7o4QsQc3VbvRx",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ogt",
            "date": "Dec 29, 2020",
            "title": "Great course!",
            "comment_content": "Content is as specified in the other reviews. <br />Useful stuff &amp; good programming practice!<br /><br />Also quite fun in my opinion as I enjoy programming in C++.",
            "comment_teaching": "Very good teaching. Desmond is a very caring professor and knows the content of the course very well. Undoubtedly the best professor I have at UST so far!",
            "comment_grading": "Personally, I thought the grading was good but then I am probably biased by my grade.<br /><br />Quiz: slightly above mean<br />Assignments: almost full<br />Labs: full<br /><br />Final (important): 2sd above mean<br />Mean: 47.73<br />Stdev: 15.04<br />Max: 87.50<br />Me: 81.25<br /><br />The good grade is due to 2 things:<br />- Previous programming experience before this course<br />- Doing the past papers -&gt; do them!<br /><br />=&gt; A+",
            "comment_workload": "Manageable.<br />The assignments can take a day of work to do (especially PA2 &amp; PA3) but Desmond releases them 2-3 weeks before the deadline, giving you plenty of time to organize yourself.<br /><br />Additionally, they used an automatic grader (ZINC) which was great as it allowed you to make sure your code fulfilled the test cases provided.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dD1yMnITvxzyLakUvr8R3bMz8buRHRJV",
            "semester": "2016-17 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Piler",
            "date": "Aug 14, 2017",
            "title": "Acceptable grade and teaching",
            "comment_content": "C++ class<br />inheritence<br />stl<br />static<br />namespace<br />generic programming",
            "comment_teaching": "Clear but slow teaching flow",
            "comment_grading": "Acceptable grade",
            "comment_workload": "There are total 3 programming assignmnt to submit. First two programming assignment are easy but need more time to do. However, the 3rd programming assignment have not enough time to do. Also, TA are very rush for the programming assignment3. They seem to be very rush for the programming assignment. More, the deadline is very close to the releasing day and the progarming assignment is more different. There is no enough time to finish the pa3.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LZjXBWwObuS0f4b9PvXWRQK3iqRz4dvY",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 102,
                    "name": "MAK, Brian Kan Wing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "anotherone",
            "date": "Aug 15, 2015",
            "title": "Spring Sem workload較重過Fall version,要讀慎選",
            "comment_content": "2011延續版<br />Brian第一次教呢個course<br />你2011後Part唔熟建議唔好今個sem讀<br />佢cut走哂2011既review,mid-term前教哂OOP既野,後半part教基本既data structure,後part唔會教得深,3711會再教其他data structure.內容都算密,的確要花時間跟進度先可以有靚grade",
            "comment_teaching": "Brian教得好仔細,對C++算熟<br />佢教書唔算有趣,感覺佢好嚴肅咁,但佢教OOP concept教得幾易明<br />鍾意人問問題,跟佢會學到野<br />有片錄可走",
            "comment_grading": "Scheme:<br />PA x3&nbsp;&nbsp;24%<br />WA x1 6%<br />Lab x9 10%<br />Mid-Term 25% Final 35%<br /><br /><br />Grade fair<br />Stat:<br />Mid-Term 60/100 sd 18/100 Final mean 60/100 sd 20/100<br />總分過80應該都比較大機會A Range,事關Mid-Term過80既人唔多,final冇出histogram,但估計同mid-term差多",
            "comment_workload": "PA2,PA3要chur<br />唔好諗住Assignment dead前幾日先好做,code量唔少同埋唔係咁易做.<br />有一份WA<br />Lab同2011一樣要上,做得哂Full,但做唔哂有上Lab既都有一半分,但大把人好快做得哂",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "i8leyPFqKQ9cOXDcEfwq8tqqItn1LI4w",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "clementnkh",
            "date": "Jan 22, 2017",
            "title": "Good Lecturer in this course",
            "comment_content": "Content is inherited from COMP2011and some data structure, like the linked list , BST tree and hashing...&nbsp;&nbsp;and some concept about the run time like calculating the big o notation... This would be a requirement to most of the comp course. If you have a good basic programming background, you can handle this course easily.",
            "comment_teaching": "Lecturer Desmond Tsoi would example the details about the course material and he will answer the questions that you ask. The lecturer would take videos in every lessons so that you can have a look before the exam. This would be very helpful if you need to listen to the lesson again.",
            "comment_grading": "Most likely the assignment would get a close mark and the mid term and final exam would be the point to separate the students. Mean would be around B-. Final would be harder than the mid term exam. If I do not remember wrongly, the mean of mid term is around 6X marks and final would be slightly slower than this marks. If you study hard before the mid term and final exam, the grade would be good because the content would mostly cover the part in the lecture.",
            "comment_workload": "This course got 4 assignments (3 programming assignment and 1 writing assignment),1 mid term and 1final exam . Different term would have different topics but the writing assignment would be similar to previous year. You may find some example in the website. The assignment only need to do some parts and TA would provide a good structure program for you so the tyou can follow the program easily and the assignment would give you 2 weeks to do it.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dy5JGvzxTaIAtKyainW0rPq7EOf5q3h5",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Colman_Cheuk",
            "date": "Jan 26, 2022",
            "title": "",
            "comment_content": "This is an advanced C++ programming course, talking about the details of OOP and data structures of c++. <br />1.different types of constructors and destructors<br />2.Inheritance and Polymorphism<br />3.Generic programming<br />4. STL<br />5. BT and BST algorithm<br />6. Hashing<br />7. some self learning topic like static...",
            "comment_teaching": "Desmond taught very well, he is passionate about teaching and he is able to explain boring and complicated topics well and interesting. Although I cannot get a good grade in this course, indeed learned a lot from him. He kindly gave us a lot of make-up classes including re-teaching the content of COMP2011 which helps me to pick up everything before learning COMP2012.",
            "comment_grading": "Lab(10%):&nbsp;&nbsp;almost full<br />Assignment(30%) : 1 sd below mean<br />midterm(20%):&nbsp;&nbsp;mean:63.5, sd:16.5&nbsp;&nbsp;&nbsp;median: 64&nbsp;&nbsp;me: 53<br />final(40%):&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mean:63.78 sd: 16.9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;median: 65 me: 60<br />Finally C+",
            "comment_workload": "3 programming assignments.<br />Assignment can be challenging, time management is important. Due to a lot of workloads of other courses, I did not have enough time to finish the last assignment which affect my grade a lot.<br />lab assignment per week, it is not challenging, 30mins to 2 hours can finish every lab task.<br />mid term and exam",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZgHm9eRjGskjQmhHvRuXMDo44HQCMY10",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 846,
                    "name": "TSOI, Yau Chat",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "无极剑圣jk",
            "date": "Feb 12, 2019",
            "title": "",
            "comment_content": "content is full and usefull i like it. and the assignment is funny. although the bugs can make people crazy",
            "comment_teaching": "professor TSOI is really a good teacher. he reply the email very fast and i think he gives me lots of useful advice.",
            "comment_grading": "grading is fair. i'm not doing well in the midterm and the third assignment so i only get a a-. but i think every one can do a better job to get a better grade since all the material are very clean",
            "comment_workload": "the work load is a little bit high we have 3 big assignment each one takes me around 5hours. and also every week we have a lab and i usually do it before the class. it takes me 1 to 2 hour",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XdDTFu8CQ5GzAMZ6TtUJCtGfkXIjKJcN",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "aismailov",
            "date": "Mar 24, 2017",
            "title": "",
            "comment_content": "content of this course is something you can study in one day, but this uni extended one day studying in two courses named 2011 and 2012. and these two courses only teach you basics, all knowledge is almost unpractical dont expect yourself to be able to write gui, game, or website",
            "comment_teaching": "slow paced yeah pace is slow better to do 2012H at once",
            "comment_grading": "got A+ i dont know how it is graded but seems it is easy to get somthing around A",
            "comment_workload": "light there were some homeworks but most of them were easy",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 13,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}