{
    "error": false,
    "course": {
        "id": 3914,
        "subject": "CORE",
        "code": "1501",
        "name": "Introduction to Language",
        "description": "An examination of fundamental concepts and principles in the scientific analysis of human language, especially concerning speech sounds, syntax, meaning, language acquisition, language processing, sociolinguistics and history of languages. Students who have taken an introductory course in linguistics in universities should not enroll in this course.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230
        ],
        "prerequisites": "a passing letter grade in <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1401\" href=\"/review/CORE1401\" target=\"_blank\">CORE 1401</a> OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1402\" href=\"/review/CORE1402\" target=\"_blank\">CORE 1402</a> OR CORE 1403 OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1404\" href=\"/review/CORE1404\" target=\"_blank\">CORE 1404</a> OR LANG 1002 (prior to 2022-23)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 4,
        "rating_grading": 5,
        "rating_workload": 5,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1502,
                "name": "QIN, Zhen",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "qpqIa9KRd01WNboaPszJRI39EHhAwvqP",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1502,
                    "name": "QIN, Zhen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "高海千歌",
            "date": "Jun 02, 2023",
            "title": "Straightforward CC course (Note: Same as HUMA1010)",
            "comment_content": "(IMPORTANT REMINDER: This course is same as HUMA1010 in terms of everything aside from the course code. However, I put the comment at here as well in case someone search this course at this page. If you want to take this course to fulfill CC requirement, YOU SHOULD REG CORE1501 AS YOUR COURSE CODE, NOT HUMA1010. If you want to find more comments about this course, visit HUMA1010 page)<br /><br />1. Introduction<br />2. Brain and Language<br />3. Phonetics<br />4. Phonology<br />5. Morphology<br />6. Syntax<br />7. Semantics<br />8. Language acquisition<br /><br />Although the title is Introduction to &quot;Language&quot;, it is not that &quot;Language&quot; you think. This course is actually introduction to linguistics. Instead of focusing on the proficiency of language like those LANG courses, this course focus on the analytical approach of how language is produced and formed. This includes the sound (phonetics), patterns (phonology), structure (syntax),&nbsp;&nbsp;meanings (semantics) etc. <br /><br />It looks like the current syllabus focus more on practical analytical skills rather than cramming everything into your brain and ask you to recite. The coverage is better than in the past. You will learn several problem-solving skills to analyze the characteristics and features in different datasets regarding different languages (not only English). Some languages are very interesting and probably most of us have not heard about them before. <br /><br />In my opinion, most contents are not difficult to handle, and they are actually quite interesting. The only challenging part is phonetics. One of the most important tool for this part as well as the whole course is International Phonetic Alphabet (IPA), which maps the every sound to a symbol. I would say this is the most challenging part of this course due to the inconsistencies between pronunciation and spelling. You also need to remember the pronunciation of each IPA symbol and try to assemble them to form the correct pronunciation of the given words. Moreover, phonetics is probably the most important topics in this course because it has a quite connections to other topics. Therefore, you may need to put more effort in this part.<br /><br />If you are struggled on IPA, I recommend you to watch this channel. It's pretty good and help me a lot. Also, try to follow it and speak out loudly. You will have a better idea.<br />https://www.youtube.com/watch?v=7mahmMmnSx4&amp;list=PLOZUTLsJbEAjW-Z9Bou0fPvPs8zdF79pJ<br /><br />For other parts, the content is easy to handle and the problem solving techniques are monotonous and straightforward. No matter what language he gives to you, even you are given Mars language, the problem-solving techniques are universally available. Prof. will provide examples to demonstrate the problem solving techniques. After that, you just need to keep mechanically replicating them in the assignment and exam. It is not hard to follow.<br /><br />Last thing, the prof put some emphasis on the textbook and often ask us to read the textbook chapters. However, I think it is not really necessary. The lecture content has covered what you need for the assignment and exam so just don't waste money&nbsp;&nbsp;and time if you are not really interested in the topic...",
            "comment_teaching": "Decent<br /><br />Prof. Qin is a nice guy. His voice is quite soft but has an appropriate tone and pace. He can explain the content quite well as well. Therefore, I don't really feel bored during the lecture.<br /><br />Prof. Qin cares a lot about class attendance and engagement. Therefore, he will not publish lecture notes until the lecture ends and he will not publish the recordings until the end of the semester (Unless you have justifiable reason then he will provide you the recording of your missed lecture). Therefore, please take his lectures seriously. You cannot skip too many classes otherwise you will miss a lot of thing (attendance, in-class quiz, as well as learning progress)<br /><br />One reminder, he likes to ask students to answer his questions or share thoughts. If there are no one raising the hand, he will either actively invites you or call your names out (He has a name list). This does not count towards attendance and he won't punish you even if you answer wrong or don't know the answer. However, if you don't want to be embarrassed, pay attention to the class. I notice that he likes to pick the student who are seen not concentrated or talking during the class.",
            "comment_grading": "Grading scheme<br />1. Attendance (10%)<br />2. Assignment (x5) (30%)<br />3. In-class quiz (x10) (30%)<br />4. Final exam (30%)<br /><br />My score<br />1. Attendance: 10/10<br />2. Assignment: 30/30<br />3. In-class quiz: 30/30<br />4. Final exam: 27/30<br />(Mean: 23.41 Median: 24 UQ: 25.5 LQ: 21.63)<br /><br />Total: 97/100<br />Final Grade: A+<br /><br />Pretty unexpected. I thought I need a perfect game for A+. Really touching that I can get my first (and probably last) A+ in this university. The mean is somewhat slightly below my expectation as well (Expected final mean will be over 25/30)<br /><br />This course is not difficult to manipulate if you pay enough attention in the lecture because the prof have provided clear examples for solving the problems that will appear in the assignment and exam. The only thing you need to do is mechanically replicate them in the assignment and exam. You don't need high IQ or huge effort for good result. Therefore, try to put more effort in this course and score high because of the high cost-effectiveness.<br /><br />(Probably the only thing that you need extra practice is phonetics (IPA) but it is not a big problem to have extra practice on this as you can find English words everywhere right? If you are able to translate one of my paragraphs into IPA symbols smoothly then you are more than good enough ^ ^ )<br /><br />However, please pay extra carefulness on every assessments (assignment, quiz, exam) as the content is really easy and the mean is very high. Everyone score very similar marks in quiz and assignments (Over half of the class get full marks). Therefore, careless mistakes costs a lot in this course. If you look at the score, the ratio of the assessment score to the total score is 1:1. That is, if you lose 1 mark in the assignment, you lose 1 mark for the total score. If you are not careful enough, you will easily get unsatisfactory results.",
            "comment_workload": "Very light, unless you have zero willingness to go to lecture<br /><br />1. Attendance<br />Just go to the lecture, sign your names and you can get the full credit. It is that simple, isn't it? At least it doesn't requires you to answer questions or say anything in the class to earn the credit.<br /><br />2. Assignments<br />Five assignments in total. However, they are very short and straightforward. You only need one hour or even half hour to finish them. The questions just test the problem-solving techniques that are being taught in the class in a very straightforward way. Therefore, if you pay attention to the class then it will be fine.<br /><br />3. In-class quiz<br />There are 10 in-class quizzes which will appear randomly throughout the semester. The prof will not tell you which class has quiz. You will only know when that lecture starts. Therefore, go to lecture for attendance and quiz.<br /><br />The quiz will have 3 concept-checking MC questions to test you the content of that class. They are straightforward and for testing whether you are daydreaming during the lecture only.<br /><br />The quiz is open-book (At least from what I known from prof is open-notes as I just look at my jotted notes for answer). However, the prof will NOT publish the lecture notes of that lecture before the quiz. Therefore, you need to jot notes by yourself if you need to refer to the lecture content during the quiz. Please pay attention to the lecture. <br /><br />4. Final exam<br />Very straightforward close-book exam. It is just a combined version of all the assignments. The question format are very similar but only the content changed. The exam time limit is 3 hours but people start leaving 1 hour after the exam started.<br /><br />Therefore, please make sure you know how to do every assignment questions before the exam. If you do the assignment by yourself, you should have no problem on the exam as well. <br /><br />The score for other assessments are very similar among students so probably the final exam determines your fate in this course. Good luck.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}