{
    "error": false,
    "course": {
        "id": 3919,
        "subject": "CORE",
        "code": "1660",
        "name": "Exploration of Drawing",
        "description": "Drawing is a foundational form of communication extending from prehistoric times to the work of modern-day artists and designers. The creative use of lines, shapes, and textures is both a form of expression and a tool to sharpen one’s thinking and message. In this course, students will explore various types of techniques, mediums, styles, and materials, and learn concepts and history relevant to the fine arts and related industry.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230
        ],
        "prerequisites": "a passing letter grade in <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1401\" href=\"/review/CORE1401\" target=\"_blank\">CORE 1401</a> OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1402\" href=\"/review/CORE1402\" target=\"_blank\">CORE 1402</a> OR CORE 1403 OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1404\" href=\"/review/CORE1404\" target=\"_blank\">CORE 1404</a> OR LANG 1002 (prior to 2022-23)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3,
        "rating_teaching": 1,
        "rating_grading": 4,
        "rating_workload": 5,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1733,
                "name": "CHU, Shun",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "FlcXHmskubces2aVrljv9LBxvRGsu5Q6",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1733,
                    "name": "CHU, Shun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "isdn好玩",
            "date": "Jun 10, 2023",
            "title": "Not sure if it is a beginner-friendly course",
            "comment_content": "In the lecture(2hr per week), the instructor has some ppt to show some basic techniques and the history of drawing. Sometimes he showed some masterpieces of art. <br /><br />In the tutorials(1hr per week), you will need to bring painting props to get ready to paint. In the first few weeks, we were all sketching, and after the midterm exam, we started to paint watercolors.<br /><br />There were chances to go out of the campus to sketch/paint. e.g. We went to Chinese University to sketch, we also visited a museum to appreciate artworks.",
            "comment_teaching": "To be honest, my impression of this teacher is very poor. He often speaks ambiguously, and I don't know what he wants to express. I feel that students need to learn mind-reading skills to understand what he is thinking.<br /><br />Although this teacher claims to welcome students to ask him questions, he behaves impatiently and disrespectfully when students actually ask him questions. For example, after listening to his description of the course, I didn't understand some parts, so I asked him. But he was very impatient and asked if I hadn't been listening to him.<br /><br />He also likes to randomly call on students to answer questions in class. One problem is that he thinks he knows the students well, but he often calls out the wrong names, which is embarrassing. <br /><br />When classmates go out to present their artwork, he often asks us to evaluate each other in public, which is awkward and time-consuming. He also likes to call on students he knows to answer questions, so I often see a few students answering questions many times, and I feel sorry for them.<br /><br />The most embarrassing thing is that this teacher makes jokes that are not appropriate for certain students. He seems to have no idea what respect is.<br /><br />This teacher often switches between Chinese and English when speaking, and there are many non-locals in this course who may not understand, which causes them a lot of trouble.<br /><br />Furthermore, I'm not sure if this teacher can actually draw. He has only shown his artwork once, and I don't know if he was serious, but his artwork doesn't look very professional, so I started to question his teaching ability.<br /><br />He doesn't actually “teach” in class, and the PPT doesn't have much content. He also talks a lot of nonsense. And you know what? He actually plays drawing tutorials from YouTube as if he's teaching us. I think to myself, why don't I just watch the tutorial videos on YouTube myself? Why do I have to come back every Wednesday to watch him play YouTube videos?<br /><br />Sometimes this teacher can give students appropriate advice. <br /><br />But once, a student used blue as the main color in their artwork and painted a temple (as I remember). This teacher criticized the student because he thought that when painting a temple, you should respect its original color scheme, so he thought that the student shouldn't use blue in the painting. <br />In my opinion, this is very ridiculous. Artistic creation should be free, and if every artist has to paint according to what he says, then there will be no innovative creations in this world. Moreover, from my ten years of experience in painting, that student painted very well, and he combined blue with the temple environment harmoniously. I feel really sorry for that student, and I hope he won't be limited by this teacher's perception of his talent.<br /><br />To that student, if you are reading this text right now, I want to tell you that you draw very well, don't be influenced by that tutor!<br /><br />Although you may be a little disappointed by now, I would like to add a comment on the TA.&nbsp;&nbsp;The TA is very good! There is no harm without comparison!!! When the instructor makes a mistake, the TA can always come out immediately to remind him, and her attitude is also very good. She can be regarded as the supervisor of this tutor XD<br /><br />Since I felt that this teacher had problems from the beginning, I tried to keep a low profile in class. I didn't actively ask him questions and tried not to be remembered by him. Maybe this is the skill to survive in this course.<br /><br />Actually, maybe this teacher has no bad intent (I hope), he may just want to care for us in his own way, but I don't really like his way. He may just not know how to get along with students. I believe that some students can get along with him, but not me. Anyway, maybe my evaluation of him is very subjective, and you still need to actually get along with him to know what kind of person he is.",
            "comment_grading": "Attendance Course participation (10%)<br />Mid-term assignment (30%)<br />Final Presentation (40%)<br />Learning portfolio (20%)<br /><br />I want to clarify that I think my grade is not a reliable reference because I have been learning to draw since Primary school, and I have accumulated a lot of experience in drawing, which makes my artwork look good. That's why I received an A grade in this course. However, I am not sure about the grades of other students.",
            "comment_workload": "Actually, I think it depends on your drawing experience. If you are a beginner, you may need to spend more time and effort to get a better grade. Personally, I don't think the workload of this course is heavy, considering that the suggested number of pages for the learning portfolio is just two A4 pages per week. The mid-term and final presentations also only require a total of two A3-sized drawings (one sketch and one watercolor).<br /><br />If you have sufficient drawing experience, you can come here to relax.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}