{
    "error": false,
    "course": {
        "id": 3755,
        "subject": "CORE",
        "code": "1404",
        "name": "Advanced Academic English for University Studies",
        "description": "This course puts a strong emphasis on developing university-level academic literacy and communication competence in writing, speaking, and multimodal contexts. The course introduces students to research skills using university library resources for finding and evaluating sources for academic writing and speaking tasks. It expects students to be critical readers and writers, synthesizing ideas when developing a coherent argument. The course also aims to develop students’ competence in communicating effectively in an academic community, developing the ability to collaborate both as a member of a group and assuming responsibility as a discussion facilitator in the context of student-led seminars. Throughout the course, students are expected to transfer and adapt their knowledge, attitudes and habits for autonomous lifelong learning.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210
        ],
        "prerequisites": "Level 5* or above in HKDSE English Language OR Overall bandscore of 7.0 or above in IELTS OR equivalence of the above",
        "corequisites": "",
        "exclusions": "LANG 1002, LANG 1003",
        "rating_content": 3.11,
        "rating_teaching": 4.04,
        "rating_grading": 2.67,
        "rating_workload": 2.56,
        "review_count": 27,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 411,
                "name": "MEGAN, Melissa Jane",
                "count": 3
            },
            {
                "id": 1720,
                "name": "ZYCHOWICZ, Piotr",
                "count": 3
            },
            {
                "id": 1231,
                "name": "SAMPSON, Nicholas",
                "count": 2
            },
            {
                "id": 1722,
                "name": "STAMPER, Suzan",
                "count": 2
            },
            {
                "id": 1710,
                "name": "ZHOU, Siyang",
                "count": 1
            },
            {
                "id": 1716,
                "name": "KOYLU, Yilmaz",
                "count": 1
            },
            {
                "id": 1719,
                "name": "MUDDEMAN, Gary",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "znzGPlvyzhpKtCuTpTj5ajuzIp9WbVO8",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1722,
                    "name": "STAMPER, Suzan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "adqqqqqqqqm",
            "date": "Jun 10, 2023",
            "title": "☠️ CGA graveyard ☠️",
            "comment_content": "A lot of nothing in this course.<br /><br />I mean if you got here you are already proficient in English. The few things you would learn are how to use library resources to find academic sources and how to cite properly, but that’s about it.<br /><br />But that doesn’t mean you can skip all the lectures. The class is small and the lecturer WILL notice your absence. Even though attendance technically doesn’t count towards your final grade, let’s not pretend there aren't impression marks at play here. I did not skip a single class intentionally, neither did any of the other students in my session.",
            "comment_teaching": "I will give credit where credit’s due. Suzan is actually very nice and friendly. Her lessons aren’t boring even though the lesson material is. But that’s the only saving grace of this godforsaken, abysmal course. Why. The. Fuck. Do. I. Have. To. Take. English. Still.",
            "comment_grading": "Frankly, the grading is very good! 🥹 sUper lenient marking! 💯💯 objective grading! 😎 crystal-Clear rubrics! 🔮 unambiguous score system! 🙆‍♂️ timely feedbacK! ⏰⏰ accurately assesses Your english abilities! 🔍🔍 last but not least, suzan gives veeeeeery gOod grades! 🅰️🅰️🅰️ absolutely amazing coUrse! ✔️✔️✔️ Hahaahahahahahahahahahaahahahaha kms<br /><br />Annotated Bibliography 15%<br />Synthesis Paper for Seminar 5%<br />Seminar 20%<br />E-Magazine (Individual) 20%<br />E-Magazine (Group) 15%<br />Self-Reflection x 3: 15% Total<br />Self-Directed Learning: 10%",
            "comment_workload": "Workload doesn’t exist for the first half of the semester but get ready for hell after midterms. You only need to do the annotated bibliography and one self reflection before midterms, and everything else is after midterms. But who the fuck cares hahahahahaa enjoy suffering hahahahaha enjoy writing, presenting, researching for the entire second half of the semester AND still get B range at most hahahaHaHAHAHAA",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 8,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "S35yGiMqEkRInKf0KsCmANZSbA35WRPw",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Hi ( 0_0 )",
            "date": "Dec 30, 2022",
            "title": "Fuck CORE1404, all my homies hate CORE1404",
            "comment_content": "Lesson content is fine but assignment content is NOT. They have zero alignment in difficulty(and content too, actually). Chill in lesons then go to hell when doing assignments afterwards.",
            "comment_teaching": "Lessons are quite fun but they don't prepare you for the assignments like, AT ALL. We were barely taught how to write the annotated bibiliography(accounting for 15% of the final grade and hard to write af). Our instructor Suzan gave us a sample so I, like the model student I am, followed the format. Ended up getting feedback that my format was wrong.",
            "comment_grading": "As an advanced/honours course, the grading of this course is shit. With supremely difficult assignments and tremendous workload (especially when compared to the difficulty of CORE1401 and CORE1402), most of us are getting a B or below. Not to mention that these people are all hardworking af English geniuses who have either attained a 7.0 above IELTS score or a level 5* or above DSE English result. Most of my classmates communicate like native English speakers, produce superb fancy writing, and were trained in international schools under the IB system. These people are getting Bs or even Cs. Bruh.",
            "comment_workload": "Annotated bibliography: Find and read 3 peer-reviewed scholarly articles(an average of 20+ pages each) related to your topic. Write 1000+ words.<br />Self-reflections x4: Another 1000+ words in total.<br />Student-led seminar: Conduct research on your topic (same as the AB). 5 minutes individual presentation and 5 minutes(?) discussion. Actually decent compared to the other assignment lol but you still have to write a synthesis paper before it.<br />E-magazine: Another 1000+ words and research but even magazine design and cooperation with teammates is required now.<br /><br />Conclusion: be prepared to write and research A LOT and still get a shit grade. If you are confident in your English and want to take this course as a grade booster(like me), let me tell you that I am no longer confident in my English after this god damn stupid course(types furiously-",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 10,
            "vote_count": 12,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "r0PVdW2qPJMjZYn3yWqSr4FSUMbVtZyh",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1720,
                    "name": "ZYCHOWICZ, Piotr",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "I_LOVE_UST",
            "date": "Jun 22, 2023",
            "title": "Just run... COMP1021, MATH1014, PHYS1112, CHEM1020 seems good grade after this...",
            "comment_content": "Week 1. Course introduction, Classmates introduction, multimodality<br />Week 2. Academic communication, rhetorical planning wheel, Summary and synthesis (Form seminar groups)<br />Week 3. Choose a topic, evaluate sources, and Library workshop<br />Week 4. Lateral reading, Argumentation<br />Week 5. Text analysis, Citing &amp; Referencing<br />Week 6. Audience awareness, Discussion roles<br />Week 7. Sample seminar, Multimodal communication<br />Week 8. Seminar consultations, Writing a synthesis paper<br />Week 9-11. Seminar + Discussion (4 groups of 18 people)<br />Week 12-13. E-magazine submission and exhibition<br /><br />As an extrovert and a talkative person, I like group work nature and seminar presentations very much. (FYI: I'm from SENG)<br /><br />If you intend to do UROP or postgraduate study, the content actually makes decent sense.<br /><br />Besides, you can write a multimodal magazine to your CV.<br /><br />Yet, excluding the above, there's a lot of small talk as part of the curriculum, and many new things that take effort to learn. Some buddies of mine with &gt;4 GPA agreed with my point.",
            "comment_teaching": "Piotr is an easygoing, professional instructor that replies to emails promptly to his abilities.<br /><br />Likes to keep the vibe cool and friendly.<br /><br />Even did lessons consultations in Passion restaurant.<br /><br />I would give an A here.",
            "comment_grading": "The course grading makes MATH and PHYS courses seem exceptional and lenient, CORE1404 is downright criminal. <br /><br />For short, CLE grades the sessions discretely, not weighted across the entire cohort, which is partially understandable due to the logistics. Yet, certainly not within the singular session consisting of 20 people, the sampling size is unreasonable for grading participants. Let's say my class is entirely exceptional or downright terrible, it would be difficult to get 1~2 SD above the mean. Even so, if the class performance is holistically terrible, let's say all get DSE 5* + IELTS 7.0. If I was decently performant, it is rational to say that expected English class performance would be objectively worse than a class averaged at DSE 5** + IELTS 8.0/9.0. Yet the student in the former class would likely receive an A and the latter class be graded a B.&nbsp;&nbsp;<br /><br /><br />I got okay marks in DSE writing (20/21) &amp; IELTS (8.0/9.0).<br /><br /><br />With a sub-total of 85-90% in the CLE grading system, yet still got awarded a B+, whereas other classes had the lower 70s and received a solid A, which many of my classmates in other sessions would argue their work had an objectively lower quality. Both in terms of content + language use + organization and the design + layout + effort (Seminars &amp; E-Magazine).<br /><br /><br />The professor and our classmates personally appreciate the group of me and my group to a significant extent.<br /><br /><br />Yet the grading scheme from CLE is hilariously atrocious, nothing wrong with the professor, he's a nice and likeable teacher.",
            "comment_workload": "The number of hours needed to make good and outstanding work is insane, if you are used to spending little time just before the exam, the workload easily feels like a 6-10 credit course. <br /><br />No exaggeration, I took MATH + PHYS + CHEM courses concurrently within the same semester, getting As here and there...<br /><br />Inquired a couple of dozen seniors before CORE courses are introduced, that this supersedes all of the previous LANG courses that have ever existed. This is another animal relative to CORE 1403A &amp; CORE 1403.<br /><br />The &quot;E&quot; speaks volumes.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BiO1fAkFraXE78SFA88jCORSvLTcmBlS",
            "semester": "2022-23 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Atom",
            "date": "Jun 08, 2023",
            "title": "Badly designed course (it's not the instructors' problems, but the course design itself)",
            "comment_content": "Basically some stuff for academic writing (tone, audience, etc.) and speaking, emphasizing multimodal communication. However, there is little content taught but huge workload (see workload section).",
            "comment_teaching": "Course instructor is nice and friendly, answers questions and explains content in a clear way. Lessons are quite interactive and relaxing. However, the other parts of the course is just too bad that I would not give an A.",
            "comment_grading": "Very unclear grading standards<br />- Each project stage is graded using 5 levels: Emerging, Satisfactory, Competent, Advanced, Exceptional<br />- There are some rubrics describing the requirements, but are general and unclear<br />Very bad grades<br />- An equivalent of 83.5/100 yields me a B???",
            "comment_workload": "All work done in groups of 4-5, with a common research topic<br />Annotated bibliography<br />- Each person finds 3 academic sources (there will be a library workshop about it) and summarize + comment on them (~300 words per source)<br />- Introduction (~100 words)<br />Synthesis paper<br />- Come up with own arguments using supporting evidence from the sources you found (~300 words)<br />Student-led seminar<br />- Individual presentation (~5-6 mins) on your part of the topic (related to your synthesis paper) with a group PPT<br />- Discussion with class after presentation about your topic<br />Multimodal e-magazine<br />- Each person write around 1000 words based on the sources and the seminar (including the discussion), with some magazine formatting (group work)<br /><br />Self-reflections (~300 words if written, ~2-3 mins if spoken)<br />- Some questions are provided to guide you<br />- One reflection each project stage<br /><br />Finding good sources and extracting useful information is painful, and finding only 3 sources is almost impossible for presenting in the seminar (except for very long sources like books with a few hundred pages which take weeks to read through). Definitely not 3-credit course workload.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gC4k3B3BVgtlUU68bZI04WzqH1EHCM8v",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1710,
                    "name": "ZHOU, Siyang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "correctiontape",
            "date": "Aug 02, 2023",
            "title": "Proceed with caution",
            "comment_content": "As mentioned in most posts, I'm not gonna babble about it.<br />The content learnt in this course was mostly useful for most professional fields, those who are interested in communication will find this course more helpful.",
            "comment_teaching": "10/10 recommended<br />Prof. Zhou was extremely supportive and caring to my class. She made sure classes were suited to the students and gave great feedback to our work.<br /><br />Make sure you actively participate in class and respect her <br /><br />***Whether you are forced to take this course or for your own studies, Yolanda will be a great teacher to your learning!***<br /><br />For real tho",
            "comment_grading": "Sadly, I must admit the grading was not only competitive but also vague.<br />I am not sure how the grading system works, but getting in the A range would be extremely challenging even for excellent english users<br /><br />*Even with an overall band score of 8 and 5** in English, I have only managed to score a B letter grade.*<br /><br />Tips: <br />-Pay attention to the small details of the assignments and try not to make any careless mistakes in your assignments<br />-Participation mark is obviously important as you will have a small class<br />-Yes. a small class means you will be competing with everyone in your class for an A<br />-Even scoring above average in your assignments does not gurantee an A grade, it might come down to how &quot;strong&quot; your classmates are<br />My classmates were very competitive, thus resulting in a fair grade :( <br /><br />Goodluck!",
            "comment_workload": "Quite decent<br />I had 2 annotated bibliography, some presentations and an E-mag presentation.<br /><br />Just make sure your groupmates are not &quot;free-riders&quot; and plan out your work throughly. (to get a good grade, it is best to spend lots of effort and time to your presentations!!!)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eaIqU9LfUKE7Gc9mb6wRn54DqhOXZGr6",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1722,
                    "name": "STAMPER, Suzan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Biff",
            "date": "Jul 17, 2023",
            "title": "Be very careful with references",
            "comment_content": "Mainly referencing, and some common-sense ideas like audience awareness and different types of arguments.<br /><br />Admittedly, the things I learnt about finding sources and referencing were useful. In this regard, CORE 1404 is much stricter than CORE 1403, but it does teach you more. Knowing how to use sources correctly will help you in essay assignments in other courses in the future.",
            "comment_teaching": "Is... alright la. No comment, see the other reviews for Suzan.<br /><br />A lot of discussion time.",
            "comment_grading": "Does anyone understand how Suzan grades her assignments? Nope, not at all.<br /><br />Got scared shitless with all the &quot;competent&quot; grades I got. Suzan is also very slow with giving feedback for assignments.<br /><br />The best thing to do to increase your chances of doing well is to make sure you do your references correctly. This will be a major thing she's going to pay attention to. Every minute detail must have a source that backs it up. For your seminar, you must include it in your powerpoint slides.<br /><br />DSE grade: 5**<br />Average grade for assignments/projects: Competent/Advanced<br />Final grade: A<br />The result is good but I had to put in way too much work into the assignments and projects. I was lucky, others were not.",
            "comment_workload": "Typical for a language course. The major assignments are three annotated bibliographies (summary + review of an academic paper, one is ungraded), a five minute seminar, and an e-magazine (some basic designing + 1000 words, but you can mostly reuse content from your seminar)<br /><br />Bearable if you don't have a lot of projects for the semester, hell if you're a business student.<br /><br />Advice:<br />- Do some preliminary research into what sources are available to you before dedicating yourself to a topic. If you choose a very niche topic, you may end up using more time browsing for suitable sources rather than actually analysing them<br /><br />- This goes without saying, but pray to god that you have good group mates<br /><br />- Don't underestimate the self-reflection assignments",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6CUL7yM7ee0x6jMSC2xnM9cpCQ0TzWL4",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1720,
                    "name": "ZYCHOWICZ, Piotr",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "dos0_282",
            "date": "Jul 03, 2023",
            "title": "",
            "comment_content": "The content itself is perfectly fine imo. Even if you are already super proficient in English, you could still learn the citation skills from the course.",
            "comment_teaching": "Credits to Piotr. He is one of the best lecturers I have met in UST. Hands down. Super chill lectures throughout the semester. Go reg him if you are so unlucky that you are forced to reg CORE1404.",
            "comment_grading": "Fuck this. I got 4 exceptionals in the 3 main tasks and I still got a B at the end. My score is around 80% and I still got a fucking B. Those sitting at the CLE should really go fuck themselves",
            "comment_workload": "As long as you put some hard work in finding the sources then you are good to go.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EFJVAsmJLfpQkT5YSFKc01llNZ1TKyhN",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1720,
                    "name": "ZYCHOWICZ, Piotr",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Karthik",
            "date": "Jun 29, 2023",
            "title": "Questionable Grading",
            "comment_content": "This course is designed for students who are proficient in English. It gives you a glimpse into academia by teaching you how to cite sources and research academic sources.<br /><br />Content is not that hard or difficult to understand but assignments are extremely difficult with tremendous workload.",
            "comment_teaching": "Professor is very nice and chill and explains the content pretty well. He is very friendly and understanding of the hectic nature of the assignments.",
            "comment_grading": "Absolute horrific grading. You are required to complete most of your tasks throughout the semester with the help of a team you would create at the start. Personally my team and I had performed reasonably well throughout with constant questioning to the teacher where we fell short and where we can improve.<br />We put large amounts of time into every assignment and our professor was always impressed with our work.<br /><br />But at the end we only received a B+ when we were expecting much better. At the same time those who had performed questionably worse than us in other lectures received better letter grades. No transparency to grading whatsoever.<br /><br />Annotated Bibliography 15%<br />Synthesis Paper for Seminar 5%<br />Seminar 20%<br />E-Magazine (Individual) 20%<br />E-Magazine (Group) 15%<br />Self-Reflection x 3: 15% Total<br />Self-Directed Learning: 10%",
            "comment_workload": "Extremely heavy workload. Sometimes my team and I had to spend more time on this course than others like Math and Phy. Loads of assignments almost every other week.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Uc5rubj9HAxPZ4MyY7hYqWOATb3HIlRA",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "i_dun_know",
            "date": "Dec 03, 2022",
            "title": "RUN!! DON'T take this course",
            "comment_content": "This course is mainly teaching the research method and some presentation skills. The skills are useful in the future research, but some important skills which will be assessed such as annotated bibliography, synthesis paper, apa citation etc were not taught in this course. <br /><br />The presentation held on week 9-11, 4 people 1 group, each lesson will only present 1 group.&nbsp;&nbsp;Each member in the group are required to have 5 minutes presentation to their topic. After the presentation, will have discussion time. Each member has to lead the discussion related to the topic(s) that they have presented. The discussion time depends on how many presenters had presented before discussion.",
            "comment_teaching": "Lecturer: STAMPER, Suzan<br />The lesson are chill.",
            "comment_grading": "Annotated Bibliography (Individual) 15% <br /><br />Student-led Seminar and Synthesis Paper (Individual) 25% (5% + 20%) <br /><br />Project - Multi-modal Electronic Magazine (Individual and group) 35%  (20% + 15%) <br /><br />Self-reflection  (Individual) 15% (5%+5%+5%) <br />Each reflection can be either an essay with 200-300 words OR <br />a 2-3 mins video. For me, I choose to take video for all the self-reflections<br /><br />Self-directed Learning, including library workshop (Individual) 10% <br /><br />Honestly speaking, I have no idea what I have wrote and every assignments I submitted were just pass the minimum word limit. <br />Final grade: B+",
            "comment_workload": "The workload depends on when you do the presentation. If you were the first group to do the presentation, the workload will be extremely high, you will only have about or less than 1 week after you get the feedback of your Annotated Bibliography. <br /><br />As Suzan is a deadline fighter, the samples of the Annotated Bibliography and Synthesis Paper will only release about a week before the submission deadline.",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "cCAYaD6XciL2IvjdQt2d26EoVqZHOwga",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1716,
                    "name": "KOYLU, Yilmaz",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mangobalabah",
            "date": "Aug 21, 2023",
            "title": "NICE COURSE I LIKE IT",
            "comment_content": "content is pretty much useless, learnt nothing. all in your projects and your work. THOUGH the group discussions were interesting.",
            "comment_teaching": "He is very chill and funny, but very detailed and strict with his own system of email and font and style. make sure to respond and join the group discussion in class so that you can enjoy a chill vibe in class. otherwise, you would find it boring.",
            "comment_grading": "Grading is good as long as you meet his need. Group mates are important too, as the whole course is graded heavily based on what you bring out together during and at the end of the sem.",
            "comment_workload": "workload is skewed depending on your topic. though i would say that it quite heavy in general.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GpJnnjAVj2JDIIX8mkv3bF7WG5VC6ZbV",
            "semester": "2022-23 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Enwjddl03",
            "date": "Aug 21, 2023",
            "title": "",
            "comment_content": "Week 1: Course and classmates introduction, Multimodality, Academic communication, Rhetorical Planning Wheel<br />Week 2: Summaries and synthesis, Form seminar groups and choose topics <br />Week 3: Library workshop, Lateral reading <br />Week 4: Argumentation, Text analysis <br />Week 5: Citing and referencing, Audience awareness <br />Week 6: Discussion roles, Seminar practice<br />Week 7: Multimodal communication<br />Week 8: Writing a synthesis, group consultations<br />Week 9: Group consultations, Group seminar <br />Week 10 - 11: Group seminar<br />Week 12: Consultations on E-magazine<br />Week 13: Group Exhibitions<br /><br />Mainly covers basic referencing and APA rules.",
            "comment_teaching": "The instructor was nice and gave feedback on time so that I could reflect on my future assignments.",
            "comment_grading": "Annotated Bibliography - 15%<br /><br />Student-led Seminar and Synthesis Paper - 25% <br /><br />Project - Multi-modal Electronic Magazine&nbsp;&nbsp;- 35%<br /><br />Self-reflection&nbsp;&nbsp;- 15%<br /><br />Self-directed Learning, including library workshop&nbsp;&nbsp;&nbsp;- 10%<br /><br />*Each assignment has clear rubrics to follow. Adhering to the guidelines will ensure a decent grade.",
            "comment_workload": "Workload is decent, as there are no finals and midterm assessments. (AB Entries, Self-reflections, Synthesis paper, E-magazine, Oral presentation)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7wuC7TujhmBy7thwNRLu3aZ4UMjy9E5L",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1231,
                    "name": "SAMPSON, Nicholas",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "BWOAH",
            "date": "Aug 04, 2023",
            "title": "",
            "comment_content": "Schedule<br />Week 1. Course introduction, Classmates introduction, multimodality<br />Week 2. Academic communication, rhetorical planning wheel, Summary and synthesis (Form seminar groups)<br />Week 3. Choose topic, evaluate sources, Library workshop<br />Week 4. Lateral reading, Argumentation<br />Week 5. Text analysis, Citing &amp; Referencing<br />Week 6. Audience awareness, Discussion roles<br />Week 7. Sample seminar, Multimodal communication<br />Week 8. Seminar consultations, Writing synthesis paper<br />Week 9-11. Seminar + Discussion (5 groups, so 5 classes).<br />Week 12-13. E-magazine submission and sharing",
            "comment_teaching": "Nicholas is very friendly and keen to share his expansive music collection with everyone in the session. So if you are a classic rock music lover you're definitely going to have something to talk about. However, he tends to procrastinate when grading assignments and giving them out at the last minute possible. Sometimes you need to email him and push him a little (with respect).",
            "comment_grading": "10% Self-directed learning: Library workshop and academic journal report<br />15% Annotated bibliography<br />15% Self-reflections (5% each)<br />5% Synthesis Paper<br />20% Seminar presentation<br />20% E-magazine (Individual submission)<br />15% E-magazine (Group coherency)<br />Graded not by points but by levels from EXCEPTIONAL to ENTERING.<br />No attendance taken, but I believe the impression takes a minor part in the grading scheme.<br />The grading of 1404 is a bit harsh, but I believe Nicholas is one of the instructors with rather lenient grading and I did get a satisfactory outcome with an overall grade of Advanced/Exceptional.",
            "comment_workload": "In the beginning, nothing to worry about. But as the term goes on and the group projects are revealed, it could become a great burden, especially during the midterm and the finals.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wRUJPjP5Yxeg0h8UxJVkcLTB3ySV7fpN",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 411,
                    "name": "MEGAN, Melissa Jane",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "APKB",
            "date": "Jun 19, 2023",
            "title": "Taught and Learnt Nothing from the course",
            "comment_content": "Emmmm, actually I do not know what was going on. Every lecture, we only asked to discuss some boring thing, or homework.",
            "comment_teaching": "She could spot out your weaknesses in your work, but then? Not kind to students either.",
            "comment_grading": "It depends on your instructor, some are lenient but some are harsh. Melissa is the harsh one and she only gives high mark to the people she likes. If you are those who are not liked, your GPA is end. <br /><br />p.s., English DSE 5**.",
            "comment_workload": "Melissa is crazy, there are pre-work and post-work after every lecture. Also, some common work like e-magazines, seminar, and annotated bibliography takes you thousands hours to read through millions webpages and articles. But luckily, no exam.",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YTbLAJxIfQYDAuPRaujNX1EMcL9NyCv3",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1231,
                    "name": "SAMPSON, Nicholas",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "professorwok",
            "date": "Jun 09, 2023",
            "title": "Badly designed course but good and friendly professor",
            "comment_content": "Horrible. You literally learn nothing as everything is self-explanatory. If you can swap to CORE 1403, DO IT!!! The only thing useful is the academic citation and referencing.<br /><br />Schedule<br />Week 1. Course introduction, Classmates introduction, multimodality<br />Week 2. Academic communication, rhetorical planning wheel, Summary and synthesis (Form seminar groups)<br />Week 3. Choose topic, evaluate sources, Library workshop<br />Week 4. Lateral reading, Argumentation<br />Week 5. Text analysis, Citing &amp; Referencing<br />Week 6. Audience awareness, Discussion roles<br />Week 7. Sample seminar, Multimodal communication<br />Week 8. Seminar consultations, Writing synthesis paper<br />Week 9-11. Seminar + Discussion (5 groups, so 5 classes).<br />Week 12-13. E-magazine submission and sharing<br /><br />As you can see there's only like 7 weeks of learning things that can be found by surfing the internet...",
            "comment_teaching": "Nick is a very chill and nice guy. He tries to be enthusiastic, but even he knows this course is poorly designed. I think he is not used to teaching, as he told us he used to write English textbooks prior to coming to UST. Also, he keep giving extensions because he teaches so slow!!!&nbsp;&nbsp;<br /><br />He also likes to share his extensive music collection (he owns 3000+ vinyl discs). If you have similar music taste (like me), then you should also reply to his music recommendation emails.<br /><br />There are also many awkward silences during class. The international school students just raise their hands every time. Participation also sucks and people just ditch the others' seminars after they finished theirs. <br /><br />My tip: Impression and participation matters. If you participate and attend classes, you can receive grade boost.",
            "comment_grading": "Pick the correct professor, correct section, good teammates and good topics or you will die (literally). I was fortunate to be in a class with few IB students, otherwise rip grade.<br /><br />10% Self-directed learning: Library workshop and academic journal report<br />15% Annotated bibliography<br />15% Self-reflections (5% each)<br />5% Synthesis Paper<br />20% Seminar presentation<br />20% E-magazine (Individual submission)<br />15% E-magazine (Group coherency)<br /><br />In the first two weeks, befriend some international school or DSE 5*+ students. The people who were enrolled through IELTS are usually not very good, unless they are actually international (and UST doesn't recognize their qualifications). Some even use a translator in class (crazy).<br /><br />I get Advanced or above for all assignments except for the group project where I get Competent because of lack of coordination with teammates. Finally get A-range (Thank you Nick!) Other students are not so lucky and get B-range with similar overall score as me.",
            "comment_workload": "Ridiculous workload. You are expected to spend 2 hours outside of class for every 1 hour of lecture time. 3 hours of class per week = 6 hours of self-study or meeting with your group.<br /><br />Although no attendance is counted, I believe the professors mark you more harshly if you don't attend class.<br /><br />Annotated Bibliography 3x (300 word summary + commentary) on academic sources<br />Self-Reflections 3x 300 words<br />Seminar: 5-6 minute presentation + 10 minutes of facilitating discussion questions.<br />E-Magazine Article 1000 words (must include multimodal elements like images, diagrams, and magazine design/formatting)<br /><br />None of the above is worked on in class. You do them all outside! Stupid amounts of workload.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ndqC9kHA2jGUOwkCK56cqHNGb0QXLKvj",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "fish_feed",
            "date": "Jan 28, 2023",
            "title": "Heavy workload and ambiguous grading",
            "comment_content": "It is hard to put the content taught in this course to good use because it is all very theoretical. For example, you learn the roles in group discussions, lateral reading skills, and the genres of different texts. The APA citation is the most helpful thing learned in this course, and it has helped me in other courses. The rhetorical planning wheel is also kinda useful I guess. Most of the content is not hard and there are no finals or mid-terms so you don't have to memorize any of them, so I guess it is fine.<br /><br />Unit 1 introduces the course, key components of the course, and classmates while exploring academic communication at the university level.<br />Unit 1 Lesson 1 - introduction to the course and class<br />Unit 1 Lesson 2 - introductions and communication<br />Unit 1 Lesson 3 - academic communication at university<br />Unit 1 Lesson 4 - group discussion roles and teams<br /><br />Unit 2 focuses on skills related to the research process, evaluating sources, synthesizing ideas, and citing sources in in-text citations and references. This includes topics related to language development and argumentation.<br />Unit 2 Lesson 1 - choosing a topic + finding and evaluating sources<br />Unit 2 Lesson 2 - library workshop<br />Unit 2 Lesson 3 - lateral reading and evaluating/verifying sources<br />Unit 2 Lesson 4 - text analysis: language and genre (voice)<br />Unit 2 Lesson 5 - rhetoric and argumentation<br />Unit 2 Lesson 6 - citing, referencing, and synthesizing sources<br />Unit 2 Lesson 7 - audience awareness in writing and speech<br />Unit 2 Lesson 8 - language style and register<br />Unit 2 Lesson 9 - multimodal communication<br />Unit 2 Lesson 10 - seminar and academic discussion practice<br />Unit 2 Lesson 11 - consultations on AB and seminars<br />Unit 2 Lesson 12 - writing a synthesis (dialogue between sources)<br /><br />Unit 3 is for presenting and discussing research in student-led seminars and in a group e-magazine. This unit includes group tasks and individual reflections.<br />Unit 3 Lessons 1-5 - Seminars<br />Unit 3 Lessons 6-7 consultations and groupwork<br />Unit 3 Lessons 8-9 presentations of final projects",
            "comment_teaching": "Lecturer: Stamper, Suzan<br /><br />Suzan is very nice and her lessons are extremely chill. Occasionally she'll pick students to ask questions or give opinions, but if you cannot answer she'll skip to the next person. She responds to emails promptly, so if you have any questions feel free to ask her. Attendance is not taken and graded, so not a lot of people come to the lectures, especially during the presentations. Supposedly there are some materials for you to prepare for before each lesson and discussions in canvas you need to answer after each lesson, but they are not checked most of the time. Suzan is a deadline fighter, so sometimes the due date for assignments will be randomly postponed, and you should expect to wait a long time for your grades for the assignments.",
            "comment_grading": "Annotated Bibliography (Individual) - 15%<br />Student-led Seminar and Synthesis Paper (Individual) - 25%<br />Project - Multi-modal Electronic Magazine (Individual and group) - 35%<br />Self-reflection (Individual) - 15%<br />Self-directed Learning, including library workshop (Individual) - 10%<br /><br />My grades were satisfactory, but considering the time I spent on the assignments I would say it's fair. The mean and SD of all the assignments are not released, so every time I receive a grade I have no idea if I performed well or not. I haven't asked a lot of other students their grades, but from the other reviews it seems that getting a good grade is almost impossible unless you give priority to this course.",
            "comment_workload": "Not a light course. Be ready to commit a lot of time to it.<br /><br />There is a short essay and a self-reflection you need to submit in the first month, but both are not graded so never mind that. The three main assignments are the annotated bibliography, the seminar(+synthesis paper), and the e-magazine, so expect to spend some time on all three of them.<br /><br />There are self-reflections you need to submit on weeks 8, 11, and 13, and you only need to write 250-300 words. Just take them seriously and follow the guidelines and you'll most likely get full marks for them. <br /><br />Compared to other courses the assignments might not seem like a lot, but it depends on how much effort you put into them. The class is very competitive, so if you don't take your work seriously then you might get awful grades. I spent waaaayyyy too much time on these assignments than I should have, and although my grades were alright, I really don't want to suffer through it again.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NAndzdsepaktoSPMTxou8ZALiQd1H0Xx",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "salted fish",
            "date": "Jan 26, 2023",
            "title": "Don't take this one",
            "comment_content": "My friends and I all felt we were not actually learning anything.",
            "comment_teaching": "Not very clear. Most of the time in classes was wasted because the commands and requirements of the instructor were very vague. The feedback was delayed severely so we couldn't make the necessary adjustment to avoid making the same mistakes twice.",
            "comment_grading": "Annotated Bibliography: 15%<br />Student-led Seminar: 20% and Synthesis Paper: 5%<br />Multi-modal E-Magazine: Individual 20%, Group Coherence 15%<br />4 Self-reflections: 3*5% (The first one is worth 0 marks, but you should still do it to get some feedback from your instructor)<br />Self-directed Learning (library workshop, citation quiz): 10%<br /> <br />Still, we don't know about the exact criteria.<br />Most people got Cs or Bs.",
            "comment_workload": "Extremely heavy. I spent more than 10 hours per week after class.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "k1fiqTy69Zk3olrMjbMobo68Q99oTpen",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Tree123",
            "date": "Jan 17, 2023",
            "title": "Unclear course material leading to unclear grading",
            "comment_content": "Researching and analysis (but the term &quot;analysis&quot; is used sparingly as the course is more on &quot;paraphrasing academically&quot;). Writing summaries based on sources, examining specific topics (environment, finance, culture, etc.), socratic seminars, and discussion-led lessons.",
            "comment_teaching": "Susan generally tries to make the class lighthearted; however, in turn, she does not give productive advice that is beneficial for assessments (which is made worse by the fact that many students, including me, end up being deducted for things that she did not provide in the exemplars).<br /><br />In addition, Susan has a very oddly focused emphasis on citations, which is frustrating and misleading as her only accepted citation style is often not applicable and even within APA citations can be argued to be incorrect (she uses APA 7, which I've since realized after being penalized every single time is different to APA 6, the citation format many students automatically use on citethisforme or easybib). Also, given that most business students need to use Chicago/Turbian and that most engineering students need to use IEEE for future research papers, the precise formatting of APA is not useful at all.<br /><br />Thus, given the already vague grading and the almost instant 0 marks Susan gives out for citations she deems incorrect, the teaching for the course is somewhat unhelpful, inapplicable, and unforgiving.",
            "comment_grading": "Ended up within the A range which I've since found out is almost unheard of given Susan's extremely vague grading system, however, despite the grade it is still confusing as till now she has not posted half of the grades, and with the ones that she has, the feedback is missing for most of them.<br /><br />Very frustrating for the entire class to ask for feedback/grade evaluation as she views it as arguing for grades (she immediately sent out an email after the grades were posted that most of us would be disappointed).",
            "comment_workload": "Overall, the workload is very light (as someone who is used to writing long essays), however, it can be very challenging for students who are used to short answer responses. Given that the grading is vague and the feedback is even more vague, if you take this course, focus on another course, and just complete the assigned essays with minimal effort because your time will be better spent somewhere else.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7uCQJUYp3TTw5yXGTTv0rrv9qpLIFfc1",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 411,
                    "name": "MEGAN, Melissa Jane",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tkm",
            "date": "Jan 02, 2023",
            "title": "Slightly boring but necessary course",
            "comment_content": "In short, the content might be boring to learn as it seems obvious, but learning how to cite is probably important for future studies, and the other content will be necessary for future language courses. (Apparently this course was made compulsory for all students in the new common core because the students who had english credit transfers did not do well in year 2 language courses)",
            "comment_teaching": "Melissa is a very kind teacher, and understands that most students are not always the most talkative, but she still tries her best to break the ice by having discussions before or during lessons. (And also playing music before class)<br /><br />Although attendance isn't necessary, most of my classmates attend the lesson. Do note that sleeping is not allowed in this class, or Melissa might be annoyed with you! (Don't worry as she will just ask you to take a walk outside)<br /><br />She will also add comments to your assignments quickly after marking them, and you can always email her or ask her for clarification in the consultations. The consultations usually takes place after major assignments, and are very useful especially if your group is procrastinating. <br /><br />In summary, Melissa is a nice and supportive teacher and don't be afraid of asking her questions! She is available after class, and also will respond to your emails.",
            "comment_grading": "Annotated Bibliography: 15%<br />Student-led Seminar: 20% and Synthesis Paper: 5%<br />Multi-modal E-Magazine: Individual 20%, Group Coherence 15%<br />4 Self-reflections: 3*5% (The first one is worth 0 marks, but you should still do it to get some feedback from your instructor)<br />Self-directed Learning (library workshop, citation quiz): 10%<br /><br />According to Melissa, the grading is not based on a curve, and is based on criteria. Basically, if your work is average (Satisfactory Performance), then you will get a C, and your classmate's grade will not affect your grade.",
            "comment_workload": "The course expectations states that &quot;For CORE 1404, which has 3 credits, you should then expect to spend 3 hours in class and around 6 hours on self-study. This self-study will include preparation for lessons, library research, online self-directed learning and completing assessed tasks. Plan ahead as much as possible to balance your workload over the semester.&quot;<br /><br />This means that you should put in 117 hours, but I seem to have used less time than expected. This could be due to the introductory lessons at the beginning for the first 6 weeks, and the first assignment (annotated bibliography) being due on week 7. This also means that it is quite hard to start working on the assignments in the first few weeks because the sample materials are only released 1 or 2 weeks before the deadline.<br /><br />I spent a total of 72 hours on this course (both in class and assignments)<br />Lessons (1.5 hours each) and consultations (usually 30-60 minutes) add up to roughly 34 hours, and another 38 hours for assignments:<br />- Research: 3 hours<br />- Annotated Bibliography: 12 hours (~4 hours each)<br />- Seminar: 8 hours<br />- E-magazine: 8 hours<br />- Self-reflections: 1 hour?<br /><br />During the final lesson, there was a discussion with the whole class, and some students mentioned that this class had the heaviest workload, but personally I felt that it was fine if you manage your time well. (eg. It is extremely painful to write 3 annotated bibliographies consecutively so start working on them earlier)",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6CbWQuqwuOPw5QflB60K7mD6rfdlm2ev",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "mysouleftme",
            "date": "Jan 01, 2023",
            "title": "Boring course with rather harsh grading",
            "comment_content": "Content taught in class is not very useful, both for completing the assignments and in the whole university setting in general. Each group will have to pick a theme (e.g. digital life, slow city) and each member of the group has to do research on one smaller topic related to the theme. (Themes and topics were all given.) The assignments all feature very different target audiences and appropriate writing styles to see how well you can adapt to and communicate clearly in different settings.",
            "comment_teaching": "Suzan is nice. She replied to emails quite promptly (from my very own experience) and tried to engage students in discussions during the lessons, though her attempts weren't always successful.",
            "comment_grading": "Annotated Bibliography (15%): choose three university-level articles related to your topic and write a total of around 1000 words to summarise, analyse and comment on all three of them.<br /><br />Synthesis Paper (5%): a lead-up to the seminar. A 250 to 300 word summary of the three sources you used in your annotated bibliography.<br /><br />Student-led Seminar (20%): each person gives a 5-minute presentation on their own topic. After the presentation, you will also need to act as a &quot;discussion leader&quot; to facilitate discussion on the presentation that your group just gave.<br /><br />Multimodal e-Magazine (35%): 20% for individual work and 15% for group work. Around 1000 words from each member of the group.<br /><br />Self-reflections (15%): 4 self-reflections to submit in total. The first one will not be graded. (5% x3)<br /><br />Self-directed Learning (10%): an academic genre report (3%), a library workshop (4%), and a quiz on how to correctly cite and reference others' works (3%)",
            "comment_workload": "Personally, I find the workload to be pretty decent for an advanced course. I would say the most demanding part was the start of the course during which we had to do tons of research and read many university-level articles for the Annotated Bibliography. Preparing for the seminar presentation and the final project e-magazine were also rather time-consuming. The self-reflections shouldn't take up a lot of time.",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YfnbWjqC5AJ91rfaw522QPpCfoMZNFIV",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Ireneee",
            "date": "Dec 30, 2022",
            "title": "Heavy workload yet mysterious grading",
            "comment_content": "Multi-modality, group roles, evaluating sources, textual analysis, argumentation, citing and synthesizing, language style, …<br /><br />Meaningful yet not so related to the written assignments, sometimes boring to discuss for the entire lecture.",
            "comment_teaching": "Suzan tries to maintain an interactive learning environment.",
            "comment_grading": "Annotated Bibliography (15%): Summary + analysis for three piece of university-level sources (most likely be journal articles).<br />Seminar (20%): 5 min individual presentation + 7 min leading discussion. This format repeats for each one in the group. <br />Synthesis Paper (5%): A one page summary as a leading piece for the above seminar.<br />Multimodal e-Magazine (35%): A 1000-word requirement for 1 or 2 essays. <br />Self-reflections (15%): Basically the more you criticize yourself, the more the instructor would enjoy reading it. <br />Self-directed Learning (10%): Library workshop quiz about APA citation and finding sources<br /><br />Except for the quiz, the rest of the written assignments were graded using criterion like “exceptional”, “advanced”, “competent”. These are often given directly without much description to back up, and also subjective preference and understanding of Suzan matter a lot in my point of view. Her samples were not having high qualities, in which even we mimicked the format and style, it might not essentially result in good grades. I would say that the grading is somehow subjective and not very transparent.<br /><br />**Attendance not essentially graded, but small class size actually makes any absence very obvious.",
            "comment_workload": "I spent a long time writing those individual assignments yet not having very good “criterion”. It was somehow discouraging by weighing the effort I put in writing/polishing and the feedback I got.<br /><br />Suzan is a ddl fighter for giving any kind of feedback and samples to guide our assignments, so be ready to react and write quickly.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0WuBKhYqGkSSP7IR8oMJMsXFr8JcuLIG",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "dupr1ce",
            "date": "Dec 30, 2022",
            "title": "Decent workload but shit grading : D DON'T TAKE THIS COURSE!!!",
            "comment_content": "Check the CORE 1404 MF student schedule document attached below...<br /><br />It's okay, nothing much",
            "comment_teaching": "Lecturer: STAMPER, Suzan<br /><br />Suzan is a nice professor, but all the lecture materials taught are pretty useless for the tasks you need to complete. You can chill for most of the semester until the latter half when you need to complete the annotated bibliography, seminar and e-magazine",
            "comment_grading": "Annotated Bibliography (Individual) - 15%<br />Student-led Seminar and Synthesis Paper (Individual) - 25% (20% for Seminar, 5% for synthesis paper)<br />Project - Multi-modal Electronic Magazine (Individual and group) - 35% (20% based on individual entry, 15% based on coherence amongst all groupmates' entries)<br />Self-reflection&nbsp;&nbsp;(Individual)&nbsp;&nbsp;- 15% (5% each, 1st one is not counted)<br />Self-directed Learning, including library workshop (Individual) - 10% (Just attend and u get all 10%)<br /><br />Apparently, they use criterion referencing (e.g. exceptional, advanced, competent, emerging, and entering) when grading. But even if you get 95% exceptional, you will still end up with B+ in some cases. <br /><br />Impossible to get A range here, you might as well enroll for CORE1403 in spring term to save your GPA ;)<br /><br />Attendance doesn't count for grades, but there is some teacher bias if you attend all classes (i.e. they are more likely to give higher &quot;criterion standards&quot; for the people that attended more classes)<br /><br />EDIT: Apparently the head was &quot;happy with the grades&quot; assigned this semester with a very low A range in an advanced course, a large B range and an even larger C range. If you want to ruin your GPA and be put on academic probation, by all means take this course. If you are not a masochist, don't take this course.",
            "comment_workload": "Decent workload, with good time management, you can complete all the tasks on time.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "zAmnQeSrfbZpeRGm9kdiZgX9K61kfxVS",
                    "name": "CORE 1404 MF student schedule",
                    "format": "docx"
                }
            ]
        },
        {
            "hash": "pMyF6c2Ybp0AXs07ZaP9C5oe8IsU3DP1",
            "semester": "2022-23 Spring",
            "instructors": [],
            "is_author": false,
            "author": "desmond fanboy",
            "date": "Jun 09, 2023",
            "title": "Useful course with a rather high workload",
            "comment_content": "Most of the content covered in this course should be basic knowledge taught in the IB curriculum or at other international schools. You learn to cite sources in APA format manually without the help of easybib, create an annotated bibliography, write a synthesis paper and a powerpoint presentation, and create a final e-magazine (group project).",
            "comment_teaching": "My instructor was quite passionate in her teaching and was always willing to answer questions from her students. The teaching style was quite engaging, and I've rarely ever seen a student fall asleep in this class. The instructor had also provided timely feedback on the assignments with comprehensive comments.",
            "comment_grading": "Despite what other reviews say, I'd actually argue that the grading isn't that bad. Basically, if you have good writing, presentation, and analytical skills, and pour in a significant amount of your time perfecting your work, then you will most likely earn A range. On the other hand, if you are not that comfortable or fluent in English, but somehow ended up here, you would probably end up with a B (based on observations).",
            "comment_workload": "The workload for this course is honestly quite heavy, especially if one or more of your group mates choose to free ride the e-magazine and completely ignore your whatsapp messages. <br /><br />Here is a rough estimate for the amount of hours I had to spend on each assignment.<br /><br />Annotated Bibliography: 6 hours<br />Synthesis Paper: 4 hours<br />Presentation Slides: 6 hours<br />E-magazine: 12 hours (shouldn't take this long if you actually meet some decent group mates)<br /><br />As you can see, the workload is manageable as long as you use your time effectively, but nevertheless, quite high for a 3 credit course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2HcicL02RqSR0LWUtGRofy4iPe0zFE5N",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Jennnny",
            "date": "Jan 30, 2023",
            "title": "Think twice before chose",
            "comment_content": "Honestly, I didn't feel like I learned anything useful from this course. Things taught in class were quite chill, and seemed not really to have much connection with 'academic'.",
            "comment_teaching": "The instructor was nice, she was friendly and willing to help. <br />She would also held private meetings on zoom and gave us opinions.",
            "comment_grading": "It was unbelievable that I received a C range grade in the final. I felt like I should at least got a B range anyway. It was said that participation would count, but the grading is just related to homework. So even if you remain silent in class, it would not matter.<br />Perhaps she got her own way of grading, but my score was too low for someone who got a 6.5 in IELTS writing lol.<br />But the professor said C was an average.",
            "comment_workload": "We have to write alooooot of stuff and&nbsp;&nbsp;using the knowledge she had never taught in class. <br />There are :<br />5 reflection milestone essays.<br />1 annotated bibliography<br />1 similar to annotated bibliography (but not necessarily the same)<br />1 big essay <br />1 e-magazine essay<br />and a lot of short writing stuff I can't really remember.<br />The course had a huge workload!",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JPwC9OaGSkaOqt7BYAUq3SVt9pFZWF2f",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Justtt",
            "date": "Jan 27, 2023",
            "title": "Don’t take this course",
            "comment_content": "The content is boring and I have no idea what I have learnt aside from the apa format.",
            "comment_teaching": "Suzan tried to make the lesson engaging; however her teaching did not help us to better prepare for our assignment. Very unclear guidelines were given.",
            "comment_grading": "I was quite disheartened because I got 3 out of 5 for most assignments. Ended up with a B+ but I expected more.<br />Her gradings were also unclear; some assignments she just gave us a low mark without giving any feedback.<br />Try to be more active in class because attendance matters and I believe the grading somehow depends on her impression towards you:)",
            "comment_workload": "Suzan is a deadline fighter, so she always gave us feedback at the last minute, which increases our workload having to amend the work in a very short period of time.<br />Yet, workload is acceptable considered that it is a lang course.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JHXAhedrPYmzBDEDTdsUig5tG61N2sOe",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 411,
                    "name": "MEGAN, Melissa Jane",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "potatosalad",
            "date": "Jan 02, 2023",
            "title": "New Course, Fair Grading, Great Professor",
            "comment_content": "New course. The content is pretty bland, but there are a lot of group projects, collaborations and activities. There are a lot of talking amongst classmates and Melissa encourages you to speak up if you are a bit introverted. There were few lectures from the professor and more individual/group work.",
            "comment_teaching": "Melissa is a very nice professor and explains the content and course material pretty well.&nbsp;&nbsp;She encourages everyone to speak up as well. Attendance is taken every class and you should probably attend all of the lessons.<br /><br />Quick respond time to emails and any questions. She has several group consultations in her office outside of class and those are very helpful if you are confused about any projects or requirements.<br /><br />Detailed comments are given on all assignments. You can ask Melissa if you are confused about any of the comments. Also they come in handy when writing self-reflections.",
            "comment_grading": "Grading is fair. Absolute grading not curve based. Criteria based with 5 levels - entering, emerging, competent, advanced, exceptional.<br /><br />Be careful with self-reflections as they are not what you expect. Although each is only 5%, there are 3 graded self-reflections, adding up to 15% of the course grade.<br /><br />Annotated Bibliography - 15%<br />Seminar - 20%<br />Seminar Synthesis Paper - 5%<br />E-Magazine - 35%<br />Self-Reflection #1 - ungraded, feedback given<br />Self-Reflection #2 - 5%<br />Self-Reflection #3 - 5%<br />Self-Reflection #4 - 5%<br />Self-Direct Learning Tasks (quiz for completion grade) - 10%",
            "comment_workload": "Heavy workload. Be prepared for lots of group projects that need to be done outside of class. I spent the most time in this course out of all my classes this semester.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "m8KXLHaafnWTk3PUJJhRUVncd3CjAybm",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "RSpirit",
            "date": "Feb 13, 2023",
            "title": "",
            "comment_content": "Content is quite repetitive and essentially things that high school English covered. Finding and citing sources, how to enhance your academic writing, etc. Can be useful if you haven't studied it previously, but will be very boring if you've covered it.",
            "comment_teaching": "Teaching was okay but since content was repetitive, didn't pay much attention to the teaching.",
            "comment_grading": "Annotated Bibliography (Individual) - 15%<br />Student-led Seminar and Synthesis Paper (Individual) - 25%<br />Project - Multi-modal Electronic Magazine (Individual and group) - 35%<br />Self-reflection (Individual) - 15%<br />Self-directed Learning, including library workshop (Individual) - 10%<br /><br />Most assignments are graded on a scale of 5 but are titled &quot;exceptional, advanced, adequate&quot; etc. Grading can be very mysterious so you really have to make sure you confirm with the professor what they are looking for, especially the self-reflections. <br /><br />Self-directed experiences are essentially guaranteed full marks.<br /><br />Other written and oral assignments generally just test your general English abilities. If you are confident with writing papers or giving presentations in English, then you should get a decent grade. Again, be sure to understand what the professor is looking for in terms of format and content.",
            "comment_workload": "Workload is decent. 1 oral presentation, 2 long written assignments, 3 small written assignments. No midterm no final.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Fh0ABqmDSp3mt0U0WLEXmwNcnX28xsA8",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1719,
                    "name": "MUDDEMAN, Gary",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ovaltine",
            "date": "Jun 09, 2023",
            "title": "Confusing course",
            "comment_content": "The content is mainly about citation techniques and learning how to use information from different sources.&nbsp;&nbsp;The course focuses on written and verbal communication skills.&nbsp;&nbsp;<br /><br />The content itself is ok... but kinda boring and students feel aimless with the course.",
            "comment_teaching": "Gary is a nice instructor that gives relatively engaging lessons, he also encourages students to talk and share their opinions in class which I find quite good.&nbsp;&nbsp;Sometimes what is taught in class does not necessary help with our work though, but he sometimes checks in on how we are doing.",
            "comment_grading": "The grading of this course is strange<br />Gary is quite harsh in marking his students, usually only giving competent or advanced on the assessment criteria compared to other profs who give exceptional (full marks) quite often.<br /><br />I initially thought the course was curved among ALL professors so our class had really low expectations.&nbsp;&nbsp;But at the end the grading done by Gary was not bad compared to other profs that I heard of. <br /><br />I scored mainly comp/adv and adv grade and ended up with an A so I'm pretty surprised",
            "comment_workload": "The workload of this course is horrible.&nbsp;&nbsp;Its just work after work after work and it feels like its never ending.&nbsp;&nbsp;There is no exams but the amount of coursework is painful.&nbsp;&nbsp;<br /><br />Annotated bibliography<br />Synthesis paper <br />Group seminar/presentation<br />Group E-magazine <br /><br />AND 3 reflections throughout the course.&nbsp;&nbsp;&nbsp;<br />A lot of the course work seems pointless as we are just repeating what we already did.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}