{
    "error": false,
    "course": {
        "id": 3634,
        "subject": "ECON",
        "code": "1222",
        "name": "What Applied Microeconomics Tells Us About Our Life and Social Policy",
        "description": "This course will provide students opportunities to critically read and interpret social science literature on human capital development over the life cycle. It will also give students an opportunity to discuss, through examples, how this evidence could be applied in the real world policy design. The questions to be addressed in this course focus on human capital development such as health, education, and labor policies over the course of one’s life. The examples will help students understand how to interpret available data and use it to evaluate different policy programs.",
        "categories": [
            "Common Core (SA)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2130
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.24,
        "rating_teaching": 4.35,
        "rating_grading": 4.47,
        "rating_workload": 3.76,
        "review_count": 17,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1494,
                "name": "KIM, Hyuncheol Bryant",
                "count": 16
            }
        ]
    },
    "reviews": [
        {
            "hash": "TuOVsv8SJRZtXftwZTiZ8yR4UAVMuAHZ",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "iloveecon",
            "date": "Jun 01, 2022",
            "title": "Good grade CC course",
            "comment_content": "Topic 1: Fetal Origin Hypothesis - I am pregnant. How do environmental conditions during pregnancy affect my child's life?<br />Topic 2: Early Childhood Education, Health, and Nutrition - I have a three-year-old son. What are the long-term effects of childhood health and education? <br />Topic 3: COVID-19 Policies - Is it a good idea to close schools during COVID-19 pandemic? What are the consequences of school closure? How can we booster COVID-19 Vaccination?<br />Topic 4: Sex Discrimination and Parental Investment - Does Sex Discrimination still exist?<br />Topic 5: Policy failures - How do policy interventions fail to achieve its goals?<br />Topic 6: Determinants of a life success -&nbsp;&nbsp;What are the determinants of life success?",
            "comment_teaching": "I would say his teaching is on average because he is new to hkust and he teaches this course the first time, so certainly there must be some improvements. I love how he combines his personal experience into the topic because it is kind of interesting and make the lesson less boring. Also, his explanation on some critical concepts is good like Randomized controlled trials, Regression-discontinuity design because he provides some daily example which is not so common in ust. Moreover, this course doesn't involve much microeconomics theory behind so if you want to study traditional theories, go to econ 2103 instead and this course mainly focuses on the research findings of different topics like covid-19 which is extremely interesting. I would say this course content is the most interesting and most related to our daily life in ust and it's not just about memorizing facts and calculations. In fact, this course has little or even no calculations at all which suits students with weak mathematical background.",
            "comment_grading": "Midterm exam(mean: 72.72, SD:14.92, high:92.5, 30% of the grade)<br />me: 92.5/100<br />Final exam(mean: 75.35, SD: 13.44, high:97, 30% of the grade)<br />me: 96/100<br />First policy recommendation paper(mean: 8.1, high:10, me: 9.5/10)<br />Second policy recommendation paper(mean:8.64, high:10, me:10/10) <br />Two policy recommendation papers are in total of 20% of the grade<br />Group presentation(mean:12.93, high:14, 15% of the grade)<br />me: 14/15<br />Class Participation(mean:3.99, high:5, 5% of the grade)<br />me: 5/5 <br />Final score(mean: 76.01, high: 95.1, me: 95.1/100)<br />Final grade:A+<br /><br />Grading is lenient as he said he would be as generous as possible in giving out grades. For the two policy recommendation papers, as long as you have concrete evidence and research paper found, it is okay to get a good mark as the TA is lenient in grading them. Also, the group presentation is lenient as long as you have prepared well and spoke well on that day. Participation marks are easy to get too as long as you have commented something on the chat box in zoom. But I think next semester you guys have to speak out to say something on class since it is most likely to be F2F. So, the battleground lies on midterm and final. The format is in short questions which require you to write something based on your own opinion with supporting evidence. It is closed-book and you have to remember some of the research findings to help you establish your own arguments. But no need to remember the source and data, just some significant findings is okay because he doesn't want us to memorize facts just like other courses in ust. So I appreciate that a lot. Moreover, you do not need to write so many things as there is a harsh time limit and the professor said you only need to write the points with brief elaboration. So just be precise.",
            "comment_workload": "Moderate workload, but it becomes huge when it comes to the two recommendation papers because the deadline of each recommendation paper is set after the day of finishing that topic so you have to start your work when he first teaches that topic. However, for the presentation, it is easy because you only have to combine each of your group mates work into one ppt and present it to other students. For the midterm and final, the paper itself is not hard. Just grab some time to look at the reading materials and ppt because most of the questions are mainly based on them. The reading materials are not so long, only 7-8 pages but with many graphs.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FE0ZraZxdMyvMRgXZQPYt835LZDQW2cF",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wooyoungk",
            "date": "Jan 07, 2023",
            "title": "Definitely consider taking this course",
            "comment_content": "Topic 1: Fetal Origin Hypothesis - I am pregnant. How do environmental conditions during pregnancy affect my child's life?<br />Topic 2: Early Childhood Education, Health, and Nutrition - I have a three-year-old son. What are the long-term effects of childhood health and education? <br />Topic 3: COVID-19 Policies - Is it a good idea to close schools during COVID-19 pandemic? What are the consequences of school closure? How can we booster COVID-19 Vaccination?<br />Topic 4: Sex Discrimination and Parental Investment - Does Sex Discrimination still exist?<br />Topic 5: Policy failures - How do policy interventions fail to achieve its goals?<br />Topic 6: Determinants of a life success -&nbsp;&nbsp;What are the determinants of life success?<br /><br />The course content was highly informative and relevant to real-life situations. The course provided valuable insights into how environmental conditions during pregnancy affect a child's life, the long-term effects of childhood health and education, COVID-19 policies, sex discrimination, and policy failures. Additionally, the course discussed the determinants of life success, which was insightful. Overall, the course content was very helpful and relevant to society today.",
            "comment_teaching": "The professor's teaching style is engaging and effective. In addition to being quite funny, he is skilled at explaining complex concepts in a clear and concise manner, making the material more accessible to students. His enthusiasm for the subject matter is contagious, and he encourages active participation and discussion in the classroom.",
            "comment_grading": "The grading system for this course is very fair and transparent. Typically, students who perform in the upper quartile of the class receive an A- grade. The professor has consistently emphasized his commitment to generous grading practices throughout the course, and this was evidently reflected in the final letter grades students received.",
            "comment_workload": "The workload for this course is manageable with only two policy recommendation papers and a group presentation. There are no additional take-home assignments or homework, allowing students to focus on these main projects. This structure also provides ample time for research, analysis, and collaboration with peers on the group presentation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "M38Ebj001Qrrx0DY6IrAr7sVEzkEH3m1",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hayes",
            "date": "Jun 07, 2022",
            "title": "very special course",
            "comment_content": "You can see the content in other posts, so I'm not going to make one. However, few points I would like to mention. <br />The six topics are basically some ppt made by the pro, based on his researches and his own narratives, they are not some general knowledge that you would learn in other courses, which, I must say, some of his views are quite biased. But, his lesson could be a good place for discussions regarding policies, social issues, etc...<br />I would recommend this course if you want a place for discussions on social issues.",
            "comment_teaching": "His teaching and presentation skills are quite mediocre tbh, he has a Korean accent sometimes quite hard to understand. However, I like his attitude and enthusiasm.",
            "comment_grading": "The grading is just fair as a common course. got a b-, few marks below mean, since i didn't put much effort, i wouldn't complain too much.",
            "comment_workload": "would say fair.<br />2 papers each 5 pages to write about, and two exams.<br />a thing i want to bring up is that if assign to certain topics for ur paper, you need to finish it in the start of the semester, which is quite unexpected to write an essay this soon.<br />+presentation",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HAlhdg90PF26OHc72oeikFoz4zhnEo97",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Peipar",
            "date": "May 30, 2022",
            "title": "",
            "comment_content": "1. Fetal Origin Hypothesis (how do environmental factors during pregnancy affect a child's life?)<br /><br />2. Early Childhood Education, Health and Nutrition (what are the long-term affects of early childhood health and education?)<br /><br />3. Covid-19 Policies (is school closure a good idea? how can we boost vaccinations?)<br /><br />4. Sex Discrimination and Parental Investment (does sex discrimination still exist?)<br /><br />5. Policy Failures (how do policy interventions fail to achieve their goals?)<br /><br />6. Determinants of Life Success (what determines life success?)<br /><br />Basically, we looked at different research papers to answer the main questions for each topic. This is not a true economics course, there are no microeconomics or macroeconomics concepts.<br /><br />Content is quite basic. But there are some good-to-know moments.",
            "comment_teaching": "He's not boring, doesn't mind questions, and has strong opinions.<br /><br />Lectures are quite good, usually he will start with some casual conversation like about the weather. Well-paced and lots of opportunities for interaction and opinion sharing. He likes to share about his life experience.",
            "comment_grading": "20% Policy-recommendation papers (choose any 2/6 topics)<br />15% Group presentation (1 of the 2 topics chosen above)<br />30% Midterm (covers topics 1-3)<br />30% Final (covers topics 4-6)<br />5% Class participation (zoom chat/canvas discussions)<br /><br />Midterm and Final are fair grading, and these will basically determine your grade. As the grading is very kind for other areas.",
            "comment_workload": "Quite light.<br /><br />Policy paper takes some time, but luckily the grading is generous. As long as you can think of a relevant topic and cite a couple research papers, you should be fine. In my experience, even a surface-level analysis is enough for 8 or 9 (out of 10).<br /><br />Group presentation is easy enough, you can do one big topic or several smaller topics. Similar content to policy paper.<br /><br />Class participation is easy to get.<br /><br />For the exams, lecture slides and reading materials are enough as preparation, even if you don't attend all the lectures. Difficulty is well-balanced, it's more about lots of questions not enough time. And it's closed-book. No real need to memorize anything, but a little is useful to cite in your arguments.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SXCiUQ8nEXzk0hCUz4Ci2VGTZdrBjYYH",
            "semester": "2022-23 Summer",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Testing1234",
            "date": "Jul 28, 2023",
            "title": "A relax course, strongly recommend to use it as CC",
            "comment_content": "– Topic 1: Pregnancy (Fetal Origin Hypothesis): I am pregnant. How do environmental conditions during pregnancy affect my child's life?<br />– Topic 2: Early Childhood Policy: I have a three-year-old son. What are the long- term effects of childhood health and education?<br />– Topic 3: Working Mom and a Role of Father: What are the long-term effects of working-mom on child outcomes<br />– Topic 4: Friends: How important my friends are in my life?<br />– Topic 5: Determinants of a life success: What are the determinants of life success?<br />– Topic 6: Sex Discrimination and Parental Investment: Does Sex Discrimination still exist?<br />– Topic 7: Policy failures: How do policy interventions fail to achieve its goals?",
            "comment_teaching": "Professor Kim loves raising personal experiences, which makes the class more relaxed and chill. He loves interacting with students. You can easily understand the result of those economic papers with his examples. He also loves playing some songs before the 3 hours class. There are also some 15-minute breaks every hour. He tries his best not to make this 3 hours summer course a tough one.",
            "comment_grading": "Reasonable.<br /><br />– 2 Policy recommendation papers (20%, 10% each)<br />– Group Presentation (20%)<br />– Exam (50%) <br />– Class participation (10%)<br /><br />Policy recommendation papers: if you submit something, even though they are nonsense, you get 7/10. The grading for the papers are very generous. The median of the 2 papers are 9 and 10 respectively. I got 9 and 10 for the two papers.<br /><br />Group Presentation: you will be assigned to a 2 people group according to your topic preference. If you have enough Evidence and Support in your presentation, you will be good. Median 8.75, me 10<br /><br />Exam: full marks 143, open-ended questions. I strongly recommend you go through the required readings. As long as you understand the lecture slides and the readings, you can get good scores. Median 95.5, UQ108.25, LQ 85, max 128, me 113<br /><br />Participation: you can get participation scores by answering questions in class or commenting in the discussion board. Median 10, me 10<br /><br />Overall: A",
            "comment_workload": "Since it is a Summer course, it is a little bit rush for us to prepare the presentation. The group formation was announced 2 days before the first presentation date. I am one of the group that has to present in the first day, so we only have ~1 day to prepare the presentation. Therefore professor said he will be generous with day 1's presentations. In general, the workload is a little bit high as you have to write 2 5 pages papers and a presentation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mugTxTF3JA114gINVSwalHfK2E9VQPqs",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kuromiiii",
            "date": "Apr 18, 2023",
            "title": "good grade",
            "comment_content": "topic:<br />1: pregnant<br />2: covid-19 policy <br />3: friends impacts<br />4: <br />5:<br />6:",
            "comment_teaching": "always saying joke<br />but not related to the lectures <br />fun lesson",
            "comment_grading": "Absolute grading :<br />total 104people <br />A+: 94+&nbsp;&nbsp;(8 people) A:&nbsp;&nbsp;92-94 (10 people) A-: 91-92 (9 people)&nbsp;&nbsp;&nbsp;*** More than 25% got A B+: 89-91 (16 people) B0: 85-89 (18 people) B-: 84-85 (7 people)&nbsp;&nbsp;&nbsp;*** About 40% got A C+:80-84 (11 people) C: 75-80 (16 people) C-:70-75 (3 people)&nbsp;&nbsp;*** Less than 30% got C D&amp;F: below 70 (6 people) <br /><br />normal all get 95% if you hand in homework punctually <br /><br /><br />my midterm : 88/100<br />final :95/100<br />prsentation: 8.5/10 <br />hw1 : 9/10<br />hw2: 9.5 /10<br />Participation:3/5<br /><br />grade : B+ <br />quite good grade",
            "comment_workload": "If you choose a topic well, you can do it easily <br />you have to hand in assignments within three days after he finished teaching the topics that you choose.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "idkLBRFokkj0P1DMryEFYg6yDaLTZskH",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Shin, Woo-hong",
            "date": "Mar 03, 2023",
            "title": "light contents but bit heavy workload",
            "comment_content": "Topic 1-1 Fetal Origin Hypothesis 202209<br />Topic 2 Early Childhood Education Health and Nutrition FULL<br />Topic 2-1 School Closure During COVID-19 Pandemic<br />Topic 2-3 Covid-19 and Vaccines 2022<br />Topic 3 Impacts of Friends<br />Topic 4 Determinants of life success<br />Topic 5 Sex Discrimination and Parental Investment<br />Topic 6 Policy failures<br /><br />I just directly copied the content from the canvas. I would say the contents are easy to follow and nothing too tricky. The main concept of content is to figure out the causality of every problem.",
            "comment_teaching": "I like his enthusiastic attitude and his personal story. He related his story to his course contents which makes me pretty interested.",
            "comment_grading": "Even though I did not put a lot of afford into the course, I got B+ for this course.",
            "comment_workload": "Even though the contents are pretty easy to follow, the workload is quite heavy. There is 1 presentation, two essays, and two exams to complete.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "w3G3PKv9AstRxz3FG9gRasZmy2r5bncq",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ashlcy",
            "date": "Feb 03, 2023",
            "title": "Funny CC but difficult to get a good grade",
            "comment_content": "Super funny and you do learn something from that and it may alter some of your thoughts. However, things are quite conceptual since he uses different social issues as themes.",
            "comment_teaching": "Super fun and nice, humorous as well",
            "comment_grading": "maybe the midterm and final are easy, many people get high marks but your grade may not be as good as you expect. <br /><br />The assignment (2 essays) is super easy to get high marks like the mean is 7 or 8 over 9. <br /><br />and this professor is absolutely generous.<br /><br />random attendance",
            "comment_workload": "not so heavy, compared to some 'traditional' ust course, not that chur at least.<br /><br />the lecture is based on the reading material so better read it before the lecture. Not so long and fun to read<br /><br />But be wise to choose which 2 topics you will write the essay. You may consider your schedule and interest.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Zhe7oDDAmeb5qkyf4PwoXOnlil4oywOE",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Tree123",
            "date": "Jan 17, 2023",
            "title": "",
            "comment_content": "Topic 1: Fetal Origin Hypothesis - I am pregnant. How do environmental conditions during pregnancy affect my child's life?<br />Topic 2: Early Childhood Education, Health, and Nutrition - I have a three-year-old son. What are the long-term effects of childhood health and education?<br />Topic 3: COVID-19 Policies - Is it a good idea to close schools during COVID-19 pandemic? What are the consequences of school closure? How can we booster COVID-19 Vaccination?<br />Topic 4: Sex Discrimination and Parental Investment - Does Sex Discrimination still exist?<br />Topic 5: Policy failures - How do policy interventions fail to achieve its goals?<br />Topic 6: Determinants of a life success -&nbsp;&nbsp;What are the determinants of life success?",
            "comment_teaching": "His teaching is on pace and each PowerPoint will be covered in 1-2 lessons so it is easy to catch up. Some personalized viewpoints are shared (especially regarding COVID-19 and the education system) that will come up during the midterms and finals, so the course is quite opinionated towards the professor's beliefs. If you enjoy a casual lecture approach this course is good for you as he often shares his life experiences and past research into each topic.",
            "comment_grading": "20% Policy-recommendation papers<br />10% Group presentation<br />30% Midterm (Topic 1-3)<br />35% Final (Topic 4-6)<br />5% Class participation (Canvas discussion with emphasis on replies instead of comments/in-class responses)<br /><br />Grading is lenient however it is very competitive as the midterms and finals are relatively easy. Both the midterms and finals reflect more on time management than actual understanding (during the finals the professor kept extending the time allocated as he realized students were not able to finish within the set time).",
            "comment_workload": "The workload is minimal for students who are used to writing long essays, group project is usually the biggest issue as there may be freeloaders. However, the essays and presentation only deviate around 1% of the total grade each as it is out of 10 (most students score a 9) so it isn't something to stress about. Midterms and finals do not correlate to each other as they each test on different topics so it is possible to recover from a bad midterm/final, make sure to read the professor's reading materials as he often quizzes the real-life examples he raises on there.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "X20f4NmO0LmZSd0tLs7AYmRKgsj1kFye",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TYN",
            "date": "Jan 12, 2023",
            "title": "Leng grade course",
            "comment_content": "Topic 1-1 Fetal Origin Hypothesis<br />Topic 1-2 Early Childhood Education Health and Nutrition<br />Topic 2-1 School Closure During COVID-19 Pandemic<br />Topic 2-3 Covid-19 and Vaccines<br />Topic 3 Impacts of Friends<br />Topic 4 Determinants of life success<br />Topic 5 Sex Discrimination and Parental Investment<br />Topic 6 Policy failures",
            "comment_teaching": "Prof is quite fun. He has a Korean accent but not hard to understand. But some chapters are boring, I fell asleep during lecture.",
            "comment_grading": "Fair grades, I got an A-<br />Distribution: 25% A range 40% B range 30% C range<br /><br />1 Policy recommendation papers (20%) -10% each <br />(choose 2 out of 5 topics)<br /><br />Most people got 9 or 9.5 out of 10. The mean is about 9.3. I got 9.5 for both papers.<br />The papers required evidence, you have to do some research.<br /><br />2 Presentation (10%)<br />My group 9/10<br />The mean is 8.9/10<br />The topic will be one of the the 2 topics you choose, so you can use the content of the paper for the presentation.<br />You have to understand and explain the graphs (the evidence) you used in the ppt. Prof will ask questions about the graphs if he does not understand them.<br /><br />3 Exam 1 (30%)<br />Mean: 81.1<br />I got 84/100<br /><br />4 Exam 2 (30%)<br />Mean: 84.9<br />I got 94/100<br /><br />Both exam is closed book.<br />Better to understand the graphs and tables on the ppt, they will be asked in the exams.<br />Prof sometimes gives tips during lectures by telling us which graph will be asked.<br /><br />4) Class participation (10%)<br />Mean: 3.6<br />I got 5/5<br />Sometimes prof would take attendance for the participation points.<br />You can also get a total of 5 points through discussion on canvas or answering question on class.",
            "comment_workload": "Not heavy.<br />The only tough part is that right after prof finished the topic, you may have to submit a paper and give a presentation in a few days.<br />Papers of different topics have different deadlines. You can choose topics that don't clash with your midterms.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HHEdXzT6vRLH7iMBpSy1TqzfifOkbaAh",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Harrying",
            "date": "Jan 05, 2023",
            "title": "Good Grade CC but plan ahead for your work",
            "comment_content": "1. Introduction - General introduction of the course<br /><br />2. Family policy <br /><br />Topic 1: Fetal Origin Hypothesis - I am pregnant. How do environmental conditions during pregnancy affect my child's life?<br /><br />Topic 2:&nbsp;&nbsp;Early Childhood Policy - I have a three-year-old son. What are the long-term effects of childhood health and education?<br /><br />Topic 3: Working Mom - What are the long-term effects of working-mom on child outcomes<br /><br />3.&nbsp;&nbsp;COVID-19 Policy <br /><br />COVID-19 Policies - Is it a good idea to close schools during COVID-19 pandemic? What are the consequences of school closure? How can we booster COVID-19 Vaccination? Is Zero-COVID policy a good idea?<br /><br />4. Friend Impacts: How important my friends are in my life? <br /><br />5. Determinants of a life success -&nbsp;&nbsp;What are the determinants of life success? <br /> <br />6. Sex Discrimination and Parental Investment - Does Sex Discrimination still exist? <br /><br />7. Policy failures -&nbsp;&nbsp;How do policy interventions fail to achieve its goals<br /><br />Some of the chapters are quite interesting but some are rather boring. All you need to know is how you can interpret the graphs and recite some key terms like causal inference<br /><br />There are also assigned readings for each chapter. Bryan will pick some graphs from the required reading as exam questions. It should be fairly easy to understand even without lectures. I would say you can skip all the classes if you don't give a shit on attendance points. (The recordings are of really bad quality. The recordings cannot precisely capture his voice.)<br /><br />The coursework is like the elementary level of Econ 3334 but without all the maths and derivation. It just asks you for the intuition or the logic of causal inference. (Correlation Vs Causal) And the exam questions are really easy!!",
            "comment_teaching": "Bryant is funny and he likes to make jokes in class. He likes mentioning his own stories as well. One point to note is that I think he has some accent when speaking English which may confuse you sometimes.<br /><br />He is generous and said that as long as the course evaluation responses reach 80%, he will be lenient in terms of the grade. (I guess he did?)",
            "comment_grading": "1) Policy recommendation papers (20%) -10% for each (you need to pick 2 out of 5 topics to work on<br />The deadlines of the papers are different by topics:<br />Homework 1 deadline: 21 Sep<br />Homework 2 deadline: 12 Oct<br />Homework 3 deadline: 28 Oct<br />Homework 4 deadline: 4 Nov<br />Homework 5 deadline: 16 Nov<br />Homework 6 deadline: 18 Nov<br /><br />As long as you give decent work it's going to be 9.5/10 or above. The mean is sth like 9.3/10 for each.<br />For me: I got 20/20<br /><br />2) Presentation (10%) <br />Everyone gets similar marks.<br />The mean is 8.9/10<br />My group was the lowest, we got 8.5/10.<br /><br />3) Exam 1 (30%) – Mean: 81.12<br />Median: 83\t<br />For me: 96/100<br /><br />Exam 2 (35%)<br />Mean: 84.91<br />Median: 88<br />For Me: 92/100<br /><br />4) Class participation (5%)<br />Mean: 3.64<br />Median: 4.25<br />Me:5/5<br />(you can get parti points for attending lectures!)<br />Overall: A+",
            "comment_workload": "Well, I once thought it was nothing. However, the recommendation papers require you to write around 5 pages each. If you pick on two consecutive topics (like I do) you will need to present on either of the topics while submitting two reports. Please choose your topics and allocate time wisely!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nKgsUnY77Lvv5F7WHXEIurwg459HqE7E",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ustguo3bao4",
            "date": "Jan 04, 2023",
            "title": "Not a 靚 grade course as expected",
            "comment_content": "Topic 1: Fetal Origin Hypothesis - I am pregnant. How do environmental conditions during pregnancy affect my child's life?<br />Topic 2: Early Childhood Education, Health, and Nutrition - I have a three-year-old son. What are the long-term effects of childhood health and education?<br />Topic 3: COVID-19 Policies - Is it a good idea to close schools during COVID-19 pandemic? What are the consequences of school closure? How can we booster COVID-19 Vaccination?<br />Topic 4: Sex Discrimination and Parental Investment - Does Sex Discrimination still exist?<br />Topic 5: Policy failures - How do policy interventions fail to achieve its goals?<br />Topic 6: Determinants of a life success -&nbsp;&nbsp;What are the determinants of life success?",
            "comment_teaching": "Prof. Kim is an interesting person indeed and willing to chat with students, and providing advice to students. <br /><br />But the PowerPoint slides maybe too monotonous.<br /><br />Overall quite an interesting course to study which is very differnt from other economics course, it is more likely to be some huma course (in nature)",
            "comment_grading": "20% Policy-recommendation papers (choose any 2/6 topics)<br />15% Group presentation (1 of the 2 topics chosen above)<br />30% Midterm (covers topics 1-3)<br />30% Final (covers topics 4-6)<br />5% Class participation (f2f lesson attendance/canvas discussions)<br /><br />Midterm and Final are fair grades, and these will basically determine your grade. As the grading is very kind for other areas. It is easy to guarantee a not-bad grading for two policy recommendation paper.",
            "comment_workload": "Not that heavy, as long as you prepare well for the presentation and present well in the lesson.<br /><br />Policy recommendation paper is not that demanding as the TAs give the generous grade for the papers.<br /><br />Most important thing to remember is to revise well and prepare more for the mid-term and final exam as there will affect the grade the most.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QwoteSxNQrx2XvpVpE2qcvYTmvSn9kr4",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Dioxider",
            "date": "Dec 28, 2022",
            "title": "Good grade，Good Prof",
            "comment_content": "Actually, I think this course should be a requirement for all SBM students. Unlike isom 2500 or other statistics course, this course gives you a slope of how to do experiment and research. The course can build you a strong interest in economic researches.<br />If you have finished econ 3334, don’t hesitate, just take it. The content is similar but this course will give you more understanding on econometrics.",
            "comment_teaching": "Kim is absolutely a good professor. He is the most humorous professor I have ever met. And his teaching method is unique, unlike other course, he teaches from the reality problem to methodologies, which is easy to learn and fun.",
            "comment_grading": "1) Policy recommendation papers (20%)<br />The paper is easy to write. I use about 10 hour for each and I got a full mark. Mean is 9 and you may expect a very high mark here.<br />2) Presentation (10%)<br />average presentation is over 8/10. And the sd is really small.<br />3) Exam 1 (30%) – Oct 18 (during class time), and&nbsp;&nbsp;Exam 2 (35%) – 29 Nov (during class time)<br />The exam is where you will get your grade. Attend all class and review for 2 days will ensure at least a B. If you are major in econ or related, it may be a shame if you cannot get A (just kidding). The exam will be full of writing question with limited time. But all answers can be find in his class.<br />4) Class participation (5%)<br />I strongly recommend you to speak up in class. Just actively participate in the class will ensure these 5 percent.<br /><br />I think the grade is good. I got 95/100 with a A+.",
            "comment_workload": "A bit big for non business major student. You may expect 3 hours a week workload excluding the class time.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fVp6b8IbDT1PMXqsbAozc53P7mF3anJZ",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "monak",
            "date": "Dec 12, 2022",
            "title": "",
            "comment_content": "There are 6 topics:<br /><br />Topic 1 Fetal Origin Hypothesis <br /><br />Topic 2 Early Childhood Education Health and Nutrition<br /><br /> Topic 3 School Closure During COVID-19 Pandemic<br /><br /> Topic 3b Covid-19 and Vaccines<br /><br /> Topic 3c Impacts of School Closure in Korea 2022 <br /><br />Topic 4 Sex Discrimination and Parental Investment<br /><br /> Topic 5 Policy failures <br /><br />Topic 6 Determinants of life success<br /><br />All these topics are connected to real life, making the content more interesting. Professor overall focuses on the trends in East Asia, where most of the students come from. Furthermore, situations in HK is dealt with in-depth analysis, allowing students to have a better grasp of the content",
            "comment_teaching": "The professor is very passionate and knowledgeable about the course. He is very engaged in the content he teaches, and he seems to have a lot of experience in the aspect. Students seem to be engaged in class overall too. <br />One of the best professors I met in UST so far.",
            "comment_grading": "Fair grading. Professor seems quite lenient in grading. <br /><br />I got almost above 1sd for both midterm and finals.<br />Full marks for participation and around mean for other assignments. <br /><br />Final grade: A",
            "comment_workload": "Workload is quite light. <br />The only thing that takes a long time are the two policy recommendation papers that are about 5 pages long. <br />But I crammed both in one day, and still got decent grading.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xfLssMc6Eh9vnvV8Higj6JuIrog9VyTT",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Some",
            "date": "Aug 24, 2022",
            "title": "Interesting CC and save your GPA",
            "comment_content": "It's more likely to be Liberal Studies (in HKDSE) than university's economics. Rather than applying theories or calculation, the essay and examinations mainly express your own opinion on certain topics<br /><br />Topic 1: Fetal Origin Hypothesis - I am pregnant. How do environmental conditions during pregnancy affect my child's life?<br />Topic 2: Early Childhood Education, Health, and Nutrition - I have a three-year-old son. What are the long-term effects of childhood health and education?<br />Topic 3: COVID-19 Policies - Is it a good idea to close schools during COVID-19 pandemic? What are the consequences of school closure? How can we booster COVID-19 Vaccination?<br />Topic 4: Sex Discrimination and Parental Investment - Does Sex Discrimination still exist?<br />Topic 5: Policy failures - How do policy interventions fail to achieve its goals?<br />Topic 6: Determinants of a life success -&nbsp;&nbsp;What are the determinants of life success?",
            "comment_teaching": "Prof Kim loves telling his previous career and experience in Korea. 50% storytelling 50% lecture notes. The lecture notes are easy to understand so you can skip lessons if you want",
            "comment_grading": "Policy recommendation papers (20%) - all mean<br />Presentation (15%) - 14/15<br />Exam 1 (30%) - above mean 0.5 SD<br />Exam 2 (30%) - above mean 1 SD<br />Class participation (5%) - full marks<br />Final grade: A<br /><br />It's a new CC in Spring 2022 so the grading has to be good and lenient. Not sure if the grading is the same in the following semesters",
            "comment_workload": "Quite low and Prof Kim gives consultation to the students who need help",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1VAnTJ5S9xAdf3LCtqqMiXY8mFHh9bjq",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SmokingPuddle58",
            "date": "May 29, 2022",
            "title": "Syllabus could be better",
            "comment_content": "This is the only course (AFAIN) with ECON1xxx. And topics are not quite related to micro and macro-economics (What you can expect for a common core course🤔)<br /><br />Contents<br />---<br />Topic 1: Fetal Origin Hypothesis - I am pregnant. How do environmental conditions during pregnancy affect my child's life?<br /><br />Topic 2: Early Childhood Education, Health, and Nutrition - I have a three-year-old son. What are the long-term effects of childhood health and education?<br /><br />Topic 3: COVID-19 Policies - Is it a good idea to close schools during COVID-19 pandemic? What are the consequences of school closure? How can we booster COVID-19 Vaccination?<br /><br />Topic 4: Sex Discrimination and Parental Investment - Does Sex Discrimination still exist?<br /><br />Topic 5: Policy failures - How do policy interventions fail to achieve its goals?<br /><br />Topic 6: Determinants of a life success -&nbsp;&nbsp;What are the determinants of life success?<br /><br />Topic 7: Disappeared, although he mentioned there will be an extra topic in the first lesson, but due to a bunch of holidays and reduced lesson times, he don't have time to include that.<br /><br />For all topic he will post a pre-reading material.<br /><br />Comments:<br />---<br />To be honest the first 5 topics they are quite good, however, the 6th topic becomes very weird. The topic is about determinants of life success, but what he mentioned in the last is life is 80% determined by luck. Hmm, very weird. Once I though life success can be determined by wealth, education, gender and socioeconomic status. <br /><br />Btw, professor, could you please kindly change your password for your exam paper? Only 8 digit number based on dates is not strong enough! I think there already has some people who accessed the final exams file early and it's not fair.<br /><br />All in all, the course syllabus is not very bad ( especially for topics 2,3,4 ), however it could be better.",
            "comment_teaching": "To speak truthfully, his teaching is not bad. He will start his topic with a small talk so that his lesson won't be too boring.<br /><br />However, the professor didn't attend his office hour on time for once. Also, when he changed the zoom link, he did not announced it. I think professor could handle these things better.<br /><br />Finally, this is a new course, therefore he would like to listen to our opinion. Including asking for SFQ opinions and let us to choose the best 3 topics. I think it's very good, especially for a brand new course. <br /><br />Overall, I think his teaching is not very bad, not perfect though, so I would give his teaching a B.",
            "comment_grading": "Exam 1 : Topic 1-3 30%<br />- Mean : 72.72 SD : 14.92<br />- My score : 73.5<br /><br />Exam 2 : Topic 4-6 30%<br />- Mean : 75.35 SD : 13.44<br />- My score : 81<br /><br />Policy suggestion paper 1 : 10%<br />- Mean: 8.1<br />- My score: 9.5<br /><br />Policy suggestion paper 2 : 10%<br />- Mean : 8.64<br />- My score : 9<br /><br />Group presentation : 15%<br />- Mean : 12.93 (Min=12,High=14)<br />- Our score : 13<br /><br />Class Participation Score : 5%<br />- Participate in class activities(talk in chat box, joining the forum), attendance ...<br />- Mean : 3.99<br />- My score : 5 (Easily to get a full mark)<br /><br />Final score : <br />- Mean : 76.01<br />- My score : 82.9<br /><br />- Update on 1/6 -<br /><br />Grade : B+",
            "comment_workload": "The two policy suggestion paper are time-consuming as you need to write 4-5 pages long paper with evidences, luckily only need to write 2 paper. However, there will be only 1 day for you complete the paper after they complete the lecture, so it's quite &quot;chur&quot;. <br /><br />For others, I think it's quite acceptable, just a normal CC course<br /><br />So I think workload worth a 'B'.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "N1v4i00t1lMGt7vWBCnTTFxmVerUovKP",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1494,
                    "name": "KIM, Hyuncheol Bryant",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "CY1",
            "date": "Sep 05, 2022",
            "title": "Exteremly high workload",
            "comment_content": "Topic 1 Fetal Origin Hypothesis<br />Topic 2 Early Childhood Education Health and Nutrition<br />Topic 3 School Closure During COVID-19 Pandemic<br />Topic 3b Covid-19 and Vaccines<br />Topic 3c Impacts of School Closure in Korea 2022<br />Topic 4 Sex Discrimination and Parental Investment<br />Topic 5 Policy failures<br />Topic 6 Determinants of life success",
            "comment_teaching": "Kim's teaching is above average, with decent humor and patient while interacting with students. In additional to the slides, he also used a lot of video for teaching purposes which include many real life examples.",
            "comment_grading": "The grading is under expectation. The &quot;generous grade&quot; he claimed turned out to be B range.",
            "comment_workload": "The workload is dystopian, with two 5 pages reports, a mid term test, a final exam and a group presentation.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}