{
    "error": false,
    "course": {
        "id": 1943,
        "subject": "ECON",
        "code": "4274",
        "name": "Programming Econometrics with R",
        "description": "This course puts statistical theory and econometric method into practice by working with data and cases. Students are required to write their own program with R for summary statistics, data visualization, estimation, and hypothesis testing. The students are also trained to produce table and write report for empirical study. The main objective is to help students develop skills in working with data to support a better business decision or analysis.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2230,
            2110,
            2010,
            1930,
            1830,
            1730,
            1630
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"ECON\" data-code=\"3334\" href=\"/review/ECON3334\" target=\"_blank\">ECON 3334</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.7,
        "rating_teaching": 4.2,
        "rating_grading": 3.6,
        "rating_workload": 3.2,
        "review_count": 10,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 913,
                "name": "HUANG, Yangguang",
                "count": 8
            },
            {
                "id": 1041,
                "name": "TO, Ka Ki",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "SprY7dTElAvstlPvoiy4MOP9CwYb3njG",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 913,
                    "name": "HUANG, Yangguang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "USTAsiaNo1",
            "date": "Jun 08, 2020",
            "title": "Practical and wide coverage",
            "comment_content": "- Theory<br /><br />&gt; Linear regression<br />&gt; Panel data <br />&gt; Decision model<br />* Main coverage<br />&gt; Something extra like non-parametric estimation, clustering, classification (more toward data science)<br />* Only briefly discussed in the last lecture <br /><br />- Skill<br /><br />R programming, you will learn how to do some basic analysis on the above topic by using R (focus of the course)<br /><br />- Comment on the above<br /><br />Definitely a useful course in introductory level<br /><br />On the theory:<br />It can be a good starting point to dig down into other econometrics/data science/machine learning topic since this course is surprisingly comprehensive lol<br />BUT, it is just a good starting point, definitely not solid enough<br /><br />On R: <br />the programming logic, packages, skill you learned here is useful and definitely something you will constantly use if u will be in the field of data analytics<br /><br />** (update 9 Jan 2021 lol)<br />After taking more advanced statistics course (math 4424, 4432 for example) from maths department, I think the content from 4274 is by no mean enough for doing practical, empirical analysis in real-life. I know for average economics student it is already too hard (well, will an average economics student take this course...?? I believe who take it should be somewhat familiar with maths/programming, anyway), still, what I want to emphasise is this course is still too simple for the real world. So, please consider taking more advance course after this if you are interested!!<br /><br />BUT, the coding experience is definitely useful, for myself, I used R repetitively in different courses after taking this, this course allows me to effectively handle different R tasks with no problem :D",
            "comment_teaching": "- Theory part<br /><br />He teaches quite fast, and the contents required some brainpower to process and understand, which might be hard to follow<br /><br />Still, it is understandable since the focus of the course is on programming, so that prof can only briefly conclude the idea like using 40% of the time then immediately jump to programming section for the remaining time<br />You should probably study more / do revision yourself to sure that you get the idea<br /><br />- Programming part<br /><br />Clear instruction and guideline<br /><br />You can definitely follow prof instruction<br />He explains each step (like code logic and command) quite clearly with in-class examples on every new concepts introduced<br />The code he wrote in-class is also available after class<br /><br />** (update 29 Aug)<br />I think I need to state it more clearly. Since this semester is under online learning, all lectures are recorded and you can therefore follow prof bits by bits, it is PARTICULARLY great for this course since you can slowly learn the coding using your own speed, maybe google it or try to code yourself slowly<br /><br />I would say, if you are forced to attain a face-to-face class, in which you need to strictly follow the professor's speed, then it might be more challenging. PLZ EXPECT a worsen experience if under such circumstances. <br />please be reminded that my experience is under an online-learning only situation =)",
            "comment_grading": "** (update 20 Jan 2021)<br /><br />I don't know why I didn't share my score when I wrote this review last year and I am hereby updating it<br /><br />- My score<br />Problem Set1: 9/10<br />Problem Set2: 9.5/10<br />Problem Set3: 9.2/10<br />Problem Set4: 10/10<br />Problem Set5: 10/10<br /><br />Project: 19/20<br />Final: 112/150<br /><br />grade: B+<br /><br />- Statistics<br />Problem Set1: 9.4/10<br />Problem Set2: 9.5/10<br />Problem Set3: 8.8/10<br />Problem Set4: 8.9/10<br />Problem Set5: 8.5/10<br /><br />Project: 17.4/20<br />Final: 107.9/150<br /><br />- Comment<br /><br />I think... seem not good?<br />maybe average?",
            "comment_workload": "- Workload of each section<br /><br />&gt; 5 problem set (programming)<br />&gt; 1 exam (programming)<br />&gt; 1 project (group or individual, if it is for 4670 requirement, it must be done individually)<br /><br />1. problem set<br />75% of questions are just repeating in-class coding examples<br />the rest might need some thinking but generally not hard<br /><br />2. exam<br />Average to hard <br />again, 75% questions are standard, the rest is quite challenging (at least I cannot figure it out lol)<br />Also, it is open book (including any google, cheatsheet, just NO interpersonal communication or asking online)<br />but, the questions are SO WEIRD that I just cannot find any hint or similar code elsewhere<br />(I used to think that every programming question should be asked and answered by someone lol, but it failed)<br /><br />3. Project<br />3.1 For econ4670 requirement:<br />I used the project to fulfill econ4670, and the project can be:<br />&nbsp;&nbsp;&nbsp;&nbsp;1. a replication of an existing paper (from the 10 reference paper or find one yourself) by doing the same analysis using a NEW dataset<br />e.g. you can find a paper that do study using US data and replicate it with UK data, or <br />&nbsp;&nbsp;&nbsp;&nbsp;2. a completely new paper suggested by yourself.<br /><br />I wrote my paper from 0, it is definitely harder to do, u need to find data (surprisingly hard), state your motivation, find some econometrics method (you in fact learned quite a lot of method from this course) to find something interesting, all by yourself.<br /><br />3.1.1 Comment on using the project to fulfill econ4670<br />I think this is the course u should pick to fulfill 4670 since, to be honest, your paper (just the coding part) is just repeating your assignment lol<br /><br />3.2 Not to fulfill econ4670<br />If you DON'T use it to fulfill 4670, you can then form a group (I think you can also finish it individually anyway) and submit a report<br />The report can be:<br />&nbsp;&nbsp;&nbsp;&nbsp;1. a replication of an existing paper using OLD or NEW dataset<br />So, you can simply re-do an existing paper, which is probably the easiest option<br />&nbsp;&nbsp;&nbsp;&nbsp;2. a completely new paper suggested by yourself<br /><br />3.3 Comment <br />So, you HAVE to finish a project anyway, then, why don't you use it for econ4670 if you have to do something similar anyway. Also, I think professor is really nice in giving project score and you will basically pass it for 4670 (no evidence, at least i heard nobody get his 4670 failed from this course)<br /><br />4. Reading<br />There are 10 readings, basically, they are some academic papers using the methodology you are going to learn in the class. In fact, I didn't read it, professor will go through them in class, like, when he talks about linear regression and how to construct a formal table, he will pick a paper also used linear regression and introduce how to do it in a formal way.<br /><br />- Subject comment <br /><br />not TOO hard<br />For me, I am very interested in data science and econometrics and have some experience in programming, the workload is acceptable and worthy (for me, at least I enjoy it)<br /><br />- Objective summary of the review<br /><br />1. it is a high workload course comparing to average courses, it is also a high workload course in economics department, but a low workload course in data science specifically.<br />2. You will learn many contents, but they are the basic only, if you don't try to understand ALL in detail, I think the workload is fair to low<br />3. You will use R intensively!! Don't take it if you hate programming<br />(it is &gt;&gt;programming&lt;&lt; econometrics lol)<br />4. You should consider using the project of this course to fulfil 4670 (my advice)<br /><br />end =)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 9,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rCSU74oXnBirObrz6gROnBIbpMRPoT3M",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 913,
                    "name": "HUANG, Yangguang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Diu ne",
            "date": "Jun 11, 2018",
            "title": "大workload 爛Grade",
            "comment_content": "Content 真係有用嘅，不過學唔學得識就好難講<br />難到不得了，除非你本身識coding",
            "comment_teaching": "太多野教，生死時速咁，要靠自己學<br />原全係智力大測試",
            "comment_grading": "Econ 4 字頭正常就workload 大但好grade<br />呢個係Workload 大，爛grade 仲要得3 cred<br />如果你求個D 或C 就輕鬆嘅，但係如果求B B+ 甚至A 呢就極難<br />利申：所有功課考試，project above mean, 功課佔好多percentage, above mean 好多都係得B-",
            "comment_workload": "都幾多野做，雖然exam open book 仲要比Google 好似好荀咁<br />但係你唔識就Google 完都唔識，所以都係冇9用<br />D 功課難做到pk",
            "rating_content": 5,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bUK2CGwCK8Go9cruI1FCpxRTLx8CAMBZ",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 913,
                    "name": "HUANG, Yangguang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anonymashit",
            "date": "Jan 07, 2021",
            "title": "Difficult Econ-4000 course",
            "comment_content": "The main focus of the course is programming and statistics instead of Economics. There were only 5 chapters and the first chapter is only trying to familiarise yourself with the R program. For the rest 4 chapters, there are not much content. Basically, you are just trying to learn a specific code to solve that specific type of question, no surprise in the final exam which you just do what you did in homework. If you prepare a cheatsheet which has the code format to solve different question, you only trying to replicate the code with some new names. (of course you have to be familiar with the reason to write each line of code)<br /><br />I usually perform well in programming courses so my review maybe biased. Anyway, the content is not much but given that this is a programming course, you may find it difficult while learning but not much to study while revising.",
            "comment_teaching": "Professor Huang can clearly explain different topics to the students and explain the reason and meaning for each line of codes. Yet, given that we have limited time and there were quite a lot of codes to teach, his teaching is a little bit rush. It is almost necessary for you to review the lecture video.",
            "comment_grading": "Pretty bad. I had a B.<br />Homework: full mark<br />Final exam: 92/100 (mean 69.5)<br />Final project: 13/20 (mean 16.9, lowest 12)<br /><br />The final exam last for 3 hours, which is again quite rush. You will usually have some bugs in your program, and if you are lucky you can find it with in like 15-20 minutes. My friend with a high GPA and performed well in the homework, faced a bug in the exam and at the end scored only 62 in the final.<br /><br />For the final project, I don't understand why I score that low. Anyway I'm not commenting on this. Good luck.",
            "comment_workload": "Although it has no midterm exam and only 5 sets of homework, the workload is pretty heavy if you never learned R. It takes a large amount of time for you to understand what the professor and the codes are doing. The homework is not easy as well which you at least need 5 hours to complete 1 homework. (Luckily the homework is a group work)",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0FNvtNgutAUDbYmfxVL4WUNBAkHZ3GbK",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 913,
                    "name": "HUANG, Yangguang",
                    "rating": 1
                },
                {
                    "id": 1041,
                    "name": "TO, Ka Ki",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Testing1234",
            "date": "Jul 28, 2023",
            "title": "Good introductory course for R, also can be used to fulfil 4670",
            "comment_content": "Module 1. Programming boot camp (6 lectures)<br />Module 2. Linear regression (5 lectures)<br />Exam 1<br />Module 3. Causal inference (5 lectures)<br />Module 4. Non-linear models (4 lectures)<br />Exam 2<br />Module 5. Selected topics (3 lectures)<br /><br />First it helps you to get used to R, then you'll learn some regressions and other things.",
            "comment_teaching": "I love the learning method in this course a lot. Professor Huang will lead us to run the codes line by line, with detailed explanations. This really helps a lot for me, a junior programming learner (I do have some Python and Java learning experiences, but a very simple one). He is also very patient in explaining theories and the reason behind. With his patient teaching and all the practical codes, it is a really great learning experience.<br /><br />Jeremy is also a very helpful and friendly person. Remember to attend all tutorials, you can for sure have a better understanding of how R works. It will also help you to finish your assignments.",
            "comment_grading": "Five problem sets, each count 8%, total 40%<br />Can be submitted by individual student or by group with maximum two members. (Grouping can be<br />changed across problem sets.) Submission will be through Canvas. Please submit both your answer<br />(as word document or PDF) and your code.<br /><br />Two exams, each count 20%, total 40%<br /><br />Final project, 20%<br /><br />5 problem sets: basically everyone get full marks<br />exam 1 (full marks 40): median 29, LQ 22.5, UQ 33.5, max 35, me 31<br />exam 2 (full marks 40): median 38, LQ 32.5, UQ 40, max 40, me 38<br />project (full marks 20): median 17, LQ 17, UQ 18, max 20, me 19<br /><br />Overall A-<br />As you can see this course is very competitive, most of the students have some kind of programming background therefore the scores are very high. Also there are only 15 students in this semester. Luckily I secure an A range",
            "comment_workload": "The workload for the assignments and the exams are reasonable. I spent around 4-5 hours on each assignments. If you can work on the assignments by yourself and you understand whats happening during the lecture, your exams will be fine for sure.<br /><br />I'm going to mention more about the project. You can choose whether or not to fulfill the Econ4670 requirement using this project. If you decide to do so, you have to tell professor Huang before some date. There are 3 choices for the project:<br /><br />1. Replicate an existing academic article using the original dataset used in that article.<br />Restate its main result clearly and provide your views and comments. Note that you<br />only need to replicate the main results, not everything. The original article is typically<br />much longer than our requirement.<br /><br />2. Gather a new dataset and study the research question of an existing empirical article.<br />You may use the idea and methodology from the existing work, but the dataset needs<br />to be new. For example, the existing study uses data from 1980s, while you use data<br />from 2000s; or the existing study uses data from United States, while you use data from<br />China. Check whether the result in the old paper holds with a new dataset. Provide<br />your view and comments. If the results are different, try to explain why.<br /><br />3. Conduct a new and innovative research project. Find your own research question, gather<br />a relevant dataset, and use a proper methodology to study it.<br /><br />You CANNOT CHOOSE OPTION 1 if you wish to fulfill 4670 requirement.<br /><br />Professor Huang will provide more details about the marking criteria of the project. In short, choosing option 3 will be the most challenging, but you'll have a higher chance to get good scores. For me, I chose option 3 and used it to fulfill the 4670 requirement.<br /><br />Btw if you put enough effort into the project, I dont think you'll fail the 4670 requirement.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Yfco5wIpfEq9HVxcBt6mR7FJih5J0Zbd",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 913,
                    "name": "HUANG, Yangguang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hhhkkk",
            "date": "Jan 01, 2021",
            "title": "",
            "comment_content": "Mostly focus on programming, instead of theory, so if you are looking for a course that offers rigorous theory training, maybe consider other courses. <br /><br />syllabus:<br />1. Introduction to R Programming <br />2. Data <br />3. Linear Regression<br />4. Causal Inference <br />- Endogeneity and Causality<br />- Treatment effect<br />- Instrumental variable<br />- Difference-in-difference<br />- Panel data<br />5. Limited dependent variable and maximum likelihood estimation <br />- Binary outcome: Logit and Probit<br />- Maximum likelihood estimation (MLE)<br />- Multinomial outcome<br />- Generalized linear model<br />6. Discrete choice model and generalized method of moments <br />- Generalized method of moments (GMM)<br />- Discrete choice model<br />- BLP demand estimation",
            "comment_teaching": "Teaching is generally good, both the professor and TA are quite clear. But do mind that the almost-three-hour lecture can be tiring, considering the course is highly fast-paced. Don't get frustrated when you can't catch up and fail to&nbsp;&nbsp;understand something, as it is unlikely to undermine your overall performance. Usually you will gain a better understanding upon finishing the homework. Plus you can always refer to lecture recording.<br />It is nice that the professor provides us with many papers as examples, which are good reference materials when doing the final projects.",
            "comment_grading": "Grading is surprisingly good, as an ECON course. You don't have to understand every single theory to get a good grade. <br />Almost everyone can get nearly full mark in the problem sets, and the mean of exam and final project are both ridiculously high, especially the exam. Exam questions resembles that of problem sets, and it is open-book and 'open-internet'. Therefore is not difficult if you do spare some effort when doing problem sets.<br />No idea on how the participation is graded.",
            "comment_workload": "Workload not&nbsp;&nbsp;light at all as it is a 4000 level ECON course. Almost one problem set every two weeks, and things can get worse when the exam is approaching. <br />The final project can be stressing if you really wish to do it well.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XMaYcOuqoNWGMI43ncfHSJ3MNqW79Mxe",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 913,
                    "name": "HUANG, Yangguang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fenfen",
            "date": "Jan 23, 2022",
            "title": "",
            "comment_content": "All about econometrics using RStudio.<br />5 chapters in all and focus more on the causal inference contents.<br />There are 2 quizzes but no midterm and final. You are required to do programming during the quiz to solve data.",
            "comment_teaching": "Taught in every detail. Professors just went through every point on the R scripts. He would patiently reply to every question proposed in class.",
            "comment_grading": "Both quizzes were above 1 sd and 17/20 in the final project. <br />Only got a B+ in the end.",
            "comment_workload": "Compared to other 4000+ level ECON courses, this course has a really small workload. Only 5 homework and 1 final project. The final project can be done by a group of two people if you do not want to use this course to fulfil ECON4670.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "L8HdlSmTy9niTGG00thQBlvVCWN10tdm",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Edrick",
            "date": "Jan 20, 2021",
            "title": "Useful course, good teaching",
            "comment_content": "I don't repeat the syllabus here.<br /><br />I agree that for research purpose the theory part is quite brief, and Sunny doesn't require deep understanding to each of the theory. Especially the later part of the course. Which makes the course not&nbsp;&nbsp;that challenging. <br /><br />I would say this course is focus on the practical side of the research purpose - teaching you some basic statistic application in real-world dataset with software step-by-step. <br /><br />I would say better go to Coursera to learn some beginner class about R and Rstudio before enrolling. As some of the people are quite proficient in programming and the course will go through the programming part in a fast manner. But to be honest, being proficient in programming does not guarantee high marks, once you get familiar with R, you can complete most of the question.",
            "comment_teaching": "I quite enjoyed the course since Sunny had made R programming with different statistical test easy to digest. All you need to know is the purpose of the test, when to use and the meaning of the statistics. You don't have to understand a lot about the maths behind every theory and models.<br /><br />However, please be aware that lab comes straight after the lecture. It's really tough to pay attention to the prof throughout the three hours, although he gave us 10 mins break every one hour.<br /><br />If you are interested in research, you can always consult Sunny about your research topic, the approach and different sections, he is eager to provide feedback and advice on it.",
            "comment_grading": "Quite good:<br />Problem set 1-3, 5: 8/8<br />Problem set 4: 7.6/8<br />All means fell around 6.6-6.8<br /><br />Programming exam: 94/100<br />Max: 97<br />Mean: 83.6<br />SD: 13.6<br />Median: 90.5<br /><br />Research paper: 18/20<br /><br />Grade: A+<br /><br />Indeed it's a small class and most of the people get 90 in exam, since the exam is very similar to past paper, and if you did enough revision, 3 hours will be far enough for you to finish.<br />I believe the grading is relatively good comparing to other 4000 lv Econ courses, given that the content is also easier.",
            "comment_workload": "The research paper really requires a lot hard work if you are pursuing A range. <br /><br />Better have some experience in getting data, otherwise it will be difficult for you.<br /><br />Problem sets are just copy class code, sometimes you need to use functions that is not/will be covered in class, send email to TA, who is also helpful.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PCVf6U20p1udXA7tIQME0MoZgiUqQqN2",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "xdxdxd",
            "date": "Jan 19, 2021",
            "title": "Content is useful if you want to start a research career",
            "comment_content": "Can refer to other people.",
            "comment_teaching": "I think Sunny is the best professor I have met in HKUST. Sunny will explain everything clearly. You can really learn something in his course.",
            "comment_grading": "participation: 10%<br />Homework: 40% (5 homework, each count 8%)<br />final exam: 30%<br />project: 20%<br /><br />Homework: full mark <br />final exam: 86 (mean: 83.6, median: 90.5)<br />project:16 (mean: 16.9)<br /><br />MY GRADE: B+<br />The grading is actually not bad. However, since there are many strong and studious student enrolled in this course, it is very competitive. To be honest, the assignment given by sunny is not trivial and require a huge amount of time to finish it but almost everyone can get full mark. While the exam is difficult, the median is as high as 90.5. Therefore, what make this course so competitive is the sample-selection problem. Strong people are self-selected to take this course. However, as this course adopt curved grading but not absolute grading, <br />you really need to outperform in order to ace the exam. You are reminded that many student enrolled in this course have relatively high gpa. <br />Just for your reference, my GDA is above 3.8",
            "comment_workload": "Workload is huge especially if you don't have any prior knowledge in programming. I have learnt python and VBA programming before so I would rather feel easy to catch up with a new programming language. However, if you do not take any programming course before, I would say good luck to you.&nbsp;&nbsp;<br /><br />However, this course is very suitable in fulfilling 4670 requirement if you have strong programming skill. Since I only took 6 days to finish the whole project. And I remember Sunny once said that passing 4670 is not difficult, so I guess he will pass your project regardless of the quality",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BhDm5hqX1Afkt9UldML4kZtxZvRGYihb",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 913,
                    "name": "HUANG, Yangguang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "想當年",
            "date": "Jul 09, 2022",
            "title": "【I don't have time to finish writing it now, modify later】",
            "comment_content": "",
            "comment_teaching": "【modify later】",
            "comment_grading": "Statistics (from Canvas):<br />Problem Set 1&nbsp;&nbsp;Mean: 6.21 High: 8 Low: 0<br />Problem Set 2&nbsp;&nbsp;Mean: 6.21 High: 8\tLow: 0<br />Problem Set 3&nbsp;&nbsp;Mean: 6.04 High: 8\tLow: 0<br />Problem Set 4&nbsp;&nbsp;Mean: 5.93 High: 8\tLow: 0<br />Problem Set 5&nbsp;&nbsp;Mean: 6.13 High: 8\tLow: 0<br />Exam 1&nbsp;&nbsp;Mean: 19.58 High: 34 Low: 0<br />Exam 2&nbsp;&nbsp;Mean: 30.19 High: 40 Low: 0<br />Project&nbsp;&nbsp;Mean: 15.55 High: 19 Low: 0<br /><br />Statistics (announced by the professor):<br />Exam 1&nbsp;&nbsp;mean: 23.5 sd: 5.5 max:34<br />Exam 2&nbsp;&nbsp;mean: 36.2 sd: 4.5 max:40<br /><br />(Note that the mean shown in Canvas is lower than that announced by the professor. I guess the reason is that there are some students sitting the course.)<br />________________________________________<br /><br />For me:<br />Problem Set (8% * 5): 40/40<br />On-campus Exam 1 (15%): 32/40&nbsp;&nbsp;(+1.5sd)<br />On-campus Exam 2 (15%): 38/40&nbsp;&nbsp;(+0.4sd)<br />Project (20%): 18/20<br />Attendance and participation (10%): unknown<br /><br />grade = A",
            "comment_workload": "【modify later】",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MMXblTihPghFYitnMJSJ6EKhL4lIkNzX",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 913,
                    "name": "HUANG, Yangguang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Peter Lau",
            "date": "Nov 27, 2018",
            "title": "Extremely difficult but very useful and practical",
            "comment_content": "The content was extremely useful for doing empirical economic research. I would say fully understanding all the concepts and methodologies taught in this class were very helpful if you would like to be a quantitative economist. I would say the only bad thing about the content was that the professor didn't teach time series econometrics (e.g. ARIMA, VAR).<br /><br />Syllabus:<br />1. Introduction to R Programming<br />2. Data Management and Visualization<br />3. Linear Regression<br />4. Causal Inference (Instrumental Variable, Panel Data)<br />5. Limited dependent variable and maximum likelihood estimation<br />6. Discrete choice model and generalized method of moments<br />7. Standard error and bootstrap, Nonparametric estimation, Quantile regression<br />8. Big data: High-dimensional data and Lasso, Tree-based classification and regression",
            "comment_teaching": "In the lectures, the professor firstly taught the econometric theories. After that, he would use R codes to demonstrate how to do the empirical analysis. The pace was extremely fast and it was very hard to catch up if you didn't take any advanced econometric courses or programming courses before. Sometimes, I also could not follow the professor even though I had taken Panel Data and COMP 2011 before and was taking Time Series Econometric and COMP 2012 in the same semester. However, I would say the overall teaching quality of the professor was good.",
            "comment_grading": "The grading was fair. However, if you want to get a good grade, you really need to pay lots of efforts.<br /><br />My Scores<br />Problem Set 1 (15%): 140 (mean: 89.2, high: 140)<br />Problem Set 2 (15%): 135 (mean: 83.1, high: 148)<br />Problem Set 3 (15%): 100 (mean: 67.8, high: 100)<br />Problem Set 4 (10%): 100 (mean: 66.9, high: 100)<br />In-class Exam (25%): 98/100 (mean: 67.9, median: 69, sd: 20.1, max: 100, min:2)<br />Final Project (20%): 93/100 (no statistics but my friends generally got 60 to 80)<br /><br />Final Grade: A+<br /><br />The problem sets were not easy but they could be worked in groups. Finding good groupmates was very important.<br /><br />The in-class exam was open source and 3 hours long. You could google during the exam. However, you couldn't really find the answer in google and preparation before the exam was extremely important. Before the exam, I wrote a library with 500 lines of codes which could deal with the general types of questions that would be tested (outputting everything required). With the library, I finished the exam in around 1 hour. However, most of my friends didn't have enough time to do the exam.<br /><br />For the final project, I did a time series econometric analysis using augmented dickey fuller test, granger causality test and vector autoregression (VAR) which were not taught in class. The professor would give you higher marks if you could manage to do something new and not taught in class.",
            "comment_workload": "Quite high if you do not have knowledge in programming and advanced econometric. Don't underestimate the difficulty of the course.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 12,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}