{
    "error": false,
    "course": {
        "id": 332,
        "subject": "ELEC",
        "code": "4130",
        "name": "Machine Learning on Images",
        "description": "This course introduces methods to process images on a computer. Topics include the formation and quantification of digital images, morphological image processing, image enhancement in the spatial and frequency domain, image restoration, color image processing, image compression, image segmentation, image representation and description, the image pattern classification using classic machine learning approaches, such as minimum-distance, and Bayes classifiers, Support Vector Machine et al., the modern approaches implemented using deep neural networks. This course provides a new perspective of comparing image processing technique to human vision system in terms of information perception and decision making. Students are expected to obtain knowledge of digital image processing, and hands-on experience on programming and presentation skill through the final project. This course is mathematics-oriented. It requires basic knowledge of linear algebra, calculus and linear filtering. Familiarity with the programming language MATLAB is needed.",
        "categories": [],
        "website": "http://course.ee.ust.hk/elec4130",
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2030,
            1910,
            1810,
            1710,
            1610,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MATH\" data-code=\"2111\" href=\"/review/MATH2111\" target=\"_blank\">MATH 2111</a>",
        "corequisites": "<a class=\"course-link\" data-subject=\"ELEC\" data-code=\"3100\" href=\"/review/ELEC3100\" target=\"_blank\">ELEC 3100</a> OR <a class=\"course-link\" data-subject=\"ELEC\" data-code=\"3200\" href=\"/review/ELEC3200\" target=\"_blank\">ELEC 3200</a>",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"4421\" href=\"/review/COMP4421\" target=\"_blank\">COMP 4421</a>, <a class=\"course-link\" data-subject=\"MATH\" data-code=\"4336\" href=\"/review/MATH4336\" target=\"_blank\">MATH 4336</a>",
        "rating_content": 3.1,
        "rating_teaching": 2.8,
        "rating_grading": 3.9,
        "rating_workload": 3.7,
        "review_count": 10,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1089,
                "name": "WANG, Yiwen",
                "count": 9
            }
        ]
    },
    "reviews": [
        {
            "hash": "ykkeE8fgJREevrRmW5tSBj7lmjucty2p",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1089,
                    "name": "WANG, Yiwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "skwat",
            "date": "Dec 19, 2018",
            "title": "Maybe I should take COMP image processing...",
            "comment_content": "The content is indeed quite interesting and practical. This course (DIP) focuses on the pre-processing rather than higher level process. That means if you want to learn high-level stuff like CV or object recognition, maybe you should take deep-learning courses instead. But still, you can learn some basic processing like feature extraction here.<br /><br />1: Introduction<br />2: Transforms<br />3: Morphological Image Processing (Dilation, erosion, opening, closing)<br />4: Image Enhancement in the Spatial Domain<br />5: Image Enhancement in the Frequency Domain<br />6: Image Restoration (Noise model, deblur)<br />7: Color Image Processing (RGB, CMYK, HSI)<br />8: Image Compression (Huffman, arithmetic, LZW,&nbsp;&nbsp;run-length, predictive, transform coding)<br />9: Image Segmentation<br />10: Object Recognition (SVM, eigenface, PCA)<br /><br />Remark: make sure you have the necessary math skills before taking this course as it seems the Prof. assumed the students already know everything.<br />I try to list them out, [including advanced concepts]:<br />MATH2011, MATH2351: gradient, [laplacian]<br />MATH2111: eigenvector, [Hermitian, unitary matrix]<br />ELEC2600: CDF, gaussian, auto-correlation, [covariance matrix]<br />ELEC3100: DFT<br /><br />Make sure you understand how DFT works in ELEC3100 as this course will extend it to 2D-DFT. You should also have a clear understanding on convolution as we extend it to 2D as well. Don't forget complex numbers, double-integral, MATLAB.<br />Maybe a bit more maths in this course than COMP4421 (as I know people taking COMP image processing), but the major difference is this one does not have the final exam (and waiting-list...).",
            "comment_teaching": "I give 'C' here mainly because of the helpful TA, who always answers questions and replies mail quickly (even at night!).<br /><br />For the lectures, the Prof. simply read the slides. Sometimes she wrote examples on the white board and emphasizing they are important. I have to say, she cannot answer questions so I could only find the helpful TA. We got some questions after class and she just looked annoyed when we asked her. Besides, she did not explain the criteria for the project clearly until we asked her a few times.<br /><br />I somehow lose my interest after mid-term, just as this review title: maybe the learning atmosphere in COMP4421 is better...<br /><br />There is a textbook but not available in the bookstore, the Prof. had reserved one in the library but could not be borrowed out......TBH, the slides are just similar or even worse than many online. So, just google the slides from other universities (for me, I suggest Oxford and Imperial, at least they got detailed examples) and finish the course...",
            "comment_grading": "Homework (4 in total): 20%<br />Midterm: 30%<br />Final Project: 50% (20% report + 30% presentation)<br />Class question: bonus (max 5%)<br /><br />Not sure about the actual enrollment as there are auditing students. But only 11 students appeared presenting their final project...so I bet the class size is small.<br /><br />As the questions in homework are fine and the mid-term is straight forward, only the hardcore project matters. Mid-term score has not released but I asked the TA for paper-checking and therefore I know my score.",
            "comment_workload": "There is not much correlation between the lecture and assessments. Just reading the lecture notes cannot solve all HW questions (esp. the math proving questions). The hardcore project requires MATLAB (you can use other language) programming&nbsp;&nbsp;which I would described it as &quot;freestyle (in a negative way)&quot;.<br /><br />It is a group project, normally 3-4 in a group but the tasks are divided...so strictly speaking, it is an &quot;individual project presented in groups&quot;. There are 2 suggested projects given (moving car license plate reading; eigenface for recognition). you can also come up with your own projects. The report has to be written in ICCV format and listing statistics is a must (don't ask me why).<br /><br />Self-study and prior knowledge are required for the project, workload can be very large if you are not good at coding. I spent 2 weeks in total for coding and report-writing(during the study break and exam period).<br /><br />In terms of workload, majority is from the project. The no. of questions for each HW is within 3-4. For the project, to me personally, I think it is indeed less demanding than some other courses I took. Here at least you can freely pick a topic that you are confident and comfortable. For other courses, you do not even have the freedom to decide and choose.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dBspZPFrm6QmXfaHcCCYwH3fDeE1XN4p",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1089,
                    "name": "WANG, Yiwen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Roy",
            "date": "Dec 16, 2018",
            "title": "Interesting course ruined by POOR professor",
            "comment_content": "Transforms<br />Morphological Image Processing<br />Image Enhancement in the Spatial Domain<br />Image Enhancement in the Frequency Domain<br />Image Restoration<br />Color Image Processing<br />Image Compression 1<br />Image Compression 2<br />Image Segmentation<br />Object Recognition<br /><br />The lecture notes are reused over years, with same template and wordings. Well structured for self study, but not for teaching in lesson. There is not much to mention about the course materials.",
            "comment_teaching": "As mentioned by other students, the prof. taught this course poorly. <br /><br />First, she just read thought the ppt. slide over the whole lecture. You can hardly understand the materials until you review it on your own. No difference with self studying. <br /><br />Second, she kept asking students to do exercise on whiteboard during lecture time, but no one seems to have interest on it. Then later on she said volunteering students can get extra credits, trying to create competition in class, which is an undesirable way just to satisfy her own will. <br /><br />Third, about the final project, it accounts 50% for the course. However, she never released any details for the project, until people asked her. At the beginning, she just mentioned the final project should be related to image processing, and the date of presentation is 14/12. THATS ALL! And the project will be graded individually, rather than as a group. <br /><br />All in all, the prof. was trying to honor those clever students, and dont give a shit to those students cant get a high score. She thought many ways to torture those students with lower score, which is a poor way of education. <br /><br />If you are clever students (GPA 4), you may try this course. <br />If you are normal students who just want to learn something in image processing, go to take the one from CS dept, or learn by yourself.",
            "comment_grading": "Homework (20%), <br />Mid-term exam (30%) <br />Final project(50%)<br /><br />Homework is easy. <br /><br />In the midterm, only a temporary grade according to midterm result was given. No score or any statistics were released. <br /><br />Final grade is not yet released.",
            "comment_workload": "Fine. Not much to do. Only hws and midterm, final project. <br /><br />In the final project, prof. required us to write the MATLAB function on our own, which is a waste of time and unreasonable. I cant understand how this guys think and whether she really wants to teach students, rather just playing tricks on them...",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VLPtXLeQdndYmIlQJFd5wgcDRDLvAazJ",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1089,
                    "name": "WANG, Yiwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "a piece of cake",
            "date": "Jul 24, 2023",
            "title": "Introductory level course on machine learning and detail lecture on image processing",
            "comment_content": "Just refer to other's review for the curriculum<br /><br />In fact this course seldom talks about the machine learning part, and you will only get a 1 - 2 lecture(s) talking about introduction on machine learning techniques. Actually not even techniques but just a brief introduction on some commonly used machine learning method like KNN and CNN. There are one topic talking about the application of ML in image (face recognition), I attended that class but it is not really useful for people who are not working on project with this topic.<br /><br />I think the mid term exam content is relevant so I would like to mention it here. Basically there are not much variation on the questions compare to those example in lecture notes. This course emphasis a lot on the filter and data processing, just literally manipulating the numbers with filter, like convolution and etc. the difference among question encountering in exam is the type of filter and size of kernel.",
            "comment_teaching": "Prof Wang is a really passionate lecturer who tried to make everyone to understand the content, makes me remind the days I had in secondary school math course.<br /><br />She is willing to answer the questions during class, and provide feedback if you needed.",
            "comment_grading": "first HW below average, second and third above average a bit<br />Mid term above average for around 1SD<br /><br />final project no score released, but according to prof's comment she think our group have demonstrated the things we learnt from the course<br />My group project are not those fancy live 2D model but still got an A-<br /><br />BTW this course have bonus point on attendance. Sometimes prof will ask us to write down our name on paper, or give us a simple question as class exercise for bonus mark (no matter you answer it wrong or correct). Prof. Wang will give extra points(like 1 out of the 100 in the total mark I guess) to those who show effort in participating in class.<br /><br />According to my groupmate, they also got a A range grade with good HW+MT grade<br /><br />Although project grade is not released, I think the prof is being generous for giving good grades.",
            "comment_workload": "3 HW 1 Mid Term 1 Final Project<br />HW is like a piece of cake, you can finish it within an hour<br /><br />Mid Term are really easy, as long as you pay attention in class (our kind prof will keep emphasize some example if it will appear on the test paper)<br />However, do make revision or review the HW if possible, time for exam is limited and sometimes you will hesitate if you are applying the filter correctly. <br /><br />The only workload is the final project, you are forced to form group of 3-5 people, working on a group project for 2 months (but actually I just spent around 4-5 hour per weeks) on making the prototype of image processing + machine learning. Prof state feel free to use external library and use whatever tools you want to use. See if you would like to form groups with your buddies or new friends meet in the course.<br /><br />On the presentation date there are groups presenting live 2D models, respect.<br /><br />After the presentation date you got one more week to work on a individual report, just detailly explain the technique you used, how and why, and then you can submit the report (5 A4 page max. including the intro, pictures, elaboration, reference, and etc)<br /><br />One reminder is make sure you find your own part in the group project, don't do the very subtle task like finding image or simply applying 1 filter to remove noise. You need to demonstrate how you used the technique you learnt, but not the working principle of the skill.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RHNnsX8SGFWKPrE90xE970khSrwbblOM",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1089,
                    "name": "WANG, Yiwen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ckkruuse",
            "date": "Nov 05, 2018",
            "title": "For the love of everything good in this world, don't take this course",
            "comment_content": "The book for the course can't be bought in the bookstore and it is not available in the library. You can buy it on Amazon for about 1500HKD. The teacher encourages you to find it &quot;elsewhere&quot; cheaper but doesn't really help.<br />The slides I guess are alright but they are not by any means good.<br />A fellow student and I asked her if it would be possible if we could get some more exercises with solutions to practice the mathematics on before the midterm but I don't know if she didn't understand, didn't care, or was just totally indifferent to our request! In any event she didn't want to give us any material to practice on because, paraphrase: 'how could she give us assignments with solutions, then she wouldn't be able to grade them'. It was as if she just didn't understand that we wanted some exercises to practice on, but I don't know.",
            "comment_teaching": "The long and short of it is that I don't like the teacher.<br />The teacher goes throught the slides increadibly slowly and will then go to make do some stuff on the whiteboard. The teacher will then ask out into the class if someone will answer the question. Since we are a small class and nobody really finds it very interesting we all kind of just sit there ane wait for the teaching to continue. But no, she just stands there and waits till it gets so awkward and cringeworthy that someone breaks and has to do the deed. <br />She tries to encourage us to participate by giving us extra marks but it's not worth it.<br />That unfortunate person breaks by cringe first then goes up and solves the task rather easily.",
            "comment_grading": "I got full marks for the homework I did and it was really easy. If you have taken ELEC3100 you already have moth of the mathematics in place for this course.",
            "comment_workload": "The homework is incredibly easy, thought I stopped following the couse after a few weeks seen as the book was unavailable and the teacher was annoying.",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mPMkgkGaed3i2mzA4CUtU0FHtcrMGIce",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1089,
                    "name": "WANG, Yiwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tttts",
            "date": "Jun 27, 2023",
            "title": "",
            "comment_content": "Week 1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Introduction<br /><br />Week 2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Transforms<br /><br />Week 3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Morphological Image Processing<br /><br />Week 4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Enhancement in the Spatial Domain<br /><br />Week 5&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Enhancement in the Frequency Domain<br /><br />Week 6&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Restoration<br /><br />Week 7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Color Image Processing<br /><br />Week 8&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Compression<br /><br />Week 9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mid-term Exam (tentative schedule)<br /><br />Week 10&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Segmentation<br /><br />Week 11&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Object Recognition 1: Classical Approaches<br /><br />Week 12&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Object Recognition 2: Deep Learning<br /><br />Week 13&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Final Review and A Case study: Face Recognition",
            "comment_teaching": "Prof. WANG tries to explain the knowledge in a vivid level for our easy understanding. But rarely talk about the implementation details of any method that taught in this course.",
            "comment_grading": "Hw:20%(extremely easy, the mean is high and most students get full mark)<br />Midterm:30%(extremely easy, most of the students submit the exam sheet 30 min after the exam starts)<br />Thus, the difference between ppl's grades basically comes from the project.<br />Final Projecr:50%<br />Professor would only release a &quot;level grade&quot; for the midterm(0~4.3). <br />And the final project score won't be released, you can only know your final grade at the end.<br />But the grade is quite satisfactory.",
            "comment_workload": "The hws and exams are too easy that I'm regreted to spend so many time to review for the midterm.<br /><br />The final project can be very interesting since there's almost no limitation and you can choose your own project.<br />The only thing that confuses me is that we need to do the presentation and submit the report in the exam week. For me it's acceptable to do it before the exam week or after, but it'll be quite distracting to do it right during the exam week since you have to keep modifying the project during your review.",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GbFgjDRnL1ydqRAZUVkNfn3r5GjYSCxT",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1089,
                    "name": "WANG, Yiwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "//Snow.",
            "date": "Jun 08, 2023",
            "title": "ok la course",
            "comment_content": "Week 1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Introduction<br /><br />Week 2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Transforms<br /><br />Week 3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Morphological Image Processing<br /><br />Week 4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Enhancement in the Spatial Domain<br /><br />Week 5&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Enhancement in the Frequency Domain<br /><br />Week 6&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Restoration<br /><br />Week 7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Color Image Processing<br /><br />Week 8&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Compression<br /><br />Week 9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mid-term Exam (tentative schedule)<br /><br />Week 10&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Segmentation<br /><br />Week 11&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Object Recognition 1: Classical Approaches<br /><br />Week 12&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Object Recognition 2: Deep Learning<br /><br />Week 13&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Final Review and A Case study: Face Recognition<br /><br />幾有趣",
            "comment_teaching": "good teacher, but dont reli know what shes talking about <br />she want us to do project and separate the work in a parallel way, which Student1 work on part A, and Student2 have to work on part B based on part A...<br />This leads to Student234 work based on student 1 lol",
            "comment_grading": "因為要返工，所以冇乜上堂，到最後原來MT啲題唔駛溫lecture note，背功課足以<br />homework (20%), mid-term exam (30%), and a final project (50%)<br /><br />project need to develop a system on image processing, better think a simpler project but everyone have to work on sth<br />and each of u have to work more and let the teacher see what u have done and tried<br /><br />我MT好低分，靠功課同project拉分，C+算係咁",
            "comment_workload": "not much really, kinda chill",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "J2xU2HwrFqAMtrtfdd39o9SC1p5XQ99S",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1089,
                    "name": "WANG, Yiwen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "life is a shxx",
            "date": "Dec 16, 2018",
            "title": "Be Cherish your hkust lives",
            "comment_content": "Transforms<br />Morphological Image Processing<br />Image Enhancement in the Spatial Domain 1<br />Image Enhancement in the Spatial Domain 2<br />Image Enhancement in the Frequency Domain<br />Image Restoration<br />Color Image Processing<br />Image Compression<br />Image Segmentation 1<br />Image Segmentation 2<br /><br />A kindly reminder : the prof expects students have rich ELEC 3100 and MATH 2111 knowledge. Most of the mathematical model would not teach much. If you want to take this course, think twice whether you are good at maths and MATLAB.",
            "comment_teaching": "The prof has serious problems in her mind and <br /><br />1. always ask students to study the textbook. However, the book cannot be bought. She has given a website about the textbook but cannot open. And then, a student asks her how to get the textbook source. She said: &quot;you can read the book in the library. I have reserved the book and you can read it in library.&quot;<br /><br />2. In fact, she explains the theory of image processing is quite clear and acceptable. But she teaches nothing on MATLAB and few on calculation. However, the assignment and midterm includes calculation mainly and the project is to make a MATLAB on your own. <br /><br />3. she always asks students questions. In the first lesson, she asks students to do self-introduction individually. In the following lessons, if nobody answers her questions, she will force by pointing out a student to answer. <br /><br />4. Unclear guidelines for the midterm areas and project. Only two assignments can be used for practice and there is no other sources provided for midterm revision. For the project, you can do anything you want but it must be about image processing. Nobody knows what should be included in the report.<br /><br />5. It is too weird to hand in the project during exam period and do not mention the project details earlier. If it is to hand in the report and MATLAB coding is fine, however, the project has presentation during the exam period and it occupies more portion than the report and coding. What the xxxx?! Totally waste study break time.<br /><br />The prof is not that kind and like to ff. FF students are clever and like to study after lesson. Don't take ELEC4130 as electives. Killer and bad prof.",
            "comment_grading": "homework x4 (20%)<br />mid-term (30%)<br />final project - report, MATLAB code and presentation (50%) <br />there is a pop-up quiz which can earn bonus but I don't know the bonus is useful or not. She said the bonus is extra credit.....",
            "comment_workload": "The course only consists lesson and does not have any tutorial or extra session for exam review. <br />There are 4 assignments and they are not that difficult. <br />For the midterm, it is similar to those assignments and also not difficult. <br />However, there is a final project instead of final exam. And the project is very difficult and takes time to write the whole MATLAB function relating to image processing. This project is handed in during the final exam period. It may occupy some study break time.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CtjKcaa0hiVhuItbcE9dBXlLbAnHoCWY",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1089,
                    "name": "WANG, Yiwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "I am not 秀毛",
            "date": "Dec 15, 2018",
            "title": "",
            "comment_content": "I think DIgital Image Processing in ECE all over the world share similar textbook and slides.<br />The second version is for free online.<br />http://web.ipac.caltech.edu/staff/fmasci/home/astro_refs/Digital_Image_Processing_2ndEd.pdf<br />But Prof would not cover all of them and it is more like an introduction to DIP.",
            "comment_teaching": "Prof prefers understanding in the class and does not care much about details because she thought we would forget all those details after this semester but those things are quite easy to pick up as long as you have a big picture. What she talks most are like the interview questions level. Those things are quite easy somehow but I think it is better than details all the time and quite practical.<br />Sometimes Prof feels boring about some chapters but actually, I think those topics are still interesting...<br />If you want the details, enjoy those things or the textbook in the project.<br />TA is nice and email response is super fast.",
            "comment_grading": "homework: 5%*4=20%<br />midterm: 30%<br />project and presentation and report: 50%<br />bonuses (quiz?): 1% but we have several, Not sure the details<br /><br />Do not have the final result yet. updated later.",
            "comment_workload": "Before midterm, you can read the corresponding chapter after each lecture but the mathematics would be tested in the midterm but only simple questions. You just need the exercise or some understanding in the textbook.<br />Midterm is similar to homework and simple. Just be careful.<br />After midterm, we have projects rather than final but you can still do some revision after each class if you have time because Prof would ask some concept based bonus some time.<br />The first few homework are easy but the later homework is harder.<br />Projects are difficult if you really want to do one. My team is to build a system to read the car plate. My part is to locate the car plate. There are many methods to begin and you need to compare and do many adjustments. The practical things are hard to handle.<br />You need the report and presentation for the project. The presentation is 5 min each teammate and 15 min for one project. The report is not more than 8 pages.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aTiEjEM4zpDfG5nD2FGF72nBfqOeKMeD",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "life on a beach",
            "date": "Apr 19, 2022",
            "title": "",
            "comment_content": "This course introduces methods to process images on a computer. Topics include the formation and quantification of digital images, morphological image processing, image enhancement in the spatial and frequency domain, image restoration, color image processing, image compression, image segmentation, image representation and description, the image pattern classification using classic machine learning approaches, such as minimum‐distance, and Bayes classifiers, Support Vector Machine et al., the modern approaches implemented using deep neural networks.<br /><br />This course provides a new perspective of comparing image processing technique to human vision system in terms of information perception and decision making. Students are expected to obtain knowledge of digital image processing, machine learning algorithms, and hands‐on experience on programming and presentation skill through the final project.<br /><br />This courseis mathematics‐oriented. It requires basic knowledge of linear algebra, calculus and linear filtering. Familiarity with the programming language MATLAB is needed<br /><br />Prerequisite: ELEC3100 or ELEC3200, MATH2111<br /><br /> <br /><br />The grade is based on homework (20%), mid-term exam (30%) and a final project (50%).&nbsp;&nbsp;A tentative schedule is described as follows.<br /><br />More materials (lecture notes, homework assignment, etc. can be found at<br /><br />https://canvas.ust.hk/courses/40817<br /><br /> <br /><br />Week 1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Introduction<br /><br />Week 2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Transforms<br /><br />Week 3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Morphological Image Processing<br /><br />Week 4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Enhancement in the Spatial Domain<br /><br />Week 5&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Enhancement in the Frequency Domain<br /><br />Week 6&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Restoration<br /><br />Week 7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mid-term Exam<br /><br />Week 8&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Color Image Processing<br /><br />Week 9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Compression<br /><br />Week 10&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Image Segmentation<br /><br />Week 11&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Object Recognition 1: Classical Approaches<br /><br />Week 12&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Object Recognition 2: Deep Learning<br /><br />Week 13&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Final Review and A Case study: Face Recognition<br /><br /> <br /><br />Text Book:<br /><br />Digital Image Processing<br />by Rafael C. Gonzalez and Richard E. Woods,&nbsp;&nbsp;Prentice Hall, 4 Edition, 2017.<br /><br /> <br /><br />References:<br /><br />Digital Image Processing using Matlab<br />by Rafael C. Gonzalez, Richard E. Woods, Steven L. Eddins Prentice Hall, 2004.<br /><br /> <br /><br />Textbook webpage (a lot of online tutorials) http://www.imageprocessingplace.com/",
            "comment_teaching": "A lot of content is taken out of the textbook",
            "comment_grading": "",
            "comment_workload": "Final Project requied<br />Mid Term Exam<br />Few Assignments",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "JBawq6r4WcamRvBPATmQYU3hkC16Fwmw",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 1089,
                    "name": "WANG, Yiwen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "zyangbi",
            "date": "Sep 12, 2019",
            "title": "GOod I think",
            "comment_content": "This course introduces methods to process images on a computer. Topics include the formation and quantification of digital images, morphological image processing, image enhancement in the spatial and frequency domain, image restoration, color image processing, image compression, image segmentation, image representation and description. This course is mathematics-oriented. It requires basic knowledge of linear algebra, calculus and linear filtering. Familiarity with the programming language MATLAB is needed.",
            "comment_teaching": "Firms are indeed moving out of China but are not flocking to the United States, undermining the central promise of Trump’s trade war. Cheaper labor markets in Southeast Asia are the ones benefiting the most amid the trade war that has ratcheted up duties on Chinese goods.",
            "comment_grading": "n fact, the administration’s actions have prompted Kent International to still rely on its joint venture partner, Shanghai General Sports, to supply more of its bicycles.",
            "comment_workload": "eneral is planning to build a factory on a plot of land in Cambodia. By the end of year, 40,000 square feet of production capacity will be complete.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 23,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "vKOqILSquB5o9s4ehZJJc1ZrBqM64z7e",
                    "name": "ELEC4130",
                    "format": "pdf"
                }
            ]
        }
    ],
    "composer": []
}