{
    "error": false,
    "course": {
        "id": 323,
        "subject": "ELEC",
        "code": "3500",
        "name": "Microelectronic Devices and Technology",
        "description": "This is an introductory course for semiconductor device operation principles and technology in common electronic products such as integrated circuit (IC), digital camera, solar cell, memory elements, smartcard, etc. Topics covered include Semiconductor properties, IC fabrication technology, PN junctions, Bipolar Junction Transistors (BJT), MOSFETs, CCD and the future technology trend in the electronic industry.",
        "categories": [],
        "website": "http://course.ee.ust.hk/elec3500",
        "credits": 4,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1830,
            1810,
            1710,
            1610,
            1510,
            1410
        ],
        "prerequisites": "(Level 3 or above in HKDSE 1/2x or 1x Chemistry OR a passing grade in HKCEE Chemistry OR CHEM 1001 OR <a class=\"course-link\" data-subject=\"CHEM\" data-code=\"1004\" href=\"/review/CHEM1004\" target=\"_blank\">CHEM 1004</a>) AND <a class=\"course-link\" data-subject=\"ELEC\" data-code=\"2400\" href=\"/review/ELEC2400\" target=\"_blank\">ELEC 2400</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.56,
        "rating_teaching": 4.5,
        "rating_grading": 4.94,
        "rating_workload": 4.5,
        "review_count": 18,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 192,
                "name": "CHAN, Man Sun",
                "count": 17
            }
        ]
    },
    "reviews": [
        {
            "hash": "iE9qfdpezjIjWD36hLApMhnyOMGOpBrN",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AY",
            "date": "Dec 26, 2016",
            "title": "",
            "comment_content": "Excellent Professor. You can learn much thing not only about semiconductor but also some philosophy as an engineer.<br /><br />Students will be able to <br />1)communicate with the language of semiconductor (diode, BJT, MOSFET, doping, Fermi-level, drift-diffusion etc.<br />2)operate a probe-station<br />3)describe the basic principles of some common circuit active elements plus photo active devices (solar cell, LED, CCD)<br />4)describe the effects of changing the key physical parameters of diode, BJT and MOSFET on the trend (increase or<br />decrease) of the output characteristics<br />5)match a given model to measurement data by selecting relevant parameters",
            "comment_teaching": "Perfect.",
            "comment_grading": "• 8% Homework<br />• 18% quizzes<br />• 9% Labs <br />• (55-x)% final exam<br />• x (≤ 15%) in class iPRS question each worth 0.3%<br />• 10% bonus for submitting all the works and attending all labs<br /><br />Please don't miss the prs question. If not, you can not get the 10% bonus. It can make you down one grade.<br /><br />We dont know the mean or statistic of final exam. My friend got 34/100 in final and average 2.5/6 in quizzes. Finally, got A. It seems that the average grade is B.<br /><br />Don't worry about F/D grade. If you have finished all labs, homework and prs questions even they are zero marks, you must get C as bottom.<br /><br />If you are strong enough to get 80% in final exam, you will get A grade. However, it seems that no one can achieve it.",
            "comment_workload": "No mid-term. In the final exam, all questions are difficult. Don't be afraid that you know nothing. Many people are same to you. However, make sure that you should answer some simple question correctly. These simple question are similar to homework, prs and quizzes. You should listen to the prs question answer, quizzes solution in tutorials. Do the homework by yourself. It is helpful for you to make your mind clear.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yaejej0oKaNwv67YmHod34u0Dp5FiV1u",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tim_27",
            "date": "Jan 29, 2018",
            "title": "",
            "comment_content": "Covers a broad concept of Semiconductors including various types (PN Junction, BJT, MOSFET), their function, operation, and how changing their various properties affect their usage. <br /><br />He tends to focus more on the broader concepts and emphasizes the learning process rather than hardcore calculation. Be prepared to use the equations given during lectures and pay attention to them, however, the HW problems are not simply &quot;Plug and Chug&quot;. The HW sets are short usually, but challenging and require deeper contemplation of the material. <br /><br />Various PRS questions given usually every lecture count for attendance and take a certain percentage off your Final Exam's weight for every correct answer. You should take advantage of these as it's easy to get them right. <br /><br />Several 10-minute quizzes given throughout the semester before Lecture. <br /><br />4 Labs with an interesting first lab in which you take a tour of HKUST's Nanofabrication Laboratory. Get to see the real process of creating a silicon wafer from the first step to completion. <br /><br />Final Exam: Open book, notes, computer, anything really goes, however, it is still challenging. It's a hard exam, but if you have done all the other parts of the course well, things should be fine.",
            "comment_teaching": "Perfect.",
            "comment_grading": "The grading can be quite lenient as long as you do what is asked to complete the assignments on time with a fair understanding of the material. They are mostly looking for the process of solving the problems and showing the steps to demonstrate your understanding.",
            "comment_workload": "The workload is fair with the HW being short but hard and labs only every other week. Quizzes require a good amount of studying to prepare for, but besides that, the course does not demand any excessive work.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wIZUTDGXdc0ikSPFRXH4BRZ3adQnKzGr",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "richardghy",
            "date": "Jan 30, 2023",
            "title": "",
            "comment_content": "Very informative content, with difficulty",
            "comment_teaching": "Man Sun's lectures are easy to understand, and although there are many formulas in this course, it does not seem boring. The class is mainly a review of the videos that are usually required to be watched",
            "comment_grading": "You can pass if you attend all quizzes, and you can get A+ if you pass a certain score line in final",
            "comment_workload": "the workload is not too big, and there are three labs, if you want to take a better grade need to spend time understanding the content because final is difficult",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TnapWcDVrPSttCQMSRmOlx89VTUotPKR",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "pogger",
            "date": "Dec 30, 2021",
            "title": "",
            "comment_content": "Materials of this course (videos,notes) are all uploaded to edX which you can review it anytime you want. <br /><br />The course covered:<br />- PN Junction's: formation, carrier actions, real I-V characteristics, equivalent model<br /><br />-BJTs' : operations regions, current component, performance parameters, non-ideal effects, physical structures, equivalent model<br /><br />-MOS, MOSFET: calculation of charge distribution, intro to its application (CCD,CMOS), C-V characteristics, subthreshold region current, classical models + carrier velocity saturation, mobility degradation models<br /><br />Each lecture will cover one set of videos with a supplementary note, the videos contains a lot of 3D animation which help you to understand some abstract theories and equations with their actual physical meaning. But sometimes the theories can be quite mind-bending and confusing, I have to take some time to figure out what's going on.",
            "comment_teaching": "I think the teaching of Professor Chan is great imo.<br />He explain the confusing and abstract theory quite well with the fundamental physical properties of BJT and MOSFET, if you can fully catch up to point from the videos and stated from the lectures, I think you will no longer need to rely on the equations to understands the properties of semiconductor. <br />There is also a Canvas discussion group to allow raising questions, and we can always get the response very quickly.",
            "comment_grading": "tl;dr: fair grading, i think most of the students can get the grade they want<br /><br />No midterm, but there is IPRS on each lecture and progress check quiz before lecture, the majority of the questions are in MC, which is relatively simple and straightforward.<br /><br />Every 2 weeks will have a small quiz on canvas, harder than IPRS and progress check one.<br /><br />The final are very difficult imo and I really got headache during the 3hrs exam, the mean of exam score is 45 only, so you can expect your score will not be very high and it is totally fine",
            "comment_workload": "Acceptable workload<br /><br />Before each lecture there will be a progress check quiz, which only cost you at most 1 hour (including reviewing lecture videos)<br /><br />5 HW in total, <br />will be explained during lectures, so you can finish in about an hour if you have attend the class.<br /><br />3 LAB in total, <br />will be explained clearly step by step in lectures as well, so you can finish it quickly if you pay attention on the class after the lab session",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GdEW1hRTxwA4mTB7e7GOwc3f0iLCxwf8",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YK",
            "date": "Dec 20, 2021",
            "title": "",
            "comment_content": "The content itself is nearly the same as previous semesters. If you have the ability to get materials from people who studied this course, you will definitely have some advantages.<br />As stated by other classmates, it contains <br />1. PN-junction<br />2. BJT<br />3. MOSFET<br />The professor is trying to use one single set of concepts to explain these three devices. Better to understand them clearly and ask questions if you found sth that you don't understand. Otherwise, you may face serious trouble in understanding the later part of the course materials.<br />Publishing the materials on this platform may not be suitable.<br />But this bilibili link can get you through the whole course. This channel is created by Professor Chan to let public audiences study the course materials.<br /><br />https://space.bilibili.com/1093243005?share_medium=android&amp;share_plat=android&amp;share_source=COPY&amp;share_tag=s_i&amp;timestamp=1619677001&amp;unique_k=fYxqrZ",
            "comment_teaching": "The teaching is excellent but needs to spend a lot of time to understand the course materials if you really want to know better about the semiconductor.<br /><br />Professor Chan used animations to illustrate difficult concepts in semiconductors, which certainly helped a lot. However, the content is very compact. You will understand nothing if you try to watch the video at 1.5/2x speed. Or even, you need to watch the videos multiple times to get all the details you need.<br /><br />Professor Chan always encourages us to ask questions in the Canvas discussion. He/his team will respond to questions quickly. We can also learn sth by looking at the questions asked by classmates.<br /><br />The video notes will be provided through edx for us to take reference. But the video notes always have some important information missing. We need to jot down those missing points in order to get all things in the notes.",
            "comment_grading": "You can get high marks in progress checks, assignments, and lab if you have good teammates.<br />The things you cannot control are:<br />1. in-class questions <br />With discussion, you may get around half of the questions correct.<br />(if you are powerful enough to find a person who studied this course, and he/she marked down all the answers. Then you can nearly get full marks - because he sometimes will suddenly change the question in class)<br />2. bi-weekly quizzes <br />Be prepared to get low score, and this will be fine<br />(if you can find a person who saved the quiz explain videos, you can have some advantages. But I believe he will change question in next year)<br />3. Final exam <br />Be prepared to get a low score and not enough time to finish<br />(Having a good teammate to combine and organize materials for you will definitely help a lot. The exam is open to anything, if you have time and believe your teammates, you can get additional info from them. But each of us will get slightly different exam questions.)<br /><br />Some of us got scores similar to the mean in the final exam and got a grade A. The grade is very great and fair.<br />Difficult to get A+, requiring 70% in final exam, where the mean is just 45",
            "comment_workload": "You are highly encouraged to study in a team instead of an individual.<br /><br />This course encourages discussion and collaboration. For example, each one of you has 3 chances to submit a progress check question. If you only have 3 chances, it is definitely not enough. However, if you study in a team of 10, you will have 20 chances to try/guess (You don't have 30 chances, since you need to guarantee the last submission to be full mark)<br /><br />During inclass iPRS and quizzes, you can also discuss with your groupmates to get more information or prevent making mistakes. <br /><br />Even you can discuss or collab with your groupmates, watching videos and progress check questions will be the main workload. Because you need to do them nearly twice a week.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gEilxzguCYX9RhKdwCn5hsOYu9Bj2a3e",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "T.T",
            "date": "Dec 15, 2021",
            "title": "A recommended course",
            "comment_content": "PN Junction<br />Bipolar Junction Transistor<br />MOSFET<br /><br />More conceptual than the calculations. You need to fully understand what those variables how to affect the behavior of the semiconductor.",
            "comment_teaching": "It is a blended-learning course. You need to watch the online video before going to the lecture. There would be a pre-class exercise. The concepts are not easy to understand, but once you watch the video several times, then you will get what the video means.",
            "comment_grading": "Assignments x 5 (9%)<br />Lab x 3 (9%)<br />Pre-class exercises (10%)<br />In-class exercises (10%)<br />Bi-weekly quiz (12%)<br />Final Exam (40%)",
            "comment_workload": "The workload is still fine as long as you form a study group. The professor encourages us to discuss with each other the course contents.<br />The only workload is the IPRS, and every lesson would have it. So you need to attend all the lessons.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "00byqoLKOIeguAtE7Wt6Y1sIik15dRhr",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "garbage",
            "date": "Dec 15, 2021",
            "title": "A course that trains your intuition.",
            "comment_content": "Mainly:<br /><br />1. PN-junction<br />2. BJT<br />3. MOSFET<br /><br />If you have truly understood this course, you would find that BJT and MOSFET are just fancier PN-junctions combined together in the end.",
            "comment_teaching": "It requires you to watch certain videos on edx before you come to lectures. In lectures, you need to answer a lot of iPRS questions based on the videos you have watched. The videos are very easy to understand at most times with vivid animations. However, there are some parts where the mechanisms are hard to understand for beginners where you need to pause and ponder.",
            "comment_grading": "10% iPRS<br />12% 3 labs<br />12% 5 assignments<br />12% 5 quizzes<br />40% final exam<br />10% for completing 80% iPRS questions, all the labs, assignments, quizzes and final exam<br /><br />Easy to get A range but hard to get A+.<br />If you get something like 70 in the final you would certainly get an A+, but the mean is only 45.<br />The final exam this year is pretty easy as you can get a nice result if you understand every iPRS and quiz question.",
            "comment_workload": "The workload is not low if you really want to learn this course well instead of just fulfilling your requirements or getting a decent grade.<br />There are 5 quizzes in total and you need to attend the lectures for the iPRS questions every week.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Qc3vnbDfxBBTLP8B58Li8CLVt0ntJ5C6",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Observer",
            "date": "Feb 22, 2019",
            "title": "",
            "comment_content": "The content is interesting even though it is a bit difficult.&nbsp;&nbsp;You can learn a lot of you spend enough time on it.",
            "comment_teaching": "The teaching is done in a flip-classroom style which is interesting.&nbsp;&nbsp;And the animation in the video makes the difficult concept easy.&nbsp;&nbsp;But only the first have of the lecture has video content.&nbsp;&nbsp;The second part is not ready in this semester.",
            "comment_grading": "Very fair at the end, but not very clear in the beginning.&nbsp;&nbsp;Especially on the grades for viewing video.&nbsp;&nbsp;But finally, most people got the grade they deserve",
            "comment_workload": "The class focus on learning instead of drilling.&nbsp;&nbsp;The homework is minimal, but a lot of time is needed to re-watch the video.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "co0k9Td5CNcrHt7irxcMnZiXBIfSMOS0",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "西哥",
            "date": "Jan 23, 2019",
            "title": "",
            "comment_content": "During class<br />•concept check with iPRS and those will be included in your final grade<br />•exercise together that you will turn in right after class (yes, no more homework to bring home)<br />•There are supplementary material concerning more recent development that are not covered by the notes<br /><br />Laboratory<br />•There are only 4 labs that are scheduled at approximately once every two to three weeks<br />•A simple report have to be submitted after each lab<br /><br />Quizzes<br />•once every 2 weeks to clear up of concept<br />•open printed/written material, ~10 minutes with short questions<br /><br />Final Exam<br />•not testing your knowledge, but how you apply your knowledge<br />•interview and IQ test like (85% thinking, 15% writing)<br />•open all printed/written material",
            "comment_teaching": "Students need to watch lecture videos before attending the classes because it is in blended learning mode. Most of the course contents are pre-recorded and available online through edx.org",
            "comment_grading": "•10% Viewing all videos<br />•10% Homework<br />•15% quizzes<br />•10% Labs<br />•45% final exam<br />•10% bonus for watching all videos on time, submitting all labs, taking all the exams, attempted 80% of classwork including the PRS questions<br />•if you get the 10% bonus points, you will likely get at least a “C” for the class",
            "comment_workload": "Workload is low because we don't have any homework and tutorial in this semester. What we need to do is attending all classes and 4 labs.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DuUy1sAB7syzb7Z71kKhgOLXyFYUuH0u",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "braw",
            "date": "Jan 23, 2019",
            "title": "",
            "comment_content": "Pretty vague ideas including:<br />- Motion of carriers in a semiconductor material<br />- Operational principles of common electronic devices (PN Junction Diode, Schottky Diode, Photo Diodes, Solar Cells, LED and Bipolar Junction Transistor)<br />- Parameters for certain design specifications<br />- Circuit models of some common electronic devices<br /><br />Laboratory<br />- 4 labs scheduled at around once every two to three weeks<br />- SImple report to be submitted after each lab<br /><br />Quiz<br />- once every other week to clarify concepts<br /><br />Final Examination<br />- open printed/written materials<br />- similar to concept checks on edx",
            "comment_teaching": "Changed to semi-blended learning this semester. Most of the course contents are pre-recorded and can be viewed on edx at our own pace. During lecture time, Professor would guide you through class works and iPRS for concept checking. There is a quiz on each topic every other week.<br />No tutorial this semester.",
            "comment_grading": "10% Viewing all videos<br />10% Homework (N/A this semester)<br />15% Quizzes<br />10% Labs<br />45% Final exam<br />10% &quot;Bonus&quot; for watching all videos on time, submitting everything, attempted 80% classworks and iPRS",
            "comment_workload": "Pretty low comparing to other 3000-courses.<br />Must attend most of the lectures to attempt 80% classworks and iPRS.<br />Must hand in all reports or else professor may consider giving you a lower grade.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YtEawbqDqfroUKixufwxmeJuPJ4b4iJB",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tspo",
            "date": "Jan 28, 2018",
            "title": "Nice grad",
            "comment_content": "About semi conductor, the working principles inside.",
            "comment_teaching": "Prof. Chan speak a little bit fast, but easy to catch up. Teach with heart.",
            "comment_grading": "40% in final can get an A if you have hand in all the work and having average marks.(for reference only)",
            "comment_workload": "Iprs for attendance, around 2 for each class. 4 easy labs, 6 homeworks, 6 quizes and 1 final.<br />If you have hand in all the work on time, taking all IPRS and do all the quizes, you can get at least a C in this course. If you can get 80% in final exam. You will directly get an A.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "d21myqpmr9Ory1Z5wTflX7M86YpU7i05",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HakuSHL",
            "date": "Jan 13, 2018",
            "title": "",
            "comment_content": "Introduction to semiconductor physics. Topics include PN junction, BJT, MOS Capacitor, CCD, MOSFETS, scaling of devices.",
            "comment_teaching": "Mansun is a very good professor. He tried to give a qualitative explanation and get rid of the difficult mathematics, which is easier to understand. The content of his explanation is clear, but his speaking speed is quite fast and the pronunciation is sometimes not very clear. You need to pay more attention in the class.",
            "comment_grading": "8% Homework<br />18% quizzes<br />9% Labs<br />(55-x)% final exam<br />x% PRS, 0.3% for each question<br /><br />Hand in everything can guarantee a C and 10% bonus. Also, if scoring &gt;80% in the final exam, you will automatically get an A even you miss all other assignments, but no one can achieve this in the past 2 years.",
            "comment_workload": "No mid-term exam. One quiz and homework every 2 weeks. There are total 4 labs. It will take about 20 mins to record the result in the lab, and an hour to finish the given excel data sheet. All the assessment is open everything. If paying enough attention in class and clear the concept immediately after each class, you almost need not to do any revision. However, you will still don't know many questions in exam, but this is the same for everyone.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0BCD7vUa3ibnZih5zamFBsIWIazYnpRp",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bs",
            "date": "Jan 10, 2018",
            "title": "",
            "comment_content": "basic concept about device is covered, such as diode, BJT, MOSFET. But don't expect it is very in-depth, after all this is only a 3xxx course",
            "comment_teaching": "the professor explain the concept clearly. the lecture is very useful; however, the tutor is not not good. Don't expect you can learn something from the tutorial. Mostly the tutorial notes is copied from the lecture note.",
            "comment_grading": "very good grade.",
            "comment_workload": "workload is less. only a few lab throughout the semester, but the homework is hard. And you cannot skip the lecture as there is PRS question regularly in every lecture.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SO4ZAMLGPDeWbROlZZ1e8ZMBWSr4pxuB",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mkayaalp",
            "date": "Nov 04, 2017",
            "title": "",
            "comment_content": "The focus is on the physics and chemistry of semiconductor devices rather than circuit models and analysis. PN Junctions, BJTs, MOS Capacitor, MOSFET Devices and applications.",
            "comment_teaching": "No textbook, slides are explanatory enough. iPRS questions every class, the instructor is fairly good at teaching.",
            "comment_grading": "If you submit all your hws and labs, attend all quizzes and attempt %80 of iPRS questions then you get at least C from this class.",
            "comment_workload": "Homework for every second or third week. Labs take around 20 mins, then you need to calculate some values based on your data in a excel file-no prelabs.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3eNs2KE8w4hAOQNS32ahYi9Y1LVC4PFX",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ivanctw",
            "date": "Jan 06, 2017",
            "title": "the easiest course to get A range ever in ust",
            "comment_content": "depends on if you are interested in the topic of semiconductor or not. No matter what, the main point of this course is not its content, but its grade.",
            "comment_teaching": "clear, easy to follow, detailed step on every question. the professor and TAs are nice",
            "comment_grading": "excellent, the easiest course to get A range ever in ust<br />you must do something wrong if you cannot pass the course<br />you must be too lazy if you cannot get B range or above",
            "comment_workload": "6 hw with official solution<br />6 in class open everything quizzes<br />4 labs with guidelines<br />attendance PRS<br />open almost-everything final",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "P6ngVgnRuCrHesnBvsfMNpGuVXVVFRDT",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ken",
            "date": "Jan 27, 2016",
            "title": "",
            "comment_content": "This is an introductory course for semiconductor device operation principles and technology in common electronic products such as integrated circuit (IC), camcorder, solar cell, memory elements, smartcard, etc. Topics covered include Semiconductor properties, IC fabrication technology, PN junctions, Bipolar Junction Transistors (BJT), MOSFETs, CCD and the future technology trend in the electronic industry.",
            "comment_teaching": "Man Sum is a good professor.<br /><br />He focus on qualitative knowledge rather than quantitative calculation.<br /><br />Final Exam and quizzes are open to everything",
            "comment_grading": "Mean : A-<br /> grade distribution:<br />• 10% Homework<br />• 24% quizzes<br />• 16% Labs<br />• 50% final exam<br /><br />-get an automatic A if&nbsp;&nbsp;score over 80% in the<br />final",
            "comment_workload": "",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "v4RZ2cgIwvgkwb6YyJdpGBHbQtxtObVI",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "莫仔",
            "date": "Jan 09, 2018",
            "title": "",
            "comment_content": "Three main topic: PN junction, BJT, MOSFET.",
            "comment_teaching": "Professor teaching too fast and many people didn't focus on what he said. Teaching assistants cannot answer all the questions. Therefore, you can ask professor your question.",
            "comment_grading": "You can get at least c grade when you finish all the homework, lab report, finish all the quiz and answer 80% PRS. I haven't attend one lab and it doesn't affect my grade. TA give me back the lab data and I can finish my lab report.",
            "comment_workload": "4 labs. First lab is two hours and other three labs are 20 minutes. You need to copy data and do some simple calculations to finish lab report. 6 homework and you can attend tutorial session to get the answer. 6 open notes, open computer quiz.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bnnj7fzWXLhp7dXQVQQBUnySMd0XBDdA",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 192,
                    "name": "CHAN, Man Sun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LSL",
            "date": "Jan 10, 2018",
            "title": "",
            "comment_content": "little understand of chemistry will help more in this course",
            "comment_teaching": "the understanding of semiconductor is hard and required students to spend a lot of time to read the lecture to understand.",
            "comment_grading": "the final exam is open everything. students can do nearly everything except talking and taking photos. however, it is impossible to google for the exam question since all the question is newly designed by the prof. students should work hard on the lecture and have a clear understanding in order to get a good grade.",
            "comment_workload": "students must hand in all the homework in order to get a good grade.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}