{
    "error": false,
    "course": {
        "id": 322,
        "subject": "ELEC",
        "code": "3300",
        "name": "Introduction to Embedded Systems",
        "description": "This course is designed to teach techniques on how to integrate machine-level software and hardware in ARM-core microcontroller based systems. It makes use of industry-standard techniques and technologies, from which students can interface, design and program microcontroller systems. The task of the course will be to complete five laboratory experiments which address different aspects of hardware/software interfacing, and one large microprocessor/microcontroller based project which should result in the design and implementation of a small working embedded system.",
        "categories": [],
        "website": "http://course.ee.ust.hk/elec3300",
        "credits": 4,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"2611\" href=\"/review/COMP2611\" target=\"_blank\">COMP 2611</a> OR <a class=\"course-link\" data-subject=\"ELEC\" data-code=\"2300\" href=\"/review/ELEC2300\" target=\"_blank\">ELEC 2300</a> OR <a class=\"course-link\" data-subject=\"ELEC\" data-code=\"2350\" href=\"/review/ELEC2350\" target=\"_blank\">ELEC 2350</a> OR <a class=\"course-link\" data-subject=\"ISDN\" data-code=\"4000F\" href=\"/review/ISDN4000F\" target=\"_blank\">ISDN 4000F</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.96,
        "rating_teaching": 3.74,
        "rating_grading": 3.44,
        "rating_workload": 2.41,
        "review_count": 27,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 190,
                "name": "WOO, Kam Tim",
                "count": 20
            },
            {
                "id": 191,
                "name": "WU, Chi Hang",
                "count": 5
            },
            {
                "id": 1529,
                "name": "ACHUTAVARRIER PRASAD, Vinod",
                "count": 5
            }
        ]
    },
    "reviews": [
        {
            "hash": "LC7dwHUQMZvlAQBKYEGi6YVDQrq1mdQw",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "高海千歌",
            "date": "Dec 21, 2022",
            "title": "Sorry to say, but I just hate this course...",
            "comment_content": "Embedded system. But most of the time they focus on concept and teach very little on how to operate the embedded system practically in the lecture. Then, you need to figure them by yourself during the lab. Tada<br /><br />I feel like I learning nothing after this course. However, the thing which really terrified me is not the teaching or the content.<br /><br />IT IS THE FUXKING PROJECT.<br /><br />This is the ultimate problem maker of this course. It is a complete torture for me. And I really hope that it can fuxk off when I am dealing with the course throughout the semester.<br /><br />When Fox is designing this course. He probably thought that:<br />a.) We are all come from robotics team who are very passionate, enthusiastic and sophisticated in embedded system.<br />b.) We are genius or prodigy who have infinite amount of creativity and organizational ability to make a stunning invention in short time to impress the teaching team with extremely high standards. <br />c.) We have infinite amount of time every day so that we can have enough time to deal with the complex project<br />d.) We only enroll ELEC3300 in the semester so that we can put all our time to deal with this course<br /><br />Unfortunately, none of them are applicable for me. Tbh, me and my project member are &quot;CS refugees&quot; who cannot enter CS but end up CPEG. Both of us focus on COMP side and not really interested in hardware. Sadly, we are forced to enroll this course due to the requirement and suffered a lot.<br /><br />We are newbie in embedded system. We know nothing beforehand, not even a single module. Moreover, we don't have abundant creativity to come up with a good project topic. As a result, we can only somehow replicate and integrate the things taught in labs with some modifications. <br /><br />But guess what. Look at the harsh rubrics (Number in the bracket are the corresponding level) <br /><br />Project Complexity :<br />Project&nbsp;&nbsp;hardware&nbsp;&nbsp;is&nbsp;&nbsp;a&nbsp;&nbsp;mix&nbsp;&nbsp;of analogue&nbsp;&nbsp;and digital&nbsp;&nbsp;signals, software&nbsp;&nbsp;part&nbsp;&nbsp;used&nbsp;&nbsp;majority lab‐covered features&nbsp;&nbsp;of&nbsp;&nbsp;the processor. (1/4)<br /><br />Design Justification :<br />System&nbsp;&nbsp;is&nbsp;&nbsp;designed&nbsp;&nbsp;only&nbsp;&nbsp;according&nbsp;&nbsp;to the&nbsp;&nbsp;LAB&nbsp;&nbsp;material. (2/4)<br /><br />Project Originality : <br />Project&nbsp;&nbsp;is&nbsp;&nbsp;an&nbsp;&nbsp;application&nbsp;&nbsp;of&nbsp;&nbsp;all&nbsp;&nbsp;the labs done before. (2/4)<br /><br />If you want to be at least decent (Only decent. Not even the best)?<br /><br />Project Originality : <br />&quot;Extended&nbsp;&nbsp;integration&quot;&nbsp;&nbsp;of&nbsp;&nbsp;lab materials with &quot;extra circuits or software&quot;. (3/4)<br /><br />Yep. We applied what we learnt. And we end up shitty grade with barely pass. Because we are not genius or robotics team who are able to come up with some extra &quot;out-syllabus&quot; element as &quot;wow factor&quot; to impress the teaching team. WOW. Is this an introductory course? <br /><br />I clearly experience what the quote &quot;Lose at the starting line&quot; (輸在起跑綫) in Chinese means because it obviously depicts my ELEC3300 life.<br /><br />We know Fox always have high standards and expectations on us. Moreover, I know Fox want to offer us some hands-on experience on embedded system. However, for this course the ability disparity is really large. Some CPEG students who are complete newbie or have no interest in embedded system are forced to face the harsh project standards and compete with those robotics team, which is painful. Being one of the important staffs in the CPEG program, Fox can you consider the feeling of us, CPEG students?<br /><br />In the first lab (or the first tutorial?), he mentioned that &quot;This is a hard course. If you don't want to suffer. Now it is still add-drop period...&quot;<br /><br />IF THIS IS NOT A CPEG REQUIRED COURSE, DO YOU FUXKING THINK THAT I WILL STAY AT HERE TO SUFFER???<br /><br />Tbh, I would suggest CPEG students only need to choose between ELEC3300 and COMP3511 as requirement, but not both. Because some may want to focus more on one side (either ELEC or COMP), but not the other. It is better if there are some flexibility on 3000 level compulsory courses as well. (Just like COMP2611 vs ELEC2350 or COMP2711 vs ELEC2600)<br /><br />I give a conclusion on this course:<br />a.) If you are CPEG students who are forced to suffer :<br />-&gt; Good luck, god bless you. You can't escape. Try to find a robotics team guy as teammate to carry you. Otherwise, get ready to be obliterated by both the robotics team and the teaching team. They show no mercy to newbies.<br /><br />b.) If you are non-CPEG students (ELEC major wanting to fulfill elective requirement or other random majors)<br />-&gt; See if you fulfill any of the &quot;Fox's ELEC3300 course design criteria&quot; mentioned above (The a.) to d.) bullet points). If you do fulfill one of them, CONGRATULATIONS! you can enroll it and get a good grade.<br />-&gt; If none of them are applicable to you, don't try it. Please run. Enrolling other courses are more meaningful to both your CGA and yourself. If you really want to learn embedded system, find other ways, but not taking this way which leads you to hell.",
            "comment_teaching": "For prof. Tim Woo. He is a nice guy. However, his lecture is boring and I just didn't listen to him (Many students just did their own work during the lecture)<br /><br />For main TA Fox, well, although I hate the course, I still praise Fox's teaching (but not grading standards). Fairly speaking, he explains things (concept, lab, project) well and I can still able to follow the content. But whether applying the lab material alone in the project is enough to impress him, that is another story.<br /><br />For other TAs, I don't know, they are not really that helpful in the lab. Most of the time you ask them to debug, they just have no idea. Eventually, you have to debug by yourself.",
            "comment_grading": "1. IPRS 8%<br />2. Assignments (x2) 10%<br />3. Lab (x6) 18%<br />4. Project 64%<br />a.) Preliminary proposal discussion (peer) 4%<br />b.) Proposal presentation 6%<br />c.) Interim project demonstration 9%<br />d.) Final demo &amp; presentation 40%<br />e.) Final report 5%<br /><br />Final demo result : 18.33/40<br />Mean : 21.10/40<br />SD : 8.92<br /><br />For other domain I don't want to and I don't need to mention. Because at the time I know the final demo is below mean, I know my doom is coming.<br /><br />What I can say is. As a student, don't expect too much from this course. In this course, only the teaching team can expect too much from students, but not the other way.<br /><br />Update (31/12/2022)<br />Final grade : B-<br /><br />Well...What is happening? Am I in heaven?<br /><br />I can't imagine I score below mean in my project and I still manage to get a B-. Well I upgrade the rating at here for one level to appreciate that. However, the fact that this course is hard to score high still doesn't change. Be aware of that.",
            "comment_workload": "1. IPRS<br />Forcing you to attend Tim Woo's boring lecture. However, the questions are easy. You may also find your neighbors to get the answer easily. It is not a big deal aside from wasting 80 mins in your life.<br /><br />2. Assignment<br />Quite short and simple. Ask some concept stuff. Not a big problem.<br /><br />3. Lab<br />Medium length. Some programming AND wire connection stuff. Better start working on it before the lab session. Otherwise, you are very likely not able to finish it. If you can finish the demo at the first 1 hour of the lab session, you can get 1 point bonus (and most people get it)<br /><br />4. Project <br />Simply speaking, you need to make an invention by using embedded system in around two months of time, with a bunch of troublesome tasks.<br /><br />However, 99.999999999999999% of workload comes from this piece of shxt. What makes it worse is that the return of this part is 99.999999999999999% not proportional to the input. What makes it the worst is that this piece of shxt determines 99.999999999999999% of your fate (i.e. grade). You may waste a lot of time in this course but end up shitty grade. <br /><br />For my team, we stay in campus midnight for many days, trying to make our shitty product at least runnable with some input (Yeah, hardware debugging is way harder than software debugging). During those times, I just hate my life. And you can see my final result. Haha<br /><br />Not to say our invention is relatively simple due to the lack of knowledge and it has already taken a lot of time. If you really want to impress the teaching team and make a much more complex product, you may need much more time to design, code and debug. Even two months are not enough at all while you need to deal with other courses as well. <br /><br />Ah yes, this course may also cost you money because you need to buy most of the electronic gadgets for the project by yourself. Therefore, you need to waste both your time and your money and go to Sham Shui Po (or Taobao) to buy the gadgets. Please Fox, UST students don't have that time (and possibly money) to shopping. A blessing in disguise is that they provide reimbursement, but only $120 for each people.<br /><br />Therefore, my advise is that if you are not really interested in but being forced to enroll this course, sacrifice it, save some time (and money) and focus on other courses to save your CGA <br /><br />Once again, if you fulfill any of the &quot;Fox's ELEC3300 course design criteria&quot; mentioned in &quot;CONTENT&quot; part, you can simply skip my advise and enroll it to get good grade.",
            "rating_content": 1,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 14,
            "vote_count": 14,
            "voted": false,
            "is_upvote": false,
            "comment_count": 4,
            "attachments": []
        },
        {
            "hash": "o8H87kokVzN8wkTBfVoVw5QPueK51546",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 0
                },
                {
                    "id": 191,
                    "name": "WU, Chi Hang",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "shitMan",
            "date": "Dec 13, 2022",
            "title": "Sleepy prof and his fox 昏昏欲睡的教授和他的老狐狸",
            "comment_content": "See other posts<br />如果不是必修課就還是別上了，有這個時間不如上一些更有用的課。科大的ece還是能遠離就盡量遠離吧，ece的a+學到的東西可能都不如cse的c+多。利申：林北cse的科和ece的科都拿了不少a+，但這個3300真的噁心到我了",
            "comment_teaching": "【狐假虎威】是最能形容這個課的成語<br /><br />lectures are very boring, teaching things that are useless but force you to do a lot of iprs and attendance. Tim Woo 在看我們final demo的時候差不多都睡著了，感覺他根本就沒有認真聽嘛<br /><br />狐狸哥教學還可以，但是他這個人真的好奇怪喔。班上當時有個外國人，應該是exchange來的吧，狐狸哥每次見到他都要跟他攀談兩句，lab結束之後還每次都專門和那個白人說“thank you for your effort and early coming” 我那時候就覺得，我也來的很早呀，為什麼狐狸哥不歌頌我咧？ 我感覺他是一個很慕強，慕權，且慕洋的人，很喜歡吹噓他的boss，tim woo有多忙，好屌喔，然後每次說自己是bad guy的時候就好像把從上司那裏受的委屈都發洩在我們這些小ug上。<br /><br />總結就是，親們還是自己學吧，上課就划水就好了，科大的ece已經是爛到根裡去了。tim woo就仗著自己帶隊拿了很多機器人比賽的獎盃在seng裡橫著走，其實教學真的不咋地。這門課只會讓你對embedded system感到厭惡。",
            "comment_grading": "dont know yet",
            "comment_workload": "見仁見智<br />depends on u",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 9,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "mKH0WhzmcMWpIbBrxUZh77xKFp3qR8kI",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "occheung",
            "date": "Jan 22, 2020",
            "title": "PSA: This course can be seriously difficult",
            "comment_content": "An introductory course into embedded system. This course covers concepts and features like interrupts, timers, communication protocols, serial and parallel communications, as well as memory. Much emphasis is put onto coding in labs. A suitable amount of C programming skills is necessary to be able to handle the programming tasks. A minimal knowledge about assembly language is also needed.<br /><br />Make sure you do the lab quickly, the 2 hours time limit seems liberal but in fact, it is very tight (most of the time). You may want to code beforehand and pray extra-extra-hard that your code just works flawlessly.",
            "comment_teaching": "Lectures are honestly boring. However, it does give you a good grasp of the fundamental concepts in data communications. If there is a real-time graded written assessment (i.e. midterm or final for some reason), understanding of these materials is pivotal for a decent course grade.<br /><br />Tutorials are very informative. They kind of teach practical skillset for handling physical devices. Sometimes attending tutorials make your life easier when trying to figure out the solution for the lab exercise.<br /><br />Labs are the practice part. Generally, you will be given a set of coding exercises/problems beforehand. You will need to demo your solution in lab time. Getting the correct solution requires much effort in some cases and it may take you a considerable amount of time. Here is the place where you will realize that life is much crueler than you thought, and your code can when you least suspect. Sometimes asking TAs and student helpers may make your life easier, sometimes not, especially if your coding approach is just completely wrong.<br /><br />It is kind of the nature of programming-based assessments. Programming experience, knowledge of the language, coding styles etc. all comes into play. I had been a student helper for other courses as well, and I fully understand that sometimes other's code may just be weird. It can be something that I just cannot wrap my head around. It is reasonable that TAs just unable to pull you out of the hole that you, unfortunately, dug yourself into, and this is important to bear in mind.",
            "comment_grading": "I split the grade composition into 2 parts.<br />Part 1:<br />In-class activities (iPRS): 7% + minor bonus<br />Homework: 4% x2<br />Lab task: 3% x7<br />Peer discussion for the final project proposal: 4%<br />Online presentation for the final project: 6%<br /><br />Part 1 carries a total of 46%. Here is where things start to get interesting. Due to special circumstances (premature end of school term), an option is given to take final exam instead of continuing the final project. Therefore in part 2 of the composition:<br /><br />Option 1:<br />Interim demo: 9%<br />Project demo + presentation: 40%<br />Report: 5%<br /><br />Option 2:<br />Online final exam: 54%<br /><br />(Sidenote: P/F or W were also available. Almost everyone are eligible to pass.)<br /><br />I took the final exam, and I would urge you to not do the same.<br />Score: 153.5/180; Mean: 85.17; SD: 25.14<br /><br />The mean is below 50%. The exam material covered al lot of the concepts taught within the course lecture (probably with the exception to direct memory access). It requires you to code from scratch. For example, instead of using HAL library for SPI communication (note: this is what people called bit-banging, now go look it up), we were required to implement helper functions to do the same thing ourselves with the aid of a timing diagram. One VERY LONG question also requires hardware connection, choice, and design, as well as programming a communication protocol for a piece of hardware. The difficulty of the exam is insane, even unthinkable for an ELEC course. I didn't see that coming at all.<br /><br />Even if you don't take my words, the score tells you everything. So please think very very carefully before you take a written test designed by Fox. It could be the funeral for your CGA.<br /><br />Needless to say, I got an A+ by the end (duh.)<br /><br />Finally, WELL PLAYED FOX!",
            "comment_workload": "Here is the rundown of what you will do in ELEC3300 sessions:<br />Lecture: Wait for iPRS and guess your way out.<br />Tutorial: Pretend to know everything even if you really don't<br />Before lab: Now you realize tutorial notes probably had told you everything you need to know, but you don't understand the notes<br />Lab: Beg your lab partner, TAs or some random nerds to do everything for you cuz you suck (jk)<br /><br />In all seriousness, workload primarily concentrates on the labs and practical stuff. I would say the workload is not small. Here is some breakdown of workload.<br /><br />+ Much effort is needed to fully understand lab materials and complete lab tasks.<br /><br />+ If you do the project (which normally you must do so), the workload really depends on the complexity. Nevertheless, learning the methodology of datasheet skimming is non-trivial.<br /><br />- Assignments are pretty easy tho. This also gave a lot of false comfort for us, thinking that the final exam is going to be just as painless and simple. (Spoiler alert! It wasn't.)<br /><br />* No workload if you have the luxury /s of taking the final exam. Honestly, the lab material/tutorial slides are too simple. It really won't help you much to gear up for hardcore difficulty. But cranking up your experience may help a lot, so maybe you still want to buy some chips to play with. But then you will need to spend lots of time on things that don't count towards course grade...<br /><br />So in terms of painfulness, the course project makes you feel the pain gradually. The final exam gives the same, but you feel all the pain during the exam. (maybe)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "S9tqkBeflnUck6R4vGTvgNZBjEApnoVB",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "river",
            "date": "Dec 19, 2022",
            "title": "don't take this course unless you are in robotic team or can find teamates in robotic team",
            "comment_content": "the content is pretty good and it covers all basics in embedded system and useful for your project",
            "comment_teaching": "The teaching is not too bad. But due to the fact that it covers so many materials, it can be hard to follow.",
            "comment_grading": "It is a really! really! competitive course. Trust me. Do not take this this course if you have no embedded system background. I am a cpeg student and I am really regretful for not leaving this course to year 4.",
            "comment_workload": "The workload can be seriously high. Personally speaking, I spend more time on this course than the combination of comp3711 and comp2012 and ending up below mean in this course frustrate me a lot.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6vukCRNftP1zhkjZ9DMtPsq7QIB3WSpv",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1529,
                    "name": "ACHUTAVARRIER PRASAD, Vinod",
                    "rating": 1
                },
                {
                    "id": 191,
                    "name": "WU, Chi Hang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mario Bus",
            "date": "Dec 15, 2021",
            "title": "Good arrangement amid Covid-19",
            "comment_content": "(This is the start of the official description)<br />&quot;This course is designed to teach techniques on how to integrate machine-level software and hardware in ARM-core microcontroller based systems. It makes use of industry-standard techniques and technologies, from which students can interface, design and program microcontroller systems. The task of the course will be to complete five laboratory experiments which address different aspects of hardware/software interfacing, and one large microprocessor/microcontroller based project which should result in the design and implementation of a small working embedded system.&quot;<br />This has been the official description of this course. In terms of courses provided by ECE, it really is a strange course:<br />1. It is the only 3000-level ELEC course that accepts a higher level COMP course (COMP2611) as a prerequisite.<br />2. It is a major required course only in BEng(CPEG), but not in BEng(ELEC) in which ELEC3300 is an optional course.<br />3. The TA of this course (Fox) is one of the important figures of CPEG Program Office. (Hope I didn't misuse the word &quot;figure&quot; :) )<br />Therefore I gave it a nickname course code: CPEG3010 :)<br />BTW, I love its content and it really gives me a glimpse on the industry.",
            "comment_teaching": "Given the lectures, tutorials and labs are mandated to be face-to-face, it gives the teaching staff a promise that the students would absorb what he/she learns in lectures, tutorials and labs.<br />(The popularity of Zoom due to Covid-19 pandemic just enables the remote teaching of this course in case of typhoon.)",
            "comment_grading": "At the end of the course, students are required to rate him/herself and the project groupmate. Nevertheless, peer evaluation within the group does not make a big part.<br />The grading is fair, which is, I got a C- here, as I tried to do the project with high originality but very few input / output types.<br />(Tips: drones project good, even if it is overly used like a john)<br />P.S.: Should you find this review useful and you are planning to take this course in 2022 Spring, don't mind leaving a contact)",
            "comment_workload": "I think the focus is the weekly labs that require attendance to the lab (Room 3115). My lab session starts 9 in the morning, which might be physically demanding if you neither live near HKUST nor has a hall place.<br />Nevertheless, maintaining &quot;a small working embedded system&quot; (exact wordings from the official course description) is not difficult if you know how to use the computer software for code writing, debugging, etc.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "Nl2YUB7VtVcxCjb2J4Egqx1wzCfhfXHy",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tooooooo",
            "date": "Feb 17, 2021",
            "title": "quite large workload course if you want good grade",
            "comment_content": "see other post. just a project course, almost everything use project to grade",
            "comment_teaching": "fair. a littel bit boring but accetable, tutorial teach you lab",
            "comment_grading": "there are 6(?) labs, which need to spend some your own time to finish and in the lab time, TA will check your result.<br />and project need intrim demo, presentation........ many things do, <br />and hw<br />very troublesome.<br />i am not sure grading. but should not be so bad, as I dont think my project is very good and adequately show the skills i learnt from this course but still get an A.",
            "comment_workload": "highhhhhhhhhhhhhhhhhhhhhhhhh.<br />lab need time.<br />hw need time,<br />project need time.<br />demon need time.<br />presentation need time.<br />but i dont have many time. <br />so workload is high.<br />but it is required course, so need to take it anyway",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XubjbmnB9nY5XJ45glMHUPSi354YOIDU",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                },
                {
                    "id": 1529,
                    "name": "ACHUTAVARRIER PRASAD, Vinod",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DrainGang",
            "date": "May 29, 2022",
            "title": "Heavy workload, however you are doing something useful.",
            "comment_content": "1.Introduction to Embedded Systems<br />2.Basic Computer Structure<br />3.Microcontroller Structure<br />4.Interrupt Organization<br />5.Timer and Counter<br />6.Interfacing LCD<br />7.Motor Interfacing<br />8.Introduction to use of Equipment<br />9.Number System and STM32 Structure<br />10.I/O and Interrupt function of STM32<br />11.Controlling Graphic LCD using FSMC function of STM32<br />12.STM32 Timer and PWM Function<br />13.ADC of STM32<br />14.I2C function of STM32<br /><br />Basic introduction to microcontrollers, just teaching you how to use the various functions and protocols on the STM32 and how to read datasheets. You only have lectures for the first half of the semester. With the assessment, this course is VERY much a hands-on course, so it is quite meaningful.",
            "comment_teaching": "Great teaching, professor Woo and professor Vinod both go over the concepts clearly. Classes are pretty interactive with the IPRS questions. They are also both very responsive to questions in class, feel free to ask for clarification.<br /><br />As with most ELEC courses, the TAs are amazing. Fox goes over what you need to do in the labs and the related concepts very clearly, he also sends us emails quite often, reminding us of deadlines and such.",
            "comment_grading": "Quite a lot of things, but NO EXAMS! The main thing is the project, with 2-people groups. A good tip for the project: make sure it has a lot of hardware components, the graders do not care much for software.<br /><br />In-class activities (8%): IPRS questions in class, 6% is given if you answer all questions, and another 2% is given if you get more than 70% of questions right. The questions are not hard, however you need to pay attention in class, otherwise you won't be able to answer them. I got all 8% I believe.<br /><br />2 assignments (10%, 5% each): Pretty simple questions, just making sure you understand the lecture materials. Almost everyone has full marks on this.<br /><br />6 Lab experiments (18%, 3% each): Follow the lab manual and demo the circuit and code to the TAs, quite useful as you will do similar things for the final project, difficulty is low other than the last lab. Most people have at least 15/18% since the first 5 labs are quite easy.<br /><br />Preliminary proposal discussion (4%): Meet with other students in a Zoom meeting and discuss the projects you will be making, and then write a short comment on iPeer. Just submitting it will give you all 4%.<br /><br />Proposal presentation (6%): Make a video presenting the project idea. Points are given based on the complexity of the project. My presentation was quite bad so I got 3% or so possibly.<br /><br />Interim project demo (9%): Show the TAs and professors your current progress in the demo, you are also allowed to ask them questions on the project for feedback. Grading is completely unknown, but I think we did alright.<br /><br />Final project demo and presentation (40%): Make a 7 minute video demonstrating your project and then also explain the flow of the code. After the video the TAs and professors will ask you questions on the project. (Average score: 19.7, SD: 5.01)<br /><br />Final report (5%): Make a HTML file storing everything in the project, just linking everything you have already done on it. Again grading is unknown.<br /><br />Nothing is shown other than my grade for the 2 assignments and the final score, with 3.5/40 higher than the average I got a B. Decent? Really unsure.",
            "comment_workload": "VERY heavy.<br /><br />No matter what you are doing for the project, you will spent a LOT of time debugging and trying to solve technical issues, some of which will have NO ANSWERS online, meaning that you really have to solve them yourself. (For example, I searched for a VERY long time for a library and could not find it, I only managed to solve it by bruteforcing what I wanted instead of an elegant solution.) <br /><br />Depending on the ability of your groupmate, the workload also varies, but again, it is heavy no matter what.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NXqYsZtD8Ylb3XQxSXWMdDooa4u10JVY",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kalung",
            "date": "Jun 04, 2021",
            "title": "Effort pays for itself",
            "comment_content": "This course teach the basics of embedded system<br />STM32F1 and cubemx is used for both teaching and (most likely) your project<br />Keil MDK µVision 5 is the IDE of teaching<br />*but I use makefile toolchain instead<br />*cubemx is useful when initializing your project<br />*beware of the difference of ARMCC and GCC if you want to use makefile /w vscode<br />==================<br />Course content<br />==================<br />some basic of elec2350(e.g. little endian vs big endian)<br />polling vs interrupt(remember the ISR priority)<br />how to read timing diagram<br />how to read datasheet(*IMPORTANT)<br />how to setup cubemx for project generation<br />basic component of MCU(ADC PWM GPIO)<br />FSMC and LCD and I2C<br />some protocol(UART SDIO I2C)<br />==================<br />LAB content<br />==================<br />LAB1 - tinkercad<br />LAB2 - GPIO<br />LAB3 - FSMC LCD(rgb565)<br />LAB4 - Timer and PWM<br />LAB5 - ADC<br />LAB6 - I2C",
            "comment_teaching": "Two instructor this semester<br />==================<br />Dr. WOO Kam Tim<br />- teach the first half (Lec 0-6)<br />- he is nice and helpful<br />- mediocre voice(mild tone)<br />==================<br />Dr. Vinod ACHUTAVARRIER PRASAD <br />- teach the latter part (Lec 7-11)<br />- sorry my bad, I can't understand/comprehend his english<br />==================<br />Hidden instructor: Mr Fox WU<br />- he is the real hero that saves you in this course<br />- send him email when you encounter any difficulties during project (eefox)<br />- speech super fast but acceptable<br />- you will learnt most of everything in his tutorial<br /><br />P.S. if it is not for the IPRS(during lecture), I would have just attended labs+tutorial(cuz fox covered most of the lecture content already)",
            "comment_grading": "The normal content(36%):<br />&nbsp;&nbsp;&nbsp;- IPRS&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;8%<br />&nbsp;&nbsp;&nbsp;- 2*HW&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;10%<br />&nbsp;&nbsp;&nbsp;- 6*LAB&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;18%<br />Project-ish(64%):<br />&nbsp;&nbsp;&nbsp;- Proposal presentation - 10%<br />&nbsp;&nbsp;&nbsp;- Interim presentation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;9%<br />&nbsp;&nbsp;&nbsp;- Final presentation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- 40%<br />&nbsp;&nbsp;&nbsp;- Final report&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;5%<br />==================<br />mean = 23.27 | SD = 6.563 <br />35/40 for final demo gets me an A+<br />other scores I can't find <br />==================<br />My feelings about this course<br />==================<br />I still don't understand what high impedance means<br />I spent many hours on the project and skip all my other classes(thus my grade exploded for other courses)<br />I finally got an A+ but it's not worth spending that much effort for that<br />I got a taste of how painful it is to do hardware debugging<br />I guess this is great to get your mindset prepared for the FYP?<br />==================<br />hints<br />==================<br />some basic knowledge of MCU is helpful to help you get things started <br />please read the lecture material in advance(this helps)<br />Don't skip tutorial(it's way more important than you think)<br />This is not a coding course so please don't propose some pure-code project<br /><br />Words from professor Tim WOO:<br />&quot;Even your presentation skill was not access in the project proposal, you are encouraged to take the opportunity in sharpening your presentation skills.&quot;",
            "comment_workload": "The workload is split into two phases:<br />Phase 1(First 6 weeks or so)<br />Phase 2(the remaining time)<br />*There is one homework in phase1 and one in phase two, but the workload of that is negligible<br />*workload might be higher than those other 4-credit course<br />==================<br />In Phase 1 <br />==================<br />- you attend lecture to have IPRS<br />- you go to tutorial<br />- you prepare labs in advance<br />- you go lab session demo and leave<br />- and that's it, very easy content<br />==================<br />In Phase 2 <br />==================<br />this is where the part of headache<br />- you still attend lecture to have IPRS<br />- no lab no tutorial <br />- you go ham at your project<br />- (possible) you code, you debug, until you wanna kill yourself<br />- you prepare presentation for the project",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sKKim7AaLoTjjeNIHTgKlzkCAkTkKCBV",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ustdaniel",
            "date": "Jan 20, 2021",
            "title": "High work load but fun and unique course",
            "comment_content": "This course teaches you how to use an STM32 microcontroller and how to communicate with it via software and hardware, which is similar to the ARDUINO board but is much more complex and difficult to use.<br /><br />I think this course is a very practical course as you have to use the knowledge you acquired on your final project.",
            "comment_teaching": "The tone of the lecturer and TA is quite boring, but they did explain all the theories very clearly and their English is easy to understand. They are also willing to answer any students questions.<br /><br />But do remember to attend all the classes as there are iPRS in the lectures and the tutorials are VERY USEFUL for your labs.",
            "comment_grading": "In-class activities&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(8%)<br />2 Homeworks&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(10%)<br />6 Labs&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(18%)<br />Preliminary proposal discussion (4%)<br />Proposal presentation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(6%)<br />Interim project demonstration&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(9%)<br />Final project demonstration and presentation (40%)<br />Final report&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(5%)<br /><br />NO MID-TERM EXAM!!!<br />NO FINAL EXAM!!!<br /><br />Labs&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(full marks)<br />Homework 1&nbsp;&nbsp;(98/100)<br />Homework 2&nbsp;&nbsp;(57/70)<br />Project&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(25.6/40)&nbsp;&nbsp;mean: 21.571 sd:7.933<br /><br />Grade B+<br /><br />I think overall its a good grade course that you can get B range if you work hard enough, my project is not outstanding but I am still happy with the marks I get with the amount of effort I made. But for getting A range you really need to work really hard and compete with the robotic team's students.",
            "comment_workload": "The 2 Homeworks are easy and won't take you a lot of time.<br /><br />The labs are a little bit difficult, so I HIGHLY RECOMMEND you to attend the tutorials which the TA gives a lot of guides and hints on how to finish the labs.<br /><br />The final project is the big boss(1/2 people project), you have to plan your own project using the microcontroller. You may go to Youtube and search for 'HKUST elec3300 project' to find some examples of what students make. This project may take a lot of time as you have to plan, design, buy components, test, debug and make a report for it. MAKE SURE YOU START YOUR PROJECT AS SOON AS POSSIBLE, as closer to the deadline, you may have to finish other courses' assignments which make you busy af.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "krSAOWjniYySgge2BsvLjCPgMb2fMxpu",
            "semester": "2022-23 Spring",
            "instructors": [],
            "is_author": false,
            "author": "AT_KT",
            "date": "Jul 15, 2023",
            "title": "Find 3 good teammates before you take this course",
            "comment_content": "like the course title &quot;Introduction to....&quot;, so the course content is also... I want to say not too helpful if you want to build a fantastic project.",
            "comment_teaching": "Ok",
            "comment_grading": "Try to get full marks for attendance, lab, homework,...etc<br />I am very regret I skipped too many classes, so my attendance score is really terrible",
            "comment_workload": "I think the workload is fine for everything except the project stuff.<br />So find three good teammates (max. group size).<br />I feel very very very very very exhausted near the end of the semester.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "O9p4Cv3vb4VIkVnGQHyr81hAr3P6bMmr",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "outis",
            "date": "May 22, 2023",
            "title": "",
            "comment_content": "Lecture Topics<br />1. Introduction to Embedded Systems<br />2. Basic Computer Structure<br />3. Embedded System Structure<br />4. Interrupt Organization<br />5. Interfacing LCD<br />6. Timer and Counter<br />7. ADC and Motor Interfacing<br />8. Serial Communication<br />9. DMA<br />10. Memory Interface<br />11. Applications of Embedded Systems<br /><br />All the lectures are basic knowledge about embedded systems, try not to miss if you want a nice grade.<br /><br />Tutorial <br />1.Introduction to use STM32<br />2. Number System and STM32 Structure<br />3. I/O and Interrupt function of STM32<br />4. Controlling Graphic LCD using FSMC function of STM32<br />5.STM32 Timer and PWN Function<br />6. ADC of STM32<br />7. Inter-Integrated Circuit(I2C) function of STM32<br /><br />Instructions on how to complete your lab assignment.",
            "comment_teaching": "Tim Woo and Fox are both patient instructors. <br />Conventional teaching, but you can learn yourself(the earlier, the better).",
            "comment_grading": "- In-class activities\t\t\t\t\t&nbsp;&nbsp;8%<br />-2 Homework assignments \t\t\t10%<br />-6 Laboratory experiments \t\t\t18% <br />-1 Preliminary proposal discussion\t(peer) 4%<br />-1 Proposal presentation\t&nbsp;&nbsp;&nbsp;\t\t&nbsp;&nbsp;\t&nbsp;&nbsp;6%<br />-1 Interim project demonstration\t\t&nbsp;&nbsp;9%<br /><br />- Final project demonstration and presentation 40%<br />- Final report&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5%",
            "comment_workload": "High workload compared to other courses.<br />6 consecutive weeks of LAB.(not easy)<br />one final project you must start early if you want to get a high grade. <br />If possible you should find your partner at the beginning and start your project.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "93tX9NAiCXLvXak37I5OEMfZ0OsMxwuy",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Brianchiu0703",
            "date": "Dec 20, 2022",
            "title": "",
            "comment_content": "the content is pretty good and it covers all basics in embedded system and useful for your project",
            "comment_teaching": "The teaching is not too bad. But due to the fact that it covers so many materials, it can be hard to follow.",
            "comment_grading": "with no help from ta you will probably have no chance finishing your project in time and grading are bad",
            "comment_workload": "very heavy workload,&nbsp;&nbsp;lab take you much time and the project takes much time and it is really hard as you are probably new to the language it use in 3300",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RywHgIlZHk75iXld5E6GqDT36Vn7Ou7L",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "cryptojet",
            "date": "Dec 19, 2022",
            "title": "Trashiest courses in UST. Very bad teachers and course overall",
            "comment_content": "The stuff is useful but the teaching quality is terrible. <br /><br />Most of the stuff taught in the class is not helpful for your laboratory. They do not show how to use stm32, they only explain the concept part.",
            "comment_teaching": "They try to help you to understand the topics but they fails to do so.<br /><br />Very bad, they try to mislead you all the time. They often play some video that is entirely useless.",
            "comment_grading": "Grading is very bad as you are competing with robotic team students and cheaters.<br /><br />So I have gone to Sham Shui Po 7 times and have spent $ 500&nbsp;&nbsp;buying the raw components for the projects. After 3 weeks of constructing the project, I got a terrible grade.",
            "comment_workload": "I spent three days in the lab before I get the sources from the previous year.<br /><br />This course is just a test of your ability to find sources.<br /><br />If you cannot find the sources from the previous year, you will find that it is hard for you to complete the lab as the teaching is terrible in the class.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UmsWmB9HVuXtHpbntlJ382eqUuJ1PA04",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                },
                {
                    "id": 1529,
                    "name": "ACHUTAVARRIER PRASAD, Vinod",
                    "rating": 1
                },
                {
                    "id": 191,
                    "name": "WU, Chi Hang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Trevorc",
            "date": "Aug 27, 2022",
            "title": "A useful course",
            "comment_content": "This course is designed to teach techniques on how to integrate machine-level software and<br />hardware in ARM-core microcontroller based systems. It makes use of industry-standard<br />techniques and technologies, from which students can interface, design and program<br />microcontroller systems. The task of the course will be to complete six laboratory experiments<br />which address different aspects of hardware/software interfacing, and one large<br />microprocessor/microcontroller based project which should result in the design and<br />implementation of a small working embedded system.",
            "comment_teaching": "Professor Vinod and Professor Woo taught for 6 weeks each. They explain the concept very clearly. In addition, Fox is very helpful. He will answer all your questions about the lab in the tutorial section.",
            "comment_grading": "You can get a B range grade if your total score is above the mean. However, it is hard to get a good grade.",
            "comment_workload": "6 Labs<br />2 Assignments<br />1 Project (1-2 students)<br />In-class IPRS Quiz<br /><br />You need to spend a lot of time finishing the labs and project.<br />If you are familiar with C++/ Arduino/ STM32, it will be better.<br />The concepts in the labs can help you to finish the project.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8xiU8tE79OOoKbmzUWAPFkNfHrjA1B7y",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                },
                {
                    "id": 191,
                    "name": "WU, Chi Hang",
                    "rating": 1
                },
                {
                    "id": 1529,
                    "name": "ACHUTAVARRIER PRASAD, Vinod",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gdhdsv",
            "date": "May 30, 2022",
            "title": "hard and harsh grading",
            "comment_content": "Basic embedded system knowledge. Like what is gpio, interrupt, timer, adc, clock, hardware communication protocols like uart, i2c, spi, etc. We use STM32F103 as the development board in labs compulsorily and project optionally. They will lend you the hardware components.<br /><br />You must need to have decent C programming knowledge before enrolling this course because you will always need to use C programming in assignments, labs and project. They won't teach you C programming and assume that you know them very well. In lectures and tutorials they will only teach you theoretical concepts of embedded system.<br /><br />This course has a final project. 1-2 students per group is expected. The project asks you to design a microcontroller embedded system project. You can search elec3300 in Youtube to find out the projects people did before. They will also provide some project description in previous semesters. You need to buy the required components yourself.<br /><br />The concepts in this course are pretty basic if you want to do anything related to microcontroller.",
            "comment_teaching": "Professor Vinod left UST after 6 lectures. Prof Woo taught the rest of lectures. Both of them explained concepts clearly.<br /><br />TA Fox also is a great teacher. He would teach you concepts and methods that are needed in the coming lab. You need to attend the tutorial if you want to know what to do in the next lab because the progress of lecture was often slower than the lab.",
            "comment_grading": "in-class IPRS 8%, didn't release, maybe I got ~7%<br />2 assignments 10%, I got 9.7%<br />6 labs 18%, I missed one lab so I got 15/18<br />1 preliminary proposal discussion 4%, didn't release, maybe I got 4%<br />1 proposal presentation, I got 3.65%.<br />1 interim project demo 9%, didn't release, maybe I got ~5%<br />1 final project demo 40%, I got 22/40 so 22%, mean 19.727, sd 5.013<br />1 final report 5%, not sure, maybe 5%<br /><br />Overall I think I got ~71%, and I got B-. <br />It is hard to get high marks in the final project so it is hard to get A range. I think the reason why we couldn't get high marks is that I didn't apply all concepts I learnt from lab into the project. For example we didn't use timer and i2c. Our project was also not very outstanding and creative so maybe it couldn't give a good impression. Besides, since this is online semester we need to take a video demo instead of live demo. The video has length limit(&lt;7mins) including showing the working functions and ppt presentation. Therefore the time was very limited and we couldn't show the working functions of our project very clearly. Overall too much uncertainty in the final demo that affects your marks. <br /><br />Thus if you want good grade easily or you are not very into embedded system and this is not a compulsary course, you should avoid this course.<br /><br />But overall fair grading.",
            "comment_workload": "For those who already know STM32 very well or robotics team, it should be very low.<br />For those who are not, debugging will spend much time in this course. Especially in final project. <br />You will need to attend 2 lectures every week to finish the iprs.<br />You will need to do 6 lab per week in the first 6 weeks. <br />You will need to do things related to the final project.<br />final project is group project. You can find one partner or do it by yourself.<br /><br />Workload is high undoubtedly. There are many different items for you to finish to get marks in this course comparing to others.<br /><br />No exam is the only good thing I guess.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "eKdtCd1qRkJAQtXlFxgk4PJkE9Ojrn9d",
                    "name": "grading",
                    "format": "jpg"
                }
            ]
        },
        {
            "hash": "ClkuFqoP37H7r76UHMVXfHCzfVnA23M8",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1529,
                    "name": "ACHUTAVARRIER PRASAD, Vinod",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Simonmokys",
            "date": "Jan 09, 2022",
            "title": "Interesting course",
            "comment_content": "Topics<br />1.Introduction to Embedded Systems<br />2.Basic Computer Structure<br />3.Microcontroller Structure<br />4.Interrupt Organization<br />5.Timer and Counter<br />6.Interfacing LCD<br />7.Motor Interfacing<br />8.Introduction to use of Equipment<br />9.Number System and STM32 Structure<br />10.I/O and Interrupt function of STM32<br />11.Controlling Graphic LCD using FSMC function of STM32<br />12.STM32 Timer and PWM Function<br />13.ADC of STM32<br />14.I2C function of STM32<br /><br />The ultimate goal is to use stm32 to build a embedded system staff",
            "comment_teaching": "Attendance is taken by answering the questions in IPRS. Everything you need to know is on the lectures note. The instructor just follow the ppt.",
            "comment_grading": "Fair enough, this course mainly focus on the project, how much time you spend will be shown on your grade. <br /><br />Continuous assessment:<br />–In-class activities&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8%<br />•The in-class activities in the first two weeks are the pilot run. The score will be counted toward starting from week 3.<br />•There are two criteria in measuring the score:<br />–First 6% is counted in the percentage of the questions you attempted.<br />–The rest 2% will be given if more than 70% of the answers are correct.<br />–2 Homework assignments&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />–6 Laboratory experiments&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;18%<br />–1 Preliminary proposal discussion (peer)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4%<br />–1 Proposal presentation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;6%<br />–1 Interim project demonstration&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;9%<br /> <br />•Final assessment:<br />–1 Final project demonstration and presentation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;40%<br />–1 Final report&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5%",
            "comment_workload": "If you do not have any experience on embedded system, it is a tough course.<br />Every lab take around 3hours to finish, as you need to revise the materials. For the final project, start planing earlier (what modules to buy, how to wire up, what is the communication protocol) or you will suffer at the end.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jFgH23n71GB5sS8EcxyHt9MyeYWmcApV",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Don2000",
            "date": "Jan 20, 2021",
            "title": "",
            "comment_content": "About how to use different parts,but more importantly is how and where to read datasheets.<br />I didn't pay attention in half of the lecture. As I found it not useful in the project. (especially for first and last few lectures).(but I do&nbsp;&nbsp;pay attention for the parts my project I gonna use)<br /><br />btw, You will find the labs very useful in the final project.",
            "comment_teaching": "Not much things to teach,<br />a few lesson is just playing vidwo about interesting creation and sharing&nbsp;&nbsp;previous project or robotic team.<br /><br />Tutorial will teach you some concept and direction on labs, but you will need to find out the solution by yourself.<br /><br />I didn't finish LAB6 as I got too much workload at that time and the lab takes quite a bit of time to finish.",
            "comment_grading": "– First 6% is counted in the percentage of the questions you attempted.<br />– The rest 2% will be given if more than 70% of the answers are correct.<br />– 2 Homework assignments 10%<br />– 6 Laboratory experiments 18%<br />– 1 Preliminary proposal discussion (peer) 4%<br />– 1 Proposal presentation 6%<br />– 1 Interim project demonstration 9%<br /><br />• Final assessment:<br />– 1 Final project demonstration and presentation 40%<br />– 1 Final report 5%<br /><br /><br /><br />idk if i got the extra 2%, but I miss some iprs.<br />I miss lab 6 as I have too much workload at that time.<br /><br />Demo : <br />Full mark is 40.<br />Mean mark is 21.571.<br />Standard Deviation is 7.933.<br /><br />I got 37/40, Which exceed my expectation.<br />I believe it's because I solo the project , and did some video editing on my demo.<br /><br />Final grade A+, I was expecting A-<br />The demo takes a great part on grading, so you may put more time on it.",
            "comment_workload": "Labs: takes quite a bit of time, but reasonable.<br /><br />Project:<br /><br />You will need to buy sensor and parts by yourself,<br />craft it ,and coding it. Just as a maker.<br /><br />as I don't want to TaoBao, I went ssp to find parts for a few times. That might be a bit extra workload.<br /><br /><br />Actual time I spent on crafting the project is about 4 whole days. Including recording demo and editing. Maybe 2 days for planning and buying components.<br /><br />I won't say the workload is light, but you will find fun in it if you are that kind of person. And the grading is worth workload.<br /><br />Sorry for 1999, im lazy to organize all the stuff.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Veh7VYVH524TCg6FDRdkpiZl2mrn6okY",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kelvin Y",
            "date": "Jul 28, 2020",
            "title": "Gotta listen in class.",
            "comment_content": "Basically teaches you how to use a micro controller to do stuff, with some coding involved.",
            "comment_teaching": "Lectures are boring but they are useful if you want to do well in the final project. <br /><br />The TA in charge, Fox, is strict and kinda mean but you need to listen to him. The tutorials are important for the labs, and in extension the final project.",
            "comment_grading": "I made kind of a sh tty project but they still gave me an ok grade. I got a B, which I didn't expect.",
            "comment_workload": "Labs and homework.<br /><br />Final project is the big thing, you will spend a lot of time on that.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Rekr80ItVHACLKbz8c99NlAVu46Gbtbg",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bobby",
            "date": "Jan 31, 2016",
            "title": "Introduction to Embedded Systems",
            "comment_content": "Basically this course is all about STM32 microcontroller. It uses stm32f1 series microcontroller as an example, introducing many aspects of an embedded system. There are no exams and the core of this course is a self-proposed project. During this course you'll get rich hands-on experience that other elec courses might not give you.",
            "comment_teaching": "Prof. Tim Woo and TA (Fox)'s teaching is quite clear, especially Fox. His tutorials are very useful. If you attend all the tutorial sessions, lab work will be quite easy to finish(even if you skipped all the lectures).",
            "comment_grading": "This course has no midterm or final exams. 3 homework assignments and several lab sessions have a weight around 36% of the overall score but almost everyone can be able to get full marks in these two parts. So honestly speaking, the project's quality determines your grade.",
            "comment_workload": "My partner and I spent quite a lot of time on doing our projects. But it really depends on yourself. A complicated project means heavy workload and a good final grade (most likely) and vise versa. Comparing to the project,&nbsp;&nbsp;other parts' workload can be ignored at all.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yaSEBx2xgjbSLWALtcGknNLz9c63cQXS",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TrebledJ",
            "date": "Jan 20, 2023",
            "title": "Unpopular opinon: nice and fun hands-on project experience",
            "comment_content": "Got some dream IoT gadget or a fun toy idea? This might be the place to start building it.<br /><br />There'll 6 labs to complete, 1 interim (midterm) demo, 1 final demo. Attendance is marked by IPRS.<br /><br />The labs can be done at home. You just come to lab to demo or ask questions.<br /><br />For the project, you're limited to the STM family of boards. They provide a development kit complete with an STM32F103 board, ST-Link, touchscreen LCD, simple sensors, a servo, pins for I2C/SPI, pins for a WiFi module, pins for a camera, and whatnot. (See attachment.)<br /><br />Content:<br /> • Introduction and Overview of Embedded Systems<br /> • Review of Low-Level Computing (COMP2611 review)<br /> • LCD, FSMC<br />&nbsp;&nbsp;&nbsp;&nbsp;- Useful for displays/interaction<br /> • Interrupts<br />&nbsp;&nbsp;&nbsp;&nbsp;- Useful if your device doesn't need to run all the time or if you have something special to trigger<br /> • Timers, PWM<br />&nbsp;&nbsp;&nbsp;&nbsp;- Useful for regular signals, interrupts<br /> • ADC/DAC (Analog-to-Digital Conversion and vice versa), Motors<br />&nbsp;&nbsp;&nbsp;&nbsp;- Useful for analog sensors, motors, audio<br /> • Serial Communication (UART, USB, SPI, Zigbee)<br />&nbsp;&nbsp;&nbsp;&nbsp;- Useful for communicating w/ sensors/devices/computers<br /> • DMA<br />&nbsp;&nbsp;&nbsp;&nbsp;- Useful for performance<br /><br />Other things you might be able to pick up:<br /> • Reading signal diagrams<br /> • Hunting info in datasheets<br /> • Googling<br /> • Screaming in pain at 2am<br /><br />All in all, it's pretty ambitious for an intro to embedded systems.<br /><br />----<br /><br />Some experience sharing.<br /><br />Like with most courses, you'll get more out if you enter with some&nbsp;&nbsp;fundamentals. I entered with some robotics experience (so I guess my review doesn't speak for everyone). Of course I don't know everything, there were still a lot of new things that I picked up from this course.<br /><br />Our group started planning for the course before the semester started. I wanted to make something music related, so we decided on making a MIDI keyboard of sorts.<br /><br />We decided to forgo the F1 board and chose an F4 board. (Unless you have an EE groupmate, I suggest not taking this approach, as you'll likely be soldering things, designing the PCB, etc.) But we went for an F4 for speed and memory.<br /><br />We also used C++. Slightly more flexible on the generics/container side of things. It might be possible to do it in Rust. Maybe a bit risky though, portability of libraries and all that.",
            "comment_teaching": "Bittersweet?<br /><br />Tim Woo and Fox are both passionate instructors. Tim Woo uses good analogies. He does show some videos in the first few weeks, but these are mostly inspirational rather than contentful. The IPRS is not too bad. It tries to get you to think and dig into the details.<br /><br />Some topics were rushed though. And the slides are rather messy, so it's a bit hard to find info.<br /><br />You can tell Fox is rather passionate about teaching, and he guides the TAs well. The rubrics seem thorough, detailed, and fair, but it might be a bit overthought. In the end, it's up to human TAs who might have very different opinions. Nonetheless, they do put a lot of effort into explaining the rubric, giving past examples, etc.<br /><br />Tutorials are skippable, but are useful for setting up things and gaining a detailed understanding. E.g. why might the ADC rate be slower when we set a higher clock rate?<br /><br />TAs shared their projects and experience in the last few weeks. I completely skipped these lectures (bc 9am), but I guess they could be eye-opening if you're invested into the field.",
            "comment_grading": "Most of your grades will come from the project. Project criteria are: complexity, design, originality, completeness, presentation. (See attachment.)<br /><br />I think grading for the (final) project was okay? At least for us. Again, a lot depends on the TAs. Some have high expectations. Some have none.<br /><br />The interim demo grades were very weird. Most groups I know (including mine) got around half the marks. What do the TAs expect? A fully functional product? ...four weeks into the project? ...during midterms???<br /><br />I skipped a bunch of IPRS towards the end. (Who wants to get up at 9am just to be interrupted (haha!) by IPRS?)<br /><br />In the end, I managed to pull an A range, which was okay considering the effort I put into the project minus the missed IPRS and the unreasonable interim grading.",
            "comment_workload": "Not gonna lie, ELEC3300 bears comparatively high workload to other courses, but this is natural when it comes to being a hands-on/project-based course. Add to this the nature of hardware and software (bugs!). And the chance of grouping with a freerider.<br /><br />Bugs are the most painful part of the project. There are software bugs. And then there are hardware bugs. If a bug persists for a while, what I would do is: (1) ask experts (e.g. Fox, online forums such as stackexchange), (2) ask other groups (esp. those who have similar projects).<br /><br />To give an example, I had an issue with speakers. Emailed Fox; vague response. Asked in DSP.SE; got some answer about psychoacoustics. 🤷‍♂️ Eventually I was able to resolve an issue with speakers in my project by asking another group what they used for speakers and how they handled them. Apparently the hardware design was simpler than we thought.<br /><br />As mentioned above, some lecture materials were rushed through. Truth be told, you can get away with not knowing, especially if the topic is not used in lab or in your project. Otherwise, you'll need to self-study to catch up.<br /><br />This semester they allowed us to form groups of 3. (Previously it was only groups of 2.) I found my groupmate early on and we already had most things planned by early September (a week into Fall?). Fortunately, my groupmate shared a decent chunk of responsibility, so we ended up with a finished product.<br /><br />I guess my takeaways here are: don't underestimate the workload, find good groupmate(s), communicate well, and don't be afraid to seek help.<br /><br />Also: set achievable targets.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "t8giuk92yqgyDAEGyuajJ4xnHezTGPY9",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "JamesChung",
            "date": "Mar 05, 2022",
            "title": "",
            "comment_content": "Same with others.",
            "comment_teaching": "The lectures are not very useful. But the tutorials help a lot. Fox carries everything in this course.",
            "comment_grading": "The grading is bad. Even you work very hard for this course, it is still hard for us to have a good grade",
            "comment_workload": "There are 5 lab are 1 project. However, those labs will cost you some time. For every lab, you need at least 2 hours to finish. And for the final project, it is even worse. It takes about 4 weeks for our group and we need to find all the components by ourselves.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jh0rCrgbb7Wc0LIuudoR113egAGxWp5i",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Inkey",
            "date": "Jan 23, 2022",
            "title": "ELEC3300",
            "comment_content": "Content is useful and related. However the toturial is too much lead to the lab session and you may forget everything you learned in toturial",
            "comment_teaching": "just okay. The professor is good and the TA sounds decent. But the teaching does not satisfactory. The lecture weill have quiz and no exam.",
            "comment_grading": "TOO BAD!<br />The grading does not cooperate your effort. All myfriends I knew get B range and does not get a range.",
            "comment_workload": "It spends me 4 weeks day and night to finish my project and get a B- afterall.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NxwBV8o2TDux6hqVqvs9nGM04naJfMpU",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SinGGGGGG",
            "date": "Aug 19, 2019",
            "title": "",
            "comment_content": "This course covers the embedded system with STM MCU.<br />All topic will is related to the MCU that you use in this course",
            "comment_teaching": "Prof Tim Woo 's lectures are interesting but the contents are very boring",
            "comment_grading": "Course works and Grading<br />– In-class activities 10%<br />– 2 Homework assignments 8%<br />– 6 Laboratory experiments 18%<br />– 1 Preliminary proposal discussion (peer) 4%<br />– 1 Final proposal presentation 6%<br />– 1 Interim project demonstration 9%<br />– 1 Final project demonstration and presentation 40% (+2%)<br />– 1 Final report submission 5%<br /><br />Those Labs are quite difficult but they are very useful for your final project.<br /><br />Labs and tutorials are much more important than the lectures!<br /><br />It's not difficult to get a B+ in this course if your final project is really done all by yourself !!!!<br />Just put all your effort on the final project",
            "comment_workload": "Assignment: Low<br />Final project: High",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Wp6wPrW9Gobr7GemlXjqWHpDXa5y3NQ6",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kamkamkankan",
            "date": "Jan 12, 2018",
            "title": "",
            "comment_content": "This course teach you the basic of using the STM32. If you are not familiar with c, don't reg this course. You will bring trouble to yourself and your project partner.",
            "comment_teaching": "Sorry I only attend the first lecture so i can't command on the teaching of prof. Woo. (i am really sorry professor) However, I attended all the tutorials and Fox's powerpoint and teaching are quite clear and to the point.",
            "comment_grading": "I belief the grading is really good. I forgot to hand in the peer evaluation homework and still not dead.",
            "comment_workload": "Workload varies on the level of difficulty of your self-proposed project and the usefulness of your project partner. The schedule of the self-proposed project is a bit too tight in my opinion. Other things such as assignments are quite easy.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ztcgJmHYvLMwssbhkL5EeYdVlRsx62GR",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "andre",
            "date": "Dec 18, 2018",
            "title": "Easy course with previous knowledge",
            "comment_content": "The content covers embedded system. If you have previous knowledge in STM, this course is chill. All content are taught with STM as the example including communication protocols, GPIO and etc. Content is not heavy and there is not test or exams on the materials.",
            "comment_teaching": "Prof. Tim Woo focuses on concepts while tutorials and labs focuses on applications. It may be interesting for those who never experienced with embedded system but will be boring for those who have previous knowledge.",
            "comment_grading": "The project is the only grading subject. Innovative ideas can add points to the grade, making the project simple but fancy is the best way to achieve good grade in this course. During presentation, TAs / prof will ask technical questions so you must have full understanding on your project. There are always some robotics team members who come and grab the A-range.",
            "comment_workload": "Only the final project which u can prepare at the start of semester. Lectures, labs and tutorials only last until mid-term and you are totally free in the second-half of the semester. Just don't fail the project.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "U0vfOKcmuaa2mQez8YRSTR4sEAHjKDCv",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "billyZ",
            "date": "Jan 25, 2018",
            "title": "",
            "comment_content": "Basic use of an embedded board",
            "comment_teaching": "Lecture is just about the basic concepts. You will learn most things from lab work. Better to type your code yourself. This would help the final project. TAs are quite helpful and you can ask any questions.",
            "comment_grading": "Depends on your project. If your project is outstanding compare with other projects, your grade will be high. Project score is given by TAs so it would be the best if you can ask for TAs' suggestion.",
            "comment_workload": "3 homework and 1final project. Homework will affect your subgrade but they are very easy if you just refer to the lecture slide. Project can be very heavy load. You need to prepare materials yourself. Also there will be a presentation before you start your project. It is important.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "C8Mw1m5qvYNkhJXUV5b0tM5G61fJwVld",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 190,
                    "name": "WOO, Kam Tim",
                    "rating": 1
                },
                {
                    "id": 191,
                    "name": "WU, Chi Hang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Dipsy",
            "date": "Jun 08, 2020",
            "title": "I love Tim Woo, I love Fox",
            "comment_content": "Lecture:<br />Architecture<br />Interrupt (lab2)<br />LCD(lab3)<br />ADC(lab5)<br />motor(Timer PWM)(lab4)<br />protocol(SPI I2C ...)(lab6)<br />DMA<br />memory interface<br /><br />lab1: TinkerCad",
            "comment_teaching": "iPRS will test your understanding, make sure you are able to understand how to answer the iPRS questions. If you don't understand, just voice out to ask Tim Woo or Fox, Tim Woo will explain it in class or Fox will answer it in the chat room, they are very happy to see students asking and they are trying to make the class as interactive as possible.<br /><br />Tutorials give instructions on how to do the lab, and you do the lab work before the lab section, lab section is only for demo<br /><br />Paper checking Fox is very nice and I found the marking is super friendly<br /><br />The arrangement of the whole course especially the final is very good given the online learning settings",
            "comment_grading": "lab*6: 30%<br />assignment*3: 12%<br />attendance: 8%<br />final: 50%<br /><br />no project this sem because of covid19, which is quite sad, but relief a lot of workloads<br /><br />I will not say the exam is hard, it is open everything and all materials are provided, but I will say it is very intense.<br />Q1 circuit simulation using TinkerCad (43min)<br />Q2 given datasheet of IC, write some driver functions (43min)<br />Q3 given datasheet of IC and an STM32 chip version, draw wiring + generate CubeMX project + code in C using HAL_library (73min)<br /><br />If you know how to extract useful information from datasheets and understand the timing diagram quickly, and then write the working code quickly, and most importantly understand what the question is asking quickly, you will be able to submit a solution a few minutes before the deadline. If you don't, practice datasheets reading, just to know how to code that chip to work by reading the minimum amount of content, which is also the assignments are doing. <br /><br />Full mark of the Exam is 160<br />Mean: 95.4<br />Stdev: 26.46<br /><br />me 148.5/160 =&gt; A+ (seems to be the highest)",
            "comment_workload": "since no project, the workload is very light,<br />just 6 labs which each of them can be done in 1-2 hours before the demo (Tutorial notes will teach you everything) and 3 easy assignments each can be done within a day<br /><br />I did not revise for the final, and it turns out revising the lecture is not quite helpful for the final, your datasheet reading and implementation skill are more important for the final.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 10,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}