{
    "error": false,
    "course": {
        "id": 3776,
        "subject": "EMIA",
        "code": "2020",
        "name": "Cross-disciplinary Design Thinking",
        "description": "This course focuses on user-collaborative design methods for generating inclusive product solutions that integrate stakeholder and product functionality perspectives. Students will create specified product/ process /policy /protocol /plan (5P) concept models using recursive user feedback engagement methods, experimental prototyping, and divergent and convergent ideation strategies. Featured topics include design thinking; stakeholder research; concept development, screening, and selection; and interaction design. For students enrolling in extended major programs and students with consent from the instructor.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 2.61,
        "rating_teaching": 2.48,
        "rating_grading": 2.61,
        "rating_workload": 1.55,
        "review_count": 31,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1208,
                "name": "MOK, Luisa",
                "count": 21
            },
            {
                "id": 1644,
                "name": "ZHANG, Rong",
                "count": 17
            },
            {
                "id": 378,
                "name": "ZHENG, Rong",
                "count": 6
            },
            {
                "id": 1365,
                "name": "ZHOU, Jinni",
                "count": 4
            }
        ]
    },
    "reviews": [
        {
            "hash": "vFSLSojx6VoqFHKjxCUT1f8suX1QhJWe",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 0
                },
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "adounope",
            "date": "Nov 30, 2022",
            "title": "a total disaster, with trash content, full of on9ness",
            "comment_content": "if you are looking at this, that means, you are another desperate victim of this disaster.<br /><br />as a required course for +AI major, this course have nothing to do with AI, not even code, it just full of stupidity and its level of on9ness is comparable to most common core course, like lang1003.<br /><br />to have a short conclusion of this so called &quot;course&quot;,<br />it is of blowing water, rather than technical skills.<br /><br />at first, it have a shitty field trip to TKO market, and instead of spending most of the time taking photos and observing the environment there,<br />the instructor arranged less than 10 minutes for us to do the above, and most of the time for a guy from the management team of the market to have a 1 hour shitty trash talk to us,<br />which in the later work, no one even need to use any of the information mentioned in his trash talk, at this point, I realized this course is a fked up piece of mess.<br /><br />on another day, they asks us to do a so called &quot;social experiment&quot;,<br />they require each group to pick a person(victim) to simulate an elderly by wearing some shittily stupid, fake looking wig and wearing some elderly style shirt, then go to the campus starbucks to buy some drink,<br />to test out the empathy of the general public,<br />but through out the so called &quot;experiment&quot;, we were constantly drawing public attention,<br />because everyone seen us as a bunch of idiot, which I can highly understand.<br /><br />later, they ask us to give some shits ideas to so call &quot;solve&quot; the problem of the market, and asks us to do survey in the market about why the market are looking so shitty.<br /><br />near the end of the semester, they ask us to build our ideas,<br />and instead of making some real device,<br />they only gave us some cardboard and plastics,<br />then do a presentation to tell a shitty joke of how this trash can actually works (which is the final presentation)",
            "comment_teaching": "I'm telling everyone that our +AI major was studied in wet market,<br /><br />And even in the second year in UST, we havent take any course about AI yet, <br />instead, we spend our time on this shittily unorganized disaster.<br /><br />this course should seriously be removed.<br /><br />useful tips for future students:<br />classroom geometry matters,<br />choose your seats wisely,<br />do not sit on the side where Ron and Luisa can directly see your laptop screen, if they see you are doing COMP assignment or reading math lecture notes, they will open mic to asks you to close your laptop.",
            "comment_grading": "the midterm is a presentation<br />the final also.<br /><br />my group was the place holder of the lowest presentation score out of in the entire session, I get D",
            "comment_workload": "I am giving this course workload a D because I am mostly freeriding my groupmate, but they may give worser workload grading.<br /><br />its assignment is completely meaningless and on9, like they require us to do survey that no one cares,<br /><br />it dont actually check attendtence, I have a groupmate only attend at the last 15 minutes of almost every lesson (the lesson is 3 hours each), but hes fine",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 24,
            "vote_count": 25,
            "voted": false,
            "is_upvote": false,
            "comment_count": 3,
            "attachments": []
        },
        {
            "hash": "BzWMUxIhU10cgBovwXLDdzEjxcyDuVeR",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 0
                },
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Happypig375",
            "date": "Jul 22, 2023",
            "title": "You don't have to take this course nor drop your extended major. Here is a guide to credit transfer it (Workload section).",
            "comment_content": "Come on. It's just design thinking (an iterative process to generate user-centric solutions). Empathise, Define, Ideate, Prototype, Test. Empathise to help Define the problem, learn from new Prototypes to spark new Ideas, Tests create new Ideas, Tests reveal insights that reDefine the problem, and Tests give more ways to Empathise with users. All in a few sentences - How hard is the content?<br /><br />But Luisa forces students in this course to solve problems that don't exist. When doing design, we empathise with many users to find a problem we can solve for one of them (say elderlies at home without anyone to look after them, who may face loneliness or even missing emergency services in the event of a heart attack. The Care-On-Call Service (平安鐘) was invented after empathising with their needs - someone to talk to available at a button press. This person may even forward cases to social care services. https://www.schsa.org.hk/en/homepage). But in this course, we are limited to a very narrow group of users who are already content with what they have (past topics: in the TKO market (2022-23 Fall), and in HKUST LG7 canteen (2022-23 Spring)). Frankly, we are just bothering them and being the problem ourselves. It's a failure in empathising and defining.<br /><br />Then, in design thinking, we generate ideas that should work in reality for solving the problems we defined. But this will not satisfy Luisa - she wants creative and unrealistic solutions. She likes rebuilding the entire TKO market and does not like cost-effective solutions. It's a failure in ideation.<br /><br />Next, in design thinking, we would create prototypes that can be tested on users for finding whether their problems may be solved by our ideas and gather new insights we have not previously considered. But Luisa wants cardboard boxes that are just for display. We are not solving anything, instead, we create more problems - waste of wood that damages the environment. It's a failure in prototyping and testing.<br /><br />Frankly, if we follow design thinking properly, we would<br />- empathise with extended major students who have to face this headache<br />- define the problem: a course that has poor content+teaching+grading+workload that won't contribute to their learning and future but is required<br />- ideate: we would avoid this course if possible so ideally a T grade would do<br />- prototype: make some credit transfer mappings from other universities virtually for zero cost<br />- test: have extended major students take those courses and have a T grade for this course!",
            "comment_teaching": "Luisa teaches and grades to her liking. But there is one thing she teaches well: How to be an asshole with TA and student exploitation, with changing requirements.<br /><br />Rong teaches better but the course is still managed by Luisa. Rong now has little power over how this course is structured. This course was good when Rong managed the course (2021-22 Spring). My grandmother used to tell me stories about the old days, a time of peace when the Rong kept balance between the Content Tribes, Grading Kingdom, Teaching Nation, and Workload Nomads. But everything changed when the Luisa attacked.<br /><br />This is like the only course getting below 2 in SFQ score btw. (http://sfq.ust.hk/results/ipo-s23.html, L2 by Luisa: Course mean 1.89, Instructor Mean 1.94)",
            "comment_grading": "Didn't participate and make yourself memorable? GG in your grade.<br />Prototype not &quot;creative&quot; enough? GG in your grade.<br />Screwed up the first few assignments? Don't worry, you will continue to score low. GG in your grade.<br /><br />Rong's grading seems to be managed by Luisa too. Don't think Rong can save your grade.",
            "comment_workload": "You are supposed to work hard for producing trash to satisfy Luisa, possibly sacrificing your GPA and time from other courses. But fear not. You do not have to take this course. You can credit transfer it instead and receive a T grade which is counted in GPA like a P. (Excluded from GPA calculation)<br /><br />Credit transfer has two types: on entry and during study. On entry is like IB, IELTS exams etc presented to the school on entry, which is not applicable here. Credit transfer during study has two further types: Virtual exchange and physical exchange. Physical exchange is risky (in course selection) and expensive so it will not be discussed here. Virtual exchange, in the specific case of APRU virtual exchange (HKUST (not APRU) application here: Fall/Spring https://mystudyabroad.hkust.edu.hk/index.cfm?FuseAction=Programs.ViewProgram&amp;Program_ID=13106, Summer https://mystudyabroad.hkust.edu.hk/index.cfm?FuseAction=Programs.ViewProgram&amp;Program_ID=13180), it is free of charge. You pay nothing for credits!<br /><br />The first courses that are our &quot;Prototype&quot; mappings are from Osaka University - the two design courses here for Fall 2023 https://vse.apru.org/osaka-s12324/ coded 88A069 and 88A075, and the design course here for Spring 2022 https://vse.apru.org/osaka-s22223/ coded 88A070. The mappings will apply to all future semesters with the same course. Note that these Osaka design courses only accept students in year 3 or above because in their course listing, in the table row of &quot;Course Prerequisites/Restrictions&quot;, they write that &quot;Target students: All faculties except Medicine. 1st and 2nd year undergraduate students are not allowed.&quot; But these prototypes are so successful that even year 2 students I contact with, want to apply every semester already.<br /><br />A few things of note for virtual exchange:<br /><br />- The application deadline for these virtual courses: July 31, 2023, in this specific semester (seen on the Osaka University APRU course listing webpage). This deadline is only for your APRU (not HKUST) application here https://vse.oal.cuhk.edu.hk/student/login (also required by the &quot;(OVE) Choice of Course - APRU VSE&quot; step in the HKUST application system)<br /><br />- You must obtain school (for students without majors yet) or major department (for students with majors) approval by emailing this form https://mystudyabroad.hkust.edu.hk/_customtags/ct_FileRetrieve.cfm?File_ID=104844 (also available in the &quot;(OVE) Upload signed endorsement from your major department&quot; step in the HKUST application system) to your school or major department. They may ask for your academic transcript to determine if your credit load should be limited as a result of this application (basically (A) or (B) in Section IV of the form). Since your HKUST application can be completed after the APRU application (to update your APRU application system status to &quot;Endorsed by Home U&quot; before the offering university's decision of &quot;Approved by Course Offering U&quot; or &quot;Not Approved by Course Offering U&quot;), you can delay your course choice in APRU application system until the deadline.<br /><br />- If you are an SBM student, then you can only apply for one virtual course per semester regardless of credit load. This is mentioned at https://bmundergrad.hkust.edu.hk/files/exchange/Exchange%20Application%20General%20Policies%20-%20Updated%2012%20Jul%202023.pdf, &quot;24. Students are only allowed to take ONE virtual course concurrently with their courses in a semester, regardless of credit load.&quot; The enforcement mechanism for this rule is through a school override of major department approval. However, I noticed that this enforcement is only available in Fall and Spring semesters. You can take as many virtual courses in Winter and Summer if you like as an SBM student since the school will not have this enforcement mechanism available. Even if APRU Virtual Exchange is not available in Winter, there are still other valuable opportunities like Fudan University winter school (check email during October! It has the title &quot;HKUST Winter Mainland Virtual Program: Winter School @ Fudan SOE&quot; and is sent by &quot;study-abroad-request@lists.ust.hk on behalf of the HKUST Office of Global Learning&quot;. Its application deadline is a week after the email so you should be careful. Details here https://mystudyabroad.hkust.edu.hk/index.cfm?FuseAction=Programs.ViewProgram&amp;Program_ID=13111) which offers easy credit transfers, especially for ECON. 2 courses in 3 weeks - if both are 4 credit ECON courses then you can reach 8 credits in 3 weeks. But Fudan University summer school can only transfer 2 ECON credits per course - not as cost-effective as winter. You can search for other exchange opportunities here: https://mystudyabroad.hkust.edu.hk/index.cfm?FuseAction=Programs.SimpleSearch, specifically, course selection before HKUST application is categorised into &quot;Program Enrollment&quot; while course selection after HKUST approval is categorised into &quot;Outgoing&quot;. Both types may be free of charge or paid, it varies program to program. Note that searching this way only reveals past or present opportunities and does not guarantee future offerings. Meanwhile, I expect Fudan University winter school and APRU virtual exchange for Fall/Spring/Summer to be continually available every year.<br /><br />- You still have a risk of being rejected by the course offering university if the quota is limited and your CGA is worse than your competitors (HKUST students disadvantaged here) or they have a preference in enrolling specific majors (like Shanghai Jiao Tong University's summer school preferring civil and architectural engineers) or years (like Osaka university design courses requiring year 3+). However, it seems that universities are less strict about you giving them outdated IELTS results if they can meet the English language requirement given that you already meet their GPA requirement.<br /><br />- You also have to pass this course (not receiving F) to successfully transfer this course. However, most universities outside HKUST usually give you at least a C if you hand in assignments even if you did not do well in exams. That said, failing an exchange (virtual or physical) will just mean you fail to transfer the credits. There will not be an F on your transcript. It is always better to try transferring this course given virtual exchange costs you no money anyway. It's zero risk.<br /><br />- You cannot transfer FINA-prefix courses using virtual study. You can only transfer them for physical exchange. A dick move from the FINA department, I know, but this is an aside for the EMIA2020 transfer.<br /><br />So, here are the steps to credit transferring EMIA2020:<br /><br />1) Check the APRU course list regularly for any courses with the word &quot;Design&quot; or &quot;Creativity&quot; or &quot;Innovation&quot; that includes the topic of Design Thinking (I hypothesise that any course that talks about Design Thinking will be able to transfer to EMIA2020. Also, the same topic can transfer to ENTR1001 since that course centres around Design Thinking as well). Don't wait for email promotion from the Office of Global Learning because you want to apply for new mappings at least a month in advance. Say, we found Osaka's design courses here.<br /><br />2) Check if you are eligible for the GPA/semester requirements, English language requirements (an example for these two are in https://vse.apru.org/yonsei-s12324/), and any course-specific restrictions (as seen in the Osaka design courses 88A069 and 88A075 in https://vse.apru.org/osaka-s12324/ because in their course listing, in the table row of &quot;Course Prerequisites/Restrictions&quot;, they specify that &quot;Target students: All faculties except Medicine. 1st and 2nd year undergraduate students are not allowed.&quot; The format of these requirements is consistent, in the same places as the examples. Also, avoid non-credit-bearing courses (Waseda University is the only example at the time of writing https://vse.apru.org/waseda-s12324/). Some universities only allow you to apply for ONE course in that university in that semester (Osaka University does this for example) so you should take note of this in later steps as well - you wouldn't want to write two courses in your school or major department endorsement form and get limited in HKUST credits allowed in the same semester based on deduction of two courses from your credit limit, when you can only get into one.<br /><br />3) Check what HKUST courses you can transfer from these courses. Even if the official way is checking at https://registry.hkust.edu.hk/useful-tools/credit-transfer/database-institution, this way only provides you with past successful mappings and not past denied mappings. That said, if the course has been approved before as shown by searching in that database using this University, and specifically EMIA2020 on the right-hand side, then congratulations! You can take the course to use that mapping and don't have to follow the rest of the steps, you can just apply for this course directly in the APRU and HKUST application systems with major department or school approval, and expect a credit transfer when you complete the course.<br /><br />4) If the mapping is not there by searching the official route, we can abuse the credit transfer application system at https://w5.ab.ust.hk/jsct/ct_stdt_appl to reveal if this mapping has been applied before and denied, or expired because of course code changes or course cancellation.<br /><br />5) In the credit transfer application system, click &quot;My Application&quot;, then scroll to the bottom to click &quot;here&quot; in &quot;If you wish to apply credit transfer for other institution, please click here to specify&quot;.<br /><br />6) With the category &quot;On Entry&quot;, write the university name in &quot;Institution&quot;, and select the result with &quot;through virtual study&quot; at the end. (The non &quot;through virtual study&quot; is for physical exchange). Then, since the Transfer Term (for when the mapping starts to apply) is locked to your entry term, you must work around it.<br /><br />7) Right-click the Transfer Term box with your entry term and left-click &quot;Inspect&quot;. The developer panel of your browser should appear, and in the HTML code (the text with lots of angle brackets &lt;&gt; &lt;&gt; &lt;&gt;), there should be a line highlighted starting with &quot;&lt;select&quot;. To the left of the &quot;&lt;select&quot;, there should be a right-pointing triangle. Click that triangle. It would reveal a line starting with &quot;&lt;option value=&quot;. To the right of the &quot;&lt;option value=&quot;, there should be a four-digit number corresponding to your entry term. For example, for 2010: the first two digits represent the academic year - 20 means 2020-21, 21 means 2021-22, and so on. The third digit means the semester: 1 means Fall, 2 means Winter, 3 means Spring, and 4 means Summer. The fourth digit is always zero.<br /><br />8) Double-click the four-digit number to change it to our transfer term. For example, the Osaka design courses will be taken during 2023-24 Fall. Then, the term code should be 2310 because 23 means 2023-24 and the third digit 1 means Fall. BE CAREFUL! Entering a wrong number or entering a number at least 1 year from the current term (say 2410 (2024-25 Fall) when the current term is 2023-24 Fall) and not fixing it before continuing, will result in the system being broken. You do not want to waste time emailing iselaine@ust.hk (The Information Systems Office staff responsible for the Credit Transfer mapping system) to request the term code to be changed. When done, you can close the developer tab that appeared when you clicked &quot;Inspect&quot; using the &quot;x&quot; button at the top right of this panel.<br /><br />9) Click &quot;Submit&quot;. You will now see your raised credit transfer mapping list. Now, click the blue &quot;+ Add Course&quot; at the bottom. Click the &quot;Expired mapping&quot; checkbox to view expired mappings due to course code change or course cancellation too. You can search for &quot;EMIA2020&quot; to see if any course has expired or denied mappings to EMIA2020. Or you can search for the course name too. If there is a denied mapping, then you're in trouble and have to justify why the course matches EMIA2020 by comparing the syllabuses or otherwise. You'd be better off finding another course.<br /><br />10) If there is no mapping at all, then you can try requesting a new mapping. Scroll to the bottom and click the &quot;here&quot; of &quot;If you cannot find your incoming course, please click here to add&quot;.<br /><br />11) Fill in the course code, course title, course unit (the first box for a numeric number, the second box for the unit like &quot;credits&quot;), and course hours per week/no. of weeks. Course hours per week/no. of weeks is not important for the mapping and is only for future students to look at when they reuse this course for new HKUST course mappings. But the course code, course title and course unit must match the course listing on the APRU website.<br /><br />12) Search the HKUST equivalent course using the blue 🔍 button, and enter &quot;EMIA&quot; for the first text box. The second text box is for the course code, you may enter &quot;2020&quot; there but you can also just select EMIA2020 by searching &quot;EMIA&quot; alone. The &quot;Academic Organisation&quot; is for searching by department code, for example, &quot;CSE&quot; for &quot;COMP&quot; and &quot;CSIT&quot; prefix courses, or &quot;LANG&quot; (probably for the old name &quot;Language Center&quot; before the name of CLE) for &quot;LANG&quot; or &quot;LABU&quot; prefix courses. For your reference, if you want to transfer a requirement (e.g. common core broadening Science area, Entrepreneurship minor elective Fundamentals, ISOM 3000 level course IS side, SOSC 1000 level SA common core, COMP major elective Computer Systems / Networking area), this is where you don't search the course but instead type in the &quot;Course Title&quot; textbox. Be as specific as possible (like those examples and not just &quot;COMP major elective&quot; without writing about the area) or you risk a &quot;Needs more Information&quot; response a few days later and delay your mapping.<br /><br />13) Now upload the syllabus documents. The system only accepts PDF files as syllabus documents. Usually for APRU Virtual Exchange, you need two types of files: A PDF Save of the APRU course listing webpage with the course section opened, and all syllabus documents linked in the Course Outline in the course section, converted to PDF. On a Windows computer, you can save a webpage as PDF using the Ctrl+P shortcut and choosing &quot;Microsoft Print to PDF&quot; as the printer. Clicking &quot;Print&quot; will bring up a save file dialogue to save the webpage as PDF. Note that you must provide English versions of all syllabus documents. So for example, if a mainland university has course outlines in Chinese, you should use an online service to translate the files from Chinese to English. You don't have to worry about translation quality since you will also submit the original language file together with the English machine-translated file. But you should still hand-modify the course title, course code and credits to match the APRU course listing. Not translating the files to English risks a &quot;Needs more Information&quot; response a few days later and delays your mapping.<br /><br />14) Check that your syllabus files to upload, when combined, includes all the required information. This includes<br />- Course code, course title, number of credits<br />- Content (Course description / Intended Learning Outcomes)<br />- Assessments (Work to be done and Proportions of final grade)<br />- Schedule (Date and time of each lecture/tutorial/laboratory. Past semester information is allowed)<br />Missing any of this information risks a &quot;Needs more Information&quot; response a few days later and delays your mapping. If you cannot find one of them, consider contacting the university for more information and print the email conversation as PDF.<br /><br />15) Leave the &quot;Grade Obtained&quot; textbox empty.<br /><br />16) Click the blue ✓ button to submit this new mapping request. Expect anywhere from two weeks to a month to wait for a response. However, if a &quot;Needs More Information&quot; status is given, it will only take a few days. You don't need to check this system every day since the system will send you an automatic email update when the status changes, but still you can notice early signs of denial by looking at the course mapping list. For example, if a new mapping suddenly appears with &quot;Pending&quot; status for the same course you are trying to map to PHYS1003, but instead this mapping is towards PHYS1000LEVEL, then this is likely a recommendation from the PHYS department for the Academic Registry to process as the course to map to instead. You can expect a &quot;Mapping denied with others proposed&quot; result a few days later. But this is just a heuristic, not 100% accurate since there is still a chance that another student simply made this mapping request instead of the department.<br /><br />17) If you waited and got the green circle as the mapping status, then congratulations! You can continue onto registering for this course. Otherwise if denied, you can try justifying by comparing the course under mapping to the HKUST course (EMIA2020), but you are usually better off looking for another course instead.<br /><br />18) If the mapping is still under review by the time the deadline is reached, you can either take the risk of mapping rejection by applying for the course anyway or look for another course instead and risk missing an approved mapping - courses are not guaranteed to be offered next time. Note that you can still email the APRU system staff to withdraw your application before being accepted, and you can also withdraw from the course once accepted. For the latter case, I don't know the impacts on your chances of enrolling into a future course by the same university successfully though. This is why I recommend you apply for a new mapping at least a month before the application deadline.<br /><br />19) After completing the course, you should notice a new application that is added by the Office of Global Learning with the category &quot;Study abroad (HKUST organized) (Virtual)&quot; instead of the &quot;On Entry&quot; added by yourself. You should use that for official usage of mapping requests instead. You can still &quot;+ Add Course&quot; to make use of your previously approved mapping request. You don't need to upload the syllabus again for reusing an existing approved request but you do need to input the grade. If your final grade will be released after the semester ends, you can still type a &quot;TBC&quot; (note this textbox only allows 3 characters so you might be tripped up by spaces) as a placeholder to indicate this course to be processed by the Academic Registry. Click the blue ✓ button to submit one last time.<br /><br />20) Your transcript upon completion of this virtual exchange course must be sent directly from the offering university to HKUST, whether to the Office of Global Learning or the Academic Registry. This should be automatic as standard practice, you should not send or upload the transcript by yourself since it would be unverifiable by HKUST. You might check progress by emailing the Office of Global Learning (study.abroad@ust.hk) since virtual exchange updates should go through it. Not having the transcript will result in your application being stuck on &quot;Pending Official Transcript&quot; as a Reference Tag. <br /><br />21) Wait again - the credit transfer process may take as long as a few months or as quickly as a week. The Academic Registry seems to only do &quot;Complete initial check&quot; by the end of each semester so if you submit the application and miss when they check credit transfer mappings, you might need to wait until a few months more. Meanwhile, submitting at the right time can get this done in a week. Upon clicking the blue ✓ button, your application status action list (seen by clicking the 🔍 next to your Application Status) will have a &quot;Submitted&quot; action, then after &quot;Transcript verified&quot;, &quot;Complete initial check&quot;, &quot;Complete review &amp; Post&quot;, finally &quot;Approve&quot;. The T grade will appear on your academic transcript when &quot;Complete review &amp; Post&quot; is done - you do not need to wait for Approve. A side note: Program Office Endorsed in the Status table above application status action list seems to always be &quot;--&quot;, and the Checked seems to always be a yellow triangle. I suspect the Checked may only be done on graduation. I don't know for sure.<br /><br />There you have it - extended majors without the pain of EMIA2020 and Luisa Mok. Good luck with your virtual exchange experiences!",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 22,
            "vote_count": 22,
            "voted": false,
            "is_upvote": false,
            "comment_count": 4,
            "attachments": []
        },
        {
            "hash": "RqpTsjFODu4EOS9iHjlUFkNLDvDW3zZo",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 0
                },
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SmokingPuddle58",
            "date": "Dec 21, 2022",
            "title": "Regrets. Very bad course, hate from students with extended majors.",
            "comment_content": "In the 13 weeks you will be finding a problem in wet markets organized by Link (Mainly TKO Spot), then you will need to solve the problem.<br /><br />What I expected to learn:<br />- How design thinking process can be applied in product making<br /><br />- How cross-disciplinary can be applied in design thinking process<br /><br />What I actually learnt:<br />- How to make a mask holder and a hat and how to squeeze lemon in creative way (Not bad imo to train creativity)<br /><br />- Problem solving skills (When incorrect assignments are being created in canvas, how you can solve the problem by finding TA (I have done so for twice))<br /><br />- Time management skills (You have to complete 3 early prototypes within 1 week, 1 final prototype within 1 week, and final with user testing within 1~2 week)<br /><br />- Two-point perspective, which you don't actually need that in your assignment (As long as you can show your scale correctly you don't need to use this method in A3)<br /><br />- How to cut cardboard and pink foams and how to use glues/tapes correctly<br /><br />- How to work in &quot;extreme condition&quot; (Without sufficient tools and without a suitable place for prototype making, we sometimes need to make prototype outside the classroom)<br /><br />- How to boast the ideas and prototype(s) to your professor and fellow students<br /><br />- How to build a good relation with professors as they will grade the assignment<br /><br />- How to merge PDF files, cut videos and how to draw illustration even if you are from ENGG or SSCI (Not CAD one) (Quite useful imo)<br /><br />- How to bring annoyance to market vendors, customers and to yourself by &quot;interviewing&quot; them (Some vendor refuse to be interviewed, and some said they have been interviewed by UST students for many times)<br /><br />- Bauhaus, Functionality and some pro terms that will never be used in creating prototypes and in your final presentation<br /><br />- How to be sustainable in prototype making (Come on! Professors and TAs are throwing useful resources away when they received complaint for blocking corridor! Also they are throwing some prototypes right after the final presentation! That's a waste of resources!)<br /><br />- How to build a rigid prototype by using what you learnt in PHYS1112 and how protect your prototype as the course do not have a proper place to place your prototype (See image for details)<br /><br />- How to make a reflection when you actually really don't know what to reflect (The same as LANG1003 reflection, I dare not say anything bad in this course)<br /><br />Take your time from 19 Dec 2022 to 6 Jan 2023 to visit the exhibition near LT-A to see how we tortured trees and plastics into prototypes.",
            "comment_teaching": "The only part that I can barely give you a pass. (Edit: Not a pass now. I now fail you for this part 1 semester after taking this course as Luisa is not trying her best to improve this course.)<br /><br />I say nothing about Rong as he's quite kind. But I want to talk more about Luisa, Luisa is perfectionist and she want high quality works. If you have any doubts about the wording in her comment and marking scheme please consult your TA ASAP as every word by Luisa may have deeper meaning. For example, Luisa asked us to &quot;tidy up the prototype&quot;, and from our TA, this word means to nearly rebuild part of our prototype. So please pay extra attention to this! <br /><br />Also, as mentioned by adounope, please try to find a place that Luisa cannot see your computer screen if you really need to use computer as Luisa will probably stop you from using computer. I was filling out the budget plan for this course during the final presentation and Luisa stopped me from doing so as she can see my screen. <br /><br />Still, I would like to give appreciation for the TAs. They did the best part of the course.<br /><br />Something extra for new students who have +AI/+DMCA:<br />Both instructors seem to be very bad according to the reviews. So, you either drop the course, or you better to be prepared to be f**ked up by (one of the) instructors.",
            "comment_grading": "4 Assignment (A1 A2 A3 A4): 10% each<br />15% Midterm<br />40% Final<br />5% Participation<br />Peer Review (Affect your grade) (5 is full)<br />(If &lt;4: lower 1 sub-grade, &lt;3: lower 2 sub-grade) <br />In the end peer review part got disappeared.<br /><br />I have nothing to say about grading as the marking scheme is unclear, really unclear and I sometimes have to ask for clarification.<br /><br />Something extra<br /><br />You are provided with ~1000HKD budget for prototype making.<br /><br />Something extra (1)<br /><br />Grades are released and I got a B+<br /><br />Given that I got insomnia and nausea due to this course and I put bunch of time on this instead of on other courses which are more important, I think Luisa can grade better.",
            "comment_workload": "As great as a 5-credit course.<br /><br />Every 4-credit math course I ever take (Applied Stat, Linear Algebra and Multivariable Calculus) have a lighter workload than this.<br /><br />As what I mentioned, you are required to do many things, like make some drawing and the deadline is usually within one week. For one week we even totally spend 24 hours on a single assignment. What's even worse is that the workload is huge during midterm and final period and I even got insomnia during mid-term period as I am afraid I cannot finish the task on time.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 16,
            "vote_count": 16,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "PX5fWAQZwSWJ43XIp2Ne3VaxeLbtIqkI",
                    "name": "IMG_20221123_111214",
                    "format": "jpg"
                },
                {
                    "key": "sZxGqoGwTzNyMYr1V944lJxu6Y5xGBni",
                    "name": "IMG_20221202_165730",
                    "format": "jpg"
                },
                {
                    "key": "j3PU9FYDoINRp75SeYFj6RuAshXbOvJQ",
                    "name": "1669431355576",
                    "format": "jpg"
                }
            ]
        },
        {
            "hash": "Yj4UIRFNyhXETmhEfHyIdXcPT0dRoian",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Sonor",
            "date": "Dec 07, 2022",
            "title": "Sightseeing in TKO market, then produce garbage to TKO landfill",
            "comment_content": "The course has mandatory sightseeing, which visits TKO market. After sightseeing we will make garbage which end up in TKO landfill. The lecture are not very helpful, after going to lecture you will still feel very confuse when you are doing the final model and the course work. Beside, it requires some art skill for the mind map.",
            "comment_teaching": "The lecture not very useful.",
            "comment_grading": "The Grade is harsh if you want a better grade you must do the extra work like the challenge part.",
            "comment_workload": "The workload is too heavy especially the modal and report. Sometimes need to make some garbage and present it week by week with a ppt.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 11,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QJR3HBa51CQMIC09hb242MMdQ3i0opI5",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ehhh",
            "date": "May 29, 2023",
            "title": "massive regrets",
            "comment_content": "*All the reviews can only be applied to the Luisa experience*<br /><br />Do you like being tortured? Or losing your mind and contemplate on jumping off the mushroom? Or do you like endless work with vague instructions? If you said yes to all of the above, then this hellhole shit course would be perfect for you!!!!!<br /><br />This course said that it teaches design thinking skills, how you would be able to leave with this fantastic skill of EmPAthY and DEsIgn ThINKing. No, all you gain from this course is how to obey the instructor, as there is only one overlord in this course, and high degrees of suicidal thoughts.<br /><br />The topic for this year is &quot;zero waste bot&quot;. A normal person with basic cognitive skills would understand that as you would need to design a solution that is a robot in the end. BUT WAIT!!!!! SURPRISE!!!!! The topic changed in the middle, and she don't like that you designed a robot. So you would need to redo everything again!!!!<br /><br />You will learn nothing in this course, so there is essentially no content. Just give up and drop the +A extended major while you can.",
            "comment_teaching": "This is Luisa's world, and we are just something to fuel her ego.<br /><br />If you see her name anywhere, run. Just run. There is a reason she is not in ISD anymore and now is torturing IPO and EMIA students.<br /><br />I would not question on her professionalism as a designer, I believe that she got at least some capacity and knowledge in this field. But as an instructor, especially teaching design thinking to a bunch of science and engineering students, she is definitely not qualified.<br /><br />This course emphasizes on empathy, how you should step into the other's shoes to see the problem in order to find a solution. But, how could someone with no empathy possibly teaches this? She does everything she likes, and does not consider others thoughts. She adds on additional work and treats the TA for this course as a personal slave. She does not care about how you think or feel and would just straight on reject your old way of thinking just because it differs from how she thinks. She is the reason this course would need to exist. In my opinion, she need to go.<br /><br />Her lack of professionalism as an instructor extends further than the lack of empathy. In the duration of the whole course, she emphasises on the importance of doing things based on the data you collected. While this is not wrong, she would judge your solution based on her pre-defined knowledge. Even if you collected sufficient data to support your point, or your decision, she would not care. She had a perfect solution for you, and&nbsp;&nbsp;if you don't do that, prepare to get a D in this course.<br /><br />If it is just the fact that she is lacking in skills for this course specifically, fine, whatever. But to interrupt the class due to her personal reasons would be not acceptable as a teacher. She would stop anyone from questioning the TA just because she required her to quickly finish something that is not within the TA's work duties. She sees questioning as a not correct way of learning&nbsp;&nbsp;and god forbid if that interrupts her personal display fair or publishing! What a joke of a instructor.<br /><br />The only saving grace is the TA Natalie. Thank you Natalie.",
            "comment_grading": "Your grade is highly dependent to how much the instructor likes you.<br />If she likes you and your group, then you would have an easier time.<br />But if she don't, then good luck.<br /><br />Also the course is 100% group grading, meaning that everything is graded based on group, so you and your groupmates would get the same mark, but the course would be following the UST suggested distribution on grades. This is the most bullshit decision anyone could have made.<br /><br />I got a B in the end, good riddance at least I don't need to endure this again.",
            "comment_workload": "Shit. <br /><br />You think language course is worst? Think again!<br /><br />Here is the things you would need to do in this course:<br />1. an assignment every week, 5 in total<br />the first 3 is fine, i guess. but the 4th is to show a series of prototype, basically you would need to make at least 2 of your design and show progression in development. you only got a week to do that, and you got other works to do too.<br /><br />2. the final prototype needs to be completed in just 5 days. along side a 6 min PPT, 2 min video on how the prototype works, and 2 PDF documents, one on the summary of all your past assignments with needed corrections, and one on the reflection. This is during the week of deadlines.<br /><br />3. interviews and user testing.<br /><br />4. midterm PPT<br /><br />We have all worked day and night. Anytime you go to the 5th floor of the lift 31 32 building you would see people there. Oh right, all of the prototype you would need to do it in the corridor!!!! <br /><br />look up to the credit. Its 3. this is a 3 credit course. with all the 4 credit course combined, i don't think that could even surpass the workload of the course. This is a 6 credit course workload. I want to die.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 9,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tYdrFZC7qMxIsj8TC0cPNvpcT4HXhS9X",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 0
                },
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DaydreamCafe",
            "date": "Dec 10, 2022",
            "title": "DROP THIS unless you're fond of AI",
            "comment_content": "All about design thinking. I don't mean the skill of design thinking is useless, but the course materials were impractical, not to mention how hard to understand the content as a non-ISD student. The course was centred around solving issues in a wet market TKO Spot. To be honest, what left behind were those no one wanna solve. The course just asked us to raise unreal solutions to change nothing eventually, but paradoxically it said design thinking was to solve real world problems. What a complete waste of a full semester on garbage like this.",
            "comment_teaching": "The female instructor taught most of the course materials. However her teaching was hard to comprehende as an engineering student. I don't know whether it was my intellegence issue or her expression problem. Her feedback was useless, just like she has not given at all as no one understood. On the other hand the male professor gave rational feedback but sadly he didn't grade.",
            "comment_grading": "This is the most nonsense part of the course. The instructor graded depending on her subjective opinions rather than how much we followed the guidlines (which again was rubbish because it was changed constantly). It all comes to your ability to leave her a good impression at the beginning of the course. As you started with something dissatisfying her, you're screwed up anyways, no matter how hard you've corrected the mistakes.",
            "comment_workload": "I can't even count how many nights I've stayed up and the number of brain cells killed just because of this course. A time-consuming assignment has to be handed in every week. Maybe they don't expect you to study other courses in a semester. You need skills from every discipline, from photoshop, PowerPoint, video editing, presentation, graphic design, etc to complete the coursework. Yet, the whole project is meaningless at all. You may still get a shitty grade despite all the hardwork.<br /><br />Finally, as a compulsory course for the +AI extended major, please reconsider after you've read the comments. I regret not dropping +AI during add-drop period. Go study LANG instead if you're in year 2 and don't really like AI related stuffs like me. Of course the best choice is not to opt-in at all.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 8,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 3,
            "attachments": []
        },
        {
            "hash": "1bZW0OoTQOW5m7kqIJOv1vCH5DSbmYiQ",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 0
                },
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TonyChan",
            "date": "Jan 03, 2023",
            "title": "If Luisa is still teaching this course, highly suggest you to wait :)",
            "comment_content": "The course is project-based and the orientation of the course is good. However, the project theme is improving something in wet market while our instructors seem don't understand about wet market. <br /><br />Two Phrases:<br />Before Midterm: Understanding how to define the &quot;real&quot; problems.<br />After Midterm: Understanding how to have &quot;creative&quot; solutions.<br /><br />*What I mean &quot;real&quot; and &quot;creative&quot; here is what Luisa likes.",
            "comment_teaching": "Luisa tries her best to give all her knowledge to you but you never know what knowledge she has given. She tells you what to do but she never grade on top of it. She listens to your opinions but she never respect it. She is a standard &quot;teacher&quot;. <br /><br />Rong is a good and kind teacher. He is so nice that he can partner with Luisa but he is more like a TA in this course. His opinion is useful but not reltaed to the final grade. BTW, Luisa is living in her own world so Rong's ideas are always contradicting to Luisa's.",
            "comment_grading": "I get a B in this course and the only way to get a good grade in this course is to become the dog of Luisa. She dominates the course and gives grade according to her mood. <br /><br />To survive in this course, you need to understand how to make Luisa happy. My two tips are never retort and treat her like your Asisan parents. Also, if Luisa likes your idea, you can break all the rules including page limit or what to invent.<br /><br />* The real suggestion is to do the best in the two individual assignments. They are the reason why I can get a B. Good Luck.",
            "comment_workload": "The workload is heavy as fuck. The estimate project time is about 15-20 hours (in groups) while the grade is not promised. The assignments and projects require you to spend a lot of time so try to do things early.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VCmWqd2isiKeURWmqCAUBipa4tTjBdGc",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 0
                },
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "anonymous727",
            "date": "Jan 03, 2023",
            "title": "Truly One of the Courses of All Time",
            "comment_content": "THIS IS NOT THE COURSE YOU THINK IT IS.<br /><br />If you are looking for a course where you design and build an innovative product in teams, like ENGG1100, this is not the course for you. This is NOT an engineering course.<br /><br />The course teaches you how to employ “design thinking” in innovation. From problem identification to prototyping, you will be designing a product for a certain context, which varies from semester to semester (it was about improving wet market this semester), in teams of 3-4. However, you do not have to actually build the product in the end.<br /><br />Instead, you come up with an idea and convince the instructors that it is practical with current (or even future) technologies. For example, if your product is an app, you could just use paper to simulate the UI, without actually coding the app or building it in a UI design software.<br /><br />One of the products this semester was safety shoes for the elderly. The idea was to protect an elderly when he/she tripped and fell, by using airbags inspired by those in a car. The “end product” in the final presentation was just a bunch of long balloons taped to a pair of shoes.<br /><br />This is not an engineering course, but one of creative thinking. Your idea can be as absurd as you like (it might even be encouraged to do so). If all these sound good to you, go ahead and enroll because you might just be one of the talented few who would not feel miserable in this course.",
            "comment_teaching": "1. Class Structure:<br />There will be a 3-hour class each week. Usually, the first half would be lectures on the theory of design thinking, e.g. techniques and history. The second half would be class activities, one of which had us pretending to be old people, with wigs and canes, and buying coffee from shops, in order to observe the prejudice against the elderly. Frankly, it was quite fun and goofy (not sure if it helped to teach design thinking though).<br /><br />2. Instructors:<br />The course was taught by 2 instructors: Ms. Luisa Mok with a design background and Mr. Rong Zhang with an engineering background. I suppose this arrangement was intended to force students to design a product that can strike a balance between creativity and practicality. However, it was extremely difficult to hit that optimal equilibrium. Oftentimes your idea has to be impractical in order for Luisa to deem it “creative”, all the while Rong was questioning the feasibility of your “creative” product.<br /><br />3. A Sudden Change in Syllabus<br />Initially, the plan was to have teams test their final product directly at the wet market. However, due to different constraints, we ended up testing our products in the classroom, which was decorated to roughly resemble a wet market. The limitation of space forced teams to take turns setting up their product, making the experience even more underwhelming.",
            "comment_grading": "Assignments (4 in total): 40%<br />Midterm: 15%<br />Final: 40%<br />Participation: 5%<br /><br />1. Assignment and Exam Contents<br />Assignments include short writing, drawing, interview and making cardboard prototypes.<br />Midterm and final include both a written assignment and a presentation.<br /><br />2. Creativity<br />The creativity of your product is highly assessed. However, the lack of an objective measure of creativity often caused confusion for students. In that the line between creativity and impracticality became blurry. At the same time, what the instructors consider “creative” was also very ambiguous.<br /><br />3. Presentation<br />There was a Q&amp;A section after the presentation. However, most “questions” were criticism rather than inquiries. Even though critical comments are essential to driving improvements. Personally, I prefer having both positive and negative feedback, instead of only the latter.",
            "comment_workload": "Expect to do a lot of work outside of class. Especially in the last few weeks, when you need to build the (non-working) prototype.<br /><br />Here is the list of things you would need to do outside of class (also mentioned in the GRADING section):<br />1. Written assignment<br />2. Stakeholders interview<br />3. Drawing of your ideas<br />4. (Non-working) prototype<br />5. Presentation-related preparation",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XgyTiFkndLww5mcRnG4bqgcTpALdBCOL",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "AP2112",
            "date": "May 31, 2023",
            "title": "DON'T REG THIS COURSE DROP AI",
            "comment_content": "You thought u will learn:<br />This course focuses on user-collaborative design methods for generating inclusive product solutions that integrate stakeholder and product functionality perspectives. Students will create specified product/ process /policy /protocol /plan (5P) concept models using recursive user feedback engagement methods, experimental prototyping, and divergent and convergent ideation strategies. Featured topics include design thinking; stakeholder research; concept development, screening, and selection; and interaction design. For students enrolling in extended major programs and students with consent from the instructor.<br /><br />What u actually learn:<br />Honors Cardboard Cutting course<br />Honors Hot Glue course<br />Honors Mind Fk course<br />Honors Luck in choosing teammate course<br />Honors Drawing course<br /><br />DON'T REG THIS COURSE<br />DROP AI",
            "comment_teaching": "Natalie: TA, seems very tired all time<br />Yes, she is the GOD TA in this course, ask her if u have questions, dont ask lusia<br />But hope you cannot see her next semester<br />Hope she can escape form luisa and EMIA and UST<br />She very sad, talk and chat with her<br />Since join ust need see doctor<br />Let us pray for her<br />To Natalie: Please escape ust if you can<br /><br />LUISA:<br />GO BACK ISDN<br />WHY COME TO RUIN OTHER MAJOR<br />ENGINE IS A PROBLEM SOLVING MAJOR<br />NOT DESIGN MAJOR<br /><br />DON'T REG THIS COURSE<br />DROP AI",
            "comment_grading": "Grade: B+, thank you Natalie<br />Although my cga is 3.9 sth, then drop to 3.8<br />but still thank you for Natalie's hard work and helps<br /><br />100% Team score<br />One subgrade up if u are those teacher pet or prof yo lun which questions a lot and answer a lot<br /><br />DON'T REG THIS COURSE<br />DROP AI",
            "comment_workload": "FFFFFFFF<br />10 credit course<br /><br />DON'T REG THIS COURSE<br />DROP AI",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "As4nMAItFRs8J8LnNFyDTQa3EIO4DziJ",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 0
                },
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Alex Chen",
            "date": "Apr 21, 2023",
            "title": "",
            "comment_content": "Content：<br />我们这一届主要是带我们去TKO菜市场，做调研，然后提供一个改善的建议。<br />在提出建议后，需要用一些常见的物品去实现这个建议。实现过程比较抽象，例如用卡纸制作蔬菜运输机，或是用手套剪一下做手环。<br /><br />我们的任务是完成一个盲人导航手环，期间过程非常破折。我们需要完成3个prototype，之后做出了一个真实可操控的产品，却因为手套外貌丑陋，电线外漏而被推回。最后临时修改方案，才得以通过。只能说课程逻辑十分重视设计概念，而非工程理念。只要你的设计思想足够，产品够创新，无论产品是否能被实现或应用都可以得到教授的青睐。",
            "comment_teaching": "上完课后，早已把内容忘得七七八八。唯一记得最清楚的就是如何拥有设计思维。但这也是相对简单的概念，此课程没有深入解释。<br /><br />教学内容虽与作业有所关联，但多是还是依赖于教授之间的交流，才能取得正确的资料。canvas上的信息散漏，有时想完成一项作业需要和队友开多次会议，翻阅三四个pdf才能得知所有的要求。<br /><br />MOK教授的教学方式一般，虽有耐心教导学生，但其评分方式令人费解，难以从中学到什么。<br />Zhang教授却是十分亲近，经常来到我们小组为我们解答问题，以及分享一些现有的技术实现方式。<br />课程TA也为我们的作业提供了莫大的帮助。",
            "comment_grading": "难以形容。<br /><br />课程虽以最终产品为目标，但却把评分放在了过程。这样虽是达到了教课目标，即学习设计理念，却对一些中途需要改变创意的小组造成影响。各位若是将要学习此课程，建议从一开始就确立小组成员，并谨慎审视老师的要求，以及课程目标。",
            "comment_workload": "3分课有着4分课的workload。难绷",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "egGahJedIZ9KT4CEQfjUWYu49zDJMnBx",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Gi Grade",
            "date": "May 29, 2023",
            "title": "Useless 10-credit Design thinking course (totally useless for Major + AI students)",
            "comment_content": "What I expected to learn:<br />- Some designs related to AI<br />- Some AI technologies, AI products<br /><br />What I actually learnt:<br />- How to use 3D models to express pain level<br />- How to design strange chairs <br />- How do HKUST canteens deal with food waste<br />- How to squeeze lemons in creative ways (e.g. throw them into a black hole)<br />- How to draw water bottles <br />- How to build prototypes using cardboard<br />- How to deal with unreasonable orders by the boss (like making a whole model within one week)<br />- How TAs quit HKUST<br />---------------------------------------------------------------<br />Project content:<br />Basically follow the steps in design thinking.<br />1. Understand<br />2. Define<br />3. Ideate<br />4. Prototype<br />5. Test<br />6. Solve<br />---------------------------------------------------------------<br />Should be very easy, just takes about 15 hours per week to do the prototyping, then she will ask you to redo it in the second last week, and in the last week you just need to spend like 30 hours to redo the prototype. Best course ever.",
            "comment_teaching": "Lecture PowerPoint will not be given.<br />You are not allowed to take pictures of the lecture slides unless you ask for them.<br />You are not supposed to use your computer at all otherwise Luisa will think you are not focusing on the lesson and your impression marks will decrease, which lowers your grade.<br />Lessons are meaningless but you must attend for attendance. Also you need to show that you are listening or else your impression mark will decrease.<br />---------------------------------------------------------------<br />Unlike the lecturer, TA is very good. Natalie is very good to students. Thank you Natalie.",
            "comment_grading": "Grading system is horrible. <br />You will only get lower grades instead of higher grades. <br />You get one grade down if you are absent for like 2-3 lessons, and you get two grades down if you are absent for 4-6 lessons, and more than that will give you an F.<br /><br />Our group spent like 20 hours per week in the last 3-4 weeks and as a result, we got an A-! What a good grade course! I could get A+ in 2-3 courses using the same amount of time.",
            "comment_workload": "Crazy workload. Basically assignments every week. <br />You need to finish observation within one week <br />You need to conduct interviews within one week.<br />You need to make the whole prototype within one week.<br />You need to do the user testing withing one week.<br /><br />Our group's experience (also for other groups taught by Luisa):<br />She kept saying &quot;ok, go ahead&quot; for 3 weeks, then the week before the final week she just ask every group to redo the prototype which you spent 3 weeks to modify, and now you need to redo it within one week. She said marks will be deducted if I did not see a new prototype in the final presentation. What a nice instructor. It is just like she is the boss and we need to follow all her instructions.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 3,
            "attachments": []
        },
        {
            "hash": "vsplE9RRQiTsTw4vIRw6HyLOxXzsv7oY",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "1qww",
            "date": "Jun 02, 2023",
            "title": "You will want to drop extended major in AI because of this course",
            "comment_content": "you will go to learn different useless things in this course.&nbsp;&nbsp;Like empathy, and brainstorming. some old-school stuff won't help you anything.",
            "comment_teaching": "the instructor can deliver a fluent accent to you. however, his demand is not reachable for an undergraduate student. The prototype he wants you to design is way more than an ug student can do. And he will keep comparing you with the postgraduate student and think you are shit.",
            "comment_grading": "super shit grading, my marks is like upper quartile for the final product and median for the process, and upper quartile for the participation, I get a B+. I actually work for like 10-20 hours a week for this course, and for the last few weeks, it is like 30 or more hours a week.",
            "comment_workload": "the professor keeps want us to do things like a real product. For example, do many background research on our own, for the first few weeks, we need to interview one person each week. and every 1-2 week you will have to prepare a presentation. At last, you are required to make a useable product and show it to other people. You can imagine at least doubling the workload of language lesson.",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "GCJwnprSPU93FY9BwCxw6QQD1AFMj3B8",
            "semester": "2022-23 Spring",
            "instructors": [],
            "is_author": false,
            "author": "husky0787",
            "date": "Apr 27, 2023",
            "title": "Shitest course so far",
            "comment_content": "the content is good. design thinking is a important skill.<br />design thinking: <br />Empathy<br />Define<br />Ideate<br />Prototype<br />Test",
            "comment_teaching": "shitty. The instructor just introduced different parts of design thinking, but the course requires different skills, which are not taught in this course. For example, students have to interview people first, then design a prototype, and finally make a video. Students have to learn all of this on their own and spend a lot of time. For me, I want to a app so I have to learn how to use figma.",
            "comment_grading": "Not have grading yet.",
            "comment_workload": "although this is a 4 credit course, but stduents have to learn different skills as said above.",
            "rating_content": 5,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 3,
            "attachments": []
        },
        {
            "hash": "wthUgZDJtCKKCshdhH8q06ZH91mg9s12",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 0
                },
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "USTHuiYin",
            "date": "Feb 03, 2023",
            "title": "Luisa is totally a piece of shit",
            "comment_content": "Content is shit.<br />there are no material for study. Only some rubbish ppt were prepared by Luisa.",
            "comment_teaching": "Rong is not bad. Sometimes, he gives some positive comment and inspiring idea.<br />However , once again luisa is really shitty on teaching, she has no empathy on students .",
            "comment_grading": "The grade is really good ,only if Luisa likes u . So , How to make she likes u or have a crush on U? Just act kam on classes. SHe likes some kam ppl.",
            "comment_workload": "Really heavy. Honestly , I spend not much time on this as&nbsp;&nbsp;have other&nbsp;&nbsp;&nbsp;courses. But my frds , who are in another group , spend like 10 hours a week and still got same grade as mine. So I suggest u work on making luisa love u .",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LaPYDfSt1Yprapopx6UcsiZNkBr9b8pt",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "deep_sea",
            "date": "Aug 21, 2023",
            "title": "Can be a quite annoying course if you don't have any friend to form up a group with you.",
            "comment_content": "Firstly, this course does not have anything to do with &quot;AI&quot;, you are taking this course because it is required for &quot;+AI&quot;.<br />In my semester(22-23 s), we first spent 2 weeks for field trip and group forming, After that, for the rest of the semester, the professor will introduce several concepts, such as convergent/divergent thinking, tree of opportunities, divide &amp; conquer, to help you generate ideas for your project.<br />In short, this course is all about this &quot;cross-disciplinary&quot;, and the content itself is fine.",
            "comment_teaching": "To be honest, comparing to the other instructor, ZHANG might be better. I have heard from my friends that MOK is quite fastidious, and ZHANG is just not that extreme. Also, ZHANG really tries to make the class get more active and fun, so you don't have much problem spending the 3 hours.",
            "comment_grading": "Can be discouraging.<br />The project and the 6-7 assignments will make up to about 90% of your grade, the other 10% is for so-called participation. In addition, if you get low points for peer review, the final letter will be downgraded( and you don't know if someone in your group gives you a low grade)<br />My grade: B<br />For the assignments and project, overall, little higher than the mean; more higher for participation since I forced myself to be active in the class, and I think I have left a good impression on the professor.<br />Just like some others say, when it comes to non-exam based assignments and project, the grading can be not very objective. And to get a higher grade in this class, you will probably need to strictly follow the professor's concept.",
            "comment_workload": "Higher than expected.<br />The first 2 weeks, before the group is formed, is probably the most comfortable time for this course. Then, for the rest 10 weeks, there are 6-7 assignments( individual and group) and a group project waiting for you. In these assignments, some require you to do some interviews, some ask you to do some field observation and present in a PPT. And there is also a last assignment for you after the last class, before the first day of exam. In some unlucky times, you will have to prepare a PPT presentaion in 6 days. Besides, the professor sometimes set strange ddls, so be cautious.<br />The project is indeed demanding, you will have about 7-8 weeks to MAKE a new-concept product, or at least a prototype. All the groups will come up their ideas under the given subject. For me, the difficult part is getting a &quot;new&quot; solution, and how to coordinate each member's workload.<br />So my best advice is, since it is a required course, you'd better find some friends( even better if in different majors) to team up with you in the class. This will save a lot of inconvenience.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HOBWKqCoOtTie3De5pWF5yQiOKMfcrNQ",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rollu",
            "date": "Jul 19, 2023",
            "title": "Nightmare",
            "comment_content": "In this semester, we had a project about creating a bot to reduce the waste in LG7. It seemed meaningful at the beginning. Each group had to choose an observation taken place in LG7. Our group chose the canteen. We started to think about the solution to the problem we’ve observed inside the canteen. Later everyone was taken to the recycling centre in our school. We learnt the recycling process of those food waste from the staff of LG7 and the environment department. Throughout the second part of this course, Luisa (actually not Luisa but our TA, coz Luisa was absent for two lectures) taught us some design skills, e.g. drawing and shaping the model. We have altogether five assignments, two exams (preparing powerpoints and presentations) and some additional meetings (not mandatory but crucial). Each assignment is done by group. We also go to field trip for once (HKDI). 85% attendance but you better attend all lectures coz there’s no lecture videos for the course and there’re participation marks (not shown in the mark allocation but you’ll be pulled down a subgrade if you don’t attend and answer some questions).",
            "comment_teaching": "Luisa does not have a clear guideline throughout the course. She always requires us to guess what she likes and dislikes (both are important). If she doesn’t like your prototype, you’ll need to pay additional time to improve your prototype and still get disproved by her. The good group works in this course are literally useless and they look stupid. She wants something creative but those good group works are just copying the real things we use daily. I’m not sure if she has some problems in her mind. It’s hardship to discuss with her. Fortunately, our TA are logical and passionate about teaching others. They’ll interpret the ideas from Luisa and try to make everything clear. Even though sometimes they don’t understand Luisa’s ideas, they’ll share with us their ideas and help us to get rid of the problems.",
            "comment_grading": "Poor grading. I heard from several groups and many of us got C range. Coz it’s group work, everyone in the same group would have the same letter grade. Even though you did a great job in the first few assignments, you’d still get a bad grade if you did worse in the upcoming assignments. <br />20% assignments *5<br />35% mid term<br />45% final",
            "comment_workload": "It’s chill at the beginning. But later when you do A4&amp;5 and final exam, it’s gonna be time-consuming. I spent two to three days with my groupmates to do the project each week, using most of the time to reshape our prototype. When Luisa dislikes part of your work, you need to spend more time with it.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H95fS4RKvD56vkN78nd85At6E6RSkMaW",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bottledude",
            "date": "Jun 06, 2023",
            "title": "It is just a bad course that has clearly biased instructor.",
            "comment_content": "The content quality can vary greatly, on some days you may meet some guest speakers that actually give some insight in there respective field. BUT on other you are just stuck with RONG!! for 3 HOURS, teaching about stuff that is so elementary and vague at the same time. Then when you get the assignment you are just left no guidance. It like the teacher talks about addition and subraction in class, then in the exam there is partial differential equations, like wtf.",
            "comment_teaching": "**** this dude,&nbsp;&nbsp;respectfully of course, he need to understand that some people don't have the same level of expertise in either programming or UI design, like I get it some other groups did well, it doesn't mean we did bad either.",
            "comment_grading": "This part is iffy in my opinion, if you don't go to your course 3 times it becomes an automatic fail which is crazy imo. absent 2 times = 10% deduction. Also people in the same group can get quite different letter grades eg (from B to C-) so it the instructor is quite biased.",
            "comment_workload": "IT IS WHOLLY DEPENDENT ON YOUR GROUP. if you have a great group that you get to meet often and work with on your project i would think that it isn't that bad, you know IT JUST A PRESENTATION A WEEK.<br /><br />So it pretty much a presentation a week, sometimes it would be a 5 page assignment interview for your stakeholders, at the end of the course, you have to deliver: <br />1. A presentation about everything you and the group have done for the project<br />2. A demo video for the product/service that you created (kinda like the kickstarter videos<br />3. Report on the project.<br /><br />So yeah this workload i did not enjoy.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "P1jndxixTXO3rYDW7diLnlMtfGEe2NoN",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "tkgao",
            "date": "Jun 06, 2023",
            "title": "JUST DROP +AI IMMEDIATELY",
            "comment_content": "You will learn empathy, convergent/divergent thinking, prototyping and PRENSTATION SKILLs........ A lot of stupid things which also learnt in high school. <br />so-called &quot;design thinking courses&quot; just teach u how to present? I didn't get the MEANING OF EXISTENCE of this fucking course.<br />All contents are fucking rubbish nonsense.",
            "comment_teaching": "Actually RONG&nbsp;&nbsp;teach good, I mean he will trying to using different example and videos to elaborate his idea and objective. But the point is content is rubbish!!!!!!!!<br /><br />Besides, he has a high expectation. If we don't do the things according to his instruction(but the point is he doesn't clarify it), he will say like &quot;ah ha so that's student in university ah&quot; using such&quot;陰陽怪氣&quot; tone. Just all bullshit, if all students forget to do such things, will it the teacher's problem? Maybe u didn't say it clearly ah?<br /><br />By the way, rong doesn't give out the teaching materials like ppt something(in fact he post after last lectures). So you want us to remember such plenty of ppt slides? I just wanna review on what&nbsp;&nbsp;he teach in class and get a better idea on the course feedback Idk y rong don't post the material. fucking bullshit?",
            "comment_grading": "Bullshit grading same as most courses in ust.<br />I get an upper quartile in the final demo, but only get b+ finally.<br />a range 都唔肯俾?????????<br /><br />If you not yet take this courses, just drop the +ai immediately. If I were you, I would run away.",
            "comment_workload": "nearly every courses need to give a presentation and assignments. such fucking high workload which make my life just like eating shit. I must admit that the workload has been quite overwhelming for me.<br />The amount of assignments required for each week has been significantly high, and I've found it difficult to balance this workload with my other commitments. As a result, I've often had to rush through some of the assignments, which has impacted my ability to fully grasp the concepts being taught(but actually all concepts is like fucking bullshit,so doesn't matter,lol).",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eSBdWSd2GrUzNl0T1JIXIqsoU0tUFpIh",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                },
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Guntr_n",
            "date": "Feb 06, 2023",
            "title": "Basically a design course",
            "comment_content": "1.Field trip<br />2.Teach how to interview and make observations. Some concepts like &quot;empathy&quot; were mentioned. <br />3. Define an problem from design opportunities.<br />4. Midterm presentation <br />5. Very little amount of sketching with pencil (Absolutely useless)<br />6. Prototype<br />7. User testing (within class)<br />8. Prototype<br />9. Final presentation <br /><br />Nothing to do with AI",
            "comment_teaching": "PPTs in class, somehow the PPTs were not uploaded on Canvas. <br />If Luisa provides feedbacks to your group, take it.",
            "comment_grading": "If you can make Luisa happy. Fair.<br />Tips: Ask Luisa. Give up your own thoughts. DO EVERYTHING she suggests.",
            "comment_workload": "Have assignment every one/two week(s). <br />Making prototype is terrible. (Please follow Luisa's opinions)",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "S1gDjfzqQDc0gEP1RPs4V4ZYnRIpl1mB",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                },
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "stardust12138",
            "date": "Feb 01, 2023",
            "title": "Find good teammates :)",
            "comment_content": "Topic: Wet markets in Hong Kong<br />The course is run as a group project, and you will need to find as many suitable group members as possible before the second session. The project is about finding a problem in a fresh market and giving a viable solution. Although it sounds straightforward, and the course provides a framework for the process, it is all very rushed. As it is a staged marking process, although you can revise your topic in its entirety midway through the course, you will need to spend more time catching up on previous content, which will have no impact on the results of the previous stage of your marking. What you are trying to do is &quot;create something out of nothing&quot;, and you have no time for mistakes.",
            "comment_teaching": "the interactive class is delightful<br />but you need to concentrate during 3-hrs class<br />or you would probably miss the content",
            "comment_grading": "All ratings are based on the guidelines provided. I can't say that the marks are entirely objective, but they will go up as you get a feel for the professor's design preferences. And I don't think it's about learning how to do that, it's about learning how to cope with the taste of your superiors.",
            "comment_workload": "As a three-credit course, this is clearly an inappropriate workload. In particular, after the mid-term lecture, samples need to be produced while improvements are being made. It's a bit of black humour for our university when you have to devote days and nights to design and production and then expect us to have fun with the learning.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "q6GfjUnfNnOSi9hq25bhilvHmGjDfoHd",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                },
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wasted",
            "date": "Jan 31, 2023",
            "title": "Find teammates good at drawing, crafting and video editing",
            "comment_content": "Okay, the goal is to find out a problem in a renewed wet market and think of a solution. Obviously, it's not AI related, but just to go through a &quot;design-thinking&quot; process.<br /><br />First-half: define the problem<br />-interview &amp; observation (field trip to wet market &amp; cosplay(?) as elderly to learn empathy)<br />-insights &amp; problem statement <br />-user journey map (drawing required~)<br />-design opportunities<br />Hmm just follow the format then shud be fine<br /><br />Second-half: think of a solution (welcome to art course)<br />-brainstorming (drawinggg)<br />-design concepts (drawing again, there was even a whole lecture teaching 3D drawing techniques lollll)<br />-prototyping (crafts)<br />-user testing &amp; feedback",
            "comment_teaching": "A 3-hours lecture per week. The teaching is interactive.<br />But the schedule was a mess. It's too rush, they were always changing deadlines and the class schedule. And they announced assignments a week before.",
            "comment_grading": "Not bad, as long as you follow her instructions and opinions. If you know what does she want, then it will be easy for you to get A-range. <br /><br />Tips: emphasize how did you apply the things she taught, &amp; show product development. Oh and maybe make a good impression",
            "comment_workload": "5 cred workload.<br />4 assignments, midterm and final.<br />A1: field trip to wet market for observation and write a simple report.<br />A2: decide the problem area and go there again by yourselves for interview.<br />Midterm: ppt, pdf and a piece of drawing<br />A3: 1 mind map (with drawing) and 3 pieces of detailed drawing<br />A4: prototyping (handicrafts!)<br />Final: video presenting your final solution, ppt, pdf and reflection (1 week to prepare good luck!)<br />I was spending 10 hours per week to do the model.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YyDuzZQm1fB6pPqN01DvGWUyrTuzKtb0",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                },
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "得行",
            "date": "Jan 27, 2023",
            "title": "For one project, step by step",
            "comment_content": "6 step for design: understand-&gt;define-&gt;ideate-&gt;prototype-&gt;test-&gt;solve<br />no specific goal, but specify a field (wet market). You need to seek problem, set your target, and design your solution.<br />Things to do: listen to guide, cooperate with teammates, practise, write reports, present",
            "comment_teaching": "not only by talking, but also practise by hands. Lots of surprising and interesting practical sessions. However, for a 3 hours class, sometimes is boring especially when wait for group tutoring.",
            "comment_grading": "Not bad, but still hard to be satisfactory enough compared to the effort required.<br />The professor claim that the performance that generally meets the requirements is given as B, and the excellent performance that exceeds the basic requirements is given as A.",
            "comment_workload": "could be extramely large. As the project progress may encounter obstacle, you may need to return to the early stage to explore a new way to continue your project. Nevertheless, the course progress will only keep move forward, you have to pay more effort to overcome difficulties to follow the course pace.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7YLaX4Gb942viibC5u2G3dvT82TU1zGO",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                },
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "M.L",
            "date": "Jan 05, 2023",
            "title": "",
            "comment_content": "just see the other review, I would like to focus on the grading and workload.<br /><br />Overall a C, Im really shocked that Luisa in the first lesson said that we can't have a software solution in this so-called AI requirement course. The course materials are pretty fun and I enjoyed it.",
            "comment_teaching": "would give a B here, their teaching is just fine. We have lots of interaction but I think it is just based on participation marks.<br /><br />3 hours is a little bit too much I guess and our group usually fell asleep.<br />One of the reviews said somethings that I really agree with. The comments from Luisa and Rong are quite contradicting. At first, our designs are purely based on feasibility, so we would like to make some stuff. However, Luisa wanted us to do something &quot;creative&quot; and we struggled for a long time to find a so-called creative solution. And we will be judged by Rong for feasibility again. I think they must argue a lot about that lol.<br /><br />Special credit to Natalie, she is so nice!!!!",
            "comment_grading": "participation 5%<br />assignment 40% (A1 and A2 are individuals, A3 and A4 are teamwork)<br />midterm 15%<br />final 40%<br />peer review (deleted)<br /><br />my groups obtain 3 A and 1 A-.<br />We thought we could have gotten A+ at first since we are the best team in our session. But it seems they don't want to give so many A+. Actually, I don't even know is there any ppl getting an A+, comment below if you got it.<br /><br />A1 10/10<br />A2 9/10<br />A3 7.5/10<br />A4 did not release<br />midterm 14/15<br />final did not release<br /><br />I saw some reviews that misunderstood something<br />in this course, three ppl would grade, Luisa, Rong and Natalie.<br />In the midterm presentation, Luisa and Natalie would grade based on your assignment but Rong would grade based on the presentation. So make sure you have a good performance in both parts.<br />Actually, just follow the guideline and I think it would be fine. They gave everyone at least 50% marks and I think it is quite easy to obtain high marks.",
            "comment_workload": "HUGE AS FUCK. Please make it be a 5 credit course. <br /><br />Especially after midterm. They asked us to build a series of prototypes within a month including the final prototype. Basically, we spent the whole night once a week finishing the assignment. And we don't have a proper place to do the prototype and we could only use the corridor in 5/F. Before the day of the final presentation, we even receive complaints from security and we have to find other places to finish the remaining part. <br /><br />The final presentation are really difficult to finish on time. We only got 5 days to finish the final prototype, shoot a video, make a PowerPoint and draft the speech, and to prepare the final of other courses as well.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zq6Csj60fgaANG2mpOl5PkjMjQ18lqs7",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "naoayz",
            "date": "Jun 01, 2023",
            "title": "Design Thinking",
            "comment_content": "A topic is assigned to you for a final project. Zero Wasting this semester. The contents are below:<br />- Observation (4%)<br />Be very careful here, you are asked to observe a problem in the real life. And your final project is to solve this problem.<br />- Interview (4%)<br />No much to talk about here, you find some people to conduct interviews (4%)<br />- Define problem (midterm pre 35%)<br />Find out the actual cause of the problem. The source(s).<br />- Prototyping (4%)<br />Make the first prototype of your project. It can be a physical machine in cardboard. But a team in our class made an App and a new marketing system for McD.<br />- Testing (4%)<br />Find some student to use your prototype, find the flaws and fix them<br />- Final project Demo (final pre 45%)<br />presentation",
            "comment_teaching": "One class a week; 3 hrs. You need to form a group in week 2. One assignment a week. And it may as well take a week to do. Find good teammates, it is a small class and grade in curve, most of your marks are counted by group. <br /><br />If you really want to learn design thinking, Luisa is probably the best in this field. She will push you higher and has critical views.<br /><br />If you want to have a good university life, don't take her class. She has very high standard so will your stress. <br /><br />And because HK grade in curve, you may find your effort hit for six. Especially if you are in a horrible group. By week 3 you will know your final grade.<br /><br />The TA Natalie is GOD!",
            "comment_grading": "I think my grade is fair enough. She did mentioned that we do well, but she can't give everyone good grade because the ust policy. <br /><br />Tips: If you are in her class, lower her exception of you initially. Screwing up the first few assignments or be dumb. She said and I quoted, 'If you are an A student in my class, you need to be A+ or better.'&nbsp;&nbsp;Act dumb or find good teammates.",
            "comment_workload": "Very high workload, but mostly contributed by Luisa. She has high expectation on students to improve. So, you will constantly redo your works.<br /><br />I gave up this course and spend my time on others, very wise of me<br /><br />I would be happy to have her as my employee. Or her to teach me design thinking in a 0 credit course. <br /><br />This course should be a 5 credits course.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dlGgFd4NDCIpNyvtKquo9RF1Ei78MYaj",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "香蕉皮",
            "date": "Jan 31, 2023",
            "title": "Extremely high workload, be prepared",
            "comment_content": "This course has nothing to do with AI/DMCA if you are from those extended majors and are required to take part in this course.<br /><br />We are in groups of four, most assignments are group assignments.<br /><br />This course teaches you how to think from a designer's standpoint, with little regards to practicality and feasibility. Despite this, I think it is quite interesting to see how far creativity could go without any limits. In the first part of the semester, we learnt to observe and summarize problems of a fresh market (from what I can tell, the topic changes every year, not 100% sure though), through observations and writing reports. In the second part, we drafted a solution to the problem identified, then build the solution out of cardboards, clay and other materials. The models need to be functional. Both parts end in a presentation.",
            "comment_teaching": "The teaching is ok, a lot of interactive learning like a site visit to the fresh market, and a 'experience session' for us to pretend to be an elderly people, and walk around ust.<br /><br />However, the second part of semester is very rushed, very little guidence on how to practically build the solution, we had difficulties working on the final solution, which neeeds to be actuslly functional.",
            "comment_grading": "The grading is ok if you are a 'good student' and follow their so called 'design thinking', and present your 'design thinking skills' clearly in your presentations and reports. I got an A-minus despite having one of the lowest score on the only individual report (the first one) in this course. My teammate got an A+",
            "comment_workload": "This should not be a 3-credit course, it should be at least 5.<br /><br />I would select F if there is an option for that, I don't get how this passed the University's commitee for approving courses.<br /><br />The first problem is the actual workload, it is stupidly high. On average, you need around 10-12 hours per week on assignments. The reports from the first part will make you question the purpose of this course and the purpose of life, demotivating you. Most reports are group assignments, so you need to have meetings with your team almost every week. Despite all this, it is actually the better part of the two parts. In the second part, you need to build a model for your solution as a 'prove of concept', then one more to actually function. Building a model involves you and your team sitting in the corridor outside of the classroom, alongside with other teams, outside of lesson time (yes, you use your own time for models), to build a model that can't look too bad. We had a whole month where we built models every weekend, for the whole day. The presentations are scheduled just before midterm and final, which is ok if not for the fact that those presentations are group presentation, which means more meetings, and that those presentations could not be copied and pasted from the internet, in which both presentations requires hand drawn pictures and video editing.<br /><br />The second problem is that the deadline is always next week, meaning you have a week notice of the contents of the presenations, reports, and a week time for you to do those models. Time would be very inflexible, in that I spent the whole day of my Birthday building models in HKUST. If you are aleady credit overloading, I suggest viewing this course as a 5-6 credit course.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DskgaBC3j1nNqzAigoAKMnTr7IXWkfLc",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 1
                },
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nightmare123",
            "date": "Jan 08, 2023",
            "title": "",
            "comment_content": "First of all, I’m a physics student (I talked to some design friends and they have different views)<br />As an introductory course for design thinking, most of the course content are great， The idea of design thinking itself is brand new to me and it’s unique and worth learning.<br />However, it’s hard to practice these ideas immediately into assignments.<br />And three hours are too long, at some point during the course you will feel asleep or tired so it’s not so effective.<br />Also some of the content is just too much to be taken in in three hours",
            "comment_teaching": "you can tell how much effort the professors had made to make the content easy to understand and interesting.<br />However, the two professors seem to have different ideas about the goal of the course, Luisa wants us to go outrageous meanwhile Rong wants us to be practical, which gives us quite a confusion.",
            "comment_grading": "One of our groupmate did not say it.. The rest of us is A, A, B<br />We got approximately full marks before and including midterm, and the rest of grading is not released. <br />If the workload is considered, I believe we worth more than A+, if the same effort were put to other course, it’s definitely an A+. But consider that we got lost in the part of making projects so it could be reasonable",
            "comment_workload": "I give it an E because never have I ever imagined that a 3 credit course could be this exhausting. It’s 8 hours out of class work per week and much more during midterm and final. At the beginning the professor expected us to design an innovative product ourselves which includes beauty, creativity, mechanical stuff. We have never been trained to do this before. So the truth is we ended up making trash. The professor expect us to improve our product and change to a new one once the last one meet a dead end, but it’s a three credit course, it’s not worth it.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ctluSH5V3CY57CGKNvKZIofRYHIwSDOV",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1365,
                    "name": "ZHOU, Jinni",
                    "rating": 1
                },
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JQHN",
            "date": "Nov 08, 2022",
            "title": "An Interesting Course to Develop Problem Solving Skills",
            "comment_content": "As the title suggests, the course trains students to think critically through turning potential ideas into something tangible. The first half of the course focused on brainstorming pain points that certain groups of people may face, and try to come up with possible ideas. The second half was the hands-on part (the prototype development with many iterations throughout).",
            "comment_teaching": "In spring 2021-22, there were 2 instructors and 3 TAs. All of them were willing to answer questions, and they offered constructive feedback for us to improve. The lectures were always interactive with many interesting activities planned, even though it was 100% online.",
            "comment_grading": "The grading is very good. Remember to do well in every single assignment as the mean can be quite high. Remember to participate as the participation + attendance score can make a difference. A few points may put you behind.&nbsp;&nbsp;A range should be doable as long as you put in the effort. An overall of something like a 96% was an A+ (only for reference as the exact cutoff may change).",
            "comment_workload": "As pointed out by others, the workload is indeed high compared with most 3-credit courses. I understand this can be demotivating and frustrating at times; one advice is to frequently communicate with your teammates as you’ll be working with them for the whole semester. As long as you adhere to your planned timetable, it’ll be fine.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "82x0y7Qtew5KQXk7IupSlI1hnGlDo1uu",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                },
                {
                    "id": 1365,
                    "name": "ZHOU, Jinni",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jerry_nguyen",
            "date": "Aug 27, 2022",
            "title": "A good course but should join if you have some design backgrounds",
            "comment_content": "As the other people have written, I will not state it again.",
            "comment_teaching": "I like Rong's teaching. Rong is a passionate, dedicated instructor. His English accent is really really good, easy to understand. He also replies my email quite fast (send in morning and receive in afternoon - with an exception that if you send in the weekend you may receive it on Monday, or late Sunday), and explains design thinking concept clearly.<br /><br />Jinni's teaching is also fine. She has quite a lot accent so in Zoom class it may be a little bit hard to understand what she is trying to say. A little bit boring sometimes but not too much.<br /><br />I think Fall 2022 semester they have included someone from ISD to support the students more since this course is really related to ISD. What I do not like in this course is they do not provide knowledge/skills for the project; you have to learn that by yourself. They have TA tutorials but I do not think it helps much.",
            "comment_grading": "I think grading is a bit good (guessing that in Spring 2022 everyone in this course will get A-range easily if they put enough time and efforts)<br /><br />Most of your grade will be determined at the Project Demo lecture.",
            "comment_workload": "This should be 4-credit or 5-credit course. For ISD students, it may be appropriate to put 3-credit.<br /><br />I think the instructor realizes that not all majors can join this course immediately so they send an email in Fall 2020 telling people that they only encourage students from SSCI, CPEG, and ISD to join. Without any design experience, the workload may be pretty huge.<br /><br />But overall, this is worth to try. You can even join some design camp (like InnoX Summer Camp) in the summer after joining this course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "iCTnlBC4YSbfVLryMUfPNZnlOGQZcRgj",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                },
                {
                    "id": 1644,
                    "name": "ZHANG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lammm",
            "date": "Feb 16, 2023",
            "title": "",
            "comment_content": "1. Key concepts of Design thinking Project <br />2. Field trip (wet market)<br />3. Observation based on the field research<br />4. Interview customers and sellers<br />5. Insights, Problem statement and Design opportunities <br />6. Visual thinking and Design probing<br />7. Prototype: Low fidelity modeling and Functional aesthetics<br />8. Testing our prototype in the market<br />9. Solve the defined problems",
            "comment_teaching": "Teaching during the lecture is acceptable, there are sorts of activities involved. <br />However, the feedbacks and comments given by the two instructors on developing our prototype often contradict. I would suggest listening to Luisa because this can boost your grade.",
            "comment_grading": "The final grading is satisfying to me. It is not difficult to attain a high score in each assignment if you are really putting effort in it. I would recommend elaborating your points and write as mush as you can for the writing work. For the presentation, time management is important as I found that lot of teams' powerpoint is lengthy.<br />Grading scheme:&nbsp;&nbsp;<br />1. Participation:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5% <br />2. A1 &amp; A2 (individual work) and A3 &amp; A4 (teamwork):&nbsp;&nbsp;&nbsp;40% <br />3. Midterm (teamwork):&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;15% <br />4. Final (teamwork):&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;40% <br />5. *Peer review <br />&nbsp;&nbsp;Total: 100% <br /><br />Attendance and course participation are weighed in this course. 85% attendance (present for 11 classes) is <br />required. Those who cannot achieve 85% attendance are marked one grade down (e.g. A- becomes B+). Those <br />who are absent for 6 classes cannot pass this course.",
            "comment_workload": "The first two individual works (A1 and A2) are fair, two weeks are given to finish.<br />Starting from the midterm, A3, A4, to the final presentation, the workload in this period is huge. It is normal to see Emia students spend their time working on the prototype outside the classroom throughout a day.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iKNJTBZJpb36AtAuA1GfOYQFdgyeV5IG",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                },
                {
                    "id": 1365,
                    "name": "ZHOU, Jinni",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Henryw0ng",
            "date": "Aug 26, 2022",
            "title": "A rewarding course that you'll always want for more",
            "comment_content": "TLDR: Teaching you the steps to create a successful product/prototype.<br /><br />Edit:&nbsp;&nbsp;Pretty much the same content as ISDN 2200",
            "comment_teaching": "Rong and Jinni's (and the TAs) teaching are very good. They are willing to give us recommendations and improvements on our project ideas and execution. Highly advise to participate in every lecture, coz they are useful to design thinking and non-recorded (slides are available)",
            "comment_grading": "There are assignments (design thinking process) and projects (prototype, presentation, promotional video)<br /><br />Note: this is one of the courses that you are allowed to 'fail' as whether your prototype succeeds or not, assignments occupy 60% of the total grade.<br /><br />Some assignments are group based. Wish you can find good teammates and good topics.<br /><br />I was in the same team as the reviewer down below, got A+",
            "comment_workload": "Workload depends on your skills and what idea your team come up with.<br /><br />Any necessary skills (eg: programming, AutoCAD) have to learn by yourself. Instructors will not teach any of this in the course.<br /><br />It deserves to be a 4 cred course if you ask me",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "P7EZWWQMepCmb3Ee33Qxq5Lyrqa12OvR",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                },
                {
                    "id": 1365,
                    "name": "ZHOU, Jinni",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "戒",
            "date": "Aug 25, 2022",
            "title": "EMIA 2020 review (highly recommend)",
            "comment_content": "Zoom teaching mode, 3 hours per lecture every week<br /><br />My semester's topic was &quot;smart home,&quot; and my group was supposed to create a product to satisfy requirements. BTW, each group contains 3-4 students.<br /><br />Topics -<br />L01:&nbsp;&nbsp;Introduction to the Course<br />L02: Immersive Empathy<br />L03: Interview sharing and analysis<br />L04: Problem Definition<br />L05-1: Brainstorming Techniques<br />L06-1: Convergent Thinking<br />L06-2: Idea Evaluation<br />L07-1: Prototyping<br />L08: Testing prototype<br />L09: Storytelling<br />Final Demo<br /><br />Furthermore, each teacher assistant gives an additional tutorial; three of them are not shown on the schedule, but instructors will inform you of the specific time and day.",
            "comment_teaching": "To learn and interact, we used a website called &quot;miro board.&quot; To teach you the concepts during the lesson, instructors always present different activities on the miro board or physically in front of the camera (e.g. create a helmet for your teammates).<br />The entire class was incredibly engaging and motivated in the course because you could feel the lecturers' excitement. <br /><br />Each lesson contains a few parts, the first part was taught by instructors, and the second part was group activities.<br /><br />They encouraged students to ask them any questions concerning the project or lecture, and they are willing to answer them even after the session has ended.",
            "comment_grading": "Assignment 1 is group formation, instructors form groups according to your choice (e.g.&nbsp;&nbsp;elderly, parents, housewives etc)<br />Assignment 2: Practice Observing and Conduct an Interview - 7.8/10<br />Assignment 3: Empathize deeper - 8.3/10<br />Assignment 4: POV and brainstorming - 9.92/10<br />Assignment 5: Prototype and Project Plan - 10.25/10<br /><br />Presentation 1: 3-challenge presentation - 9.3/10<br />Prototype demonstration -&nbsp;&nbsp;9.5/10<br />Assignment 6 (Individual): Course evaluation, peer review, and personal portfolio - 8.5/10<br />Assignment 7 (Group): Final report, project showcase video, and prototypes - 18.7/20<br /><br />My final grade was A-, instructors stated that even if fail to complete the prototype, you can still achieve a high score if you demonstrate what you learned in class (e.g., constantly improving your prototype based on user reality and circumstance).",
            "comment_workload": "Each lecture provided some time in the breakout room for groups to discuss the project and topic, but not enough time to complete the assignment (s) so we spent extra time after class to finish them.<br /><br />Normally, the workload is manageable because there are only 7-8 assignments in the entire course, but there is some extra workload, such as presentations necessary to create a slide show before the lecture.<br /><br />In conclusion, the workload is a little heavy, especially in the final week when you had to turn in one prototype, a short video, and a report, but the workload is determined by your focus group.<br /><br />My group concentrated on the elderly and conducted multiple interviews with the elderly and their relatives. We even went to a group member's grandparents' house to record the video.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        }
    ],
    "composer": []
}