{
    "error": false,
    "course": {
        "id": 2265,
        "subject": "ENGG",
        "code": "1100",
        "name": "First Year Cornerstone Engineering Design Project Course",
        "description": "This project course is designed specifically for first year engineering students. This course aims at providing engineering students experiential learning experience through exposing students to knowledge and skills from different SENG disciplines before making decision on their majors. Students in this course will be divided into design teams. Each team will use the acquired knowledge and skills to design and build an engineering artifact, e.g. an airship. In order to offer the course at scale, the technical components will be offered online and students would be engaged in experiential learning through working on team projects. For First year Engineering students only.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1820,
            1810,
            1730,
            1710
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"ENGG\" data-code=\"1200\" href=\"/review/ENGG1200\" target=\"_blank\">ENGG 1200</a>",
        "rating_content": 3.72,
        "rating_teaching": 3.18,
        "rating_grading": 3.5,
        "rating_workload": 2.08,
        "review_count": 50,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 86,
                "name": "CHAN, Yui Bun",
                "count": 26
            },
            {
                "id": 1071,
                "name": "LAVIGNE, Paul David",
                "count": 19
            },
            {
                "id": 1072,
                "name": "LEUNG, Ka Lok (Jac)",
                "count": 17
            },
            {
                "id": 133,
                "name": "PONG, Ting Chuen",
                "count": 16
            },
            {
                "id": 1073,
                "name": "WONG, Sam",
                "count": 9
            },
            {
                "id": 1144,
                "name": "NG, Ching Yu",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "KW8AyYc5eD5uNw0psd2y3bHak475v4gk",
            "semester": "2019-20 Spring",
            "instructors": [],
            "is_author": false,
            "author": "qjk",
            "date": "May 23, 2020",
            "title": "Terrible Course especially with Online Teaching",
            "comment_content": "Build a remote controlled car out with Arduino.<br /><br />Sounds easy, but here's the deal: the equipment they give you is absolutely trash.<br /><br />So, you built your car. It's made out of lightweight material and has an aerodynamic shape. You start up your remote control app and tell your car to move. It moves forward about 1 meter. Oops! It shuts down, because the board has overheated. So, you wait a few minutes for it to cool down, and you start it up again. It runs for a few seconds. Oops! It shuts down again, this time because you set the power too high and the current is too much. So, you load up your program and turn down the motor power setting. You start up the car again. Oops! Your battery has run out. You decide to make a rope and hang yourself.",
            "comment_teaching": "Online teaching this semester. It's hard to describe your problems to the TA over Zoom and it's hard for them to figure out your problem, so lessons are pretty much useless and you have to figure out your problems yourself.",
            "comment_grading": "There are some online modules which require you to study some materials and do some MC questions. Also they have a weekly &quot;build log&quot; where you take photos of your car and write some stuff about it, sort of like a diary. Every minor assignment counts towards the final grade, each counts for a few percent. Even if you can't make a functional car you can still get about 70% of the marks because of the assignments. You need to make videos of your car which counts for about 20% of the grade.",
            "comment_workload": "Terrible. Don't apply this course if you don't want to end up killing yourself. Prepare to spend days working on your car. One moment it's working and the next it's not. Be prepared for suicidal thoughts.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 11,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FvUYYeKDjxvncN8v28ZZoqSO2PhruMhz",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 0
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ooj",
            "date": "Jan 10, 2022",
            "title": "If you're not religious, this course will make you wish for a God so they could bestow you with luck",
            "comment_content": "This is a hard course to write about, and an even harder course to consider taking, since THEY DO SOMETHING DIFFERENT EVERY YEAR/SEM?? Just check the reviews! One year, they do flying drones, one year, they do blender, one year, they do race cars, etc etc... <br /><br />Anyways, for us, we had to make 3(+1 backup) football robots, each with a kicking mechanism and 3 omniwheels, with an Arduino that connects to your Android app using Bluetooth. From this course, you will (or should) learn Arduino, Android MIT App Inventor, some basic electronics, and 3d modelling. Sounds fun, right? Hell no. Just read the rest of this review or any other one to find out why.<br /><br />One thing is for certain, if we did not have access to the labs 24/7, we would be SCREWED. Especially with HK MAYBE shutting down soon, please please please keep in mind that this course will probably bum you hard if you do it online! Only take it if you are sure you are willing to carry your team or will do it with friends.",
            "comment_teaching": "Simple. They do not. I wish I was joking, I really do. They do not teach you anything. They give you some basic information using HKMOOC which is some sort of online learning platform where you're forced to watch overly long videos about something or the other, and then when you actually need to build your robots... You will end up using 33% asking an STA, 33% Google, 33% trial and error, and 1% giving up and trying something else.<br /><br />Also, no teachers. Only STAs, meaning students to help you lol. At least they're nice<br /><br />Have fun lol",
            "comment_grading": "Individual (30%) work:<br />HKMOOC - 5%<br />Launch Level Demo - 10%<br />Robot Design - 5%<br />Kicking Mechanism Design Sketch - 5%<br />Attendance for Build Sessions - 5%<br /><br />Team (70%) work:<br />First Build Demo - 15%<br />Final Competition Part 1 (Dribble/Shoot) - 20%<br />Final Competition Part 2 (Football Match) - 25%<br />Team Logo/Uniform - 10%<br /><br />Upon first glance, the grading may seem quite fair for a project course. HOWEVER, the biggest problem is that any idiot with more than 2 braincells will be able to 100% the individual section. Furthermore, any team with more than 4 collective braincells will be able to 100% everything EXCEPT the final competition. The STAs (who grade you) are trying to be nice and generous, but that leads to everything - almost your entire grade - coming down to one lesson, and in our case, a final football match and competition we only did well in thanks to luck. For context, our robots were basically trashcans with wheels, with cardboard torn up and taped onto them, and only won because we cheesed our 'kicking mechanism' to be sticks coming out of the robot (they didn't even move).<br /><br />(Also, not to mention, initially, part 1 of the final competition had all 3 of your robots placed on a table styled like a football pitch and they had to pass and dribble through a specified path to score a goal. Initially, there were lots of sharp turns and corners but since it was too hard, they made it a straight line LMAO so everyone aced it.) <br /><br />Essentially, your final grade was determined by how you did in the final football match, which was... essentially luck. Your teammates control the robots, but that doesn't mean anything. Our team literally just got lucky - maybe the other team robots didn't work, or the ball hit at the wrong angle, etc etc...<br /><br />Overall, I'm pretty sure I got 100% in everything, but coming 2nd place in the final competition gave our team an A. I am very happy, but I do not imagine the same can be said for everyone.",
            "comment_workload": "The work you do, and the effort you put in, does not mean you will get a good grade. Unfortunately, that will most likely always be the case in such a competitive course, especially true for us since we had a football match. Teams that had super cool kicking mechanisms, using clever ways to implement things like actuators, motors and whatnot, 3d printing parts to join it all together, only to come last?? <br /><br />I, and some others, spent several nights, especially leading up to the build demo and final competition working in the lab until up to 4am. The lab is usually open at this time, which saved many teams. <br /><br />Also, despite having a team of 5, I am giving you a 100% guarantee that we could have done just as well, if not better, with just 3. Some team members did absolutely nothing, partially because there WAS nothing to do... We split the robot building into coding, 3d design and electronics, and they didn't really do anything so... ??? I hope you're a hard worker and don't piggyback your team if you do take this course.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mfSDFhrcRGffYkQw4RaxSYbcsA7Hsffe",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "HakkaEason",
            "date": "Dec 10, 2021",
            "title": "A course which you have to be smart and lucky",
            "comment_content": "Basically this course requires you to learn to use Fusion 360,Arduino code, MIT APP, laser cutter and 3D printer. Also you have to learn to do wiring and understand the control flow. In the end, you have to build 3 (+1 spare robot) soccer robots for the two final competitions with $400 budget.<br />I overestimated this course and expected too much for this course. Because of the miscommunication between STAs and students and a lot of human mistakes, the contents of final competitions were changed suddenly and the experience was terrible. Such as the difficulty of final competition task 1(Dribble and Shoot) changed from hell to primary school level (they cancelled all the curve road so that your robot only need to go straight and everyone got full mark on that), messing up the materials of different teams, etc. Also the final competition task 2 (the soccer match) wasn't look like a competition. Almost every match there are robots got error and the whole match was boring. And the match schedule was unfair too, at the end a team which their robots were uncompleted and with broken cardboard casing and no kicking mechanism still got 1st runner up.<br />Luckily, there were no free-rider in my team and there was a leader carried our team (but he is a crazy man who just focused on building his robot and skipped the meal for several times) so that our team's process on building robots could be faster than other team so much. And we did enjoy the experience of building robot a little.<br />It should be a very interesting task and exciting match but sadly many accidents and mistakes made.",
            "comment_teaching": "Ben Chan was the Instructor, but he showed up in the USEL lab too little times, so basically the the main hosts are Mr. Ian Chong and Mr. Paul Lavigne. However the people who actually arranged this course were STAs. <br />You don't actually need to learn to use laser cut and 3D printer. Just call a STA to help you then ok. Also other stuff like software(arduino code, fusion 360) you need to self-study, also the tools in USEL lab you have to self-study but except those dangerous tools which STA notice that you use the tool wrongly then they will correct you.<br />But I didn't think it was a good teaching as there were still a lot of people didn't know how to use all the software, hardware and tools even at the end of this course.",
            "comment_grading": "HKMOOC\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Individual\t5%<br />Launch Level Demo\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Individual\t10%<br />Robot Design and Team Role\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Team\t5%<br />First Build Demo\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Team\t15%<br />Design Sketch for Kicking Mechanism\tIndividual\t5%<br />Team Logo &amp; Team Uniform Design\tTeam\t10%<br />Final Competition Task 1 \t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Team\t20%<br />Final Competition Task 2 \t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Team\t25%<br />Build Session Attendance\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Individual\t5%<br />I got full mark on most of the tasks except HKMOOC(5%) which I don't know the grading and got 22/25 in final competition task 2(soccer match, because we lost at first round but won the revival final).<br />Individual tasks were too easy and you should not miss the score.<br />For the Team Logo &amp; Team Uniform Design because we put too much effort on it so our casing basically look like tank and had the highest completion so we got the most votes and maybe get the full marks. <br />They were actually generous to give grade especially they messed up the course arrangement and had to give us marks for free.<br />Update: Final grade: A, seems good but costs me too much and was expecting A+. Still feel disappointed on it.",
            "comment_workload": "DON'T OVERWORK, DON'T SKIP 3 COURSES(comp1021, comp2711, math1013) LIKE ME JUST FOR THE ENGG1100.<br />Actually you should balance all courses, in this course you just need to have hands + brain + put some effort and just match the requirement then you can easily get your task full mark. But premise is if they set the tasks too easy or the tasks too difficult as it has a high chance that they will change the difficulty. If the course was perfectly arranged, it should be a high workload course as 5-credit course. I just interested in making robots with my teammates so I put too much effort in it. But still I have to give E grade on its workload as its disgusting arrangement.<br />However, I still suggest you to expect that you have to skip meal in the last few days before the final competition/submission day of the final project.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "N4hXswBPIxfW5pnWxeFrEJOSyo9wqlTL",
            "semester": "2019-20 Spring",
            "instructors": [],
            "is_author": false,
            "author": "chanjeff2",
            "date": "Jun 10, 2020",
            "title": "Totally not recommend",
            "comment_content": "**19 20 Spring special arrangement**<br />// but this review still applicable to the normal course, just don't enroll this course //<br />-- $200 budget, but I already spent $350 on this course, basically are the cost of 9V batteries. --<br /><br />use totally your own knowledge to build an aircar at your home.<br /><br />HKMOOC for you to learn (but actually can teach you nothing)<br /><br />You have to google everything by your own self.",
            "comment_teaching": "online zoom teaching.<br /><br />teach nothing useful.<br /><br />you simply do everything by yourself.<br /><br />Those helping you are actually your teammates but neither instructors nor sTA.",
            "comment_grading": "It depends on your luck, your effort may not be paid<br /><br />You may pay A+ effort and get C-<br /><br />You may also pay B- effort and get A<br /><br />There are a lot of other courses with good grades, it is unwise to put your grade on a&nbsp;&nbsp;gaming table, especially when you have to fight for your major in your first year.<br /><br />HKMOOC (20%)<br />Project demonstration (40%)<br />Design logbook (15%)<br />Teamwork (25%)",
            "comment_workload": "Tough like a 9 cred course<br /><br />If your car like you, you may success with only one trial.<br /><br />If your car doesn't like you, you will never succeed.<br /><br />HKMOOC (20%)<br />if you are free, you can finish it quickly, but how can a UST student be free.<br /><br />Project demonstration (40%)<br />if your car doesn't like you, you simply lose all these marks<br /><br />Design logbook (15%)<br />hand in every week, describe what you have done each week.<br /><br />Teamwork (25%)<br />some team brainstorm works",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QrIF0F8RiW2fWOElu4TIVRZO5qtlu6oa",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                },
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ad_inf1nitum",
            "date": "Nov 18, 2017",
            "title": "Not worth 3 credits.",
            "comment_content": "This is a debut course (though &quot;tested&quot; before in winter terms) aimed toward first-year SENG inductees who would like to have a multi-faceted experience of engineering and design prior to declaring a major. <br /><br />The course will cover topics in the fields of mechanical, electronics and computer engineering, and the final project consists of working with a group to build an airship with an Arduino microprocessor, controlled via Bluetooth using an Android device.",
            "comment_teaching": "Most of the technical information will be taught through a &quot;flipped classroom&quot;, and the completion of which will constitute a part of your grade. The online course will go through the necessary information you will need to construct your airship.<br /><br />However, the information provided is too specific and rarely useful apart from its model use. This means it is difficult to solve problems on known information, as the arising problems are likely to be beyond the scope of the online course. Problem-solving must thus be accomplished outside of what the instructors provide and has already lost many groups valuable time due to the large student/instructor ratio as well as a lack of competent TAs, who are more likely to be screwing around than actually providing useful solutions.",
            "comment_grading": "See attached for detail:<br /><br />Online course: 20%<br />Proof of concept: 10% <br />Idea presentation: 25%<br />Project progress: 35%<br />Team/self-reflection: 10%",
            "comment_workload": "If you foresee yourself having even one extra-curricular commitment that might hinder your ability to work with your group during the off-hours of the week, it is best for you to AVOID this class. In fact, this goes for all project classes in general. <br /><br />You are guaranteed 3 hours a week to work with your team, but it is certain that you will need to spend much more time with your group to solve the plethora of unforeseen problems that will arise. Since UST students' schedules are usually unique, it will mean that you must work during the off-hours to accomplish anything outside of the 3-hour time slot during class.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "YaQtZaGJllLGszFYIbNqmMqv96xvIlx9",
                    "name": "Screen Shot 2017-11-18 at 8.37.08 PM",
                    "format": "png"
                }
            ]
        },
        {
            "hash": "i9XnKVFN4J25DxKC0FjIgTCvYXLbhZ4V",
            "semester": "2019-20 Spring",
            "instructors": [],
            "is_author": false,
            "author": "misky",
            "date": "Jun 10, 2020",
            "title": "Shit course",
            "comment_content": "Making a dumb car. Some really rubbish material is provided without much guidance. Expect to spend hours if not days on making those shit&nbsp;&nbsp;components to work.",
            "comment_teaching": "Nothing useful learned. Expect to learn most things in google.",
            "comment_grading": "Graded base on tasks and build logs. I accomplished all the tasks and logs with full effort but ended up with a B+. No idea if a range really exists.",
            "comment_workload": "Expect to spend days working on the cars. A total waste of time to enroll this course. Not worth the time.",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XwWXXfqio6vcQsbUrRj1jKG3MAQEQ8nV",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Alex CHIU",
            "date": "Dec 20, 2017",
            "title": "May be painful, but always worth a try",
            "comment_content": "A lot of materials, although most of them are just given on the mooc and requires self-learning, they are there, and is part of the course. Informations from mechanics, computer science(andriod programming) and electronics(Arduino board and programming). I like all the instructors' teaching, I really got a great many new knowledge from the teaching.<br />What's more, this may be the first year course that desire the most working in lab, after class of course.",
            "comment_teaching": "It may be hard for someone who is unwilling to ask to do well in this course, as a large proportion of lessons are online. And after online learning, no-one will come to you and help you figure out the problem unless you try and ask.<br />At first I also think this teaching method is junk, but I now think it is very good and advanced.<br />The things I have learned is sure to be far more than the grade I have gotten.",
            "comment_grading": "I won't give a high mark because I didn't get a good grade(and it is so low when compared with my other courses), but I would say the grade of your group always deserves your work(at least to some content).<br />Actually the mark for this &quot;Grading&quot; section is the level of my grade, I think I must admit it is the final score after the careful consideration of all the instructors.<br />To me, I think the grade is not equal to the work I (caution that I use &quot;I&quot; not our group here) have done. But as our group was graded as a whole , I think I have nothing to complain about. It should (and it actually is, although I won't agree with that) be reasonable.",
            "comment_workload": "My comment wasn't, and won't be a&nbsp;&nbsp;&nbsp;common phenomenon.<br />I think most of the participants may give a score from A to C for the workload part?<br />I would like to describe the workload to be very hard mianly because our group met very big problem, and I need to spend at least ten hours each week (well, except for one week, I must admit that, and also not for the last two weeks when I spent three hours per day) in the lab to work or otherwise no one in our group would be working and we would fail the course.<br />Although ten hours seem to be a great amount of time, if everyone (5) is working, I'm sure the time would be less than three hours per week,<br />this conclusion is based on my observation of some of the groups.<br />Just remember to always work together, and I believe the class would be a fun one. (Although I didn't feel that myself)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jN3k8I0EAZSA0GM05j4ddEw8KhEygf4W",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "P-Dawg",
            "date": "Jan 24, 2022",
            "title": "Heavy workload with debatable payoff",
            "comment_content": "For this semester, our final objective was to build a total of 4 soccer robots (1 for backup), each equipped with a shooting mechanism used to handle a mini soccer ball, and compete against other groups in a soccer match.<br /><br />In the first 4 weeks, we were to learn a bit of lab safety, the basics of electronics (content resembling ELEC1100 but way less in depth), basic programming in C++ for Arduino, and writing apps with Appinventor. This is done by yourself through a website HKMOOC, in which your performance is counted towards your final grade. A &quot;first build demo&quot; is then conducted, in which you demonstrate what you learnt by making an app to control 2 motors via bluetooth communication. Despite being challenging in nature, model answers have been provided by STAs (Student Technical Advisors).<br /><br />Next, you begin your actual construction of your 4 robots for the &quot;final competition&quot;. In this period, you are taught how to use 3D printers and the laser cutter, as well as Fusion 360, a 3D modelling application. In this period, you are given freedom to work on the project however you like, and devote however much time you deem necessary. In between, there will be a &quot;launch level demo&quot; (essentially a progress check).<br /><br />---<br /><br />[Conclusion] All in all, the grades you get from this course are not proportional at all to the effort you put in, since most of it comes down to the final competition, and there may be unexpected factors there. If you're looking to get a good grade, I do not recommend this course. However, this course was ultimately a break from sitting in lectures, and instead we were putting things into practice and getting our hands dirty. You also learn quite a fair bit from the course, and can benefit in other areas (e.g. access to the lab, friends from the course, etc.)<br /><br />tl;dr, Echoing the title, the workload is heavy, but most of the payoff doesn't go toward your grades, but to other areas.",
            "comment_teaching": "This part is tricky to comment on, since you do most of the learning on your own. You learn things given to you on HKMOOC, then experiment with the project yourself. When you are looking for help, you are most likely looking for the STAs in charge. Although the STAs are helpful with things you may be stuck on, or using equipment e.g. the laser cutter, you should ultimately be prepared to learn things on your own, whether it'd be catching up to things you don't know, or specific research needed for your robot.",
            "comment_grading": "Individual:<br />5% HKMOOC<br />10% Launch-level Demo<br />5% Robot design<br />5% Kicking Mechanism Design Sketch<br />5% Team Build Session Attendance<br />Group:<br />15% First Build Demo<br />45% Final Competition<br />15% Team Logo and Robot Uniform Design<br /><br />---<br /><br />The grading is not particularly bad, but not good at all, especially given the amount of time you would have to invest in this project. Freeriders may also affect your progress, possibly denting your final grade even further. In addition, there only are so many winners in the final competition. In other words, not &quot;winning&quot; would most likely knock you down to B range. (Our group was one of those that didn't do well in the final competition, and belonged in the lowest mark category).<br /><br />Make sure you treat HKMOOC seriously, because not getting full marks there is also going to dent your grade. I didn't get the full 5% thinking that it'd be fine, and my grade may have ended up hurt.<br /><br />Other than the above 2, I got full marks in the rest. My overall marks were not disclosed. It was a B+.<br /><br />Is that bad? Not really, if anything it's pretty great. Was it worth the amount of time I put into this project? Also not really.",
            "comment_workload": "I'm only year 1, but it was the course with the heaviest workload from my experience (I would've wanted to rate this an E, but I probably haven't experienced enough of UST to know). Near the final competition, I practically skipped all my other classes just to come to the lab and work on the project, and so did my teammates. I also stayed overnight in the lab the night before the contest to work on the &quot;robot team uniform&quot;.<br /><br />Do note that we have to construct those robots and their shooting mechanisms from literal scratch. A design has to be thought out, it has to be made and tested. You have to be prepared (both physically and mentally, I mean it) to make iterations and iterations of your work, abandoning things that just didn't work, and making certain sacrifices.<br /><br />Not to mention that you'd have to account for time spent on learning e.g. the wiring and electronics, and spending extra time if your group has a freerider (which when you have groups of ~6, makes this a pretty likely occurrence).",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "y2TFgEORy9fOpaqromvQntK5nhFTuoci",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "nooo",
            "date": "Jan 21, 2022",
            "title": "Course that give good grade and fun to learn with",
            "comment_content": "can learn fusion 360, Arduino, mit inventor, how to use 3D printer and laser cutter.<br />Mostly about team work with others random teammates.",
            "comment_teaching": "Mostly rely on your self learning<br /><br /><br />STA's are very friendly, they give plenty of mental and technical supports. Will learn a lot if you always stay there.",
            "comment_grading": "Very good grade. You can get what you deserve base on your effort and time.",
            "comment_workload": "Not much assignment to hand in. Will give a good mark if you finish the basic requirement of the homework. <br />Will definitely spend a lot of time for the robot. At least two meetings per week.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "uhKXDOq5lO2Per2OtYQEDkQ7yOZCkiVR",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "____w.era______",
            "date": "Dec 30, 2021",
            "title": "Very Good Grade Course If You Pay Much Effort",
            "comment_content": "In this semester, we are required to make 4(1 of them for replacement and not compulsory) soccer robots with shooting mechanisms in a team of 5-6. However, the topic is subject to change for every semester. The course covers a wide range of knowledge from product design, app programming, Arduino coding, electronic components wiring, 3D printing, and laser cutting. Since it is a blended mode course, the lessons of each week do not teach anything but they are provided online. The best way to learn in this course is to ask STAs and Google. The more you engage in the course, the more you can get from it.",
            "comment_teaching": "Since HKMOOC is a pretty old platform and they never update it, the self-learning process maybe not be that satisfactory, but definitely enough for your launch level demo. Paul will be there every lesson for you to ask questions, and Ben will give some feedback on your design in the consulting session. There are some STAs assigned to every group and they are essential to the course. They developed the whole project and they will assist you through the process. Although I didn't get help from the STA assigned for my group, the other STAs are also helpful and they are all brilliant people.",
            "comment_grading": "25% individual score &amp; 75% team score<br />HKMOOC\tIndividual\t5%<br />Launch Level Demo\tIndividual\t10%<br />Design Sketch for Kicking Mechanism\tIndividual\t5%<br />Build Session Attendance\tIndividual\t5%<br />Robot Design and Team Role\tTeam\t5%<br />First Build Demo\tTeam\t15%<br />Team Logo &amp; Team Uniform Design\tTeam\t10%<br />Final Competition Task 1\tTeam\t20%<br />Final Competition Task 2\tTeam\t25%<br /><br />The grade is very good in this course, basically A/B course if you didn't perform too badly. You will get full marks for HKMOOC, launch level demo, robot design, kicking mechanism design, and attendance generally. I got 9x% in the HKMOOC, unknown for the uniform design and full for the rest. A+ as a result.",
            "comment_workload": "If you are lucky enough, you can freeride the whole course and get an A+ with an OP teammate. Or if you are even luckier with a team of free riders, you can carry your team by doing everything yourself. The average workload for an ordinary cooperating team is definitely still more than 3 credits. It is still worthy and I definitely recommend taking this course since you can learn a lot and this is very likely that it will be your only course with hands-on experience in UST. If you decide to take the course, bless you with good teammates.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TDJVWE8qukDBSp1W1rdJZW2CV0PIJ6yo",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "benbenLUCKYust",
            "date": "Jan 04, 2021",
            "title": "Chur as much as you can to get A range",
            "comment_content": "Basically, it's a course that requires you to build an aircar (driven by propellers) as the final project. Also, you will be in a group competiting with other groups by finishing some tasks using your own car. But because of the COVID, everything runs not so smooth.<br /><br />Technical aspect:<br />CS: app inventor to make an app for controlling the air car using Bluetooth<br />Elec: arduino, breakout board, h-bridge, motors and so on<br />Mech: building the car with materials you choose and also some tasks using Fusion 360",
            "comment_teaching": "The teaching is not bad, at least you can learn something inspiring from the professors and TAs.<br /><br />I think the arrangements due to the COVID is kind of messy but still acceptable.",
            "comment_grading": "If you can fulfill most of the assignments like demo, design diary and videos describing your progress, you will get an OK grade. I got A- but I couldn't even finish one of the demo.",
            "comment_workload": "Tbh, the workload is really heavy. Though it worths exchanging with grading.<br /><br />You will have to attend online lectures MOOC and quizzes outside the scheduled time.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1nCDJwB0cWW6g903VVPu3wOPwBNarYoS",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "ywhui",
            "date": "Mar 16, 2020",
            "title": "",
            "comment_content": "Just an arduino car making.The main obstacle is to find appropriate parts like screws .Also,buy some arduino boards and h-bridges to repair.",
            "comment_teaching": "Nearly teach nothing, all the class material available in HkMooc.have video,article and tinkercad for you to stimulate your arduino program",
            "comment_grading": "Good grade,according to the syllabus,there is a battle between different cars from different groups.Battle includes levering up eggs,pushing a big rubber ball.However,it changes to show photos and a video of the car because of wuhan coronavirus.<br /><br />get B+ eventually",
            "comment_workload": "high ,need to stick in the lab",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pWtZ5eYXMREa1FGEAU8cw8IrtIRJpOyG",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 0
                },
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Alvinlty",
            "date": "Aug 17, 2019",
            "title": "I didn't trust the course reviews, and here I am",
            "comment_content": "The course is separated into two parts, the first part is done online (HKMOOC), which teaches programming with MIT app inventor 2 and Arduino. The second part is lessons and workshops, all groups will build a Bluetooth remote-controlled vehicle partly powered by a DIY chemical battery by the end of the course (this might change for each semester). Workshops include basic Solidworks skills and chemical battery theory, the remain lessons are for the individual groups to work on the project.",
            "comment_teaching": "Most of the learning is done on HKMOOC, they like to call it flipped classroom learning, which I find rather terrible. The quality of online materials is the main culprit. Some of the short videos are 30 seconds long, with the intro occupying 10 seconds. &quot;Page flip&quot; sound effects much louder than the speaker's voice. Online assignment questions are very vague. But the physical workshops and lessons are fine.",
            "comment_grading": "Online activities (HKMOOC) 20%<br />Launch-level demo 10%<br />App &amp; motor demo 5%<br />Design sketch 5%<br />Team portfolio 20%<br />First build 5%<br />Final demo 25%<br />In-class teamwork assessments 10%<br /><br />My grades:<br />HKMOOC 94%<br />Other grades were not published<br />But our team finished last in the final competition due to technical issues<br />Final grade B<br />This grade is not worth the time and effort spent",
            "comment_workload": "It's a 3 credit course but feels like 6 credits. Most of your free time between lessons will be spent on building the project vehicle. Also, you will eat a lot of Subway, since it's closest to the lab. Luckily, I have responsible groupmates, each specialized in an area, therefore it was still manageable. On the bright side, you get to play with power tools, 3d printers, and laser cutters.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7JJSgszIu5Xw4utERqBe2M888VCGRq9i",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CS水泡",
            "date": "Jan 18, 2019",
            "title": "May be very painful, but worth the experience",
            "comment_content": "This is a semi-experimental course aimed toward first-year SENG students who would like to get some hands on experience before declaring a major.<br /><br />The course will briefly cover mechanical, electronics and computer engineering, and the final project consists of working with a group of five to build an off-road vehicle with an Arduino microprocessor, controlled via Bluetooth using an Android device. You'd have access to 3D printing, laser cutting, power tools and soldering equipment.<br /><br />Some prior knowledge and experience in coding and using Arduino are recommended.",
            "comment_teaching": "Teaching is mainly done on the HKMOOC platform. It covers Arduino and making of the Android app but the mechanics of vehicles are lacking since the materials haven't been updated and are for airships from the previous semester.<br /><br />The scope of information is very limited and problem-solving skills are needed. Most teams relied on teammates with coding or building experiences but an afternoon of internet search can get you most of the solutions.",
            "comment_grading": "Online course: 20%<br />Lab Activities: 15% <br />Presenting ideas: 25%<br />Project demonstration: 30%<br />Team/self-reflection: 10%<br /><br />These are very segmented modules most of which can be made-up afterwards, anything before the final competition are just ticking checkboxes. Your work goes directly into the grade unless there is a major failure in the final.",
            "comment_workload": "If you are fortunate to have participating teammates, the workload isn't too bad. It is fine if you see yourself going to the lab for this extra-curricular a few times a week. <br /><br />Class are 3 hours a week that you should be able to gather the whole team but don't take that for granted. Also, don't expect everything to be done within that time since it is vastly inadequate to build the vehicle and make it work. <br /><br />This one largely depends on teammates and which portion of them are investing their time. Don't ever take the locker key if you don't want to be free-rode by all of your teammates. For me, my teammates did nothing, if not with a negative work done. The workload is high but still manageable if you let it take up most of your time.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "OQFnCKms2XVFvsLZZnFVIAmy70sRZso5",
                    "name": "The Rubics",
                    "format": "png"
                }
            ]
        },
        {
            "hash": "YsjI8vYHG3IbGxTp04etuTOHgtJoY152",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kash",
            "date": "Jan 11, 2018",
            "title": "",
            "comment_content": "No classes or lectures after the first 3 weeks. <br />In groups of 4-5 members, you are tasked to design and create an airship from scratch with an Arduino Nano microprocessor, controlled via Bluetooth using an Android device. <br /><br />Based on 3 main engineering disciplines: Mechanical Engineering, Electrical Engineering, and Computer Science<br /><br />Concepts taught using an online platform called HKMOOC: <br />Electrical- Arduino, Microprocessors, Signals, and Communication<br />Mechanical- Design of the airship, equilibrium, forces affecting the flight of the airship<br />Computer Science- MIT App Inventor, Arduino<br /><br />Recommended to have prior knowledge in C to code the Arduino nano, which controls the speed and rotation direction of the motors",
            "comment_teaching": "Online lectures were adequate, but they didnt teach us about coding in C for Arduino which is crucial. Concepts taught in the Mechanical Engineering and Electrical Engineering section was very important for the design of the airship. The lectures for the Computer Science section were ok.",
            "comment_grading": "Online course: 20%<br />Proof of concept: 10% <br />Idea presentation: 25%<br />Project progress: 35%<br />Team/self-reflection: 10%",
            "comment_workload": "The workload is heavy. This course is all you and your team members. You need to schedule meetings with your teammates and start early to meet deadlines. Starting early is crucial because sometimes your design may fail. If none of your team members know C, then your going to face a lot of difficulties.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rsiCuStVgBEQf0929Rnc5oZMhNmgVtoh",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "/.ss",
            "date": "Jun 30, 2023",
            "title": "fun course, grade is luck dependence",
            "comment_content": "build a robot with your teammates that you have to design, make parts for it, assemble, and coding all in one. It is then be used in some tests and in a competition with other teams. I would say the content itself is quite fun and is different from most other courses.",
            "comment_teaching": "I would say the teaching team are trying to be helpful and sometimes they really do. Most of the time, not so much.<br />The problem is most students know nothing about the hardware and software they provided. And it is too complicated to teach the students everything about those stuffs. So they just teach us the minimum for those things to work. However, because of the lack of knowledge, if a problem occures, you likely won't be able to&nbsp;&nbsp;identifily what causes that. If you are lucky, the teaching team will identifly the problem for you. But most of the time they will be bussy doing other things while helping 8 teams at the same time. So they will come to a concludion of &quot;there should be something wrong with your code&quot; which is not really the case.",
            "comment_grading": "It is neither good or bad. It is very luck dependent. You only have a few trys on the tests that take a large part in your grade. And those tests are done as a team of 6, with 3 robots. if you have bad luck, some parts of your robot might fail during the test, your teammate's robot might fail, or they are just bad at controlling the robot or what ever. There are just too many things that can go wrong and you can do nothing about that.<br />The competition also count towards your grade. The results are not related to your grade though. They mainly grade that part by how you deal with problems, the mindset on designing thing and how you try to implement those designs. Atlease that is what they said.",
            "comment_workload": "Very high compair to other 3 cred course. You have to work hard for a chance to get a good grade.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sqtOtnlXPDIX78vGMa2IRNSYcMOMRcVx",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "anonymous 123",
            "date": "Dec 30, 2022",
            "title": "This course teaches me the importance of choosing courses. (Not a good idea for people who are seeking grade)",
            "comment_content": "This course mainly focus on a project. In this semester, I need to make a car for a football match. Each team contains 6 people and divided into 3 pairs. There is schedule of different goals. We need to finish the goal by the time planed in order to get the marks. Before project started, we will learn some apps, including autodesk fusion 360, arduino and app inventor 2. Then, each pair need to use those apps, a arduino nano, a Bluetooth, three motors, a piece of acrylic and wood to make a movable, competitional robot in about 10 lessons. After that, our team need to give a creative presentation(suppose you need to sale your product(rubbish) in broadway) and classmates or teacher will ask some questions which is difficult to answer. Between those works, Mr Bun Chan will give some inspiring(but a bit unrealistic) talks. You may learn something special which you&nbsp;&nbsp;seldom learn from others. If you really think about what he said, it may open lots of possibilities of your life.(That's why I don't give E to the content.) However, most people are only focused on their car. Beside those talks and app teaching, it's your time, you can do anything you want. They will take attendance(seems affect part of your grade) but you are not required to attend almost all lessons(including those talks and app teaching). However, if you don't attend the lessons which do the assessment, you will loss that marks. (They will email you before those lessons.) In short, you can see how terrible the final year project is through this first year project.",
            "comment_teaching": "As I said before, you will learn some apps, including autodesk fusion 360, arduino and app inventor 2. However, teacher who are proficient in those apps will use the app&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(to be continued)",
            "comment_grading": "(to be continued)",
            "comment_workload": "As I said before, you will learn some apps, including autodesk fusion 360, arduino and app inventor 2. However, what I have not said is you need to learn those app in two lessons and later you need to use them to make your car. After that,&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(to be continued)",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "paav3gsQ1baI55WSLGD7Mb4EYLkYouiY",
                    "name": "class 9",
                    "format": "pptx"
                },
                {
                    "key": "ixWmmyRq1b3ZioT5jZEIinSnKhayTcC1",
                    "name": "class 7",
                    "format": "pptx"
                },
                {
                    "key": "8WBLCH2052URkloXqspRN0eXAQ08WDyz",
                    "name": "class 5",
                    "format": "pptx"
                },
                {
                    "key": "lL2aINoiUM3YGooU8fb669eR4OAC6nkX",
                    "name": "class 4",
                    "format": "pptx"
                }
            ]
        },
        {
            "hash": "dHFIDxe8dT7rDwuZcwtydDNFJf5QPMlx",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "thehound",
            "date": "Nov 24, 2022",
            "title": "If you acknowledge any gods, start praying NOW!!!",
            "comment_content": "Forced you to learn how to use google",
            "comment_teaching": "Long story short, they don't teach you. I am not exaggerating at all. They gave you only some minimal information about the robot and then you start building it. Over 90% of the time, I was using the search engine. Around 8 STAs will be there to help you, but only 2 of them were helpful. Most of the time you ask for an STA, and that STA go for another STA.",
            "comment_grading": "First Demo(in pairs): 20%<br />It is basically given for free since you have unlimited attempts<br /><br />Kicking mechanism design(in pairs): 20%<br />It is not disclosed, no comment<br /><br />Final competition(in group): 30%<br />Held just after the midterm period, thus the time was insufficient Half of my groupmates were not working at all, and I was forced to stay in the lab till 3 am!! Also, whether you win the competition heavily depends on your luck, not the design of your robot.<br /><br />Presentation(in groups):&nbsp;&nbsp;20%<br />5 mins a presentation, not much workload<br /><br />Peer evaluation( individual): 10%",
            "comment_workload": "It completely depends on your luck. If you got decent teammates, you might get an A for free. Unfortunately, it wasn't the case for me.<br />Overall, totally not recommended!!",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AsD37eKhEIvIwzpoeJekEHP7Qyhcd0Yv",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ringo ng 18",
            "date": "Oct 11, 2022",
            "title": "",
            "comment_content": "fusion 360<br />arduino<br />mit app inventor<br />power tools<br />and lots more if you think the knowledge can help the project<br />22fall's topic is soccer robbot, learn from peers and TA",
            "comment_teaching": "really self orientated<br />watch vids, test, ask<br />total 6 hours of teching , others are build session",
            "comment_grading": "no reference of past years, difficult,stressful",
            "comment_workload": "good teamwork and teammate is required to lessen workload otherwise disaster,communication<br />weekly6 hrs for strong people, avg 8, one man team may need 12+hrs<br />chur,week3 start teaching, week 4give access to USEL,week 5 already first build demo, week 10 final competition",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "J2BBJq6DDPXGdm2SVeEr1w30nS6WO6bA",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "amy123456",
            "date": "Aug 23, 2022",
            "title": "",
            "comment_content": "Main Task: Building 3-4 soccer robots for the final competition",
            "comment_teaching": "mostly rely on yourself, STAs and google",
            "comment_grading": "Individual (30%) work:<br />HKMOOC - 5%<br />Launch Level Demo - 10%<br />Robot Design - 5%<br />Kicking Mechanism Design Sketch - 5%<br />Attendance for Build Sessions - 5%<br /><br />Team (70%) work:<br />First Build Demo - 15%<br />Final Competition Part 1 (Dribble/Shoot) - 20%<br />Final Competition Part 2 (Football Match) - 25%<br />Team Logo/Uniform - 10%<br /><br /><br />nice grading<br />Most people got full marks in Launch Level Demo, Robot Design, Kicking Mechanism Design Sketch <br />getting B+ even being the last in final competition and most people got A range.",
            "comment_workload": "be careful of choosing group mates<br />we have worked overnight for couple of time",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3LIDMI8UuhtQhyo9RHBZpVgdkZj5Z1Ew",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "yesducky",
            "date": "Jan 26, 2022",
            "title": "Very Good Course",
            "comment_content": "Use MIT app inventor to make an app for controlling your soccer robot<br />Design and build 3-4 robots and kicking mechanism<br />(Kicking mechanism is a requirement, but basically useless for the soccer match)<br />Use laser cut, 3D printing, power tools to make your robot<br />Program Arduino nano<br />Make beautiful cases",
            "comment_teaching": "Don't expect someone to teach you.<br />You can only find some very basic stuff on HKMOOC.<br />Just learn how to use fusion 360, MIT app inventor, Arduino sketch from Google.",
            "comment_grading": "No relationship between your effort and your grade.<br />The grade is according to the result of soccer robot match. But you can't expect what trouble you will get during the match with the cheap components. It is common that Bluetooth is disconnected during the soccer matches and your robot can only keep spinning.",
            "comment_workload": "Depends on your teammates. <br />There are 6 people in a group. The workload is acceptable for a 3 credits course if every teammate is helpful. But if most of them are &quot;disconnected&quot; when you start working on robots.... And you have to build 3-4 soccer robots with kicking mechanisms (pretty time-consuming). Also, many materials you have to buy it on your own.",
            "rating_content": 5,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Y6tESjKlg64Qa6i8S4AnOiifeki2pWmM",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "hfgjdghj",
            "date": "Jan 24, 2022",
            "title": "Disaster",
            "comment_content": "In the course, you learn how to make use of the adruino board to connect different components such as motor and battery. There are lots of online tasks you need to finish almost every week. You need to make 3 robots for the final competition which is a soccer match. You can't learn anything because you are just simply following the instructions they give.",
            "comment_teaching": "The professors are talking about lots of idealistic but not practical things. You need to go through the files by yourself to make sure you can make the robot. The STAs can provide help but they are not always available to help you. Most of the time your need to rely on your teammates.",
            "comment_grading": "HKMOOC&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Individual 5%<br />Launch Level Demo&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Individual 10%<br />Robot Design and Team Role&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Team 5%<br />First Build Demo&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Team 15%<br />Design Sketch for Kicking Mechanism Individual 5%<br />Team Logo &amp; Team Uniform Design Team 10%<br />Final Competition Task 1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Team 20%<br />Final Competition Task 2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Team 25%<br />Build Session Attendance&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Individual 5%<br /><br />Our team doesn't have a good result in the final competition. I finished most of the online tasks and C range.",
            "comment_workload": "A lot of teamwork is needed. The time is definitely not enough for you to design and make everything on time. All the steps such as 3D printing take lots of time. You need to design the way your robots move and the kicking mechanism for the soccer match. They have lots of restrictions on the robot. Creativity is useless. Every team makes something similar. Don't expect the robots will run very well and have a perfect match. Most likely, the robots will run around randomly and sometimes crash with each other.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CD6MP4Bvsk2XmcWOv6IupQ4YqzVdbSri",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "神仙1號",
            "date": "Jul 07, 2021",
            "title": "A Satisfactory Course",
            "comment_content": "This course required participants to construct a futuristic room in which students would study. Blender was used to create the room. Some technology which could help the students to learn should be included in the room design. The technology should not be too far from the present.<br /><br />There were 8 teams and I was invited to one of the teams based on my background. Two teams had 5 members, and the rest had 4. <br /><br />The content changed from constructing a car to constructing a room. It is good for me because I am not familiar with constructing cars. <br /><br />In the last lecture, students were required to give a presentation for around 15 mins. Just get well prepared for the presentation. Answer the questions asked by the professors in a way that shows you are ready for these questions.",
            "comment_teaching": "There were around 3 lectures to teach you how to use Blender and the professor walked me through the necessary skills of making my own character and some basic modelling skills. <br /><br />Don't worry if you cannot catch up the progress in the first 3 to 4 lectures because it is quite difficult for all the participants to follow even you watch the video they provided in advance. Just watch the recorded lecture video again after the class. To be honest, this part drove me crazy because I felt annoyed when I couldn't catch up on the progress.<br /><br />The tutorials which were held by the STAs regularly were quite useful. Participants could ask them questions directly so that they could help you. By the way, They would be in the lectures with you in order to help you.",
            "comment_grading": "The individual work accounts for around 10% while the group work accounts for the rest 90%. Just put more effort into the group work and the presentations(2 presentations). <br /><br />Having performed badly in the first presentation, our team decided to work harder in the final presentation. Eventually, I got a decent grade because my teammates were utterly strong.",
            "comment_workload": "The workload was quite large at first because I hadn't used Blender before. The more time you put in learning Blender, the better grade you get. There were some lectures which encouraged participants to work with their teammates didn't put any burden on me. If I hadn't had discussions regularly before the final presentation, I would have had a hard time in doing tons of work in a short period before the final presentation.<br /><br />Attendance were required in some lectures in which presentations were needed. Meanwhile, I was not sure whether the other lectures required attendance.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tLmzitseBzAWZ3qc9zGkj3ki5QqUgGJQ",
            "semester": "2019-20 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Bunny001",
            "date": "Nov 07, 2020",
            "title": "",
            "comment_content": "This course is only about Arduino car making, the only problem is that you have to find suitable material to make the car, and sometimes have to buy parts or go to the lab to repair your car.",
            "comment_teaching": "Nearly nothing to learn in lectures. All the class material available in HKMOOC.",
            "comment_grading": "The grading of this course, students will be divide into different groups and have a competition.",
            "comment_workload": "Very high, You may have to keep upgrading your car, so you must always go to the lab for different parts.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "x7k6qsQvg1FXoIEnulvTACeL7xr7rlud",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Ktcw",
            "date": "Sep 11, 2020",
            "title": "",
            "comment_content": "This review is for ENGG1100 right before charging into online mode so the content varies with normal mode and online mode.<br /><br />The course is splitted into two parts: online learning and robot building. The type of robot will be different for each semester. The online part is induvial work and the building part is group work. Basic materials(Arduino, movement parts, battery) are provided, there is also limited reimbursement for the construction materials you purchased.<br /><br />For the online learning part, you will learn some basic knowledge of mechanics, electronics and programming on a website(HKMOOC) which you will find some of them useful for the building phase. This is the easiest part of the course.<br /><br />For the robot build part, you will be assigned to a group and start working on the robot from draft design to final build. Although there will be basic materials provided, you will still need to find yourself construction materials for frame and any another component. After you get your robot ready you will need to complete different tasks with it, which include competition with other groups(This was cancelled due to the epidemic. Instead of one on one competition in class, we were required to upload video for the tasks).",
            "comment_teaching": "For the online part of the course, basically you will learn all of the contents by yourself with the videos, readings and questions online. Even though you are not required to attend any physical class, you can still approach the TAs by visiting the lab during open hour or via email.<br /><br />For the building part of the course, you will have to show different demos(one per group) in class first before you really start to build a robot. Instructors and TAs will rate the demos for grading(for the whole group). After the demos you can start the building phase, you will have access to the lab during open hour for building the robot untill the end of the course. Same as online part, you may seek help from the lab staff when you necessary.",
            "comment_grading": "Grading was as follow(changes were due to the adaptation of online mode):<br />=======================================<br />Online Activities (20%)[Indv.]<br /><br />Prove of Concept (10% ---&gt; 15%)<br />&nbsp;&nbsp;&nbsp;&nbsp;- Launch-level Demos[Indv.]/ [Team]: 5% ---&gt;10%<br />&nbsp;&nbsp;&nbsp;&nbsp;- App &amp; Prop Demo[Team]: 5%<br /><br />Presenting Ideas(25% ---&gt; 30%)<br />&nbsp;&nbsp;&nbsp;&nbsp;- Drawings[Indv.]:5%<br />&nbsp;&nbsp;&nbsp;&nbsp;- TeamPortfolio[Team]: 20%---&gt;25%<br /><br />Project Progress(35% ---&gt; 25%)<br />&nbsp;&nbsp;&nbsp;&nbsp;- FirstBuild Demo[Team]: 10% ---&gt; 5%<br />&nbsp;&nbsp;&nbsp;&nbsp;- Final Competition[Team]: 25% ===&gt; Review of Design[Team]20%<br /><br />Teamwork (10%)<br />&nbsp;&nbsp;&nbsp;&nbsp;- Teamwork Assessments[Indv.]: 10%<br />=======================================<br /><br />You will have to worry about having &quot;extremely useful&quot; teammates in your team as there will be 2 Peer Assessments in total for you to comment your teammates, so that you and your teammates will get the desirable grade.<br /><br />I got a B+ for this course as well as my teammates, fair teamwork and result.",
            "comment_workload": "The workload of this course was a bit over for 3 credit. Fair enough for an entry level project course.<br />Although the online part was not difficult, for the building part you would have to work close with your teammates in order to finish the robot ASAP, you would not want to rush deadline with the others.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pSWdtoNrYJJumDos5L6QeGkbf1i8SFMv",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                },
                {
                    "id": 1073,
                    "name": "WONG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "三文治烘邊",
            "date": "Jul 28, 2020",
            "title": "Consider only if you can access their lab at anytime",
            "comment_content": "To learn necessary skills to complete a given project.<br /><br />Project topic varies by semester, but always related to propeller vehicles. In previous semester, each group were required to produce one vehicle only, but as a special arrangement, in this semester each one was required to produce an adruino-based propeller car, while other design /coursework still undertaken in team basis. <br /><br />Electronic kits were provided, in addition of $200 budget for materials and batteries. Most of my budget spent on batteries... <br /><br />Basic knowledge about software/ hardware/ 3D design will be delivered on HKMOOC and weekly lectures.<br /><br />Will have a race at the end of the course",
            "comment_teaching": "Mainly delivered by online learning platform. Only 3D design will be taught by faculties.<br /><br />Be prepared for self-learning, you will need out-syllabus knowledge if you want to accomplish works well.<br /><br />There will be student TAs assigned to each team, don't hesitate to ask them.they will be very helpful in production process.",
            "comment_grading": "HKMOOC Assignments 20%<br />Project demos 30%<br />Logbooks&amp;Breakout Room Presents&nbsp;&nbsp;30%<br />Teamwork(design/portfolio) 20%<br /><br />Don't know the exact percentage contributed by the race. No statistics provided. <br /><br />I completed all tasks with a few late logbook submission, finally A.",
            "comment_workload": "Expect a lot of time working on your vehicle. Especially you don't have suitable materials. Accessing the lab frequently can save a lot of time. STAs will help.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Nx8lRmiXChfQ2JJlRIW98E3HjKCrGeZN",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                },
                {
                    "id": 1073,
                    "name": "WONG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "PH",
            "date": "Jun 12, 2020",
            "title": "Very Fun With Great Grade",
            "comment_content": "The Duration of the course focus on building a Working Air Car and it have to complete certain task at the Final demo. However, the lectures are a little boring.",
            "comment_teaching": "Not a lot of Regular teaching is provided, most technical knowledge are provided by a website called HKMOOC.",
            "comment_grading": "Very Great, I just complete all required task at the correct time including the log books and car building and I get an A+. Each students are graded separately and some of my team mates got B- but they failed to complete some of the tasks during the demos.",
            "comment_workload": "Very Light , You only have to finish 4 Build Logs and 1 Reflection Log in addition to the building of the car",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fF1iGxjuP8hPc2WaQMWfVmlOwoBmrmFM",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 1073,
                    "name": "WONG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Undecided",
            "date": "Mar 03, 2020",
            "title": "Should not be a 3-credit course",
            "comment_content": "The many topics covered makes the focus sparse and disparate. Attempting to integrate all the engineering disciplines either results in a watered-down version of everything, or an overly high workload. This discourages students from obtaining a legitimate grasp or understanding of the topics at hand, instead drifting along and learning the bare minimum to do what is at hand, or get others to handhold them through it.<br />The online MOOC hasn't been updated from the previous curriculum.",
            "comment_teaching": "Although the intentions of the teaching style may be noble, the effectiveness, in this case, is questionable. This course attempts to be presented in a blended format with project-based learning and collaborative teaching. The online portion is okay, but potentially too difficult for some students, and overall, the difficulty of the content is all over the place, from the online section on electronics to the offline hands-on tutorials. This is disparity is further aggravated by the disparate abilities/educational backgrounds of different students.",
            "comment_grading": "Opaque grading. Due to the circumstances and change to online mode for the final demonstration, the weighings were changed. We have no part grades or feedback regarding our grades during the process. For the online portion, I did almost everything but our team had no physical product → A.<br /><br />Rubric (&quot;→&quot; indicates changes):<br />Online Activities (20%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;HKMOOC (20%) [Indv.]<br />Lab Activities (15%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Launch-level Demo (10%) [Indv.] / [Team]<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;App &amp; Motor Demo (5%) [Team]<br />Presenting Ideas (25%→30%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Design Sketch (5%) [Indv.]<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Team Portfolio (20%→25%) [Team]<br />Project Demonstration (30%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;First Build (5%) [Team]<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Final Demonstration (25%) →Review of Design (20%) [Team] Teamwork (10%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;In-class Teamwork Assessments (10%) [Indv.]",
            "comment_workload": "No exams, but other than that, heavy workload unless you freeride. More workload than 4-credit courses, with less guidance. Practical sessions can be hectic, and you will certainly need to spend countless hours in the lab if you want a final product.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XAsn0R6oE9sd3iiJi6SlUYhfCndkDUnb",
            "semester": "2018-19 Spring",
            "instructors": [],
            "is_author": false,
            "author": "KK121",
            "date": "Oct 19, 2019",
            "title": "",
            "comment_content": "Include basic MECH/CENG/ELEC/CS things",
            "comment_teaching": "All the professors and TAs are so nice that they often walk by and feel free to ask them questions if you have any problems.<br /><br />Detailed teachings tho.",
            "comment_grading": "Good grade if you have a good run and also nice teammates.",
            "comment_workload": "VERY VERY VERY HIGH WORKLOAD<br />It consumes a lot of time when you are really focusing on your project. You definitely need to stay in the USEL lab and do testing all the time for a smooth run.<br />Not really deserve that 4 cred.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5L3ZgTB6im3an1TN6fveLPpe2JSu7u68",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                },
                {
                    "id": 1073,
                    "name": "WONG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nat Wong",
            "date": "Jun 27, 2019",
            "title": "Good Course for you to try",
            "comment_content": "Built an off-road truck and trailer<br />*Project-based course<br /><br />1.Comp (Simple Arduino coding)<br />2.Elec (built up simple circuit)<br />3.Chem (self-construct chemical battery)<br />4.Workman (built the car)<br /><br />Is ok for you being not good certain part mention above, as it is a team project, you can divide them for some people to work on things that good at<br />If none of your group team willing t learn, wish you good luck",
            "comment_teaching": "The teaching mode is to learn things if you need <br />Not traditional spoon-feeding method, you only learn things if you find it needs to apply on the built on your car <br /><br />*NO midterm term or exam to test your learning",
            "comment_grading": "Quit Good<br />20% online work&nbsp;&nbsp;(HKMOCC) + launch demo<br />20% report<br />25% final demo (competition)<br />5% first demo<br />Out team get the fifth place(total 8 teams) but we end up with A grade.<br />Quick Good",
            "comment_workload": "Quick Ok if your team don't have free-rider<br />About going to Usiel Lab twice a week and plan all the thing to do and that will be ok<br /><br />Make sure you test your truck and trailer before the demo, as the circuit may sometimes not functioning.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lQ5ZM0BryFAIhkPdvifHbFMpNS0FZARa",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 0
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 0
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 0
                },
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                },
                {
                    "id": 1073,
                    "name": "WONG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "patatalam",
            "date": "Jan 19, 2019",
            "title": "",
            "comment_content": "they will provide u materials for basic elec, mech and programming, but its actually useless for building the freaking car lol<br /><br />it depends much more on ur creativity and also your own knowledge.<br />(and also luck:&nbsp;&nbsp;you have to construct your own chemical batteries and sometimes you wont understand why they don't work)",
            "comment_teaching": "basically theres no teaching AND NO LECTURES &gt;&lt; which I reli reli appreciate<br />its a self oriented learning course<br />tho they will give you materials to study, it is reli useless <br /><br />actually I didn't learn anything from the course lol cuz I have a very gooooood groupmate which helps me to do everything",
            "comment_grading": "it very depends on the final competition (product) cuz everyone will do will in the hkmooc and the first demo lollllllllllll<br /><br /><br />in the final competition, the Bluetooth module went a bit weird (cuz sb stepped on it) ... so we cannot finish the task on time, but at last I still et B-. I think its fair for me cuz I didn't contribute a lot haha",
            "comment_workload": "no workload if you have a good groupmate &gt;&lt;<br /><br />u have to be prepared that you need a few hours to find and purchase materials for your car<br /><br />the programming takes up quite a lot of time<br /><br />remember don't be too serious on your hkmooc",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cO6iae52UPuULOQc5aVECzJ4shRt1Uak",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                },
                {
                    "id": 1073,
                    "name": "WONG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Edmund Teng",
            "date": "Jan 06, 2019",
            "title": "",
            "comment_content": "This is a relatively new course added by the engineering department which aims to promote experiential learning (learning through experience and not lectures). This course aims to teach students to equip themselves with the knowledge required to complete a final project (in this semester, it was to make an off road vehicle that could climb ramps, navigate through an obstacle course and transport water). In this course, students are assessed through a variety of ways:<br /><br />An online module called HKMOOC (20%) - students do online activities such as watching short videos of professors teaching a concept, then answering questions about the taught materials, which are graded.<br />A &quot;Proof of Concept&quot; module (10%) - students have to demo their understanding of what they learnt from HKMOOC by doing various individual and team tasks, as set by the course instructors<br />A &quot;Presenting Ideas&quot; module (25%) - involves presenting orthographic drawings of the design you will want to use for the final project, along with completing a team portfolio<br />The Project module (35%) - In the later parts of this course (from week 8 onwards, if I recall), students have to complete the project, using all the knowledge that they have learned throughout the course. The project is generally split into 2 builds (both are graded), where students have to build an off road vehicle, along with a trailer, that can be connected to the vehicle automatically. The first build will require students to complete around 3 tasks separately, where the 3 tasks have a direct relationship to the tasks that the students have to be able to complete in the final build. In our case, the 3 tasks were to be able to climb a ramp, navigate in a figure 8, and have a chemical battery (of your own creation) driven trailer drive out of a box. The final build was a combination of all 3 of these tasks, except that they occur seamlessly. First, teams had to make a chemical battery driven trailer go straight for around 2-3 meters, make it attach to the vehicle by controlling the vehicle, then do the rest of the tasks. If I recall, teams were graded by how much water they could transport within 10 minutes, and on how fast their vehicles (without the trailers) were.",
            "comment_teaching": "Most of the teaching involved in this course is in the HKMOOC online module. Other than that, if you require assistance, it would be the course STA's that will help you, and only very rarely do you actually see the professors in person.",
            "comment_grading": "Not quite sure about grading, but I ended up with a B. I got a 91% on the online module, which was a mistake on my part because you could technically do the questions together with your group (each person has 2 tries per question, meaning up to 5 tries per group to guess the answer, and 1 more try per person to key in the correct answer after that). Other than that and the project side of things, I believe I got 100% on everything. For the project, my group completed all the first build requirements, but did quite poorly for the final build due to some mechanical issues. That is all the information I was given regarding the grading, and I have no idea about anything else related to the grading, besides that I got a B.",
            "comment_workload": "The workload is minimal, but only if your team works well together. For me, my teammates did close to nothing, so the workload was quite high for me comparatively. But even then, it was definitely manageable. Unfortunately, you don't get to pick your group mates, so if you want to do this course and aim to get A range, it's better to pray for good group mates that will actually do work.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9o4AQ8j9H7Wy8MywbA0Y3LAQBEHupQoh",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "RKD黄军",
            "date": "Dec 27, 2018",
            "title": "Fun, but be prepared to invest some time into this course.",
            "comment_content": "The course is split into two parts: an online module, and a real life project. This course employs a &quot;flipped classroom&quot;, and most of what you learn will be through experiential learning. Expect to learn about the engineering process and also how to manage teammates and time to produce a&nbsp;&nbsp;product by the final presentation deadline. The online modules will teach you about the basics of electronics, app design, and mechanical aspects of the project.<br /><br />I found that only some of the things I learned through the online modules were applicable to the final project. However i can say that i have learned quite a bit about the whole engineering process and that the content this course provides is quite digestible.",
            "comment_teaching": "The teaching in this course is quite unique. Instead of having lectures where the teaches feed information to the class, we instead learn from online modules studied out of class, and working on the project itself. Sometimes there will be a lecture held in the workshop, but this wasn't very common. The teachers were readily available to help and did provide very useful information throughout the course.<br /><br />I found that the teachers were most effective if you had a problem, and needed a second perspective or a helping hand. They were very good at giving suggestions on what the problem could be so that you can work more effectively towards solving your problems.",
            "comment_grading": "the course is graded as follows:<br /> - Online Activities (20%)<br /> - Proof of Concept (10%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|- Launch level demos (5%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|- App and Prop demo (5%)<br /> - Presenting ideas (25%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|- Drawings (5%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|- Team Portfolio (20%)<br /> - Project Progress (35%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|- First Build Demo (10%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|- Final Competition (25%)<br /> - Teamwork( 10%)<br /><br />According to the teachers, the grading is meant to be based on how much as an engineer you grow, and whether or not you understand the whole engineering process. Even though you may not do to well on the final competition, it is still possible to get a satisfactory grade, provided you compensate in the other areas.",
            "comment_workload": "This course will eat your time.<br /><br />Manage your time well, deadlines come a lot quicker than you might think. If you can manage your time well or produce a good quality product quickly, then you should be okay, but still expect to spend more than the in-class time on this course.<br /><br />Initially, the course didn't take up too much time, but as you get closer to the final competition, it will feel like there aren't enough hours in a day. Not to scare you from taking this course, its a great course, but be prepared to invest some time into it - like any course really.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7YhPLgmG1FATC9oYtWPCAfpUlNetbcH0",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                },
                {
                    "id": 1073,
                    "name": "WONG, Sam",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "sad_as_fuck",
            "date": "Dec 22, 2018",
            "title": "If you want to go fast, walk alone.",
            "comment_content": "For fm, this might be a fresh start to experience the stress and tension that UST engineers might be faced with in the future years.<br />The goal is to construct a Bluetooth-arduino remote controlled vehicle which is capable of dragging a trailer carrying a cup of water with as little spilling as possible.<br />The content might seem fun but it requires a lot of hard work given the over-abundance of free-riders. You might have to do all Mechanical (3D printing and woodcutting/lasercutting and structural design), Electronic (wiring) , programming (arduino and mit app inventor) and the worst part Chemical engineering (constructing a motor driving battery from scrap)all by yourself.<br />Though a good team might ease some burden but its up to luck.",
            "comment_teaching": "Let's be honest, you can really learn stuff here about practicality and all those bloody trade offs when doing engineering design. But don't expect the&nbsp;&nbsp;professors to teach you any useful stuff. Just ask the Lab TAs, who are very helpful, and ignore the professors. They are basically useless. BTW, you might want to really pay attention of the programming part of the MOOC and do the MOOC with your teammates to minimise errors.<br />Kelvin is a nice lab TA. Generally a nice, chill and useful guy.",
            "comment_grading": "Having consumed most of my time in the semester, I only got a B<br />IT'S NOT WORTH THE TIME!!!!!",
            "comment_workload": "Extremely high, especially it you have shxt teammates. I was fortunate enough to have a fairly good programmer but I was still pushed to the very edge. <br />Think about it, you have to spend your own time buying the materials which is already hard to find and it might not fit the car. You also have to learn solidworks or other cad programme to aid your design by 3D printing. Worse still, you have to really think of a design that can climb without sacrificing speed and stability.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lpVLYhafvy6fsxMIOrquSXCm2ohDK6Jm",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "amyriad",
            "date": "Dec 19, 2018",
            "title": "Quite depending on the ability of yourself and your groupmates",
            "comment_content": "The product for the project may be changed in each semester, so it is for reference only.<br />This semester has the goal of making a truck with Arduino Nano board containing sketch (code) connecting a trailer carrying water being controlled by an Android App compiled using App Inventor passing through the obstables and climbing up and down the oblique surface.<br /><br />Students have to buy materials outside within a budget of HKD 350 (no other currency allowed (so no Taobao / Amazon), and receipts have to be provided to claim back the money and give the bought materials to them), it is generally not easy to find the thing that you want. (And the default motor they provided have the axis that can fit in a kind of wheels that are not provided so either you have to buy that (if you can find) or have to make an adaptor (usually by 3D printing) to connect your custom wheel to the motor)<br /><br />The project consists of a self-made vehicle with separated truck and trailer, where the truck is driven by the motor connected to the H-bridge connecting to the Arduino board and it is powered by 2 3.7 V LiPo batteries. (The battery box they provided cannot touch the two sides of the battery so you may need to attach Aluminium foils to it to make it work). The Arduino board receives data from a bluetooth module that is sent from a Android device by a self-made Android App compiled by App Inventor. The trailer is driven by a self-made chemical battery (usually the Aluminium-Carbon battery as the materials are provided (A typical Zn-C battery with Zn replaced by Al only). You can buy your own material to make the battery also if you wish (within the budget))<br /><br />The truck has to connect to the trailer using mechanical means (no tapes) (usually magnets) (remember that you can only control the truck but not the trailer with chemical battery)<br /><br />3 motors and 2 servo motors at most (although it seems that nobody use servo motors)<br /><br />You cannot form your own groups, and the groups is paired up not quite randomly by course instructors. (It is ensured that at least 1 member among the group cannot speak Cantonese / Putonghua so English should be the only common language, (at least) 2 genders in the group, and may consider the strengths of every groupmates in the grouping process that we don't know)<br /><br />No presentation this semester.",
            "comment_teaching": "1. The online module:<br />It covers different area of knowledge which are generally useful to the course (although some are even irrelevant).<br />Generally it includes most programming basics in Arduino and App Inventor. Also, it provides the information in using the H-bridge. But it is not updated so it may include some knowledge which is for the previous semesters or other similar courses but not even useful for this year's project (e.g. this semester requires us to build a water-carrying truck with a trailer, but the online module contains some questions regarding to the airship like the resistance and turbulence)<br /><br />2. The Instructors and TAs<br />The TAs are helpful in providing suggestions to the groups regarding to the design, the program, the method to use the tools, etc, and they are willing to help.<br /><br />The instructors are supposed to cover the area field they teach at the start of some week's lesson. They may invite some professors to explain different stuffs like chemical battery, engineering basics, Orientation Sensor for App Inventor, etc. They can help much in the design knowledge.",
            "comment_grading": "1. You know nothing about your scores except the one you submitted like the homework an indivdual / group test build.<br />2. The grading may not reflect the actual performance much as the final competition contributes a lot.<br />3. The grading does not reflect how much work you have done but the final performance mainly.<br />4. The grading may be affected by groupmate performance although each teammate may receive different grades.<br /><br />Marking scheme attached below.",
            "comment_workload": "Summary: Very heavy<br />The course material (online module) is probably the part with the lightest workload as it only requires answering some questions. (within the first few weeks) (although some of the questions are not even relevant to the project)<br /><br />After that, the indivdual demo checklist is still acceptable as it only requires following the steps provided in the HKMOOC online module.<br /><br />The heaviest workload part happens after the first third of the whole course, when groups have to start concentrating on the final design. There are already 3 hours of lessons per week (in Fall/Spring, Winter schedule is even intense with 15 hours per week), the total course time is approximately 30 hours plus the online module (~ 6 hours).<br /><br />Although there may be some groupmates who may not lead the progress, but probably should still need to help in the whole design if they do not want to be considered as freeriders and being rated poorly in the peer assessment. Those who have adequate knowledge in specific area have to complete everything part as it is rare to find more than 1 groupmate with the same ability to distribute the workload. (especially the electronic part, the programming part, 3D design part and the mechanical part, even heavier for those who is the only one who can complete more than 1 of the above parts in the group). (ref: The champion of the final competition this semester is a group with 1 teammates doing most of the stuffs)<br /><br />Although it is not necessary to work after class, but most teammates prefer doing so. Using the week before the first build demo and the final competition are the time when many people spend more than 10 hours per day in contributing in the design as many things are hard to debug, and many problems are hard to spot out and solve, and the course material doesn't help much in this. Therefore the workload is so heavy that you are not supposed to have time to sleep, eating dinner, socialize and instead have to stay up night. (These two weeks are close to mid-term and final also)<br /><br />Also the team is supposed to sumbit a team profolio which requires answering questions after all.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "ak1ibGsCsXRCB8D19Q6TRRLtzM1d1eNe",
                    "name": "ENGG1100 Grade",
                    "format": "png"
                }
            ]
        },
        {
            "hash": "XBimYXPMoiBiAWAx0bPCVvqH0460m5zB",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                },
                {
                    "id": 1073,
                    "name": "WONG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JJThompson",
            "date": "Jun 19, 2018",
            "title": "Tough course for Coding/Electronic beginners",
            "comment_content": "The course focus on 3 domains: Mechanical, Electronics and Android App development (App Inventor only)<br />The course starts late at around 2-3 weeks after semester commences, and the first 2 lessons are just for introduction and team building. You will be assigned to form a team of 4-5 students with paired TA. Then you will need to complete the HKMOOC online learning module. After that, you will need to design a prototype by CAD drawing or simply draw by paper-and-pencil and the instructors will come and say 'it won't work' which you usually ignore them xd. The remaining part of the course is building your airship and keep doing programming debuting and App improvement for better control. There will be a team portfolio to be submitted before the competition. At the final competition you will need to control your own airship (all team members must control in different tasks) AND other teams' airship to fight for your performance and extra grade marks. There will be a 1% upgrade task in the competition that may help, where speed, stability and ease of control will be crucial to your success.<br /><br />It will be really challenging for ones without programming or electronic backgrounds as the covered knowledge are new to you and they are like rushing towards your brain in the online modules. If you are beginners, pray for getting into a team with&nbsp;&nbsp;teammates capable of carrying you through. Recommend to all students with basic Arduino programming exposure. As for Android app development it's rather easy, where the course teaches you to use AppInventor for that which is way easier than programming.<br /><br />You should work with your teammates cohesively and arrange time to build the airship. (My team always appear in the lab ha)",
            "comment_teaching": "The online module is all of the teachings, and they are somehow not very useful to your final build. The instructors are quite passive in terms of teaching. The TAs are sometimes helpful, but overall I think you will be on your own. Sam(one of the instructors) is very helpful yet, you can ask him anything related to programming or app.",
            "comment_grading": "The grading is nice, as a B should be guaranteed as long as you participate in every part of the module and don't piss off some of the instructors ha.<br /><br />20%~Online modules(HKMOOC)<br />10%~2 Live Demos<br />25%~Design Drawings&amp;Team Portfolio<br />35%~Final Build Demo&amp;Competition<br /><br />Grades are quite unknown as canvas don't show. Our team got 4th over 8 teams in the end,&nbsp;&nbsp;&nbsp;<br />but as we work very hard in building the airship and got full in all the Demos, we manage to get As.(all team members should receive same gradings unless there are free riders.)",
            "comment_workload": "The course should be giving credits depending on how hardworking the students are and how eager they are to design and make things perfect. The workload depends on whether you want to build an excellent model, and if so then you will be spending a lot of time in the app trying to make all those improvements. If not, then you should at least contribute in the team, which it's still quite time consuming. Prepare for at least 3 hours in the build sessions. (My team is always in the lab as mentioned xd.)",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6CbqKx4nKRONM4JmjM6aV95NpC22YgFM",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Sam ng",
            "date": "May 28, 2018",
            "title": "Good if you have great groupmates",
            "comment_content": "The goal is to build up an airship and corresponding components like electronic kits. There is a competition at the end. l think it doesn't matter a lot for the grade because l am quite sure that our team get 6 or 7th rank last but l still get A-",
            "comment_teaching": "You need to learn all the stuff on the internet. There are some STAs in lab to give some advice if you encounter any problem with the project.",
            "comment_grading": "If your airship can fly and be controlled properly, you will get a fine grade. I get A- even we get around 6,7th rank in the competition.",
            "comment_workload": "If you have good groupmates, then you will have very little things to do. They will carry you. If there is no one helpful in your team, you better quit the course or get ready for the extremely-heavy workload",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KAitWnl8xhTFUo1LPzChDvOChfvXGo1Y",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "正義必得伸長",
            "date": "Feb 01, 2018",
            "title": "",
            "comment_content": "Students are divided into design groups of five people and the team stays the same for the whole semester. The students work together to build an airship with arduino boards, motors, balloons, and some resources that can be purchased through stores. Its core value is team work, so it is quite challenging and provides valuable experience as for working with others.",
            "comment_teaching": "The solid knowledge as for electronics, dynamics, and MIT controlling app are mostly taught through HKMOOC, the 20 percent in online activities is based on the performance on answering the questions on the mooc, some of them can be ambiguous, not so directly taught, or hard to figure out and might spends quite a lot of time if you want to get good grade. <br />Team work is nice but you really need to open your mind and be thinking and learning to really learn form this course. <br />The professors are there to give valuable advice but it is mostly about learning through doing and learn to collaborate with people.",
            "comment_grading": "If you do work and do not free ride the grade is generally pretty good. Ending with the 7th place out of 12 team in the final competition. A-<br />- Online Activities (20%) [Indv.] 20%<br />- Prove of Concept (10%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Launch-level Demos [Indv.] 5%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;App &amp; Prop Demo [Team] 5%<br />- Presenting Ideas (25%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Drawings [Team] 5%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Poster [Team] 5%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Presentation [Team] 10%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Design Report and Material Order Forms [Team] 5%<br />- Project Progress (35%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;First Build Video [Team] 10%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Final Competition#<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;[Team] 25%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Teamwork/Self-Reflection (10%)<br />- Peer Evaluation &amp; Self-Reflections [Indv.] 10%",
            "comment_workload": "The workload can be very large near the midterm demo and before final competition as the final exam, when we stayed up late for the presentation and the competition. But it actually depends on how much you want to put into the project.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xCOuJRBpUjEvi0fwZl1O8q1COg3iu2vN",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "anoynymousse",
            "date": "Jan 25, 2018",
            "title": "Great concept with lackluster performance",
            "comment_content": "The content taught is quite interesting. The course is all about building an airship from scratch, learning the fundamentals of Mechanical Engineering, Computer Engineering, Electrical Engineering along the way. You will be required to solder an Arduino with a breakout board, batteries, and propellers together( warning: these equipment provided are quite fragile and need a lot of repeatedly precise soldering because they break down frequently).<br />Create an airship that can be controlled by an app by MIT appInventor. The knowledge applied is usually out of the content, so be ready to ask alot of questions!",
            "comment_teaching": "To be fair, the instructors are quite good and knowledgeable about their craft. They can be quite helpful as well if you know what questions to ask. TAs on the other hand are clumsy and just fucking around with little to no knowledge about the course.( no offense)<br /><br />There are only in class lectures for the first 3 weeks, then teaching is done through an online platform (HKMOOC) which is pretty okay( i had prior knowledge on the content).<br /><br />Most of the learning is through experience, failures and self help. Good teammates are crucial because a lot of times the content is not sufficient and you need to search for extra knowledge yourself.",
            "comment_grading": "Got a C for all my efforts which doesn't make sense. Should be graded for efforts not the end product because there are so many variables. Look for grading scheme in previous reviews.",
            "comment_workload": "This is the most shitty workload course I ever took. Even it is a 3 credit course, you probably end up spending 10++ hours every week in the lab trying to fix your not-working-but-seems-fine airship. Even before the airship building starts, HKMOOC gives you a huge surprise by the humongous workload by cramming a whole course about Arduino or AppInventor into one week and expects you to score good grades and meet the deadline.<br />This is a course that makes you either skip your other courses and extra curricular activities to commit. If you want to commit to other stuff, please do not take this course. <br />Pray hard to get good teammates or just quit before the add-drop period. Don't let toxic people ruin your day and fuck up your grades.<br />I had prior knowledge but shitty teammates were just pulling my leg. Try to encourage teammates to self learn if you don't want to become Einstein by the end of the course but get a shit grade.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Fb9ZOGjBMXOJbohdk5IQLT9XZXr5s31b",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "chw",
            "date": "Jan 24, 2018",
            "title": "",
            "comment_content": "The content is interesting. They teach you what are the factors that will affect an airship and ask you to build your own airship. Each team of four to five people would build an airship in a semester.",
            "comment_teaching": "The HKMOOC is very bad. It is difficult to understand what they are talking about if you have not studied that part before. However, the support from the lab is very good. You can access the lab and ask for help almost any time.",
            "comment_grading": "As long as your airship can fly, the grade would not bad.",
            "comment_workload": "The workload is extremely high. The time you spend on this course is greater than other courses a lot. You need to build an airship with three hours a week. That is not possible unless all of your members are doing quite well. You would need to spend extra time on it. Finding your members during the holiday to buy some materials. Building the airship on the day before the demonstration day. If there is freerider in your team, the workload would be much larger.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OJldBV9Ov96CJOtvYACPOhfkkuML0aqd",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Theodore",
            "date": "Jan 23, 2018",
            "title": "A useful but tiring class",
            "comment_content": "This class can really teach you some skills very useful for your later study in engineering field. But due to it's a debut class, there are tons of disadvantages need to be changed.",
            "comment_teaching": "......<br />I don't wanna say it but it teaches almost nothing during lecture time. Everything need to be done by your own no matter how difficult they are for year 1 students.",
            "comment_grading": "I don't know others', but I got an A-. Mostly contribute to the 4th place of my team in the final competition. But some friends of mine didn't get a satisfied grade although they put a lot of time and devote much energy. In fact, the grade could be effected greatly by your luck in the final competition.",
            "comment_workload": "Extremely huge.<br />Everytime when my friends don't know where I am recently, they know I am in the lab dealing with those stuff. Teammates help a lot, but the free-riders problem hurt a lot due to the random group given by professors.<br />btw, MOOC is off track with the class that I am taking, so I felt like I have dropped this class for several weeks.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "V4gM9LLw4ir4OtaTmRCCarMe3Tf7IdCy",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "小ding~",
            "date": "Jan 23, 2018",
            "title": "",
            "comment_content": "there will be knowledge of many filds,though mostly very helpful, but will be pretty hard for beginners.if you dont understand, dont be afraid to ask TAs for help.",
            "comment_teaching": "most knowledge is get through on-line-video, you should be seriouse about that.if not you may feel puzzle on class for the professors rarely teach in class.TAs are mostly very helpful.",
            "comment_grading": "very hard to get a good grade.talk more with others about the project so that you can get a better design.",
            "comment_workload": "teamwork is very important.make sure to keep your partner motivated.also keep your self devoted to the work of contribution conts in grading.also, you may make more than one modles,so be patient.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BsXpuxWwiJ9Ul3omrGcc6B8pUMRzk7kf",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "riwandy",
            "date": "Jan 22, 2018",
            "title": "DONT TAKE THIS COURSE",
            "comment_content": "Content is just okay. Will teach you a lot of things mostly useful.",
            "comment_teaching": "some sessions are okay. Too much to feed to you and they don't teach it properly. Online sessions sucks and the videos are not clear.",
            "comment_grading": "You're dead with a shit team mate. They bullshit you with a lot of criteria. in the end, they will only consider your team's placement in final competition",
            "comment_workload": "Not much to do. You can't do anything without a good teammate and the worst part is they assign teammats to you",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ODdsb3C5tKL4H4RnTKSimyzKwjNIb52u",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "xniac1998",
            "date": "Jan 17, 2018",
            "title": "",
            "comment_content": "You can have access to all the tools and material in the lab, and try to use interesting stuff such as 3D-printing. For those geeks and who are gonna to major in hardware and machnic the things tought in the class is useful, undoubtedly.",
            "comment_teaching": "Professors will not offer help unless they are asked to. And most student helpers(STA) are totally useless. One STA helped me much and encouraged my team when we are frustrated, but on average the teaching and tutorial was horrible.",
            "comment_grading": "I can only say better than I thought. The grade was somewhat appropriate in terms of fairness, but compare to the time and effort students had to spend, a D is reasonable for its grading.",
            "comment_workload": "Too much time and effort has to be paid on this course, especially when the teammates are not that helpful and corprative. As a year one student, this course's workload is horrible. And the assaignment is quite exhausting to me, both mentally and psychologically! Overall, if you have passion and great talent on the&nbsp;&nbsp;mechnic and hardware, you can consider this course.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ao3ijw1bsMfCsNZkdo93T33gMrpjKIa0",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Orange_C",
            "date": "Dec 19, 2017",
            "title": "A very Demanding course requiring a lot of self study and team work",
            "comment_content": "Its all about making an airship.<br />First you will learn about some basic knowledge on electronics, mechanics and computer programming. Then you will be required to use these knowledge to solve some problems. And after this you will be designing and finally making the airship with your teammate. The whole design is good, since they want you to apply what you learn to the airship. But there are some problems, which I will talk about in the teaching part.",
            "comment_teaching": "They want us to learn in a new mode. This is fine. But the materials they provided is not really relevant to what we are doing. Sometimes it is too general and sometimes it is too specific. When you are completing your work, you still need to Google for other information or you won't be able to finish it. The TAs are helpful but most of the time they are not knowledgeable enough to solve all the problems.<br />And the professors rarely show up in class, even if they do, they will basically just provide &quot;inspiration&quot;, instead of concrete knowledge. I think some lectures are still needed.",
            "comment_grading": "I think the grading is good because all members in the group get A range. There is a syllabus but you don't really know how many points you get for each part. Just follow the timeline will guarantee you an A range, I think.",
            "comment_workload": "In the first part of the lecture, all you need to do is to watch some online videos and finish some online quizzes following the video. It is not a lot but if you try to deadline fighter, it will take 3-4 hours and ruin your Friday.(Quizzes are due every Friday night). After this you need to figure out how to programme the Arduino and get the correct way of attaching wires to different components. The lack of relevant knowledge may make this process quite time consuming and sometimes frustrating. Finally you need to spend time on building the airship, shoot a video and make a poster. The time needed varies from group to group, but the average is around 3-4 hours per week(class time excluded).",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IPehoC1WB08aix1M8crgWAdzGghktjXU",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "_shing_",
            "date": "Jan 04, 2022",
            "title": "Hard work but worth it",
            "comment_content": "For this course, we had to build a total of 4 soccer robot. 3 main robot + 1 spare (optional). At the end of the course, we would need to play against other teams. The higher the ranking and goal difference we had, the better the grade. Apart from the final competition, we also had to complete a series of task with robot. Such as goalkeeping&nbsp;&nbsp;and dribbling. We also had to make a case for the robot with a team logo. The logo has to be 3D printed but not the casing. <br />You get to learn skills such as 3D printing, laser cutting, using fusion 360, using power tools, Arduino coding etc.",
            "comment_teaching": "Teaching materials were uploaded onto a platform called HKMOOC. We had to review the materials by ourselves and complete some quizzes at the end. However, the videos on the platform was pretty old and weren't that helpful. It would be better if you just asked the course STA or google the things you need. A lot of self-learning needed.<br />The instructors rarely appeared during the course and they did not&nbsp;&nbsp;teach much. Chan only appeared during the beginning of the course and at the end of the course. When he came to the course, he would try to encourage us and talk about some general engineering principles.&nbsp;&nbsp;Apart from that, each team also got a 15 minute consultation session with him. Where he would take a look at our robot and point out some problems that we may have to look out for. <br />The course STA were extremely helpful and warm. If we encountered any problems, we would ask them for help.",
            "comment_grading": "25% individual score &amp; 75% team score<br />HKMOOC Individual 5%<br />Launch Level Demo Individual 10%<br />Design Sketch for Kicking Mechanism Individual 5%<br />Build Session Attendance Individual 5%<br />Robot Design and Team Role Team 5%<br />First Build Demo Team 15%<br />Team Logo &amp; Team Uniform Design Team 10%<br />Final Competition Task 1 Team 20%<br />Final Competition Task 2 Team 25%<br /><br />The difficulty of the final task was changed abruptly and almost every group got full mark. So your grade relies heavily on the final competition and your individual assignment. I got second place in the final competition and scored full mark for the two tasks. For individual assignments, I got full mark except for HKMOOC. I think I got 85-90% on it. I got an A+ for the course.",
            "comment_workload": "This is course with high workload. Even with a good team, you may need to spend more than 3 hours per week in the lab. If you are unlucky and you need to carry the whole team, you may need to spend most of your free time in the lab building the robot and debugging your code. <br />If you are only taking 12 credits worth of courses, you might want to consider this as one of the course as this is one of the few course where you can gain hands on experience on building things. The skills you learn such as laser cutting are useful in future projects as well. I would say the time you spend will not go to waste,",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tVOHC2rWWVGXoxH1oJcLSBOhGP2Gm7rQ",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "KTZ11",
            "date": "Mar 29, 2021",
            "title": "Don't pick this course",
            "comment_content": "In this semester, you would need to build a remote air-propelled car and control it using your phone and Arduino. As the course description suggested, it tries to give learning experience of different SENG disciplines, so you would need to learn things including building an android app, Bluetooth, Arduino programming, some electronics and mechanics of a car. You can also have a try on 3d modeling.<br /><br />The learning material of this course is mainly delivered through an online platform called HKMOOC.",
            "comment_teaching": "The instructors teach nearly nothing and want you to learn by self-directed learning and trial and error. The lectures are just useless teamwork activities which are completely unrelated to the car, eg they would ask you to design a way for people to store their mask.<br /><br />The first half of the course was self-learning on HKMOOC, and you will learn the android app, Arduino and the wiring of the electronic components. This part is fine. The second half of the course is the assembly of the car, and this is the horrible part. They give no guidance on the project and you will need to work everything entirely on your own.",
            "comment_grading": "Grading method:<br />quizzes on HKMOOC: 20%<br /><br />Live demos on Android and Arduino: 10%<br />(you have to show that you can create an Android app and Arduino program to turn the motor in different speed &amp; direction)<br /><br />First build: 10%<br />(you have to show that your car can go in a path of figure 8)<br /><br />Final build: 20%<br />(a competition among different teams. Team members will have to do separate tasks with their car, like figure 8 and U-turn parking. Grade base on your ranking)<br /><br />Build log: 5%<br />(a weekly journal that records what you did to improve the car)<br /><br />Reflection after final competition: 5%<br /><br />Final drawing: 5%<br />(a drawing of the front, side and top view of your car)<br /><br />Breakout session participation: 5%<br /><br />Breakout design activities: 15%<br />( need to discuss features that improve the car, some breakout activity are not related to the car tho)<br /><br />Team design sketch: 5%<br />(a sketch of the thing discussed in breakout session)<br /><br />The final competition really depends on your luck, whether your car functions properly or not.",
            "comment_workload": "The workload of this course is huge. You have to make the car from scratch. And since there is no guidance on how you should improve your car, you have to do the trial and error yourself. There is just so many variables that you have to control, like the size of the car, wheel size &amp; material, the position of the fan, etc. This means you really can't find what is the problem that makes your car not working, and you can easily spend a whole day in the lab and achieves absolutely nothing. Even if you successfully make the car move and turn in one try, it might not work on the next try. You will also encounter random problems frequently like poor wire connection with the motor and parts falling apart. For me, I spend 2 days 10 am - 8 pm in the lab just to finish the first build, and it is super frustrating. Luckily I got teammates who are active and willing to help each other, which makes this process a little bit less painful. I highly suggest meeting with teammates and work in the lab instead of work at home solo. Not only there are more useful tools and material available at the lab(I got a try to use 3d printing, one of the few exciting moments during the course), you can also speed up the whole thing by working with teammates. But overall the workload of this course is still really high, and there is be a lot of pressure and frustration in the process.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Qy3vzfGn61X2RTAipqlbXFK4ijGCOMhZ",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "ilovecatsss",
            "date": "Dec 19, 2018",
            "title": "Weirdo course",
            "comment_content": "So this course basically requires you to build a chem off-roader (which is basically a car controlled by arduino and a tralier powered by a self made battery, holding a cup of water )(and yeah its no longer the airship last semester)",
            "comment_teaching": "Since this course is all about self-learning, I’d like to give myself an A after all these sufferings I’ve gone through.<br />First it was the sh*tty HKMOOC online courses. The video there just does nothing to help you to answer the questions there, nor does it help you with the actual project. Basically, I learnt nothing out of those online courses.<br />And then there comes the nightmare. I didn’t know what to do with the project at all, but I don’t want to be a freerider, so I just opted to do the app that would be used to control the car. AND IT WAS EXTREMELY DIFFICULT since I had no programming background whatsoever. Luckily, there is a god-level groupmate that knows how to write an arduino program so I could just do everything else on the app inventor without the need to mess with those horrific arduino codes (though I still spent quite a few weekends to finish the app).",
            "comment_grading": "HKMOOC 20%<br />Launch level demo 5%<br />App &amp; motor demo 5%<br />Drawings 5%<br />Team Portfolio 20%<br />First build demo 5%<br />Final competition 25%<br />Teamwork assessment 10%<br />Here is the mark allocation but it’s pretty much useless since you know nothing about your scores.<br />Just for your reference, out team was 3rd in the final competition (out of a total of 12 groups) and I got a really satisfying A+ in the end.",
            "comment_workload": "Just like what the other comment mention, it’s either luck or one man army. <br />I was lucky enough to have 3 AWESOME groupmates that made our project sooooooo much better. There is an ISD student (which basically translates to professional mainland student who already knows everything), a guy from Robomaster who was able to take care of all the 3D printing jobs (forgot to mention just now but you have to include a 3D printed part in your final design), and someone who is willing to do the woodwork and go out to buy extra materials (and then there’s me writing my app). (Lets not talk about that freerider in our group since I’m in a good mood today)<br />Given such amazing groupmates, we still had to spend some extra days in the lab before the first build demo and the final competition, so I would say that this course’s workload is pretty high. <br />(Not really related, but another guy in our class had 4 f**king freeriders in his group and he had to do everything by himself. Yet he still managed to win the competition. So if you are a genius like him, a one-man-army wouldn’t really be your concern.)<br />Side note: taking ELEC1100 beforehand would help quite a bit on this course (especially when you’re an engineering newbie like me) since it taught about the electronics stuff which you would need for your online course and actual project, and some basic arduino code writing, which would also be really helpful when you’re writing the app.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lal1XyxM3XBkfE3J8NCnq46ddi4c9faL",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                },
                {
                    "id": 1073,
                    "name": "WONG, Sam",
                    "rating": 1
                },
                {
                    "id": 1144,
                    "name": "NG, Ching Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Endrave",
            "date": "Jan 25, 2018",
            "title": "Either Luck or one man army",
            "comment_content": "In my view the course isn't only teach you how to build a airship, learn how to write app with app inventor and arduino code,design drawing, 3D print . More like let you know how to running a project and work and lead the team to work.&nbsp;&nbsp;<br /><br />Here you are learning how to make your airship to be a product ready to be sell. so you will have to present your airship,do some demo test and the will be a competition at the end of the course.",
            "comment_teaching": "HKMOOC with&nbsp;&nbsp;provide around 70% of the knowledge you needed to build the airship, rest is self-learning. However, material in HKMOOC is more than enough to build the airship.<br />In addition, if you spent time in lab with STA or instructor in your spare time , you will learn much much more and have a easier life.",
            "comment_grading": "At least the friends near me there is no one get below B.<br /><br />To get good grade:<br />1. be a good boy, finish all the online question<br />2. Be a nice guy and good team player, otherwise you may resulting in deduction in sub-grade, even your team get 1st<br />3. keep testing, components are very easy to worn out ,you may need to change parts very frequently, so make sure all the&nbsp;&nbsp;parts are easy to remove. NEVER HOT GLUE MOTOR!<br /><br />the grade isn't only based on the final competition , i did all the question in HKMOOC , i screw up in the demo,and got 4th in Final. I still got A+",
            "comment_workload": "Either luck or one man army.<br />HKMOOC isn't&nbsp;&nbsp;that hard but just time consuming , if you have time you can finish all materials in 2 weeks.<br /><br />Rest of the time you just build the airship. To be honest, one full day is much more than enough to finish everything good for deadline fighter ^~^, not midterm competition is after final so the workload aren't that much. <br /><br />But why luck or one man army?<br /><br />I used to have nice team that they don't know what to do,resulting in I did all the job. In normal circumstance, one team will build 1 to 2 airships, i was able to build 4 at the end, 1 ship per day. As long as you are responsible student this course won't be harsh for you.<br /><br />On the other hand, if you have lots of luck and good team, good division of labor. wow life is easy.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rORYXxz6kTUD9NmMWixitaGxVD1iM5E4",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1072,
                    "name": "LEUNG, Ka Lok (Jac)",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 133,
                    "name": "PONG, Ting Chuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rich7Fu",
            "date": "Aug 18, 2019",
            "title": "SUPER GOOD GRADE!",
            "comment_content": "You are provided with online materials for self-studying which include some of the basic knowledge of electronics, aerodynamics, programing etc.. ask the tutor instead of student helpers to seek for answers if you don't understand. Those materials can be hard to understand sometimes.<br />Then you will be asked to build a car based on those knowledge IN GROUPs (feel free to be a&nbsp;&nbsp;free-rider).",
            "comment_teaching": "You are supposed to learn by yourselves, if you don't know just google it then you can easily find your answer.&nbsp;&nbsp;Yes, those STAs cannot help you because they probably forgot how they built their cars after the course. All you need is ask Google. (sometimes instructors help too)",
            "comment_grading": "If you attend all the sections, participate in the group project, not ignore the online tasks, a B+ is guaranteed. There is no such good grade course in your second-year study. If you want GPA, just reg it.<br /><br />IF YOU FINISH ALL THE JOBS (like me), you get an A+<br /><br />If you free-ride then you can also get a C.",
            "comment_workload": "The workload is extremely light.<br />Just spend a few hours (10+) to google the answer of online materials and you will get almost 95% correct. <br />Just spend a few days to google on how to write C programmes and use MIT app inventor then you can finish all the quiz.<br />Just practice a few weeks on how to make 3D models,&nbsp;&nbsp;do laser cutting and do welding then you can finish the car in 2 weeks before the final tasks. Then you will have extra time to revise other important Course.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}