{
    "error": false,
    "course": {
        "id": 1371,
        "subject": "ENGG",
        "code": "1200",
        "name": "Engineering Team Design Experience: Airship",
        "description": "The Engineering Team Airship Competition allows students to explore various areas of engineering in order to design and build a remote controlled airship, culminating in the final competition before the end of the term. Students will use these specific project requirements as an opportunity to explore activities in which managers/engineers of various disciplines are involved. Specifically, they will build an airship that uses helium balloons for lift, has motors and propellers for propulsion and control, and is controlled remotely using an Android device. Students in this course will be divided into design teams with a common goal: construct an airship at the end of the term. Each team will then undergo half-a-term training on airship construction, mobile phone programming and hardware communication. Team members work together to obtain the skills needed to design their airship. Finally, the teams compile an airship and contest other teams in a competition.",
        "categories": [
            "Common Core (SSC-S&T)",
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2130,
            1730,
            1630,
            1610,
            1530,
            1510
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.25,
        "rating_teaching": 3.75,
        "rating_grading": 4.38,
        "rating_workload": 3.94,
        "review_count": 16,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 86,
                "name": "CHAN, Yui Bun",
                "count": 4
            },
            {
                "id": 1071,
                "name": "LAVIGNE, Paul David",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "RaYDu9uLkweu1WmjNnFR2ajfXng6Vwms",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Seeking4u()",
            "date": "Dec 17, 2016",
            "title": "",
            "comment_content": "Long story in short, you and your teammate have to build an airship to compete with other groups. Your team employs skills from MECH, CSE, ECE to complete a series of tasks.",
            "comment_teaching": "They give lecture-like presentations at the beginning, introducing simple concepts in MECH, ECE, and CSE. Not too theoretical though, but pay attention because these might appear in the individual quiz. <br /><br />And then you have lab, they will guide your team to complete team-based-tasks in class. You learn to connect motor and bluetooth module to the mainboard, use Arduino to control the MCU microcontroller, build Android controller apps using MIT app inventor 2. (might need a little programming experience, but they assign students with programming experiences to each team so no worries)<br /><br />After that your team start building the airship. They give assignments to keep track of your progress. For example, prepare a video of the airship completing different tasks, prepare a poster for presentation, etc. <br /><br />Overall the course does not teach too much (especially the most important part : mechanics), it's more of an exposure, an experience. Approach STA if you need help, they are really friendly.",
            "comment_grading": "The grading is okay. Take note that the final grade is heavily depended on the final competition.<br /><br />Be sure to submit assignments on time, be careful because at some point in the semester everyone in the team become so busy, that meeting up and completing the assignments become close to impossible.",
            "comment_workload": "The workload is moderate. The CRUCIAL and HARDEST part is the STRUCTURAL DESIGN of your airship! Do spend time to come out with a reasonable solution, that is an airship which is easy to fly, control and navigate!<br /><br />The Android controller apps and Arduino code can be finished in less than a day. Building the real airship takes more time, because your team has to think, discuss, and buy materials before working.<br /><br />Although they do not count the attendance, missing classes will make you feel lost, because they make announcements in class, and you have to work with your teammates in class too. Occasionally every team member has to be present, for assessments like presentation, video tasks and final competition.<br /><br />Technically there's no midterm and final examination, because final competition replaces these roles.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ktDqiMicY10XygH9d2TRzdpddw4lC5Zg",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "davidsaur",
            "date": "Dec 17, 2016",
            "title": "",
            "comment_content": "The overall content of this course is like a super condensed robotics team training bootcamp with pre-competition workshops and a final competition which heavily determines your final grade. Although emphasized in the contrary, I personally feel that background knowledge is expected (as the course material was merely a brief overview - not exactly helpful when put to test).<br /><br />However, with that said, robotics team members who take this course do not necessarily guarantee the best airship design and subsequently the highest grade (from personal experience).<br /><br />1. ECE<br />Basic content on how to use a arduino MCU (connect motors, bluetooth module, etc).<br /><br />2. CSE<br />&quot;Programming&quot; an Android controller app for your airship using MIT app inventor.<br /><br />3. MECH<br />Basic experience on soldiering wires.",
            "comment_teaching": "There will be a couple of labs during the first few weeks where you first listen to around half a class of ppt presentation then complete a couple of tasks via fiddling with arduino code as a team. Near the end of the course, you will have free lessons where you spend time building and testing your team's airship for the final competition. I also had the experience of learning to fly a DJI Phantom as a side experience which was nice.",
            "comment_grading": "1st Drawing &amp; Team Contact Info 2% (individual)<br />Lab: Electronics &amp; Motor Function 2% (group)<br />Lab: Android 2% (group)<br />Lab: Safety and soldering 2% (group)<br />App &amp; Prop Demo Oct. 24 10% (5% ten question individual quiz 5% group)<br />2nd Drawing 2% (group)<br />First Build 15% (group)<br />1st Peer Evaluation &amp; Reflection 5% (individual)<br />Presentation 20% (10% individual 10% group)<br />Final Drawing, Photos, Budget &amp; Materials List 2% (group)<br />Project Logs (at least 3 meetings) &amp; Material Order Forms 3% (group)<br />Final Competition 30% (group)<br />2nd Peer Evaluation &amp; Reflection 5% (individual)<br /><br />If you perform well in the final competition, you will get a good grade - so make sure you do.<br /><br />Take not that there are two peer evaluations so do not free-ride your teammates.<br /><br />First place in final competition + hand in all assignments on time = A+",
            "comment_workload": "The workload is relatively low if your teammates don't free-ride.<br /><br />Tasks focus mainly on your team's airship design, construction, and test flights, along with a couple of minor assignments mostly used to log your progress.<br /><br />No attendance, no midterms, and no finals.<br /><br />Be creative, be on schedule, keep your adrenaline pumping, no pressure, and you'll be fine.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "NmpcNUSgmyhGp6TwdII3vxIJZkx9m2lz",
                    "name": "ENGG 1200 Syllabus Fall 2016",
                    "format": "pdf"
                },
                {
                    "key": "AqgV5jcg8rVmMiMCzE3CqtKfJwLBzZx0",
                    "name": "ENGG 1200 Lecture Schedule Fall 2016",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "8yTJrjRenIrqHPqtYKyaHgoa2HZYBYS9",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "myeeeee",
            "date": "Jun 08, 2022",
            "title": "An inspired creativity course",
            "comment_content": "well common course for SSC S&amp;T Common course<br /><br />Due to pandemic, this semester didn't make airship. The whole course turn online and the project change to&nbsp;&nbsp;3D model and about creativity. <br /><br />The course separate to creativity part and blender part. Professor prepared lots of topic on how to think creativity. in the lecture, many fun activity involved, drawing on miro-board, breakout room section, poster designed, project designed. Maybe some topic might think boring, but I think it's the course you wouldn't skip class in ust.<br /><br />Blender tutorial taught some concept function in blender, it seems easy to get start; however if you wanted to make a good final project, you need to spend more time on self-learning on internet.&nbsp;&nbsp;<br /><br />The main mission is to make up a creativity toy. You will have a week to think about your design and drawing poster and in the last week, presenting for all class.",
            "comment_teaching": "Professor Chan is the best professor for design thinking and creativity. He share lots of experience and his knowledge on the topic",
            "comment_grading": "the grading separate into five parts, only first part is personal and other four parts came out with group.<br /><br />personal blender session<br />poster<br />ideal pitch<br />final toy concept( roadshow)<br />final toy modeling&nbsp;&nbsp;<br /><br />Well, I previous thought I can get A- or above due to the professor feedback on out final presentation.<br />However, I got B-. I am not sure the grade distribution but I am not satisfied to the letter grade at all.",
            "comment_workload": "It isn't too heavy. I don't need to spend another time after course. However, the last few week I need to spend another 3-5 hours a week with teammates on zoom to discuss our project and 3-7 on blender modeling.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IlR2tREsBQhVDIaLN8my9evVS6J9FIMh",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Metallic",
            "date": "Aug 24, 2018",
            "title": "",
            "comment_content": "Basically is the foundation of design. From airship history to basic airship underlying principles, from how to design the airship to building a real airship.<br />In this course, we can learn most of the foundation of an airship, which includes different engineering fields. <br /><br />Course contents include:<br />1. Analyze and describe the design of DC and logic circuits as used in the operation of a microcontroller, and create programs in Java for use on Android devices with increasing complexity and for use in the class project<br />2.Describe, calculate, and quantify the action of forces and other physical quantities on systems similar that used in the class project<br />3.Apply an engineering design approach to: generate ideas, model, analyze, predict and build an innovative object of engineering interest taking into consideration both societal and economic impact<br />4.Communicate effectively with others orally, in writing and by use of sketches/drawings",
            "comment_teaching": "very good teaching environment. Student teaching assistants are helpful and they help a lot. Profs. able to let us know the importance of different parts of the airship. especial Prof. SONG, Shenghui, he taught very well in the electronics part.",
            "comment_grading": "This course has no mid term exam or final exam.<br /><br />Only have daily projects and quiz.<br />There is a competition before the final exam period, that count heavily on the grading.<br />Not 100% get an A if you win the competition, but most likely",
            "comment_workload": "each week have some type of homework / mini project/sth like that<br /><br />workload not very heavy, but if you prefer studying instead of making stuff yourself, this course may not suits you",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Rlv1dXwUjlj36i0Togp1X66BBej0BJip",
            "semester": "2016-17 Spring",
            "instructors": [],
            "is_author": false,
            "author": "LTtiffany",
            "date": "Aug 29, 2017",
            "title": "easy to study if you are assigned good teammates",
            "comment_content": "build a airship with all 5 teammates <br />learn basic knowledge about programming",
            "comment_teaching": "i did not pay lots attention to the class, its quite boring",
            "comment_grading": "overall I got B+ <br />it is good grade for a non-engine student studying engine course.<br />mostly, if you do not freeride, have a good communication with your teammate, you can gain a not bad result.",
            "comment_workload": "easy to handle if you have good teammates, a pop-up quiz which is difficult but only spare about a small percentage<br /><br />build airship for a competition which spare much of the percentage of the grade<br />and present your airship",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cIrbnN1kncdOBl29O8sirv008K3bDmKv",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "YukiLee",
            "date": "Jun 19, 2017",
            "title": "",
            "comment_content": "用氣球和propellers和其他簡單材料做出airship，用auduino控制底版，寫個很簡單的手機app操控airship。",
            "comment_teaching": "有幾堂lab教如何寫app和auduino程式，但對於對程式完全沒接觸的人有點困難，大多都是由engine/cs的同學完成。後期幾乎全是自由時間，學到的東西不多，成品也是中學生就能做出來的東西。",
            "comment_grading": "grade不錯，不是freeride被組員evaluation批評的話最低都有b range，比賽中拿到第一名就A+了。我是尾4名最後也有B。不過這個比賽很看運氣，個人覺得不太公平，同一樣的比賽試兩次結果可以差很遠，然而比賽就一次機會，所以剛好表現差的話就注定B RANGE了。",
            "comment_workload": "偏大，經常要交設圖，reflection之類的，也有quiz，不過都是零零碎碎的東西，難度不高，只是量有點多。<br />最大的workload是做好成品後要拍影片，花了很多時間。不過沒有midterm exam。",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gbmNk8K2wwhBWfpeWrlRh3cNiKaDQPxo",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "NKY",
            "date": "Feb 02, 2017",
            "title": "ENGG 1200",
            "comment_content": "The course divides all students into around 5 people per group. At the first few lessons, students will be taught some programming and can try out the circuit boards and motors. After the first half of the course, groups will start building their own airships. There will be a final competition at the end of the course by completing the assigned tasks.",
            "comment_teaching": "There is little teaching involved in the course. When you face difficulties, asking STAs for help would be very helpful.",
            "comment_grading": "The grading is not bad. My team got a satisfactory ranking in the final competition, however some teammates got A range while some got B range for their final grade. So I guess don't skip or ignore the little assignments in the middle of the course.",
            "comment_workload": "The workload of the first half of the course is light. Tasks are mainly done in lessons and there are very few assignments only. <br /><br />In the second half of the course when teams start building airships, workload would be heavier as it takes much time to build an airship, and most of the times, groups will build a second airship with improved design.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EvUCwR7yDHqg3fAUmOMotIJXv4KnADDp",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "bellamy",
            "date": "Jan 22, 2017",
            "title": "",
            "comment_content": "Fun and interesting. Most of time",
            "comment_teaching": "50 % programming<br /><br />its east to understand. and you can design your own program to control the airship<br /><br />Its quite interesting to build an airship but it will take a long time to build (30-60 hours)",
            "comment_grading": "It's quite unfair for some students who aren't good at report :(<br /><br /><br />Its quite interesting to build an airship but it will take a long time to build (30-60 hours)",
            "comment_workload": "Every teammate have to upload same assignments which we finish together. But the workload is adequate<br /><br />Its quite interesting to build an airship but it will take a long time to build (30-60 hours)",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xxRDQr5KrCxTCICLDc3fEMuVZFbUn6sA",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Argen",
            "date": "Dec 19, 2016",
            "title": "A funny course with varying workload",
            "comment_content": "In the first 6~7 weeks there were lectures about basic functions and ideas of airship, programming skills and electroic setting.<br />In the latter half of the semester, the teams(4-5 students) started to build the physical body of airship, write program to control the airship, write mobile apps for the interface and do documentation works.<br />Sometimes, there were competitions to test your airships.",
            "comment_teaching": "Sometimes the speaker was STA and sometimes it was engineering professor.<br />Background knowledge was expected. They didn't go through too much in certain criteria (especially programming). You have to spend more time on them if you are not familiar with them and want to do well.",
            "comment_grading": "Drawings 6%<br />Labs 6%<br />Presentation and demo 30%<br />peer evaluation and reflection 10%<br />project logs 3%<br />First build 15%<br />Final competition 30%<br /><br />The final competition carries a large percentage of your score, but do not underestimate the effect of individual works and labs.<br />Teammates in the same team could get a different GRADE(not subgrade)<br />Rank 1~3&nbsp;&nbsp;basically would be A range<br />My team ranked at 8th, I could still get an A- but some of my teammates got B-<br />My friend's team was the last one but he still got B.",
            "comment_workload": "The workload actually depends on your teammate.<br />I had a pretty high workload because our airship had been redone three times. But it could be light and easy if you did a good design in the first time.<br />Sometime documentation work could be time consuming as well, I have submitted a 1400-words reflection form and a 3-minute video with vocal recording which really took me a lot of time.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2W7jQuNj5PFK0usnHLvOn9OTvcP0S5pg",
            "semester": "2014-15 Spring",
            "instructors": [],
            "is_author": false,
            "author": "CFJ",
            "date": "Aug 21, 2016",
            "title": "Fun &amp; Good Grade!!!",
            "comment_content": "You can learn how to design, control, and build an airship.<br />This course is project-based. Around 4 students in a group to build an airship.<br />Design: Mechanical engineering things... balance forces...<br />Contorl: CSE ECE stuffs... connect motors/ write simple programme (nearly all copy from notes...)<br />Build: not difficult at all, just use tap and hot glue... XD",
            "comment_teaching": "Different Prof.s from different department will teach different lecture related to their major. Such as Prof. SONG teach about ECE stuff. Quite useful. Also, some of the classes were taught by STAs<br />As Prof are just &quot;part-time&quot; for this course, so if you have any problem, can only always find STAs ... STAs are nice and helpful, but they are not always in the Lab...",
            "comment_grading": "Grading is very very very simple.<br />no exam (neither mid-term nor final...) Great!!!<br />just 2 simple in class quiz through the semester.<br />Just try your best to win the final competition, then an A-Range is waiting for you... <br />Mean of the grade should be around B...",
            "comment_workload": "Most of workload is before the competition. to build the airship, and buy those construction materials... If most of your teammates are not &quot;Free rider&quot;, should be totally okay...<br />Assignments are very simple, such as uploading photos of airship design/ video of test flight/ material list...",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uGrofXcAE33BvfxaiNzE89kWfqxg68jT",
            "semester": "2015-16 Spring",
            "instructors": [],
            "is_author": false,
            "author": "CBA",
            "date": "Aug 08, 2016",
            "title": "Great Course",
            "comment_content": "3 Parts<br /><br />1. MECH<br />Basic principles but not very useful<br /><br />2. ECE <br />Arduino and connecting wires, motors, receivers etc.<br /><br />3. CSE <br />Writing up the Android App. ( for controlling the airship)",
            "comment_teaching": "You need&nbsp;&nbsp;preparation before coming the lecture.<br /><br />The lecture is quite relaxing because the instructors is basically repeating what's written on the Ppt.<br /><br />But the lab can be challenging because it requires you to submit your work within a day. <br /><br />The STAs are nice. They will answer your question in detail and give suggestions.",
            "comment_grading": "The mean grade for the course is B range (what it seems to me)<br /><br />I got most of the assignments full mark.<br />1st Demo - nearly full mark<br />FINAL - ranked TOP 3 or 4 <br />---------------------------------------<br />My final grade is A+, as well as most of the other teammates (except a free-rider)<br />---------------------------------------<br />1st Demo and Final competition is very important!!!",
            "comment_workload": "LIGHT workload. But you need to prepare for the LAB beforehand. Otherwise you will be getting lost during lesson. <br /><br />Good group-mates are very important in this course.<br /><br />This course depends heavily on team work and ONE person cannot handle the project. <br /><br />Overall, the course are great and worthy of taking!",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hW8FyTTdvBwwf9Jfr6YhHTbPBfDse3Mj",
            "semester": "2015-16 Spring",
            "instructors": [],
            "is_author": false,
            "author": "trolololo",
            "date": "Aug 04, 2016",
            "title": "",
            "comment_content": "They would first teach you knowledge from Mech, ECE and CSE and then you would need to use what you had learned in these 3 technical area to build an Airship. <br /><br />For ECE, they teach you Aurdino<br />For Mech, they would give you knowledge about what Airship is.<br />For CSE, they would teach you Android Studio, so you could use your Android phone to control your airship.",
            "comment_teaching": "They have different proffessor for different technical area and each group would be assign to different STA. So if you have any question, you could always seek help from STA.",
            "comment_grading": "(6% final grade; 2% each drawing)<br />1st Drawing—Individual<br />2nd Drawing—Group<br />Final Drawing—Group<br /><br />Meeting Logs<br />(3% of final grade)—Group<br /><br />Lab Activities <br />(6% of final grade; 2% each lab)— Group<br /><br />Peer Evaluations &amp; Teamwork Reflections <br />1st (5% of final grade)—Indiv<br />2nd (5% of final grade) Indiv<br /><br />First Build demo- 15%<br /><br />Presentation- 20%<br /><br />Final Demo- 40%",
            "comment_workload": "There isn't a lot of work for you to do in the beginning and all the works they gave you ain't that hard. The drawing doesn't have to be really beautiful as long as you have the correct dimensions. As for your first demo and final demo grade. It really depends on how much effort you put in both building and familiarising the airship. I personally think that familiarizing your airship is the most important thing. So I would spend time practicing controlling my airship rather than changing the structure of it.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6E6PxyCp9o2wAHE2bAhnocRNU5FXcWtl",
            "semester": "2014-15 Spring",
            "instructors": [],
            "is_author": false,
            "author": "whatever",
            "date": "Jan 30, 2016",
            "title": "",
            "comment_content": "Course objective: build an airship and win the competition. Requires more hands on practical skills, not suitable for those who likes to free ride and skip classes.",
            "comment_teaching": "They invite professors from the MECH, CPEG and COMP department to give brief lecturs about how an airship work, and programming stuff.<br /><br />The whole course is supported by STAs. I feel like the STAs are more helpful than the professors, since they're there to help you with programming, building and just to make the three hour class more joyful and fun.",
            "comment_grading": "The grading is ok i guess, the mean grade would be&nbsp;&nbsp;B, but that was before this course got turned into a common core. Grading is based on peer evaluation, assignments and the final competition.<br /><br />There's no finals nor midterms, only a few in class quizzes thats every easy if you did all the labs.<br />Grading is also kinda proportional to the final competition outcome. If your team get a third place or above you'll probably land an A range grade, provide that you don't free ride your teammates.<br /><br />Oh, and attendance is very important, can't skip.",
            "comment_workload": "There again i took this course before they changed it into a common core, so i'm not sure if they added extra assignments and quizzes. <br /><br />Overall the workload is not high, and it does depends on your group mates knowledge on computer programming, creating skills and any skills needed to build an airship. I'll say the hardest part of building an airship was the programming part, cause you need write controlling program. Therefore, it would be awesome if your team consist of someone who has background knowledge in programming (especially Arduino).<br /><br />STA's extremely helpful. So you could ask them for help anytime.<br /><br />Ps. The workload really varies a lot depending on who your group mates are.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NxKUSAtHXjms93aUERKnMXml8EswXMcx",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                },
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "PH",
            "date": "May 17, 2022",
            "title": "Design Thinking Course Utilizing 3D Modeling",
            "comment_content": "This is a course that haven't been offered for a long time but just got &quot;revived&quot; this semester. As context, this is supposed to be a common core course and one of the old required course for Design Minor for Design Contest Experience. Hence, technical background should not be a pre-requisite for students.<br /><br />The course content is divided into theory and hands-on. <br /><br />The former focuses on Design thinking, Creativity and the Ideation process which is delivered by Professor Ben Chan, Dr. Paul Lavigne and Dr. Sandy Geng. Although this involved a lot of theoretical knowledge, Professor Ben Chan is able to delivered the course content in a fun and engaging way by means of Breakout Room Discussion &amp; Brainstorming session, Competition Based Activities like innovative poster design. Overall his teaching is definitely a highlight of the course.<br /><br />The hands-on portion is focusing on 3D modeling with Blender by Lan Chong. <br /><br />The Final presentation is Redesigned Toy business pitch with the aid of a 3D Model of that toy. From the voting result, it can be observed that originality and authentic design is not appreciated but direct copy of existing toy with minimal addition like LED lights, different material, VR integration.",
            "comment_teaching": "The part about creativity is a nice addition to the course and demonstration of delivering a rather bland topic in a engaging way. It is easily seen that Professor Ben Chan spend a lot of time optimizing the learning experience. <br /><br />The Blender 3D modeling tutorial pales a whole lot in comparison. In terms of teaching, this part delivers a lot of empty promises. Firstly, in the first lesson, it is stated that addition Blender self study content will be offered on Canvas which never appears except a paragraph on how to install Blender. Also, no comments is offered after we submit our Blender assignment which is mentioned in the second lecture. Last but not least, only 5 Blender assignments were created while 10 is stated in the syllabus and grading system. <br /><br />The in class Blender session delivered some misconceptions on 3D modeling which is problematic for beginners. This include not clearly defining the differences between joint operation and boolean operation which is a cornerstone in 3D modeling and transformation.<br /><br />Despite the mishaps in Blender, the interesting sessions about creativity by Professor Chan pretty much makes up for the mediocre Blender tutorials.",
            "comment_grading": "The session about grading the creativity and design thinking processes is well documented and explained. Professor Chan offered a very good way for us to check on our progress in developing our creativity.<br /><br />However, the taught content for Blender is straight-up insufficient to fulfil the requirements for our 3D model project. They demand photo-realistic modelling work while only Grab, Rotate, Scale, Snap, Bevel and Subdivide is taught without mentioning a single thing about sculpting, which is a more organic way for form-giving and 3D modelling. They ask for photo-realistic texturing, but only tile image texturing is taught without mentioning procedural or PBR shading. They required proper lighting, but the tutorials only go through the definition of point light and sunlight without talking about photorealistic environmental and uni-directional lighting. It's clear that Professor Ben Chan is knowledgeable in that area, but lan Chong omitted those important areas. They demanded attractive renders for pitching the toy but fundamental artistic concepts like Color Theory, Scene Composition, Positive &amp; Negative Spaces, Form analysis are not even mentioned by name. The most ironic thing is although lan keeps mentioning photocell modeling, no concrete example is ever shown in the form model or renders from the teaching team.<br /><br />I would say exchanging 3D modelling with Professor Chan for a few minutes is much more fruitful than the Blender Tutorial sessions.<br /><br />The grade for all the assignments is not released but my final grade is A+.",
            "comment_workload": "Acceptable, unless you have a freerider or 2 in your team. Professor Chan is very eager to help you in case there is a freerider situation.<br /><br />Our team didn't spend anytime for the project aside from the 3 hours of lecture every week. So I will say the workload is the lightest I have ever experience in UST.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RoCQ9p0dWv3zDW5R2aNMCMAPiajIUjwk",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 86,
                    "name": "CHAN, Yui Bun",
                    "rating": 1
                },
                {
                    "id": 1071,
                    "name": "LAVIGNE, Paul David",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Dicaprio",
            "date": "May 05, 2022",
            "title": "Full Online Semester so no airship :(",
            "comment_content": "nice common core course overall. :-)<br /><br />due to covid, the whole semester is online and no face to face lectures are allowed. So, it changed into teaching Creativity and Blender ( a 3D modeling software)<br /><br />We have a 3 hour lecture once a week. <br />In the first few weeks, 2 hours of lecture about creativity using miro board. some occasional interactive tasks that are quite fun but mostly are boring, uncreative powerpoint-like slides that talk about creativity. then, we will have 1 hour of Blender tutorial. He continues on the things taught a week ago so you must listen and attend every lecture in order to follow through. Some (un-graded?) Blender checkpoints assignments due immediately after the tutorial to see if you are attending/ following or not.<br /><br />In the last few weeks, we work on a group project to redesign a toy for kids nowadays. 6 people in one group. Some teammate need to build the 3D model of the redesigned toy using Blender. An online roadshow using miro board and a 10 minutes presentation per team of your toy in the last lecture.",
            "comment_teaching": "The creativity part is taught using Miro board but instructor GENG, Ping (I can't find her in the instructor list above) made it like powerpoint slides so it is boring. Professor Chan also taught something about creativity in the first two lectures and he taught better than instructor GENG, Ping.<br /><br />The Blender part is taught by instructor CHONG, Ian. He is a great teacher so every team's Blender model/animation in the end are surprisingly amazing. (Team 6 literally build the entire roadshow booth using Blender)",
            "comment_grading": "not sure yet, I just finished the roadshow.",
            "comment_workload": "the workload is light in the first few weeks. you just need to attend lecture and follow what they do on Miro board / Blender. Nothing else to do after the lecture.<br /><br />The Group Project in the last few weeks is a little rushed and the workload is a bit big. My teammates and I need to have another additional 3 hr Zoom meeting every week to discuss the ideas. Then, another many hours working on the Blender model, Blender animation, Presentation Slides, Roadshow board, Roadshow poster, etc. (our group don't have free riders but it seems that other group have)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XUPjlGTz2IEibAP0TFQCyr1jgyNpyZ8w",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Dipsy",
            "date": "Aug 18, 2017",
            "title": "",
            "comment_content": "玩arduino 同app inventor<br />根本就係俾小學生玩<br />如果咁都唔識玩真係要反省下<br /><br />其實個course的重點在於你同你個團隊識唔識溝通",
            "comment_teaching": "基本上MECH ECE CS都有教，但集中於CS，考驗的能力都集中在CS，以及隊伍之中的協調能力",
            "comment_grading": "靚GRADE，得個比賽<br /><br />如果你有交齊功課，同隊員的關係又好，應該不難A range<br /><br />利申比賽第四名A+",
            "comment_workload": "有少量不需用腦的功課",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}