{
    "error": false,
    "course": {
        "id": 2435,
        "subject": "ENTR",
        "code": "1001",
        "name": "Entrepreneurship 1001: Building Your Own Future",
        "description": "This course introduces various elements of starting an entrepreneurial journey, including team building, crowd sourcing, use of social media, etc. Based on an experiential learning model, there will be sharing from industry representatives in class while students will also have opportunities to gain authentic experiences in different industries and reaching out to network of co-working spaces. This course does not require students to have previous entrepreneurial experience or any form of business training.",
        "categories": [
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1810,
            1730
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.04,
        "rating_teaching": 3.74,
        "rating_grading": 4,
        "rating_workload": 2.39,
        "review_count": 23,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 893,
                "name": "HUANG, Erwin",
                "count": 19
            },
            {
                "id": 18,
                "name": "LING, Carrie Hang-yin",
                "count": 3
            },
            {
                "id": 1245,
                "name": "LING, Carrie",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "CCIKKQxInMTWvmxDlqymfUQNwYbkxvTy",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Leon Donut",
            "date": "Jan 23, 2021",
            "title": "Let this be the last entrepreneurship class you take",
            "comment_content": "The class is composed of having one group-work/project-instruction session and one guest speaker lecture per week. Group work session is lowkey confusing sometimes because there are so many tasks with tight deadlines that it gets quite the overwhelming - especially if you are working along with groupmates that don't really give a damn. From what I have seen, most groups have at least one or two free riders, and it is usually one or two people carrying the team. So if you are going to enroll in this course, just convert to a religion and start praying. As for the weekly guest speaker lecture, people started the semester actually listening; but just after a couple of weeks, people don't even pretend to care. You can literally see that some people are working on other courses. So yeah, the content is basically a project with approximately nine thousand smaller projects/assignments that revolve around Design Thinking.",
            "comment_teaching": "Teaching? No offense but I don't think I have learned much from this course. Yes, the model of Design Thinking does provide a pretty good framework that is applicable to many things, but most of the matter discussed is pretty much common sense. If I had to compare, I would say that the guest speakers were better at teaching than the teaching team because they told us about their failures and successes as entrepreneurs; for students who bothered to listen, there might a thing or two that they could pick up on if they chose to be entrepreneurs one day.",
            "comment_grading": "Lads, the grading is quite the wacked. I'd say that most of the students taking this course are Year One, so there is a chance where you have to compete with Year Three and Year Four who actually already are real-life entrepreneurs. Without a clear guideline as to how the letter grades are given, there isn't too much I can say about this; however, I would say that amount of effort and grades are slightly correlated. Also, something that I observed in other groups - this course does NOT take free-riders into account when it comes to grading. While they do implement the peer evaluation grading system, it affects the final grades to a negligible degree, meaning that you would get the same grades as your free rider groupmates.",
            "comment_workload": "Death. I sold my soul to this course. I remember that the first thing I did after coming out of quarantine in HK was to meet up with my groupmate to work on a software prototype. No exaggeration, I have spent more time on this course than all of my other courses combined. So be ready to sacrifice your soul or just pray that you have groupmates who can carry you.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZtBToVyUN5vIBHeNPcdwdRw2vjSaPGpk",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "風田",
            "date": "Dec 17, 2020",
            "title": "New Normal : below mean",
            "comment_content": "The content is diversified. You will learn how to build a prototype, the business models, conversion funnels etc. The breakdown of the whole course is below...<br /><br />The brief schedule (excluding speaker section every week)<br />Week 1 DesignThinkingChallenge<br />Week 2 Empathy<br />Week 3 Business model<br />Week 4 Businessfunnel &amp; AB testing<br />Week 5 Midterm presentation<br />Week 6 Virtual Tour<br />Week 7 Software Prototyping<br />Week 8 Content Marketing<br />Week 9 Pitching<br />Week 10 EntrepreneurialTech<br />Week 11 Finale<br />Week 12 Final Guidance <br />Week 13 Final presentation <br /><br />P.S. Every week they will also invite a speaker to do sharing of their entrepreneurship. It could be founders of an online shopping platform or even Goop. <br /><br />Overall, you do learn many things but the schedule is super duper packed. If you make something wrong at the start you can easily mess up the later part due to the &quot;unstable definition of your business&quot;.",
            "comment_teaching": "The teaching varies a lot. I believe most of them have&nbsp;&nbsp;&quot;heart&quot; to teach but they sometimes can be vague and confusing. When it comes to the parts that count marks, they often fail to give clear guidelines on how they will grade your work. You always have to make a wild guess on what they're looking for and that's inconceivably hard. Moreover, they spent too much time talking about something plain which even a &quot;3 yr old could understand&quot;.<br /><br />In most time you need to take a while for the TA to answer your questions. Most of them respond to you in a short time except few. In my opinion, the attitude of certain TA has room to improve.<br /><br />In this semester, the instructors highly emphasize on the topic new normal and it was kinda disturbing. I mean I got that they want us to realize that you should keep on with the market and change your business. However, it was over the top <br /><br />On the good side, I liked the sharing sessions, they did give me some insights on the whole picture of entrepreneurship. Also , instructors like Erwin is experienced and knowledgable. I do admire these things.",
            "comment_grading": "The grading is probably something one of the top 10 mysteries in UST. Me and my groupmates worked really hard and we believed that we are better than most. However, basically every time we performed as hard as we could, we just ended up getting below mean like wdfaq. If you want to have good grades in cc courses just don't enrol in this course!<br /><br />In addition, the grading is arbitrary. They always give extra marks when they want to but they never tell you the reason for it. The lack of standards is kinda ridiculous. In some cases, they give scores like 4/3 :?<br /><br />They also take a long time to publish the scores. Until the end of semester , the scores were still not out.",
            "comment_workload": "The workload is undoubtedly high. Every week you get a task to work on which require discussion with your team. As for me ,I can say this single course took up 1/3 of my time this semester and the workload is equal to 2 or 3 courses.<br /><br />You can see the number of assessments from the below.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "VLAacHUPQorNwAGtztnlCZdVHlI4NB3E",
                    "name": "ENTR 1001 Course Outline F20-21 (Final)",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "OiWZlXHToxMJGdVtQ9qLSdtgQGdWFkjy",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Nosliw",
            "date": "Aug 02, 2022",
            "title": "Hard but fair",
            "comment_content": "You will get a lot of insights into a entrepreneurial life. and will see a lot of models you can work with. Only recommended for people who is really interested in founding.",
            "comment_teaching": "The professor was quite funny and his teaching methods are really reasonable and clear structured.",
            "comment_grading": "The grading was actually quite good, could be better. The Staff and students accept, were quite good and I had a funny group.",
            "comment_workload": "A high workload compared to other UST courses but still fair and reasonable. If you want to be an entrepreneur you have to work like one.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LzC9FNqCUgg8BAqGtgoBYPywtnaWwSFn",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yuqi",
            "date": "Jan 25, 2022",
            "title": "",
            "comment_content": "This course is very interesting as you will form a group of 6 to setup and operate a business on your own. The professor and TAs will provide you the knowledge you need you need to know to understand a business and sharing from the successful entrepreneurs(guests) to help you to develop your business well.<br /><br />2 sessions per week, first session is teaching the relative business models and knowledge you need to set up the business. Second session would normally be the sharing from the entrepreneurs.",
            "comment_teaching": "The professor and TAs are all very nice. They are very passionate to the class and trying their best to make the course interesting and helpful. The teachings are mostly relate to the slide that they prospered really well. They will have some activities to let us to participate in the class. The sharing sessions every week are very helpful which you can really get lots of ideas from their sharing.",
            "comment_grading": "As I can not really remember the percentage of each component, there will be a lot of tasks as a group include the mid-term and final(presentation) and quite a lot of mini tasks on your own. The attendance are also take in account in the final grade.<br /><br />The grading are quite good, as our had not done will in the mid-term ( a little below mean) and I had forget of 2-3 mini tasks on my own. And other tasks are all around 1 sd higher than mean. I got a B+.",
            "comment_workload": "The workload is quite big as you need to operate a business with 1 reflection(as a person) and 1 task(as a group) to do.And also you need really to spend quite a lot of time of maintaining your shop, like doing deliveries, creating posts on IG or FACEBOOK, develop your products and making transactions. There are a lot of task you need to do during the course. But, it will be fine if you have a good teammates which you guys can work well together and share the work well.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "p8CFKmfeCiUnX9uH7vXdM0yeSGqYdYRw",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "iloveis",
            "date": "Jan 30, 2019",
            "title": "Finding a good team is the key to success in this course",
            "comment_content": "Basically teaches you about stories and concepts related to entrepreneurship. Various marketing and design concepts will be taught during the semester. You need to form your group at the beginning the course which will take up various roles in the later stage of the course. This includes running an online shop, developing marketing campaigns, designing a prototype for kickstarter,etc. The most interesting part of this course is the experience of going to Shenzhen for a whole day trip, during which we will pay visit to different startup bases such as headquarter of DJI. I found it so exciting.",
            "comment_teaching": "Teaching is acceptable. Many marketing concepts will be taught such as conversion funnel, etc. Many concepts are fragmented and it takes time for you to understand it. But this course doesn't require you to recite such concepts, so basically you just need to understand them and apply them in your presentation and project. Prof Erwin is passionate about what he was doing, you can have a chat with him about entrepreneurship and business and he should be experienced enough to provide you with some useful insights.",
            "comment_grading": "For the grading, it really depends on your team members. Some other group got free rider problem that someone didn't contribute at all. For our group, we have people coming from different countries and we put our focus on sustainability which the professor likes. So basically, there are a lots of tasks that will be graded during the semester, but they are pretty easy to complete them. Someone may say there are a lots of presentation for this course. Yes, indeed that was the case. But for our group, we didn't really spent a lot of time in preparing our team project in fact, we just did our part and prepared for an individual scripts for the presentation. You don't really need to do rehearsal for that. <br /><br />For our group, we scored mean for midterm project and highest in the final project. Final grade for me: -&gt; A-&nbsp;&nbsp;<br /><br />**Try to find a marketing major student in your team, it helps A LOT !",
            "comment_workload": "The workload is higher than average for a 3 credit course. There are a lot of small task you need to complete from a time to time basis. So every single week, you need to work on some tasks related to this course. But as long as you are passionate about your online shop and kickstarter, you will find it meaningful to devote your time into it.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5tGeiQikaxSN02os1OSHBn0Fjy2UTAZI",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "PP",
            "date": "Jul 05, 2018",
            "title": "Best course ever!",
            "comment_content": "The content is designed to allow the students to learn and experience the journey of entrepreneurship under the guidance of serial entrepreneur, Professor Huang. This is not like any other conventional common core courses. There is nothing to memorize or nothing that doesn't make sense. If you are passionate to do something for good or want to break through the conventional way of life, this is the course that can help you through.",
            "comment_teaching": "Professor Huang will teach you through experiences not conventional lectures and slides. Other experienced professionals and entrepreneurs will come to the class to share their experiences and you may get a chance to mingle with them and exchange ideas - which is totally beneficial to the students. Please just be open-minded to absorb all the great knowledge.",
            "comment_grading": "Grading is based on individual effort and performance. You cannot fake to the professor and TAs because they are very sharp and bright. If you are passionate in what you are doing, you will be recognized with A. If you are a free-rider, you will deserve C or D. The grading is very fair and square. After all, it's for your own learning path. So, please focus more on learning rather than grades.",
            "comment_workload": "Workload depends on the attitude of the individual and team. No body will give you tasks to do. As entrepreneurs, you have to design and assign the tasks to yourselves to move the project or business ahead. If you take this course just for 3 credits, you may choose not to do anything or learn anything and be a free-rider. Your workload would be pretty low, but you might have just wasted your time and opportunity. If you are proactive to learn, your workload will be heavy but you will enjoy it because you might even make some $$$ out of the project since it becomes your own real startup business.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NOvENQsKTwVNBO7grZi2GiWbu8RCsM6C",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Nikshay",
            "date": "Feb 10, 2023",
            "title": "",
            "comment_content": "There we multiple contents throughout the course with lots of group project",
            "comment_teaching": "Not much teaching, just need to individually work together as a group.",
            "comment_grading": "Grading seemed somewhat fair to unfair depending on the type of group you land into, as its based mostly on your group project and individual participation into group work.<br />Being a non-Chinese speaker, it was hard for me to communicate with my group which had led to not understand the work that I had to do which led me to get a C overall.",
            "comment_workload": "Workload isn't much as long as after every class you keep up with the required posts on canvas.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "b58a1ZiUp9Bs2mrH4MFjtPNhBSUiEfOa",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jasminedice",
            "date": "Jan 31, 2023",
            "title": "Good Grade but Workload is high",
            "comment_content": "Teach all the things about how to run a new business, like how to put ads in Facebook &amp; Instagram, AB Testing, the key element of an online shop e.g. logo, theme, target audience etc...",
            "comment_teaching": "Teacher provides a lot of useful advice to students, also really care about the students, always have consultation to give recommendations to our business.",
            "comment_grading": "Good grade but workload is a bit high and because our business is quite unique so professor like really much, it also depends on your business idea too!",
            "comment_workload": "If you really serious to run your own business, workload would be extremely high. Since you need to put a lot of effort into your online shop. You need to spend your extra time on that.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "U75yGai8tmNRCFdbhu3MXaWG8hThuh1Q",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 18,
                    "name": "LING, Carrie Hang-yin",
                    "rating": 1
                },
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                },
                {
                    "id": 1245,
                    "name": "LING, Carrie",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Doo",
            "date": "Aug 03, 2022",
            "title": "Fall",
            "comment_content": "I think the overall content is good. It covers many perspectives and tools",
            "comment_teaching": "If you really want to understand entrepreneurship, this is a good course for you to experience from scratch.",
            "comment_grading": "Good grading if you fulfil all the requirements<br /><br />1. Design Thinking Challenge (2%)<br />2. Business Canvas (2%)<br />3. Online Shop (10%) (three parts)<br />&nbsp;&nbsp;&nbsp;&nbsp;A. Shop set up (5%)<br />&nbsp;&nbsp;&nbsp;&nbsp;B. Content marketing (5%)<br />4. Mid‐term (15%) (four parts)<br />&nbsp;&nbsp;&nbsp;&nbsp;A. Presentation deck (5%)<br />&nbsp;&nbsp;&nbsp;&nbsp;B. Presentation (5%)<br />&nbsp;&nbsp;&nbsp;&nbsp;C. Personal takeaway (3%)<br />&nbsp;&nbsp;&nbsp;&nbsp;D. Peer evaluation (2%)<br />5. Prototyping &amp; Testing (13%)<br />&nbsp;&nbsp;&nbsp;&nbsp;i. Software prototype (3%)<br />&nbsp;&nbsp;&nbsp;&nbsp;ii. Hardware prototype (3%)<br />&nbsp;&nbsp;&nbsp;&nbsp;iii. Testing (4%)<br />&nbsp;&nbsp;&nbsp;&nbsp;iv. Prototype refinement (3%)<br />6. AB Testing (15%)<br />8. Final (18%) (three parts)<br />&nbsp;&nbsp;&nbsp;&nbsp;A. Kickstarter page (10%)<br />&nbsp;&nbsp;&nbsp;&nbsp;B.Presentation (5%)<br />&nbsp;&nbsp;&nbsp;&nbsp;C. Peer Evaluation (3%)<br />Individual Assignment<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I. Attendance (10%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;II. Empathy (3%)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;III. Reflection (3%)<br /><br />Personal Development Journal (6%) <br />300‐700 word personal development journal documenting your ENTR 1001 journey.",
            "comment_workload": "Heavy workload. You need to plan for the whole ENTR project with your group-mates.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FmikssVNjeNAOKKiw9xr9dkkwNeuqRgW",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "helloworldbbb",
            "date": "Apr 17, 2022",
            "title": "",
            "comment_content": "It teaches you many entrepreneurship stuffs, which is very useful if you want to develop your own business in your future.",
            "comment_teaching": "good teaching",
            "comment_grading": "the grade is good if you really do your best to finish this course. As long as you are not free rider in the group project, even that you are below mean for the midterm and final, you can get a good grade.",
            "comment_workload": "the workload is very heavy. There are many projects and a reflection per week. You need to spend lots of time if you take this course",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cYkpt2TZDDMY05uTo9Uucbasc3AvP8bJ",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "melodyloi1011",
            "date": "Feb 26, 2022",
            "title": "Good grade course",
            "comment_content": "During this course, you could set up an online shop with your teammates and listen to many sharing sections from different entrepreneurs. Me, a very traditional person with no entrepreneurial knowledge at all, could say that this course was very easy. No background knowledge or experience was needed and you just needed good teammates to set up an online shop with you.",
            "comment_teaching": "All things taught during lectures were concepts directly used on the shop that we set up. For example, competitors analysis was used to analyse what competitors we would face for our own shop and you would need to submit an assignment about that. Apart from concepts, useful tools and skills were taught, such as how to utilise Facebook ads. Those were extremely useful for the online shop. It really brought us customers.",
            "comment_grading": "Very good grading. Basically, submitting&nbsp;&nbsp;all assignments on time and writing more ideas could help secure your mark. I got A- at the end. It helped a lot to be honest. Final and mid term were just group presentations on your shop performance. Concepts taught during lessons were needed in the presentation though. Very easy but good teammates were needed.",
            "comment_workload": "The workload would be low if you had good teammates. You guys could divide your work and it would be easy to maintain the online shop. Also, you needed to write reflections every week on what you have learned during the sharing section. Very easy. But it’s hard to submit because you need to comment under a Facebook post and submit your comment link. You can’t&nbsp;&nbsp;do it on your phone. Lol.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MlwejPEIcy7jpHUe8sASPyacOPcQrVQc",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "stayingalive",
            "date": "Jan 27, 2022",
            "title": "Enthusiasm is key",
            "comment_content": "A lot of people already covered the content so I'm not going to talk about it too much. I realised the first impression you give is very important because they judge your group very quickly based on it. We went to this workshop which gives you extra credits, and there were a lot of interactions between us and the instructors, the entire time we were being enthusiastic and acted just generally happy to be there. It is also very important to show your passion and creativity and how willing you are to solve problems during the consulting sessions you have with your assigned TA. Also, when you brainstorm your business ideas you can be as crazy as you want (to impress of course but also has to be attainable), but at the end make sure to choose something as simple as possible, by that I mean simple and clear audience with a clear goal, easy distribution channel and easy product source. Good luck!!",
            "comment_teaching": "The speaker sessions were fine. Though I found the Q&amp;As the most useful because you will be receiving answers that you actually want from them and not just them telling you things.",
            "comment_grading": "I got an ok grade at the end, and I do think it corresponds to the amount of attention I have given to the course.",
            "comment_workload": "I learnt a little bit about entrepreneurship prior to this course so I kind of expected what topics they were going to cover and the work they would want us to do.&nbsp;&nbsp;Its very important to find good groupmates so beware of the session where you start choosing groupmates based on their profiles. It's better to find ones who has experience in entrepreneurship and someone with a &quot;sunny&quot; and &quot;open&quot; personality (this is often seen in their pictures hehe) since communication is key when everything is done online.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dG76Ki6BWG1VMFuimGmmcXiwCZ6WNC6J",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KenChoi",
            "date": "Jan 08, 2022",
            "title": "A rewarding course with very high workload",
            "comment_content": "The content is quite rich for introductory entrepreneurship, it has successful guest speakers from different industries to give talks about their entrepreneurial experiences, it also has design thinking, projects that involves FOR REAL starting a online business to sell things online in social media &amp; starting a crowdsourcing campaign.",
            "comment_teaching": "The teaching team, the instructor, and the many guest speakers are really passionate into bringing an entrepreneurial mindset to students, which I really appreciate, the guest speakers are really seasoned and brings insight to our learning journey, while some of the TAs are really great at delivering information we need to know in the entrepreneurial journey and leading in the classes.",
            "comment_grading": "grading is quite fair and the harder you work and the better grade you will get. other reviews have already covered the grading schemes.",
            "comment_workload": "workload is really really high, unreasonably high if you are comparing this practical and experiential course with the average&nbsp;&nbsp;one-way delivery academic courses. But fairly speaking, for a course that can give you a taste of what being a real entrepreneur is like, this is not even close to a high workload. So if you are not interested in entrepreneurship or don't consider entrepreneurship as your future career path, please Do NOT take this course and hurt yourselves as this course is nothing like the average academic courses.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5Xpg89D222jC60K795x0gq1rf10Y6s2W",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "wondood",
            "date": "Jan 05, 2022",
            "title": "Good people with terrible teaching",
            "comment_content": "See the course outline attached.<br /><br />Basically is a course that teaches you how to do business and let you practise what you learn by operating a real online business. Taught with zoom along with (international) students from other universities like LU, SUTD etc. <br /><br />Group consists of 5-6 ppl with at least one LU student, one international student (from int'l uni), in different majors and school years. Funny that it lets you form your own group but turns out to change your grouping after you have formed your own. You guys have to work together to operate an online business that creates &quot;value&quot; (the key is &quot;value&quot; as they like your business if it brings value). 55% of the grade is team assignment so having a gd group is important. The most important assessments are two group presentations (one mid and one final) and an individual personal development journal.",
            "comment_teaching": "The professor of this course act as a &quot;lecturer&quot; or &quot;speaker&quot; only I would say. TAs do most of the teaching and grading with one TA responsible for some topics so you have to look for the right TA for the topic you want to ask. <br /><br />The teaching staff is nice but generally &quot;hea&quot;. Zoom recordings and lecture notes were posted very very late, so don't expect you could rely on the recordings or lecture notes to do the assignment as it will be too late when you found the lecture content lol. <br /><br />Also, they didn't really reply to your email. I wrote many emails and it is really just luck whether or not they reply to you. I once write them an email regarding an assignment and they replied after the assignment was due...<br /><br />They couldn't really solve problems tbh. One of the major problems most of the groups encountered when doing the project is that the Facebook pages got banned. Don't expect you could seek help from the teaching team as all they could answer is that &quot;This is the reality&quot;. So save your energy and google on your own.<br /><br />Also it is really frustrating that the assignment details were announced very close to the due date (4-5 days before due). You didn't get to know what you need to prepare for the midterm present until 5 days before your presentation. And you don't get to receive rubrics for some assignments.",
            "comment_grading": "I got the highest mark for most of the assignments with the rest above mean. Manage to get A-. Couldn't say it is a bad grading but definitely could have gotten a better grade in other courses with the same amount of effort I put in this one.<br /><br />One thing to note is that they keep changing grading and due dates which is very unfriendly for people who like to plan ahead.",
            "comment_workload": "Huge.<br /><br />Can't list how many assignments are there as it was just too many. Each of them counts around 5% only but required you to write a lot and really put effort into it.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "NVoOFkJbMRMYbHRu4PAX3tIeXcUaZFZH",
                    "name": "ENTR 1001 Course Outline_Fall 2021-2022",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "gGKxViwnIKpJoimLcYpgBX8a3SXZFEfE",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hillel",
            "date": "Sep 02, 2021",
            "title": "Fun course but lots of workload",
            "comment_content": "Stuff related to starting up a company, like:<br />DesignThinkingChallenge<br />Business model<br />Business funnel &amp; AB testing<br />Prototyping<br />Content Marketing<br />Not really practical but some content is quite inspiring",
            "comment_teaching": "Fun TA and Professor. The class atmosphere is good. Lots of discussion and class activity. Most of the TA have passions for teaching.",
            "comment_grading": "Nice grade. Missing one assignment and not too good in last group project. B+ finally. The first group project which is starting an online shop takes up a high portion of weighting.",
            "comment_workload": "Lots of workloads and after-class activities. 2 projects in total. 3 presentations about the projects.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xOvJmFNrUe1WfCuSx1fMEvKjQJhRff3Y",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jhgrt",
            "date": "Aug 31, 2021",
            "title": "",
            "comment_content": "The content is mainly about training one's design thinking skills. You'll get to form a group of 3 UST students and 2 students from another university and come up with a start-up idea. If you personally were interested in a start-up or had an excellent idea for a start-up and you would like to try it out, you would probably want to take this course.",
            "comment_teaching": "There will be sharings by entrepreneurs and you will get to ask them questions. It was quite nice to mingle with them if you take the initiative to do so.",
            "comment_grading": "The grade is based on your personal effort and project performance. Do well in the mid-term presentation! It counts a lot. It will also be graded in accordance with your attendance, assignment and peer evaluation.",
            "comment_workload": "The workload will be super heavy if you ever encounter free-riders. One tip for you would be to find some partners/ friends with you before joining the class. Your workload might be a bit less if you have already found some trustworthy teammates. Also, avoid completing the tasks near the deadline.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VGug3k40N0D6z3Cwiq7nlUr7J0cjWwKC",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                },
                {
                    "id": 18,
                    "name": "LING, Carrie Hang-yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LuckyTiger",
            "date": "Jan 29, 2021",
            "title": "Cool concept, confusing execution",
            "comment_content": "PROS: Content in terms of just lectures is solid. I think they kept me genuinely interested each lesson. Friday talks were filled with admirable guest entrepreneurs, like the founders of GOOP. There were times where I was listening hard, not because I had to write a reflection, but because listening to the talks gave me more perspective on my life. <br /><br />CONS: <br />The content in terms of assignments and intended course outcomes is quite confusing. My basic understanding of the goals of this course are two things now from experience. (bracketed is not a must)<br />1) Set up an online shop to sell something (and make profit)<br />2) Set up a Kickstarter page (to gain funds) for an innovative idea. <br /><br />According to one of the teaching staff, we need two distinct and developed ideas, one for online shop: idea to buy low sell high a product and one for Kickstarter: innovative idea, something new to the world. <br />But if you look at the assignments it seems like there's one straight goal of finishing the design thinking diamond (Empathy, Define, Ideate, Prototype, Test). They don't clarify which smaller assignments help which of the bigger tasks.<br /><br />The asssignments on their own are appropiate and interesting to teach us the two goals, yet the homework timing seems a lil bit strange for me. Overall I learned a lot in this course.",
            "comment_teaching": "PROS: Aki Leung was an enthusiastic figure. She put on chill lo-fi beats before class. Whenever she gave presentations, they were well-designed and made for interaction. Maybe sometimes, her wordings were bit vague.<br /><br />Erwin is also nice and nearing the end, he showed us the intended learning pattern and it showed how much they prepared. <br />He is pretty talkative, keeps the awkwardness very low and connects with guests.<br /><br />Apart from Erwin and Aki, you have the guest speakers who give fruitful knowledge, Carrie for hardware prototype teacher and a software prototype teacher. They were all ok sometimes boring though ngl.<br /><br />When we needed specific clarifications on assignments or clearer instructions, we could simply ask 10 mins before or after the class. They were very willing to help us. <br /><br />CONS:<br />The only problem I would have, is with one of the LU teachers. I thought it was unnecessary to give me a short lesson about meeting deadlines of my boss in a supposed company I would be working for in the future, especially in an ENTR course where it's about creating your own company or something. We weren't even behind on assignments but he was simply trying to speed us up.<br /><br />One more bad thing is that during both the mid term and final exam, they are really obvious about which groups they like and don't like. It's like some of the groups actually had solid plans and ideas in the finals, but they still got like questionable responses. If they like you, they are smiling and immediately are curious and ask questions in the Q&amp;A but if they are not, theres like a 3 second silence before one of them tries to ask a question. I think that they fail to encourage you as entrepreneurs and don't really acknowledge/listen to the work that you did depending on their taste",
            "comment_grading": "What they grade seems to be according to course outline. However, how they graded was vague for like the midterms and finals, There was feedback for most assignments on canvas though.<br /><br />The midterms and finals, in total they are worth 25%. Main assignments account for around 45% if I counted right. Writing the speaker reflections 0.3 each is like 3.3% in total. Peer evaluation is 5%. Two bigger 500+ word reflections are worth 9% in total. Bonus is 6%. Attendance is 10%. In total it's slightly above 100% given bonus pts. There's a crap ton of small 2-7% pts so it's good practice to do all the assignments and bonus stuff I guess. <br /><br />I don't think that this course is particularly hard even though the workload is high. For a normal person who had no business background, this was an above average course and mostly fun. Maybe it's because I got helpful groupmates. The grades might be tricky but overall is worth it for the experience. For academically oriented people, it might completely mess up your study time",
            "comment_workload": "Personal Development Journal (6%)<br />Due Dec 11, 2020 at 5pm <br /><br />Final Shop Update *Bonus* (2%)<br />Due Dec 9, 2020 at 11:59pm <br /><br />Peer Evaluation (3%)<br />Due Dec 4, 2020 at 5:46pm <br /><br />Pitch Deck &amp; Presentation FINALS (15%)<br />Due Dec 1, 2020 at 11:59pm<br /><br />Reflection 11: DingDing@Social Enterprise <br />Due Nov 30, 2020 at 11:59pm <br /><br />Kickstarter page <br />Due Nov 30, 2020 at 5pm<br /><br />Reflection 10: SES<br />Due Nov 23, 2020 at 11:59pm<br /><br />AB Testing Report 2 (7%)<br />Due Nov 23, 2020 at 5pm <br /><br />Reflection 9: Dr. Albert Ko<br />Due Nov 16, 2020 at 11:59pm<br /><br />Prototype Refinement (3%)<br />Due Nov 16, 2020 at 5pm <br /><br />Reflection 8: William Chan@Agent of Change<br />Due Nov 9, 2020 at 11:59pm <br /><br />Testing (4%)<br />Due Nov 9, 2020 at 5pm <br /><br />Pitching (3%)<br />Due Nov 9, 2020 at 5pm <br /><br />Reflection 7: Winnie Lee@Spreadit<br />Due Nov 2, 2020 at 11:59pm <br /><br />Online Shop: Content Marketing (5%)<br />Due Nov 2, 2020 at 5:59pm<br /><br />Software Prototyping (3%)<br />Due Nov 2, 2020 at 5pm&nbsp;&nbsp;<br /><br />Reflection 6: Luke Tam@Kai Fong Tour<br />Due Oct 26, 2020 at 11:59pm<br /><br />Hardware Prototyping (3%)<br />Due Oct 26, 2020 at 5pm <br /><br />Reflection: Kai Fong Tour *Bonus* (1%)<br />Due Oct 21, 2020 at 11:59pm <br /><br />Reflection 5: Simon Shen<br />Due Oct 19, 2020 at 11:59pm <br /><br />AB Testing Report 1 (7%)<br />Due Oct 19, 2020 at 5pm <br /><br />Peer Evaluation (2%)<br />Due Oct 14, 2020 at 5pm <br /><br />Reflection 4: Jonathan and Kyle@Gööp<br />Due Oct 12, 2020 at 11:59pm<br /><br />Presentation Deck &amp; Presentation MIDTERM (10%)<br />Due Oct 12, 2020 at 5pm<br /><br />Personal Takeaway (3%)<br />Due Oct 12, 2020 at 5pm<br /><br />Reflection 3: Terrie Fung@Buyble<br />Due Sep 28, 2020 at 11:59pm<br /><br />Business Canvas (2%)<br />Due Sep 28, 2020 at 5pm<br /><br />Online Shop: Shop Set up (5%)<br />Due Sep 28, 2020 at 5pm<br /><br />Design Thinking Challenge *Bonus* (2%)<br />Due Sep 26, 2020 at 11:59pm<br /><br />Empathy&nbsp;&nbsp;(3%)<br />Due Sep 21, 2020 at 11:59pm<br /><br />Reflection 2: Prof. Erwin Huang<br />Due Sep 21, 2020 at 11:59pm <br /><br />Reflection 1: Plato Wai@Shopline<br />Due Sep 14, 2020 at 11:59pm <br /><br />I counted 32 assignments, 11 is just writing short reflection which is not difficult. But some of the other assignments like software prototyping, AB testing take time to do.<br /><br />For our group, it was 3 UST 2 LU students. Our LU mates did the bare minimum. But my UST mates helped out big time. <br /><br />Also for clarification, you don't need to successfully create and manage an online business, the grade is rather simple, asking you to set up the shop name, products page, etc. You also don't have to make your Kickstarter public.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1bvT6wdB97HLUGIhxlahniwtgUEciEKj",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                },
                {
                    "id": 18,
                    "name": "LING, Carrie Hang-yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "queenielai",
            "date": "Jan 07, 2021",
            "title": "",
            "comment_content": "Content mainly focuses on each stage of the design thinking process (empathy, define, ideate, prototype, test). Includes weekly talks from entrepreneurs.",
            "comment_teaching": "Teachers and TA's are nice (and I really admire Erwin as an individual), but I wish that they could provide clearer instructions on each assignment.",
            "comment_grading": "I would say 90% of assignments are based on group-work, so it's important to good group-mates. Honestly, the grading is very very ambiguous, and I would say that contrary to what others have said about this class, putting in the effort does not necessarily translate to a good grade. What troubles me the most is that there is NO grading criteria and NO clear instruction on each assignment or task, so a lot of students are left clueless on what to do. Also make sure you make it to every class, because they deduct 2 points for every class missed.",
            "comment_workload": "A lot of work for this course. Especially if you have free-riders in your group. Weekly reflections on talks from entrepreneurs (takes about 20 min to do so it's not a big issue), but weekly projects with multiple deadlines in the same week, sometimes on the same day. Projects include (but are definitely not limited to) managing an online shop, content marketing, AB testing, creating a kickstarter page... etc. All are quite interesting but again, quite a lot of work if you have free-riders in your group, Midterm and final are both presentations.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fDUYdXApQyXJfZmrAvbBgQTW2b0gJRRl",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                },
                {
                    "id": 1245,
                    "name": "LING, Carrie",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "E_/A",
            "date": "Jul 03, 2020",
            "title": "",
            "comment_content": "Teaches various types of content related to entrepreneurship:<br /><br />1. Design thinking process (you will go through each step with assignments)<br />2. use of some useful tools like Mural, Bubble, etc<br />3. AB tesing<br />4. Guest speakers<br /><br />The Guest speaking sessions are the best as you get to hear a lot of interesting stories and really learn from these amazing people.",
            "comment_teaching": "Pros:<br /><br />Really appreciate that professors are trying to teach as much as they can despite the online mode of learning. They try to expose you to as many new things as possible.<br /><br />Cons:<br /><br />Kinda unorganized as the teaching schedule is not fixed, and 2 Profs + 2 TAs with different comments or opinions about your work can be very confusing to your work assignment as you progress in your group project later on.<br /><br />Sometimes, some teachers they invite dont speak well which makes you want to sleep, especially when it's online mode.",
            "comment_grading": "The grading is quite lenient, given that many people taking the course may not be experienced. But they take into account heavily in your effort, so be sure to put in some effort if you expect higher grading.",
            "comment_workload": "Workload is extremely high!<br /><br />You have individual assignments, group assignments (Design thinking process consiste of 5 steps, each will have about 2-4 assignments each). You'll have Group Project too. As I took this during the covid 19, so the teaching is all done online, including our work and group project. <br /><br />I personally dont mind that much about the quantity as the work is interesting, but the really bad thing is that the teaching team tend to announce the due date or details of the work like 1-2 weeks before the due date, which was really inconvenient if you have other work or projects and meetings going on. The assignments tend to require a lot of group meetings too.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gQNJgATPUW5tHgBeD9LkJsBNJ9VSRBjG",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                },
                {
                    "id": 1245,
                    "name": "LING, Carrie",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "K&K",
            "date": "Feb 02, 2020",
            "title": "",
            "comment_content": "the first several classes were good cuz we had successful entrepreneurs as speakers. But after midterm the prototype and design thinking were really boring. Didn't learn much.",
            "comment_teaching": "Ewrin and Aki were really nice instructors. But Carrie and the TA's teaching about prototype was so vague and we didn't get much out of it.",
            "comment_grading": "Really don't know how they grade the final mega reflection. No clear criteria. Leave you at a loss.",
            "comment_workload": "probably the heaviest. You have to have a perfect team. you have to work on projects and you will try a lot of different things. Pretty heavy workload.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bPjpnoiApGZY1drBxo1tDT0KFTsiZQ84",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MandyTsai",
            "date": "Jan 21, 2019",
            "title": "",
            "comment_content": "The course content is quite useful with workshops and sharing from entrepreneurs.",
            "comment_teaching": "Every class they invite different speakers to talk about their careers and some special skills.",
            "comment_grading": "The grading is normal, not too easy or hard. Yet whether the professor likes your project does not guarantee a high score.",
            "comment_workload": "The workload is pretty heavy. Many projects and presentations. Yet the worse part is that the instructions from the professor and TAs are pretty vague. You sometimes find yourself spending most of the time just trying to know what they want.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sY3yqfni8AG877aOG6w6DbbxQBAgquHn",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 893,
                    "name": "HUANG, Erwin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Michellekiukiu",
            "date": "Jan 11, 2019",
            "title": "One of my favorite practical course",
            "comment_content": "The course includes weekly guest sharing, weekly workshops on design thinking, prototype and a site visit (we went to Shenzhen). You are also required to start a online shop with your team. All these are for you to learn and test out what a startup will do. It is very practical and this is a perfect start if you aim to be an entrepreneur.",
            "comment_teaching": "Professor Huang is extremely experienced in almost all types of business. You can look up his background to see how successful he is. The point is he focuses on experiential learnings and he is always willing to share his thoughts and give you advices. He once told us that he only gives his startup mentee advice once a month. He gives us a lot of insights regarding business and success. He has been my favourite professor so far",
            "comment_grading": "In this course, you focus on learning rather than grades. If you are truly passionate and willing to contribute to your own business, you will be granted an ok results. For A-grade students, they are people who pay a lot of efforts in their business. Professor and tutor are experienced enough to spot your efforts. I would say the grade is pretty fair",
            "comment_workload": "Treat this course as starting a business, you can free-ride your team, but you will learn nothing useful at all. Weekly reviews and a few presentations won't cause you much time. The workload mainly depends on how much time you put in your business. For my team, I didn't contribute 100% of my efforts as I put most of my time in my society. If you want to make money and sustain your business, the workload can be quite heavy.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JLWbxwuuqMYGgK1pT26EaNeOXDW8Oz5J",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Niko",
            "date": "Jan 22, 2019",
            "title": "",
            "comment_content": "教下你點做entrepreneur<br />每個星期請D entrepreneur黎talk下<br />有心創業既先有得着",
            "comment_teaching": "基本上冇乜野教<br />亦冇乜野學",
            "comment_grading": "midterm final都係presentation<br />好多一份兩份功課都計分<br />attendance<br /><br />做齊哂D野就ok",
            "comment_workload": "本身sem頭就話得一個present一個report<br />但到之後唔知點解多左個project<br />2份project都係group形式<br />每星期又要打reflection<br />仲有幾日要出去上堂/番大陸<br />仲要由sem頭已經開始打理緊ig shop<br />好多濕濕碎碎既野要做",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}