{
    "error": false,
    "course": {
        "id": 397,
        "subject": "ENVR",
        "code": "3110",
        "name": "Sustainable Development",
        "description": "Sustainable development integrates improvements in human welfare with improvements in the health of the environment. It is societies attempt to solve the degradation that economic and social development has imposed on the environment. To solve environmental crises such as climate change, pollution, or destruction of biodiversity we need to integrate environmental practices into all our activities, pulling together new technologies, lifestyles, economic theories and business practices, and government policies. This course looks at how this process of integration works at the international, national, and municipal levels and from the organization perspectives of different industrial sectors, businesses, and communities.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1630,
            1510,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"CIVL\" data-code=\"1170\" href=\"/review/CIVL1170\" target=\"_blank\">CIVL 1170</a> OR <a class=\"course-link\" data-subject=\"ENVR\" data-code=\"1170\" href=\"/review/ENVR1170\" target=\"_blank\">ENVR 1170</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.5,
        "rating_teaching": 4,
        "rating_grading": 4.5,
        "rating_workload": 4.5,
        "review_count": 2,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 216,
                "name": "PATCHELL, Gerald Roe",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "7Wg2kgt22FuzNmbj7eBhnrumyWMOso4V",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 216,
                    "name": "PATCHELL, Gerald Roe",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "天音かなた",
            "date": "Jan 06, 2022",
            "title": "Fiesta",
            "comment_content": "The course covers mainly &quot;theories&quot;. It takes quite some reading and perhaps imagination to understand some of the concepts discussed in class, but they are useful in this course and in general. Good command in English is essential given the reading required.<br />The course gives you the opportunity to go to ReThink, which is the best thing about this course.",
            "comment_teaching": "It is hard to recall what happened in lectures. The professor has a baritone voice and the lecture is 1:30pm perfect for an afternoon nap. Many students, including myself, find lecture content baffling. People mostly do their own thing in class, and only read content related to assignment (your topic / sector) only.<br />My peers have also asked the Professor about the recommended readings, but the Professor seem to not know about the content and research according to them.<br />Sometimes there will be group discussions but they are very light-hearted.",
            "comment_grading": "No written exams, only writing and presentation. <br />As far as I know, you need to write in a way that is understandable by a senile white man. The professor seem to have a hard time understanding written assignments in non-standard English (&quot;perhaps Chinglish&quot;) and will not give them a decent score. <br /><br />The first assignment is based on ReThink, and students have to write about what happened at ReThink with respect to 2 sectors, using concepts taught in class. (A)<br />The group presentation is based on an assigned topic (covered in class) and a sector (grouped by priorities). I think the instructions for this assignment is lacking. (B-)<br />The Final Report is based on the sector same as the one in the group presentation. It has a &quot;group component&quot; and &quot;individual component&quot; but it is not defined clearly. (A-)<br />(A-)",
            "comment_workload": "Workload strongly depends on your language ability. The whole course is reading papers and writing papers. If you can read and digest concepts then it should not be painful.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dBv6vs6C7dVBTgr90p2BtBvGb815Owd6",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 216,
                    "name": "PATCHELL, Gerald Roe",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lamok",
            "date": "Jan 07, 2020",
            "title": "",
            "comment_content": "All about Sustainability.<br />From principles to sustainability transition. You learn hen you try to apply the theory in your selected industry. Quite good if you like to learn some principles about sustainability.",
            "comment_teaching": "He gave a lot of examples to illustrate the ideas. No electronic devices were allowed (even iPads). So if you want to take notes you write in your own notebook. You don't really need to write a lot because in the ppt he provided, there are some speaker notes you can refer to. Not sure if the speaker notes help when you do revision because for our year we don't have a final exam.<br />Prof. Patchell is very nice and willing to answer students' questions. He replied to email very fast as well.",
            "comment_grading": "My grade is quite good. Only the assignments and the first group project had scores disclosed. The final group essay has no feedback (yet).",
            "comment_workload": "It supposed to be 3 assignments and two group projects.<br />This semester we only have 2 assignments and two group projects. <br />The assignments were quite easy, just follow the guidelines and write 200-500 words (If you are not sure what to write, ask professor directly). One group project was related to the course content, you present the idea you have learned in your selected industry. It should be around 20 minutes.<br />The final group project was everything you learned in the course and you just need to apply it to your selected industry.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}