{
    "error": false,
    "course": {
        "id": 1528,
        "subject": "FINA",
        "code": "3103",
        "name": "Intermediate Investments",
        "description": "This course studies the concepts and evidence relevant to the management of investment portfolios. Topics include diversification, asset allocation, portfolio optimization, factor models, the relation between risk and return, trading, passive (e.g., index-fund) and active (e.g., hedge-fund, long-short) strategies, mutual funds, performance evaluation, long-horizon investing and simulation.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"FINA\" data-code=\"2203\" href=\"/review/FINA2203\" target=\"_blank\">FINA 2203</a> or <a class=\"course-link\" data-subject=\"FINA\" data-code=\"2303\" href=\"/review/FINA2303\" target=\"_blank\">FINA 2303</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.21,
        "rating_teaching": 3.68,
        "rating_grading": 3.64,
        "rating_workload": 3.77,
        "review_count": 47,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 812,
                "name": "BHATTACHARYA, Utpal",
                "count": 22
            },
            {
                "id": 981,
                "name": "MUKHERJEE, Abhiroop",
                "count": 14
            },
            {
                "id": 895,
                "name": "YU, Jialin",
                "count": 3
            },
            {
                "id": 1586,
                "name": "AOYAGI, Jun",
                "count": 3
            },
            {
                "id": 254,
                "name": "YIP, Victor Chi Lok",
                "count": 2
            },
            {
                "id": 982,
                "name": "PANAYOTOV, George Kamenov",
                "count": 2
            },
            {
                "id": 1299,
                "name": "SAK, Halis",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "cRpvOUYAWTO1dqon6P19dNzntOd6DQkl",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "HKUST is good",
            "date": "May 30, 2020",
            "title": "Fascinating Content, Disgusting Professor",
            "comment_content": "In terms of content, it is excellent.<br />You will learn well how to invest to maximise your realised return and lower your risk. Of course, this does not mean you can be a millionaire at Wall Street after studying FINA3103, because risk is risk.<br /><br />You will learn:<br />-What is investment<br />-Risk aversion and Risk seeking<br />-Utility curve<br />-Portfolio Management (CAPM model, Index Model, Multi-factor Model, Arbitrage Pricing Theory)<br />(-midterm exam-)<br />-Efficient Market Hypothesis<br />-Behavioural Finance<br />-Evaluating Fund Manager<br />-Bonds (Yield Curve, Forward and spot interest rates, Duration and immunisation)<br />-Derivatives (Options and Futures)<br />(-Final Exam, cumulative-)<br /><br />This course learn various investment approaches using the perspective of a general citizen, which is quite good and equip you with the knowledge in future when you want to invest your money.",
            "comment_teaching": "1. Unresponsive, very unwilling to answer students’ questions. Yes he does answer you if you force raise a question, but he will rush the answer such that you won’t get satisfied because you won’t understand after his “short answer”. He just wants to finish each class on time, and does not care whether you have after-class question or not.<br /><br />2. Racist, he is an Indian Professor, and he answers Indian students much more time than locals. Even Indian students ask silly questions, he answers them; on the other hand, he will just PRETEND could not see any local students raise a question.<br /><br />3. Accent. Heavy Indian accent, I believe students from somewhere other than the Middle East could not understand what he was talking about for over 80% of the time.<br /><br />4. Don’t know wtf he wrote on slides. His handwriting is very poor and cursive, I spent almost one-third of the semester before finding out his writing “n” is actually a “r” (the return)<br /><br />5. Slides are SERIOUSLY UNORGANISED. If you are unfortunately in his class, better buy a textbook. You won’t get what he is writing from his slides. They are just not logical and coherent at all. The slides skip content from one point to another without explanation. You won’t understand what he wanna teach given the messy slides and his not-understandable accent.<br /><br />6. Some say he is phenomenal, which I don’t agree. What he did is just spend some minutes for a “little polling” before each class starts, and provide little to no explanations after the polling and the polls are unrelated to the contents as well.<br /><br />7. Too arrogant. He wrote on canvas that he is “The Best Business School Professor in the world”. Lol. He always thinks he is very good and very knowledgeable. I don’t care it is true or not, but listening to a professor keep boasting his achievements is a waste of our time. (e.g. he will talk about he wrote what research paper, had a seminar at where, etc.)<br /><br />8. Psychopath. He designed assignment and quizzes and exams seems just want to let students suffer. Will explain more below.",
            "comment_grading": "Quizzes, Midterm and Final exams are very difficult. He designed the Final Exam paper in the way such that no one is possible to finish the paper. He even mentioned the last question is “challenging question”. But I guess no one could effectively attempt that question because no one (at least from all I know) could finish more than 18 questions out of those 20 questions. It is a competition of time instead of knowledge. Moreover, he even refused to answer questions on ZOOM while proctoring, even for emergencies or technical problems.<br /><br />Quizzes (best 20 out of 24) 20%<br />Assignment (4 x 5%) 20%<br />Midterm Exam 20%<br />Final Exam 40%<br /><br />Also, I do think the midterm exam is weighted too little and too much focus was on quizzes and assignments, which is quite unfair as in-class quiz is a competition of understanding his accent and slides; while assignments is a competition of EXCEL techniques and the use of Chegg.",
            "comment_workload": "Homeworks are intense. 4 HWs from groups, each need spend a lot of time dealing with EXCEL. What the hack? this is not an excel course, and I guess no one wants to spend time dealing with thousands of stocks data over and over again at each assignment using EXCEL formula.<br /><br />Quizzes are intense too. Each class has an in-class quiz. That means we can’t skip classes even his teaching was extremely poor. And the quiz needs us to understand the concept from that class he taught. However, it is not possible as his accent is bad and slides are messy.",
            "rating_content": 5,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 17,
            "vote_count": 19,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "vPZa3CRlSRXDIwatGsTUtA7LEh03FWTt",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "B.T.",
            "date": "Jun 05, 2020",
            "title": "The professor ruined the course with poor teaching and unreasonable assesments",
            "comment_content": "You will learn a lot contents related to investments. After learning the course, you will know how daily stocks and bonds market work, how to estimate risk and return, how to allocate asset wisely, ways to hedge or speculate and finding some arbritrage opportunities.",
            "comment_teaching": "Utpal teaching was extremely poor. His slides were very messy. Each lecture note had different fonts, different formats, different word sizes and colors...<br /><br />Some professor might also provide unorganised slides, but could compensate with lively teaching. However, Utpal just couldn’t. <br /><br />His accent was heavy and his handwriting on the slides and from visualiser was very cursive. I think apart from Indian students, no one could effectively understand what he taught in classes.<br /><br />He said he encourage students to respond, but then whenever someone asked something that interrupted him or he thought is stupid, or was challenging him, he would simply either skip the question unanswered, or answer in a few words with no explanation behind and immediately keep on teaching / end the class.<br /><br />Going to class is a waste of time, but you can’t skip because of the in-class quizzes. Reading the powerpoint slides was a difficult task. I strongly suggest you go for a textbook. You will find a lot of things seemingly uncorrelated from slides to slides are actually with better explanations behind. The textbook is more comprehensive and much easier to understand (tho u need to spend some time reading it). Trust me or not, you will find it worths if you aim for a good grade and you are not good with an Indian accent. Moreover, few questions in the exams might be mentioned none to little from classes and slides but were emphasised in the textbook.",
            "comment_grading": "Grading is so-so. It might be considered a better-than-average grading, given it is a finance course and students are competitive. However, they were not transparent as final exam score was not released, plus the in-class quizzes and homework basically did not have suggested solutions and comments to correct/incorrect answers.<br /><br />Breakdown of grading:<br />1. In-class quizzes (can be anytime during the 1hr20min lecture): 20%, count the best 20 from 24 classes, almost starting the first class during the add-drop till the last before the exam period.<br /><br />Mean score expect 18-19 out of 20, I got 19.7.<br /><br /><br />2. Assignments, four in total: 20%. They were all lengthy Excel assignments. Since it was a group work, make sure you find somebody has some basic knowledge in Excel.<br /><br />Mean: 19-19.5 out of 20, my group got 18.4<br /><br /><br />3. Midterm examination: 20%, moderate difficulty — 50 Multiple Choice / Short Answer questions, each is worth 4 points, total 200.<br /><br />mean: 162 out of 200, standard deviation 19. I got 192.<br /><br /><br />4. Cumulative final examination: 40%, quite difficult and very lengthy — 5 MCQ/Short Ans + 15 Long Questions, each is worth 20 points, total 400.<br />I guess no one could finish all, I got 17 questions out of 20 done. Those were “done” only, don't know correct or not, but at least I know I left 3 questions unattempted<br /><br />Everything about the final was not disclosed.<br /><br /><br />My final grade: A-<br />I will say the curving is reasonable. However, the assessments were too stressful and difficult, they would probably make u feel depressed after finishing them.",
            "comment_workload": "Midterm and final exams were okay, all you need is to spend around 2-3 days for the midterm and 4-5 days for the final for revising. If u could understand the concepts and have some practices beforehand, those examinations should be fine.<br /><br />However, in-class quizzes and homework were both demanding in terms of daily work. In-class quizzes forced you to understand the concepts taught (remember you will be with the poor accent and slides) in the class immediately. You need to digest the materials and you will only have 5 or 10 minutes each time for the quiz during the class. I advise you not to press the “start” button too early, better start a quiz after you have an idea on how to calculate or even you have done the calculation.<br /><br />Assignments required the use of extensive Excel techniques and you may get pissed with those lengthy yet numeric raw data. Also, try to make good use of groups forming, better find someone who knows Excel beforehand but not a computer idiot.",
            "rating_content": 5,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 7,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "prlvoOwGP7p7hceYHoMHEF1XH41wHVLq",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "上海灘龍虎鬥",
            "date": "Jun 04, 2020",
            "title": "Bad professor, on9 quiz policy, please swap to other professor immediately",
            "comment_content": "The course content is good, It provide fundamental knowledge about stock market, bonds and derivatives.<br /><br />-Buying and selling on margin<br />-Utility theory<br />-CAPM, APT and multi-factor model<br />-Efficient Market Hypothesis<br />-Behavioural Finance<br />-Perfomance evaluation<br />-Bonds <br />-Option and futures",
            "comment_teaching": "His teaching is bad and he taught in a very fast pace. His handwriting is horrible, it is difficult to distinguish his writing of &quot;n&quot; and &quot;r&quot;. His teaching pace is fast and due to his accent, you may not be able to understand what he is talking about on class immediately. However, he published quizzes just after he talked about the topic. It means that if you cannot follow him, you will get sucked in your quiz. I think this policy is completely not reasonable since you do not have the opportunity to revise before the quiz. Some quizzes are unreasonable such as having 20 calculations in 10 minutes. And this make me feel very stressed every lesson.<br />He said he is the Best Business School Professor in the world. (wtf?)",
            "comment_grading": "Grading is not too bad (maybe because of online semester).<br />In-class quizzes (Best 20 of 24) : 20%<br />Assignments : 20%<br />Mid-term exam : 20%<br />(At first glance he said all questions are MC, but it turned out some of the questions are fill in the blanks.)<br />Final exam : 40% (5 short questions and 15 long questions, with the last one is challenging question. Each questions have many sub-questions, and most of the students could not finish all.)<br />For the two exams, you can bring a A4-size cheatsheet.<br />I got below mean in mid term, about mean for assignments, not getting full marks for quizzes and unknown performance about final (He deleted the course canvas after exam lmao). I finally get A-.",
            "comment_workload": "Workload is fine, 4 group assignments are given. Just make sure you know how to use excel to find required data.<br />And the most demanding part is the quiz mentioned above",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "F7oBNsJZ92lfJ90KMdvnUl3wbTaJtplI",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 895,
                    "name": "YU, Jialin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Arange",
            "date": "Jan 27, 2017",
            "title": "",
            "comment_content": "Very competitive course.<br />This course covers simple and basic finance concepts that finance professional needs to know.<br />Ch1 The Investment Environment and Financial Markets<br />Ch2 Trading Securities<br />Ch3 Return and Risk<br />Ch4 Portfolio Mathematics and Capital Allocation<br />Ch5 Portfolio Analyses I<br />Ch6 Portfolio Analyses II<br />Ch7 Capital Asset Pricing Model<br />Ch8 Single Index Model<br />Ch9 APT and Multi-Factors Model<br />Ch10 Portfolio Performance Evaluation<br />Ch11 Efficient Market Hypothesis and Behavioral Finance<br />Ch12 Fixed-Income Securities<br />Ch13 Term Structure of Interest Rates<br />Ch14 Managing Fixed-Income Portfolios<br />Ch15 Future Markets",
            "comment_teaching": "Teaching is okay and he talks so slow and always gives you some time to think. Sometimes, he may talk something out of syllabus.",
            "comment_grading": "Group Homework&nbsp;&nbsp;X2 15%<br />Midterm Exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;30%<br />Final Exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;45%<br />Participation 5%<br />Peer Evaluation 5%<br />Trading Game Bonus 5%<br /><br />Homework 1 Mean 94.5/100, I get 99<br />Homework 2 Mean 96.4/100, I get 96<br />Participation Mean 3.1/5, I get 3<br />Midterm Mean 28.1/30, I get 27<br />Final Exam Mean 39.9/45, I get 43.5<br />Peer Evaluation Mean 8.2/10, I get 10<br />Trading Game Mean 4.9/6.68, I get 6.27<br />Course Overall Mean 94.42/100, I get 94.82<br />Grade: B<br />0.2 mark down may lead to one sub-grade downwards<br />The grading is bad, and if you get mean, you will probably get C+",
            "comment_workload": "Workload is light as there is only assignment and exams. No project&nbsp;&nbsp;and presentation. Prepare the exams just before the exams. The exams are extremely easy, much easier than that in FINA2303. The mean is too high. Be careful otherwise it will be very easy to get C range.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "rIEjJPiw8Z9sGMPWko4qWtHk9QXfixhZ",
                    "name": "syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "xYUy7cxB9txNzOScKfOgNkB9eN1690Z2",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ci_5z2",
            "date": "Jun 04, 2020",
            "title": "Rubbish teaching, but good grade",
            "comment_content": "A large variety of intermediate financial concepts, but too packed within 1 course, which is burdening.<br />This course studies the concepts and evidence relevant to the management of investment portfolios. Topics include<br />diversification, asset allocation, portfolio optimization, factor models, the relation between risk and return, trading,<br />passive (e.g., index‐fund) and active (e.g., hedge‐fund, long‐short) strategies, mutual funds, performance evaluation, long-horizon<br />investing and simulation.<br />You will learn how to trade on financial exchanges, how to allocate money across several different types of securities/assets<br />(how to invest rather than speculate), how to determine the fair price of a financial security, and how to determine<br />whether a portfolio manager is doing a good job. You will be introduced to various investment strategies (passive, active,<br />using fixed‐income and derivatives)",
            "comment_teaching": "1. Unorganized ppts<br />Full of useless news and graphs which are not relevant to the course content.<br />2. Waste of time listening to his 'great achievements'<br />He always emphasizes how much observations and papers have has been working on, and how much knowledge he has about the financial market, but none of them are actually helping students to understand the financial concepts.<br />Probably a good course for him to 'blow water'<br />3. No concrete solutions provided to quizzes.<br />In the first few quizzes, he didn't provide any solutions. After complaint, he did provide solutions, but without any concrete explanation (how does the equation works, and how to derive the right answers)<br />4. Proud<br />His attitude is like 'Why am I teaching stupid students'. He seldom answer our questions with good answers. Instead, he just repeats the slides' content or draws some ugly graphs that we found them very difficult to understand.",
            "comment_grading": "A. 4 group assignments (5% each)<br />Almost everyone gets over 90%<br />B. 24 Quizzes (count highest 20 out of 24, 1% each)<br />Almost everyone gets over 90%, if not 80%<br />C. Mid‐Term Exam (20%)<br />Mean: 164.6/200<br />D. Final Exam (40%)<br />Statistics unrevealed<br /><br />My marks:<br />Assignments: Full <br />Quizzes: About 19/20<br />Mid-term: 164/200<br />Final Exam: Probably below mean<br /><br />Turns out to be a B, which is far better than my expectation!",
            "comment_workload": "A. 4 group assignments (5% each)<br />All you need is EXCEL skills<br />B. 24 Quizzes (count highest 20 out of 24, 1% each)<br />All you need is good luck. It's insane to sit for an hour just to wait for the quiz and listen to his rubbish talk.<br />C. Mid‐Term Exam (20%)<br />His syllabus indicated MC-only midterm, but it turns out to be MC mixed with some blanks, which is bad.<br />The difficulty is of average.<br />D. Final Exam (40%)<br />20 short questions, with the first 5 fill-in-the-blanks and 15 questions requiring us to write and upload the answers.<br />The questions are super hard, I didn't do 5 or 6 of them.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Z77JYtBTX1nCkiu6vMH7vXIFuDXgrTe8",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Daniel cdm",
            "date": "Jun 10, 2020",
            "title": "Definitely not a good professor in terms of teaching",
            "comment_content": "Please refer to the syllabus attached.<br /><br />Content is generally quite interesting. It covers the fundamental knowledge of the financial market and the basic management of investment portfolios. The professor also included some of his own research studies as teaching materials which are quite interesting. But don't worry those will not be in the final exam.",
            "comment_teaching": "Teaching is really bad. I have no idea how he can put &quot;World’s Best B-School Professors&quot; at the home page of Canvas. Maybe he is great with his publications, but definitely not his teaching.<br /><br />First of all, his PowerPoint is useless as compared to the book. So if you guys want to get a good grade out of this course you must get the book. By only looking at his slides, you won't understand what he is trying to imply whatsoever. You will only understand after hearing his teaching in lectures. The slides are too brief and often not coherent.<br /><br />Another thing to mention is his stupid quiz assessment scheme where you have to complete a quiz on every lesson based on the content taught in that lecture. Though only the best 20 will be counted out of 24 lectures, the quizzes are often quite challenging and sometimes not even related to the content of the lecture. There is no way you can get full marks without prior studies before lectures. So I would suggest you reading every lecture slide beforehand to get a grasp on what he is going to ask. A useful tip would be to pay attention to the page number at the bottom of every slide. He will hide the page for the question of the quiz so there will be a page missing in most of the slides he provided (e.g. page 8 jumped to page 10 indicates a quiz on page 9), unless the quiz is at the end of the class. Therefore, you can guess what he is going to quiz and at least get some preparation beforehand.<br /><br />Finally, I want to express my disappointment that no exercises were provided to help students practice for exams. How do you suppose students to prepare for exams without any exercises? My suggestion is to look for ways to find solutions for the book which is what I did. You will feel much more secure when you have something to practice your understanding of the content.",
            "comment_grading": "Grading is surprisingly a lot better than I expected.<br /><br />For me:<br />Quiz: 19.4/20<br />Midterm: 188/200 (around 1 sd above mean) (50 MCQ)<br />assignment: 19.9/20<br />Final exam: unknown (20 long questions)<br />Grade: A (I expect to get A- so the grading is quite good)<br /><br />I left around 2 questions blank in the final so the grading is better than expected. But don't get me wrong. The grading is solely judged upon the score that I have attained. I did not take into consideration the workload.",
            "comment_workload": "As I have mentioned, the quiz assessment scheme is really annoying and time-consuming. You have to study every lecture slide or even reading the book before each lesson to get a good grade in the quiz. I was unfortunately assigned to a 9am class this semester so it was even tougher for me :(<br /><br />His assignments are not difficult. Just remember to check with your groupmate to eliminate careless mistakes.<br /><br />The midterm is relatively easy if you have a basic understanding of the course content. The final exam, however, is extremely long and challenging and most of the people could not finish it in time.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "ngenIZ9FI0QCiLicTNLKoamsAjflB9kS",
                    "name": "Bhattacharya FINA 3103 Syllabus Spring 2020 (1)",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "9G48HDLAOT24Kz3mzkfN54v6c4hOW5hq",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Rigbones",
            "date": "Jan 24, 2022",
            "title": "FINA 3103: Appreciation of Utpal's research",
            "comment_content": "In this course, you will learn about the basics of financial investments.&nbsp;&nbsp;<br /><br />Note that the amount of content covered in the course is heavily dependent on the instructor.&nbsp;&nbsp;Utpal had exactly double the amount of course content as the other prof this sem (Prof Yu Jialin)",
            "comment_teaching": "Prof Utpal is a really talented presenter.&nbsp;&nbsp;However, sadly he just really isn't a good teacher.&nbsp;&nbsp;His classes will feel like watching Ted talks, where its interesting to watch (assuming that you like finance to begin with) but very hard to actually pick something up from.<br /><br />Since he covers double the content of other professors, he speeds through the content, so there are very little examples given and the explanations are not good enough.&nbsp;&nbsp;Again, it's useful to get a brief idea but you're 100% screwed for exams if you just rely on his lectures alone.&nbsp;&nbsp;(Also he likes to keep showing off his papers in class?? Wtf??)",
            "comment_grading": "Grading **heavily** depends on your effort.&nbsp;&nbsp;<br /><br />Utpal's grading has very high volatility.&nbsp;&nbsp;Extra effort can really improve your grade, but at the same time be a little lazy and you're grade will suffer.<br /><br />If you are willing to put in a lot of effort and time for a chance of a better grade, go Utpal.&nbsp;&nbsp;If you would prefer a more relaxed semester, go Yu Jialin.&nbsp;&nbsp;(I sat in a few Jialin lectures and he is a really nice guy)<br /><br />Also, make sure you copy down every single detail in your cheat sheet.&nbsp;&nbsp;He asked what are the factors for the fama french 3 factor model in midterm and I didn't copy it down so I lost 8 marks just because of that.",
            "comment_workload": "4 assignments<br />1 mid-term<br />1 final<br /><br />If you don't want a C range, you really need to put in a fuck ton of effort.&nbsp;&nbsp;Reading the textbook is a must in my opinion, because the professor just skims through the basics of each topic in class.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5bHxSheRcwqwhGwOnshfo5tzmihRFlQN",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "chelsea111",
            "date": "Jun 08, 2020",
            "title": "teaching is below expectation",
            "comment_content": "Please refer to the syllabus attached or read others' comments.<br />Personally I think the contents cover most basic knowledge of financial market that will be useful in the future. I'm satisfied.",
            "comment_teaching": "Below my expectation. Previous comments said he was good at teaching. If that's true, I wonder what goes wrong this semester.<br />1. Poor accent. Sometimes I couldn't understand what he was talking. At first I thought it was my problem and therefore doubted my English. But now it seems that most people are just like me.<br />2. Unwilling to answer question. Professor's attitude could be a little rude when students trying to ask question in class. It was always the case that he didn't answer students' question clearly or thoroughly. And every time when he finished the content early, he would become impatient towards students' questions and made me feel that he tried to leave as early as possible. <br />3. Unorganized powerpoint. You'd better buy the textbook since u cannot learn the contents by the slides.",
            "comment_grading": "I want to write about the 24 in-class quizzes. They were disaster!! Because of his poor teaching and messy ppts, I screwed up my first several quizzes, which really made me under huge pressure.<br />I strongly suggest that you go through the slides or book before class, cuz he gives you the quiz right after or even before teaching the quiz's topic. And many of the quizzes are a little challenging. For example, finish 20 calculation in 10 minutes, do 10 T or F on market efficiency that are really ambiguous.<br /><br />And for the final exam. I finshed writing 18.5 of them. I suggest you write as fast as you can. <br /><br />The grading this year is better than I thought. Me:<br />Quiz: 19/20. mean: not released, I think should be around 18.5<br />Midterm: 176/200. mean: around 162<br />Assignment: 19.9/20. mean: around 19.5<br />Final: unknown, I think it should be better than my MT.<br />grade: A-. I expected a B+, so I would say the grading is good.",
            "comment_workload": "Ok workload. Just 4 assignments and 24 quizzes.<br />To me, the assignments were not hard. All you need to do is to find good teammates cuz assignments are allowed to work in groups. And you also need to be careful given that the means are around 98 or 99 out of 100.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "lg17aOI9eb2k7KShPPsaW5LQNmoHDRk5",
                    "name": "Bhattacharya FINA 3103 Syllabus Spring 2020",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "MgA4MCFg1yZ9RLJINIJufdhWRkQG29B4",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Smurfing in UST",
            "date": "May 30, 2023",
            "title": "幫印度佬講返句公道說話 Advocate for Utpal",
            "comment_content": "The content is undoubtedly excellent. It is essential for those who want to get in the finance &amp; banking industry. This course focuses on the concepts instead of the maths.<br /><br />1. Portfolio Theory<br />2. CAPM <br />3. Single Index model<br />4. APT<br />5. Efficient Market Hypothesis<br />6. Behavorial Finance<br />7. Fixed-income<br />8. Forwards &amp; Options",
            "comment_teaching": "People may have different opinions on his teaching. In my view, I think he is good at delivering his ideas because some of which are his own research and he has been teaching these for years. However, he is not good at answering students' questions. He does not encourage students to ask questions. I would say he is like a TED Talk speaker. He doesn't like his speech be interrupted by questions. What I did is investopedia XD.<br /><br />And a little advice for choosing professors. Some of my friends saw the bad reviews of Utpal and chose to enrol in Prof. AOYAGI's class, and they are beaten by his calculus and partial differentiation (somehow he focused more on math). This lesson teaches us never neglect the sample size and make biased decisions. (There are only 2 reviews on AOYAGI and both are saying good words).",
            "comment_grading": "The grading is fair I guess (especially in Finance Department).<br /><br />Component: (my score)<br />Excel assignments 4@5% = 20% (20%)<br />Midterm exam 30% (24.3% | Upper quartile)<br />Final exam 50% (Not disclosed)<br /><br />Update (2 June 2023):<br />Asked TA my score of final exam: 295/400<br />She said the statistics won't be disclosed, but I guess I am slightly above UQ.<br /><br />Midterm is 50 MCQs.<br />Final is 20 Short Questions.",
            "comment_workload": "The workload has been reduced A LOT compared to previous years. There are only 4 excel assignments throughout the semester. THATS ALL -- and exams.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TsPoDiRUza65seM20nyhwOnCPENyCEJI",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1586,
                    "name": "AOYAGI, Jun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hopeless",
            "date": "Feb 03, 2023",
            "title": "Very nice Instructor",
            "comment_content": "Very useful content. A foundation knowledge to FINA 3303 and FINA 3203 plus some additional sense with behavioural Finance. All in all, the coverage in Finance is wide for this course, but it doesn't mean the content is too much for one semester. For this course, it requires lots of calculations.",
            "comment_teaching": "Aoyagi Jun is an excellent instructor for intermediate investment courses. He has a deep understanding of the subject and is able to present complex concepts in a clear and concise manner. His teaching style is engaging and interactive, encouraging students to ask questions and participate in discussions. He is well organized, provides relevant and up-to-date examples and has a wealth of resources to support student learning.<br /><br />In addition, Jun is very supportive and accessible, always willing to provide additional help and resources outside of class. He is patient and understanding, creating a positive and encouraging learning environment.<br /><br />Overall, I highly recommend Jun for anyone looking to deepen their knowledge of intermediate investments. He is an outstanding educator and will be a valuable asset to any student looking to improve their understanding of this subject.",
            "comment_grading": "The course assignments and exams were challenging but not impossible. They were designed to test our understanding of the concepts and our ability to apply them to real-world situations. The grading was fair. Overall, I would highly recommend this course to anyone who is interested in investments. The course provided a solid foundation for future studies in this field, and the knowledge I gained will be useful in my future financial decisions.",
            "comment_workload": "The workload in this course can be considered moderate to challenging, as it requires a significant amount of time and effort from students. <br /><br />Lectures are usually held two or three times a week and can last anywhere from one to two hours. They provide a comprehensive overview of the investment landscape, including the various investment vehicles, investment theories, and the principles of investing.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "enhBh4URde7H4m2R32QGtmp4qLDcphg6",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cathleen",
            "date": "Dec 08, 2020",
            "title": "&quot;Byebye, please dont study. &quot; - (mukherjee,2020)",
            "comment_content": "This course studies the concepts and evidence relevant to the management of investment portfolios. Topics include diversification, asset allocation, portfolio optimization, factor models, the relation between risk and return, trading, passive (e.g., index-fund) and active (e.g., hedge-fund, long-short) strategies, mutual funds, performance evaluation, long-horizon investing and simulation.<br /><br />CLO1: Allocate money across different asset classes in a scientific manner.<br />CLO2: Price financial securities on the basis of fundamental financial principles.<br />CLO3: Determine whether a portfolio manager is doing a good job.<br />CLO4: Understand various investment strategies (passive, active, portfolios).<br />CLO5: Perform financial analysis using Microsoft Office Excel and the Reuters financial database.",
            "comment_teaching": "you can feel he is friendly and willing to teach. unlike some tenure professors teach shit. <br />he always stops to ask if anyone has questions. <br />he has indian accent, quite hard to follow sometimes. <br /><br />here are some of his famous quotes: <br /><br />&quot;go ahead, (+ student name) &quot;<br />&quot;have a nice weekend, and please dont study.&quot;<br />&quot;you guys dont have a date? come on, you study too hard.&quot;<br />&quot;when you ask a girl to hang out with your ugly friend beside you, the girl is more likely to accept. I know some of you are going to ask when I am free for dinner.&quot; <br />&quot;if xxxx, then you dont need to listen to a old fat ugly guy talking (he meant himself.&quot;",
            "comment_grading": "midterm mean: 7x/104. sd=17. <br />asm: no stat disclosed.<br />final proj: no stat.<br />final presentation: no stat.<br /><br />anyway, there are so many QFIN FINA ECOF students taking 3103 in fall, do not expect too much to get good grade if you are a study dregs like me.",
            "comment_workload": "2 hw (easy, group based)<br />1 midterm<br />this year he cancelled the final, and replaced with 1 presentation + 1 written report. <br />you do not know your presentation schedule until it comes on the day.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yrJ13h0VGYQseKu8Evn3Via6hNEqk27W",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ivonne",
            "date": "Jan 16, 2020",
            "title": "Interesting teacher and content!",
            "comment_content": "Content was very interesting and insightful especially about investment and financial market! There were many popular investment strategies discussed and also include the new comers.",
            "comment_teaching": "Professor Mukherjee was very good in teaching. Going to his class, you would see his great enthusiasm on investing. He was funny and also able to come up with smart example to help us gain a better understanding.",
            "comment_grading": "His class was interesting but the exam were not as easy as the topic seems. Make sure you really understand the concept and do not even try to memorize anything for the exam. He gave fair grading so don't worry! <br />One thing to note is that most people got perfect score in the assignments and high mean for both midterm and final exam.",
            "comment_workload": "Workload was not heavy at all. Only have 3 home works with simple questions. Moreover, you get to have team mates to help you out with the homework.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rp7LStjloGigleW0TNtlrDBTmULcqlvM",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 982,
                    "name": "PANAYOTOV, George Kamenov",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "stma",
            "date": "Aug 22, 2017",
            "title": "",
            "comment_content": "The content is relevant to the syllabus.<br />Some topics such as duration and Portfolio Risk and Return are quite useful in real life.",
            "comment_teaching": "The teacher is quite funny and he always makes jokes in the class. But he speaks with accent so it is difficult to understand exactly what he said sometimes.",
            "comment_grading": "I got almost full mark in mid-term and homework, and unknown mark in final. My grade is only C+.",
            "comment_workload": "There are four homework only, so the workload is very low. However, some questions are quite hard and you hardly can find the answer on the internet. The professor didn't take attendance.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H49K6pPWDNoWKAswK7nwVYmlEBVY1cvY",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1586,
                    "name": "AOYAGI, Jun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "3737quentin",
            "date": "Jan 06, 2023",
            "title": "",
            "comment_content": "Very useful content. A foundation knowledge to FINA 3303 and FINA 3203 plus some additional sense with behavioural Finance. All in all, the coverage in Finance is wide for this course, but it doesn't mean the content is too much for one semester. For this course, it requires lots of calculations.<br /><br />Chapter 1: Risk, Return, and Capital Allocation (FINA 2303 knowledge)<br />Chapter 2: Portfolio Theory( it tells you how to graph an opportunity portfolio set(ie. return-risk line graph) to find the portfolio in a given condition.)<br />Chapter 3: CAPM( just like FINA 2303, but this course will tell you how to derive CAPM formula, using Tangent portfolio theory.)<br />Chapter 4: Several models for calculating returns( Arbitrage Pricing Theory and CAPM: Realised return and CAPM return; Some hedging strategy from Beta; Multi-factor model to adjust the accuracy of model on asset returns) <br />Chapter 5: Portfolio Performance Evaluation<br />without risk adjustment: (Arithmetic Mean vs. Geometric Mean) <br />with risk adjustment: (Shape Ratio, Treynor Measure, Jensen Measure, Information Ratio, Modigliani-Modiliani measure.)<br />Chapter 6: Behavioural Finance (not much to test)<br />Chapter 7: Derivative (a easy version derivative pricing compare to FINA 3203) if you study FINA 3203 at the time you study FINA 3103, this part will be very easy.<br />Chapter 8: Blockchains and Cryptocurrencies, and so on...<br />(This part was not tested in the Final Exam and it was an optional part for some of us who interested in investment)",
            "comment_teaching": "Prof. AOYAGI is a very nice person. He is approachable. Surprisingly, I thought Prof. Aoyagi, as a Japanese Professor, will have a heavy accent. But turns out, he speaks very fluent and standard. <br />His teaching is very good, well organised.",
            "comment_grading": "HW: 20%<br />Mid term: 30%<br />Final: 50%<br />No attendance<br /><br />The exams are neither easy nor hard so that it wouldn't result in a bad grade.<br /><br />Mid term:<br />mean: 64<br />High: 83 <br />me: 82<br />4 HWs: Full marks while mean is close to full marks<br />Final: Unknown<br />Turns out: A+<br />Hearsay: <br />In the midterm, someone, in the other section, had scored 9X.<br />Two sections might grade separately.",
            "comment_workload": "Very little, only MCs.<br />Some Empirical Questions might require Excel",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "3c5lZBNkj2jAwxIOFF4HDpCQqEeHQMnr",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1299,
                    "name": "SAK, Halis",
                    "rating": 0
                },
                {
                    "id": 254,
                    "name": "YIP, Victor Chi Lok",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "好好學習",
            "date": "Jun 05, 2021",
            "title": "WORST EVER PROFESSOR IN UST",
            "comment_content": "Content is only 50% as others indicate because this shit professor has no concept regarding time management. The whole course is severely cut by SAK HALIS. Literally learn NOTHING in the whole course!!! He even skipped a lot of content due to his poor time management for the course. <br /><br />SWAP IF YOU SEE SAK HALIS IN ANY COURSE.",
            "comment_teaching": "I have to say SAK HALIS is the WORST professor regarding teaching in my whole UST life since 2 years ago.<br />He speaks very poor English with a disgusting accent. And his teaching has no focus and no technical explanation. The actual teaching is very very very poor and inefficient. <br /><br />TA is useless. Never reply to the email with helpful content. Just repeat useless stuff and kill our grade with the professor.<br /><br />SWAP IF YOU SEE SAK HALIS IN ANY COURSE.",
            "comment_grading": "DISASTER.<br />His grading is very untransparent and very subjective. <br />No rubrics and detail about the report and grading will be shown to students.<br />Putting all the efforts in the report and presentation but finally, end up in the B AND C range for the whole group.<br />Midterm and assignments are EXTREMELY easy so no difference. The mean is over 90.<br />No Final.<br />Only a shit report with no guidance and shit presentation without instruction either. <br /><br />SWAP IF YOU SEE SAK HALIS IN ANY COURSE.",
            "comment_workload": "EXTREMELY LARGE.<br />The report and presentation need to be done without any practical sample. MORE THAN 30 hours is needed to deal with the report itself. <br />Assignment every 1-2 weeks.<br />Midterm.<br /><br />SWAP IF YOU SEE SAK HALIS IN ANY COURSE.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vJGX86JW3XyPdMpz17bJajvCm8WyAisU",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Supercellobros",
            "date": "Jun 01, 2018",
            "title": "",
            "comment_content": "Generally the material was pretty interesting. Prof. Mukherjee's background in behavioural finance really contributed to his teaching materials for the class. <br /><br />The course provides an overview into investment management, CAPM/Portfolio Theory, trading strategies, and foundational modelling.",
            "comment_teaching": "The professor has a clear and comprehensive teaching style. The lectures are usually easy to understanding and you can ask questions in class if there are topic that you don't understand. Only downside is that sometimes the material can be covered pretty slowly.",
            "comment_grading": "TA is quite generous with the assignment markings but overall, because the material is easier to understand, the curve is pretty steep for the course.",
            "comment_workload": "The workload of the course includes two assignments, a midterm, and the final. The workload is incredibly light as all the graded assignments are spread out.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WMf9aw8q4p4HuG80RDGYrJYEYWCwyejh",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "1stMck",
            "date": "May 31, 2018",
            "title": "",
            "comment_content": "Risk and return tradeoff <br />Securities Trading<br />Capital allocation to risky vs. risk-free investments<br />Diversification and optimal risky portfolios<br />Long-horizon investing <br />CAPM<br />Factor models &amp; No arbitrage pricing<br />Mutual funds<br />Performance evaluation <br />Efficient markets<br />Behavioral finance<br />Behavioral finance-based trading strategies<br /><br />The contents are easy. Midterm test covered from Risk and return tradeoff to CAPM, and final exam covered all topics. Before midtern, it mainly focuses on quantitative stuff. After midterm, it will switch to behavioral finance.<br /><br />No attendance required and lecture videos are provided starting from the 3rd lesson. You can skip all lessons and watch the lecture videos at home.",
            "comment_teaching": "His teaching is good, very clear, and with a lot of examples. He always teaches something extra, such as application in excel and some trading strategies. Those excel stuff will not be tested or graded though. In his lessons, you can also get some sense to cope with the job interviews which are finance related. Generally, lectures are quite useful and interesting; however, the grading is not good at all.",
            "comment_grading": "This course is very competitive. I think you need to get full mark if you aim an A. Mid-term is extremely important, as it is at the same weight as final exam. I His mideterm is 100% the same as last semester!!!! Many of them got full mark for midterm, so make sure you have source<br /><br />Statistics for all L2-L4 sessions as follows(out of 40):<br />Mean: 36.3<br />Median: 37<br />SD: 3.37<br /><br />The assessment is as follows,<br />Homework (Group) - 40%<br />Mid-Term Exam - 30%<br />Final Exam - 30%<br /><br />My grade:<br />HW (2 HWs which are quite easy) - 100%<br />Mt - ~80%<br />Final grade - C range",
            "comment_workload": "Still good. The homework is submitted in group (max 4 in a group), and the homework is pretty straightforward. Every groups scores full mark in all hws. The midterm is scheduled on Apr, which is one month before the final (quite late). But, if you tend to skip lessons and watch videos at home, you need to spend quite a lot of time as there are many lectures in one topic.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "3KWDYCGk84cezmzRGnIzuNxRGZOwfBp2",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 982,
                    "name": "PANAYOTOV, George Kamenov",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MC",
            "date": "May 22, 2017",
            "title": "",
            "comment_content": "Lectures 1 - 4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Introduction, Risk and Return tradeoff (BKMJ, pp 125-154)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Securities Trading: Margin trading and short selling (BKMJ: pp 6-19, pp 33-56, pp 61-89)<br /><br />Lectures 5 - 8&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Capital allocation to risky vs. risk-free investments;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Diversification and optimal risky portfolios; Long-horizon investing<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(BKMJ, pp 169-190 &amp; pp 205-228)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Portfolio choice in MS Excel<br /><br />Lectures 9 - 11&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;CAPM: Theory and Practice (BKMJ, pp 290-310)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br /><br />Lectures 12 - 14&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Factor models &amp; No arbitrage pricing (BKMJ, pp 255-269, pp 329-345)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mutual funds <br /><br />Lecture 15&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mid-term (22 March)<br /><br />Lectures 16&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Bloomberg training (24 March)<br /><br />Lectures 17–18&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Performance evaluation (BKMJ pp 95-107, pp 845-858), Efficient markets (BKMJ pp 354-383)<br /><br />Lectures 19&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Futures <br /><br />Lecture 20 - 21&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Options <br /><br />Lectures 22 - 23&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Fixed income<br /><br />Lecture 24&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Final review",
            "comment_teaching": "i don't like his teaching<br />he gives just a few questions for each lecture<br />and around 20 questions for each midterm and final review<br />and he just speaks out the answer of&nbsp;&nbsp;the questions or the explanation of the question without answers and&nbsp;&nbsp;you will easily get lost",
            "comment_grading": "(HWx4+1 quiz) 30%<br />midterm30%<br />final 40%<br /><br />for the hw 1,2, its easy, it's like doing english reading<br />for hw3,4&nbsp;&nbsp;you need to use excel, quite difficult<br />he will spend a lesson on showing you how to use excel<br /><br />for exams, he will ask some questions that you think that are not important, you just need to directly copy from your notes without thinking, make sure you put everything on your cheatsheet<br /><br />for midterm total 85 marks, one cheatsheet<br />8mcq, each for 5 marks, very easy,<br />other simple questions and calculations<br /><br />for final total 80 marks, one cheatsheet<br />8mcq, each for 5 marks, very easy again<br />40 marks for short questions, 4 questions, each for 10 marks, all are easy except the last question<br /><br />a wrong mc answer can lead a fall in a or two sub grade",
            "comment_workload": "i think ok <br />midterm and final are easy<br />you need to be very very careful<br /><br />some prof have quiz in every lecture<br />he does not",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2PZ7GC7soxYJCda74Pi531JWPskKwfi5",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1586,
                    "name": "AOYAGI, Jun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Asa Butterfield",
            "date": "Jun 30, 2023",
            "title": "Standard and Fair",
            "comment_content": "1. Introduction<br />2. Trading Strategies<br />3-5. Risk, Return, Capital Allocation<br />6-7. Portfolio Theory<br />8-10. Capital Asset Pricing Model (CAPM), ATP,<br />Multifactor Models<br />11-13. Efficient Market Hypothesis, Information in<br />Financial Markets<br />14. Portfolio Performance Evaluation<br />15. Midterm<br />16. Behavioral Finance <br />17-18. Fixed-Income Securities, Term Structure<br />19-20. Derivatives<br />21-22. Market Structure<br />23-24. Fintech (won't be tested)<br />25. Final Revision<br />26. Final<br /><br />Fintech is Jun's research field, so he added sth about Fintech in the course. This part usually differs a lot for different professors.<br /><br />All in all, I think the content is pretty standardized, containing all the basic theories you need to know about the financial market. Very good introductory course.",
            "comment_teaching": "Although Jun is Japanese, he has almost no accent. In fact, he is very fluent, even fast. He has a great master of the knowledge and the course materials he prepared is clear and well organized.<br /><br />The class is somewhat fast-paced. I suggest taking around 20min to preview the course materials before the class starts. If you are not familiar with the content, you'll be likely to get lost and can't follow up for the rest of the class.<br /><br />I have to say that the course is not as easy as many of you have imagined. Arbitrage, BSM model...... Some content really takes time for you to digest. <br /><br />A tip is to finish all the practice assignments, though they are optional. They're much more difficult than the homework assignments, but they help you undertand the knowledge points deeply.<br /><br />TA Edward really shows high responsibility. He grades the practices very seriously and comments every question you do. Also, if you finish all the practice assignments in time, he will appreciate your efforts and send you some tips for the final exam.",
            "comment_grading": "Assessment Methods:<br />Homework 20%<br />Midterm 30%<br />Final 50%<br /><br />Altogether there are 4 assignments, mainly multiple choices. By discussing with classmates, I think most people can get a full mark.<br /><br />My grades:<br />Homework: full<br />Midterm: 87/120&nbsp;&nbsp;mean: 69.3&nbsp;&nbsp;high:102<br />Final: not given, but I think I did really well<br />Cumulative: 82.17/100&nbsp;&nbsp;mean:67.26&nbsp;&nbsp;high:87.47<br />grade: A<br /><br />The grading is fair enough. Jun deliberately made the final much easier than the midterm, due to the poor midterm statistics.",
            "comment_workload": "If you only complete the homework assignments, the workload is light. But it does take some time to do the practice and really understand the knowledge.<br /><br />No pain, no gain.<br />If you want to get a higher grade, you have to make efforts. Hopefully, this course is fair and everyone will get what they deserve.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JCr4bCRTAWbSncjl5kS22VHdfSZLLN4o",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lnc6no",
            "date": "Jun 04, 2023",
            "title": "not as bad as described",
            "comment_content": "The course content is quite useful as it is the foundational knowledge of investment.",
            "comment_teaching": "The teaching is quite good. He likes to write and draw things on a paper and show it to the class. Although full attendance is not required, it is better to come to the class if you can because some of the questions in the exam consists of the class exercise.",
            "comment_grading": "Grading system:<br />4 projects: 20% (4 Excel assignments)<br />Midterm Exam: 30% (50 multiple choices questions)<br />Final Exam: 50% (20 short questions)<br />A A4 cheet sheet is allowed.<br /><br />I think the midterm exam is not very difficult but you also have to be careful as multiple choice questions can be tricky. Final exam is a bit difficult and I found it hard to finish it on time.<br /><br />My grades:<br />Assignment 1: 95/100, other assignments full mark<br />Midterm: 172/200 (mean:141, high:184, upper quartile:164)<br />Final: not disclosed/400 <br />Overall grade: A<br />I think the grade is quite good as I think my final was not going well.",
            "comment_workload": "The workload is not heavy as there are only 4 assignments in total and they are all group work. Maybe need to work a bit harder in the final exam because it is cumulative.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Kq36YY4KrLiRtmKYXavFaqn3WsYJmELC",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kuhaku",
            "date": "Jun 02, 2023",
            "title": "",
            "comment_content": "Content is similar to what others have written.",
            "comment_teaching": "Professor Utpal is very passionate in class. He often wrote notes on paper and show them on the screen in class. He handed out a quiz every class, which contains a problem that he would provide answer later.",
            "comment_grading": "Grading is quite lenient.<br />Homework:4*5%=20%<br />Midterm:30%<br />Final:50%<br />Midterm is 50 multiple choices.<br />Final is 20 short questions.<br />You can bring a double-sides A4 cheet sheet. <br />Cheet sheet is quite important because the professor likes to ask&nbsp;&nbsp;<br />things he barely mentioned in class. So you better put every concept you can't remember on the midterm cheet sheet and every equation(except the ones he clearly said that won't be on the final) on the final. Normally, common concepts' definitions are not needed in the final.Since final consists of mainly calculations.<br />Me:<br />Homework:nearly full every time, around 95-100<br />Midterm:168/200(mean:141,high:184,upper quartile:164)<br />Final: not disclosed/400(I find it difficult to finish in time, left a question blank)<br />Grade:A-<br />I think the grade is quite good because I think I didn't do well in final.",
            "comment_workload": "Just four homeworks in total",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ihfNymiQhfqB0Oik1inNVrfbMTReyyho",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Vincci^^",
            "date": "Jun 01, 2022",
            "title": "",
            "comment_content": "trading securities, forming portfolios with risk-free and risky assets, factor models with smart beta, behavioral finance(biases and preference)",
            "comment_teaching": "willing to answer questions and give real-world examples. sometimes will play some youtube videos for specific topics which makes the lesson less boring.",
            "comment_grading": "highly competitive with a high mean. easy to be below mean. midterm is very hard and final is acceptable.<br /><br />grading distribution:<br />homework 30%<br />midterm 30%<br />final 40%",
            "comment_workload": "two group assignments with 2 big questions and multiple sub-questions for each, which workload is acceptable. no extra readings are required.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wczjLycTpU7JW8QVZdV8JIlEQBIWbs5u",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "William_",
            "date": "May 24, 2022",
            "title": "Hard mt easy final",
            "comment_content": "Intermediate investment<br />CAPM Model, basic option concepts, FF-3 Model, behavioral finance, Capital allocation, Utility function, hedging concepts.",
            "comment_teaching": "Easy to catch up with what he teaches and he likes to make jokes which made the atmosphere less boring. Open to students' opinion.",
            "comment_grading": "Fina courses are highly competitive, the mean is high as ecof and qfin students also take this course, so be mentally prepared if u are not sensitive to algebraic stuffs and percentages.",
            "comment_workload": "very low workload, only two homework assignments abd u are always welcomed to ask him if u are confused.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8U3jfXWLNfqhonOblMLcVeMoBYB8kZqR",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hihihi__hi",
            "date": "Jan 24, 2022",
            "title": "",
            "comment_content": "basics of financial investments<br />securities, portfolios, CAPM...<br />a small part was covered in fina2303",
            "comment_teaching": "The professor is very humorous and is good at telling complex things in simple ways, but the pace is a little fast",
            "comment_grading": "better than I expected<br />midterm, final, and 4 group assignments<br />almost all assignments got full marks<br />midterm about mean<br />final was not released<br />final grade B",
            "comment_workload": "quite large I would say<br />It was hard to get all the points during the class<br />You need to spend a lot of time studying by yourself after class",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ay5nQgUHHOdnOJcofIV4vI3xwsAiy4ml",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hahaha123xd",
            "date": "Dec 28, 2021",
            "title": "not as bad as what I expected, but still be careful",
            "comment_content": "This course studies the concepts and evidence relevant to the management of investment portfolios. Topics include diversification, asset allocation, portfolio optimization, factor models, the relation between risk and return, trading, passive (e.g., index‐fund) and active (e.g., hedge‐fund, long‐short) strategies, mutual funds, performance evaluation, long‐ horizon investing and simulation.<br /><br />Overall four key topics: Equities, Fixed Income, Derivatives, Behavioural Finance<br /><br />BEAR IN MIND THE FOLLOWING:<br />How much content you have depends on which professor you have registered, which is bullshit. For example, I had Utpal and the amount of content is at least twice as much as Yu Jialin's class, they don't have midterm and we have, it is bullshit.<br /><br />That said, I still find the content fun.",
            "comment_teaching": "Whether Utpal's teaching is good is very dependent on people, I remember all of ustspace's comments say he is super shit, personally though I find him acceptable, he emphasizes actual learning instead of exam stuff in lessons, which is why sometimes what he says in lesson might be completely irrelevant. Bear in mind sometimes things on slides might not be even examined, so you have to listen carefully. His accent is quite bad to be honest, though I still understand most of the things he said. He sounds like a super meritocratic person lol",
            "comment_grading": "No attendance requirement (in the syllabus it said 75% is mandatory), I completely skipped at least 50% of the classes and it did not seem to affect my final grade, so scrap that.<br /><br />Homework assignments: 20%<br />Midterm: 30%<br />Final (cumulative): 50%<br /><br />Marks:<br />HW: 192.5/200<br />Midterm: 184/200<br />Final: 365/400<br />Grade: A<br /><br />Expected an A+, but whatever",
            "comment_workload": "Workload is manageable for sure, assignments might occasionally be challenging but still okay. After all it is like a group project (4 people in one group). I would only complain about the fact that our content is so much more than the other class which pisses me off.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "64ZzFD9EhpCOgHKS5cZ6WiP1POhEAQ4F",
                    "name": "Bhattacharya FINA 3103 Syllabus Fall 2021",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "1RPJ911uAAIDMddzco4Dv3NPPmYaQzpy",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GGEZzzzz",
            "date": "Aug 27, 2021",
            "title": "The Best Business School Professor in the world?",
            "comment_content": "Excellent and practical content.<br />Content:<br />1. Trading Securities<br />2. Risk and Return.<br />3. Risk Aversion and Capital Allocation.<br />4. Portfolio Theory<br />5. CAPM<br />6. Index Models.<br />7. APT and Other Multifactor Models<br />- Mid Term<br />8. Efficient Markets Hypothesis<br />9. Behavioral Finance<br />10. Fixed-Income<br />11. Term Structure of interest rate<br />12. Managing Fixed Income Portfolios<br />13. Futures<br />14. Options.<br />15. The Dark Side of Finance",
            "comment_teaching": "His ppt and hand writing are just absolutely horrible.<br />His verbal teaching isn't as bad as others may claim, his accent isn't that strong but the pace is pretty fast so you have to pay extra attention to follow. <br />He does spend a lot of time talking about his own achievement and how he has talked to serval Nobel price winner.<br />He always does a polling before each classes testing how much we really understand the content he provided last lesson, but he doesn't provide much explanation after the polling (so it's pretty much useless). <br />Overall I won't say his teaching is bad, but he could've spend some time making actually readable ppt and other teaching materials.",
            "comment_grading": "Satisfactory and reasonable grading.<br />There are 4 HWs. (Group-based)<br />Full mark in all 4 (which is normal, it's very easy.)<br />mid term score: 152/200 (~mean)<br />Final exam score: not transparent (should also be ~mean)<br />Overall : B <br />Not bad grading.",
            "comment_workload": "Not much workload.<br />4 HWs that are excel-based and group-based.<br />1 mid term and 1 final.<br />Reasonable workload.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "D9an0J2AMiDqWzAIaPKCLlrbiEQbRtfU",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "antgod",
            "date": "Jun 04, 2021",
            "title": "",
            "comment_content": "Trading Securities<br />Risk and Return<br />Risk Aversion and Capital Allocation<br />Portfolio Theory<br />Capital Asset Pricing Model (CAPM)<br />Index Models<br />APT and Other Multi-factor Models<br />Portfolio Performance Evaluation<br />Efficient Markets Hypothesis<br />Behavioural Finance<br />Fixed‐Income Securities<br />Term Structure of Interest Rates<br />Managing Fixed‐Income Portfolios<br />Futures Markets<br />Options Markets<br />Options Valuation<br />The Dark Side of Finance",
            "comment_teaching": "Quite interesting.<br />Arouse my interest in Finance<br />He taught us some interview questions",
            "comment_grading": "No attendance<br />No In-class quiz this sem<br /><br />20% Homework Almost full<br />30% Mid-term 50 MCQ <br />172/200 (Mean: 157.33\tHigh: 196\tLow: 104)<br />50% Final Not disclosed 5 short questions 15 long questions<br />You can bring A4 cheat-sheet in both exams.<br /><br />The final exam is lengthy. <br />Final Grade: B+",
            "comment_workload": "4 homework <br />Done by group of 5.<br />Use excel formulae and analytical tools.<br />The final is cumulative.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XRRrfehYFd5zGKoLown1RAqeZ8nAKfr2",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kkarenwkw",
            "date": "Jan 17, 2021",
            "title": "",
            "comment_content": "This course studies the concepts and evidence relevant to the management of investment portfolios. Topics include diversification, asset allocation, portfolio optimization, factor models, the relation between risk and return, trading, passive (e.g., index-fund) and active (e.g., hedge-fund, long-short) strategies, mutual funds, performance evaluation, long-horizon investing and simulation.",
            "comment_teaching": "The prof was friendly and willing to teach. Yet, it may seem a bit boring at some time.",
            "comment_grading": "The grading was good.<br />There was no final, instead, an individual research project was given.",
            "comment_workload": "2 homework set and a midterm and a project",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KFbRk7gXHHLQnFBzzgu2E1eCzFC334gY",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "boi",
            "date": "Jul 25, 2020",
            "title": "Good Info BUT absolutely trash prof",
            "comment_content": "Good info, covers basic finance things like stocks, portfolio theories, bonds, margin selling/buying, market theories, options etc<br /><br />IF:<br />- You ARE a fina major: you'll be fine. You probably already know the course contents before even taking this course so you'll be fine.<br />- you ARE NOT a fina major: If you don't have a passion for finance or a naturally gifted, don't take this course out of interest. You're gonna get fked, especially by fking Utpal.",
            "comment_teaching": "THE WORST FINA PROF FOR THIS CLASS<br /><br />Horrible, just bad teaching and assessment methods. I learned more from a youtube video that this guy yapping away for a whole sem.<br /><br />He likes to throw out random quizzes that often test you on things he explained very a poorly about 2 mins earlier.<br /><br />GOOD CLASS, BAD PROF. -&gt; CHOOSE A DIFFERENT PROF or take it at your own risk.",
            "comment_grading": "Heavily focus on Midterm, Quizzes, and Final.<br /><br />Utpal likes to throw out an in-class quiz that's rarely even related to finance but it's hard. Very poor testing method.<br /><br />Midterm difficulty and grading is fair. Mean = B<br /><br />Final difficulty is much harder than expected. You must have a lot of experience with Finance or deeply understand the content to get even a B.<br /><br />Overall, the grading is fair, but Utpal fucks around with his in-class quizzes. Just avoid Utpal and choose a different prof if you want a better life.",
            "comment_workload": "Not bad. Homework is fairly easy and you can do it as a group.<br /><br />A LOT of studying needs to be done on your own though, if you want even a B.<br /><br />Learning how to trade stocks/bonds etc on your own will greatly increase your chances of an A as you'll understand the content more deeply and be able to do well on the Final exam which has many practical questions.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gOxvBf1cnk5AlFDutmNMe7mhxQZAXAv5",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Shawnnn",
            "date": "Jan 06, 2020",
            "title": "Good Professor, Tedious Grade",
            "comment_content": "The course offers you a guidance on how to invest based on CAPM and other advanced models. Just guidance. Don't count on it to offer you some practical solutions to earn much money. <br />You can design your own arbitrage strategy though, I mean, in the final exam paper. <br />Generally quite easy as long as you learn well in 2303.<br /><br />Topics:<br />Risk and return tradeoff <br />Securities Trading: Margin trading and short selling <br />Capital allocation to risky vs. risk-free investments;<br />Diversification and optimal risky portfolios; Long-horizon investing<br />Portfolio choice in MS Excel<br />CAPM: Theory and Practice<br />Alex Sharpe’s Case Study<br />Factor models &amp; No arbitrage pricing <br />Performance evaluation, Efficient markets Behavioural finance <br />Behavioural/New Data/Techniques-based trading strategies",
            "comment_teaching": "Excellent Professor. <br />He's probably one of the best professors in UST.<br />Not too much Indian accent, hilarious jokes, excellent ways to address his ideas and good teaching styles. <br />Kind and considerate, asking us whether catching up and glad to explain to you after class.",
            "comment_grading": "Typical FINA course. Tedious grading.<br />Two group homework (10%*2), one midterm (30%) and one final (50%).<br />The homework is not hard, and approximately every group gets the similar grade. Final not released. <br />Midterm: <br />Mean 74/83<br />Std 8<br />High 82/83<br /><br />Well, now you know how FINA this course is.",
            "comment_workload": "Not too heavy. <br />Homework is not too hard. Lecture video is recorded and uploaded. You can check the materials and learn by yourselves. <br />But do listen carefully as some points he mentions in class may show up in the exam.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OmE4R3Pyq192sWbTv3YvNlqjibxOK6yh",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Freeds",
            "date": "Jan 02, 2020",
            "title": "interesting course with light workload",
            "comment_content": "The course introduces some basic concepts of finance, covering the relation between risk and return, long-short trading strategies, diversification and portfolio management, CAPM, factor models, performance evaluation and behavioral finance. The contents are interesting, more intuitive rather than technical.",
            "comment_teaching": "I like the teaching style of the Prof very much. He gave a lot of examples to help us understand the concepts and always emphasized the intuition over details. He always made some interesting jokes during the class. You don't feel stressed when taking his course although you know your classmates are very good and its a very competitive course lol. He is very helpful if you reach him after class or by email.<br />The videos for every class are well recorded and notes are all well organized and uploaded, so no need to worry if you miss any class.",
            "comment_grading": "The grading is much better than I expected lol.<br />As I said, it's a very competitive course with most yr2 QFIN, FINA students and other more senior students enrolled in. The exam papers for midterm and final allow cheatsheets, and are all relatively easy, so the mean is very high. <br />FYR, the statistics for midterm:<br />mean: 79/83<br />std:2<br />I got 80 for midterm and full marks for two group homework (TA is very generous with this grading I think). I don't know my final score yet, but I got A+, so I guess the A range should be quite large.",
            "comment_workload": "Very very light.<br />There are only 2 group homework (each only takes about 1-2 hr), 1 midterm and 1 final in total.<br />The materials don't need much time to review if you understand well in class.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "c8VHxWgLU0reLkQgZL9Qf8t9g24ijp7w",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 895,
                    "name": "YU, Jialin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wclh",
            "date": "Aug 12, 2019",
            "title": "jialin gives good grades",
            "comment_content": "The content complicates things you learned in FINA2303 (i.e. CAPM) and building different portfolios, the course also includes some simple calculations in arbitrage cases and finding unknowns like alpha and beta in finance.",
            "comment_teaching": "quite boring, he spent a lot of time teaching out-syl stuff but he would tell you beforehand that those are not included in the exam so you can work on your own stuff if you are not interested.<br />but the good thing is that he would keep on repeating what he taught so you can certainly catch up if you miss out some points.",
            "comment_grading": "no attendance, no midterm<br />only one trading game, final exam and assignment will be calculated as part of your grade.<br />The trading game is just to simulate stock trading in the market, the class would be split into two halves: insiders and non-insiders, just don't do trading if you don't have insider's info then you will gain 5 points out of 100 for your total mark.<br />The final exam was 3hrs long, the time is more than sufficient and the paper is extremely similar to the past paper jialin uploaded for us to practice.<br />A double-sided A4 cheat sheet is allowed, both printed or handwritten version are ok",
            "comment_workload": "The workload is extremely light, only include two assignments.<br />The first assignment is done by excel and thomson reuters, can be easily finished by downloading the data and simple excel calculations if you understand and pay attention to what jialin taught up to that point.<br />The second assignment is really easy as he demonstrated the calculation once in class, you just need to copy and comprehend the in-class teaching, simply finding unknowns in the equations.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dOt4kf5jrSKlsjFofJ4AiROfDTD7mvqT",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 895,
                    "name": "YU, Jialin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "BYZ",
            "date": "May 31, 2019",
            "title": "Pretty good class to learn about investments!",
            "comment_content": "Week 1: Intro<br />Week 2-5: Optimal Portfolio<br />Week 7-11: Factors<br />Week 12-13: Bonds, Intro to derivatives<br /><br />He tells us there is two major hurdles for the semester. One of them is how to choose individual stocks and the other is how to construct an optimal portfolio with those stocks.",
            "comment_teaching": "Very relaxing because he goes off on tangents when explaining concepts. Therefore, sometimes we take 3 classes just to finish one lecture. Pretty organized just because of how investment as a concept is. Pretty clear that we talk about individual securities and then portfolios. However, a lot of what he talks about will not be on the exam, he will tell you this though.",
            "comment_grading": "The trading game grade is very hit or miss because it depends on what everyone else in the class. However, it does simulate an actual stock exchange. You have to get top $ amount in the trading game if you want full marks. I got 5.6/5.6 for the trading game. We only had two homework assignments. I got 10/10 for both. Find good groupmates for the homework and you will do well! For the final I am not sure what I got. I probably did pretty average. I end up with an A- in the class. Grading is definitely a little strict but he did not tell us how he graded so I do not know either. Trading game is 5%, homework is 35%, final exam is 60%.",
            "comment_workload": "This class has very minimal workload. He is very relaxed and only assigned 2 homework assignments for the whole 13 weeks. There is also no need to prepare for the trading game because it is hard to prepare for. There is also no midterm. You can just study the slides for the final.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WSf886VYA9WumAgi5vskEFJmlkUSh23l",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MW",
            "date": "Jan 06, 2019",
            "title": "",
            "comment_content": "This course talks about basic idea of CAPM and portfolios diversification. Prof. also demonstrate Excel for use in finance. The latter part of the course will be different with other prof. Prof. Abhiroop will focus on behavioral finance where you can learn quite a lot of psychological theory.",
            "comment_teaching": "Very clear explanation. The lecture will be recorded. It's really enjoyable becoz Prof. will share some interesting events in the past financial history.",
            "comment_grading": "Two assignments: 40%<br />Mid-term: 30%<br />Final exam: 30%<br /><br />Assignments and midterm exam are very easy. Basically, everyone gets full marks. Your grade really depends on the final exam a lots.",
            "comment_workload": "Only two assignments<br />One Mid-term<br />One final exam<br />Very light workload and TWO cheat sheet is allowed in exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aUkLq7geLl06noSs73uW5TnKMICSnZZA",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "PPBBB",
            "date": "Jun 07, 2018",
            "title": "A Funny Professor",
            "comment_content": "A few numbers of topics but requires deep understanding for each one:<br /><br />Risk and return trade-off<br />Securities trading<br />Capital allocation<br />CAPM<br />Factor model <br />Behavioral Finance<br /><br />This course also taught Reuters, many excel applications, Alex Sharpe's case study which were not covered in the exams",
            "comment_teaching": "One very important point is that he speaks very clearly when we compared to another professor. He cared about how we learn instead of what we learn. If we have questions, he would answer them in a way that makes us understand.",
            "comment_grading": "The grading scheme is as follow:<br />2 Homework (group) 40% (each of them is 20%)<br />midterm 30%<br />Final 30%<br />This is a finance course and the competition is very intense. You could expect that the mean of midterm could be 37/40, and the mean of the homework could be 18 or 19/ 20.",
            "comment_workload": "Not that much. Only 1 midterm, 1 final and 2 homework (very easy to score 100%) <br />No attendance was counted and lecture videos were posted on canvas.<br />For both examinations, two cheat sheets were allowed.<br />A comprehensive final examination that covered all materials. Midterm is relatively easier than the final exam.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NEmGkvsN8L2akGGCWfgWhg5GIo59QRJn",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "null",
            "date": "Jun 04, 2018",
            "title": "",
            "comment_content": "The course deliver the basic finance materials to us, such as portfolio risk, minimum variance frontier and CAPM.",
            "comment_teaching": "His teaching is very good. In spite of a little bit of Indian accent, he make sure that we all can learn something from this courses. He spent a significant amount of time on staff that are not covered in exam but useful in our future when we go to work. If you miss a lesson, you can still watch lecture video at home.",
            "comment_grading": "The grading is ok and fair. my midterm got below mean and final don't know what did i get. But turn out my grade is B. Because this prof's exam and midterm paper are very very very easy, the mean and median is extremely high, its very easy to get below mean...",
            "comment_workload": "The workload is very light. I studied only before midterm and final. There are only two hw through out the semester. The hw is group work. And that's all, no more other staff. So, many students forget they are taking this course in the middle of the semester.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "z4bKLKNuDKHlrJmUFdjT47EMxfYpchGR",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "imoj",
            "date": "May 31, 2018",
            "title": "super cute professor",
            "comment_content": "what u v leant in 2303+some behavioural finance + trading strategies",
            "comment_teaching": "The professor is the highlight of this course as he's so fun, friendly and cute.<br />Very warm style and answer questions patiently even if stupid ones.<br />And he will remember your face and say hi to you every time he sees you even if you never answer questions in the class.<br />In summary he skyrocket the average cute level of fina dept professors i guess. Take fina/qfin majors, professors are so nice!",
            "comment_grading": "Good grade compared to the efforts you put in. <br />I saw comments saying that someone got the midterm from last year. Orz I even don't know that..... I got mark deducted in midterm but got full mark in homework.<br />final exam mark wasn't released so idk how i did in that.<br />Overal grade A, but i guess a little difference in midterm/ final can result in the difference in a sub grade! cuz homework is too easy and mean is almost full mark so exams matter.",
            "comment_workload": "Much lighter than 2303 you have no MFL congratulations :)<br />and only 2 hw for a semester.<br />the exams are not hard either, the main point is , the professor allow 4 sided cheatsheet, can u imagine that? u basically can put everything on that n not need to memorise....",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FE0tPOWsjLd6Oy760kpN3EPNEVgx9CNa",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rickey_JR",
            "date": "Jan 05, 2022",
            "title": "I love Utpal",
            "comment_content": "The content is well designed and similar for all sections<br />But Utpal added some of his own stuff: behavior finance, dark side of finance, etc<br /><br />The textbook is not that neccesary",
            "comment_teaching": "Pretty good in teaching<br />He is clear and intuitive<br /><br />I sent an email to thank Utpal for his kind teaching after the semester ends<br /><br />He told me he got COVID and is currently in hospital<br /><br />Hope he could do fine (so sad",
            "comment_grading": "Utpal said it is a bit hard to get A in his class, pretty true<br />But as long as you work hard and understand the concept, you would not get a bad grade.<br /><br />Midterm: 164/200 above mean 0.5sd<br />Final: 372.5/400 (After checking with TA)<br /><br />Overall about 91<br /><br />Final grade A",
            "comment_workload": "As my major course, I think the workload is acceptable<br /><br />But the pace of the course is quite frustrating<br /><br />Utpal cover a new topic every lecture, meaning there quite a lot content covered in the lecture<br /><br />Utpal did not provide much practice question, so just go through his PowerPoint and you would be fine for the exam",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "G0oi08jzivn9sE7CcHFK0V7h55yx26zQ",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1299,
                    "name": "SAK, Halis",
                    "rating": 1
                },
                {
                    "id": 254,
                    "name": "YIP, Victor Chi Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wolfheart",
            "date": "Jul 11, 2021",
            "title": "It's pretty much a Russian roulette with grades",
            "comment_content": "Didn't really learn anything from this course. Studied the lecture notes during the weekend before midterm. After the midterm, you don't learn anything. Maybe study the Factor Models on your own for the group project, but there's no incentive to study otherwise. No final, just a very annoying group project with 4 people – Halis will allow you to choose across multiple sections, in this semester he taught two lectures.<br /><br />1. Introduction<br />2. Risk and return tradeoff<br />3. Securities Trading: Margin Trading and Short Selling <br />4. Capital Allocation to Risky vs. Risk-free Investments;<br />5. Diversification and Optimal Risky Portfolios; Long-horizon Investing <br />6. Portfolio Choice in MS Excel<br />7. CAPM: Theory and Practice<br />--Midterm--<br />8. Alex Sharpe’s Case Study, bring your laptop to the lecture!<br />9. Factor Models <br />10. Performance Evaluation <br />11. Efficient Markets <br />12. Behavioral Finance<br />13. Behavioral / Techniques-based Trading Strategies &amp; FinTech Analytics",
            "comment_teaching": "Thank heavens for no required attendance. I just watch the lecture recordings on 1.5x speed. However, for others, it's worth totally skipping especially after the midterm.<br /><br />Halis' teaching is quite messy. Instead of being straightforward with the slides, he would go back and forth between a few slides that are the bulk of the lecture. He was also quite repetitive and it's easy to get distracted or fall asleep.",
            "comment_grading": "Assessments:<br />[21%] 3 Individual Homeworks (mean: 6.72%, 6.75%, 6.46%)<br />[14%] 2 Group Homeworks (mean: 6.64%, 6.81%)<br />[30%] Midterm (mean: 91.17/98)<br />[35%] Group Project (undisclosed)<br /><br />My Scores:<br />Full homework<br />Full midterm<br />Probably favorable peer review<br /><br />Final Score: A<br /><br />Even if it's a nice score, don't be deceived. If you're careless in midterm, it will cost you because you cannot rely on the 35% group project. It is a pain in the a** that everyone procrastinates during the last two weeks of the course. The assessment was poorly designed and in my opinion, peer evaluation is everything. The peer evaluation is unique, in that it asks you to rank your teammates' contribution (excluding yourself), from 1st, 2nd, and 3rd. Luckily, I was active in my group so I assume I received a series of 1sts. Group project scores were also undisclosed, so the lack of transparency is another slap to the face.",
            "comment_workload": "Besides assignments once every two weeks and the midterm during the first half, the workload is generally light. It is the last two weeks of the course that are hell. You have two group assignments and the poorly designed Group Project to procrastinate. Groupings are finalized a month after the course starts, then no exemplar is given for the Group Project. You are just expected to construct anywhere from a 20-40 page report. Friends who have asked the professor for guidance or inputs on their ideas for the essay were just told to freely do whatever they wanted. Finally, the professor gave in two weeks before the Group Project was due, and uploaded a 50-page thesis his PG student did for 4 years. And yes, we had two weeks left to do something similar. That's not all. The two outputs for Group Project are a report (28%) and presentation (7%) - our report was 27 pages long and the presentation had to be 20 minutes long. For the presentation, you have two options of recording it or presenting in class, and we did the former because you can retake the video. Piece of advice - if you're forced into Halis' class, choose the right groupmates to suffer with you because we filmed on the day that it was due.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "mT1sCBILZkgQf9ncTZbiXP8Iys0vVsnV",
                    "name": "Halis Sak FINA 3103 Syllabus Spring 2020_21",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "xstXpXIOiBD4jZDADeZ437JT27y6hLNW",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hi_everyone",
            "date": "Jan 20, 2022",
            "title": "Knowledgeable peofessor, good content",
            "comment_content": "If you study on Utpal's class, the content covered will be around double of other classes.<br />For Utpal,<br />Before midterm:<br />margin and short selling<br />risk aversion<br />Efficient frontier<br />Portfolio theory <br />CAPM<br />single index model<br />arbitrage pricing theory<br />After midterm:<br />fund performance evaluation <br />efficient market hypothesis <br />behavioral finance<br />bonds <br />futures <br />options<br />dark side of finance",
            "comment_teaching": "Very knowledgeable professor, able to deliver the content clearly.<br /><br />Utpal will also mention some finance interview questions, which is very helpful and insightful.",
            "comment_grading": "Average grading , need to compete with Qfin guys during the fall semester.",
            "comment_workload": "4 assignments, require quite a lot of calculations, good excel skills can help a lot.<br /><br />But you need to pay a certain amount of time to review the lecture content as the pace of teaching for Utpal is very fast.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "79D3gjb11W64eEjWik49U7TRTXGnMcjw",
            "semester": "2019-20 Spring",
            "instructors": [],
            "is_author": false,
            "author": "John1111",
            "date": "Sep 08, 2020",
            "title": "",
            "comment_content": "The course included some financial model to evaluate the stock, such as CAPM,APT. Also, the course captured how to form a portfolio, including the allocation of the asset.",
            "comment_teaching": "GOOD, Professor explains clearly. But The content is hard for beginners.",
            "comment_grading": "The average is extremely high for all assignment and other examinations.",
            "comment_workload": "Adequate, have a few group project. The rating for midterm and final is essential. Since this course is not cumulative, the final will cover the whole semester chapter, so it is quite difficult to get familiar with all the chapter.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xxIcUYQLODIkPCrFJPJ4YPAW5H30STyq",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "agatha",
            "date": "Jun 04, 2020",
            "title": "",
            "comment_content": "- Trading securities<br />- Risk and Capital Allocation<br />- Portfolio Theory<br />- CAPM<br />- APT and Multi-Factor Models<br />- Performance Evaluation Metrics<br />- Market Efficiency Hypothesis<br />- Behavioral Finance<br />- Fixed Income Securities<br />- Futures<br />- Options",
            "comment_teaching": "Utpal is not that disastrous. Tho I must say his handwriting and notes are really messy and it is very hard to read so that hinders understanding. But don't worry about the notes that you cannot understand and those he didn't spend a lot of time explaining. Just focus on those he kept repeating in the review session. He explains events that happened recently and it's interesting although they are not related to course content.",
            "comment_grading": "Very good. <br />- In-class quizzes: 20%<br />- Assignment: 20%<br />- Midterm: 20%<br />Moderately difficult but not challenging. Quizzes questions are randomized for every student (because of online exams) and you must finish the questions one by one. That's unfair for those who got difficult questions first but the overall difficulty is fine. Calculations are straightforward and only MCQ and fill in the blanks. <br /><br />- Final: 40%<br />More challenging than the midterm but it tests you on how many questions you can finish rather than how much you really understand.&nbsp;&nbsp;That means you have to understand the concept really well as time won't allow you to think about them carefully. It's not that hard as I expected and mostly it's calculation rather than actually explaining the concepts. Plan your time well and don't worry if you can't finish, no one can. Finish the questions as many as possible and you'll get a decent grade.",
            "comment_workload": "- In-class quizzes<br />If you are a slow learner like me, this will definitely stress you out as Utpal tests you immediately right after each class and personally I found the questions a bit harder than the midterm. <br /><br />- Assignments x4<br />Tests you on excel skills more than understanding of course content. It's a group project so you can rely on your groupmates. <br /><br />- Midterm and Final<br />Make sure you understand everything. As for final, it's cumulative so start early.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pbxwoRzb9C0PQX8uNxaWMYUMpV4lR57e",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kabul",
            "date": "May 25, 2020",
            "title": "Difficult but practical",
            "comment_content": "A very hand-on, practical and well structured course to enhance our understanding on investment and the financial market.<br /><br />🔷 Trading securities<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Margin Buying<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Short Selling<br />🔷 Risk and Capital Allocation<br />🔷 Portfolio Theory (Markowitz)<br />🔷 CAPM (Sharpe)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Single-Index Model<br />🔷 APT and Multi-Factor Models<br />🔷 Performance Evaluation Metrics<br />🔷 Market Efficiency Hypothesis<br />🔷 Behavioral Finance<br />🔷 Fixed Income Securities<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Term Structure<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Yield Curves<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Duration and Bond Immunization<br />🔷 Futures<br />🔷 Options<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Binomial Option Pricing Model<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Black-Scholes Model<br /><br />Lots of content on investment portfolios and marketable securities. Among these topics, fixed income securities and options are the most difficult. I need a lot of time to digest the content on these topics. BTW don't forget what you've learned in the statistics class. Make sure you've a good foundation in Excel skills, e.g. how to run a regression analysis in Excel.<br /><br />The derivative class will cover more on futures and options. So it's crucial to get a good foundation here first.",
            "comment_teaching": "Not so sure why so many students bitch about Utpal's teaching...<br /><br />I personally think he's phenomenal. He's very practical, not mathematically oriented, and good at explaining big-picture stuff. However, his pace is pretty fast and you need to be smart enough to decipher what he delivers in the lectures.<br /><br />He has an in-class quiz every lecture to help us consolidate what we've just learned. Some of the quizzes are easy, but most of them are difficult. You really need to be fast learners to re-synthesize content that is just taught 5 or 10 minutes ago. I myself scored 0 a couple of times in the quizzes.<br /><br />The polling in the beginning of the lectures is really inspiring. Most of the time it is related to current news and some common sense in the financial market. Even though it isn't a part of the exams, it's useful knowledge that really lets you shine in your interviews. 😉<br /><br />Some said he had an accent. He does, but I don't think it's serious. I've seen a lot other professors with way worse accents than his.<br /><br />BTW Utpal bragged on the Canvas page, &quot;the best B school professor in the world&quot;. That's indeed a bit too cocky...😂<br /><br />最後 attach 張 r 嘅潦草寫法...<br />（求其網上搵）<br />唔好再話認唔到 r 同 n🙈",
            "comment_grading": "💻 20% Group Assignments<br />💻 20% In-Class Quizzes<br />✏️ 20% Midterm Exam<br />✏️ 40% Final Exam<br /><br />✏️ Midterm<br />50 multiple choice questions conducted on Canvas. It covered up to APT &amp; multi-factor models. It was moderately difficult, but most people did really well.<br />Mean = 41.15/50, SD = 4.75. I got 44/50.<br /><br />✏️ Final<br />A comprehensive 2-hour exam consisting of 20 questions, each with a few sub-questions. 5 questions were done directly on Canvas, whereas the remaining questions required answers written on pieces of A4 paper and we took photos of them after completion. It was super hectic and I didn't have enough time to finish the paper.<br /><br />Both were closed-book exams except that 1 piece of A4 double-sided cheat-sheet was allowed.<br /><br />Applied for P/F, and got a pass grade at the end. Cannot really gauge the grading. I tried emailing the TA Kelly asking about my original grade but Kelly said she wasn't allowed to release that. ☹️",
            "comment_workload": "Pretty light compared to other 3000-level courses.<br /><br />The 4 group assignments may take a little time if you aren't familiar with Excel. They are more practical and related to real-world problems, e.g. running regressions to confirm whether the results are in line with the model prediction. Interestingly, most of the time the answer is a big &quot;no&quot;, so it shows the limitations of the models we've learned in class. Anyway, the skill-set to identify which model to use, which evaluation metric to stick onto, and to back-check the model validity is more important than learning the models themselves. Know how to do is a computer thing, but know what to do needs human brain power.<br /><br />Strictly speaking though, we aren't really there yet as in the real world it involves grabbing information and identifying problems by ourselves. In the assignments all these are already done by the TA before they are released to us.<br /><br />Overall workload manageable even if you do the assignments alone - each assignment only takes around 1 or 2 hours. That's why our group ended up just doing them individually and cross-checking our answers at the end. And I believe most of the groups can get perfect score for all 4 assignments except for a few outlier groups.<br /><br />BTW try to familiarize yourself with Excel when you have the chance (esp if you find yourself using a hell lot of time in the assignments). If you don't know how to use basic functions such as Goal Seek, Excel Solver, etc, spend some time understanding them. In the workplace you can't say, &quot;I'm not gonna spend time analyzing thousands of stocks using Excel&quot;. You just HAVE to, not to mention our TA has already done some preparatory work in the Excel file and we aren't even starting from the raw data.<br /><br />Preparation for the exams should be manageable. Utpal provides a number of key questions from the textbooks in the revision session and I find going though them good enough for the exams. But again make sure that you budget your time carefully and don't get stuck at 1 particular question.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 4,
            "attachments": [
                {
                    "key": "YW4vYDyjTMsACzB58ZCiqltFNvYmu7Gg",
                    "name": "r 嘅潦草",
                    "format": "jpg"
                }
            ]
        },
        {
            "hash": "Pkt1ZHJXYQxwdtU28LjPLpjPVu3ftTZB",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ep",
            "date": "Aug 21, 2019",
            "title": "Good teaching and course material, Moderate difficulty and statistical/numerical exams",
            "comment_content": "Covers pretty much most part of introductory financial investments material including equity, fixed income portfolio management, etc. Requires some very basic knowledge on finance and statistics.",
            "comment_teaching": "Teaching covers all the basic concepts that you need to know. Moderate pace and relatively fun classes. Watch out for being late and doing push-ups though.",
            "comment_grading": "Pretty difficult to obtain high scores in the assignments as the score margin is pretty high, however with a lot of practice on statistics and the mathematical part of the course, it is do-able.",
            "comment_workload": "Relatively low overall, the course does not require you to do much assignments, and there is not too much material you need to know for the exams.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "gP7htf0h4cOuOfJuV8Q3XBVubxmTlm9S",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rubbishstudent",
            "date": "May 26, 2018",
            "title": "interesting but tough",
            "comment_content": "The topics are extremely interesting which gave you a brief overview of the basic of finance<br /><br />Before midterm:<br />overview of finance <br />CAPM <br />Arbitrage<br />Single and multfactor model&nbsp;&nbsp;<br /><br />After midterm:<br />Behavioural finance <br />Fixed income <br />Derivatives <br /><br />The contents are more than the other classes, they stopped by behavioural finance.",
            "comment_teaching": "Professor teaching is extremely clear and easy to follow. The lectures notes are clear with a well balance of verbal explanation and numerical example.",
            "comment_grading": "The grading is a bit tough given that it is a FINA course haha. <br /><br />The mean for midterm is around 80% with 50 multiple questions. You have to complete it in 70 minutes so make sure you be aware of the time limit. The questions are relatively easier. <br /><br />The final exam is really hard. There are 20 long questions and you have to finish it in 120 minutes. I guess no one is able to finish the paper at all. The mean is around 68% and it is cumulative. Both exams allow 2 pages of cheatsheet. <br /><br />For my grades, <br />participation (best 20 out of 25 quiz, 20%): &gt;98%<br />Assignment (20%): &gt;98%<br />Midterm(20%): &gt;95<br />Final(40%): &gt;80 <br />Overall: A-",
            "comment_workload": "You have to complete 4 assignments throughout the term. All of them are in a group of 5-6 and you can pick your own groupmates. Many of them requires the use of excel and the work done is not that related to the exam questions.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 13,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "DNgJ62VJoosMSGhhrwahupdS1cdyjAag",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 812,
                    "name": "BHATTACHARYA, Utpal",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YEEEboi",
            "date": "Jan 14, 2019",
            "title": "Introductory but practical",
            "comment_content": "This course provides broad knowledge for the introductory of finances and later focuses on some fundamentals of portfolio management.",
            "comment_teaching": "I personally enjoyed Uptal's style of teaching. He was passionate and certainly answers most of the students' questions. What I enjoyed the most was his teaching materials though, they were quite practical and useful in many aspects. Furthermore, the assignments often involved part of industry practices.",
            "comment_grading": "4 projects 20%<br />24 quizzes 20%<br />midterm 20%<br />final 40%<br /><br />Though the grading of Uptal was considered &quot;tough,&quot; I personally believe it was actually not as bad as I expected, rather quite good actually.",
            "comment_workload": "Workload was quite easy.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 10,
            "voted": false,
            "is_upvote": false,
            "comment_count": 4,
            "attachments": []
        },
        {
            "hash": "ktbKooEkmmWUSacyIEB7r2gR9Zak1QTX",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 981,
                    "name": "MUKHERJEE, Abhiroop",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "NINETEEN",
            "date": "Jan 02, 2020",
            "title": "NO PAPER CHECKING",
            "comment_content": "Well, before the cancellation of all classes, all contents were great. They were both practical and in-depth. However, after the announcement of cancelling class, the videotape becomes the major sources of contents. And those tapes definitely weren't enough.",
            "comment_teaching": "I think it's good.<br />The professor said at the first class :&quot;I won't take attendance because I believe my class is attractive enough&quot; and he surely was.<br />Patient professor with great humour, love it.",
            "comment_grading": "Ahh, the things I think went out of control this sem.<br />They even didn't dare to let us check our paper, because apparently the final is the only determining component of your grade and they didn't plan it well.<br />I got full scores for everything except final, ended up in A. No paper checking and no grading details. I really thought I could get an A+. <br /><br />Not scientific nor transparent at all, worst I have ever seen.&nbsp;&nbsp;Given the current situation, this is not anyone's fault but hurt still.",
            "comment_workload": "pretty lenient.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}