{
    "error": false,
    "course": {
        "id": 424,
        "subject": "FINA",
        "code": "1203",
        "name": "Personal Finance",
        "description": "This course provides a broad perspective on personal finance. It highlights the importance of setting goals, and making good use of financial resources to meet financial obligations in the course of one’s lifetime. Following a comprehensive and step-by-step guide, students will gain skills and knowledge on how to make informed and effective decisions to achieve their financial goals. While various tools and techniques are covered, the emphasis is on the intuition, logic and fundamental principles that underlie their uses. The course also provides hands-on practice for students to prepare their financial information and assess their financial health. With basic math skills, students can formulate financial management strategies that deal with their cash, credit and debt choices as well as housing decisions. They will gain an understanding of the risk-return tradeoff, and the protection from insurance. Moreover, they will learn how to evaluate investments to accumulate wealth for the long term.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"FINA\" data-code=\"2203\" href=\"/review/FINA2203\" target=\"_blank\">FINA 2203</a>, <a class=\"course-link\" data-subject=\"FINA\" data-code=\"2303\" href=\"/review/FINA2303\" target=\"_blank\">FINA 2303</a>",
        "rating_content": 4.34,
        "rating_teaching": 4.21,
        "rating_grading": 4.21,
        "rating_workload": 3.93,
        "review_count": 29,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 237,
                "name": "PI, Lynn",
                "count": 28
            }
        ]
    },
    "reviews": [
        {
            "hash": "2AfI65a3CYIb2ys3TDTG8Vti1ehoVz2p",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Xmas",
            "date": "Jan 11, 2016",
            "title": "Good grade but need hard work",
            "comment_content": "As followings.<br /><br />Part I: Planning &amp; Budgeting<br />- Personal Finance Basics<br />- Time Value of Money<br />- Budgeting and Planning<br /><br />Part II: Credit Management<br />- Consumer Credit<br />- Home Loans<br /><br />Part III: Investing<br />- Investment Fundamentals<br />- Risk and Return Trade-off<br />- Investing in ETFs and Mutual Funds<br />- Retirement Planning and MPF<br />- Investing in Stocks<br />- Investing in Bonds<br /><br />Part IV: Tax and Protection<br />- Tax Management<br />- Life Insurance<br /><br />Quite useful for MPF, as it is an important issue after you graduate.",
            "comment_teaching": "Feels like a secondary school teacher...<br />Talks a lot but her voice cannot make you so focus. I fall asleep for sometimes.<br />Anyway, she will quite talk so much details for the powerpoints, which is a good thing if you attend lectures, you can learn a lot (while it might appear in the exams as well) from that.",
            "comment_grading": "Okay. I think is still count as a &quot;good grade&quot; course in UST.<br /><br />My mid term, individual project and group project all above around 1sd, final 87/100 (I guess above around 1 sd too?) <br />Finally got an A. <br /><br />I guess mean around B.",
            "comment_workload": "Stating from the heaviest workload part to the lightest.<br /><br />The heaviest part is that you have to get some cards for participation. Also, you have to do some little exercise in EVERY lesson (count participation as well), so attending every lesson is the MOST CHALLENGING and MOST HEAVIEST workload in my opinion.<br /><br />Second heaviest is the group project. IT REALLY DEPENDS ON YOUR GROUPMATES. If you are assigned with some good groupmates (forgot to mention, professor will assign your group RANDOMLY, you cannot ensure that you will be the same group with your friend), my group have some freeriders and I have to check ALL THE WORK at the night before I hand in. I check the 10-page work for 4 hours, it drives me crazy.<br /><br />Final exam. Although not-cumulative, but still there are lots of things to remember after the mid terms. Like the way that we can invest, how many orders we can place for buying shares etc... Final exam with 78 multiple choices drove me crazy (56 concepts MC, 22 calculation MC)<br /><br />Mid terms. If you have studied BAFS in secondary school, it should be ok cause most of the topics are related to time value of money.<br /><br />Individual project is ok, just some simple calculation (like compound interest) to show your goals in different life stages. I got 96 out of 100 marks (someone got 100 -_-). Mean 80 S.D. 12 as I remember.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YSXxuJ1n4RETHVnoChqDjAkqer9RZQLV",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chimz",
            "date": "Oct 24, 2015",
            "title": "真心係好grade",
            "comment_content": "It includes time value of money, budgeting, consumer credits, home loans, stock market...<br /><br />Good Maths skills prefered since some calculation requires advanced level of maths, i.e. Geometric Sequence. But it's not too hard. Practice is really important",
            "comment_teaching": "Prof Pi is really nice. Good atmosphere. People there are very active. They raise hands answering question for bonus cards. TA (Mr. Victor Yip) is really nice. He will answer your question concerning the course, exams patiently.",
            "comment_grading": "Mid term exam <br />mean: 80.97, s.d. 8.55<br /><br />Final: no info<br /><br />My case:<br />Individual Assignment ~+1s.d.<br />Group Assignment: 90/100<br />Mid-term = mean<br />Final: 69/100 (probably ~-1s.d.)<br />--&gt; B<br /><br />good grading",
            "comment_workload": "Class participation 15% (check by activity sheet, TAPPS [if you did 90% of classwork, you would score 11 points out of 15] 4 points for bonus card. 1 bonus card contains 1 point.)<br /><br />2 individual assignment (9%+1%)<br />1 group assignment (adjusted by peer evaluation) 10%<br />Midterm exam 30%<br />Final exam 35%<br /><br />Remember to attend every lesson after the add/drop period. TA will take attendance individually. It is easy to spot who doesn't come as we are divided into groups. Workload is light. 1 piece of individual assignment in Week 5 and 1 group assignment by the end of semester. <br /><br />Getting bonus card is really important now. Because people are so active that basically everyone has got at least one card in week 8. By the end of the term, people commonly have 2-3 cards. So try to get as many as you can.<br /><br />I spent only 4 hours to study and reached mean in the midterm and final exams.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Gs0mAjjtHLgzYpzLlVCGc0JjXLeAlZwx",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mkma",
            "date": "Aug 23, 2015",
            "title": "",
            "comment_content": "This is an introductory course for anyone interested in Finance to take. The content includes time value of money, bonds, stocks, loans, funds, and tax. The topics are broad yet quite easy to follow and understand.",
            "comment_teaching": "Professor and her TA are very friendly. They will answer your questions in detail. The teaching is also quite good that the ppt slides are clear and good for revision.",
            "comment_grading": "Class Participation 15% <br />Individual Assignment (1) 10% <br />Group Assignment (1) 10% <br />Midterm Exam 30% <br />Final Exam 35% <br />100%<br />If you attend every lecture, you don’t need to answer questions for bonus cards (for you to skip class)",
            "comment_workload": "Only one individual assignment and one group assignment. The individual one is about your financial planning and the group one is to compare the prices of housing in HK.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "z6t16NAvkLg7ZATiD7DrWlsEG1Zr2ZNi",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MM",
            "date": "Jul 14, 2016",
            "title": "The best FINA course you should take.",
            "comment_content": "Part I Planning and Budgeting <br />1 Personal finance basics <br />2 Time value of money <br />3 Budgeting and planning <br />Part II Credit Management <br />4 Consumer credit <br />5 Home loans Part III Investing <br />6 Risk and return trade-off <br />7 Investment fundamentals <br />8 Investing in ETFs and Mutual Funds <br />9 Retirement planning and MPF <br />10 Investing in stocks <br />11 Investing in bonds<br /><br />Part IV Tax and Protection <br />12 Tax management <br />13 Health and life insurance<br /><br />This course provides a broad perspective on personal finance.&nbsp;&nbsp;It highlights the importance of setting goals, and making good use of financial resources to meet financial obligations in the course of one’s lifetime.",
            "comment_teaching": "Personally I think this course is very useful for all student, especially SBM students who wish to declare major in FINA, as around 30% to 40% of the FINA 2303 materials will be covered in this course. Actually for the calculation and concept part of Time value of money and bond, PL Lynn teaches quite well and clear compared to FINA 2303.<br /><br />Pl Lynn is a good prof. She teaches very clear and nice. I really enjoy coming to her lesson.",
            "comment_grading": "Assessment<br />Class Participation&nbsp;&nbsp;15%&nbsp;&nbsp;<br />Individual Assignment (2) 12% <br />Group Assignment (1)&nbsp;&nbsp;&nbsp;8%&nbsp;&nbsp;<br />Midterm Exam&nbsp;&nbsp;&nbsp;30%&nbsp;&nbsp;<br />Final Exam&nbsp;&nbsp;&nbsp;35%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br /><br />Very GOOD Grading!!!<br />Class Participation<br />In the class you will need to answer 4 questions and get 4 cards to get all the class participation. Pl Lynn will ask numerous very simple questions in class and it is very very easy to get all points. <br /><br />Individual Assignment <br />There are two Individual Assignment in the course, the first one would ask you to set goals and plan for your future, like monthly saving you need to achieve your goals. The second one is optional, for me, I scored 95% for the first HW (Mean ard 85%), there is no reason for me to do the second one. But the second one is a little bit complicated which required you to do more calculations about home mortgage. But the grading of both HW are not straight, you will be fine if you have clear, clean and reasonable answer.&nbsp;&nbsp;<br /><br />I scored 95% for the first HW. (Above mean ard 1SD)<br /><br />Group Assignment<br />The group assignment is focus on HK MPF, it asked you to do comparison of different schemes available in the market. It is easy for you to get sample from your &quot;friends&quot;, so actually not too difficult to complete it. For me, we didn't even meet up to discuss and complete every through whatsapp and gdrive. <br /><br />Our Gp not doing very well in the project, many gps got &gt;90%, we get only 80%. (I think below mean a little bit)<br /><br />Midterm<br />Midterm covered first two topics, which are not difficult. All MCs questions and you should feel easily if you study, especially for those good at maths. Many questions are repeated and just the number are different.<br /><br />I scored &gt;90%. (above mean ard 1 SD)<br /><br />Final exam<br />Final are not cumulative, include topics after midterm. Like midterm, all MCs questions which are not difficult. Actually no information about the result, but I think i scored above mean 1 SD.<br /><br />Overall i got A+, which is very good grade and I am not expected. Personally, i think group project didn't matter much, as long as you get all class participation and do revision, you will be fine.",
            "comment_workload": "Not to heavy, quite light actually.<br />The individual homework is not difficult, you can finish it by one day. For the group work, you can refer to sample works and modify it. So not too heavy when dividing the workloads. Exam is not difficult, just do revision few day to a week, you will get very good result.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "c1BqVNDyhqW9SnQdi6v7rIqGn3sY1Qsk",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "legendarychriz",
            "date": "May 13, 2016",
            "title": "Easy Course make things difficult",
            "comment_content": "Extremely useful course. It discuss about the time value of money, investment basics, types of investment tools, and concepts for manage your personal finance.<br />This is a course which should be made compulsory rather than that useless HUMA1000. It may not only help your grades, but also your life in future.",
            "comment_teaching": "Professor is nice, willing to answer questions, and explain the concepts clearly. She encourages us to read the textbook as a reference.",
            "comment_grading": "Need to present in each lesson so that you don't need to get bonus cards to compensate for your missed attendance.<br />Bonus cards are required to get 4, in order to attain a full score at attendance.<br />Class Participation is 15%<br />Risk Profile 1%<br />Assignment 9% <br />There are two assignments, recommend to do two in case to secure a high score. First assignment is about goals, and setting up long-term, intermediate term and short-term financial goals.<br />Second assignment is to use an app to monitor your daily spending, and analyze your spending habits. <br />1st Assignment 66/100 mean: 75/100<br />2nd assignment: 82/100 mean: 83/100<br /><br />A group assignment is about setting a MPF plan, and choosing the scheme and fund you are interested in.<br />Group Assignment: 70/100 mean 81/100 s.d. 6.8<br /><br />Midterm Exam : 30% <br />score: 75/100 mean:77/100 s.d.:11<br />Final Exam: 35%<br /><br />Exam questions are easy, and people are doing very good, making this course being difficult, mean is usually at least 75. Questions in exam are tricky.<br />Hard work is not guaranteed a good grade, but not working hard will probably receive C range and D.<br /><br />There are some bonus such as doing addition tasks, or getting more bonus cards, but these are not too important.<br /><br />Grade: B-<br />Assume everything is below mean",
            "comment_workload": "Most of the workload is from revising. You need to revise a lot so as to get a satisfactory result. Concepts are relatively important as it not only helps conceptual questions but also the calculation questions.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "z974LXDlepRJ98CZF0AuOblF35Xhvnl2",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": ":]",
            "date": "Jan 26, 2016",
            "title": "Pretty useful course",
            "comment_content": "The content is quite useful for students who are not from business school, but it's really elementary, you probably can learn all these stuffs from materials online. And it's hard to figure out what's going to be on exam, you have to remember a lot of details from the book.",
            "comment_teaching": "The teaching is quite boring and tedious actually, it's hard to focus on what instructor says. But it still takes attendance, I got late a lot lol.",
            "comment_grading": "Individual Assignment 96 above 1 sd+<br />Group Assignment 86 or 87 (I forgot the sd and mean)<br />Midterm 86 above 0.6 sd<br />Final 80 (I forgot the sd and the mean)<br />2 bonus cards<br />I got B+",
            "comment_workload": "2 Individual Assignments (You can skip one if you're doing good on the first one)<br />1 Group Assignment (about MPF, you can take a lot of advantages if you have an MPF account)<br />Midterm and Final are not cumulative.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "L7Htl5N8A3zkjKKUXcqVSlPhmSSwundQ",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LEE Ha Young",
            "date": "Sep 04, 2017",
            "title": "FINA1203 Short Review",
            "comment_content": "As a science student, I did not have much knowledge about finance. This course made me start consider many aspects of finance in my life. I think the best thing this course has done for me is that it motivated me to keep a book for my spending, which I still keep up to date today. Now that I am an adult, I must keep in consideration many financial precautions and awareness. This course has introduced me to some of those aspects.<br />The lecture ranges from managing my personal finances, how bank savings accrue over the years, investing in stock, mortgages, etc.",
            "comment_teaching": "Professor was very enthusiastic to teach the course. Her voice was not drony but light, and she was friendly, even when I met her outside of the class. This was a 9 AM class at the time, but despite that she taught at an interesting way that I managed not to fall asleep in her classes. She was aware that non-business students are also taking this course, so she put terms in easy way and explained thoroughly the concepts.",
            "comment_grading": "There is no easy grade, but if you give your best in all the assignments and projects, I'm sure the professor will give you a good grade. Since there are many assignments, I'm sure it will help you maintain grades, as long as you submit them and give effort in them. <br /><br />Be sure to attend all the lectures, because your attendance counts toward the grade. The professor won't call out names for attendance, but group work will be submitted each day, on which the names of people who attended will be written.",
            "comment_workload": "There are several personal assignments and a group project. Do not be worried, it will be a meaningful assignment. The semester that I took the course, we did a project about paying mortgage and buying apartments in HK. It made me think a lot about saving up from early years (although... I haven't saved up any to this day. I should start soon). <br />The first personal assignment was quite tough. I had to sit down and write it for two days straight, but if you're a fast writer maybe it will take less time for you. It was one where I had to pay attention to details, so that's why it took so much time.<br /><br />Buying the book is recommended. Although reading the book is not mandatory, all the questions at the back of each chapter helped me prepare for the exams. I bought the online e-book version, and it did just fine for me.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ShzNT6rzo7PPCXpPeksAhy1cu5A9oxr6",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "takecare",
            "date": "Jun 02, 2017",
            "title": "[當年今日] Mean course",
            "comment_content": "A simple course with simple content, e.g.<br /><br />Part 1: Planning and budgeting<br /><br />Part 2: Credit management<br /><br />Part 3: Investing<br /><br />Part 4: Tax and protection<br /><br />If you completely know nothing about finance and would like to gain at least some basic understanding, this course is good for you. However, real life personal finance is much more complicated than what the course introduced to you.",
            "comment_teaching": "She is kind and helpful if you have questions. Bonus questions may be given during lesson.",
            "comment_grading": "I think it is fair since I did not spend much time in the course as my group project won by a landslide but I got slightly below mean in the exam (because I did not go through MPF notes). It turned out to be B range grade.",
            "comment_workload": "Light workload for me. If you are not very ambitious, just take it easy and relax.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WvDi5OiEOaqFOLUSLMavotlJMITJ0e23",
            "semester": "2015-16 Spring",
            "instructors": [],
            "is_author": false,
            "author": "mia 111",
            "date": "Jan 24, 2017",
            "title": "better grade， higher workload",
            "comment_content": "幾實用,上完用得翻學過de 野，大致係教你點投資，點運用你ge 錢",
            "comment_teaching": "mid term前教得幾好，mid term後教得有d 快，non -business可能跟唔切",
            "comment_grading": "幾好，2次above mean 幾分，individual project 同 group project 拿93/100， 最後有 b+",
            "comment_workload": "都算多，2 份 individual projects,1 份group project,1 個mid term,1 個final, all mc, 需要上堂搶答最少4次問題, 堂堂都會交notes for take attendance.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TpYsq3o2AdciG1GTcjf1QeZcLZIoXwzu",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "meow",
            "date": "Jan 05, 2017",
            "title": "",
            "comment_content": "Part I: Planning &amp; Budgeting<br />- Personal Finance Basics<br />- Time Value of Money<br />- Budgeting and Planning<br /><br />Part II: Credit Management<br />- Consumer Credit<br />- Home Loans<br /><br />Part III: Investing<br />- Investment Fundamentals<br />- Risk and Return Trade-off<br />- Investing in ETFs and Mutual Funds<br />- Retirement Planning and MPF<br />- Investing in Stocks<br />- Investing in Bonds<br /><br />Part IV: Tax and Protection<br />- Tax Management<br />- Life Insurance",
            "comment_teaching": "She's like a secondary school teacher, spoon-feeding all materials. Slides are very useful though (you don't need to read textbook, just read all the slides will do).<br /><br />Monotonic voice.",
            "comment_grading": "In-class participation is fairly important. <br /><br />Not difficult to get good grades, I just finished off the slides the day before exam and turn in all assignments on time. Got B+ in the end.",
            "comment_workload": "3 individual assignment and 1 group project. Quite lax",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Oi4ogAbyVtxuUIxZCjdG4kXxnIRwwtPE",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gen",
            "date": "Oct 31, 2016",
            "title": "",
            "comment_content": "the class content is not very difficult, acceptable level. Since it is about personal finance, it is like an entry level of finance courses. It talks about mortgage and investment like MPF. These subjects can be very useful for daily life use though.",
            "comment_teaching": "The prof is not very good at teaching, but she is very nice. If you have questions to ask her, she will answer you.",
            "comment_grading": "I would say the grading is still pretty good, as long as you really study the materials and do exercise. Pay more attention to the final exam.",
            "comment_workload": "workload is relative small. you need to ask or answer question in class in order to get the participation card. But it's not guaranteed that you raise the hand and will get the chance to answer the question. It has group project, which is about choosing a MPF portfolio to invest. Most people turn out to choose the same MPF, but the grading of the project still varies. So, try to make a more thorough analysis,",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XJltxdvSfYUDhvGgP9dahNCTWyd6lmVg",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anson Ng",
            "date": "Aug 28, 2016",
            "title": "",
            "comment_content": "Clear and well-organised content. There are few topics for the course only. The topics are highly related to our daily life (e.g. Time value of money/MPF). Thus, it's easy to manage the content of this course.",
            "comment_teaching": "Prof. provides review session before midterm and final exam. Those review sessions are important for clarifying the focus of the upcoming exam. In this course, prof. encourages idea sharing and contribution. Discussion and group work would be one of the main parts of the course.",
            "comment_grading": "The mean score for assignments and exam would be ~80%. Yet, it's not difficult to attain a good grade in FINA1203 as the exams are all in MC format. It's relatively easy to get a good grade in FINA1203.",
            "comment_workload": "There will be 2 assignments and 2 exams for the course. All exams are in MC format and only one of the best assignment would be counted.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CyiL6AXB3dSeiI1q8GjmMChSrGxjU66Y",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Davidck",
            "date": "Aug 24, 2016",
            "title": "",
            "comment_content": "Personal finance is related to how should you invest your money, how should you plan your future retirement plan and avoid the potential risks. All knowledges are related to build up a good financial plan for you, for example interest rate,life cycle",
            "comment_teaching": "Professor is very interactive, she is willing to answer questions from students. However sometimes her teaching materials and examples during the lessons have some little mistakes",
            "comment_grading": "Class Participation 15% <br />Individual Assignment (1) 10% <br />Group Assignment (1) 10% <br />Midterm Exam 30% <br />Final Exam 35% <br /><br />It is good for you to participate every lesson as she will not only give out participation cards, but also mention some knowledges and information that is not in the powerpoint but have chances to be one of the question in the final or midterm.",
            "comment_workload": "Two individual assignments to opt for the best one among two,these two assignments are relatively easy.<br /><br />The project is not too difficult as it will not be too demanding.<br /><br />Midterm and exam are full MC, which is not so hard if you have revised for a week.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gByFn1Fdrx6WoFkS0PcbfhLptqzuEDh3",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tim.t",
            "date": "Aug 24, 2016",
            "title": "",
            "comment_content": "This course mainly covers the basic knowledge in business, for example, time value of money and credit card. Those who had BAFS as their elective in high school usually have no difficulty in managing the course materials.",
            "comment_teaching": "The mode of teaching is quite different from other courses. Students in a lecture will be divided into a number of group with 5 to 6 people. During the lecture, students are required to finish some TAPPS questions, which are closely related to the exam, after a few minutes of discussion. Professor Pi also offers bonus card to encourage students to be more active in class. It is a good way to motivate students to learn and create a relaxing learning atmosphere, rather than just cramping knowledge into the brain.",
            "comment_grading": "It would be easy to get good grades if you pay attention in class and take the initiative to answer the questions during the lectures. Please do not skip any lecture as the lecture notes are simp",
            "comment_workload": "The project in fact is a little bit complicated for non-local students as its is about mutual fund scheme in Hong Kong.&nbsp;&nbsp;The assignments might also take some time to finish as you need to first understand the concept of time value of money beforehand.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7ZJwqru4zJ8tcpWRtRIs4gh1upqrm8eT",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "iamthrookeed",
            "date": "Aug 23, 2016",
            "title": "",
            "comment_content": "The content was good, quite useful, and broaden your basic understanding about finance (investment and money management).",
            "comment_teaching": "The powerpoint slides were not very clear, sometimes the sentences were a bit ambiguous, but overall the lectures were fine. Sometimes the materials were a bit hard to understand and might require some readings from the internet. The professor also encouraged the students to be active in the lectures. She offered bonus points in every lectures and each students should better get at least one or two bonus points through out the semester.",
            "comment_grading": "Class participation: 15%<br />Individual assignment (2): 12%<br />Group assignment (1): 8%<br />Midterm exam: 30%<br />Final exam: 35%<br /><br />The grading was fair, the projects were rather easy. There were two or three projects, the first project was to make a financial goal plan. The instructions were clear and easy to follow. The professor also gave some examples and she's willing to answer any questions regarding the project (both individual and group project).<br /><br />The grouping was arranged by the instructors and basically you'll be with the same group throughout the whole semester. The only difference was the seating plan, which made it fair for every student to get an equal chance of answering questions asked by the professor.",
            "comment_workload": "The workload was fine, but make sure that you follow every deadlines. There were two individual assignments and one group assignment. The professor could give some random bonus points if you completed some other activity sheets.<br /><br />Midterm and final exam were ok as long as you follow through every lectures and review well before the exam. Both midterm and final consisted of both calculation and concept questions.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "w1d9BbUfolz7BAnFOWvrXr1k9MFWg6C4",
                    "name": "course syllabus_r1",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "ivsNkdWgXLV3Xmd43E08vNbMsqgYmJqT",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nickau309",
            "date": "Aug 23, 2016",
            "title": "",
            "comment_content": "Part I: Planning &amp; Budgeting<br />- Personal Finance Basics<br />- Time Value of Money<br />- Planning and Budgeting<br /><br />Part II: Credit Management<br />- Consumer Credit<br />- Buying a Home<br /><br />Part III: Investing<br />- Investment Fundamentals<br />- Mutual Funds and ETFs<br />- Retirement Planning and MPF Funds<br />- Investing in Stocks<br />- Investing in Bonds<br /><br />Part IV: Tax and Protection<br />- Tax Management<br />- Life Insurance",
            "comment_teaching": "講野清楚 而且唔算太悶 你有問題佢都會樂意解答你 不過佢基本上跟powerpoint 黎教 上堂只為take attendance 唔聽佢講都冇咩問題",
            "comment_grading": "15% Class Participation (Attendance + Bonus cards)<br />1% Risk profiling assignment<br />9% Individual assignment (higher score of assignment 1 or 2)<br />10% Group assignment<br />30% Midterm Exam<br />35% Final Exam<br /><br />靚grade<br />midterm 同 final 都係高mean 少少<br />assignment 個分同mean 差唔多<br />冇做Risk profiling assignment<br />冇攞過 Bonus card<br />最後B+",
            "comment_workload": "mid term final 全mc 考之前溫兩溫lecture notes 就ok<br />individual assignment 1,2晚做得完<br />group assignment 如果冇group mate freeride 你既話 係1,2晚得完既野<br />平時又唔洗溫書 輕輕鬆鬆",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5ONSRWFVJOCKcqBjqiqS7mVnNBhRvYQA",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "vivian_t",
            "date": "Aug 18, 2016",
            "title": "",
            "comment_content": "It's quite interesting and useful in daily life. Students can do self study easily even if they skip the lessons.",
            "comment_teaching": "The professor is really friendly but sometimes it is a little boring for us to concentrate in the whole lesson. She will give you a bonus card if you answer her question.",
            "comment_grading": "If you do the textbook exercise (around 15 questions per chapter), you may get at least above mean result in the midterm and final.",
            "comment_workload": "There are 3 assignment through the whole course, 2 is self-assignment and the other is group project. The self assignments are not difficult, I just use less than 2 hours to finish but get a good result finally.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PLLONXBMUNdgJesScPtXIj9Mt66BP4Xa",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SL",
            "date": "Jun 28, 2016",
            "title": "",
            "comment_content": "It talks about basic concepts on personal financing and intoduces different types of investing.<br />It consists of serveral parts:<br />Part I: Planning &amp; Budgeting<br />Part II: Credit Management<br />Part III: Investing<br />Part IV: Tax and Protection<br />The content is easy for you to understand",
            "comment_teaching": "Prof Pi is a nice lecturer as she is willing to listen to students and response to us. The lesson is quite interactive as students are willing to answer questions for the bonus cards.",
            "comment_grading": "The grading is ok.<br />However, most of the people obtain&nbsp;&nbsp;high marks in the midterm and final.",
            "comment_workload": "Bascially one individual assignment and one group assignemnt will be counted to the course grade.<br />There are also Midterm and Final Exam which consists of all MC questions.<br />Attendence is taken sometimes or via discussion time",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vyc4Qnwrpa9GUVLcq0Bf9powEVCfuPRK",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Leojun",
            "date": "Jun 27, 2016",
            "title": "Useful course with reasonable workload",
            "comment_content": "Content is fairly good. You will study some concepts regarding daily financial knowledge, such as equity, bond, time value of money etc. Class strcitly follows lecture slides and Lynn will upload the slides before each class",
            "comment_teaching": "Lynn tries her best to interact with students. She distributes bonus cards for those students who are consistently participating during the lesson. Moreover, you will be formed in as a group for TAPPS exercises. Therefore the class is pretty fun.",
            "comment_grading": "Here comes to the point. Exams are pretty straightforward, you will have two exams with MC forms including concept and numerical questions. I won't say it is difficult but concept questions are not something that are common sense, which means you will really need to study and revise for the course. Otherwise there isn't good grade for you. Lynn is a fair professor, she strictly stick with grade curves. It seems like only top 15~20% of students get into A rage.",
            "comment_workload": "You will have to participate in every session, this is because TA is there to check the attendance and it accounts for 15%. There are 2 individual assignments (I would say it is not something that makes you feel difficult) and one group assignment about MPF schemes. Doing the group assignment will help you revise for finals so please make some contributions.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xZ5IWuPWDowlWY9tru0dDke0eixym8n1",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Phoenix",
            "date": "Jun 06, 2016",
            "title": "",
            "comment_content": "4 PARTS:<br />(1)Planning &amp; Budgeting<br />(2) Credit Management<br />(3) Investing <br />(4)Tax<br /><br />Content is not difficult for you to understand, textbook helps little bit, but generally not very useful.",
            "comment_teaching": "Although there are some in-class discussion and interaction during every class, her teaching is quite boring, especially in the first few topics.<br />You are required to answer her questions to get participation cards, but actually it's quite difficult to catch her attention as everyone would raise their hand.<br />But both professor and ta are very nice, they are very willing to answer your questions.",
            "comment_grading": "Class Participation 15% <br />Individual Assignment (1) 10% <br />Group Assignment (1) 10% <br />Midterm Exam 30% <br />Final Exam 35% <br /><br />Mid-term &amp; Final exam are not difficult, both of them above mean<br />Grading is quite fair.<br />More effort you put, more gain you receive.<br />To me, the grade is good.",
            "comment_workload": "workload is little bit heavy. She gave additional assignments for you to get bonus. <br />Group assignment depends on the allocation of your group. If your groupmates freeride the group assignment, the workload is very very heavy. This situation appeared in my group.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YGWvCRMnjnXbVg1EBjnJGVKxBx8vQ6NM",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gracep",
            "date": "Mar 24, 2016",
            "title": "",
            "comment_content": "The content is interesting and useful even if you are not a business student. (interest calculations, home loans, accumulating wealth, stock market, bond, MPF, etc)",
            "comment_teaching": "The professor really engages the class into discussion and makes the concepts easy to understand and the class interesting. The group discussions also reinforced the concepts that we just learned. I really enjoyed her class.",
            "comment_grading": "Class Participation 15% <br />(ideal for full mark: receive 4 bonus cards when you answer questions and attend classes to submit group discussion papers)<br /><br />Individual Assignment (1 or 2) 10% <br />Group Assignment (1) 10% <br /><br />Midterm Exam 30%<br />Final Exam 35% <br />(all MCQ, there are concept questions and calculation questions which weigh twice more than the former)",
            "comment_workload": "There are couple of easy assignments at the beginning of the semester. There is 2 individual projects and one group project but the second individual project was optional in case you got a good grade on the first one. You do have to study for the exams for the mean is pretty high. Overall the workload was pretty light.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qLrXrtTsWLzjsQ3o9DygoWNtBsDxox3o",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Eric Wong",
            "date": "Feb 17, 2016",
            "title": "",
            "comment_content": "This course talks about personally wealth planning, time value of money and a bit of calculation at the first half of the course. In the second half of the course is about different types of instrument that can help you manage your finance, the concepts covered were quite fundamental, not really teaching you how to gain money using investment tools.",
            "comment_teaching": "Prof. always tries to engage more student during lectures. However, maybe its because of the depth of the knowledge covered, you",
            "comment_grading": "I personally got a pretty good grade in the course, but some of my friends were not so happy about the grade as the competition is really fierce. Remember to fully understand how to do the maths in the first half of the course and just try to read through the ppt and do some exercises for the final exam. For group work,",
            "comment_workload": "Overall, the workload is not that high. All you have to do is to hand all the required things on time.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pCuEL1RgZawpliCfabVLQiB9Dlzy4NYt",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LPJEugene",
            "date": "Jan 23, 2016",
            "title": "",
            "comment_content": "上堂教既野其實都偏向實用包括<br />個人理財<br />股票<br />債卷<br />保險<br />MPF<br />Tax<br />買樓etc<br />都係一d生活有用既topic，學左真心有用",
            "comment_teaching": "清楚但唔幽默<br />有問必答<br />上堂基本上可以做自己野<br />prof都係跟足ppt教，miss左睇翻ppt就ok",
            "comment_grading": "Basic information<br />Class participation 15%<br />Individual assignment 12%<br />Group assignment 8%<br />Mid-term 30%<br />Final 30%<br /><br />Class Participation 都重要，成果sem最少要答4條問題拎point card先計足Class parti，據聞走左堂都可以拎card補翻，兩張一堂，利申消息未經證實。<br /><br />Group 同 Individual assignment各一份<br />原本individual assignment做兩份，但prof好人話第一份高分既可以唔做第二份，計最高分果份，令第一份低分既人都有得救<br /><br />Mid-term Final 全Mc 大概60-70條<br />試卷Concept 同 Mathematical Questions 大概5：5<br />難度唔算高，有溫lecture既ppt都夠做<br />唔買書都ok，狂溫lecture ppt。<br /><br />利申mid term final assignment mean頗高大概80-85<br />每樣高mean 4-5分夠A range<br /><br />絕對係一科好grade既科",
            "comment_workload": "兩份assignment既workload都唔算大 每份10頁 or更少<br />溫書輕鬆既主要靠背<br />中學讀過bafs既人有少量優勢<br />有friend final 前一日溫有B+",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QfHgpdRSlJgSPzgINAfwFqtahnkDSys0",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ekkachai",
            "date": "Jan 21, 2016",
            "title": "",
            "comment_content": "Contents are easy and interesting, and are particularly useful to business students, as it provides an overview of the fundamental concepts of finance and an introduction to the financial world. (eg Stock market, bond, MPF)",
            "comment_teaching": "There are lots of interactions in the class. Prof will frequently ask students questions, and there are lots of opportunities for students to have discussion among their group mates. Yet, as the exams consist lots of calculus, prof should spend more time on the financial calculus instead of teaching students the basic concepts.",
            "comment_grading": "The grading for this course is fair. It highly depends on your examination performance.",
            "comment_workload": "There were 1 individual assignment only and a group assignment for this course.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "STHQNvTN4yFQzcBBvViNZtW3owPiXdKh",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TheTurtle",
            "date": "Aug 20, 2015",
            "title": "",
            "comment_content": "Fairly good introductory course for personal finance, although some might find the content too easy. Teaches you things like the need to save, types of investments, how to calculate interest rates etc. Very practical knowledge that can be applied to daily life.",
            "comment_teaching": "PI, Lynn is a very nice and friendly person. She's also knowledgeable and eager to teach.",
            "comment_grading": "Class Participation 15%<br />Individual Assignment x1 8%<br />Group Assignment x1 12%<br />Midterm Exam 30%<br />Final Exam 35%<br />100%<br /><br />Class participation is a combination of both taking attendance occasionally in the form of in-class assignments and also answering questions and getting bonus points cards.",
            "comment_workload": "Low work load. Individual task was about setting financial goals for your life and how you're going to achieve them numerically, some calculations involved but nothing too complex. Group assignment was about doing research and analyzing pricing of residential areas in HK, very little work when divided among group members.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fuINpJZCrIDEK89N0q3ziE1Yz05EzEdc",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Clara",
            "date": "Jan 28, 2016",
            "title": "好grade",
            "comment_content": "It is not difficult. If you do revision and answer the professor's questions to get some cards, your grade would not be so bad.",
            "comment_teaching": "She is very nice and she would try her best to answer students' questions.",
            "comment_grading": "Good. But many students got high marks in midterm and final. The mean is quite high. It's better for you to attend all the lessons because there are some group works during the lessons, and make sure you write your name and SID on the paper.",
            "comment_workload": "A group project is required. But relax as it is not difficult.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dbCWIszPC7meslKiq1TJmjJYB6kJGGft",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Samuela",
            "date": "Aug 27, 2015",
            "title": "Personal Finance",
            "comment_content": "Useful materials; introduce various types of financial device<br /><br />If you are interested in investment but yet have no idea about investment tools in financial market, this course is perfect to you.",
            "comment_teaching": "Very nice professor<br />Answer students' questions in full details",
            "comment_grading": "If you are active in answering questions in class, you may have a sub-grade up.&nbsp;&nbsp;Overall quite easy to get B range.",
            "comment_workload": "Have easy assignments which just take you about ten minutes to finish.&nbsp;&nbsp;<br /><br />Group projects: You are randomly assigned to a group.&nbsp;&nbsp;So if your group-mates are not free riders, you will be fine.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Okn45FZjQU5tWeTVwuD8R8H5JVbLB2dY",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": ":>",
            "date": "Jan 22, 2016",
            "title": "fina1203",
            "comment_content": "教既都係一般基本既日常財務知識,例如有信用卡,MPF,TAX... 唔算好難。",
            "comment_teaching": "好人同有心既一位老師你問佢野都會好樂意教你。不過上堂既內容好一般,可能本身課程內容既野都唔算係好難。",
            "comment_grading": "好GRADE.<br />不過呢科相對簡單,所以mean都會有d高。<br />mid term 高mean 小小,<br />final 不stat 不過估計高mean 約半至1個sd<br />最尾A-<br />不過midterm final全mc還算輕鬆<br />有一個group assignment, random分group mate,睇你彩數啦,個project都好重要。<br />individual assignment就盡量高分d above mean會比較好。<br />parti 就4張parti卡滿分,一定要拎齊! d問題好簡單。",
            "comment_workload": "workload嘗算輕鬆<br />individual assignment 2份(計一份分)<br />group assignment 1份<br />midterm 1<br />final 1",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "o4zfqEnsRY0bKYAPGNIyyATVwbRv81Ps",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 237,
                    "name": "PI, Lynn",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tin Hei",
            "date": "Dec 31, 2015",
            "title": "冇之前d人話咁好讀",
            "comment_content": "成個course分做4 parts:<br />Part I: Planning &amp; Budgeting<br />- Personal Finance Basics<br />- Time Value of Money<br />- Budgeting and Planning<br /><br />Part II: Credit Management<br />- Consumer Credit<br />- Home Loans<br /><br />Part III: Investing<br />- Investment Fundamentals<br />- Risk and Return Trade-off<br />- Investing in ETFs and Mutual Funds<br />- Retirement Planning and MPF<br />- Investing in Stocks<br />- Investing in Bonds<br /><br />Part IV: Tax and Protection<br />- Tax Management<br />- Life Insurance<br /><br />有部分內容高中BAFS會讀過下, 不過都只係一小部分. 有d content幾悶下 讀完好似冇讀過咁, 不過唔算好深, 所以正常都handle到.",
            "comment_teaching": "上堂幾interactive, 唔係得佢講, 因為有一大班人會舉手搶答問題攞bonus card.<br /><br />教書都ok, 幾nice會答你問題. 不過d powerpoints會upload返上canvas, d內容走堂睇返ppt都會識, 不過唔上就冇哂d participation marks.<br /><br />p.s. 過左add drop period之後要跟seating plan分組坐(由instructor分組), 所以上堂冇得同fd坐. 如果同d group mates 唔熟, 上堂幾悶下.",
            "comment_grading": "由於內容唔深, d分個mean會好高下, 通常都最少8成.<br /><br />15% Class Participation (Attendance + 上堂答問題攞Bonus cards)<br />1% Risk profiling Assignment<br />9% Individual assignment&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(higher score of assignment 1 or 2)<br />10% Group assignment<br />30% Midterm Exam<br />35% Final Exam<br /><br />Risk profiling Assignment: 1/1 (有做就有分)<br />Individual Assignment : 68/100 (mean:80)<br />Group Assignment: 83/100 (唔知mean幾多)<br />Midterm: 82/100 (mean:81)<br />Final: 68/100<br /><br />本身預C range, 點知出嚟個Grade竟然係D 勁爛grade",
            "comment_workload": "有2份Individual projects (計最高分一份), 加多份group project (臨近final先嚟做, 阻住溫書), 再加多份Risk profiling Assignment (呢份好簡單)<br /><br />除左3份projects, 仲有midterm final, 雖然都係全MC, 但都幾多野要溫下.<br /><br />同埋唔可以走堂, 所以整體嚟講workload幾大下",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}