{
    "error": false,
    "course": {
        "id": 2017,
        "subject": "FINA",
        "code": "6900V",
        "name": "Commodities, Trade Finance and Infrastructures",
        "description": "This course will focus on three alternative asset classes, namely commodities, trade finance and infrastructures. Commodities have taken an increasing importance due to the growth in emerging markets, issues over fossil fuels vs. renewable energy, the possibility of future inflation and the continuing financial repression on traditional assets. Trade finance, or financing for trade, is used when financing is required by buyers and sellers of physical goods to assist them with the trade cycle funding gap, or as a form of risk mitigation. Originally a bank internal activity, it has gradually muted into an asset class available to non-bank investors. Finally, infrastructure investing has emerged as a successful asset class amid strong demand for infrastructure investments and a deep need for infrastructure capital, also now accessible through various financial products to non-bank investors.  The purpose of this course is to give participants a good understanding and workable knowledge of the techniques that should be part of the toolkit of anyone investing in, trading, hedging, analyzing and/or advising private and institutional clients on these three alternative asset classes. Furthermore, this course will enable the participants to absorb the analytical arguments in the technical publications – the in-house research notes of financial institutions and in practitioner oriented journals – that deal with commodities and their markets, and to apply them.",
        "categories": [],
        "website": null,
        "credits": 2,
        "semesters": [
            1730,
            1630
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"FINA\" data-code=\"5120\" href=\"/review/FINA5120\" target=\"_blank\">FINA 5120</a> AND <a class=\"course-link\" data-subject=\"FINA\" data-code=\"5290\" href=\"/review/FINA5290\" target=\"_blank\">FINA 5290</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 0,
        "rating_teaching": 0,
        "rating_grading": 0,
        "rating_workload": 0,
        "review_count": 0,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [],
    "composer": []
}