{
    "error": false,
    "course": {
        "id": 2966,
        "subject": "HART",
        "code": "1046",
        "name": "Introduction to Interior Design",
        "description": "In this course, students will learn how to develop an interior design project for a specific purpose, focusing on style, materials, colours and other design elements to serve the purpose. They will research into existing projects and define their own style with the aim of developing new design thinking methods. They will be introduced to the fundamental design strategies for residential, retail and visual merchandising purposes. They will be guided to research into innovative materials and exemplary projects, and learn to present their ideas using different presentation tools of the professionals.",
        "categories": [
            "Common Core (Arts)"
        ],
        "website": null,
        "credits": 1,
        "semesters": [
            1910
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3,
        "rating_teaching": 3,
        "rating_grading": 3,
        "rating_workload": 1.5,
        "review_count": 2,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1302,
                "name": "CATANIA, Manuela",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "7gKPZN9E04M2snTNqqaMYcB8MVYA2PIR",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1302,
                    "name": "CATANIA, Manuela",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "soy",
            "date": "Jan 22, 2020",
            "title": "Super fun and freestyle but heavy quite workload course - 下面有Google translate 中文版",
            "comment_content": "(唔想睇英文geh 下面有Google translate 中文版)<br /><br />Very fun and a precious chance to try out 3 different types of interior projects, including <br />1. Residential project - kids' room, <br />2. Commercial Project - makeup store, <br />&amp; 3. window display.<br /><br />Good chance to know more about the career path and build up yourself.<br /><br />非常有趣，有機會嘗試3種不同類型的室內設計項目，包括<br />1.住宅項目-兒童房，<br />2.商業項目-化妝店，<br />＆3.窗口顯示？<br /><br />這是一個很好的機會，可以更多地了解自己的職業道路並建立自己的事業。<br /><br />Manuela is a real interior and fashion designer so she will give you the insights of the interior designer's work in society instead of lecturing.<br /><br />You will have a chance to do real interior designer's work like making collage, drawing, 3D mock-up model during the class.<br /><br />Manuela是位真正的室內設計師和時裝設計師，因此她將為您提供室內設計師在社會中的工作見解，而不是演講。<br /><br />您將有機會在課堂上做真正的室內設計師的工作，例如製作拼貼畫，繪圖，3D模型。",
            "comment_teaching": "(唔想睇英文geh 下面有Google translate 中文版)<br /><br />Manuela is a very good teacher who gives you suitable advice every time when you prepared something for her to see (just don't prepare nothing). <br /><br />The classes are so freestyle which gives you a lot of time and space for your own development. <br /><br />The only weak point of her is that you have to remind her of what your work originally aims to be every single time because she won't remember all of your previous working progress.<br /><br />Manuela是一位非常優秀的老師，只要你有準備一些 讓她看的東西時，她都會為您提供適當的建議（請唔好咩都唔准備）。<br /><br />課程freestyle，為您自己嘅發展提供大量時間和空間。<br /><br />她的唯一弱點是--您必須讓她想起您的工作原本打算做什麼，因為她不會記住您以前的所有工作進度。",
            "comment_grading": "I got an A+ in the end, I guess if you pay effort to every project and assignments, Manuela will give you an A. But it is better to show your passion and work in class (atmosphere just like classes in the US or European countries).<br /><br />最後我攞A +，我想如果您為每個項目和作業付出努力，Manuela都會給您A。但是最好在課堂上表現出您的熱情和工作（就像在美國或歐洲國家的課堂一樣，氣氛 ）。<br /><br />我冇設計底，只係比較努力。",
            "comment_workload": "In total three assignments/ projects<br />(I'd like to call them projects because it sounds more commercial)<br /><br />1. Residential project - kids' room<br />home for &quot;a imagine client&quot;, a family (have kids)<br />(bigger project - spend more time)<br /><br />2. Commercial Project - makeup store<br />(small project - just 2 lessons?)<br /><br />3. window display<br />home assignment<br /><br />Quite a heavy workload if you have high expectations toward your work, or are a self-demanding person. But it is super fun to enjoy the process of designing and creating stuff and a 3D mock-up model.<br /><br />總共三個任務/項目<br />（我想稱它們為項目，因為它聽起來更具有商業意義）<br /><br />1.住宅項目-兒童房<br />一個“想像的客戶”的家，一個家庭（有孩子）<br />（更大的項目-花更多的時間）<br /><br />2.商業項目-化妝品店<br />（小型項目-僅2節課？）<br /><br />3.窗口顯示<br />家庭作業<br /><br />如果您對工作抱有很高的期望，或者是一個自我要求很高的人，那麼工作量就很大。 但是，單單享受設計和創建東西以及3D模型模型的過程已非常有趣。",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LKdSOQ1J7A0SBKuBZm4SPWE302oPsghs",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1302,
                    "name": "CATANIA, Manuela",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CHing071193",
            "date": "Mar 01, 2020",
            "title": "Do not expect learning any professional indoor design knowledge in this course",
            "comment_content": "Whar I expected to learn in this course is some professional knowledge of indoor design such as how do we match different colours, the different styles (industrial, mid-central) in indoor design, how do we mix and match different materials in design a house. Sadly none of these was taught. The lecturer didn't teach any professional pieces of knowledge, every lesson she just came in, telling you what model you are going to make this time, then you have the entire lecture (ard 2 hours) to finish your work but which usually takes more than 6 hours to finish if you want it to look nice. From time to time she will give you advice on your models, giving you different opinions like the color you used in your model might not go well together but she was not able to explain why, all you can do is follow her instructions and modify your model as she is the one who is giving you grade. Don't question or insist on your own thought no matter how ugly it could come out after modifying your model with her thoughts.",
            "comment_teaching": "She is barely teaching anything, originally I thought at least I can learn to draw the sketches of indoor design and perhaps learn the perspective drawings and the relationship between the light and shade and it turns out I was thinking too much. All you will be doing is some handicrafts and making 4-6 3D models on your own. The lecturer may seem to be encouraging but once you disagree with her opinions you are basically dead in this course, and she can't even explain why she is making those judgements.",
            "comment_grading": "Thanks to the political incidents happened in HK I was able to drop this course in the middle of the semester, but one of my friends said she got a D in this course while she attended every lesson and hand in all the assignment on time.",
            "comment_workload": "It is a 1 credit course, but the workload is heavier than my 4 credits courses. Basically you will need to hand in a hand-made model every week and you are paying for all the material required.<br />Every week I spend at least 3 more hours making those stupid 3D house models. Unless you really like doing handicraft and is as free as that, I wouldn't recommend taking this course.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}