{
    "error": false,
    "course": {
        "id": 470,
        "subject": "HART",
        "code": "1012",
        "name": "Introduction to Photography",
        "description": "An introduction to the art and expression of photography through brief lectures, hands-on activities and field trip. In this course, students will learn about the history and development of photography, photographers who have helped shape our vision of the world and the great photographs they have made, basic photographic vocabularies, perspectives, concepts, theories and techniques. Students will also experience using photography as a documentary, communication and expressive medium. Upon the completion of this course, students will have a much deeper understanding of the power and breadth of photography through studying how it affected and reflected the societal and cultural changes in societies. Those interested in furthering the artistic skills and gaining more hands-on experience with this art form may enroll in the non-credit co-curricular workshops.",
        "categories": [
            "Common Core (Arts)"
        ],
        "website": null,
        "credits": 1,
        "semesters": [
            2110,
            2030,
            2010,
            1930,
            1830,
            1730,
            1630,
            1510,
            1440,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.13,
        "rating_teaching": 3.13,
        "rating_grading": 3.38,
        "rating_workload": 3.88,
        "review_count": 8,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 954,
                "name": "SUEN, Shu Kwan Lioniman",
                "count": 7
            },
            {
                "id": 276,
                "name": "SUEN, Shu Kwan",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "AtircK4DRc69OAii1qxdjwCdj8vkJmw0",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 954,
                    "name": "SUEN, Shu Kwan Lioniman",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "grizelyt",
            "date": "Jun 08, 2020",
            "title": "",
            "comment_content": "Not much technical knowledge was taught.<br />He spent time discussing students' work and mainly taught us how to distinguish an &quot;artistic photo&quot;.",
            "comment_teaching": "The tutor did not clearly teach us how to USE the camera. Instead, he only taught us &quot;how to see the world&quot; (that's how he always empathized).<br />Judgements were given to each student, however, his manners could be improved, he usually disapproves with student's point of view and said &quot;you are just a cognitive person but not a visual one, photography is all about visual&quot; and he was so paradoxical that he also criticized our work saying &quot;you are not taking photos with your heart, you should look through the heart and not finding something that is visually attractive&quot;; while we were explaining our emotion behind the work, he disagreed with them sometimes. It is so ridiculous that a tutor disagrees with one's feeling.",
            "comment_grading": "This is just a game of guessing what the tutor like, even some photos were taken with good meanings behind and visually attractive; if the tutor doesn't like this type of subject, he will give you a low mark.<br /><br />Individual project 1 (35%): 3.68/5<br />Individual project 2(55%): 4.05/5<br />attendance (10%): 4.25/5<br /><br />final grade: B+",
            "comment_workload": "It is optional for you to take practice work every lesson.<br />Each homework should contain 1-3 photos.<br />For the final project, you are required to hand in 1-5 photos for each project with a caption and a short introductory paragraph with 50 words.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 7,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MXkXEFhset9ru048WpUg1Y4zWzapE0pN",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 954,
                    "name": "SUEN, Shu Kwan Lioniman",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "o_o",
            "date": "Aug 06, 2020",
            "title": "Don't take this course if you really want to learn photography.",
            "comment_content": "understanding the camera<br />understanding the lens<br />understanding the histogram and exposure compensation<br />colours and white balance<br />different genres of photography<br />writing on a photograph<br />basic techniques in documentary photography",
            "comment_teaching": "Most of the time is the instructor giving comments on student's homework. The comments are pretty subjective. <br />Sometimes he asked the student to explain why they took those picture and their feeling. However, he will disagree with the students' feeling and think it does not make sense.<br />He always says &quot;You are welcome to challenge my opinion&quot; But every time after someone raised out the question, he will be impatient and get annoyed by those who oppose him.<br />To be honest, what I learn in this course is how to fit the instructor's preference. Don't take this course if you really want to learn photography.",
            "comment_grading": "Attendance (10%)<br />Assignment 1 (35%)<br />Assignment 2 (55%)<br /><br />I forgot to hand in Assignment 2 on time. After 10% deduction, I still got B+.<br />The instructor doesn't like good scenery photo or cinematic feel photos. Also, He likes something he seldom pays attention to. So the grading is pretty subjective.",
            "comment_workload": "Homework: Need to hand in 3 photos of a specific topic each week. But this doesn't count into your grades. However, he will give comments on your work and let you know his requirement and preference. It helps your assignment.<br /><br />Assignment 1: hand in 3 photos<br />Assignment 2: hand in 5 photos<br /><br />Attendance: need to attend every lesson, must turn on the camera. Since it was online semester, you can do other things in the lesson. Just remember to pay attention when he is commenting on your homework in case he asks you questions.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qvSaGuQ1Rulzs71z881OB4QPEv6qRf71",
            "semester": "2014-15 Summer",
            "instructors": [
                {
                    "id": 276,
                    "name": "SUEN, Shu Kwan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "dirkfor3",
            "date": "Aug 26, 2015",
            "title": "",
            "comment_content": "At the first stage of the class ,he would introduce some basics stuff about photography and how to use different functions about camera. Then we will practice during the class outside the classroom.&nbsp;&nbsp;After we handed in our homework (5 photos we took during field trips), we had to share to everyone. Though it is not serious presentation that we just had to speak on our seats, it made the class boring! Moreover, the instructor allowed people to speak in Cantonese. Therefore you won't understand what they are talking about.",
            "comment_teaching": "He is a nice photographer who would answer your questions patiently. Though sometimes he would speak in Cantonese to make locals understand easily, you can just raise your and say you don't understand. He would explain in English for you.",
            "comment_grading": "Art is a subjective stuff. Therefore, don't expect the grades would be good. Since it is only a one-credit course, please forget about the grade. He barely give A range. But it is still worth to take this course.",
            "comment_workload": "The workload is quite small. There are 2 field trips for you to attend. The latter one in Tai-O is way more important which weighs more for your final grade. You only have to hand in 5 pictures after the field trips.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "s9E5os3Auq778eMvijnN9VPlh9qKdUeB",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 954,
                    "name": "SUEN, Shu Kwan Lioniman",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Ymy",
            "date": "Jan 21, 2021",
            "title": "",
            "comment_content": "At the beginning of the course, he talks about the history of the camera which is very very boring. He just talked a little bit about the techniques of taking photos. Most of the time during class is commenting on the photos we have taken as we have to hand in some photos related to a specific topic each week, which is optional and won't count any marks.<br /><br />It is a course to appreciate and comment on other's photos rather than learning photo-taking skills. If you need credit to fulfill the school requirements, then just go on, otherwise, I don't suggest register for this course.",
            "comment_teaching": "Leon looks nice but boring to me. It is so subjective to decide the meanings behind photos. Therefore, I don't agree with his comments sometimes. <br />The lessons always have technical problems and he didn't answer my questions through the chatbox.",
            "comment_grading": "As it is so subjective, you have to take some photos which Leon loves. If you cannot reach his mind, you will get a lot of feedback and low marks.<br /><br />Overall, if you are not too bad, you will have a B range.",
            "comment_workload": "Very very light workload. Only require you to take photos and describe your ideas during class.<br />Only two assignments are needed, for each assignment you have to hand in 4-5 photos, and the second assignment requires some captions to describe your photos.<br />Attendance is needed, and you have to open cam.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9pbA7uDxa75b0UbsLKwBrbM7tqDNDjVa",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 954,
                    "name": "SUEN, Shu Kwan Lioniman",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "PatrickTong",
            "date": "Jan 20, 2021",
            "title": "如果冇影相(街拍)底嘅話，會有啲辛苦",
            "comment_content": "主要教你點影相同睇相，本身有影相底可以無視,上堂主要係睇佢評相，你可以聽下佢啲comment,不過好多時侯好主觀，我聽係為左知佢鍾意啲乜style。",
            "comment_teaching": "prof其實幾好人，不過上堂講有啲1999,所以要落堂之後用廣東話溝通先明。",
            "comment_grading": "其實要靚grade，只要知道professor鍾意啲乜style嘅相就得,professor其實比較鍾意街拍睇細節同埋對同一種事物唔同角度嘅了解同引用。如果你冇乜尼方面嘅經驗/sense,尼個course會好爛",
            "comment_workload": "五份assignment唔計分<br />不過唔交好似會扣分<br />35％ 一份individual project影自己daily life (我去玩街拍佢比4.5/5我）<br />55％一份individualproject要寫captoion嘅assignment (同上 4.3/5)<br />10% attendance (5/5)<br />overall A-<br />個個星期要出去影到好嘅相真係有啲難",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6c803LisJh1Fv8UGND4NXne6QufPEt5G",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 954,
                    "name": "SUEN, Shu Kwan Lioniman",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "anonymous6",
            "date": "Jan 24, 2022",
            "title": "Disappointing Class",
            "comment_content": "I took this class because I wanted to get a better understanding a the fundamental of photography. This was not accomplished in any aspect. The professor did not talk about cameras at all (i.e., aperture, shutter speed, ISO). Instead, he would have us take four photos for an assignment, and then he would use the entire class period rudely critiquing phots. I can honestly say that I did not learn anything about a camera in this class, and I did not come out as a better photographer.",
            "comment_teaching": "There is no teaching in this class. The professor simply critiques the photos of all students, yet provides no tangible explanation of how to improve.",
            "comment_grading": "Completely subjective grading that is no based in reason. Furthermore, the professor has an inability explaining his grading decisions.",
            "comment_workload": "There is very little work required for this course.",
            "rating_content": 1,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wwaSNExirXzhEW8Qkq2jr9SYWPBxckZa",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 954,
                    "name": "SUEN, Shu Kwan Lioniman",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yiuchung",
            "date": "Jan 20, 2021",
            "title": "",
            "comment_content": "not much photo taking techniques were teach <br />so don't expect you would learn some photo taking skills<br />some basic knowledge of a camera and a photo",
            "comment_teaching": "not very fluent in English, foreign student may have difficulties to understand. He often use Cantonese to explain more on the photos.",
            "comment_grading": "Attendance (10%)<br />Assignment 1 (35%)<br />Assignment 2 (55%)<br /><br />If you have submit each homework every week and show on class, no worry about the attendance. It is suggested to take this course if you have experience on street photography.",
            "comment_workload": "You need to submit 3 photos in specific theme every week, it takes time to go out and take photo. <br />The final assignment need caption under each photos.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yolPdgSVAeZsaY98BnrkDb4CFACqMsI4",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 954,
                    "name": "SUEN, Shu Kwan Lioniman",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "蔡林哲",
            "date": "Jan 21, 2021",
            "title": "",
            "comment_content": "Not a technical course. The instructor dont teach how to use cameras. The instructor mainly taught you how to see the world and take photos from a different angle. Helpful if you want to improve the thinking of photography.",
            "comment_teaching": "Have some analyses on the photos either from famous photographers or the assignment.",
            "comment_grading": "Attendance: 10%<br />Assignment 1: 35%<br />Assignment 2 : 55%<br />Didnt submit weekly homework and attend some of the class. Submitted all two assignments and get B+. Pretty Good grading.",
            "comment_workload": "Every week need to submit several photos. Will be counted for Attendance grading. But very helpful if you want to get advice and improve your photography.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}