{
    "error": false,
    "course": {
        "id": 3986,
        "subject": "HUMA",
        "code": "2108",
        "name": "Music of China",
        "description": "This course will look at various forms of Chinese music, focusing in particular on instrumental genres. Although the aim is not to present the history of Chinese music per se, the topical organization of the course will follow a more or less chronological framework as attention is drawn to certain issues and prominent characteristics of music and musical life in China from ancient times to the present. The ability to read music or knowledge of musical notation would be helpful, but not required.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 2,
        "rating_workload": 4,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1650,
                "name": "DUJUNCO, Mercedes Maria",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "ngJEdfk3m220IfJMcwa9fXScxti9vBFM",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1650,
                    "name": "DUJUNCO, Mercedes Maria",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TrebledJ",
            "date": "May 20, 2023",
            "title": "Fun, meaningful, and brain-racking dive into Chinese music across time.",
            "comment_content": "A wild course appeared! Teacher used Confucian. It’s super effective! Student is confused!<br /><br />A wide berth of content. Musical topics interspersed with topics on culture and philosophy. It’s good—to understand music of a certain period and area, we need to understand the context: the philosophy and circumstances of the time and place.<br /><br />What we covered during this course:<br /><br />- Overview of China<br />&nbsp;&nbsp;&nbsp;&nbsp;- Geography, Characteristics, etc.<br />- Early Chinese Philosophy<br />&nbsp;&nbsp;&nbsp;&nbsp;- Confucianism<br />&nbsp;&nbsp;&nbsp;&nbsp;- Taoism<br />- Music of the Literati<br />&nbsp;&nbsp;&nbsp;&nbsp;- Guqin Music<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- with live demo!<br />&nbsp;&nbsp;&nbsp;&nbsp;- Kunqu Opera<br />- Music of the People<br />&nbsp;&nbsp;&nbsp;&nbsp;- Sizhu Music<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- with concerts!<br />&nbsp;&nbsp;&nbsp;&nbsp;- Chuida Music<br />- 20th-Century Chinese Music<br />- Music as a Function of Politics<br />&nbsp;&nbsp;&nbsp;&nbsp;- Maoism and the Cultural Revolution<br />- Chinese Popular Music<br /><br />The content wasn’t too balanced though, but I guess this was a product of Mercedes’ disorganisation. We spent an extra lesson (or two?) on guqin music because Mercedes asked us to play with notation more. We also spent an extra lesson on sizhu music. On the flip side, we only spent one lesson on Chinese Pop Music, which was a topic I kinda looked forward to. :(<br /><br />But eh, pop music changes rapidly in these times. So maybe the best way of looking at it is in hindsight within a decade. Also the demos and concerts made up for it, so I’m not too salty.<br /><br />And that’s another thing: demos and concerts. UST was kind enough to supply her a guqin and guzheng. Those were fun viewed close-up.<br /><br />We got to attend two concerts: a Cantonese Ensemble (Guangdong Yinyue) and a Teochew String Ensemble (Chaozhou Xianshi). IMO, it’s a fantastic cultural experience as you get to listen to the performers (or organisers) share their thoughts and history to add to what you learned in class (though ofc they can be biased towards their culture). At the same time, you also get to observe how the culture is sustained or has changed after many decades of development.<br /><br />Regarding prerequisites, here’s my take:<br /><br />- English (must), for readings, essays, reports, discussions.<br />- Chinese (optional), useful for understanding and connecting dots. Most Chinese terms are romanised (e.g. 古琴 → guqin), but understanding pinyin def helps with some quick Googling.<br />- Music (optional), useful for understanding notation and basic parameters, which you can use to compare and contrast. Actually, this is very useful in the concert review, or identifying cultures during the listening portions of the exam.<br /><br />These aren’t hard prerequisites. I encourage you to take the course even if your English isn’t the best, or if your music lingo is non-existent. In such cases, at least you have lots of room and opportunity to learn.",
            "comment_teaching": "Mercedes is energetic and enthusiastic. You can tell she is invested in Chinese ethnomusicology, her experiences speak for herself. She's very passionate about the topic; I'd say she has the same level of passion Desmond has for teaching, Gibson for his patience (and childish antics), LCM for (financial) math, Dekai Wu for butchering CS courses, and Isaac Droscha for operatic singing.<br /><br />Her lectures are quite fun, occasionally intercalated with musical examples and her life stories. A decent portion of her audio samples are her own field work, her own recordings; you won’t find them anywhere else.<br /><br />At the same time, she is rather disorganised. I estimate an hour was wasted overall, just because she was late or forgetful. Also, if one of your pet peeves is watching boomers struggle with technology, then you’re in for a ride.<br /><br />Since she’s so disorganised, you’ll do good by taking notes, keeping on top of your work, and most importantly: asking questions during class.<br /><br />If you attend enough lectures, you might get to hear some rare, weird quips akin to those in HUMA1100 reviews. I happy to say we have an addition to our collection this semester: “Music is harder than coding. I know C++.” If that doesn’t encourage you to attend lectures, I dunno what will. :D",
            "comment_grading": "Final grade is brutal.<br /><br />---<br /><br />Fair grading for the most part. Not very transparent though, especially for essays (no rubric).<br /><br />For assignments, she sometimes gives opportunities to amend your answers so she can award you full points. But sometimes she will not announce a deadline (ugh, discussions); and by the time you realise the deadline, the assignment’s already closed. Hooray, my first 0 for an assignment!",
            "comment_workload": "Attendance. Weekly readings. 3 Assignments. 1 Midterm. 1 Final. 1 Concert Report.<br /><br />Not for the faint of heart.<br /><br />It’s very different compared to other music courses. The “Enjoyment” series are rather chill. The composition series are more interactive and experiential. In a way, this course is like an “Enjoyment” course, but requires deeper reflection and thought—like a proper humanities course.<br /><br />The assignments were dynamically inconsistent (or consistently dynamic?). I don’t think she planned on the second and third assignment, but she added them anyway. Why? Because, and I quote, “I don’t want you guys to fail, so I’ll give you guys more assignments”. Yes, I suppose we were doing somewhat poorly as a class; and she wants to hand out good grades, but not freely. She’s nice that way.<br /><br />I think the workload is fairly manageable. Readings are somewhat annoying, some are lengthy. If you like reading and writing essays (or don't bother), workload is an A. If not, perhaps a D.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}