{
    "error": false,
    "course": {
        "id": 540,
        "subject": "HUMA",
        "code": "2010",
        "name": "Metaphors in English and Chinese",
        "description": "A comprehensive study of metaphors in English and Chinese, not only as a rhetorical device, but also as an essential tool of our ordinary language and thought. The course encompasses a wide range of diverse topics such as literary metaphors, metaphors in everyday language (about time, life, change, quantity, love, anger, etc.), and metaphors in politics, mathematics, physics, artificial intelligence, and cyberspace. The approach is interdisciplinary and comparative, and most topics are to be discussed from a cross-linguistic and cross-cultural perspective. An ordinary reading knowledge of Chinese is required for enrollment.",
        "categories": [
            "Common Core (H)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2110,
            2010,
            1910,
            1830,
            1710,
            1510,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.36,
        "rating_teaching": 4.14,
        "rating_grading": 4.64,
        "rating_workload": 4.64,
        "review_count": 14,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 309,
                "name": "ZHANG, Min",
                "count": 12
            }
        ]
    },
    "reviews": [
        {
            "hash": "jdRqyCDKO5RSvNTlrNVgXLsTegHs9SMk",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 309,
                    "name": "ZHANG, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "燃燒中的GPA",
            "date": "Jan 29, 2020",
            "title": "",
            "comment_content": "Cognitive linguistics, 主要研究日常生活中成日用到, 但唔易察覺到既conceptual metaphor同conceptual metonymy (係概念上的隱喻同轉喻, 而唔係文學修辭上用既novel/literary metaphor同metonymy)<br /><br />8 modules:<br /><br />1.\tWhy Study Metaphor?<br />2.\tTraditional and Contemporary Views of Metaphor<br />3.\tSome Basic Concepts of the Contemporary Theory of Metaphor<br />4.\tTIME AS SPACE: A Contrastive Study of Chinese and English<br />5.\tProperties and Analysis of Conceptual Metaphor<br />6.\tMetaphorical/Metonymic Axes in Language<br />7.\tThe Grounding of Conceptual Metaphors &amp; Metaphor-Metonymy Interaction<br />8.\tAnalyzing Polysemy with Metaphor and Metonymy<br /><br />重點:<br /><br />-Entailment<br /><br />-Figure (F) &amp; Ground (G); Trajector (TR), Landmark (LM) &amp; Dominion (D)<br />[F = TR, G = LM + D]<br />e.g. The cat is on the chair.<br />F = the cat, G = on the chair; TR = the cat, LM = the chair, D = on<br /><br />-Moving-Time, Moving-Ego<br /><br />-Spatial perceptual strategies: Strategy A (Environment-projection), Strategy B1 (Canonical-encounter) &amp; Strategy B2 (Sight-line alignment)<br />(其中一次attendance-taking其實係一個survey, 睇下大家對前後既語感, prefer Strategy B1定係B2, 見附件)<br /><br />-Conceptual Metaphor [X IS Y: X is understood in terms of Y]<br />e.g. “嬲到爆”: ANGER IS A HOT FLUID IN A CONTAINER<br />X係一個我地想表達既抽象概念 (Target Domain), Y係一個我地用黎理解X既具體事物 (Source Domain), 呢個例子我地想表達抽象概念X (怒火, ANGER), 我地用一個具體事物Y (一個容器入面既熱流體, A HOT FLUID IN A CONTAINER) 黎理解X, 因為ANGER同A HOT FLUID IN A CONTAINER一樣, 就快爆出黎咁<br /><br />-Conceptual Metonymy [Y for X: Y stands for X]<br />e.g. “開冷氣”: PRODUCT for INSTRUMENT<br />呢度既冷氣係指冷氣機, 我地講Y (冷氣, PRODUCT) 其實係stands for製造冷氣呢個PRODUCT既X (冷氣機, INSTRUMENT)<br /><br />-Polysemy (用conceptual metaphor同conceptual metonymy分析中英文一字多義既現象)",
            "comment_teaching": "-講書都幾生動, 唔算太悶<br /><br />-比較exam-oriented, quiz同final exam之前會提供past quiz papers, mock paper, 同埋會話你知有咩會考, 有咩唔考, 會點考, 應該點溫書, etc.<br /><br />-Quiz完之後會upload一份好詳細既marking scheme同solutions, 指出同學常犯錯誤, 好有心",
            "comment_grading": "Attendance (10%): add/drop period後會take attendance, 臨落堂TA派attendance slips, 每人攞1張, 寫名+答一條簡單填充/MC題, 答錯無所謂, 最緊要記得寫名, 落堂交, 唔係堂堂有, random既 (基本上同HUMA3030一樣)<br /><br />呢個sem一共有12次attendance-taking, 揀其中10次計你attendance分, 每次1%<br /><br />兩大中伏位:<br />1.\t12次attendance-taking入面有11次係用attendance slips, 其中1次係Quiz 2當日take既, 而呢次係有計到落attendance分, 如果你做完Quiz 2就走左去就會無左呢1%<br />2.\t仲有1次attendance-taking比較特別, 就係叫你落堂攞返自己份改完既Quiz 2, 有攞走=有上堂=1%, 無攞走=無上堂=0%, 呢次都有計落attendance分, 未落堂就走左去果d人就會無左呢1%<br /><br />Mean: 8.24, SD: 2.25<br /><br /><br />Quiz 1 (20%): First 30 minutes of Week 7 lecture, 80 points<br />Format: MC (5 x 5 points = 25 points), filling-in-blanks (25 points), conceptual metaphor formulation (6 x 5 points = 30 points)<br />Coverage: identification of F, G, TR, LM, D, spatial perceptual strategies (A, B1 &amp; B2), Moving-Time/Moving-Ego, conceptual metaphors<br /><br />Mean: 61.15, SD: 12.48, Max: 80<br /><br /><br />Quiz 2 (20%): First 30 minutes of Week 11 lecture, 75 points<br />Format: filling-in-blanks (15 x 5 points =75 points)<br />Coverage: identification of conceptual metonymies<br /><br />Mean: 61.27, SD: 7.71, Max: 72.5<br /><br /><br />Final Exam (50%): 3 hours, 100 points<br />Format:<br />Blank-filling Questions, Short Answer Questions (50 points)<br />Analysis Questions (50 points)<br /><br /><br />我:<br />Attendance: 10/10<br />Quiz 1: 65.5/80 (+0.35 SD)<br />Quiz 2: 64.5/75 (+0.42 SD)<br />Final Exam: 無出分<br /><br />Grade: A-<br /><br />Prof. Zhang係靚grade既, 總結我讀過佢既3個courses (HUMA1060, HUMA2010, HUMA3030), 只要你攞齊10% Attendance分, Quiz 唔洗話要above mean好多 (但最起碼都過80%, 其實唔難), Final Exam正常發揮 (未必要above mean好多, 但至少從你既答卷睇得出你係有上堂/你係明個course講咩既, 識答幾多就盡量答), overall 有~65%-80%, 應該都會有B range或以上",
            "comment_workload": "上齊堂, 唔好早走, 基本上已經穩袋10% Attendance分<br /><br />主要workload都係準備2個quiz同final exam<br /><br />Quiz之前溫返lecture notes, 做下exercises同past quiz papers, 同埋背下lecture notes入面有既conceptual metaphors/conceptual metonymies (Quiz講到明淨係會考lecture notes入面講過既conceptual metaphors/conceptual metonymies, 其他既唔考)<br /><br />考Quiz 1之前記得清concept, 特別係spatial perceptual strategies, make sure自己知道Strategy A, B1同B2係咩黎, 唔明既話就睇返lecture notes例子同做exercise (呢個sem Quiz 1有3題MC考呢d, 每題5分, 加埋15分, 唔識答都幾大鑊)<br /><br />背conceptual metaphors同conceptual metonymies就唔算太難背, 睇lecture notes既時候不妨舉一反三, 自己諗下有無類似既例子 (&quot;開冷氣&quot;呢個例子其實係我諗到既, lecture notes無), 咁樣會易記好多<br /><br />Final exam之前都係溫返lecture notes, 做下exercises, mock paper同past final exam papers, 同埋再背多次lecture notes入面有既conceptual metaphors/conceptual metonymies<br /><br />呢個sem 份final exam頭兩大題:<br /><br />Q1.1-1.10: Conceptual Metaphor Formulation, 類似Quiz 1 (10 x 1.5 points = 15 points)<br />Q2.1-2.6: Conceptual Metonymy Formulation, 類似Quiz 2 (6 x 1.5 points = 9 points)<br /><br />呢16小題入面大多數都係考返lecture notes入面講過既conceptual metaphors/conceptual metonymies (有背書=送分), 得幾題係要你formulate new conceptual metaphors/conceptual metonymies (即係lecture notes無講過既), 呢幾題可能要靠臨場執生/睇過additional topics/required readings先識答, 但佔分唔多<br /><br />而其他題目考法同exercises, mock paper都好似, 考之前最好做晒佢, 做唔晒都至少睇一次solutions學下點答題<br /><br />Additional topics同required readings大部分內容lecture notes都有講過, 除非你有好多時間/想攞A+, 如果平時有上堂既話其實可以唔睇, 唔睇對你final exam影響唔大, 況且Prof. 都話lecture notes同exercises重要過additional topics同required readings, 講真睇完最多都係幫到你執到formulate new conceptual metaphors/conceptual metonymies果幾分, 做晒所有exercises同mock paper學下點答analysis questions仲實際",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 13,
            "vote_count": 13,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "3ivPMGe4gn2U5K16EfscmHQkHjEK1NjU",
                    "name": "HUMA2010 syllabus",
                    "format": "pdf"
                },
                {
                    "key": "49jXILTLZBzrWXTCHAhzhzdouMGCUyvp",
                    "name": "The Final Exam - What to Do and How to Prepare for It",
                    "format": "pdf"
                },
                {
                    "key": "GyO9E7EdcOV7DT5O39IQJqr6lV3ljl3i",
                    "name": "Strategy B1 & B2",
                    "format": "png"
                }
            ]
        },
        {
            "hash": "Xb5ynFUeDLQvLJL3LpBSl5AC9mki5uPk",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 309,
                    "name": "ZHANG, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "zsheryl",
            "date": "Jan 22, 2016",
            "title": "Better than first impression but nothing more",
            "comment_content": "I came into the course expecting to read a bunch of literary jargon, and possibly brush up my knowledge of idioms, proverbs and the like. However one important thing (I can't believe ) I failed to notice was that this is a course of CONCEPTUAL metaphors, not traditional/contemporary/literary metaphors, whatever you choose to name it. Some students have commented that the content is dry and uninteresting, because of clichés that recur throughout the course such as &quot;TIME IS MONEY&quot; and &quot;LIFE IS A JOURNEY&quot;. However, &quot;TIME IS MONEY&quot; is very different from &quot;time is money&quot;, in that the former is a categorical mapping of all related colloquial puns. For instance, &quot;I spent so much time on the essay&quot; falls into the category of TIME IS MONEY, because you are using the verb &quot;spent&quot; to describe time, much as you would do with money. This might seem like common sense, but wait till you learn about &quot;FORESEEABLE FUTURE EVENTS ARE UP&quot; and &quot;IDEAS ARE FOOD&quot;. When you actually settle down to study (or cram right before a grade-changing exam), you'll realize that the crazily ungrammatical phrases actually start to make sense (and do keep in mind that although the phrases are unrealistic, they have their own unrealistic rules to follow...which I learnt after the sweat and tears of midterm grades:) There will be a lot of writing to do for the finals and the essay, but most of it will be manageable if you excel in the art of stringing together verbose terminology with grammatically comprehensible sentences~&nbsp;&nbsp;<br />One interesting point during the course was when we had the opportunity to compare Chinese and English conceptual metaphors, which got me thinking about differences that never really occurred to me. Take this statement for example: &quot;Christmas is coming, Christmas is here&quot;. In English, time can be seen as a moving entity towards us, and Christmas is a point in that moving time. However, in Chinese, we often find ourselves saying &quot;快到圣诞节了&quot;, which treats the person as a moving entity heading towards a stationary point in time, Christmas.<br />Did I type too much...",
            "comment_teaching": "A lot of my friends missed lectures every now and then, as did I. (Hint, for our sem, he usually takes attendance twice in a row, then goes easy on us for a while) And even when I went, I never really gave the course my attention (apologies again). The professor basically drones on in the background while students sit and type at their computers. But Zhang min still enthusiastically carries on without a care in the world, and he really seems to be quite passionate about the material. However, if you're more accustomed to skipping classes and cramming before tests, at least have a friend to fill in your attendance for you (which itself requires a certain level of skill, since the TA counts how many students are sitting in a row, and hands out attendance slips accordingly...but she could always make a mistake, you never know;) and read the required reading. At least the first quarter of it. That will basically serve as your surrogate tutor.",
            "comment_grading": "I took this course to fulfill my (possible) HUMA minor, since it was rumored to be a somewhat easy course. Material wise, the course consists of 10 chapters, all of which will be posted on lmes. If you miss the lectures, the ppt will cover about 70-80% of the content discussed (not that I paid extreme attention to the lessons). In addition, there are required readings assigned to help you grasp the concepts (which I didn't quite finish reading either). There will be a midterm, a final and an essay, each about 20% of your grade (I forgot to save the syllabus, my apologies for the irresponsible estimations) with several single-question pop-quizzes that are given randomly for attendance only (not graded for accuracy).",
            "comment_workload": "In class midterm-ish quiz twice, a final, an essay, and random attendances you have to worry about. Don't ask me about the workload, I crammed everything so it seems insurmountable either way. But perhaps due to the fact that it was crammable, this course does give you a lot of free time during the semester.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "o46yDRVAlOYYtrbwnyf8TKgYCa3yGQwe",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 309,
                    "name": "ZHANG, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jasa",
            "date": "Dec 28, 2021",
            "title": "Great Grading with Low Workload",
            "comment_content": "Language required: Chinese (Mandarin+Canto) + English. <br />Most are in Mandarin and Canto are easy<br /><br />Ch1-7 But only Ch4-7 are tested. <br />Ch4: Metaphor<br />Ch5: Time-Space Metaphor<br />Ch6: Metonymy<br />Ch7: Metaphor from metonymy<br /><br />Quiz 1: Ch4; Quiz 2: Ch5<br />Final: 20% Ch4-5; 80% Ch6-7",
            "comment_teaching": "Good teaching. <br />Prof. Zhang is passionate about teaching, giving tones of examples to explain every concept. <br /><br />Fly in the ointment - he speaks a bit slow. So if you want to refresh or revisit the concept, you could go to lecture recording, and select 1.5x - 2.0x speed.",
            "comment_grading": "Quiz1 (20%): Mean: 48.61\tHigh: 70\tLow: 23.5<br />Quiz2 (20%): Mean: 59.57\tHigh: 72\tLow: 28<br />Final Exam (50%): No score<br />Attendance (10%): IPRS, everyone full<br /><br />I got A with 58/ 68/ X/ 10<br />I am not confident about my final exam on a number of short questions under time pressures. <br /><br />Nonetheless, grading seems generous. There is a rumour that above 80% means A range.",
            "comment_workload": "Very Light. <br />Attendance - he took IPRS on around 15 lectures.<br />However, you don't need to pay attention in class - <br />(1) Ch1-3 are not tested<br />(2) Study lect slide &amp; Ex. is good enough<br />(3) only Ch5 (Time metaphor) and Ch7 (relation) require attention<br /><br />For quizzes, 1-2 days are good enough for prep. You just need to: DO all his exercises and READ all his explanations. For final exams, 2-3 days.<br /><br />Reading material is not tested. I read NONE of his reading material and get an A.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qKebC8i3JNlWpYzIWvyNfnTiCfX4Xqyu",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 309,
                    "name": "ZHANG, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Unknown User",
            "date": "Jan 21, 2016",
            "title": "Good grade (if your English is 'not bad')",
            "comment_content": "The course content are quite interesting.<br />It give you some different aspect to look at language. <br /><br />To remind you, this course is definitely not about literature but the analysis of language. It never matter if you are not good at literature at all.<br /><br />Some tips for you:<br />Understanding the concept of conceptual metaphor and metonymy are very important for all of your analysis throughout this course.&nbsp;&nbsp;Try to work on (or just take a look with) those provided exercises to strengthen your understanding!",
            "comment_teaching": "Professor will explain all lecture materials in a very very detailed way! (but actually, as the lecture materials are quite easy to understand, you can read them by your own. so I seldom pay attention during lectures:p)",
            "comment_grading": "Seems to be absolute grading.<br />(I got an A even though I didn't study all lecture materials) <br />(I'm quite sure once you can go thought all of the materials provided, it will be an easy job to get a good grade!!)",
            "comment_workload": "Easy Quiz if you have gone through all pass paper (will be given in canvas)<br />The homework (shortest essay I've ever seen!) was a bit challenging but it only spent me few hours to finish (once you got ideas)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "grI0tNA1p5N8llozgxtPkqyI06wTs2ib",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "丿",
            "date": "May 21, 2023",
            "title": "Good choice to fuifill the huma requirement",
            "comment_content": "A lot of interesting linguistic phenomenon in Chinese and English. You will get many interesting topic of conversation. Not difficult to underestand if you know both Chinese and English. Don't touch if you don't know Chinese.<br /><br />Science and engineer student may be more suitable for it because you may have to analyze a centence in a very rational way.",
            "comment_teaching": "Medium difficulity, slow pace, easy to understand.",
            "comment_grading": "Good. Choice question only and I got an A with little recview.",
            "comment_workload": "No essay!<br />Some reading, but optional. I didn't do any reading.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rxd11eW8FXZzmqISQzpv6Z8K7zFYIrgf",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 309,
                    "name": "ZHANG, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Andy HK",
            "date": "Jan 12, 2021",
            "title": "Got A+ though I felt difficult and confused initially and didn't fully understand some of the logic.",
            "comment_content": "Major topics to be covered<br />(Note: contents and order subject to change)<br /> 1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Why Study Metaphor?<br />2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Traditional and Contemporary Theories of Metaphor<br />3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;How Literary Metaphor Works<br />4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Properties of Conceptual Metaphor<br />5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Types of Metaphor<br />6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Orientational Metaphors &amp; the Grounding of Metaphors<br />7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;TIME AS SPACE: A Contrastive Study of Chinese and English<br />8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;From Space to Non-space: Motion Verbs &amp; Locative Nouns in English and Chinese<br />9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Emotion Metaphors<br />10. Supplementary Topic 1: Conventional Metonymies in English<br />11. Supplementary Topic 2: Image Schema and Function Words in English and Chinese<br />12. Supplementary Topic 3: Figure vs Ground; Trajactor vs Landmark, and the OVER Schema<br />13. Supplementary Topic 4: Logical Inference, and TIME IS A LIMIT RESOURCE<br />14. Supplementary Topic 5: Force Dynamics, Image Schemata, and Metaphorical Extension of Modal Verbs<br />15. Supplementary Topic 6: Up and Above in Chinese: Metaphorical Extensions of Meaning<br />16. Supplementary Topic 7: Metaphors We Compute By<br />17. Supplementary Topic 8: Metaphors in Scientific Thinking",
            "comment_teaching": "Clear lecture notes and explanation. Nice and helpful professor. Willing to help students.",
            "comment_grading": "I got A+ for the course with a total score of 88.86%.<br /><br />Attendance (10%): 10/10<br /><br />Quiz 1 (20%): 65/70<br />This Quiz has 14 MC questions, each having 5 points (70 points in total). You will have 30 minutes to answer all the questions. Please be noted that, for some questions you will be asked to choose the correct answer (the “best”, “correct”, or “adequate” ones); for some others, you will be asked to choose the wrong answer (the “incorrect” or “irrelevant” ones). Read the instruction of each question carefully before answering.<br /><br />Quiz 2 (20%): 62/66<br />Instructions: (1) Complete “The HKUST Academic Honor Code” before entering the Quiz. (2) Before starting, you are required to turn on your camera, with the lens pointing to your face. (3) There are 7 questions in this Quiz, each with a few blanks to fill in, and you have to complete all of them within 30 minutes, by filling in relevant blanks as instructed. (4) Each question will be locked after answering. Before moving on to the next question, double-check your answer for any mistakes. (5) The Quiz will be automatically graded, and you can see your total points after completion of the quiz, but you won't be able to see your responses (which option is correct; which incorrect) after your attempts. This is for maximizing security for the online assessment. (5) The total mark for this Quiz is 66. For your information, the distribution is given below. Budget your time wisely!<br />Distribution: Question 1 has 6 boxes, each 1 point. Question 2 has 4 boxes, each 1 point. Question 3 has 4 boxes, each 1 point. Question 4 has 5 boxes, each 2 points. Question 5 has 4 boxes, each 1 point. Question 6 has 4 boxes, each 1 point. Question 7 has 17 boxes, each 2 points.<br /><br />Final exam: consists of 4 sessions<br />Session1: 57/60 <br />Instructions: (1) There are 20 questions in this session, and you will have a total of 35 minutes to complete all the questions in this session. The session will automatically submit when the time is up. (2) The questions in this session involve only the identification of conceptual metaphors and conceptual metonymies. You should carefully read and follow the instruction in each question. (3) The total mark for this session is 60 (each question 3 points). <br /><br />Session2: 46.5/56<br />Instructions: (1) There are 14 questions in this session, and you will have a total of 50 minutes to complete all the questions in this session.(2) The questions in this session all pertain to the identification of conceptual metaphors or metonymies (6 metaphors and 8 metonymies), which are selected from relevant question banks. (3) The total mark for this session is 56 (4 pts for each question). (4) This session is classified as a “Filling-in-Blank” session, but you are supposed to put your formulation into the given blank box, in the right format. <br /><br />Session3: 29.5/35<br />INSTRUCTIONS: (1) For this session, you need to answer a total of 5 questions (with a total of 35 points), which are randomly selected and ordered from our relevant Question Banks. The points for each question range from 5 points to 9 points. You will have 40 minutes to answer all the questions in this session. (2) Questions in this type should be answered in the given box in each question. Due to the nature of questions in this type, they will also be manually graded, therefore you will not see your scores after completion. (3) You are expected to answer the questions in this session very briefly (follwing the instruction about “suggested length” in each question – though it is fine if your answer is a bit more lengthy). (4) When [Formulation IS required] is specified, you need to provide the relevant formulation in your answer (in the format of “X is Y” for metaphor or “Y for X” for metonymy). If you see “[Formulation is NOT required]”, you are just expected to describe the relevant phenomenon verbally, without needing to provide the formulation.<br /><br />Session4: 29/40<br />INSTRUCTIONS: (1) For this session, you need to answer a total of 2 questions (with a total of 40 points). One question has 15 points; the other 25 points. You will have 40 minutes to answer all the questions in this session. (2) Questions in this type should be answered in the given box in each question. Due to the nature of questions in this type, they will also be manually graded, therefore you will not see your scores after completion. (3) You are expected to answer the questions in this session briefly (follwing the instruction about “suggested length” in each question – though it is fine if your answer is a bit more lengthy). (4) When [Formulation IS required] is specified, you need to provide the relevant formulation in your answer (in the format of “X is Y” for metaphor or “Y for X” for metonymy). If you see “[Formulation is NOT required]”, you are just expected to describe the relevant phenomenon verbally, without needing to provide the formulation.",
            "comment_workload": "No need to read any readings to get an A+ for me. But need to do all of the exercises and past papers and study their solutions thoroughly because this is a sine qua non to ace the quizzes and exam. <br /><br />Assessment:<br />Attendance: 10%<br />[Attendance will be taken (automatically, with the system log) from Week 3, after the end of the add-drop period.]<br />Quiz / Assignment: 40%<br />One short quiz, and one short squib (or quiz) ( each 20%); details will be announced in &quot;Modules - 0. Assessment&quot;.<br />Final exam: 50%<br />A three-hour final exam which consists of MC questions, short essays, and data-oriented problem solving questions; details will be announced in &quot;Modules - 0. Assessment&quot;.<br /> <br />Major reading materials (see &quot;Assignments&quot; page for details)<br /> <br />1.&nbsp;&nbsp;Lakoff, George. 1993. “The Contemporary Theory of Metaphor.” Available online @ http://terpconnect.umd.edu/~israel/lakoff-ConTheorMetaphor.pdf&nbsp;&nbsp;(Links to an external site.)<br />2.&nbsp;&nbsp;&nbsp;Lakoff, G. &amp; M. Johnson. 1980. Metaphors We Live By. Chicago: University of Chicago Press.<br />3.&nbsp;&nbsp;&nbsp;Kovecses, Zoltan. 2002. Metaphor: A Practical Introduction. Oxford: Oxford University Press.<br />4.&nbsp;&nbsp;&nbsp;Yu, Ning. 1998. The Contemporary Theory of Metaphor: A Perspective from Chinese. Amsterdam: John Benjamins.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nVyknGpJS0n2yevTeZfBTou9iPnkYAZf",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 309,
                    "name": "ZHANG, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "soyagogo",
            "date": "Jan 28, 2016",
            "title": "",
            "comment_content": "It is about chinese and english metaphor.<br />i think the content is not much, repeat the similar topic.<br />The content is very simple, what u need to do is just reading all the examples and do all the exercises.",
            "comment_teaching": "The prof is very cute, he teaches with lots of body language and trys to make some gag.<br />He gives lots of example and exercises to illustrate one statement, but due to too many examples, sometimes I get bored and play with my phone.",
            "comment_grading": "I get A in this course, I just study 3 days before the exam.<br />Of course I have attended most of the lessons.",
            "comment_workload": "There is no mid term, but either quiz or assignment, two in total.<br />As well as taking ten times attendance, the attendance is answering one question, but it doesnt matter correct or wrong.<br />He gives lots of sample question, if you study all, you easy get high marks.<br />It is the least workload and gd grade&nbsp;&nbsp;course I have studied in UST",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HrkeOcbb5RVrqTYReW4xZv6BIHJ03D86",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 309,
                    "name": "ZHANG, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mheag",
            "date": "Jan 22, 2016",
            "title": "",
            "comment_content": "The course encompasses a wide range of diverse topics such as literary metaphors, metaphors in everyday language, and metonymy.",
            "comment_teaching": "The teacher is good and well-prepared. I tried to listen carefully for the first few classes and I found it really interesting. He uses a lot of examples and graphs to make it more vivid. The one that impresses me most is LOVE IS A CONTAINER. However, if you are really not interested in this topic, the class will be more than boring to you. I saw many students fall asleep in class actually.→_→",
            "comment_grading": "The grading is nice and I think many friends of mine get A range. To be frank, I did not put too much effort in this course and I kept drifting away in class. But I ended up with a not bad grade. (not an A+, so it is better to study harder)",
            "comment_workload": "The workload is quite small compared to other HUMA courses. <br />Attendance: 10% There will be small random in class quizzes for attendance-taking, so it is better to attend every class. But some of the students actually goes to the classroom at the last ten minutes.<br />Quiz: 20% The quiz is not difficult if you go through all the slides before the test. Most of the answers have been mentioned in class.<br />Assignment-short essay: 20% We have almost one month to finish this pretty short essay or maybe it can not be called an essay. It will not take too much time to finish it.<br />Final: 50%&nbsp;&nbsp;The difficulty is okay but I think there are a lot of things to write. It is really important to go through all the PPT.<br />Reading: There are a lot of reading materials but I think it doesn't matter too much even if you skip all of them.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CEK7RI6GXYxhJnfKlzAIAB9R6cFAJQfo",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 309,
                    "name": "ZHANG, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lam",
            "date": "Jan 21, 2016",
            "title": "Not quite interesting but good grade",
            "comment_content": "Metaphors and metonymy! Analyze all kinds of metaphors. It sounds that every class it's about the same things and&nbsp;&nbsp;theories so I felt bored. Dig into many commonly used phrases and sentences like &quot;falling in love&quot; and show that in this sentence, there's a metaphor which is LOVE IS A CONTAINER, to show that metaphors are commonly used as a conceptual tool to help people understand things.",
            "comment_teaching": "Vivid, always use actions or graphs to explain metaphors. Really excited every class and always laughing at his own jokes regardless of all the asleep students....",
            "comment_grading": "Nice grading, most of my friends got A plus.",
            "comment_workload": "There is actually just one assignment that you need to hand in. Although the TA didn't even let us know the grades of the assignment, it felt like the prof just want us to research a little bit and it's good as long as you did it. Quite simple work. Midterm is just a quiz. Take attendance so it's necessary to go to classes, you can even just go there at the last 10 minutes.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JVuuSHHMaPs1cHR9gMO7U6VJkthM9mnE",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 309,
                    "name": "ZHANG, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LittleJ",
            "date": "Jan 17, 2016",
            "title": "",
            "comment_content": "The content is interesting. It may change your view towards the language you use everyday because after understanding the concepts you will discover that nearly every sentences we speak contains metaphors.<br /><br />It does not need good language skill, but having good English has a little bit advantage.",
            "comment_teaching": "The teaching is fine. But I dont really listen to the class because I was there only for attendance. I think I only attended less than half of the class.<br /><br />There are a lot of so-called required readings, though I only read one. These readings may not really help with your exams and your grade whatsoever.",
            "comment_grading": "Attendance, one short 1 to 2 paged paper, midterm and final exam.<br /><br />I got only 4 or 3 out of 10 in attendance because it is taken randomly, above mean in midterm, 18/20 in paper. I dont know my score in final but I think I must be above mean.<br /><br />My grade is B+. I think I can get better grade if I had more attendance.",
            "comment_workload": "Overall, the materials you need to learn is very little because there is only two major topics which are conceptual metaphor and metonymy. Once you understand how to identify them, all you have to do is the exercise and past paper. Then you can get good grades in paper and exams.<br /><br />The paper is very short. I only wrote less then 1 page but still got good score.<br /><br />The exercise and past paper is very important to&nbsp;&nbsp;the exams. They are provided on Canvas. Not a lot of revision is needed once you thoroughly understand the two major concepts.<br /><br />You can write Chinese or English or both in your final exam, but it should be better to use English because the teaching is in English.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zvsUFnqDHEQe8thogtCFewx3uKdGBRlu",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 309,
                    "name": "ZHANG, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jennp",
            "date": "Jan 08, 2016",
            "title": "拖得太長",
            "comment_content": "成個course主要都係教中英文嘅conceptual metaphor, 後期有metonymies, 例子係好多平時嘅日常用語, 但太詳細去學嘅感覺唔太有趣<br /><br />Attendance係臨落堂先take<br />Quiz同final都比帶paper dictionary去查, 形式同past paper同埋canvas excercise好似",
            "comment_teaching": "因為係中英文content,所以有時上堂會講講下英文,無啦啦講中文example<br />全個sem主要圍繞conceptual metaphor, 所以好多例子都不停重覆,一個chapter入面嘅野唔多,但略為講得太詳細...上堂有時會有d小幽默,但整體黎講教得有d悶,上堂嘅人好多都係為咗take attendance先上",
            "comment_grading": "Attendance: 10%&nbsp;&nbsp;(每次一題MC)<br />Quiz: 20% <br />Assignment: 20% (2細題essay)<br />Final exam: 50%<br /><br />淨係出左midterm同attendance分,分數ok, 感覺assignment應該唔差,final最後唔係太溫得切,最後比預期差:(",
            "comment_workload": "得1個quiz,1份assignment同final<br /><br />每個chapter完之後都會update online assignment同reading上canvas,不過得一份要交<br />要交個份assignment好似前3個星期同我地講,份assingment亦唔係特別難做",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "V64JAuKQedL3UeRtMRHRC9AbEz12cpEa",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 309,
                    "name": "ZHANG, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KIKC",
            "date": "Jan 26, 2021",
            "title": "",
            "comment_content": "The contents are showed below:<br />1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Why Study Metaphor?<br />2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Traditional and Contemporary Theories of Metaphor<br />3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;How Literary Metaphor Works<br />4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Properties of Conceptual Metaphor<br />5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Types of Metaphor<br />6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Orientational Metaphors &amp; the Grounding of Metaphors<br />7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;TIME AS SPACE: A Contrastive Study of Chinese and English<br />8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;From Space to Non-space: Motion Verbs &amp; Locative Nouns in English and Chinese<br />9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Emotion Metaphors<br /><br />There are also lots of readings you need to read.",
            "comment_teaching": "Professor explained the concepts clearly. HE always explained it with lots of examples. However, he spoke too slow and it spent two to three week to finish one topic.",
            "comment_grading": "40% Online quizzes<br />60% final<br /><br />The grade is not very good. I have got mean in both online quizzes. And I below 0.4 sd in the final. Overall is about 67% but I have got C- at the end.",
            "comment_workload": "The workload is not too heavy. There are only two online quizzes and one final.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ldzgtZTySSoJ1BPICtJuKaQzmtb1Blxj",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "騫",
            "date": "Jan 09, 2018",
            "title": "good grade course in HUMA",
            "comment_content": "This course is mainly focus on analysis of language, but not about literature. So if you are not good at literature, this is not a problem.<br /><br />Content : Metaphor, metonymy <br /><br />The content is quite interesting, talk about the metaphor&nbsp;&nbsp;in daily life.",
            "comment_teaching": "Professor is full of passion, yet sometimes it is quite boring.<br />I always read the notes by myself.",
            "comment_grading": "40% Quiz, 20%@1<br />10% attendance,<br />50% final&nbsp;&nbsp;&nbsp;<br /><br />In fact the grading is quite good. I am below mean in both quiz, get full mark in attendance. Although the final exam marks wont be provided, it should be reach the mean (I guess). Finally got a B.",
            "comment_workload": "2 Quiz<br />10% attendance ( random )<br />50% Final<br />If you wanna get a good grade, you can read the reading material (optional)<br />Low workload",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "3atKuP8DbzdOVrmHb20Jh1RWYc80wN8x",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 309,
                    "name": "ZHANG, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "612",
            "date": "Jan 10, 2016",
            "title": "",
            "comment_content": "As suggested in the topic, it is about conceptual metaphors in both Chinese and English. Metonymy was also covered. <br /><br />It is better for Chinese to take the course as many examples and exam questions were in Chinese. Most foreigners dropped the course after the first lesson. <br /><br />Do not expect it to be a language course. It is more like understanding the logic in the metaphors. So fluency in English or Chinese wouldn't help that much as long as you can read.",
            "comment_teaching": "The teaching pace is quite slow and the tone of the professor was really boring so I didn't pay much attention in class. I just went to class for attendance taking. But the professor taught the materials in great detail(according to my minimal attention paid), so it would help on some topics that are difficult to grasp. <br /><br />The power point slides basically got everything needed. I just read through the slides before quiz and exam.",
            "comment_grading": "Attendance: 10%<br />10 Random attendance taken before the end of class.<br /><br />Quiz: 20%<br />A simple quiz based on conceptual metaphor.<br /><br />Assignment: 20%<br />It consists of 2 short essay questions. <br /><br />Final exam: 50%<br />MC questions, short essays, and data-oriented problem solving questions. <br /><br />I got 1 sd above mean for quiz, full attendance. Assignment and final scores were not released so I do not know how I performed. My final grade is satisfactory.",
            "comment_workload": "I would say the workload is light as there are only 1 quiz, 1 assignment and final exam. <br /><br />The quiz should be quite easy if you go through all the metaphors mentioned in class and those in past papers.<br /><br />The assignment is also quite easy to handle and research materials are available online. A couple of hours would finish the work. <br /><br />But expect the final exam is much more difficult than the quiz and questions require much more analysis and understanding on metaphors and metonymies. Past papers were provided for reference.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}