{
    "error": false,
    "course": {
        "id": 539,
        "subject": "HUMA",
        "code": "1920",
        "name": "Introduction to Moral Philosophy",
        "description": "This introductory course examines various beliefs and questions underlying our moral lives. These include the relation between morality and religion, subjectivism, relativism, self-interest, the rights and wrongs of euthanasia, etc. Also, certain ethical theories claim to help us make the right moral decisions, e.g. utilitarianism. This course is a systematic exploration of such beliefs and theories, emphasizing critical thinking and reasonable justification.",
        "categories": [
            "Common Core (H)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2010,
            1730,
            1710,
            1610
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.13,
        "rating_teaching": 3.94,
        "rating_grading": 3.5,
        "rating_workload": 3.44,
        "review_count": 16,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 955,
                "name": "BROWN, Nahum",
                "count": 12
            },
            {
                "id": 1504,
                "name": "WONG, T.Y. William",
                "count": 2
            },
            {
                "id": 1732,
                "name": "PROOI, Dennis",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "FwFZUbqjAyc3Wy0VjYweWnXXTXNngbm7",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1504,
                    "name": "WONG, T.Y. William",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "theos",
            "date": "Jan 30, 2021",
            "title": "",
            "comment_content": "1. Introduction<br />2. Divine Command Theory<br />3. Moral Relativism<br />4. Justice and Gyges Ring<br />5. Deontology I<br />6. Consequentialism I<br />7. Well-Being<br />8. Bioethics<br />9. Harm and Death<br />10. Euthanasia<br />11. Abortion<br />12. Eugenics<br />13. AI Ethics",
            "comment_teaching": "Professor Wong is one of the best professors in UST in my opinion. He understands that some concepts in philosophy may be quite difficult for some students and makes sure the students understand the concepts thoroughly. He always encouraged students to participate in class discussions and gave his insights which were helpful as well. He also gives helpful comments when writing long papers so do ask for help since we will provide thorough feedbacks which will definitely improve the quality of your paper.",
            "comment_grading": "Participation 10% (100%)<br />Term Test 15% (29/30)<br />Short Paper 25% (75%)<br />Long Paper 50% (78.5%)<br />Final Grade: A<br /><br />The points for participation and term test are easy to earn as long as you participate in class discussions. The short and long papers will need some effort in order to get a good grade since they require some deep understanding of the concepts discussed in class.",
            "comment_workload": "The workload is quite light. Would definitely recommend it as a CC course. The long paper would require some time and effort though.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ngxo7kvp09fv121PTUzYydCsJr5FM56e",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1504,
                    "name": "WONG, T.Y. William",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "puddypie",
            "date": "Jan 21, 2021",
            "title": "The best course in HKUST",
            "comment_content": "1: Introduction <br />2: Divine Command <br />3: Moral Relativism <br />4: Justice and Gyges Ring <br />5: Deontology I<br />6: Deontology II and Trolley Problem <br />7: Consequentialism <br />8: Consequentialism II <br />9: Well-Being <br />11: Bioethics Introduction <br />12: Harm and Death <br />13: Death and Dying <br />14: Euthanasia I<br />15: Euthanasia II<br />16: Abortion <br />17: Eugenics I<br />18: Eugenics II <br />19: Intro to AI Ethics <br />20: AI Explicability <br />21: Algorithmic Bias I<br />22: Algorithmic Bias II<br />23: Algorithmic Bias III <br />24: Course conclusion <br /><br />This introductory course examines various beliefs and questions underlying our moral lives. These include the relation between morality and religion, subjectivism, relativism, self-interest, the rights and wrongs of euthanasia, etc. Also, certain ethical theories claim to help us make the right moral decisions, e.g. utilitarianism. This course is a systematic exploration of such beliefs and theories, emphasizing critical thinking and reasonable justi\u001bcation.",
            "comment_teaching": "Dr Wong is one of the best professors that ever stepped foot in HKUST. You can tell even from the course structure that he is well-read, extremely smart, and tailor the course to today's needs. When it comes to introduction to philosophy, we commonly expect typical teachings like Plato, Aristotle etc. which can get a little repetitive at times. But as you can see, half of the course is on modern ethics, including topics like AI, abortion, euthanasia etc. <br /><br />What I found extremely exciting was how Dr Wong managed to link these two worlds together, using classical philosophy and modern-day problems. Some people may find it tricky as Dr Wong would go off topic and evaluate the student's opinion in his mind. But from the way that he thinks to the way that he explains his logic is remarkable. <br /><br />Too bad everything this semester is done online. The course had a lot of interaction, but you can tell its a little odd doing moral arguments online. I hope Dr Wong continues to teach this course, and I strongly encourage anyone who wants to learn about western philosophy and its application to our daily lives to take it.",
            "comment_grading": "Participation (attendance and interaction) : 10%<br />Term Test:15%<br />Short Paper (~2 pages) : 25%<br />Long Paper (4-6 pages ) : 50%<br /><br />Easy grading. Dr Wong always gives our participation points like its candy. He even has bonus participation points. As long as you talk a little this one confirm full marks. <br /><br />Term test. I was surprised at how easy this paper was. First part is logical reasoning - which is like, given 2 sentences would the 3rd sentence make sense etc. The second half is course content, which are all MCQ. Lastly, he asked us to write a counter argument to a theory that WE CHOSE (out of 7). So even if you only studied 1 theory, you can still get full marks. <br /><br />Short Paper: He gave like 10 topics and you choose 1. Only 2 pages. <br /><br />Long paper: You can choose ANYTHING, in or out of the course. He then looks at your philosophical reasoning. <br /><br />What is good is that Dr Wong gives you the score candidly, and then he also tells you how he distributes the final grade. So you can already know what your final grade score is like even before it is released. I think he marks quite reasonably. <br /><br />My score - A <br />Participation: 10/10 <br />Term Test: 15/15<br />Short Paper: 19/25 <br />Long Paper: 40.5/ 50",
            "comment_workload": "There is required reading before class, which would help you follow very easily. But even if you miss it, it's OK, Dr Wong explains the concepts quite intuitively. <br /><br />Minimal workload except when it comes to the papers. He very willingly provides you feedback, so you can always find him / TA for consultation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rHL6a37ziHqdHxQBf7hxTa4IftI5QCDQ",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1732,
                    "name": "PROOI, Dennis",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "準雷",
            "date": "Jul 18, 2023",
            "title": "幾有趣而且workload唔大嘅哲學入門course",
            "comment_content": "道德哲學入門<br />由最古代講到現代<br /><br />Introduction:<br />1. An overview of moral theories<br />2. Philosophical reasoning<br /><br />Part One: Ethical Theories of the Ancient World<br />1. Relativism<br />----------Midterm Exam start from here----------<br />2. Virtue ethics<br />3. Confucian ethics<br />4. Buddhist ethics<br />5. Daoist ethics<br /><br />Part Two: Modern Moral Theories<br />1. Sentimentalism and the is-ought fallacy<br />2. Act utilitarianism<br />3. Rule utilitarianism<br />4. Deontology<br />5. Egoism<br />6. Capabilities approach<br />----------- Midterm Exam up to here-----------<br /><br />Part Three: Applied Ethics<br />1. Animals<br />2. Nudging<br />3. Euthanasia<br />4. Abortion",
            "comment_teaching": "Dennis教得唔錯<br />上堂教書唔會趕進度<br />而且英文講得好好<br />Lecture powerpoint基本上有齊哂啲內容<br />入面有例子解釋唔同嘅哲學概念<br />算係哲學既入門<br />堂上佢都會再解釋返<br />但自己睇powerpoint理解都可以<br />佢唔會主動問問題<br />反而有好多同學問佢問題",
            "comment_grading": "Participation 20%<br />最少做8次200字左右嘅moral dilemma discussion<br />每個2.5分 做多過8次就計最高分嘅8次<br />My Score: 19.5/20<br /><br />Midterm Exam (Closed book, 80 mins) 30%<br />Short questions 5選4作答<br />Mean: 22.23&nbsp;&nbsp;(LQ: 19.5, Median: 23.25, UQ: 26.5)<br />My Score: 22/30<br /><br />Final Essay 50%<br />800-1200字, sem尾交, 題目自己定<br />要用一個part 1/2 moral theory<br />對應返一個part 3嘅applied ethics<br />Mean: 42.4/50&nbsp;&nbsp;(LQ: 40, Median: 46, UQ: 48)<br />My Score: 31/50<br /><br />Overall: 72.5%<br />Grade: C+<br />炒咗essay, 算係咁<br /><br />Tentative Scheme for conversion of total % to letter grade:<br /><br />97% or above = A+<br />93%~ = A<br />90%~ = A-<br />85%~ = B+<br />80%~ = B<br />75%~ = B-<br />70%~ = C+<br />65%~ = C<br />60%~ = C-<br />40%~ = D<br />Lower than 40% = F",
            "comment_workload": "一般偏低啦<br />TA有比discussion滿分sample<br />照住個套路寫就得<br />寫完自己嘅意見之後可以唔回應人<br />考試方面題目都好直接<br />所以唔洗睇哂reading<br />focus係reading questions就基本上都識答大部分嘅題目<br />Essay方面比較特別<br />只係要寫一個argument+counterargument<br />而且唔可以有logic fallacy<br />唔好用AI寫文+check grammar<br />Dennis只係care concept<br />所以1-2日時間應該都完成到",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JQtOojlEb4lVCoVYyWacd9HyuU6B0gzv",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1732,
                    "name": "PROOI, Dennis",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Benben",
            "date": "Jun 04, 2023",
            "title": "A Brief Introduction to Ethics",
            "comment_content": "As a introductory level philosophy course, it touches the very basis of the mainstream normative moral theories (part 1 of the course), such as utilitarianism, Kantian deontology, and virtue ethics. In part 2 of the course, there is several discussions and in-class debates related to contemporary moral issues, e.g., abortion, animal rights and euthanasia.<br /><br />One special feature of the course is the inclusion of the schools of Orient philosophy, e.g., Daoism, Confusianism, Buddhism. I believe that the scope of the curriculum would, to a certain extent, subject to the academic background and training of the instructor himself.",
            "comment_teaching": "The teaching team is nice and helpful. They are responsive to your inquiry. The teaching material is written in a concise manner that you don't really need to come to the lecture in order to understanding the materials. The lecture, however, is a little bit slow and boring.",
            "comment_grading": "Grading scheme:<br />Exam (30%)<br />Essay (50%)<br />Weekly Online Discussion Posts (20 %)<br />Bonus (obtained through participation in debates or outstanding performance in online Discussion)",
            "comment_workload": "",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ojnBPYuwGJjIMwrR9vKZq0THzEeeIMxv",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 955,
                    "name": "BROWN, Nahum",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "dc",
            "date": "Jun 12, 2018",
            "title": "",
            "comment_content": "Content itself was interesting as a business school student, as it covers quite some classic moral philosophical theories that really widens my horizon. These revolve around the themes of universal morality and global justice, supported by weekly readings plus two movies including:<br /><br />1. Plato, &quot;The Story of the Gyges' Rings&quot;<br />2. Hobbes, &quot;Leviathan&quot;<br />3. Berlin, &quot;Two Concepts of Liberty&quot;<br />4. Rachels, &quot;A Critique of Ethical Egoism&quot;<br />5. &quot;Socrates' Responses to Glaucon&quot; <br />6. &quot;Mencius' story of the child falling into the well&quot;<br />7. Buber, &quot;I and Thou&quot;<br />8. Aristotle, &quot;Nicomachean Ethics&quot;<br />9. Gansberg, &quot;Moral Cowardice&quot;<br />10. Mill, &quot;Utilitarianism&quot;<br />11. Kant, &quot;Groundwork for the Metaphysics of Morals&quot;<br />12. Arendt, &quot;Eichmann in Jerusalem&quot;<br />13. Thoreau, &quot;Civil Disobedience&quot;<br /><br />Movies:<br />1. 12 Angry Men<br />2. Citizen Four (Edward Snowden)",
            "comment_teaching": "Probably the worst teaching I have ever experienced thus far in HKUST. While the professor considered himself to be passionate, which was also undeniable, he just literally kept on referring to his Powerpoint slides, slide by slide and even word by word. Honestly, I could have read the slides on my own with a much faster pace than he did. <br /><br />While the efficiency might be only on a personal note, his repetitive and direct referral to the readings approach was the most demotivating, as he failed to bring in new insights on top of his talking.<br /><br />Even though he tried to engage in class with students through discussion, the time for open-discussion was too much, in a way that some seemingly active students might actually waste the class time when they raise irrelevant points without being stopped by the professor.",
            "comment_grading": "If the teaching and workload had been poor, the grading could only be the worst part of the course. As each score represents 1% in the total grade, you could easily lose a grade if you make one single careless mistake (e.g. in MCs), as the professor tends to give similar scores in the essays among the students. This simply shows the terrible grading distribution of the course.<br /><br />Also for the essays in midterm and finals, they were only tested based on recital, instead of any moral judgements or personal insights, which was a nightmare for a student who would prefer critical thinking (especially in an university course) to reciting stuff.<br /><br />Attendance: 16%<br />In-class Quiz: 12%<br />Midterm Exam: 36%<br />Final Exam: 36%",
            "comment_workload": "Workload was alright, given that understanding moral philosophy requires a large amount of reading in order to capture the ideas by the renowned philosophers. <br /><br />Yet, the professor could, and should have given much clearer guidance on the readings, such as a shorter summary, so that students may have a even better understanding, especially for those with classical English writings.<br /><br />Also, as the Powerpoint never explains the readings well (professor only quoted from the passage usually without really any analysis), it was really annoying during the post-class revision, especially after a torture from a rather boringly educated lecture.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rni1nbA7Wd62r3GJGZfrO6z0HT0zLUdT",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 955,
                    "name": "BROWN, Nahum",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "MickeyBrilliant",
            "date": "May 08, 2018",
            "title": "Challengeable course",
            "comment_content": "Course Outline:<br />-Plato, “the Story of Gyges’ Ring”<br />-Hobbes, Leviathan <br />-Berlin, “Two Concepts of Liberty”<br />-Rachels, “A Critique of Ethical Egoism”<br />-Socrates’ Response to Glaucon;<br />-Mencius’ story of the child falling into the well<br />-Buber, I and Thou<br />-Aristotle’s Nicomachean Ethics<br />-Gansberg, “Moral Cowardice”<br />-12 Angry Men<br />-Mill, Utilitarianism<br />-Kant’s Groundwork for the Metaphysics of Morals<br />-Arendt’s Eichmann in Jerusalem<br />-Thoreau, “Civil Disobedience”<br />-Citizenfour (Edward Snowden)<br /><br />The lectures mostly analyse the readings/movie mentioned above.",
            "comment_teaching": "Personally speaking, Dr. Brown's lectures are just not so rewarding even if he has tried very best to interact with students. Maybe it is about my poor english, but at most of the time he is just talking stuff that are out of the focus, and sometimes he is not able to answer student's question. (although i know there is no accurate answer for philosophy)<br /> I think only would those talented in english can found his lectures rewarding (or maybe not). <br /><br />Therefore, while reading the readings, we need to go up to find the sparknotes or go to youtube to know more about the contents which means that it is difficult to understand in the lessons.<br /><br />Nevertheless,Dr. Brown is really nice at all time.",
            "comment_grading": "Attendance: 14%<br />(3 hours lecture-&gt; Session 1 and Session 2 (0.5 marks each))<br />In-class Quiz:12% ( mean = 8.4)<br />Midterm Exam (mc,T/F, essay) :37% <br />( mean= 29.9 while median = 32)<br />Final Exam (mc,T/F, essay) :37% <br /><br />I think it's quite hard for students who are not good at english to get a good mark.",
            "comment_workload": "The workload are extremely high as there are huge amount of reading materials for you to read every week, so if you are not good at reading you must find it terrible to handle.<br /><br />Also, if you are not able to follow every steps of the lectures ( fyr 3 hour lecture with 10 mins break :)) <br />You may have self study on the ppt he provided.<br />And the killing part is that!!!!!!!!! Many of his ppt slide is just&nbsp;&nbsp;'whole paragraph from the readings + a title = one ppt slide'<br />And this is the most disgusting thing for this course.<br /><br />In conclusion, if you wanna reg this course you need much courage, time and patience.<br /><br />So,think carefully before you reg this course!!!!!!!!!!",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SbaujSa7w46iaL2JnbASNc4Ol0Z3Z3cA",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 955,
                    "name": "BROWN, Nahum",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "karenleungxx",
            "date": "Jan 09, 2018",
            "title": "",
            "comment_content": "Readings written by a few classical philosophers, professor brown usually only explains a few important topics/themes instead of going through the whole thing.",
            "comment_teaching": "I'd say he's a passionate teacher, but that doesn't mean he's a good one. Reading the whole thing directly from the powerpoint is one of the things he loves doing (AND THE THING I HATE MOST) though there's a thorough elaboration afterwards, it really irritates me a lot.<br />He's really willing to answer any questions and encourages students to raise their hands during lectures, but honestly I don't think he's really able to answer most of them...sometimes he replies with stuff that has nothing to do with the question LOL<br />Usually the last 20 minutes are reserved for group discussions and he'll pick some groups to present their ideas, personally this section gives me more insights than the teaching.",
            "comment_grading": "Really good grading, if you go through the readings and memorize the main points you're likely get a really good grade. Trust me it's really easy to get full marks in quizzes if you study, it's all about memorization.<br /><br />Attendance: 17% (1% x 17 out of 18 classes)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />Three Quizzes: 83% (Quiz 1: 30%; Quiz 2: 23%; Quiz 3: 30%)",
            "comment_workload": "Had quite a hard time going through the readings cuz the words were small, and seriously some readings were super long. Stressed a lot before the first quiz, only to find out that the quizzes merely require memorization instead of your personal views. Not really something you'd want if you're an insightful person and honestly people were quite pissed about this, but hey, if you're looking for a course with good grades you're in the right place.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Jj82AwwjaJmsRy7RAoOxs77697nQb07C",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 955,
                    "name": "BROWN, Nahum",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "RichardY",
            "date": "Dec 29, 2017",
            "title": "",
            "comment_content": "The content centers around several classical philosophical pieces including the Story of Gyges’ Ring, Leviathan, Two Concepts of Liberty, A Critique of Ethical Egoism, story of the child falling into the well, I and Thou, Nicomachean Ethics, Groundwork for the Metaphysics of Morals, 12 Angry Men, Arendt’s Eichmann in Jerusalem, Civil Disobedience, On What We Can Not Do, Citizenfour.",
            "comment_teaching": "The teaching is extremely slow and repetitive. Very boring due to the endless repetition of trivial matters (like definitions). You would expect a philosophy course to be much more interesting than that. Very often just scratch the surface of the issues discussed. Nonsense grouping for a course without group project which prevent you from hearing more diverse views. Technically, you are better off to just self-study (unfortunately he took attendance every class)",
            "comment_grading": "The score of the last quiz has not been released so cannot tell for sure but the grade at best is average. Coupled with the piece-of-shit quiz, you shouldn't expect you will do better than others necessarily even if you have a deeper insight.",
            "comment_workload": "Tons of reading but skippable if you have enough background knowledge. Alternatively, you can read online summaries. Only 3 short quizzes (which are total crap). The quizzes are designed to encourage word-by-word memorization and do not reward understanding of the issues discussed.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Z9in2wRc3Yjui9TnDJQ5Qkq9asOSe2Ku",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 955,
                    "name": "BROWN, Nahum",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ycfelix",
            "date": "Dec 06, 2019",
            "title": "Excellent course if you love thinking",
            "comment_content": "The content are quite easy like ome old philosophy from ancient Greek. For example the Story of Gyges’ Ring. You can get the idea instantly if you have done some liberal studies before, as the ideas are close to each other especially which is meant by just and unjust. Choose this course if you are into politics or you have thought about what is justice and how to justify it.<br /><br />All theories are story-based, as long as you remember the story, you won't need a lot of reading and revision because you will have chance to discuss with people around you every lecture.",
            "comment_teaching": "The teaching is quite good. He speaks clearly and make sure everyone can understand and follow his steps. He doesn't like people playing mobile phones or computer on his class so be careful.",
            "comment_grading": "Attendence+3 quiz. No midterm no final.<br />The grading is fair to good, I got above mean a little bit and I get a B+ afterall. I got 10/12 and the mean is 8.4/12. I got slight above mean in the 3 quiz.",
            "comment_workload": "The workload is actually very light. One lecture per week, one reading per week( I didn't read at all), no assignment, no midterm final just 3 simple quiz to test if you really attend the lecture without sleeping. If you stay awake in class and have some group discussion with your classmate then it's already enough for you to finish the quiz.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "m9ZEEkKRlu7lhKjHWMc3kalExWFMKbpy",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 955,
                    "name": "BROWN, Nahum",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nicky30",
            "date": "Aug 23, 2018",
            "title": "",
            "comment_content": "Arendt, Eichmann in Jerusalem<br />Aristotle, Nicomachean Ethics<br />Berlin, “Two Concepts of Liberty”<br />Buber, I and Thou<br />Gansberg, “Moral Cowardice”<br />Hobbes, Leviathan<br />Kant, Groundwork for the Metaphysics of Morals<br />Mencius, The Book of Mencius<br />Mill, Utilitarianism<br />Plato, The Republic<br />Rachels, “A Critique of Ethical Egoism”<br />Thoreau, “Civil Disobedience”",
            "comment_teaching": "Professor actually explain quite clear about the moral values of the philosopher.",
            "comment_grading": "Most of the student will be able to obtain a high marks, however, it doesn't mean you can get a good grade.achieving a mean can only bring you a C range.",
            "comment_workload": "we are required to read the reading material before the lessonsThere is one more quiz.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wOxTAdNXCJP9COnL3uGGv32g1OMpnYYE",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 955,
                    "name": "BROWN, Nahum",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "smallpotatoes",
            "date": "Jun 05, 2018",
            "title": "Interesting but definitely not a good grade course for students unfamiliar with philo/hate memorizing/both",
            "comment_content": "I think its great and suitable for common core. I have no philosophy background, but i can understand the content in the lectures as long as you are paying attention and using your brain. The theories are fine but the examples are fun:)",
            "comment_teaching": "Great. In every lecture, prof would try to use as much time as possible to discuss which (if you are newbie to philosophy like me) you can listen to those pros expressing their opinions and arguments.) This is sometimes interesting and intriguing to me.",
            "comment_grading": "This is the 1st course I struggled. Since there are a lot fierce people in the class. If you come for interest and dont care about grade like me, then it would be a good choice.<br /><br />A lot of memorizing, memorize all the words on PPT, or sometimes in the reading:)<br /><br />For quiz: all mcs<br />For midterm and final, mcs, true/false, fill in the blanks and essay<br /><br />Attendance: Full<br />Quiz: 9/12<br />Midterm: 30/37<br />(LMAO, the mean is 29.x, median: 32, and mode:35)<br />Final: idk but i studied hard<br /><br />Overall grade: B",
            "comment_workload": "The readings are definitely killing me in this course since i hate reading lol. On average, you got ~20pages or more for reading. More:) importantly, some readings are written in old English, I just lost all the motivation when reading them cause it's super hard for me to understand the reading.<br /><br />Sometimes it's quite torturing to have a 3-hour lecture though there is a break.<br /><br />Other than these, the workload is fine:0",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sKnyXatC8nzh6AEHVd9d6ErOTsyCswKM",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 955,
                    "name": "BROWN, Nahum",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "茄子",
            "date": "Jan 26, 2018",
            "title": "Interesting readings, but the english can be hard",
            "comment_content": "Readings:<br />1. Gyses' Ring by Plato<br />2. Leviathan by Hobbes<br />3. A Critique on Ethical Egoism by Rachels<br />4. Story of a child falling into a well by Mencius (in English)<br />5. I and Thou by Buber<br />6. Nicomachean Ethics by Aristotle<br />7. The Moral Law by Kant<br />8. Eichmann in Jerusalem by Arendt<br />9. On What We Can Not Do by Agamben<br />10. Two Concepts of Liberty by Berlin<br />11. The Volunteer in Auschwitz by Colson<br />12. Moral Cowardice by Gansberg<br />13. Socrates Response to Glaucon (related to Gyses' Ring)<br />14. Civil Disobedience by Thoreau<br />15. Articles on Edward Snowden<br /><br />Movies: <br />1. 12 Angry Men<br />2. Citizen Four",
            "comment_teaching": "For explaining the content of the readings, Brown usually go through the powerpoints in class, and stops in between slides to further explain and allows time for questions. Afterwards, there will be discussion question(s) and gives you time to discuss with your group mates, he will randomly ask a group to present their thoughts and discussion to the class. It is very casual, so there is no need to be nervous.<br />He also doesn't mind students asking questions after class ended, and encourages students to speak to him. He is a very good instructor.",
            "comment_grading": "17% Attendance (17/17)<br />3 quizzes: (will not quiz you on the content tested in previous quizzes)<br />Quiz 1 30% (23/25)<br />Quiz 2 23% (18/20)<br />Quiz 3 30% (don't know)<br /><br />Final grade: B+",
            "comment_workload": "Have: <br />1. Readings (average 1-2 readings per week, length of reading varies). It is mostly written work, but there are movies which will be played during class.<br />2. Quizzes (completely fact-based, if you memorise and revise, you can get high marks)<br />3. In-class discussion every lesson (with your group mates, assigned by instructor randomly)<br /><br />Readings can be hard to understand (having good english comprehension skills is definitely an advantage), especially 'Leviathan' by Hobbes and 'I and Thou' by Buber. Take the initiative to ask questions! Brown will answer them as best he can (even after class). Forming study group is also very important, so you can revise together and discuss the readings for further understanding.<br /><br />Don't have: mid-term, final, homework.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yz94IpH7mN3JYarfgACSpwsft6rbgmDi",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 955,
                    "name": "BROWN, Nahum",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Louiseeeee",
            "date": "Jan 19, 2018",
            "title": "",
            "comment_content": "Topics covered:<br />- universal morality<br />- global justice",
            "comment_teaching": "Very interactive (especially between the professor and the exchange students!) and thought-provoking!<br /><br />Prof. Brown tends to briefly introduce the philosopher/ background before going through the ppt slides. At the end of the class, there is always group discussion time.<br /><br />Prof. Brown always welcomes students to raise questions! :)",
            "comment_grading": "Attendance: 17% (1% x 17 out of 18 classes)<br />Three Quizzes: 83% (Quiz 1: 27%; Quiz 2: 28%; Quiz 3: 28%)<br /><br />- MC<br />- true or false<br />- short questions<br />- long essay",
            "comment_workload": "At least one long reading material for each lesson<br /><br />I suggest you to briefly go through the reading materials before going to class as the professor doesn't usually give you time to read in class.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rWpkBf5v9quTLBA7GWV6iQByQBIhQ00r",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 955,
                    "name": "BROWN, Nahum",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "1216",
            "date": "Jan 07, 2018",
            "title": "easy memorization grade",
            "comment_content": "As others have mentioned, covers a wide range of philosophy spanning over quite a wide time period, from western to eastern, long ago to current. Personally thought that it's pretty well organized in the sense that the later content will include some topics covered in the beginning. It was my first ever philosophy course and it was quite interesting to see an overview of some of the most popular philosophers. Gave me some general insight into the field.",
            "comment_teaching": "He's genuinely interested and passionate what he teaches -- to a point where you feel that he's sometime up in the clouds just really pondering about these theories. <br /><br />I was with a bunch of exchange students in our group and we were probably the most vocal in the class. Not sure why but he never came to our table to talk to us -- maybe we ask too many questions that don't have answers? Or can he not answer them, I dont know. <br /><br />If you have any questions, especially while studying for your exams, you should email him since he replies really quickly in great detail, too.",
            "comment_grading": "As long as you spend some time memorizing everything, it's really easy to get 90% + on your quizzes. While you're studying, just read all the notes and if you didn't quite understand the reading, just go search up the summary online. A high score on the quiz does not necessarily translate to a thorough understanding of the content, but rather good memorization. While you're studying it's quite easy to predict which ones will be tested -- the ones that are covered in detail.<br /><br />quiz 1: 94%<br />quiz 2: 90%<br />quiz 3: grade not revealed<br />participation: missed 2 classes (-1%)<br /><br />overall grade: A<br /><br />basically just memorize everything since the questions are quite straight forward",
            "comment_workload": "Compared to most courses in HKUST, this is a pre-lecture preparation heavy course in the sense that sometimes you have a thick packet of 19+ pages in ultra-small fonts that you have to read over the weekend. But to be fair those really thick packets are usually taught over a course of 3 days (1.5 week) so you can just divide it up into 3 parts and try to read them in time. Having gone through the AP system &amp; SAT, the reading wasn't too challenging and manageable if you don't push the reading to the last minute. I think also cause I enjoyed the content that It was alright. But if you aren't a quick reader of English, then workload is probably around a D.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WUisJTG7Oxtu4MXmGhnIqtc8qa9quCte",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 955,
                    "name": "BROWN, Nahum",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Daniel LU",
            "date": "Sep 03, 2017",
            "title": "Nice Class but a little difficult",
            "comment_content": "由于课程是道德哲学导论，因此涉及的面比较广，从苏格拉底柏拉图亚里士多德，到霍布斯和康德，以至于到近代的梭罗。对于哲学入门者而言有很好的扩宽视野的作用。阅读文本大多是经典著作中的经典篇章，上课的PPT主要是提纲和问题，因此课后阅读内容还是很重要的。",
            "comment_teaching": "上课开始是简略介绍哲学家生平和哲学思想，然后大部分时间用来对其文本中所涉及的哲学思想进行讨论。课堂气氛很活跃，教授经常会提出一些启发性的问题，然后鼓励大家从不同角度来进行思辨，课堂上经常会有辩论，如果认真参与课堂会大有收获。",
            "comment_grading": "midterm 和 final 全部是MC + 判断题 + essay question<br /><br />mc中会出现一些细节问题，包括某篇文本中的某个上课没有讨论到但是要求阅读的理论，一定要认真读阅读材料才行。<br /><br />essay question对英文不好的同学来说挑战很大，每个question都是200-400词，相当于一篇当堂小essay<br /><br />最后拿的是B，一方面因为essay question表现一般，另一方面因为全堂有很多文院大神，真的很厉害。",
            "comment_workload": "要想上课不坐飞机，最好在课前提前读完要求的文本，因为课堂上几乎没有时间留给大家阅读，而上课讨论的内容全部是基于文本展开<br /><br />阅读文本都是一些不太好懂的哲学经典，尤其是亚里士多德和康德，句法和词汇都有一定难度，就算能读懂字面意思也不一定能理解概念，因此阅读workload还是比较大<br /><br />平均每周会有一个当堂quiz，难度不大，一个essay question（其实更像是discussion），主要是用来check attendance的，只要写了就是满分",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TOJJnWehOhFAI9cxm9vUNREzqW9MqC60",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 955,
                    "name": "BROWN, Nahum",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chiucw",
            "date": "Feb 03, 2017",
            "title": "",
            "comment_content": "Rich content and quite a no. of famous and influential pieces are covered. There is also 7 attendance-taking pop quizzes throughout the semester. Should be fine as long as you attend and do the quizzes, the content doesn't really matter.",
            "comment_teaching": "The prof is very knowledgable in his area. He likes interacting and inviting students to share their ideas a lot in class especially. He is also very friendly and patient when answering questions.",
            "comment_grading": "Grading is good. I think the professor is quite generous in this area. He cares a lot about class participation though.",
            "comment_workload": "Workload is a bit heavy and have readings almost every week. The readings are sometimes quite long and difficult to understand.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}