{
    "error": false,
    "course": {
        "id": 575,
        "subject": "HUMA",
        "code": "2623",
        "name": "Cultural Sustainability in South China",
        "description": "In the past decades, local societies in South China experienced significant changes and many local customs and traditions are disappearing as a result of China’s rapid urbanization and economic growth. The sustainability of local cultures has become a major concern. Culture is an important component of sustainable development, as it refers to how we understand and appreciate natural resources and each other. Cultural sustainability requires the recognition of indigenous cultural values and standards, as well as equal rights of the respective communities in policy planning and decision-making, and the engagement of the local community and members of the public. This course adopts an interdisciplinary approach to explore the concept, possibilities, and limits of cultural sustainability. Students are required to conduct field research projects in the Pearl River Delta region, in which they will meet the local residents and have personal fieldwork experience through interviewing and participant observation.",
        "categories": [
            "Common Core (H)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2110,
            1810,
            1710,
            1610,
            1540,
            1510,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.5,
        "rating_teaching": 4,
        "rating_grading": 4.5,
        "rating_workload": 5,
        "review_count": 2,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 315,
                "name": "WONG, Wing Ho",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "M0ctJvno5sX6jSYAQjDsOvBmqvmKC9gJ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 315,
                    "name": "WONG, Wing Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hahayeah",
            "date": "Jan 19, 2019",
            "title": "a must reg subject",
            "comment_content": "A must reg course! Content is simple, mainly around history of Hong Kong development and later about the heritages and their conservation.<br />you will get a satisfactory grade here as far as you had paid effort!<br />Course is conducted in Chinese btw",
            "comment_teaching": "Professor is really nice!!!!! I love him though he is like above 60 years old uncle talking about Chinese History. However, class is a bit like history class but I still enjoy it a lot!",
            "comment_grading": "To be honest, I got an A- but i got lowest in the first essay, 29/30 in midterm and the final project our group had performed relatively better than the other one (FYI, there is only 2 groups in the whole class lol)<br />However, this A- is already a bad grade cause all classmates got A- or above.<br />Unbelievably good grade. Trust me!",
            "comment_workload": "Workload is very low. There is no final exam but a project that requires you to present a concept (or anything you think that is worth presenting and can help you to get a good grade) which lasts for 30 minutes and final report for 5000 words(workload is shared among your group). The marking scheme not really legit, to be exact, there is no marking scheme, the mark depends on how professor feel lol But as professor is really nice so as far as you had tried you best to work on your presentation, the result will reflect your effort! Professor wants us to have site visit a lot as he thought it is the best way to understand a place so recommend you to have site visit in case your project is related to a building.<br />Presentation is very easy as it can be conducted in Chinese and just present what you had found. <br />Midterm is super easy. It is like LS exam that includes question asking for definition and some point of view. All answer is emphasized in class many times already. (FYI, this A- is the first a range i got in UST so you can imagine how easy is the exam here!)<br />you need to write 2 essays as well. But its really easy (I know you are thinking I am saying easy again lol but that's the truth!)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BCQfyWhKDmiddN7VZMjv0ne5Vw0ayXB3",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 315,
                    "name": "WONG, Wing Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "helloworld",
            "date": "Jan 12, 2017",
            "title": "",
            "comment_content": "The course discusses culture and its conservation in southern China, most cases studied are either in Canton or in Hong Kong, but if you prefer I think it is fine to do your group paper on Macau as well. Topics discussed include what culture is, what sustainability is (in biological, economic and cultural sense), lineage system in southern China (skipped during lectures due to tight schedule, yet still mentioned during field trips), popular religion, heritage conservation. Due to the large number of topics, each of them is only barely discussed and you should do reading/extra readings if interested to really get something from the course.<br /><br />Two-hour-long lectures every week plus two one-hour-long tutorials in late Sep and mid Oct resp. plus three compulsory field trips to Tai Hang, Tai O and Canton resp.",
            "comment_teaching": "Dr. Wong attempted to use a more 'interactive' approach in teaching, which usually involves he speaking a little bit/playing some clips followed by discussions, however due to the lack of reading materials most discussions ended up in talking craps. Also, I do feel the course, due to its content, its instructor and its students, would be better taught in Chinese.<br /><br />The first two field trips were not well-organised imo, very few explanations on what's going on and of the big picture of the place, also no interview conducted with locals, which is quite weird in an anthropology course. The third field trip to Canton, yet, is much more interesting and educational, though lack of time is still a major issue.",
            "comment_grading": "iirc 10% attendance and participation, 35% assignments, 5% presentation, 25% group essay and 25% mid term.<br /><br />not sure about the grade distribution but it's more likely that absolute grading is used instead of curve-drawing.<br /><br />Doing pretty well in the first assignment, okay in midterm with all other parts' scores not revealed earned me an A-.",
            "comment_workload": "Workload as a HUMA course is quite low. Throughout the semester only ~10 pieces of readings. The 2 assignments are 1500-word-long essays, one on food culture in Hong Kong and one on heritage conservation policies in Hong Kong. Midterm lasts for one hour, 2 out of 4 essays are to be written. Group project (3-4 ppl per group) involves an original field research on cultural sustainability with a 30-minute presentation and 15-page essays.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}