{
    "error": false,
    "course": {
        "id": 2638,
        "subject": "HUMA",
        "code": "2588",
        "name": "Nazism and German Society, 1914-1945",
        "description": "This course surveys German history from 1914 to 1945, with a focus on the rise, rule, and destruction of National Socialism. Topics to be covered include the First World War, the Weimar Republic, the emergence of the National Socialist movement, consent and coercion in the Third Reich, the racial state, Hitler's leadership, the Second World War, and the Holocaust. In addition to mastering historical concepts and narratives, students will sharpen their abilities to read sources and write analytical essays.",
        "categories": [
            "Common Core (H)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2010,
            1810
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"HUMA\" data-code=\"2589\" href=\"/review/HUMA2589\" target=\"_blank\">HUMA 2589</a> (prior to 2018-19)",
        "rating_content": 4.93,
        "rating_teaching": 4.93,
        "rating_grading": 4.29,
        "rating_workload": 3,
        "review_count": 14,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 314,
                "name": "DERMAN, Joshua",
                "count": 13
            }
        ]
    },
    "reviews": [
        {
            "hash": "N4EJt7PJPZkaS5tbRqX0FAg7ASMoPbiX",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ahahahahahaha",
            "date": "Jan 05, 2021",
            "title": "Absolutely love the course",
            "comment_content": "Before midterm: Mainly focus on how Hitler got into power, his ideology (you will have to read Mein Kampf which is a bit disturbing but quite interesting), his propaganda strategies, etc. You'll know more about how Nazis reach out to people and why people support them. The readings are very interesting. <br />After midterm: About how Germans were having discontent towards Hitler but chose to conform in some ways, Hitler's aggressive foreign policies, the WWII, the mindset of people who kind of 'help' the massacre.<br /><br />Overall, really great course. I love all the assigned readings except for Allen's book (which is about a small town called Northeim). People at that time had interesting thoughts. I can relate it so much to modern politics (like rise of racism and white supremacy and even the protests in hk). I have to say that I do not like history that much in secondary school (did not study it in high school), but I'm always interested in rise of Nazism. If you want to know more about WWII, you'll enjoy the reading and get a good grade.",
            "comment_teaching": "Professor Derman is very kind. He is very knowledgable and if you ask something that he is not sure about, he will tell you honestly that he doesn't know (I love how candid he is). You can arrange an appointment with him about your term paper and anything you don't understand about the reading materials. <br />For half of the lesson time we are divided into an assigned group to discuss the questions he gave us. He'll give some explanations after the class discussion, which will help you revise and write your term paper.",
            "comment_grading": "Class participation (Attendance and class discussion) 15%<br />Group presentation 15% (My group: 96/100, mean is ~90ish)<br />Term paper 30% (Me: 90/100, mean unknown, but I think I just got around mean :'(((( )<br />Midterm 20% (Me: 98/100, forget the mean)<br />Final 20% (Me: 100/100, mean unknown)<br />Overall, A<br /><br />Midterm and final are really easy, open book with 70% MCQs and 30% identification question. Not sure if the TA just give 30% to everyone for their identification question, since I thought I didn't answer well. MCQs are just facts, so you can find it in the book. Identification questions are something like &quot;Describe the few strategies Nazi Party consider for dealing with the Jewish Problem&quot;. You're given 3 hours to finish all, so you know you don't have to hurry.",
            "comment_workload": "Presentation: Each student is only required to present for 5 mins, while there're so much to talk about on the topic. Even if all your groupmates freeride, you can still finish it. My groupmates are quite nice tho, we had two rehearsals before the presentation.<br /><br />Class discussion: He'll assign you to a breakout room with your assigned groupmates after add/drop period. It's a good chance for you to discuss what you've read with your classmates and see if you miss out anything. Then when you go back to the main room he'll ask people to raise their hand and speak. I think most people spoke at least once in class discussion session. I would encourage you to speak as much as possible since he'll not accuse you of any wrong answer. You can check if you understand the materials correctly. Make sure you attend all the classes since attendance will be taken.<br /><br />Term paper: Tbh it's quite easy if you attended all the lessons and understand the assigned materials. If you have any question, just ask the professor and you should be fine.<br /><br />Reading materials: It's the tough part. I'll suggest you to read ahead in the early few weeks so that you catch up with the progress. If you can't finish it, you can split the readings with a friend (I did that, like I read half of the materials and wrote some notes and shared the notes with my friend) or just skim through the materials real quick. If you don't read the materials for some time it'll be hard to catch up (Im serious)<br />If you couldn't finish (which you really shouldn't), I would recommend you to at least finish Epstein's book (Nazi Germany: Confronting the Myths) as it gives you an overview of all the things that are happening.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "PnzkCxAISqCa0AUu0nwiifAaZ29XlgXj",
                    "name": "Epstein 2015, Nazi Germany",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "MArOt4YjUjx0n7qYJet9MEaYkvx8IrBI",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "qjk",
            "date": "Dec 29, 2020",
            "title": "Interesting course",
            "comment_content": "About the history of Germany, all the way from 1871 (unification) to 1945 (end of ww2). The focus is mostly on ww1 and ww2 though.<br />Before the midterm, you will learn about the politics of the German Empire and the Weimar Republic (pre-Nazi) and after the midterm, you will learn about the Nazi regime and ww2.",
            "comment_teaching": "Prof. Derman is a good teacher. Send your questions to him through email and he will answer them in detail and patiently.<br /><br />Around half the lessons were lectures and half were discussions, where you had to do some reading and during the lesson, the professor would pose some questions and you had to discuss with your group in breakout rooms then after the group discussion everyone goes back to the main room and you can raise your hand to answer the questions.",
            "comment_grading": "Scheme:<br />Midterm 20%<br />Finals 20%<br />Term Paper 30%<br />Presentation 15%<br />Participation 15% (also counting attendance)<br /><br />Me:<br />Midterm 100/100 Mean was ~84 if I recall<br />Finals 98.5/100 Mean Not Released<br />Term Paper 95/100<br />Presentation 91/100 Mean ~90<br />Participation Not Released, but I answered questions in around half the discussion lessons and attended all the lectures<br /><br />Final Grade: A<br />I'm quite disappointed that I wasn't able to achieve an A+, considering I scored full marks in the midterm and near full marks in the finals.<br /><br />I would say it isn't hard to get A range if you are hardworking and keep up with the readings, but A+ probably doesn't exist.",
            "comment_workload": "The workload is inhuman, there are shit tones of reading to do each week, anywhere from 20 to 100 pages. I think on average there are 80 pages per week. If you fall behind on the readings you would be in big trouble.<br /><br />The Term Paper took me a few days to write. We needed to incorporate knowledge from all the readings in the paper so I imagine you would be in big trouble if you skip the readings.<br /><br />The presentation is done with your group (the same group assigned to you for the group discussions). You have to divide the work among yourselves so make sure to snatch all the good topics or else you will end up with the shittiest parts like me.<br /><br />The good thing is the midterm and the finals are trivial. They are open book open notes, but no googling, and it is ok to just review the powerpoints the night before the exam. Some of the notes are in scanned pdf format where you can't ctrl-f search, so convert them into docx and back to pdf so you can ctrl-f search during the exam and save a lot of time.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lvXimu3LHzLumu8i9hsxs1QOFE4OY2rq",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ektz23",
            "date": "Jan 20, 2023",
            "title": "If you don't like history, think twice before you enroll",
            "comment_content": "講1914-1945嘅德國，但只有好少講緊兩次世界大戰嘅野，無咩講七月危機，馬恩河奇績，瓜分波蘭，蘇德戰爭呢類野，所以戰爭愛好者/軍迷慎入，個course主要講1918-1939嘅德國內政， focus on Nazi background，比如Weimar Republic嘅混亂，Nazi 成功奪權嘅原因，點解Nazi會有人投票，the great depression and WW1 如何成就Nazi。雖然有一定嘅history knowledge 嘅人可能唔溫都答到，但上堂同考試會去得好深，所以唔建議free style, 多d背書。",
            "comment_teaching": "Professor好有料，但奈何小弟無料，所以好多時聽到想訓。上堂有兩種模式，一系Professor對住個PPT教書，但佢講嘅野好多PPT都有，所以其實可以唔聽。二系group discussion based on assigned readings，然後professor會叫人答問題，呢個就真係要聽，因為PPT無。",
            "comment_grading": "無講mean，幫唔到大家，但我估個個都好高分，想A range一定要努力溫書，好似我final無溫書就即刻GG左。<br />15% Participation (95.5/100)<br />15% project (94/100)<br />30% essay (86/100)<br />20% mid-term (86/100)<br />20% final (62/100)<br /><br />Overall: 83.8%<br />Grade: B",
            "comment_workload": "都幾重。每堂都有幾十頁assigned readings，幾日係好難睇得完，但唔睇就等住group discussion口啞啞，而且會令你project, essay, mid-term同final好大鑊。<br /><br />小弟由於太懶所以十月頭開始就無睇readings，上堂趁discussion就抄低其他人嘅findings當係自己野，當然如果你0 history background就唔建以因為你有可能聽唔明其他人講咩從而唔知抄咩好。",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XWdc45zkJguBO070elRjzkT6zfwvrB9P",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bruh123456789",
            "date": "Jan 18, 2023",
            "title": "Remember to finish the reading every week",
            "comment_content": "As the course name suggests, it covers contents from 1914-1945, but the course of ww2 is not detailed. If you are coming for major ww2 events like Stalingrad, D-Day, North Africa Campaign, you will be disappointed.<br />Before midterm: Hitler's early life, German Empire (very briefly compared to contents about the Weimar Republic), Weimar Republic<br />Afer midterm: Nazi Germany in every aspects and its downfall <br />There is a discussion per week regarding the reading materials&nbsp;&nbsp;and the prof will assign the group discussants for you.(for reading materials, one of the reading you will need to read for most of the semester is called The Nazi Seizure of Power, check it out and see if you find it interesting before enrolling)",
            "comment_teaching": "Prof is willing to answer questions. If you have any questions regarding the contents/assignments, make sure you ask him.<br />Since I had studied history before, and I am sort of a history enthusiast, so I am familar with around 60% of the contents in the lectures, therefore I am not paying great attention during the lessons.",
            "comment_grading": "Disclaimier: I had studied History in Secondary School (bruh why am I in UST)<br />I forgot the details about mean, SD, highest :(<br />Midterm: 96/100 (above average, but someone in my group claims he gets 99/100)<br />Project: 86/100 (the prof didn't mention the mean etc.)<br />Essay: 84/100<br />Final: 94/100 (above average as I remember, and not highest too)<br />Grade: A-",
            "comment_workload": "You are required to read around 50 pages of reading (sometimes a movie) per week for discussions, but they are very useful for all assignments and exams, so make sure you read them. And tbh I don't feel there's a huge advantage for someone studied History in high school as the readings will provide most infomation you need in exams and assignments, which I haven't come across before back in high school. (That's a lot especially when you were busy with other assignments)<br />The group discussants are also the groupmates for the presentation, make sure you participtate in the discussion and leave a good impression. And for the presentation, you can finish it rather quickly if all of you had read the readings since the questions are basically copying infomations from the readings and lecture notes.<br />The term paper also require you to read the readings and watch the movie to answer the questions. <br />Attandance is required, make sure you attend the lectures (rip to my groupmate skipping every lessons before midterm)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "m7HCmlJNbiq5MbLPDTXiprpzpOC0uxrI",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ROGYNNUS",
            "date": "Dec 23, 2022",
            "title": "Interesting Course with Fair Grade",
            "comment_content": "This course includes the history from World War I til the end of World War II, contents were interesting and would definitely help you have a deeper understanding of Germany and the Nazi regime. I would recommend this course if you are someone who is into listening to history stories and interested in war. Half of the lesson is also a a discussion session, so you must read the required readings ahead to participate in the discussion.",
            "comment_teaching": "Professor Derman is a very kind person who is willing to help and answer questions from students. It is recommended to setup meet ups with him before the term paper or presentation so he might be able to help you perform better in the tasks.",
            "comment_grading": "Fair. I got a B from 8x/100. Perhaps everyone did very well in the course.",
            "comment_workload": "Quite a lot. You have do a lot of after-class readings. Around 60-70 pages each week. There is also attendance so you must go to every class. The exam is close book so there is quite a lot of stuff to memorize.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Yvi08fE0CGn0wmQTxOB33zFDeWsMdA86",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "#001/BULBASAUR",
            "date": "Dec 31, 2020",
            "title": "Came for the meme, left with historical insights and depression.",
            "comment_content": "TL;DR: You will learn about things that happened before AND after Hitler's assumption of power. Take this into consideration before enrolling into this course for the meme (which I did).<br /><br />- - - - -<br /><br />This course will mainly go through the history of Germany during 1914 (the start of World War I) and 1945 (the end of World War II). It focuses not solely on Germany after the establishment of the Nazi regime (covered in the second half of the course), but also how the Nazi Party came to power (covered in the first half of the course). The history will be narrated from both macro perspective (such as how Germany in general invaded other countries using Blitzkrieg) and micro perspective (such as how ordinary Germans conformed to the regime and participated in killing innocent Jews).<br /><br />There will not be disturbing images or videos (except for one or two shown in the textbook) depicting the war crimes committed by the Nazi party. However, some assigned readings were in fact case studies of typical Germans at that time period that might contain detailed descriptions of what actually happened. Sometimes they might induce a feeling of &quot;what the f- is wrong with you&quot;.",
            "comment_teaching": "TL;DR: You will have some lectures and many discussions through out the semester.<br /><br />- - - - -<br /><br />The classes consist of some lectures where Professor Derman essentially summarizes information from the textbook, and a lot of discussion sessions where you will be assigned to breakout rooms to discuss about the assigned readings. After each discussion session, Professor Derman would invite students to do some sharing. As a person who have actually finished all the assigned readings, I would say that the Professor's lecture slides are so well-summarized that it makes reading the textbook a bit redundant (though he would only publish the lecture slides after each lecture). The discussion and sharing sessions are also surprisingly useful because they usually cover most (if not all) main ideas of each assigned reading. These will prove very useful in your exams and term paper.",
            "comment_grading": "This part of the review is BIASED AGAINST Professor Derman because I consider my overall performance as an extreme case.<br /><br />TL;DR: It is not uncommon to get &gt;90% in your assessments given how lenient Professor Derman is. This might be a sign of a competitive course grading.<br /><br />- - - - -<br /><br />- Participation: 15% (full attendance)<br />- Midterm exam: 20% (98/100)<br />- Group presentation: 15% (96/100)<br />- Term paper: 30% (94/100)<br />- Final exam: 20% (100/100)<br /><br />I feel like this course's grading is fair considering it is a course offered in the University of Stress and Tension. Professor Derman is very lenient in grading our assessments and it is not uncommon to see yourself getting &gt;90% for a given component. Because of this, the grading of this course might be competitive.",
            "comment_workload": "TL;DR: Attendances are required. The exams are surprisingly easy and the term paper is not actually that demanding. Still, you will be doing a lot of reading.<br /><br />- - - - -<br /><br />Participation:<br />Actually, simply showing up in class is fine. Nothing to worry about.<br /><br />Assigned readings:<br />This is the main source of workload of this course. You are (strongly advised) to read AT LEAST 60 PAGES of reading per week to prepare discussion. There would not be any immediate consequences if you choose not to finish the reading on-time. Still, you will need to read all those materials at some point before your presentation/term paper/exams.<br /><br />Exams:<br />The exams consist of two parts: multiple-choice questions and &quot;identification questions&quot;. The multiple-choice questions ask about trivial stuff so no pressure here. The identification questions are essay-type questions that require you to answer some sub-questions regarding to a given term (e.g. a certain organization, event, pact, etc.). These questions might be a bit tricky but, luckily, Professor Derman and his teaching assistant is very lenient in grading these questions.<br /><br />Presentation:<br />After the midterm exam, your discussion group will be asked to give a 20~25-minute presentation to summarize how Hitler came to power (the first half of the course). The presentation is in fact not very demanding because there is literally an entire piece of assigned reading (which is also well-structured) on this matter. You might want to reuse this piece of material to make your presentation easier.<br /><br />Term paper:<br />You are required to submit a 8-page term paper at the end of the semester, mostly about the second half of the course (Hitler's regime). Despite the 8 pages requirement, the term paper's workload is, frankly saying, not very terrible. You are required to format your text in a specific way that makes the paper at most ~2,500 words long. You are also only required to cite the assigned readings and extra-curriculum references are prohibited.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XHeBrR9dflkV7r0qJUq0jzIfxMXE3UC3",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "aashmanv",
            "date": "Aug 23, 2019",
            "title": "",
            "comment_content": "The content is very thorough and easy to grasp if you have some kind of affinity for history. A bit needlessly detailed at times, but those details aren't really tested. The books studied are incredibly interesting but if you're not used to reading dense text it will be boring for you.",
            "comment_teaching": "Joshua Derman is a great teacher who will go out of his way to help you should you need it. He's a fun guy, although because the course is content-heavy the lectures can get boring.",
            "comment_grading": "The midterm is mostly dates, facts, and key events. <br /><br />The papers are very fun to write imo, and as long as you put thought into them and try to make novel points with reference to the books used in class you're good to go.",
            "comment_workload": "If you like the books, you'll breeze through them, otherwise reading 50 pages a week might seem like a chore. The papers are announced well in advance so don't procrastinate and you're good.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CP8KFGudnaEqLuB5iAcxSieXyVTHDywc",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Paolo",
            "date": "Apr 08, 2019",
            "title": "This common core course is worth it",
            "comment_content": "The course will cover everything about Modern Germany from 1918 - 1945. The emphasis will be on society during the interwars period. <br />How the aftermath of the First World War, and the constant political strife in the Weimar Republic paved the way for National Socialism and Adolf Hitler. <br />How the Nazi Party shaped German society during their rule.<br />How the Nazi Party tackled the economic problems and what their foreign policy was.<br />How the Nazi Party essentially created a racial state. <br /><br />There will be 1 lecture and 1 tutorial, both 80 minutes, usually on a Tuesday and Thursday respectively.<br /><br />Attendance will be taken at a random basis, its advisable to attend every lecture and every tutorial.<br /><br />The tutorial will be a group discussion of students.",
            "comment_teaching": "Prof. DERMAN is an excellent lecturer. He elaborates the main points on the lecture slides very clearly and he is a funny teacher and would occasionally add humor to his lectures.",
            "comment_grading": "Midterm essay: 20%<br />Midterm paper: 20%<br />Final essay: 25%<br />Final paper: 20%<br />Attendance:15%<br /><br />The grading seems fair. The range of the examinations and essays (both mid term and finals) are quite narrow and almost all of the class managed to score higher than 70% at least. So i assume to SD will be small.<br />I got a 91% in my mid term essay, a 41/50 (mean: 35/50)<br /><br />I didn't bother to check my finals, because i got an A- in the end. <br /><br />So yeah. The course isn't difficult to get at least a B.",
            "comment_workload": "Workload is a lot. You'll have to read 60 pages a week of reading materials on average. And it will be especially difficult for those who does not have a strong English background as you will be dealing with complicated words and phrases used by the authors. <br />However, not to worry, as this is not English Literature, you are only expected to understand the main points that the authors try to convey. The main points from the materials will be discused in the class where Prof DERMAN will provide key questions that needs to be addressed.<br /><br />So here's my tip for you in the reading materials:<br />*read the introduction and concluding paragraphs FIRST (this may not be a good idea for stories (spoilers, duh!) but for studies or research it is good. Because these gives you the big picture of the main points the body paragraphs will state. and it made reading easier and faster for me)<br />*Split the reading materials into smaller chunks and allocate a day for each.<br /><br /><br />Then you'll have to write a 7 paged analytical essay based on a question DERMAN will provide. The essay will assess your ability to:<br />*write a thesis statement<br />*back your viewpoint with evidence from the reading materials<br />*understand the reading materials<br /><br />Don't be too frightened by the essays. Yes it will be 7 pages long, but he will ask to to double spaced the lines (without double spacing, it will only be around 3 pages). And as long as you read and understand the reading materials, there will actually be a lot to write about in your essay. <br />I don't think there's much emphasis on cohesion, grammar, vocabulary, structure, and all the English stuff. But its still good practice to be aware of them.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kPWU6ZRxB0ad1rlN314JVWEpzACMcTrU",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "ReallyYum",
            "date": "Jan 29, 2019",
            "title": "A very rewarding course",
            "comment_content": "The content is what you would expect from the course description, which describes the rise and downfall of the Third Reich, and the social interactions, cause, and consequences within it. Mentions of the international perspectives are also given to further complete the picture.",
            "comment_teaching": "Prof. Derman is easily one of the best professors I have met in HKUST. His powerpoints are very well made and he is well-versed in the course materials, often times providing additional information to the content mentioned in class. He would also read every student's paper and give them personal comments, plus spending time for a paper conference to review and see what could be improved.",
            "comment_grading": "Attendance 15% (10% from 10 lessons randomly taken and 5% from the paper conference)<br />Mid-term Exam 20% (50 MCs)<br />Finals 20% (50 MCs)<br />Two Paper Assignment (1st 20%, 2nd 25%, both requiring 7 pages)<br /><br />Got above mean in mid-term and first paper assignment.<br />Haven't checked the second paper (Late submission resulting in -10 marks) and finals.<br />Final Grade A- so I guess I should have done well in both of them to cover the loss.",
            "comment_workload": "It should be noted that the workload for this course is not light by any means, it requires you to go through 60 pages of reading per week, where it will be discussed in the tutorial. Though some would argue that you only need to skim through it or just attend the tutorial since the main points will be mentioned in class so you don't have to necessarily go the extra effort. But for your own sake, I would still suggest going through the readings at least once because you would have to use them in your analytical essay. (Yes, external sources are not permitted for reference in the essays.) Besides, the contents of the reading materials would also be tested in both the mid-term and finals (non-cumulative.)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3BZxl9bYszWmpOKBmjcU1awCE8B9Xzc8",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Victoria Xue",
            "date": "Jan 25, 2019",
            "title": "",
            "comment_content": "This course includes basic historical facts from World War I to World War II. It specifically explains the rise and fall of Hitler and the Nazi party. It also includes the reaction of other political parties and European countries.<br />There will be two classes a week. One is lecture and the other is tutorial. You will be asked to read the materials before tutorial and professor will give questions for everyone to discuss in class.<br />This course is very interesting and meaningful.",
            "comment_teaching": "Joshua is an excellent professor. He is enthusiastic and will prepare plenty of materials which are really interesting. <br />His slides were well organized and he spoke slowly in order that everyone can hear him clearly in class.&nbsp;&nbsp;Everyone is encouraged to speak out their ideas during the lecture and tutorial. He is willing to explain every question you have in patience no matter large or small.",
            "comment_grading": "The grading is fine and fair.<br /><br />Participation: 15%<br />Midterm examination: 20%(mean: 86/100)<br />Mid-term paper: 20%(mean:88/100)<br />Final examination: 20%<br />Final paper: 25%<br /><br />The two essays also need to be taken seriously.Prof DERMAN will read everyone's paper and make comments on nearly every page.",
            "comment_workload": "Fine.<br />The MIDTERM and FINAL exams are MC. Mostly include the slides and what he has taught in lecture.(memorizing the basic historical facts and taking notes are important)<br /><br />You need to READ at least 60 pages of materials per week.<br /><br />There is no way to avoid reading because you need to discuss them in class and will be asked to write TWO at least 7 full pages analytical PAPERS.(midterm and final) All based on the reading materials.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WSg5ji0dmBXzMYuJHDhisx5sRTHJAHzA",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bluesky",
            "date": "Jan 22, 2019",
            "title": "Quite good",
            "comment_content": "Includes WWI and WWII, stuff about how Hitler rise and fall, and the reaction of different political parties",
            "comment_teaching": "Derman is a very good professor. Won't be too fast or too slow. His speech is very clear.",
            "comment_grading": "The grading curve is too high, even for the final paper and exams. Getting 90 in the midterm paper is only two marks above mean.",
            "comment_workload": "Basically every week you will have to do 60+ reading which is quite difficult for a person who never exposed to history before. And the midterm paper and final paper also required you to dig every detail in the reading. so its hard to skip the reading.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "46eBKOy2KbkgdhrdAd3P6ggKcNWFDJH4",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GW17",
            "date": "Jan 18, 2019",
            "title": "Nice Professor, Good Teachings",
            "comment_content": "Talks about WWI and WWII. <br /><br />Well organised, interesting and wouldn't be difficult for people who didn't study history in high school.",
            "comment_teaching": "Each lessons there will be PPT which all the content are organised clearly.<br /><br />Professor tried his best to interact with the students. <br /><br />The papers were marked carefully with detailed comments and professor would arrange meetings about the midterm paper.",
            "comment_grading": "15% Participation (signing the attendance sheet and attend the meetings about the paper)<br /><br />20% Midterm exam<br /><br />20% Mid-term paper <br /><br />25% Final paper <br /><br />20% Final exam <br /><br />The means of papers and midterm were quite high. <br /><br />My performance in midterm exam was so so but still got b range.",
            "comment_workload": "Weekly readings and discussions on the materials assigned.<br /><br />1 midterm and 1 final exam (all MC questions)<br /><br />1 midterm and 1 final paper (around 7 pages) <br /><br />A bit heavy but still learn a lot from it like how to write a paper.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VSDnlPPBa08lykOErc8AmjsQil4KfSDc",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "排骨",
            "date": "Jan 07, 2019",
            "title": "Bless this man's soul",
            "comment_content": "This course teaches the history of the Nazi Party in Germany, detailing specific events and factors that led to the creation, rise and fall of the Party between the end of the first world war to the end of the second world war. <br />The content taught in this course is well thought-out and organized, and each specific time frame in history is clearly separated and taught, and in the end all linked together.",
            "comment_teaching": "Great teaching, powerpoints are simple and straight to the point, no long paragraphs that force you to read. Additional and useful supplementary information is also given verbally often to assist us in understand what each particular event is about. <br />Classes are divided into 2 kinds, lectures and discussion sessions. The discussion session allows the class to sit around and discuss certain events, sharing our interpretations to allow for better understanding (although they might be a bit too frequent, otherwise still interesting enough)",
            "comment_grading": "The mid term exam and finals are ridiculously easy, so no pressure here. Got an A- in the end.",
            "comment_workload": "Weekly readings of texts, and 2 papers (mid-term and final). The weekly readings may seem daunting (60-ish pages per) but its actually not that bad, just skim over them on the bus or something. The papers are also rather straightforward to write so no worries here. Overall workload is fair and should no burden you too much.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "748xwBKfsQxT6XUzAnm0E9Xge6GT4WIP",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 314,
                    "name": "DERMAN, Joshua",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TeddyTing:)",
            "date": "Dec 28, 2018",
            "title": "So interesting but heavy workload",
            "comment_content": "Topic:<br />The history of Germany (1914-1945) during WW1 and WW2, <br />-The rise of Nazi Party<br />-The life of Germans and their popular opinion under Nazi regime. <br />-The situation of Jews during 1914-1945",
            "comment_teaching": "The professor clearly explains the history of Germany through slides and readings and answers your questions with great details.",
            "comment_grading": "Midterm Exam(20%) 45/50(mean ~37)<br />Midterm Essay(20%) 91/100(mean~88)<br />Final exam(20%) N/A<br />Final essay(25%) N/A<br />Participation(15%) Full <br />Grade: B+",
            "comment_workload": "Assignments and <br />1.About 20-30 pages slides and discussion of reading materials (50-60 pages) per week<br />2. Two 7-pages essays in one semester <br />3.mid-term and final exam in MCs",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}