{
    "error": false,
    "course": {
        "id": 599,
        "subject": "HUMA",
        "code": "3201",
        "name": "Animation: A Global Perspective",
        "description": "This course examines the history and development of animation as both an art form and an industry around the world. It covers early experiments with animation, the transition to sound and feature film, and the rise of the classical Hollywood studios such as Disney, Warner Bros, the Fleischers, UPA, and MGM. This course will extend to other countries or regions, such as Canada, Russia, Germany, Czech, Japan, China, and Hong Kong. In addition, this course will track the development of technology and techniques of animation, such as rotoscoping, pixilation, cel animation, stop‐motion animation, puppet animation, silhouette animation, limited animation on TV, direct animation, and computer animation. This course aims to establish a foundation for students from different academic backgrounds who might be unfamiliar with animation studies.",
        "categories": [
            "Common Core (H)",
            "Common Core (Arts)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2030,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.67,
        "rating_teaching": 3.67,
        "rating_grading": 4.33,
        "rating_workload": 4,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 340,
                "name": "DU, Daisy Yan",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "2s5LHCVrhCycrkZVR7HBra2X3Uh0Sdi7",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 340,
                    "name": "DU, Daisy Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GhostNg",
            "date": "Aug 18, 2021",
            "title": "Good course",
            "comment_content": "This course examines the history and development of animation as an art form, a technology, and an industry around the world. It begins with early experiments with animation, the transition to sound and feature film, and the rise of the classical Hollywood studios such as Disney and UPA. It then moves to the representative artistic styles in other countries or regions, including the experimental animation of NFB in Canada, socialist realism under Stalin, puppet animation in the Czech Republic, anime in Japan, the National Style in China, and the McDull series in Hong Kong. This course explores a variety of animation forms, including cel animation, stop-motion animation, silhouette animation, direct animation, abstract animation, limited animation, TV animation, computer animation, and VR animation.<br />It will also track the development of technologies and techniques in animated filmmaking, such as sound and color technologies, rotoscoping, pixilation, digital technology and motion capture. Related animation theories will be introduced throughout the course. All reading materials, lectures, classroom discussions, writing assignments, and exams are in English. <br /><br />This course is about animation, students who are interested will enjoy this course.",
            "comment_teaching": "It is almost a 3-hour Q&amp;A session. Daisy likes interaction and feedback. The lecture is to play animation and answer questions raised by Daisy.",
            "comment_grading": "Good. <br />• Attendance (lectures): 10% *<br />• Attendance (conference) or a Midterm Paper: 20% *<br />• Weekly Quiz (about required films): 5% *<br />• Classroom Participation: 10% <br />• Film Reviews: 10% *<br />• Final Paper: 45% <br /><br />*You can easily get full marks. Like film reviews, they promised to give you full marks if you submit it. <br /><br />Final paper: &lt;90/100<br />But I answered one question per lecture. <br /><br />Final grade: A+",
            "comment_workload": "You have to write film reviews every week, but I wrote useless sentences in film reviews, so it shouldn't be a big problem.<br /> <br />I have never read any required reading.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "M8WcXjx3E9a4nX2XI3VEaNG8jvyLbo9f",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 340,
                    "name": "DU, Daisy Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ECream",
            "date": "Jun 02, 2021",
            "title": "",
            "comment_content": "Basically the history of animation from all around the world. Not bad to learn those stuff, if you are a fan of anime, Disney, Pixar or whatever animation, but most of the animations covered in this course are pretty old and more artistic.<br /><br />This course explores a variety of animation forms and formats, including cel animation, stop-motion animation, silhouette animation, direct animation, abstract animation, limited animation, TV animation, computer animation, and VR animation. It will also track the development of technologies and techniques in animated<br />filmmaking, such as sound and color technologies, rotoscoping, pixilation, digital technology and motion capture. Related animation theories will be introduced throughout the course. All<br />reading materials, lectures, classroom discussions, writing assignments, and exams are in English.",
            "comment_teaching": "Whether it's boring or not, really depends on each of their own, but first you need to have some interests on animation/film/arts to keep you hook on.<br /><br />Expect less technical stuff, but a more artistic, cultural side of animation. It is best suited for people who are good at blowing water.",
            "comment_grading": "Grading Criteria:<br />• Attendance (lectures): 10%<br />• Attendance (conference) or a Midterm Paper: 20%<br />• Weekly Quiz (about required films): 5%<br />• Classroom Participation: 10%<br />• Film Reviews: 10%<br />• Final Paper: 45%<br /><br />You are required to attend Inaugural Conference of the Association for Chinese Animation Studies for at least 25 hours in total. Students will receive 1 extra credit (to be added to the final<br />score) for attending every extra 3 hours.&nbsp;&nbsp;<br /><br />Other ways of obtaining extra credits: <br />-Handing in Midterm Paper<br />-Extra film reviews<br /><br />Quizzes are easy questions of the required films, unfortunately I still did 1 wrongly. <br /><br />Participation: I was quiet, but I raised my hand sometimes<br /><br />Attendance: Full, 4/5 extra credits from conference<br /><br />Final Paper: 93/100<br /><br />Final Grade: A-",
            "comment_workload": "Need to work on a film review nearly weekly, if you don't like writing, you better watch out.<br /><br />Plus, you need to attend at least 25 hours of the Animation Conference. As they were online conferences, all you need to do is just attend the zoom meeting and do your stuff. However, make sure you jot down something from one of the conferences, because you would be required to write a short report about the conference as a proof of attendance.<br /><br />But I guess having no project, mid terms and finals make it up a bit.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FGNhOG0hr43wxuqYWxdkQTiW0rwKayFC",
            "semester": "2014-15 Spring",
            "instructors": [],
            "is_author": false,
            "author": "kkkrrrqudtls",
            "date": "Aug 10, 2019",
            "title": "",
            "comment_content": "Learns about history and development of animation just as it says in the description &amp; looks at examples from different hollywood studios such as disney, warner bros, etc.",
            "comment_teaching": "The instructor was enthusiastic and caring. you could go and talk to him if you have any questions and he will welcomely greet you",
            "comment_grading": "moderate grading. you will earn as much as you try. just make sure to go over all the ppt materials before exams",
            "comment_workload": "adequate workload. just make sure you keep up with the every week assignments and you should be fine",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 6,
            "attachments": []
        }
    ],
    "composer": []
}