{
    "error": false,
    "course": {
        "id": 2988,
        "subject": "ISDN",
        "code": "2200",
        "name": "Systems Thinking and Design",
        "description": "This course in Systems Thinking aims to gain students systemic understanding when tackling global challenges in the real world. For example, as widely understood that climate change is more than merely a technological problem. Rather, it is systemic problem underlying aspects of people, technology and environment that are all interconnected in the entire environment. With emphasis on systems, it is important to broaden students' perspective from merely viewing problems in isolation but in relationship with its surroundings. This course stresses on attaining a systemic perspective when approaching technological design in integrative systems. The course introduces studies of systems thinking to aid students systemic understanding. In the course, students are given specific assignment, such as intelligent mobility or waste management systems, and work in groups. At the beginning, they define the systems and analyze specific issues underlying in the systems. Afterwards, they suggest, justify and evaluate their solutions in systemic context.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2110,
            2010,
            1910
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 2.33,
        "rating_teaching": 2,
        "rating_grading": 2.33,
        "rating_workload": 2.33,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1208,
                "name": "MOK, Luisa",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "Y93Juae7mhMWde0aGK4J1oesCq90QxpT",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "csf",
            "date": "Feb 07, 2022",
            "title": "avoid luisa course if possible",
            "comment_content": "This course basically is to train to tackle anything in a more holistic way because everything is interconnected and any single change affect everything else.<br />That said, there is no content at all.<br />week1: thinking practice<br />week2: field observation<br />week3: use result in thinking practice<br />week4: q&amp;a (collect more data)<br />week5+: critique<br />week6+: design<br />week8+: prototyping<br />and 2 more presentations<br /><br />if you are thinking what you can learn despite this, the answer is: experience.",
            "comment_teaching": "This is Luisa so no hope is needed.<br />And ISD student is required to take the course so don't bother unless you want suffering.<br />the class basically conducted as following:<br />* Luisa gives critique (on last work submitted)<br />* Luisa give some lecture (which is not helpful to the work)<br />* Group discussion and work (while Luisa walks around and give more critique)<br />* more critique and give new works&nbsp;&nbsp;<br /><br />Have I mentioned her critiques for most of the time miss the point and not helpful and sometime have no ground and even get rebutted by project collaborator?",
            "comment_grading": "Base grade is C. (claimed to be)<br />If you have put in any effort, your grade will very likely remain C because her grading is very subjective. if you are very hardworking and lucky enough to not get many critiques, pray for B.",
            "comment_workload": "Normal project courses often have high workload, but this is on the next level.<br />Need to find and read a lot, write a lot of assignments, make many designs, find materials, build physical prototypes and do presentations. With many back and forth, each.<br />and with her critiques, most of your progress (even if in prototyping stages) could be reset anytime.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6AbcvrhX34nILrUKRgwuwoxUDshYImOm",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Bits",
            "date": "Jan 03, 2022",
            "title": "The worst course that I have ever taken in my life. (expect ISDN 1002)",
            "comment_content": "This course is about systems thinking. Whereas the whole course is not a systems thinking approach, from teaching to grading.<br />What had I learnt?<br />Nothing, literally. <br />Go ask anyone who had taken this course whether they had learnt something, you'll know I am telling the truth.",
            "comment_teaching": "Terrible and horrible. <br />If you are not an ISD student, trust me, never take this course.<br />She's basically chatting with the class all the time.<br />Almost no knowledge is delivered.",
            "comment_grading": "Nonsense. <br />Grading is subjective, not reasonable. She'll gave you a grade whatever she want. There's no fairness.",
            "comment_workload": "Extremly large.<br />Even worse, you won't gain nothing from it.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OpL9Uvladqe6pmasF6n0zLj9ga7wUoiM",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Andrew Zhong",
            "date": "May 19, 2022",
            "title": "",
            "comment_content": "It teaches us how to do a design in a very detailed and systematic way. It is more to understding the content instead of memorizing.",
            "comment_teaching": "The teaching is very interesting. This course includes the field trip to Cathay Pacific Catering Service factory and we an see how the flight mean is actually produced in reality.",
            "comment_grading": "I got A grade, it is good but sometimes the content is demanding as a very detailed addignment contents are required.",
            "comment_workload": "The workload is quite high. The final project is to design a Flight mear on-board cart to improve the single use plastic usage to save the environment.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}