{
    "error": false,
    "course": {
        "id": 2722,
        "subject": "ISDN",
        "code": "1000",
        "name": "What is Design and Why Design?",
        "description": "This course introduces what design is and why it is valued. Students understand fundamental design principles and methods, and experience creative design process through project-based learning. This course focuses on product design and system design comprising product and service. Despite its seemingly enigmatic approach, design has indeed its disorderly logic of inquiry. The process begins from defining real-world problems through to initiating changes to society. This unique process has been studied as “design science”, which refers to the design approach of exploring and developing new ideas as well as scientific approach of proving and demonstrating innovations. The two merges into a rational yet inventive designerly way of thinking and doing. This is the creative process that students are guided to undergo phase by phase. As a result, students are able to develop and justify good designs. By adding design perspective, technological development likely results in useful innovations meeting real-world problems.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            1830,
            1810
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3,
        "rating_teaching": 3.25,
        "rating_grading": 3.25,
        "rating_workload": 2.5,
        "review_count": 4,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1208,
                "name": "MOK, Luisa",
                "count": 4
            }
        ]
    },
    "reviews": [
        {
            "hash": "6cqmhgSRbFM1nc0tCZvNad7o6fb0VIr6",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jack Zhang",
            "date": "Jan 02, 2019",
            "title": "big workload with many stay-up nights",
            "comment_content": "The course mainly focuses on how to think innovatively when we are facing real world problem. professor would link the course content with 3rd company like TTI to let us realise the real world problem. however, in most of time, the teaching content make us feel very metaphysical and if you are eloquent enough, you could be right all of the time. (BTW, the content is hightly overlapping with ISDN 1002)",
            "comment_teaching": "professor has prepared a lot before every lectrue. however, she just forgot what she had taught and said in the last lecture. every day, you could properly receive a new task that is very different from last lecture. it make us very confusing and don't know what to do in our research.",
            "comment_grading": "it seems very few people got A range. i got B, but i behaved as the leading role in the team. the whole grading system is not clear to student and it would make you feel that the grading is all depending on professor's opinion. though i indicate the assessments below, i didn't know any grades but only the final grade.",
            "comment_workload": "The workload of this course is scary. At the start of semester, it seems easy because we only need to draw a design or observation every week. but at the last month, we have to start the final design. this year we build a house that allows a single person to stay overnight. we were required to build five scale-down models and one real scale model. finally, we need to present our house in front of many faculties and staffs. before every presentation, we need to stay up to prepare the models and ppt.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 10,
            "vote_count": 10,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5XdMJsFSnphqXaKYGmr5D8wj7FI0evGd",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YZDY",
            "date": "Jan 17, 2019",
            "title": "",
            "comment_content": "Some basic design principles was introduced at the beginning then we started to a project of designing houses to solve the housing problem in Hong Kong.",
            "comment_teaching": "We spent most of the time in class working on prototypes and doing presentations, especially in the second half of the semester.&nbsp;&nbsp;The instructor gave us a lot of support and suggestions while we are making the prototypes.",
            "comment_grading": "Most people got B, though they worked super hard.",
            "comment_workload": "Workload is super heavy. We need to make five scale down prototypes and two one-to-one prototypes.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MD4ekWVf2ndsgibJJM3CkPBwGDRVWiK8",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Licca",
            "date": "Mar 10, 2020",
            "title": "",
            "comment_content": "Understand the core principles of design, including some history and theories. I personally found the content quite interesting although I am not from engineering school I've always had an interest in design.<br /> Although the topics were all quite similar and slightly vague, so a lot of things are up to the students / professors perspectives and opinions.",
            "comment_teaching": "I had a great experience with professor Mok, she was very helpful throughout, even though half of the semester was converted to online and we could not see her face to face.",
            "comment_grading": "Contrary to the other reviews for this course, for me the grading is fair and high. However you cannot have access to your grades for most of your assignments, only the final grade.",
            "comment_workload": "Workload was quite fair as well. There are presentations often but are manageable. Mostly group work and as long as you speak more you would do well. <br />There are quite a few individual assignments, but they are all drawings and conceptual maps, if you enjoy drawing and designing this is the class for you.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nsei6EoNoW0XwHgKRappNMxWZMKj3K60",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1208,
                    "name": "MOK, Luisa",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nihao",
            "date": "Sep 15, 2019",
            "title": "",
            "comment_content": "Some basic design principles<br />something about thinking innovative and creative<br />examples of real-world problem<br />project on how to solve housing problem in HK",
            "comment_teaching": "She is kind and she is willing to interact with students. She also tries to be friendly. <br /><br />Not much teaching in the class. Most of the class time is used to make prototype and she moves around to give comment on your idea and prototype, but not really useful and sometimes, makes you even more confusing. Don't understand what she wants.",
            "comment_grading": "Don't really understand how grading works. <br />From what I remember, about 90% was presentation and prototype you make +&nbsp;&nbsp;10% idea book. <br /><br />Got B+ even I missed 2-3 classes. Really don't understand how it works. It's not really recommended to miss class, because it's a small class and the professor will know right away when you miss the class.",
            "comment_workload": "A lot of thing to do. Presentation almost every 2-3 week. Prototype take a lot of time and you have to spend more than class time to finish the prototype. Had to spend more than 20+ own time to finish the prototype. <br /><br />Presentation and prototype is done is group of 4-5. <br /><br />Nothing to memorize or no exam, but quite heavy workload considering this is a common core.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}