{
    "error": false,
    "course": {
        "id": 682,
        "subject": "ISOM",
        "code": "3230",
        "name": "Business Programming in VBA",
        "description": "An introduction to business applications programming will be covered in this course. Students will learn and understand programming concepts and gain programming experiences for business applications development through a business programming language.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "(For non-BSc in Quantitative Finance students) <a class=\"course-link\" data-subject=\"ISOM\" data-code=\"2010\" href=\"/review/ISOM2010\" target=\"_blank\">ISOM 2010</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"1022Q\" href=\"/review/COMP1022Q\" target=\"_blank\">COMP 1022Q</a>",
        "rating_content": 3.9,
        "rating_teaching": 3.6,
        "rating_grading": 3.7,
        "rating_workload": 3.77,
        "review_count": 30,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 375,
                "name": "KWOK, James Sai Ho",
                "count": 25
            },
            {
                "id": 1180,
                "name": "TAM, Bosco",
                "count": 5
            },
            {
                "id": 819,
                "name": "CHEUNG, Tsz Lok",
                "count": 4
            },
            {
                "id": 377,
                "name": "CHEUNG, Yat Ming",
                "count": 3
            },
            {
                "id": 958,
                "name": "NG, Sam",
                "count": 2
            },
            {
                "id": 376,
                "name": "CHOI, Timture",
                "count": 1
            },
            {
                "id": 801,
                "name": "NG, Ka Wai Tommy",
                "count": 1
            },
            {
                "id": 1097,
                "name": "CHAN, Hiu Ying",
                "count": 1
            },
            {
                "id": 1478,
                "name": "MAN, Ka Kuen",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "3b3r251DJQEVPU72SanFLYvgjygHZWHD",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 0
                },
                {
                    "id": 1097,
                    "name": "CHAN, Hiu Ying",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Mivy Wenceslas",
            "date": "Jan 03, 2023",
            "title": "VBA is useful but ruined by James",
            "comment_content": "For your information, I have been using VBA for all sorts of automation prior to this course. I can understand all the contents and even more than that because this is an introductory course. Therefore, I understand better that this course offers the most useless content and this is why many people think VBA is useless.<br /><br />Let me give you a few examples on this course's content that is indeed useless:<br /><br />1. You will spend the first 2 weeks (add-drop period) hearing the Professor complaining all the software in the world and criticizing software made by PostGrad students when he probably cannot make it himself.<br /><br />2. You will learn something truly bizarre and extraordinary: to declare variables for a syntax of a method. Not comments, but variables. If you don't know coding, comments are for providing context to other coders and variables are for storing values. You do NOT use variables to interpret something to coders.<br /><br />3. You learn to use VBA to calculate Sum, Count and even NPV! But wait, where have I seen those before? The built-in formulas Sum(), Counta() and even NPV() are already made for that. VBA is NOT used for purposes that can be easily replaceable by one-line formulas.<br /><br />4. You got to learn &quot;Web Scraping&quot;. FYI, that will mean you get to collect some data from websites for your own use. Sounds amazing! Except he does NOT teach you the actual web scraping. He tells you to use that STOCKHISTORY() formula to scrap data. But then you are not using VBA to scrap web data, and that formula can only collect stock data from a pre-defined website... <br /><br />(If you want to learn more with actual &quot;Web Scraping&quot; with VBA, you can declare a variable type WebBrowser and use some code to scrap data. I have such experience.)",
            "comment_teaching": "Oh god, this is the first course I rage-quit after just one lesson delivered marvelously by James. Truly spectacular.<br /><br />What he did in that lesson:<br />1. Complaining a Currency Converter calculation website that allows you to calculate the exchange USD for USD. I understand that may be redundant but that seems too trivial to complain for? Do you not have better things to teach?<br /><br />2. Complaining the same website that allows users to input values of several decimals. The idea he argues that people exchange with integers is absurd. In all seriousness there could be times where people have to input decimals. I honestly do not understand how could he insist in these trivial matter though.<br /><br />You get the idea. He will be spending the entire course, including his grading and in-class exercises, to deduct marks of the most trivial things in the world. Treating you as a primary schoolkid.<br /><br />3. Emphasizing &quot;Business Application&quot; for the entire lesson, which includes user-friendliness, good GUI blah blah blah... Then failing to use a sample postgrad VBA project with all those &quot;business application&quot; imposed by himself. I am almost looking at a clown slapping himself there. <br /><br />For Olivia:<br />In my case, obnoxious enough. She rarely replies to emails unless necessary e.g. appeal. Keep in mind that her attitude is not too nice in emails. However, her tutorial courses should teach more than the lectures by James. She seems to be nice in tutorials also. <br /><br />To attend this course, I recommend you to ignore everything James have said. You are better off just Googling, looking at the slides and attending the tutorials. From the many mistakes James made every lesson, I have a suspicion that James do not know VBA at all, and all grading is also done by Olivia.",
            "comment_grading": "If you want to achieve high marks in the course, you need to understand that your program should not be efficient, and do not attempt creativity for better solution. Stick to what he wants and teaches, even if the codes are worse.<br /><br />Also, try to guess what he wants to test you in the assignment or the exams. Because there are countless assumptions, logical flaws and errors within his assignment totally ignored by him. What you can do is to look at his task description clearly. <br /><br />Unfortunately, this is a highly competitive coding course and those with VBA knowledge prior has a huge advantage. This course thus offers a bad grade in general, although keep in mind that you have to very tightly, strictly, methodologically follow what James may have wanted in his ambiguous instructions!",
            "comment_workload": "I think it is almost absurd for people to do a group project in VBA. There is not a sharing code platform for that. For other languages, you may use Github preferred by CS students, or Google Colab for Python. But VBA is just not a language for multiple people to work on. This already shows the ignorance and stupidity of James.<br /><br />Other than that, you got to do 3 in-class exercises and an individual assignment. Last, a paper-based final exam where you have to fill in the blanks and write codes on blank sheet of paper. No wonder it is said that Microsoft Word is the best IDE editor in the world.(If you know what I mean) At this stage, I have lost my words in describing the absurdity of James.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 9,
            "vote_count": 10,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5YXBjf4gG1HsrQRsbhNLhSAWIEEd3PI8",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 0
                },
                {
                    "id": 1478,
                    "name": "MAN, Ka Kuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "C-range eater",
            "date": "Dec 30, 2020",
            "title": "Easy to handle but tough grading",
            "comment_content": "This course is about some basic applications of excel VBA. The content is not difficult to understand. It would be pretty easy for you to handle if you have practiced it regularly. And it would be fun to create some intuitive, user-friendly panels in excel. <br /><br />It is easy to handle, but it doesn't mean that you can get a good grade in this course. I strongly advise you to practice coding regularly, but not just simply scanning through the lecture notes before the final exam. It would be a tragedy if you are an ordinary student like me without any programming background. (Feel free to skip this review if u are those A's ians/genius).<br /><br />If you want to secure a B range, you should try to achieve full marks in in-class exercises, and to achieve scores above mean in two assignments (The mean would be more than 17 out of 20). One mark matters a lot in this course since losing one point will eventually causing one sub-grade lower! I strongly suggest you to attend all the lectures and tutorials in order to avoid losing any chance/skills/tips to obtain scores! (Erm but no attendance will be taken)<br /><br />The final exam would be a race against time, if you are not fast enough to code, or you are not familiar with potential bugs/errors that you might encounter, then you will waste a lot of time. You need to take the exam under a strict time constraint so every minute matters. you would be in a super stressful condition that you might not be able to keep your mind clear. So try to be more responsive and careful by practicing more, especially those practice questions offered in tutorials. Some of them are quite challenging and will be examined in the final exam. Make sure you fully understand the concepts. Overall the final exam is not that challenging, I would say speed and responsiveness would be the key. Although it is open book and open notes, don't rely on the course materials too much, actually you have no time referring to the notes. But it would be a good idea for you to have a cheat sheet to take a quick reference. Last but not least, try to avoid any careless mistakes since the mean of the final exam would be pretty high.",
            "comment_teaching": "The teaching is fair. Both professor and TA are nice. I have no comment on this.",
            "comment_grading": "I would say the grading is quite tough. At first I expect a B but it turns out to be a B-. What I can conclude is, treasure every points that you can get in this course.<br /><br />Grading scheme and distribution:<br />In-class exercise [14%]: 13.3/14 (mean: 12.68/14)<br />Assignment 1 [20%]: 14.5/20 (mean: 17.2/20)<br />Assignment 2 [20%]: 19.5/20 (mean: 17.17/20, SD:2.37)<br />Final Exam [46%]: 40.49/46 (mean: 39.64/46, SD: 6.36)<br />Total score I obtain: 87.79% --&gt; B-<br />Very Tough. The grading curve in this semester is INSANE (probably because more QFINers enrolled in Fall semester). You will probably get a B with 91% in total, or a B+ with 93% in total (Statistics from other students). I think getting an average score (~86%) would be a C+...<br />Anyway, GOOD LUCK AND ENJOY!",
            "comment_workload": "The course content is not difficult to digest. More importantly, you need to spend more time on practicing coding. Also, don't try to be a deadline fighter for the two assignments. They account for a large part of the total scores (40%) and you absolutely need more time to play with it. The TA will also grade your assignments base on your coding efficiency and the user-friendliness of the program. Thus if you want to get at least average score, you need to polish your program (btw the appearance of user interface also matters!). It would never be enough if you just submit a program which solely meet the assignment requirements. One more thing to note, the 2nd assignment would be a group assignment, I strongly suggest you to start doing the assignment with your groupmates at least three weeks earlier. The 2nd assignment would be way more challenging and complicated than the first one. Reserving more time will allow you and your groupmates to further polish the program in order to reach perfection.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "T1Z2zfRsHjQpKZWzDu4QZUjJxr5Dhx32",
                    "name": "2020Fall_isom3230_syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "YojUCv0bM1tP5DBpWiXnfzQIGZ4XqCPq",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sharken",
            "date": "Sep 04, 2017",
            "title": "",
            "comment_content": "Super basic vb and vba knowledges, and actually the things you can learn in lectures are useless in daily life. If you have programming knowledges before, the course will be easy to you.",
            "comment_teaching": "Almost everything will be covered in the lecture videos. You can learn almost everything by yourself with the help of the lecture videos and materials. You can greatly complete the course without going to lectures.",
            "comment_grading": "Tough grade. I got full marks in lab assignment , above 0.5sd in assignment1, mid term and final, and above 1sd in assignment2 , it just turns out a b+",
            "comment_workload": "Have to do online quizzes in a weekly basis, but the quizzes are easy, no worry. <br />There are lab sections, and there will be two lab demonstration counted for a few % of the total grade. The lab demonstration is easy, almost everyone can get full marks. <br />Before mid term exam, there is a individual project , an assignment related to vb, and it is quite time consuming, but if you are willing to spend time, then you can easily finish the assignment with the help of Google.<br />And there is a final project, which is a group project related to vba, much more difficult than the individual one. However, once again, with the help of Google, you can find out the answer easily.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "9ly6qJ1TsxGIWqGI2ZGvTv18RRjnsf62",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "merryXmas",
            "date": "Dec 29, 2021",
            "title": "Worst Course in HKUST",
            "comment_content": "Basic Excel VBA. <br />You can learn it by watching youtube videos so I don't know why we need to take this course.",
            "comment_teaching": "Only one takeaway from this course: GOOGLE<br />James is pretty good at making things more complicated.<br />Truly recommend you guys don't go to lessons and watch recordings with 3.0x speed, this will make your life much better.<br /><br />TA Tommy is a nice person:)",
            "comment_grading": "I have no idea why I got way above mean (except one of the assignment) and I got a B. <br />The grading is just like shit.",
            "comment_workload": "Two Assignments, three in-class exercises, one final exam.<br />To be honest the in-class exercises were easy, so was the final exam.<br />Assignments were unbelievable difficult, me and my groupmates basically finished the assignments by Googling.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DFFGQVfap1Wb71sdGtzW6yPxDvtoACt7",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "刘点点",
            "date": "Jan 17, 2021",
            "title": "Although you need not to attend the classes, YOU HAVE TO.",
            "comment_content": "The course itself is really useful in daily life and maybe in future works. It can save you a lot of time for repetitive work. <br />HOWEVER,<br />the course content is always not fully covered by the slides. The professor will always courage you to go online to search for solutions, and you will there are tons of solutions and some of them may not meet the requirement(although looks fine when testing). JUST ACCEPT THAT.",
            "comment_teaching": "Why need teaching? According to professor, Google will solve all the problems.",
            "comment_grading": "Almost I get full in final, I still get C+, the worst grade ever in my uni.",
            "comment_workload": "Every week there is an in-class exercise.<br />There are two assignments.<br />Intensive competition in fall sem.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VOeKXchspXwdoCOC6MQPFMgqdSdEP9Vm",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Saik",
            "date": "Jan 03, 2021",
            "title": "Take it in spring if u want a fair grading",
            "comment_content": "Some basic VBA stuff, u could refer to other reviews for detailed syllabus which I'm too lazy to post here XD<br /><br />VBA itself isn't a very commonly used programming language, but I agree that it does no harm to just learn about its basics. However, I give the content C for its stupid arrangements.<br /><br />For one thing, the instructions of in-class exercises are never clear and there are always tons of questions in the chat room every time an exercise was released.<br /><br />If that isn't enough, there are a lot more things even worse. For example, it made us hard code 10 message boxes in in-class exercise 1 and not allowing us to use loop as it wasn't taught; the instruction of assignment 1 was that we should ask the user to import file using path name, but if u really do so, ur mark get deducted cuz they say importing by path name is troublesome and u should design something more &quot;user-friendly&quot; ????",
            "comment_teaching": "The professor and TA could articulate clearly and they explain the concepts fairly well. A major problem however, is that the lecture slides DO NOT cover all the syntax that we need to know.<br /><br />Every lecture, the professor would come up with some cases randomly and demonstrate how to write all those codes, which often involve syntax not covered in the slides, and so it takes extra time to make notes on that.<br /><br />Moreover, they stress &quot;business application&quot; which in other words are just making useless designs or trivial changes. NO U DONT WANT TO STRESS BUSINESS APPLICATION, U SHOULD STRESS PROGRAMMING LOGIC AND HOW ALGORITHMS ARE BUILT.",
            "comment_grading": "Ridiculous.<br /><br />Grading scheme:<br />14% In-class exercise (best 7 out of 9)<br />20%*2 Assignment 1 &amp; 2<br />46% Final exam<br /><br />My results:<br />Full for in-class exercise<br />15/20 for assignment 1<br />18/20 for assignment 2<br />~45/46 for final<br />letter grade: B+<br /><br />Means:<br />-around full mark for in-class exercise(?) cuz it counts best 7 and the mean was very high each time<br />-~17.2 for both asg 1 and 2<br />-39.X for final exam<br /><br />In fall semester, more than half of the class (not exaggerated) are QFins, the means were pushed up to be very high and every 1-2% u lose could cost u a sub-grade. I made quite a number of careless mistakes in assignment 1 and got below mean, it didn't help even though it got nearly full for final, which is ridiculous. <br /><br />Register this course in spring if u don't want a bad grade. Especially for year 1 QFin as u would get pre-registered in year 2 fall if u don't take it earlier.",
            "comment_workload": "1 in-class exercise every week starting from week 2 (or 3?), as well as 2 assignments.<br /><br />There is no skeleton codes for assignments so it takes quite a long time to do them from scratch. In particular the second assignment was a group work which was quite heavy, u would struggle if your teammates free-ride.<br /><br />Overall, it was neither light nor very heavy.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Zk6V63quHRzfBkRB99uFQV6sYUrNsw9s",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Andrew.cyk",
            "date": "Jan 22, 2020",
            "title": "Learnt nothing in this course",
            "comment_content": "Basic VBA intro course. Content is pretty much the same every year and is well covered by other people already so I won't go too much into detail. Stuff like declaring variables, basic operations, looping etc etc. Assignment 1 was a basic simple/compound interest calculator and Assignment 2 was a grading system to assign sub-grades to people.",
            "comment_teaching": "Blended learning style with one in-class lecture and a lab. <br /><br />it's good if you can manage your own time.<br /><br />His teaching on the other hand, just plain TERRIBLE. Literally learnt nothing from him that I couldn't google myself. <br /><br />I watched videos on Youtube to grasp the concepts. Lecture 'slides' were in the form of awkwardly-formatted Excel files smh",
            "comment_grading": "I feel like a 1% decrease in overall score will make your final grade one subgrade lower. I calculated my overall grade to be around 95-96% and only got A- so....yeah. <br /><br />Assignment 2 was hell. I still have nightmares about it... maybe I'm just dumb.",
            "comment_workload": "No weekly homework. Just 2 assignments (1 individual, 1 group assignment that turned into an individual assignment worth over 50% of our final grade). Make sure you watch the videos before doing the in-class quiz (3 relatively simple MC questions per quiz). No idea about the final because it got cancelled due to you-know-what-happened lol",
            "rating_content": 5,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QjuHc38S6PZeO4sg7Q0rxfidNYWbyYDb",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                },
                {
                    "id": 1180,
                    "name": "TAM, Bosco",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "silenceeeee",
            "date": "Aug 22, 2018",
            "title": "",
            "comment_content": "This course covered the basic programming knowledge of VBA language. It included online quizzes, two assignment(individual, group) and the final exam.",
            "comment_teaching": "James is a very nice Prof, and he tried to help you when we have any problems. Bosco is an excellent TA, he explained all the details of the codes and logic mentioned in the Lab section. However, they needed students to do something which they had not yet covered. This made me confused during the learning process.",
            "comment_grading": "The course is quite easy. Once you watched all the video lecture and pay attention during the class, it is not hard to get an A. The average grading for this course is B. Overall, the most important thing for getting a good grade in a programming course is to familiarize with the logic and practice more.",
            "comment_workload": "The assignments were quite demanding, you need to familiarize with all the things that were covered in order to have a good result. The workload for the final exam is acceptable.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1uZdbqZZGMDVhgTdzPYOM1X6pmv6n7zb",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "打手甲",
            "date": "Jun 20, 2022",
            "title": "",
            "comment_content": "The course covers some basic programming in Excel VBA.<br /><br />For Assignment 2, prof and ta put us into groups randomly so it really depends on luck. Some of my groupmates are bad at programming.<br /><br />Better to search online (it is allowed) during all in-class ex and final as James may not have covered all points in lessons.",
            "comment_teaching": "James always stresses &quot;user-friendliness&quot;, which is a bit vague actually although he provided us with some examples.<br /><br />I think the guidance for the 2 assignments should be made clearer. Didn't know we have to use Windows Explorer to import another excel (user-friendliness...) until grading is out [Assignment 1].",
            "comment_grading": "Assignment 1 [Individual] (15%, mean 12.8)<br />Assignment 2 [Group] (15%, mean 12.53)<br />In-class Exercise (Best 2 out of 3) (30%, mean 26.31)<br />Final Exam (40%, mean 27.27)<br /><br />Overall: 87%<br />Grade: A-",
            "comment_workload": "Not big. <br /><br />If you have learnt other programming languages before, basically you can skip all lessons (except those for in-class ex) and revise only before in-class ex and final.<br /><br />As for revision, as long as you did the prac questions beforehand, it should be fine (the questions are very similar to those in real, which means you can re-use the codes you typed in prac).",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kqkOc5J7JiORPWmqN7FtVBFWEuQKH5M8",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "goldfish2000",
            "date": "Dec 29, 2020",
            "title": "",
            "comment_content": "Basic VBA programming<br /><br />The content is quite easy. If you learnt other programming lanuage before, you won't have any problem with the course content.<br /><br />Two lectures and one lab per week. <br />Lecture: Concept and simple example. <br />Lab: Practice and some challenging question",
            "comment_teaching": "I don't think he is familiar with the course content, he always say something contradicting and it is quite confusing. He also always miss the question in the chat room. Lecture note are not clear as well.<br /><br />The TA Josh is quite nice and helpful.&nbsp;&nbsp;Sometime he answer my question in late night. I learnt more in his lab than the lecture.",
            "comment_grading": "Overall: 90%<br />I got B.<br /><br /><br />The final exam is too easy that many people can get high marks. The mean is 39.xx/46. I made few careless mistakes and then I can only got the mean.",
            "comment_workload": "9 in-class exercise, most of them are individual. <br />1 individual assignment and 1 group project.<br />1 final exam.<br /><br />in-class exercise is ridiculous, they are not &quot;in-class&quot; at all and the deadline is 24 hours after the class. I need to spend my Friday night on the exercise.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H7ZnrTUUK64asz2aKhkYuOeIEbCir17t",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "happypotato",
            "date": "Dec 29, 2020",
            "title": "",
            "comment_content": "Basic VBA techniques:<br />Range<br />Conditional Statements<br />Looping<br />Array<br />Method<br />Userform<br />Formulas<br />Business Application",
            "comment_teaching": "The professor isn't clear about the content for each lecture and often makes mistakes. He even spent a whole lecture talking about exam rules which could be explained within 20 minutes. Boring.",
            "comment_grading": "I think the mean is set to C+ or B-<br />Got full marks for in class exercises.<br />Asgn1: 19/20 mean:17 <br />Asgn2: 15.3/20 mean: 17<br />Final: 42.9/46 mean: 39<br /><br />Final Grade: B",
            "comment_workload": "Okay. Have in class exercises to be finished within 24 hours after Friday's lecture. Two assignments (1 individual and 1 group project). Final Exam (They made the time for each question very short)",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "owFntvcVssBsV63G7Ly4PGRQJndWLKTG",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "bwct",
            "date": "Oct 15, 2020",
            "title": "",
            "comment_content": "VB and VBA. VB in the first half of semester and VBA in the second half. For a newbie in programming, I find it challenging. It was a blended learning course and we had to complete some online quizzes to get credits. <br />Only 1 class per week and you are suppose to watch the video before doing the in-class exercises during lecture times.<br />If you have macbook for this class, you have to be prepared because it is quite different as it focuses on Microsoft Excel and Microsoft is more compatable.",
            "comment_teaching": "I had James as my instructor and he was alright. Help was frequent because most of the time we were working on inclass exercises.<br /><br />TA Michael was nice. All we did during lab was doing exercise and just waiting for him to address to answer. Sam was funny but helpful.",
            "comment_grading": "Got a B- because I messed up the group assignment 2. <br />Assignment 1 was full marks, but assignment 2 was well below average.<br />I got mean in final exam.",
            "comment_workload": "Workload was heavy for me because I had zero programming background but it will be easy for those who are a god to programming. <br />Online Quiz<br />Assignment 1<br />Assignment 2<br />Final Exam<br />No Midterm",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8KAam6YG4GSaSHTZSbAskqKOLCrPfwYJ",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "meaningless",
            "date": "Jan 02, 2020",
            "title": "",
            "comment_content": "Basic programming knowledge in VBA is taught....<br />Cover topics like ranges, methods, looping, arrays, userforms, etc.<br />Adopt blended learning approach, in-class exercises are given to consolidate what you've learnt during lectures, they are not counted towards grading though",
            "comment_teaching": "Overall: average la...<br />James: a nice guy, tried his best to deliver the contents to students and willing to answer students' questions<br /><br />Bosco: Responsible that he replied email quite fast and gave clear instructions in lab tutorials, marks the assignment in details e.g. check the data validation for each user input... <br /><br />Hope instructions can be more clear la (Won't forget assignment 2 which totally ruined my life at that time...)",
            "comment_grading": "Grading components:<br />Quiz(7 best out of 10) --14%&nbsp;&nbsp;(Full mark is given to everyone for the last three quizzes) <br />Assignment 1 -- 30% (Financial interest calculator)<br />Assignment 2 -- 56% (Grading system)<br /><br />Statistics:<br />Quiz: unknown<br />Assignment 1: Mean = 91.5&nbsp;&nbsp;SD: 17.1&nbsp;&nbsp;<br />Assignment 2: Mean = 86.73 SD: 10.44<br /><br />Idk if the grading will be more lenient or not under the new grading scheme",
            "comment_workload": "Nearly zero for the quizzes, just revise before the lecture is ok... workload mainly comes from the assignments, esp the second one (spend more time on checking your program in detail if you wanna get a full mark)",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dtG3KxIYDwq9N7rz2rkuA8G3VgvV7IAR",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                },
                {
                    "id": 1180,
                    "name": "TAM, Bosco",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "holam",
            "date": "Dec 23, 2019",
            "title": "ISOM 3230",
            "comment_content": "Basic VBA teaching<br /><br />ONE REMINDER: MAKE SURE YOUR CLASS DO NOT CONTAIN QFIN PEOPLE<br /><br />Each year in fall semester, there are 38-40 qfin year 2 pre-registered into this course. Make sure not only your class, and also other section with same professor do not contain QFIN people. Otherwise you will face crazy grading curve.<br /><br />Note for qfin students: there is two ways to avoid facing the crazy grading curve<br />1. register in year 1 Spring semester, since you are not required to take ISOM 2010 before this course (only first batch qfin can do this)<br />2. swap away in year 2 fall (but I can tell you it is extremely difficult, although I am using this way)&nbsp;&nbsp;Remember, swap away means to swap from one prof to another, but not different section of same prof",
            "comment_teaching": "I think the professor try his best in explaining the concept with concrete example and hand on experience. But, I cannot find the value of the lesson. Most likely I leave after 30-40 minutes. If there is no in-class quiz, I think I will not appear.<br /><br />The TA Bosco is very good TA. He is able to deliver the requirement of the homework in a clear and concise way. He is also able to figure out the focus of each professor. And, most importantly, ask him everything about assignment. He, but not professor, mark the assignment. Make sure you satisfy his requirement. He marks quite in detail. Please remember to do the data validation for each user input. Otherwise marks will be deducted.",
            "comment_grading": "Original scheme:<br />Quiz(7 best out of 10) (7%)<br />Assignment(20% individual + 20% group)<br />final exam (53%)<br /><br />New scheme: <br />Quiz(7 best out of 10) (14%)&nbsp;&nbsp;&nbsp;&nbsp;(everyone get full mark for the last 3)<br />assignment (all individual 30% + 56%)<br /><br />Quiz: summary statistics not shown&nbsp;&nbsp;&nbsp;&nbsp;Me: 14/14<br />Assignment 1: mean = 91.5&nbsp;&nbsp;SD: 17.1&nbsp;&nbsp;&nbsp;Me: 100/100<br />Assignment 2: mean = 86.73&nbsp;&nbsp;SD: 10.44&nbsp;&nbsp;&nbsp;Me: 99/100<br /><br />Letter grade: A+",
            "comment_workload": "quite light, only need revise a bit before quiz<br /><br />Focus on assignments.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tLJiiWKkyTl4vQQlaxHYdeLVlYhCLk80",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                },
                {
                    "id": 1180,
                    "name": "TAM, Bosco",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Freshmanjaijai",
            "date": "Jun 09, 2019",
            "title": "I love JAMES KWOK",
            "comment_content": "As I also took a look on COMP1022Q past papers before taking the finals, I would say that ISOM3230 is in general more about business use case, specifically in basic data analysis. It introduces some basic programming logics like nested loop, array structure. Please note that the main difference between ISOM3230 and COMPQ is ISOM3230 does not require the learning of visual presentations, audio use of VBA programming while COMPQ also include such learning.",
            "comment_teaching": "Excellent teaching to be honest. I am interested in learning programming myself. I tried to take several online courses in Udemy but nothing could be comparable to the videos provided in this course surprisingly. It basically covers everything you need to know for a lot of automation project,s",
            "comment_grading": "53% Finals 89/100; <br />1.1 SD Above (Mean around 71%)<br />20% Assignment 1 Individual Work 98/100<br />Mean around 95<br />20% Assignment 2 Team Work 92/100<br />Mean around 89<br />Weekly Quiz 5.5/7<br />Not sure about the mean but probably around 6<br /><br />Final Grade = A <br />I only expect an A- but I end up earning an A with 1.1 SD for the final. The cut off for this semester is around 92.2% for the entire course for an A+ and now I have 90.87%.",
            "comment_workload": "Pretty easy work I would say. They never change the assignments criteria and sources are always adequate.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VPHDqVaGlHNJt9Rl9Iok4fFCrohJeaqZ",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                },
                {
                    "id": 819,
                    "name": "CHEUNG, Tsz Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ALCF",
            "date": "Aug 21, 2018",
            "title": "",
            "comment_content": "This course is quite easy for students who have basic programming knowledge. The course was teaching the basic programming for the languages VB and VBA.",
            "comment_teaching": "Both the professor and TA were so nice, and all the knowledge was taught step by step. You would have a mini group assignment in each week during the lesson, so you could apply your knowledge that you just learnt . Moreover, the lab also emphasis the application of the knowledge. So overall the course was good.",
            "comment_grading": "The course overall is quite easy and the average grading seems to be B. So the grading is quite good, but if you are aiming for A range, you will have to be very careful in your exam and assignment, since the competition is quite intense due to the easiness of the course.",
            "comment_workload": "Two assignment, one mid term and one final exam.<br /><br />One assignment is to use Visual Basic to write a simple program. (The content varies in different semester, but still not that difficult. This is an individual assignment, but TA will help a lot if your willing to ask.)<br />Another is to use VBA to write a macro in Excel. (In my semester is to write a macro that downloads the data automatically from the web and plot a graph in Excel. This is a group assignment, so it is not that difficult.)<br /><br />Mid term was mainly focusing on VB. As I remember, no cheat sheet was allowed. Same, it was not that hard.<br /><br />Final was mainly focusing on VBA, they would provide you a cheat sheet that showed all the basic concept (which was almost the same as the revision notes that they distributed before the final exam). So the course overall is quite easy.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "80hCFYSUMVe5ONL4DpcYN73x8Txc9M6v",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                },
                {
                    "id": 1180,
                    "name": "TAM, Bosco",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ylhst",
            "date": "Jun 19, 2018",
            "title": "",
            "comment_content": "Mainly about VBA programming (E.g. Array, UserForm and For-Loop)",
            "comment_teaching": "The professor emphasized on blended learning, which was a combination of lectures, pre‐class assignments and pre‐class video lectures.<br /><br />The TA was nice and friendly.",
            "comment_grading": "Assessment Weighting<br />Final Exam&nbsp;&nbsp;48%<br />Assignment 40%<br />Online Quiz &amp; Discussion&nbsp;&nbsp;12% <br /><br />Since there were no mid term examination in this course, final examination thus became important.",
            "comment_workload": "There were 2 assignments throughout the entire course. One was an individual assignment while another was a group assignment. Each assessment had a weighting of 20%. The group assignment was relatively difficult since you had to create a stock trading analysis. Having good teammates were of paramount importance since its workload was heavy.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mt2MvBm4GqfnJfuji1GeZu847wFziBB6",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                },
                {
                    "id": 819,
                    "name": "CHEUNG, Tsz Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "I love UST",
            "date": "Feb 08, 2018",
            "title": "TA is so warm and good",
            "comment_content": "About VBA programming. <br />And how to construct user form, <br />looping, if and else statement",
            "comment_teaching": "Video lecture is so good<br />TA is willing to help, Olivia is so good and supportive. She is gorgeous.<br />But beware of minor things, the midterm exam is all about minor things. One space will lead to a different answer",
            "comment_grading": "Fair enough, but do not take it in the fall semester !!! HAVE A LOT OF QFINERSSSSS. U WILL DIEEEEEEEEEEEE.Spring semester is good. <br />95% above will be A+ for sure",
            "comment_workload": "Not much workload except the 2nd Assignment, which is about the trading data analysis.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yBD26meGn51cky7fzmqVugZaorTzh9wH",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ekim",
            "date": "Jan 16, 2018",
            "title": "Short Review",
            "comment_content": "It covers most of the technique of VBA, as well as practical example of using VBA. You can really get a grasp of the VBA language, provided that you attended all of the lectures and lab, as well as completed online lectures and quizzes. VBA is useful in reality. You are encouraged to enroll in this course.",
            "comment_teaching": "Emphasize on Blended learning: combing lectures, lab, online lectures, online quizzes, in-class exercises, personal and group projects. Lots of ways help you to have a fully understanding on VBA. Online lectures are offered before the lecture",
            "comment_grading": "Grading is average. Hard to determine if it is strict or lenient. <br />The background of learning other programming language is an advantage.",
            "comment_workload": "As i mentioned before, you will be assessed by many ways. Workload is quite heavy. <br />Online Lecture and corresponding Quizzes - once a week<br />Lecture and in-class exercise - once a week<br />Lab - once a week<br />one personal and one group project throughout the semester",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "M1GeoxCFgPnUYJiUkVqYcP4Nh25OuXhP",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 377,
                    "name": "CHEUNG, Yat Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "usthokba",
            "date": "Sep 02, 2017",
            "title": "",
            "comment_content": "The course covers many useful techniques of Excel VBA applicable in business. Comparing with COMP1022Q, this course makes it more relevant to business students and gives more emphasis on application.",
            "comment_teaching": "Clear and detailed explanation in class. You should have no problem understanding all code lines by attending every lecture and listening to him. He is friendly so you can always ask him questions.",
            "comment_grading": "Exam was extremely difficult but grading was not bad. Midterm mean was less than 50%. I was above mean 1sd for midterm. Final score was unknown. I got A range at last.",
            "comment_workload": "One individual assignment and one group project, all about writing VBA.<br /><br />The project can spend you a lot of time if not all your teammates are good at writing codes. Also need to add extra methods/sub-procedures, and write good quality comment lines to get a better score.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kTfE2AxJi3G6BjUASIN7RZHn4JMrs7Tz",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                },
                {
                    "id": 377,
                    "name": "CHEUNG, Yat Ming",
                    "rating": 1
                },
                {
                    "id": 958,
                    "name": "NG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "iloveis",
            "date": "Feb 07, 2017",
            "title": "Most interesting IS course",
            "comment_content": "As its name implies, this course mainly covers materials related to VB and VBA. The first part will be covered in the midterm examination while the second part will be covered in the final examination which is not cumulative, Assessment is simple, mainly midterm, final and project with ~15% for easy online quizzes and online discussion forum.",
            "comment_teaching": "Teaching is nice. I found the blended-learning be quite effective which you can first watch a video about the upcoming lectures and discuss online with your peers then participate in in-class activities for better understanding.",
            "comment_grading": "Good grade overall. If you got a mean for all the assessments, you will end up with B/ B+ which is very nice. James is famous for good grade, slightly higher than mean will earn you A range !",
            "comment_workload": "I think the workload is fair, you still need to spend a considerable amount of time to test out different run-time errors/ logical errors in order to obtain good grade in the exams.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pHWaY0ZD7p26glPufe9NLqj2aU6UOL88",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                },
                {
                    "id": 819,
                    "name": "CHEUNG, Tsz Lok",
                    "rating": 1
                },
                {
                    "id": 958,
                    "name": "NG, Sam",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "venska",
            "date": "Jan 24, 2017",
            "title": "",
            "comment_content": "A blended learning course, meaning you will need to watch video lectures. In 1 week, 1 class will be used to watch the video on your own (no need to come to class) and the other class will be used for reviewing the video lectures and doing in-class exercises (group). After watching the video lecture, you will need to answer questions in the online quiz (3 attempts).<br /><br />You will form a group in which you will work with throughout the course (for the in-class exercises and the group assignment). The in-class exercise will be given and submitted from Google Classroom. Some of the questions will be similar to those in exam.<br /><br />Lab is somewhat useful to practice your programming skills. Do come to the lab sessions as there will be 2 lab demonstrations throughout the course. You will then need to show the TA how your program works.<br /><br />Course materials:<br />1. Visual Basic<br />- Data<br />- Input/Output<br />- Conditional Statements<br />- Looping<br />- Arrays<br />- Methods<br />=== MIDTERM ===<br />2. VBA:<br />- Class and Objects<br />- Excel Objects (Workbooks and Worksheets)<br />- Range Objects (Cells Manipulation)<br />3. Business Applications:<br />- Data Manipulation and Validation<br />- Implementing Formula<br />=== FINAL (non-cumulative) ===<br /><br />Every class before the exam, the professor will go through the types of exam questions as a guideline to study.<br /><br />Overall, the content is very appropriate for students with no programming background.",
            "comment_teaching": "The professor makes sure everyone understands the materials and is willing to answer your questions. In class, he sometimes ask question to random students. Even though it is okay to not get the right answer, try to listen to what he is saying and be prepared for his questions. On the class before each exam, he gives guidelines, which I think is very useful as it clearly states what will be tested in the exam.",
            "comment_grading": "Grading:<br />Midterm Exam: 20%<br />Final Exam: 30%<br />Lab Assessment (4% each): 8%<br />Assignment (15% each): 30%<br />Online Quiz (1% each) And Discussion (1% overall): 12%<br /><br />The midterm was quite tricky, so pay attention to the details as some programs may lead to errors. The final was relatively easier, made up of MCQ, short answers, and long answers (write a program). Cheat sheet is given, even before the exam day.",
            "comment_workload": "Lab assessment is pretty easy as long as you can make the program by yourself. The questions asked in the lab demonstration will be basic, only to test your understanding towards the flow of your program.<br /><br />Assignment 1 (individual) is to write a program (calculation game) in Visual Basic (VB). Just follow the guidelines and you will be fine.<br /><br />Assignment 2 (group) is to write a program (stock analyzer) in VBA. It is harder than assignment 1 but you can work with your group to figure it out.<br /><br />Online quiz will be given every week to make sure that you watch the lecture video. Point will be given if you can get all answers correctly within 3 attempts. Make sure to finish your quiz before the deadline (5 pm of the day before the next class).<br /><br />Discussion can be done anytime and you will only need to post in canvas or send an e-mail once to get the point. You can either ask a question or answer the questions in canvas.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xNqTmNGUGaYd0dgqeMtLxzvfN60DP7zL",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "b0chau",
            "date": "Nov 25, 2016",
            "title": "",
            "comment_content": "A course about very basic VB and VBA programming language.<br /><br />This course is designed to train students to understand programming, in particular business applications programming. Students will learn why we need to use programming in their professions and why they build business applications, how business applications influence business workflows, how programming could be more beneficial and useful in business applications, and so on. Students will learn basic programming syntax and structure, and how to build basic business applications using high-level programming languages.",
            "comment_teaching": "Blended learning - only a class for in class exercise(not counted), video lectures.",
            "comment_grading": "Really good grade, as long as you watch all the video and go through all the lab.",
            "comment_workload": "A.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Midterm Exam<br /><br />20%<br /><br />B.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Final Exam<br /><br />30%<br /><br />C.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Lab Assessment<br /><br />8%<br /><br />D.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Assignment<br /><br />30%<br /><br />E.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Online Quiz (1% each)<br />And<br />Discussion (1% overall)<br /><br />12%",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "AaBV04UU5gdmeZmMwCB3WiAbcZ9LR8oB",
                    "name": "Capture",
                    "format": "png"
                },
                {
                    "key": "vRYu5VHoIx4K291wYDZvkJ4HCp9dXj58",
                    "name": "schedule1-1",
                    "format": "png"
                }
            ]
        },
        {
            "hash": "DWM9LxubNa744UgK9und5xentAthtdAr",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                },
                {
                    "id": 819,
                    "name": "CHEUNG, Tsz Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cpjai",
            "date": "Aug 22, 2016",
            "title": "",
            "comment_content": "Very useful content and the depth of VBA language is not as deep as Comp1022Q",
            "comment_teaching": "James is nice and he will teach the class through video lerning.",
            "comment_grading": "As long as you hand in the online test on time, you will get the point. Moreover, the projects are easy. You can just follow the the instructions given by the project menu and you can get full marks.",
            "comment_workload": "The workload is acceptable. You are required to watch the lecture video every week and finish the online test on time. There will be 1 mid term and 1 final exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pbuvI96ojblqfrvjNbFg5hwhtOIaEEQj",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                },
                {
                    "id": 376,
                    "name": "CHOI, Timture",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "1999",
            "date": "Jan 10, 2016",
            "title": "VB and VBA programming course",
            "comment_content": "Common programming language:<br />Data Type, Input/Output, Conditional Statements, Looping,<br />Array, Methods<br />For VBA excel:<br />Excel objects, Range objects Date Manipulation and Validation.",
            "comment_teaching": "This is a blended-learning course.<br /> (which means that your need to watch the online video&nbsp;&nbsp;<br />&nbsp;&nbsp;yourself before going to the lessons)<br /><br />Usually, only 1 lesson in each week.<br />During the lessons, it will focus on concepts and there will be in-class exercise.<br /> (I suggest to attend the lessons because the exam&nbsp;&nbsp;<br />&nbsp;&nbsp;questions are usually extracted from in-class and&nbsp;&nbsp;&nbsp;<br />&nbsp;&nbsp;&nbsp;FB discussion questions)<br /><br />For lab, it is a must to attend because it is a way for you to practice on typing code. and Timture is a very good TA, very funny and nice.",
            "comment_grading": "Midterm Exam 20%<br />&nbsp;&nbsp;&nbsp;(mc)<br />&nbsp;&nbsp;&nbsp;(focus on VB)<br />Final Exam 30% <br />&nbsp;&nbsp;&nbsp;(mc and fill in the blanks)<br />&nbsp;&nbsp;&nbsp;(focus on VBA)<br />Lab Assessment 8% (4%@1)<br />&nbsp;&nbsp;&nbsp;(Demonstrate your&nbsp;&nbsp;&nbsp;<br />&nbsp;&nbsp;&nbsp;&nbsp;understanding on lab materials)<br />Online quiz 12% <br />VB assignment 15% (individual)<br />&nbsp;&nbsp;&nbsp;(use VB to make a mortgage calculation)<br />VBA assignment 15% (group)<br />&nbsp;&nbsp;&nbsp;(use Excel VBA to make a simple financial&nbsp;&nbsp;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;portfolio program)<br />Discussion 1% (bonus)<br /><br />88.xx% B+ 89.xx% A-<br />(Around 25% A range)<br />James Kwok grading is quite good.",
            "comment_workload": "The workload of this course is quite low actually.<br />You just need to keep yourself clear about the concepts and do more practice is the more important way to help you get good grading. Not much memorization is needed.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZNcb4DzaxLRksGfsWicEi76qZrr2b6bC",
            "semester": "2020-21 Spring",
            "instructors": [],
            "is_author": false,
            "author": "helloust12345",
            "date": "Jun 30, 2021",
            "title": "Pretty light workload overall",
            "comment_content": "Pretty useful content, teaches some basic programming concepts like loops / array / if etc. There are also some VBA specific concepts like range, worksheets...<br />In general the content is easy to understand even if you have 0 programming background. The prof assumes that you have no prior exp with programming so he's really patient and tries to get through all the basics.<br />Personally Ive done comp1021 before i did this course, so a lot of the programming concepts were pretty much the same, I just had to learm the syntax for vba.",
            "comment_teaching": "Teaching was okay, the professor was quite nice and really willing to answer any questions. The pace was also pretty good",
            "comment_grading": "Assm 1 28.22/35 (mean 27.61) 35%<br />Assm 2 33.03/35 (mean 27.03) 35%<br />Assignments were quite challenging. They basically ask you to build sth with certain requirements using vba. They grade based on a lot of things, including whether you fulfil the requirements, whether its user friendly, whether your programming style is good etc.. And i feel like its really easy to make a mistake or miss sth since there are a lot of minor details that are not mentioned in the assm requirements. I think it helps quite a lot as ive done another programming course before so im more familiar with the concepts<br /><br />In class exercise full marks 30%<br />Supposedly 10 exercises in total, i think you can miss at most 3. The prof gives you around 20-40(?) mins to do it in class but then he goes through all the answers with the class so don't worry even if you're clueless lol. I think they just wanna make sure everyones on track since no attendance is required for the course and there are only 2 assms throughout<br /><br />final grade A-",
            "comment_workload": "Workload is really light in my opinion. In class exercises basically do not require you to do anything, just copy ans from prof and you get 30%. As for the assm, each of them took me around 3 days to complete",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3JINxRtTCTDWS8OgYZn75dtiPXpBwM3I",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "some_sbm_guy",
            "date": "May 20, 2021",
            "title": "A Joke",
            "comment_content": "This is without doubt the worst course I have ever taken in UST. It teaches absolutely nothing. I only took in because my program manager disallowed me to drop it. Frankly, VBA is almost useless nowdays. And if you really need it, you can learn everything you need by googling because the language is designed for non-coders and is very easy to learn.<br /><br />In summary, try everything you can to not take this course. COMP1022Q has a much heavier workload than this but still got cancelled by CSE for being too simple and useless. I guess that tells you something.",
            "comment_teaching": "James sucks. I'm pretty sure he's a smart guy, but just too irresponsible to try and teach anything useful in the course.",
            "comment_grading": "Ambiguous grading without any standards.<br /><br />TA gave me a really bad grade for one of the assignments with some absurd reasons. I got full for everything else and finally got a B range still.",
            "comment_workload": "There is none. To be more specific, there is nothing to learn in this course, although the weekly lab still takes up some time meaninglessly. I'm sure you can cover the entire course content in an afternoon on google, because that's what I did before the course when I tried to learn VBA myself.<br /><br />Don't worry about the exams. Go through the slides two days before your final and you'll get full marks as long as you don't make fat finger mistakes.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "kqQqqdAi3asuxHAzFJWYXcKCyiZNNMOO",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 377,
                    "name": "CHEUNG, Yat Ming",
                    "rating": 1
                },
                {
                    "id": 1180,
                    "name": "TAM, Bosco",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "csyuaf",
            "date": "Jan 20, 2020",
            "title": "",
            "comment_content": "An introduction to business applications programming will be covered in this course. Students will learn and understand programming concepts and gain programming experiences for business applications development through a business programming language.<br /><br />It will cover some useful VBA techniques and programming functions. You can gain lots of experience in writing a useful program.",
            "comment_teaching": "Muller explains clearly and he welcomes students to ask questions. His teaching is also easy to understand.",
            "comment_grading": "It is fair. As everyone did their assignment well and get very high marks.",
            "comment_workload": "Heavy. Need to do 3 individual assignments since the final exam was cancelled. <br /><br />Normally is 1 individual assignment, 1 group assignment, midterm and final exam.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FdOS678CBYOOfDixQQfurCGAOUbnwKMg",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KentLung",
            "date": "Jun 29, 2019",
            "title": "",
            "comment_content": "Overall: basic but useful<br /><br />1. Basic VBA syntaxes<br />2. Userform<br /><br />Contents in the preliminary stage are delivered in quite a slow manner, probably because, as James put forward in the first lesson, he assumed all the students are green hands to programming.<br /><br />However, he will abruptly speed up at around midterm period (Note that this class does NOT have a midterm exam); the materials can be quite over a noob's hand——thus if you have no programming experience before, you have to pay more attention at the early stage.",
            "comment_teaching": "Overall: nice teaching<br /><br />James is a sedulous Prof with an effusive teaching style; Bosco is a dutiful TA who can always provide an intelligible explanation.<br /><br />All exam materials will be covered in the lecture videos and labs.",
            "comment_grading": "Overall: fair grade<br /><br />A. Final Exam —— 53%<br />B. 2 Assignment (20% each) —— 40%<br />C. 7 out of 10 In-class Quiz (1% each) —— 7%<br /><br /># Finals 95/100<br />(Mean: 71.46; SD: 15.87)<br /># Assignment 1 Individual Work 100/100<br />(N/A)<br /># Assignment 2 Team Work 100/100<br />(Mean: Mean: 89.89; SD: 12.5)<br /># In-class Quiz 7/7<br /><br />Final Grade: A+",
            "comment_workload": "Overall: Light workload.<br /><br />Have to do in-class quizzes on a weekly basis based on lecture videos; however, the questions are simple.<br /><br />There are lab sections, provided by TA, mainly cover some practices and provide supports to assignments; not counted toward final grade so is quite relaxing.<br /><br />Assignment 2 is quite demanding, you need to familiarize with all the things that were covered in order to have a good result. Working with other students as a programmer can also be impalpable in the first place. <br /><br />The final exam is quite easy; all the contents are covered in the lecture videos without much tricky pitfall; reviewing all the materials given will be enough.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2cOJ65AkunQVjQUUka8VyltpUztEKrx8",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 375,
                    "name": "KWOK, James Sai Ho",
                    "rating": 0
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hi_everyone",
            "date": "Jan 02, 2022",
            "title": "Troll course",
            "comment_content": "Basic VBA stuff, including variables, if then else, loops, range and cells, arrays, solver and user-form.<br /><br />However, the slides are NOT detailed enough, while the content in each topic is also NOT comprehensive enough in my opinion.",
            "comment_teaching": "You will only learn &quot;how to use google to solve your problem&quot; in Jame's Lesson.<br /><br />My advice: don't go to class unless there is in-class exercise",
            "comment_grading": "The only good thing in this course is the grade.<br />I didn't spend much time on revising the final exam and all in class exercises, finally get A+.",
            "comment_workload": "Fair.<br />2 complicated assignments which require you write very lengthy VBA codes and perform A LOT of debugging. (30%)<br />3 in-class exercises, choose the best 2 (30%)<br />final exam (40%)",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}