{
    "error": false,
    "course": {
        "id": 680,
        "subject": "ISOM",
        "code": "3180",
        "name": "Telecommunications and Computer Networking Management",
        "description": "Essential elements of telecommunications in support of business activities. Topics include OSI Model and TCP/IP Protocol Suite, LAN and WAN technology, voice and data communication technologies, communication architectures, networking and security, protocols and standards.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"4621\" href=\"/review/COMP4621\" target=\"_blank\">COMP 4621</a>",
        "rating_content": 4.67,
        "rating_teaching": 4.93,
        "rating_grading": 3.59,
        "rating_workload": 4.52,
        "review_count": 27,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 370,
                "name": "DIAS, Garvin Percy",
                "count": 27
            },
            {
                "id": 801,
                "name": "NG, Ka Wai Tommy",
                "count": 19
            },
            {
                "id": 1477,
                "name": "Hilary CHEUNG Chun Lok",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "cfXvaknEAo02mA8GnQ3OOD9VucxX4WPq",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "toxicustjj",
            "date": "May 28, 2021",
            "title": "1 point cost you a subgrade, THINK TWICE BEFORE TAKING THIS COURSE!",
            "comment_content": "Everyone else here mentioned the content, it is more or less the same:<br />-Networking Protocols and Communication <br />-Ethernet <br />-Transport Layer<br />-Network Layer and IP Addressing<br />-Subnetting IPV4 addressing<br />-IPV6 Addressing (not included in exam nor assignment)<br /><br />First networking class for me and at least I feel I learned something. For those who aim to get the CCNA thing done, this class suits you. (I just enrolled coz I don't have enough credits this semester..., so I don't know anything bout CCNA)",
            "comment_teaching": "Percy explains everything in detail and easy to understand. But need some time to adapt his accent and always pushing the pace in lectures. (He's fun and he will say 快啲啦 when looking for responses from us)<br />Tommy does a fair job by going through the notes and the demo on the packet tracer. (He talks so slow that I speed up 2X when watching the video)<br /><br />Claim: I missed so many classes and only watch the lecture/lab videos. So I didn't interact much with Percy and Tommy. Still, it is good enough for you to understand what's happening by watching the video and with a little assistance from Google.<br />If you dare to learn as a beginner of networking, this class is a good start.",
            "comment_grading": "The only reason I don't recommend this course to you all. Let me show my grade and score first:<br />ASG1: 15/15 (mean: 13.55/15)<br />ASG2: 14/15 (mean: 13.74/15)<br />ASG3: 15/15 (mean:12.72/15)<br />ASG4: 20/20 (mean: 18.98/20)<br />FINAL: 34/35 (No stat given, need to send email to Tommy to ask your own score)<br />GRADE: A (total 98/100)<br /><br />One of my friends get 99/100 and get A+, while another friend get 97/100 and get A-.<br />So the estimated cutoff in A range:<br />A+: 99-100<br />A: 98<br />A-: ?-97 (will update when I get more data)<br />(Not sure if 0.5 points exist...)<br /><br />Extremely competitive in this course as the material is not challenging and even 1 point will cost you a subgrade. Crazy af. Especially it is a take-home exam, have to show respect to all classmates who also did it by their own effort. Felt so unsecured when handing in the final. <br /><br />If you are a careless person or you aim for an easy A range, this course is not recommended. Please ensure what you want to achieve when you enroll and adjust your expectation.",
            "comment_workload": "No attendance (I skip 90% of the lecture and lab), video is provided.<br /><br />4 Lab assignment(15%+15%+15%+20%):<br />Watch the lab video and get some time playing with the packet tracer, and stay alert in every single question. Usually take around 2 hours to get it done, maybe a little bit longer for assignment 4 as it is a comprehensive task using what you've learned from the class.<br />I won't say it is difficult, but make sure no careless mistake is made. And try to explain as detail as possible. (Get 1 point deducted for explaining too briefly)<br /><br />Final assessment(35%):<br />A 24-hour take-home exam, 8 questions in this semester. Everything is taught in lectures so it is not difficult at all. <br />Take care of every detail and it is the most time-consuming part(Took around 6 hours for me to finish and do triple check). <br />Some of my classmates said they wrote 3000 words for the final, but I don't think we need that much. I only wrote around 1000 and still get a decent score. Accuracy is the key.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 8,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4Hs1LFMN3GbhcblYnMM5UY2iwg30yxZT",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Lam Ka Chun",
            "date": "Dec 22, 2016",
            "title": "",
            "comment_content": "教下data點透過唔同既protocol同途徑傳送到唔用既目的地,對於了解一個network既組成有一個初步既概念,不過由於係intro course,好多野都好抽象,就算上左lab都未必知實際操作係點,想知可能要讀埋isom3380.",
            "comment_teaching": "percy教得幾好,不過可能呢個course既concepts真係唔難太明啦,即使上堂唔明,睇番lecture video都好難唔明.不過上堂要堅持聽個幾鐘percy講英文其實有點兒辛苦.撇除呢點,教學真係一流.同埋好多野lecture notes寫得唔太清楚,要上堂聽番.",
            "comment_grading": "Lab assignment: 40%(10 x 4)<br />Midterm: 16%<br />Quiz: 14% (連埋FINAL考,可以當係FINAL一部分)<br />Final: 30%<br /><br />final冇出分,Lab assignment同midterm既mean都好高,大多數人final前都係一兩分差距,所以final(final+quiz)就係定高下既時間,我midterm below mean,lab assignment都有兩份below mean,最後應該final考得唔錯,所以出黎個grade都唔差.故此大家就算mt同assignment炒粉都唔使怕,努力溫final就咩都有可能發生.",
            "comment_workload": "workload好易應付,midterm大慨week7-week8考,入面既內容溫一兩日點都溫得完,重要全mc.<br />lab assignment有四份,答案lab worksheet好多都會有,唔識既就上lab問.應該都穏拎9-10/10.<br />煩少少既就係final.唔cumulative,不過考既野都比較多同要花多小小時間理解,因為重點唔係背野而係要明入面d concepts.<br />因為我尾段冇點上堂,所以大部份溫書時間都係用黎睇lecture video,其實我覺得就算有上堂都可以睇多次當溫書,然後去考就得,因為percy解得唔錯.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iWkaFTI6HkFp00H1rOqCaeLWV43sOD9A",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                },
                {
                    "id": 1477,
                    "name": "Hilary CHEUNG Chun Lok",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Stress",
            "date": "Jan 26, 2021",
            "title": "Competitive, not as good as people said",
            "comment_content": "Network Protocols, Network Devices, Ethernet, Network Layers, IP Addressing, Subnetting IPv4, IPv6",
            "comment_teaching": "Percy is nice and welcome for questions.<br />He may be a bit chur in class by speeding students up but overall he is a good professor.",
            "comment_grading": "All answers of the assignments would not be released to us, nor discussing the answer in class or lab. I totally don't know where I did wrong. The marks were just released on canvas (final assignment even did not release score...).<br /><br />Everyone had high score for most of the assignments and slightly lower would be bad grade....<br /><br />Got C+...",
            "comment_workload": "No attendance, no exam = great, but...<br />4 lab assignments are fine although the last one require more efforts as a comprehensive one.<br />!!! The final assignment replaced for the final exam due to the online semester, was super time-consuming.&nbsp;&nbsp;It was a 24 hours assignment which I did for 13 hours. Questions require lots of effort and words to answer as well as to explain clearly.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "m21kY4hwuL9uTjxDh2TwErlGIvouXJ6D",
            "semester": "2013-14 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "oliverchan",
            "date": "Feb 13, 2019",
            "title": "",
            "comment_content": "Material may be too less. It is very easy to understand since Percy would keep repeating the material. Sometimes he would use many time to explain something that is not difficult. In case comparing to CCNA exam, it is even less than 10% of the CCNA material. Don't think you can take the exam after finishing this course and ISOM3380.",
            "comment_teaching": "Percy is good. They always make us to understand the content easily. Percy would always repeat and repeat the material. Before mid term and final exam, he would use one to two lesson to do revision, you will definitely understand the content based on his teaching mode.",
            "comment_grading": "The content is too easy. Everyone would get a very high score especially for the mid term exam. Since the mean is very high, even though you get mean in final exam may still give you a C+. If you are smart and want to get a good grade, don't take this course! It is more likely to compete with your luck rather than your knowledge.",
            "comment_workload": "4 lab assignments, easy to finish, may finish each using 1-2 hours.<br />Mid term exam, just MC<br />Final exam, MC and long question",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KeTk136aDdfawdVEcGFdlt7TqVkLbFjz",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "omurice",
            "date": "Jan 23, 2017",
            "title": "",
            "comment_content": "Networking basics. Not hard to handle if you have very basic knowledge to computers and internet networking. Even if you don't, instructors and Google provide adequate resources to master the content.",
            "comment_teaching": "Percy explains the slides thoroughly with excellent drawing/diagram/metaphor. He covers essentially every questions on midterm and final during the classes so if you attend classes and pay attention, they shouldn't be hard.<br /><br />Tommy demonstrate pretty much everything you need for assignments during the labs and very helpful on any class-related inquiries.",
            "comment_grading": "Given that exams and assignments are easy and you can get every answers during classes, the curve is high. You need to get EVERY answers correct in order to get an A (my own opinion, I don't have any figures). To me, it rewards the ones who work the hardest. <br /><br />I missed 1-2 questions on midterm and final, missed 0-1 questions on three of the assignments but did badly on one of the assignments. I got a B.",
            "comment_workload": "If you pay total attention to every classes and labs, you shouldn't need much time after classes regularly. <br /><br />Midterm and final are not cumulative and Percy provides quite a lot samples questions which will appear on exams.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QwtTFwga10AhbLR66cLXA7qBOsqUyJmj",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Varna",
            "date": "Jan 22, 2016",
            "title": "ISOM 3180 review",
            "comment_content": "The content is very interesting. As a business student and never having learnt anything about networks before, it is quite easy to follow as the instructor is amazing. It covers a lot of interesting topics such as CCNA networking, making a cable, IP addressing, a lot of knowledge about IPV4 version and a little about IPV6. It is a good course if you want to learn something new and really bridges the gap between computers and business. Overall, it is an interesting course.",
            "comment_teaching": "The teaching is really good as long as you go to EVERY class and listen to him carefully. <br /><br />He explains everything very clearly and it is very clear to follow him. At the start of every lecture, he asks questions about the previous lecture for around 10 minutes and then we learn the new course content. You can ask him the same doubt over and over again and he is very patient with you. You can approach him easily and he is a FUN teacher to have. One of the best I have had so far! :D",
            "comment_grading": "The grading is&nbsp;&nbsp;really tough. I did mess up in the midterm, not by much and thought that I could make up for it in the finals, however, that was not the case. The course is very competitive and most people perform extremely well. The overall mean for this course was 89.8% and even getting an overall percentage of 90 ended up being a B- <br /><br />So you have to perform well throughout. The labs, the midterm and the final is all important towards your final grade and not scoring well in even one of those will result in an unsatisfactory grade. The mean for this course is usually very high (around 90-95%) as the content is &quot;easy&quot;, however, in order to be on the safe side try and perform well in everything. Getting an A range would require at least a 95% overall.",
            "comment_workload": "The workload is pretty okay. <br /><br />Lab - 10% each (4 of them) <br />Comment: They changed the lab requirements this semester. Instead of having 4 lab assignments, the last one requires you to do a lab demonstration. You have to set the IP addresses, MAC addresses, set up a network of routers, switches and PC's, set passwords encryption and a lot more for this demonstration. You have to prepare really well for this lab. <br /><br />Midterm - 16% <br />Final - 44%",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "arSB0eEkJVYJBaNFEVvHj7dlW6i37X2m",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "PPBBB",
            "date": "Dec 29, 2019",
            "title": "Good teaching, Easy Grading",
            "comment_content": "6 Compulsory Modules in total:<br />1) Exploring the Networking (Introduction)<br />2) Networking Protocols and Communication (e.g.what happened in each level in OSI Model, Introduction to Switches, Data Link Layer)<br />3) Ethernet Part I and II (Different LAN technology, Routers, Introduction to Network layer, broadcast domain and collision domain)<br />4) Transport Layer <br />5) Network Layer and IP Addressing<br />6) Subnetting IPV4 addressing<br />Plus one optional module:<br />7) IPV6 Addressing (not covered in this semester)",
            "comment_teaching": "Percy would make sure everyone understand what he taught. Even if you can't catch up what he said in class, lecture videos would be provided after-classes so that you can loop the videos many times. You can whatsapp him for questions that you don't understand. He typically would respond to you within a day. He is super helpful and being respected by many students.<br />Tommy is very experienced and helpful as well. He always pinpoint the important stuffs in the labs.",
            "comment_grading": "The grading changed a little bit this semester<br />Scores in the blankets is what I earned<br />Mid-term Exam: 15% (27/30)<br />Final Exam: 40% (not disclosed)<br />Lab Assignment 1: 9% (9/9)<br />Lab Assignment 2: 9% (9/9)<br />Lab Assignment 3: 9% (9/9)<br />Lab Assignment 4: 18% (18/18)<br />I got A+ finally, I think the most important factor is the final exam as almost many students got full marks in the lab assignments, while the mean for the mid-term is around 26 something. Anyway, it is a competitive course for sure.",
            "comment_workload": "Workload is quite light. Not much time is required for doing revision as long as you listen carefully to what Percy said and understand the concepts well. <br />Apart form examination, you only have to do 4 lab assignments that are very easy to complete if you attend the lab session and jot down what Tommy said.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "k1DXbXujVGoskcuOZ1CxRVeybVZUM7ps",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tania SIu",
            "date": "May 13, 2023",
            "title": "Light workload but useful course",
            "comment_content": "-Networking Protocols and Communication<br />-Ethernet<br />-Transport Layer<br />-Network Layer and IP Addressing<br />-Subnetting IPV4 addressing<br /><br />Basically is how computers, switches, routers, and the internet communicate with each other, with many protocols.<br /><br />I think it is pretty useful and easy because I understand what Percy is teaching in the lesson, so the content does not take much time for me.<br /><br />And for real, it is the most light workload course I have ever taken, lighter than those CC courses.",
            "comment_teaching": "Percy is passionate and requires class interaction. He sometimes speaks some Cantonese too, like &quot;Any questions?&quot; He makes sure everyone is on the same page during the one-minute break. Yeah, it is short but just get used to it. There is an exam review session and mc practice question lesson both before the midterm and final, push myself to revise way before the exam. And Percy is nice and welcome any questions, providing his email, wtsapp and wechat contact to us. Overall, I like his teaching.",
            "comment_grading": "Final exam 45%<br />Midterm exam 15%<br />Lab assignment 1 10%<br />Lab assignment 2 10%<br />Lab assignment 3 10%<br />Lab assignment 4 10%",
            "comment_workload": "Only midterm(All MC questions) and <br />Final exam (15 MCQ and 5 short questions)<br /><br />4 Lab assignments, can be completed within a day.<br /><br />All courses should have a similar workload lol. And no projects!!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lKaKQDqXHTkyZ513iDCaKblQ0ysG8mGN",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tkrc",
            "date": "Jul 21, 2021",
            "title": "",
            "comment_content": "-Networking Protocols and Communication <br />-Ethernet <br />-Transport Layer<br />-Network Layer and IP Addressing<br />-Subnetting IPV4 addressing<br />-IPV6 Addressing (not being tested)",
            "comment_teaching": "Percy explained the contents in details and make examples to let you understand easily. He looked for responses and want an interactive class. <br />Tommy also explained well on the packet tracer and the demos. You could complete the assignments easily if you follow all the steps.",
            "comment_grading": "Extremely competitive. The mean for each lab assignments are nearly full mark. Not recommend to take this if you are a careless person and aim for A range.",
            "comment_workload": "-no attendance <br />-4 lab assignments(15%+15%+15%+20%) based on lab only<br />-Final assessment(35%)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "M7xqXEET43HLexFOKqlCWiwPkN1d16Fo",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hayleysham",
            "date": "Jan 20, 2020",
            "title": "",
            "comment_content": "Exploring the Networking<br />Networking Protocols and Communication<br />Ethernet<br />---midterm---<br />Transport Layer<br />Network Layer and IP Addressing<br />Subnetting IPv4 Networks<br />---final exam---<br />IPv6 Addressing (not taught due to class suspension)",
            "comment_teaching": "十分好 每堂前15分鐘都會review前一堂的東西<br />畫圖清晰<br />又有片睇返",
            "comment_grading": "麻麻地<br />考到好高分都得B<br />------------<br />Mid term: 29/30<br />Assignments: 9/9, 9/9, 8.5/9, 18/18<br />Final: 36/40",
            "comment_workload": "4 Assignments only 有去LAB就識<br />基本上都好容易<br />靠自己專心上堂就得",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0RYaXk0OR632JdaCxmc9qDZzI05BFzbC",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lmaoust",
            "date": "Nov 03, 2019",
            "title": "Good Intro to Networking for CCNA",
            "comment_content": "讀最淺個啲networking, ie. MAC address, OSI model, TCP/IP, etc. <br /><br />如果無底既讀都唔會太難<br /><br />讀完可以教返個CCNA cert",
            "comment_teaching": "Percy 出名講得好詳細，唔明講到明。Mid-term, Final 好多都係出返上堂講過既野。<br /><br />會上堂講啲例子然後問返你問題<br /><br />走咗堂有lecture video 睇返",
            "comment_grading": "因為佢教到個個都明，出卷又唔算超級難，所以個mean 都幾高<br /><br />如果唔小心好易跌落B",
            "comment_workload": "有四份assignment, 每份唔洗一個鐘做完",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sHpm7fXYg88fsaD383Ls9j1qimJROQZU",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "40",
            "date": "Dec 24, 2018",
            "title": "",
            "comment_content": "The content is easy and interesting.",
            "comment_teaching": "Percy's teaching is ok and exercises are provided during lessons. You can ask him to clarify any concepts when needed.",
            "comment_grading": "The grading is not as good as expected, any mistakes will result in a fall in sub-grade as this course is very competitive and everyone is performing well.<br />The midterm is much easier than the final that you must revise thoroughly in order to get a good grade.<br />Attendance to labs are needed.",
            "comment_workload": "Workload is acceptable and assignments are not difficult.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "s1H3ml5R7bydag6QQ1HONFTfqQ7NyeDo",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "801158",
            "date": "Jan 16, 2018",
            "title": "",
            "comment_content": "This course is about how data is transferred in the network. It is very easy if you have basic idea about networking. It is very simple and straight forward, you just need to understand the content and just memorize very little is enough. <br /><br />The content are most likely focused on IPv4 and the data format in different layer. It could be boring if you already know.<br /><br />Here are the chapters and topics that are included in this course<br />Exploring the Networking<br />Network Protocols and Communications<br />Ethernet<br />&lt;mid-term&gt;<br />Transport Layer<br />Network Layer<br />IP Addressing<br />Subnetting IP Networks<br />&lt;final+quiz&gt;<br />IPv6 Address (not included in the exam and just for students who are interested in)",
            "comment_teaching": "Percy teaches very good and he always ask do we have question after a few slides. If you don't want to ask in front of the class, you can ask him during the break. He always use his &quot;girlfriend&quot; to be an example and it help us to understand some concept easily. Also, there are sample question of the exams and he will do revision with us. If you understand the concept in the lesson and attend the review lecture, you should know how to do the exam question.",
            "comment_grading": "Mid-term Exam\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;16%<br />Quiz\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;16%<br />Final Exam\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;28%<br />Assignments (4 in total)\t&nbsp;&nbsp;40%<br /><br />Everyone know how to do the homework and nearly all are having full marks. Mid term is very easy and so the mean is quite high. The only thing can determine the grade is the final exam(final + quiz). Although the concept are easy and simple, there are some tricky question and you should be careful if you wish to have a good grade.",
            "comment_workload": "This course has no workload at all. The homework is something about the lab, it is very easy and short, most of the question are not related to exam. All the questions in mid term and quiz are MC. The quiz is examined with the final. Final is just asking some easy question and nearly just writing numbers. There is no attendance and so you can skip the lecture if you wish. There will be lecture video link sent by Tommy and you can catch up easily.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lzrif0RKvFH9oXZYBGixwGVQDGNugKrC",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LOLLOL",
            "date": "Dec 26, 2017",
            "title": "Boring content made fun to learn by Percy's teaching",
            "comment_content": "The course is designed to introduce students to Networking basic which covers contents related to IPv4.<br /><br />Simply put, we learn how data are transferred from one computer to another. <br /><br />Although the content is not really hard, it can turn out to be really boring. However, Percy delivers it in perfect manner.",
            "comment_teaching": "I would have gotten lower scores in this course if Percy did not teach this course. He is really enthusiastic about teaching. <br /><br />Although he provides lecture video upon request, it is highly recommended for you to avoid missing classes.",
            "comment_grading": "Midterm consists of multiple-choice questions, but the mean is really high 28.64/32.<br /><br />Also, there are 4 assignments related to contents learnt in lab, but as long as you attend the lab, it is not hard to get full marks.<br /><br />So, it all comes down to final exam that decides your final grade. I was able to secure an A, despite the fact that I was just above the mean in midterm.",
            "comment_workload": "Workload is pretty light. There's no attendance, and Tommy (lab instructor) gives enough time and guidance for you to finish 4 assignments.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XkAcjTYdZcTAUvfhjjFePQZdmNizeBiS",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ismahfaris",
            "date": "Nov 08, 2017",
            "title": "",
            "comment_content": "Content is easy to follow and not too heavy.<br /><br /><br /> You begin with lighter content and a brief introduction to different layers of network for first half before going in depth into networking in second half of the semester.",
            "comment_teaching": "Teaching was excellent. Professor makes sure that a short break takes place during lectures where you can clarify your doubts if any before he resumes his lecture.",
            "comment_grading": "40% comes from 4 Assignments related to lab so be sure to attend lab sessions.<br /><br />Remaining weightage will come from both midterms and finals accordingly.",
            "comment_workload": "Not so heavy. Assignments are in bite pieces and can be done quickly as long as you attend lab sessions.<br /><br />Midterms are MCQ based and if you attend the lectures it will be more than adequate to ace the midterms.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OnTTInhldZIOM0GKCs1mwzBx0XOFqLfm",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KKKKK",
            "date": "Mar 14, 2017",
            "title": "Extremely competitive",
            "comment_content": "The course is about how network works by teaching the OSI network model. Common internet protocols are also included like the TCP/IP suite. Things like functions of different internet devices(hub, repeater, switch, bridge and router) will be covered before the mid term.",
            "comment_teaching": "Percy is a nice and friendly professor who encourages questions a lot. Although I'm not quite adapted to his style of teaching, I can still feel his passion to teach and that he feels responsible to his class. He gives his number to the class before the exam so people can get to him without scheduling an appointment.",
            "comment_grading": "The only downside of the course is the tougher than ever grading. Everyone basically gets full marks in the assignment and the mean for the midterm is 27.3/30. So 2-3 marks difference in the final can guarantee a difference in sub-grade.",
            "comment_workload": "The workload is lighter than many other courses. Only four assignments (each consists of around 10 short questions) other than midterm and final.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DM8rqXd7qMd4JYQDPX8Q18FE9zeADaS8",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gawain",
            "date": "Dec 28, 2016",
            "title": "Nice course, good grade if you are careful enough",
            "comment_content": "Interesting contents, you will learn the basics for networking, though not useful unless you are going to take advanced networking",
            "comment_teaching": "Professor is good enough to make sure you know everything you need for the exams. Sometimes, he also brings up interesting topics not included in the exams. Overall, he is one of the best professors in HKUST.",
            "comment_grading": "With regards to workload, the grading is good. There is not much effort required and the final exam only covered three chapters. Just make sure you do not make too many careless mistakes in exams then your grade will not be bad.",
            "comment_workload": "Really low workload. No readings, no projects, just exams and a few simple assignments.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cK7IF5eYi0SOfM4OIaJMEfgvBA8305En",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HCH",
            "date": "Aug 18, 2016",
            "title": "",
            "comment_content": "the course is interesting and i learnt a lot from this course. Things are related to CISA exam, therefore, it is very useful if you are going to take the exam.",
            "comment_teaching": "Percy is such a good professor that he makes everything clear and interesting. And the questions he gave us really helps us to answer the questions in exam.",
            "comment_grading": "Everyone is doing too well. Therefore, the grade cannot reflect how good a student is.",
            "comment_workload": "Besides, mid-term and final. You have to go to lab and do assignments.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dMB04Hyg3V4j2myIxncljl191r53qF2u",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "1999",
            "date": "Jan 03, 2016",
            "title": "A low workload course but important to fully understand all the concepts.",
            "comment_content": "topics include:<br />Basic networking knowledge<br />Networking Protocols and Communication<br />Ethernet<br />Transport Layer<br />Network Layer and IP Addressing <br />Subnetting IPv4 Networks<br />IPv6 Networks (not examine in the examination)<br /><br />This course is also designed to prepare students for the CCNA certification.",
            "comment_teaching": "Generally, the pace of his lesson is not that fast and it is easy to follow. However, it is a &quot;must&quot; that you need to attend the lessons in order to understand those networking concepts and there are lots of notes during classes needed to be jotted down.<br /><br />Before the mid-term, i always skip the lesson and after releasing the mid-term score, i felt regret of it...<br /><br />Percy is also a quite nice person that he is very humorous during class and he would try different ways to make you memorize the concepts easier.<br /><br />Overall, he is awesome!",
            "comment_grading": "Grading policy:<br />3 homework&nbsp;&nbsp;10%@ 1 -&gt; 30% <br />&nbsp;&nbsp;&nbsp;- short questions about the lab materials,<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;nearly all people get full marks in the homework<br /><br />1 In-Lab work 10%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&gt; 10%<br />&nbsp;&nbsp;&nbsp;- testing your familiarity of using those coding to<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;establish a basic network<br /><br />Mid-term 16%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&gt;&nbsp;&nbsp;16% (chapter 1-3)<br />&nbsp;&nbsp;&nbsp;- MC format (30 in total)<br />&nbsp;&nbsp;&nbsp;- mean 28.XX SD 4<br />&nbsp;&nbsp;&nbsp;- i score 25/30 (below 3/4 sd)<br />&nbsp;&nbsp;&nbsp;- 1/4 of the students get full marks..<br />&nbsp;&nbsp;<br />Final examination&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&gt;&nbsp;&nbsp;44% (non cumulative) (chapter 4-6)<br />&nbsp;&nbsp;&nbsp;- MC + scenario type questions<br />&nbsp;&nbsp;&nbsp;- even failing in the mid-term examination<br />&nbsp;&nbsp;&nbsp;- the final is still the most important part<br /><br />Finally, i may perform quite well in the final exam and got B+",
            "comment_workload": "Generally, the workload is not high at all.<br />But you need to understand the concept very well in order to excel in this course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "77jRoYfvJYognEE9l8GtKeh0d6TXAswF",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chinwang555",
            "date": "Aug 22, 2020",
            "title": "",
            "comment_content": "CONTENT<br /><br />Network Protocols, Network Devices, Ethernet, Network Layers, IP Addressing, Subnetting IPv4, IPv6<br />The content might be a bit complex and abstract at the beginning, but Percy made perfect explanation with graphs and drawings",
            "comment_teaching": "TEACHING<br /><br />Percy reviews at the beginning of each class which helps me better understand. If you want to listen to a quick go through or summary of the slides, you can definitely watch the first few minutes of the video. The powerpoints are clear and Percy often use diagrams to explain (really often), so I suggest you have a pencil and a notebook prepared.<br />Also, TA Tommy is a very nice guy. He records videos every Monday, and so the students can ask questions at Friday lab session (although I never attend, I think this is a good way). TA uses cisco packet tracer and this is important since lab assignments account for 60% this semester and are all about how to use packet tracer.",
            "comment_grading": "GRADING<br /><br />Quite good.<br />4 lab assignment (12%*3, 24%*1), 1 final assessment (40%).<br />Don't know the score of the assessment and the last lab assignment, but I eventually get a good grade. When the semester started, Percy wanted us to have a group report, but students complained about it since lots of professors wanted group assignments and presentations. So he changed it to the final assessment. It is like an assignment of all chapters and is more comprehensive. We got 2 weeks to finish it on our own. Percy is surely the kindest professor in UST, he gave us a long time to finish the assignments and assessment, and you can ask for postponing the deadline for assignments if you really have a hard time. Anyway, Percy is good.",
            "comment_workload": "WORKLOAD<br /><br />The workload is not low since I forget the contents if I don't review them. But is already not that tense compared to other classes. Maybe it's because I have never learned anything like this before.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pHNkoykzO1Ti4SgN9LtohnbF2A8MHcE8",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mushroom",
            "date": "Jun 11, 2020",
            "title": "",
            "comment_content": "Network Protocols, Network Devices, Ethernet, Network Layers, IP Addressing, Subnetting IPv4, IPv6<br />The content might be a bit complex and abstract at the beginning, but once you understand, it's really easy.",
            "comment_teaching": "Percy reviews at the beginning of each class which helps me better understand. If you want to listen to a quick go through or summary of the slides, you can definitely watch the first few minutes of the video. The powerpoints are clear and Percy often use diagrams to explain (really often), so I suggest you have a pencil and a notebook prepared. <br />Also, TA Tommy is a very nice guy. He records videos every Monday, and so the students can ask questions at Friday lab session (although I never attend, I think this is a good way). TA uses cisco packet tracer and this is important since lab assignments account for 60% this semester and is all about how to use packet tracer.",
            "comment_grading": "Quite good.<br />4 lab assignment (12%*3, 24%*1), 1 final assessment (40%).<br />Don't know the score of the assessment and the last lab assignment, but I eventually get a good grade. When the semester started, Percy wanted us to have a group report, but students complained about it since lots of professors wanted group assignments and presentations. So he changed it to the final assessment. It is like an assignment of all chapters and is more comprehensive. We got 2 weeks to finish it on our own. Percy is surely the kindest professor in ust, he gave us long time to finish the assignments and assessment, and you can ask for postponing the deadline for assignments if you really have a hard time. Anyway, Percy is good.",
            "comment_workload": "The workload is not low since I forget the contents if I don't review them. But is already not that tense compared to other classes. Maybe it's because I have never learned anything like this before.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "N7mjZBa4bzywJn3E3GEvKOvLJGbZzOhE",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "prudencex",
            "date": "Jan 10, 2020",
            "title": "",
            "comment_content": "Exploring the Networking<br />This chapter introduces the platform of data networks upon which our social and business relationships increasingly depend. The material lays the groundwork for exploring the services, technologies, and issues encountered by network professionals as they design, build, and maintain the modern network.<br /><br />Network Protocols and Communications<br />Within this chapter, you will learn about these models, as well as the standards that make networks work, and how communication occurs over a network.<br /><br />Ethernet<br />This chapter examines the characteristics and operation of Ethernet as it has evolved from a shared media, contention-based data communications technology to today's high-bandwidth, full-duplex technology.<br /><br />Transport Layer<br />In this chapter, we examine the role of the transport layer in encapsulating application data for use by the network layer.<br /><br />Network Layer<br />This chapter focuses on the role of the network layer. It examines how it divides networks into groups of hosts groups of hosts to manage the flow of data packets within a network. It also covers how communication between networks is facilitated. This communication between networks is called routing.<br /><br />IP Addressing<br />This chapter examines in detail the structure of IP addresses and their application to the construction and testing of IP networks and subnetworks.<br /><br />Subnetting IP Networks<br />This chapter examines, in detail, the creation and assignment of IP network and subnetwork addresses through the use of the subnet mask.<br /><br />IPv6 Address<br />This chapter examines the needs and application of IPv6, as well as the structure and configuration of the usage.",
            "comment_teaching": "good teaching, explain clearly<br />but the concept is a bit abstract<br />Need to get used to his Indian accent",
            "comment_grading": "Mid-term Exam\t15%<br />Quiz\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;15%&nbsp;&nbsp;(it's MC part in the final exam)<br />Final Exam\t30%&nbsp;&nbsp;(long q part in the final exam)<br />Lab Assignment 1\t9%<br />Lab Assignment 2\t9%<br />Lab Assignment 3\t9%<br />Lab Assignment 4\t13%<br /> <br />Bad grading<br />Since the mid-term &amp; final exam is really easy, so the mean is really high<br />MT mean: 26.8/30<br />no statistics about the final exam<br />almost everyone gets full marks for their assignments<br />difficult to get good grade.",
            "comment_workload": "Light workload.<br />Only 4 assignments<br />need to attend lab to finish the assignments.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GdgKNr9pkB1P6JD6w3mSKAt6xcnrSc73",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sooooo",
            "date": "Aug 20, 2018",
            "title": "Percy is great :)",
            "comment_content": "Basics on how data is transferred in the network. High recommend this course as it gives basic idea on networking and advanced knowledge would be built upon this mindset. Memorizing is still needed, but understanding how the whole process works is more important for the examination. If you do not miss the lectures, it surely won't be a problem as Percy just explained all the things so clearly that revising is not stressful at all.<br /><br />The content are most likely focused on IPv4 and the IPv6 would be some extra things not covered in the finals<br /><br />Syllabus includes:<br />1Exploring the Networking<br />2Network Protocols and Communications<br />3Ethernet<br />-------------------<br />4Transport Layer<br />5Network Layer<br />6IP Addressing<br />7Subnetting IP Networks<br />---------------------<br />Final and quizzes are cumulative by the way",
            "comment_teaching": "Percy is always known to be one of the best lecturer in HKUST, no doubt in that for sure. Not only he is so responsive and take good care of the whole class, he is also very funny in his teaching. I like how he use the story of &quot;his girlfriend&quot; throughout the whole semester in demonstrating how networking works. <br />Besides, Percy would do a 5-10 minutes review with the class every lesson so even though you missed a bit of the lecture, it is not difficult to catch up. And Percy is always ready to answer questions from students and try his best to make sure everyone else (who did not understand the concept but don't know how to put it into a question like me lol) can hear his explanation. Just that he spoke a bit too fast and sometimes you may find difficult to hear all the words when jotting notes. But no need to be worry, Percy will upload the lecture videos for exam preparation.<br />Percy is the best :) highly recommend",
            "comment_grading": "Mid-term Exam\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;16%<br />Quiz\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;16%<br />Final Exam\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;28%<br />(The quiz and final exam take place together during final period)<br />Assignments (4 in total)\t&nbsp;&nbsp;40%<br /><br />Basically, everyone knows how to complete the homework and the mean is very high. The TA said he tried to set the last two homework more difficult to differentiate the grades but I don't know if it works well. But the last two homework is relatively harder. <br /><br />Mid term is easy and so the mean is quite high with all multiple choices. It is certain that getting the highest in the midterm will not necessarily make you getting an &quot;A&quot; for this course. So just don't get relaxed or satisfied so early as the final and quiz is what matters. They are much more difficult than the mid-term and scoring a point less carelessly would affect your grade severely.<br />But overall speaking, Percy gives good grades.<br />I got full mark for all the homeworks,<br />31/32 for mid term<br />and final score unknown (but I guess I got 2-3 MCs wrong)<br />eventually I received an A.",
            "comment_workload": "Not much, just attend the labs everyweek and 4 homework in total<br />Each homework will be given sufficient time to complete (2-3 weeks?)<br /><br />For the exam preparation, it is also quite easy as long as you pay attention in class as Percy helps during the review a lot. No extra materials will be tested",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cWzaIChiKtFEcEOinAiIc7yBwpZCxoLR",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Avocado",
            "date": "Dec 25, 2017",
            "title": "Would recommend this course for IS major students! :)",
            "comment_content": "The course covers topics such as basic networking, Ethernet, and subnetting to name a few. There are six modules in total, three of which are taught before the midterm and three of which are taught after the midterm. The content builds upon previous topics learned, so it's important to understand the fundamentals so that you don't get confused in the later topics. The complexity of the content does increase in the later topics, however it's manageable as long as you go to the lectures and understand what Prof. Dias is talking about.",
            "comment_teaching": "Prof. Dias is super enthusiastic and engaging in his teaching, so it's very interesting to go to lectures and learn. He also makes sure that all the students are following along with what he's teaching, and he makes the lectures very interactive so that students are engaged.",
            "comment_grading": "The grading is relatively decent, and the final grade is composed of:<br /><br />— Midterm Exam (16%)<br />— Assignments (40%)<br />— Quiz &amp; Final Exam (44%)<br /><br />The mean for the assignments and midterm exam is quite high as they are relatively straightforward. The final exam score and statistics were not released, so it's hard to comment on the grading. Just make sure to complete all the assignments and exams to the best of your ability!",
            "comment_workload": "The workload is decent, and the 4 assignments aren't too tough as long as you go to the lab. A lot of the information needed to complete the assignments is taught during the lab, therefore it's useful to go as the mean for the lab assignments is also high.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "R2WYzs02vbJcxOVwF0mjVizIWw2KoEOJ",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "RonYuen",
            "date": "Jan 23, 2021",
            "title": "",
            "comment_content": "Talking about different number system first(binary, decimal and hexadecimal). Then talk about different layers, with a focus on transport layer and data link layer. And finally talk about subnetting.",
            "comment_teaching": "Percy will recap the concepts taught in the past lesson at the beginning of each lesson, therefore it is easy to catch up. Many diagrams are drawn so that the concepts are clearly explained.<br />Labs are clearly demonstrated by TAs so it is not that difficult to understand the concepts in labs.",
            "comment_grading": "Got full mark for the first assignment and do not know the exact mark of the other assignments and final exam. But turns out the final grade is A.",
            "comment_workload": "4 Lab Assignments which can be done within 1 day per each. Acceptable workload. <br />However, the final exam is extremely intense that I had done the final exam for almost 8 hours. (It is a take home exam with 24 hours time limit).",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6pnxhoVo36BDwe6gTmm7gqNr3oItwofm",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "got",
            "date": "Jun 07, 2020",
            "title": "",
            "comment_content": "Module 1 Exploring the Networking<br />Module 2 Networking Protocols and Communication<br />Module 3 Ethernet Part I<br />Module 3 Ethernet Part II<br />Module 4 Transport Layer<br />Module 5 Network Layer and IP addressing<br />Module 6 Subnetting IPv4 Networks<br />Module 7 IPv6 Addressing",
            "comment_teaching": "Percy has been a really nice and helpful professor. He always encourages students to ask him questions and pleasure to answer them in class. He teaches the concepts in details and he explains really well that he wants to make sure everyone understands the materials. He always do a quick review of what he taught last lesson at the beginning of every lesson. He always enjoys the interactions with students.<br /><br />TA Tommy teaches pretty well in lab too. He teaches things in simple and straight-forward way, which is easy to understand. Since we are having online teaching this semester, the labs are pre-recorded and you can watch the lab videos in a flexible way. Tommy will upload the lab videos a few days before the lab lesson. You do not need to go to lab as scheduled.",
            "comment_grading": "lab assignment 1 12%<br />lab assignment 2 12%<br />lab assignment 3 12%<br />lab assignment 4 24%<br />Final project 40%",
            "comment_workload": "The workload is quite easy. <br />There are only 4 lab assignments and one final project. The lab assignments are quite easy. So, the mean is quite high. <br />The final project is an individual project. Percy gave us around two weeks to finish it around exam period. If you have paid attention in class and read through the materials, you should be able to do it. It is not very difficult.<br />Attendance is not required and you can always watch the lectures and labs recordings online.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mu443pN7apVndA1goWyxFh4yebQc33pv",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 370,
                    "name": "DIAS, Garvin Percy",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Luweegee",
            "date": "Jan 03, 2021",
            "title": "Excellent Teaching, Non-transparent Grading",
            "comment_content": "This course teaches the basics of networking and how devices communicate with each other. The content is quite interesting and it teaches 20~30% of Cisco CCNA exam's syllabus.<br /><br />1️⃣ Exploring the Networking<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔸 Introduction, basic terminologies<br />2️⃣ Networking Protocols &amp; Communication<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔸 OSI Model, encapsulation<br />3️⃣ Ethernet<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔸 Physical topology, repeaters, hubs<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔸 Switches, routers, data collision<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔸 Collision domain &amp; broadcast domain<br />4️⃣ Transport Layer<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔸 TCP vs UDP protocol<br />5️⃣ Network Layer &amp; IP Addressing (IPv4)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔸 Address classes, public &amp; private IP<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔸 DHCP, DNS, ARP<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔸 Routing protocols (RIP)<br />6️⃣ Subnetting IPv4 Networks<br />7️⃣ (Not tested) IPv6<br /><br />The lectures will teach the concepts behind networking while the labs will teach you how to use command line to set-up Cisco switches and routers. The labs also teaches you how to use &quot;Cisco Packet Tracer&quot;, which is a simulator that lets you build your own networks.<br /><br />Overall, I highly recommend taking this course if you want to learn more about networking 😄",
            "comment_teaching": "🔷 Professor<br />Percy is an excellent lecturer! He can explain abstract concepts very clearly by drawing lots of diagrams and making metaphors. He always invites students to answer questions and there's a lot of interaction in the lesson. He also makes sure that everyone is on the same pace and even shared his WhatsApp and WeChat number for us to ask questions. However, his Indian accent is a bit thick but you can get used to it after several lessons 😃<br /><br />🔷 Labs &amp; TAs<br />All the labs are pre-recorded and the lab time on the timetable is solely for Q&amp;A. Tommy is a kind TA but his Hong Kong accent is super thick and I need to watch his lab videos on 2x speed.",
            "comment_grading": "Grading is non-transparent since the TAs only released 1 score out of 5 items. It's also competitive since almost everyone got full marks. Careless mistakes could cost you a subgrade.<br /><br />ONLINE semester grading scheme:<br />📃 Lab Assignment 1 - 15%<br />📃 Lab Assignment 2 - 15%<br />📃 Lab Assignment 3 - 15%<br />📃 Lab Assignment 4 - 20%<br />📃 Take-home Final (24hr) - 35%<br /><br />I only know that I got full marks in lab assignment 1 (mean: 13.9/15) and the remaining scores are unreleased. I got an A at the end but I don't know why 🤣",
            "comment_workload": "TLDR: Light workload in general. Lab assignments are sometimes time-consuming and the take home final exam would occupy your entire day.<br /><br />📝 Lab Assignments<br />There are 4 assignments that tests the lab materials in total and each takes 2~5 hours to complete. If you're double-checking your answers in Cisco Packet Tracer, one assignment could take up to 8 hours. The first assignment's deadline is at midterm period and the rest is at the end of semester.<br /><br />📝 Take-home Final <br />Due to COVID-19, there's no mid-term and the final exam is a take-home assessment to be submitted within 24 hours of its release. The exam questions are complicated and it occupies you the entire day.<br />(Fun fact: I wrote roughly 3000 words in Word file for the exam. I didn't purposely make my answer verbose though 😈😈)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}