{
    "error": false,
    "course": {
        "id": 686,
        "subject": "ISOM",
        "code": "3360",
        "name": "Data Mining for Business Analytics",
        "description": "This course covers the fundamental concepts, technologies, and applications of business analytics to help firms gain a competitive advantage in the era of Big Data.  Topics include text mining, predictive analytics, search engine strategy, social network analysis, cloud computing, etc. Students will gain hands-on experience with popular data analytical tools.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1840,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"ISOM\" data-code=\"2020\" href=\"/review/ISOM2020\" target=\"_blank\">ISOM 2020</a> OR <a class=\"course-link\" data-subject=\"COMP\" data-code=\"1021\" href=\"/review/COMP1021\" target=\"_blank\">COMP 1021</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"4331\" href=\"/review/COMP4331\" target=\"_blank\">COMP 4331</a>, <a class=\"course-link\" data-subject=\"IEDA\" data-code=\"3560\" href=\"/review/IEDA3560\" target=\"_blank\">IEDA 3560</a>",
        "rating_content": 4.46,
        "rating_teaching": 4.25,
        "rating_grading": 4.18,
        "rating_workload": 3.96,
        "review_count": 28,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 378,
                "name": "ZHENG, Rong",
                "count": 12
            },
            {
                "id": 802,
                "name": "GU, Jiaying",
                "count": 11
            },
            {
                "id": 1153,
                "name": "YANG, Yi",
                "count": 5
            },
            {
                "id": 367,
                "name": "WANG, Jing",
                "count": 3
            },
            {
                "id": 373,
                "name": "JIA, Jia",
                "count": 3
            },
            {
                "id": 1313,
                "name": "ZHENG, Jiexin Jason",
                "count": 2
            },
            {
                "id": 838,
                "name": "FENG, Yue",
                "count": 1
            },
            {
                "id": 949,
                "name": "LAI, Sum Yu",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "iJmPs9qbF0ZoU4IVn72VudR4vb0UOWDY",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                },
                {
                    "id": 802,
                    "name": "GU, Jiaying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cathleen",
            "date": "Dec 31, 2019",
            "title": "Who the hell said this is a good grade course?",
            "comment_content": "Basic data mining content.<br />As the situation is different this year, the uni was closed, less content is covered.<br />This course covers the fundamental concepts, technologies, and applications of business analytics to help firms gain a competitive advantage in the era of Big Data. Topics include text mining, predictive analytics, search engine strategy, social network analysis, cloud computing, etc. Students will gain hands-on experience with popular data analytical tools.",
            "comment_teaching": "9am classes And boring,<br />Basically no one would answer to his questions,<br />Dead atmosphere.",
            "comment_grading": "Final is cancelled, making the scores too close.<br />So fked up.",
            "comment_workload": "Good luck if your team is good.<br />The project is time consuming.<br />Lab every week.<br />9am lectures.<br />Assignments.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 8,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "V8KHrZNNlZMefMwj1pPaDu2oCVH3Mbuq",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "aaronic92351",
            "date": "Jan 01, 2022",
            "title": "Good Course for Data Science and Machine Learning",
            "comment_content": "Content taught is actually useful, highly recommended if you want to learn basic concepts on data mining.<br /><br />Topics covered:<br />- Data Basics &amp; Preparation<br />- Decision Tree<br />- Model Selection &amp; Evaluation<br />- Linear Regression<br />- Logistic Regression<br />- Naïve Bayes<br />- Text Mining<br />- Feature Selection<br />- Association Rule<br />- Clustering<br />- KNN<br />- Recommender Systems<br />- Ensemble Learning<br />- Network Analytics<br />- Neural Network &amp; Deep Learning (not tested in exam)<br /><br />As you can see, lots of topics were covered in a limited time, contents covered were not in-depth enough and you have to dig deeper yourself if you want further understanding.",
            "comment_teaching": "Rong is a knowledgeable professor and can see he is really passionate in data mining stuff. However, he teaches too slow in the first half of the semester and pushed quite a lot of content after the midterm exam. <br />He also didn't quite manage the lecture time well and usually started to rush through the content near the end of the lecture.<br />He did put out some jokes and real-life examples to explain the contents in a more interesting way, so his teaching is still fine.<br /><br />TA Sophie was responsible for all lab sessions. She usually review a bit on the lecture contents at the first, then goes into the python stuff for that topic. She usually reserve 10 min before end of lab for us to submit the in-class exercise. A day was also given for each lab quiz.",
            "comment_grading": "Grade breakdown is as follows:<br />In-class quizzes: 15%<br />Lab participation: 10%<br />Assignments: 25%<br />Midterm: 25%<br />Final Exam: 25%<br /><br />In-class quizzes: Full marks (after excluding lowest two)<br />Lab: Full marks<br />Assignment 1: 77/100<br />Assignment 2: 95/100<br />Assignment 3: 90/100<br />Assignment 4: 90/100<br />Midterm: 93/100 (mean: 81.3, sd: 14.4)<br />Final: not released, but I did not perform well...<br /><br />Grade: B+<br />Fair enough, it's normal IS course grading, did learnt a lot in this course.",
            "comment_workload": "Depends on how you view it, I think it's fine while other may not, since there were consistent workload during the semester.<br /><br />For in-class quiz and lab, make sure you attend the lectures and labs and pay attention in class, then you should be fine.<br /><br />For assignments, they were quite demanding, so make sure you start early and find groupmates that knows programming to separate the workload. Refer to lab materials to get started.<br /><br />For exams, review the materials beforehand and try out the exercises in the lecture ppt to ensure you understand the contents well. The real exam paper will be more difficult.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hYHLoBJCt3Hk48ZmjsdU2mAsXAl0FwVK",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Benedictho",
            "date": "Jul 14, 2017",
            "title": "",
            "comment_content": "The contents learnt in the courses is not too hard. You do not need to have any prior knowledge to help you understand the concepts.",
            "comment_teaching": "The professor will only teach base on the PowerPoint. Therefore, it may be quite boring to study his lectures. For me, I do not attend much of his lectures, but turn out I get a good grade by just study hard of his notes",
            "comment_grading": "In the mid-term exam or exam, if you go through all the notes that the professor gives out and study them hard before the exam, you can probably answer all the short or long questions. For multiple choice questions, they are quite tricky sometimes, so if you do not understand some basics concept in the course, you must ask them clearly, so you can answer multiple choice questions.",
            "comment_workload": "The course have 3 assignments. The assignment are quite easy. Only some sub-questions would be challenging and require you to think about it thoroughly. For the exam, it is not too hard. The only things you need to do is to go through all the notes and make sure you understand the basic concepts.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vDGw4XmiYqwrBhO7jfKkv2BgBTvI7QnB",
            "semester": "2021-22 Summer",
            "instructors": [
                {
                    "id": 1313,
                    "name": "ZHENG, Jiexin Jason",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "vivivi",
            "date": "Sep 10, 2022",
            "title": "A very nice instructor",
            "comment_content": "As shown in the attached syllabus, normal stuff in data mining. Jason itself makes the content more useful.",
            "comment_teaching": "Jason is definitely the best instructor I have ever met in HKUST although this is the first course he has ever taught and he is only a PhD student studying IS. He explains everything clearly and often gives insights into how the contents can be applicable to real-life contexts and may sometimes introduce how the application is used in his own company (yes, he is also an entrepreneur). You can feel he does know the topic very well and could answer every question that students raised. He is so helpful that he always asks students to send him emails when we have any questions and he does replies very fast during working hours (like replying within 15 mins, do appreciate that). <br /><br />Enough the appreciation above, his teaching of course does have some flaws. I think the biggest problem would be the pronunciation thing. This does not happen very often, but he sometimes pronounces a few words wrong (not because of his accent) and we may not know what he is talking about. Also, for the lab parts, sometimes Jason goes through the codes so fast that we can't really follow them. I think that is because he already typed all the code before the labs and he simply scroll through and highlight the codes and said, &quot;we have this line of code, so we have this result.&quot;, but I don't really understand what parameters do I need in the code (maybe that's because I didn't take ISOM3400 before taking this course?!). I think it would be better if Jason types the code with us in the lab so that we can type and follow will help us to understand the codes better.<br /><br />After all, although there are some flaws regarding pronunciations and labs, the good things outweigh the flaws and make him a very very good and thoughtful instructor.",
            "comment_grading": "Since the marks given in project are quite lenient, I guess everyone gets similar marks. It makes me 9x% still get a B+. I did expect a bit higher grade... I guess assignments matter most in differentiating the grades.",
            "comment_workload": "3 assignments in total and 1 group project. I think it is manageable(especially it is Summer sem, it's kind of free in Summer). <br /><br />There are 2 parts in every assignment.&nbsp;&nbsp;One part consists of about 5 MCs and 2 LQs. which is quite easy to complete as long as you are familiar with the concepts. Another part of the assignment is related to the lab (which is coding). We need to finish the task by Python coding. I think this is quite challenging for me, since I need to spend so much time in debugging and reviewing the lab(since I cannot really understand the coding in lab sessions as mentioned in the teaching part).<br /><br />For the group project, we are required to solve a business problem using data mining. We need to build a few data mining models and integrate and implement the results.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "7Jj9LJHiqi8AEUX6WQh1EEGWFp7zVdCJ",
                    "name": "ISOM3360 Syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "ltCEZKfDk1iSb8HrRLSEVH2lsx3ETWqm",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1153,
                    "name": "YANG, Yi",
                    "rating": 1
                },
                {
                    "id": 802,
                    "name": "GU, Jiaying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "pepi0922",
            "date": "Jun 13, 2022",
            "title": "Prof.Yang means a GOOD GRADE!",
            "comment_content": "Please see the attached syllabus :)",
            "comment_teaching": "Prof.Yang is a professional data miner and he can explain the content in an organized and clear way. He usually finishes the class 10~20 mins earlier. He does know how to control the pace of the lecture! <br /><br />There are also some interative discussions in the class, which may not be tested in the exams, but is helpful to develop your data driven thinking!<br /><br />There are participation scores in the grading scheme. I strongly recommend you to attend lectures and give active responds. I think there are smart people who will work out the answer very quickly! just copy and paste their responds to get the participation mark (everyone will do that lol). Also, don't be shy. It's ok to give a wrong answer. Prof. Yang is really a mild person and he will give corrections and clearly explain why your answer is wrong.<br /><br />He has a high tone so it's easy for you to be concentrated on what he's talking (although he has a slight accent but it's totally understandable)",
            "comment_grading": "Lab 5% <br />Class Attendance/Participation 10% <br />Homework Assignments (2) 15% <br />Group Project 20% <br />Midterm Exam 20% <br />Final Exam 30% <br /><br />lab-<br />individual, most are MCQ. For each quiz you are given 2 attempts. Grab the chance and try to get full marks in every quiz (since the mean is always close to full score)<br /><br />me: not get full score in every quiz. actually i missed one quiz and get 4(out of 5) in several quizzes. So my performance in this part would just be average (or even lower than)<br /><br />class participation-<br />they didn't release anything about it. But i attend almost all the real-time lectures and respond (by typing in the textbox) frequently. <br /><br />Homework Assignments *2 -<br />individual. some needs hand writing, just conceptual problems taught in the class. There are also coding tasks. The workload might be a little big because it's the first time for me to conduct a complete project (the 'Titanic' case in Assighment 1) by myself. But the grades of the coding tasks only depends on your efforts and logic (instead of accuracy) so just be relaxed. everyone can get nearly full scores in all assignments!<br />me: full score in all assignments except for one 90/100.<br /><br />Group Project-<br />They didn't release the score of group project. <br />tip: try to communicate with the prof and TA as much as possible! try to get feedback/advice from them (there will be 2 advising sessions). Knowing what they are expecting from you will contribute a lot to your work.<br /><br />Midterm-<br />I didn't do well in the midterm. The mean is 14.7/20, and I got 15.4. Only slightly higher than the mean.<br /><br />Final-<br />They didn't release the scores of final. The format is quite similar to midterm. MCQ, short answer questions (explanation, calculation). The time will be tight. Remember to manage the time!<br /><br />My final grade: A<br />As you can see, I only get mean in lab quiz, assignment and midterm. Although the score of group project and final are not released, 'A' is definitely out of my expectation!!! I would expect B or B+(if better). But eventually I got A! Really amazing!! Thanks Prof. Yang ❤<br /><br />I'm a person who seldom write reviews in USTSPACE. But this time I seriously write a review for ISOM3360. Just want everyone to know how kind Prof. Yang is. Don't hesitate!",
            "comment_workload": "Although Prof.Yang gives amazing teaching and good grades, I would say this course has a heavy workload.<br />There are usually three hand-written problems in assignments and one coding task. For the first hands-on coding task, it took me a whole week! There are also weekly quizzes after the lab. The deadline is one day later at 23:59. It's really common to forget the deadline... I missed one. Luckily, the lab only takes up 5% in the grading scheme.<br />The most difficult part would be the group project. You need a large dataset. A complete data mining solutions from nothing! There will be no templates (like in ISOM 2600). You need to write every line of codes by yourself. It's important to team up with good guys... or it will kill you!<br />You also need to submit a report. Try to think of a concrete problem from your dataset. And utilizing data mining skillls taught in lab as many as possible.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "uGsqHbRSIeiw7i3lpO1cD3C1ZsLYFX58",
                    "name": "ISOM3360-2022-L1-L2-Syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "KykywlYMSHbgo4rVcg7olczL8bg0Udcf",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "皇帝企鵝",
            "date": "Jul 23, 2020",
            "title": "",
            "comment_content": "content唔多講，有少少probability machine learning,要計數但concept野都好多",
            "comment_teaching": "professor幾好人，好肯解答同學問題，又唔會點overrun，系口音的確有d難聽，但已經好過好多professor",
            "comment_grading": "我覺得麻麻，online sem多cheat加上本身出得太易，一大意就跌一個sd",
            "comment_workload": "有個python project要你做business related 議題同分析比意見<br />加上有幾份功課咁，系lab有d難做",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Gp7SByuCPV6a4vbxa2PQolQvZv5ZXTvZ",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1153,
                    "name": "YANG, Yi",
                    "rating": 1
                },
                {
                    "id": 802,
                    "name": "GU, Jiaying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ANormalPerson",
            "date": "May 27, 2020",
            "title": "Take this if you are interested in Data Science, AI and Machine Learning",
            "comment_content": "Introduction to different machine learning models and the logic behind them, and also some emphasis on their business practicalities.<br /><br />Syllabus:<br />1. Data Mining Basics<br />2. Decision Tree Learning<br />3. Model Evaluation<br />4. Identifying Good Problems for Machine Learning<br />5. Linear Regression<br />6. Logistic Regression<br />7. Navies Bayes Classifier<br />8. Association Rule Learning<br />9. k-Means Clustering<br />10. k Nearest Neighbours<br />11. Recommendation Systems<br />12. Ensemble Learning<br />13. Neural Networks and Deep Learning<br />14. Data Mining Ethics (skipped)<br /><br />I love data science so these topics are very enjoyable for me. However, I can easily guess that it would be a nightmare for someone who is not interested in algorithms and how do we extract insights from data. So weigh before you register.",
            "comment_teaching": "Prof Yang is the best teacher for all the logic-oriented courses that I have taken. He explains everything very clearly and has the patience to answer even the most basic questions raised in class. He is very knowledgable in this field. I emailed him several times and he replied within hours if not minutes.<br /><br />And unlike most of other mainland Chinese profs, he can deliver clearly in English. Talking speed may be slightly slow for me but I think it helped in clarity, and replaying online lectures can be in 1.5x speed anyway.<br /><br />The TA Sophie is also knowledge in the field and walks through codes pretty clearly. The downside could be she did not explain basic Python scripts so not everyone grasps what is actually going on, as COMP1021 or ISOM3400 are not prerequisites to this course.",
            "comment_grading": "Haven't graded yet, but he said it will be absolutely graded.",
            "comment_workload": "Very handlable. Two very handlable assignments if you attend the lab sessions and have some Python knowledge beforehand. One more group project but from 0 to 100 it can be in less than a week. You would need to submit an ipynb (basically codes) file and a 10-page report, which is really not that much considering the four team members and the rich content you can write based on your findings.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7Hjz5XroJtC9VjSowS9TVZcCp1HOajdx",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                },
                {
                    "id": 802,
                    "name": "GU, Jiaying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chickenhkust",
            "date": "Feb 03, 2023",
            "title": "Insightful and Helpful Course taught by Knowledgeable Professor and TA",
            "comment_content": "Please refer to other comments for the course content. <br />One thing that I would like to emphasize here is that this course does not involve real-life coding. <br />The primary focus of this course is on enabling the students to excel in technical communication. <br />Hence, even though the demonstration of machine learning models are shown during the Lab sessions, those will not be tested. <br />Since most business school students might need to equip themselves with technical communication skills, this course is extremely helpful in grasping those up-to-date data mining and machine learning contents in the context of business.",
            "comment_teaching": "Professor Rong was always passionate about teaching throughout the whole semester. <br />Whenever you have a question regarding the course content, you can simply reach out to him via email and can make an office appointment beforehand. <br />However, you can't simply rely on the slides provided, which means you're highly recommended to either attend the class real time (there are ad-hoc in-class quizzes as well) or review the lecture videos. <br />Taking note in this class is not really challenging as our Professor emphasizes the things that will appear on the exam quite explicitly.",
            "comment_grading": "I find grading just adequate, which means if you put effort in it, you should be able to get the corresponding grade. <br />As mentioned above, the course content is not extremely difficult, while those guys in RMBI takes this course as a major requirement. <br />Hence, the competition for A-range score can be harsh I might say. <br />For the Midterm, the mean score was around 80, and the Final exam score was not released. <br />However, you should try your best in assignments as well and it may involve some coding.",
            "comment_workload": "Workload is just appropriate and I have nothing much to say about it. <br />There is not attendance score; however, there can be some ad-hoc in-class quizzes. Therefore, it is better for your to be present in the class on time.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5PSjJo31UHZ05WU2KSR50rdIfTTGWEXX",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                },
                {
                    "id": 802,
                    "name": "GU, Jiaying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wzhaoai",
            "date": "Jan 28, 2023",
            "title": "",
            "comment_content": "Data Mining Basics<br />Data Understanding and Preparation<br />Decision Tree<br />Model Evaluation<br />Linear Regression<br />Logistic Regression<br />Naive Bayes<br />Text Mining<br />Feature Selection <br />Association Rule <br />Clustering<br />KNN<br />Recommender system<br />Ensemble Learning<br />Neural Network and Deep Learning<br />Networked data analytics",
            "comment_teaching": "非常有魅力的男性教授，说话很有腔调，没什么口音，但是语气比较平缓，有可能犯困。课件与讲解都很详细。可能本人对BA以及Data Mining比较感兴趣所以很喜欢这门课。可见会有需要上课听讲填空的地方。每节课都会有video上传到canvas上，所以有哪里没听懂或者没去上课也不要紧。教授在最后一课还讲解了一些关于Data mining的职业规划，人很好。",
            "comment_grading": "In-class quizzes:10%<br />• In every lecture. Two quizzes with the lowest score will be ignored.<br />•Lab participation: 10% <br />•2 Individual assignments: 10%<br />•2 group assignments: 15%<br />• Groups of 2-3 students<br />•Midterm quiz: 25% <br />• Closed book<br />•Final Exam: 30% <br />• Closed book<br />比较合理，过mean拿B",
            "comment_workload": "12个in-class quizzes<br />两个 Individual assignments<br />两个group assignments<br />不算很大",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "D7VFbC9CqSIc6dRhwqm5JakVTDUs1Ihy",
            "semester": "2021-22 Summer",
            "instructors": [
                {
                    "id": 1313,
                    "name": "ZHENG, Jiexin Jason",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "skmt_kn14",
            "date": "Oct 19, 2022",
            "title": "",
            "comment_content": "1. Data Preparation<br />2. Decision Tree<br />3. Model Evaluation<br />4. Linear Regression<br />5. Logistic Regression<br />6. Naive Bayes <br />7. Association Rule<br />8. Clustering<br />9. Nearest Neighbor<br />10. Recommender Systems<br />11.&nbsp;&nbsp;Ensemble Learning<br />12. Network Analysis<br />13. Text Mining<br />14. Neural Network &amp; Deep Learning<br />15. Latest Development in AI<br /><br />python coding: pandas, matplotlib, numpy, sklearn",
            "comment_teaching": "I will say Jason is the best instructor I have ever met in UST. It's unavoidable that some key concepts can't be included or mentioned in lectures due to time constraints, but he is willing to answer any questions about the course content or coding part with details and patience. He can always reply your email within 20 minutes and this really impresses me.&nbsp;&nbsp;<br /><br />The only room for improvement is the lab section. After lab 4, there are no PPTs to further explain the coding part, but the lab section is quite rushed. Since most are year 2 students and some may not understand well on coding.",
            "comment_grading": "3 assignments (55%)<br />Group Project (20%)<br />Presentation (10%)<br />Class Participation (10%)<br />Lab Attendance (5%)<br /><br />Assignment 1&nbsp;&nbsp;&nbsp;(mean 12.6/15)<br />Assignment 2&nbsp;&nbsp;&nbsp;(mean 16/20)<br />Assignment 3&nbsp;&nbsp;&nbsp;(mean 16/20)<br /><br />The grade mainly depends on the assignments. Other parts won't affect the grade a lot. Project and presentation were graded within 2 days.<br /><br />A+",
            "comment_workload": "Very light workloads compared to Fall/Spring semester. Quite a lot of contents for a summer course, but there are no midterm &amp; final exams. That's the main reason for me to take this course in summer. <br /> <br />If you have taken ISOM 3400 or have sufficient Python programming experience, then it's not difficult for you to finish coding part. The labs have already provided most sample codes. It's easy to search by google to get some clues or simply ask the instructor if facing any difficulties in coding. I believe 2 days are enough for each assignment in average.<br /><br />It's better to start earlier for the group project. Our group spent around 10 days to finish the report &amp; coding. Most students use supervised learning models (e.g. DT, LR, log reg, etc.) for the project, so not all the labs coding will be used. 20 mins&amp; 5 mins Q&amp;A section for presentation, but you don't even need to open camera in zoom.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yBw5owAwAbhNk4QxUdi9Nur91USKTqpo",
            "semester": "2020-21 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Learn",
            "date": "Jun 27, 2021",
            "title": "",
            "comment_content": "In general, the course materials do not deviate a lot with what have been mentioned in other reviews. To me, the content is interesting and can kinda be applied into out daily life, which is really great. <br /><br />ML and data analystics are reallys something you can acquire here. <br /><br />Primarily, you gonna receive class slides for your study. <br /><br />1. Data visualisation in Excel<br />2. RapidMiner and Microsoft Azure introduction<br />3. Decision tree<br />4. Decision tree and Cross Validation<br />5. Linear Regression and Logistic Regression<br />6. Cost-sensitive learning<br />7. Naive Bayes<br />8. Text Mining<br />9. Association Rule &amp; Clustering<br />10. KNN &amp; Collaborative Filtering<br />11. Sentiment Annalysis",
            "comment_teaching": "Dr Yang's teaching is really great. He is very passionate and everything are well-prepared. Also, he always welcomes students to ask him any quetions, and that he usually get back to us shortly.",
            "comment_grading": "To me, the grading is fair. <br /><br />As long as you understnad the basic concepts, then you'll be doing good. <br /><br />Eventually, I got B+.",
            "comment_workload": "The workload isn't big at all. <br /><br />There are both homework and lab. Also, there is a group project where you really need to put effort in it given it's weighting in your overall grade.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ggmajg01cVBXWhiDHQubs2mwuPGe7NHP",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Zori",
            "date": "Feb 01, 2021",
            "title": "Great course for business analytics intro",
            "comment_content": "The content is perfect for people who want to have a taste of what business analytics would look like.<br />Key topic includes Supervised Learning methods such as Decision tree, Naive Bayern's; Unsupervised Learning such as clustering, recommendation algorithms; A little bit taste of ensemble learning and neural network.<br />The concepts can be a really good start for students who want to further pursue data analysis job in the future. An adequate extension of the content taught in this course can be sufficient for DA interview for UG level.",
            "comment_teaching": "The prof is very friendly and supportive. <br />The note is really clear as well. If you are interested in this topic, you would enjoy it.",
            "comment_grading": "The grading is generous for this prof.<br />Grading scheme includes labs, group project, MT and Final. If you understand the basic concept and do the lab well, a grade above B+ should be sufficient.<br />I got A- for 0.5 std above mean on average.",
            "comment_workload": "The workload is appropriate for a 3 credit course.<br />One hour regular lab, a group project taking around 8 hours to finish for every individual, and the midterm and final do not test really in-depth for the content. Basic understanding of the concept should be enough for this course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PCsiF7x2TOKwdGVPis9GJAC2NJ025018",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Claudia",
            "date": "Apr 10, 2019",
            "title": "",
            "comment_content": "Lectures:<br />Teach a lot of concepts and formulas<br /><br />Lab:<br />Teach you how to use different data mining softwares but it won't appear in exams<br /><br />1. Data visualisation in Excel<br />2. RapidMiner and Microsoft Azure introduction<br />3. Decision tree<br />4. Decision tree and Cross Validation<br />5. Linear Regression and Logistic Regression<br />6. Cost-sensitive learning<br />7. Naive Bayes<br />8. Text Mining<br />9. Association Rule &amp; Clustering<br />10. KNN &amp; Collaborative Filtering<br />11. Sentiment Annalysis",
            "comment_teaching": "Just read out ppts and teach concepts and how to use those formulas.",
            "comment_grading": "If you have study enough then the grading should be not too bad as exam just test you how to use those formulas to calculate the answers, seldom occurs concepts based word questions (maybe 1 or 2).",
            "comment_workload": "Have 3 homeworks but is not hard to complete.<br /><br />Midterm and Final only, don't have group project.<br /><br />workload is fine",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "e4XNLwIJ9iVcWIbP2fmdDJC28Hk16f6F",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 373,
                    "name": "JIA, Jia",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Cindy_He",
            "date": "Aug 23, 2018",
            "title": "",
            "comment_content": "Contents is good. Lots of concept. Few implementation though. might not seem that practical because you know the concepts but you don't know how to use it. its ridiculous and the instructor himself lots of times don t know what he is talking about. If you have other choices, just don't come to this course.",
            "comment_teaching": "Instructor is like a non-English speaker. All the concepts are easy but his language makes it more complicated... I will definitely avoid any courses that is taught by him in the future.",
            "comment_grading": "Largely depending on the final. Tricky questions.",
            "comment_workload": "Only homework. not too much",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5YryaVbULHp0SZFUpwBUE3oRwbxspLRk",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 1153,
                    "name": "YANG, Yi",
                    "rating": 1
                },
                {
                    "id": 802,
                    "name": "GU, Jiaying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "V.lylit",
            "date": "May 29, 2018",
            "title": "",
            "comment_content": "Not much I want to comment here, please look at Avocado's review - we were in the same class. In general, I do feel that this course is a good balance of quantitative and qualitative content for introducing you to data mining. (And if you're expecting to learn lots of programming and etc, this is not the place for you.)",
            "comment_teaching": "There is not much discrepancy in how capable they two teach even if it's Prof. Yang's first semester at HKUST - I mean, both of them delivered their materials very clearly and with relevant examples for application.<br /><br />A short tip: go to Sophie for Azure-related matters cuz she's the expert, go to Prof. Yang otherwise... I mean sure you can go to him for Azure stuff but you'll end up seeing him trying even harder than you to know how to work the system. If this dedication is what you want from a prof, you have it. He'll make sure he has solved (or at least is on the direction to solving) your problem before you leave.",
            "comment_grading": "Please refer to Avocado's review for the distribution.<br /><br />I got full score for all the labs and all (but 1 part, forgot which) of the assignments. Got 90.5/100 in the midterm where the average was 85 or so... Not sure what I got in the finals or the project because the stats were not released, but I eventually got an A.<br /><br />I suspect that the project and finals do help put people into different grades because most students would get similar results in other things, such as assignments and labs.<br /><br />I'll also give you simple tips to get good grades with YY:<br />1. attend all the labs and submit the worksheet after the lab (Sophie gives most of the answers!)<br />2. attend the midterm and final review sessions because there might be some lectures or parts of it that is not included in the exam, but you won't know it if you don't go... and waste your time studying<br />3. please don't give yourself such a hard time by making up an impossible challenge for the project - this obviously also affects the workload you will get!<br />4. if you're going to do a predictive task for the project, you may also want to interpret the prediction results (as in, what does the root node of the decision tree tell you?)",
            "comment_workload": "Generally light workload, but it will kind of bug you when you realise that each assignment actually has 4 or so parts. <br /><br />Otherwise, the lectures are not tough to revise with as long as you go to classes (yes that makes a difference), and as long as you're not giving yourself a postgrad-level task for the group project, you should be fine; the project is effort-based but you don't need to blindly attempt everything! You do need to justify why you end up trying a certain model/ transformation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vYTlqIaXqsbtmQfO1w9yJ82hO43zcpl8",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 1153,
                    "name": "YANG, Yi",
                    "rating": 1
                },
                {
                    "id": 802,
                    "name": "GU, Jiaying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Avocado",
            "date": "May 29, 2018",
            "title": "An interesting introductory course to data analytics!",
            "comment_content": "As this is an introductory course to data mining and business analytics, the course content is relatively straightforward and provides an insight into the various mining techniques.<br /><br />Key topics include data preparation, decision trees, linear regression, logistic regression, probabilistic classifiers, clustering, k-nearest neighbours, ensemble learning and network analysis. <br /><br />Even if you are a beginner to data mining, I would say that the topics are appropriately chosen and easy enough to grasp if you spend time studying carefully. Remembering concepts from ISOM 2500 (e.g. regression, confusion matrices etc.) would be helpful, but the content is definitely manageable.",
            "comment_teaching": "This is Prof. Yang's first semester teaching at UST, and I found his teaching style to be good! He explained all the content clearly and spent time on illustrating concepts with mathematical examples to consolidate our understanding. He's also very helpful when you approach him after/outside of class with questions!",
            "comment_grading": "The grading scheme is as follows:<br /><br />— Lab Participation (7%)<br />— Homework Assignments (18%)<br />— Group Project (20%)<br />— Midterm Exam (25%)<br />— Final Exam (30%)<br /><br />I believe this is the first semester where a group project has been included in the course (which I'll elaborate on further in the workload section).<br /><br />I would say the grading is quite fair. Both the midterm and final exam include multiple-choice questions as well as short questions (descriptive and calculation), and the mean for the midterm exam was 85/100 with an SD Of 8 or so. The final exam statistics were not released, therefore I can't comment on it. <br /><br />There are two homework assignments which consist of 3-4 short questions, and the mean for these tends to be pretty high (e.g. mean of 1.95/2 for most questions).",
            "comment_workload": "I would say that this course has a relatively light workload. The homework assignments are quite straightforward (apart from the Microsoft Azure-related questions, which just take AAAGES to run sometimes). <br /><br />The project is a new component of the course, and you have to find a business problem and use data mining techniques to build a model to achieve the data mining objective. As long as you find good groupmates and cross your fingers that Azure runs quickly, the project shouldn't take too much time!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Cer5t4Myl1hC7EhUW30GZoCqLiYCxobE",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Paul Wong",
            "date": "Jan 11, 2018",
            "title": "",
            "comment_content": "This course is about data mining, teaching you how to find useful information from raw data. <br />you will learn to use RapidMiner and Microsoft Azure.",
            "comment_teaching": "The slides are clear. However, sometimes the instructor cannot explain the concept very well. Student might get struggle.",
            "comment_grading": "The final exam score was not released.<br />The grading is normal.<br /><br />The grade breakdown is as follows:<br />1. Lab participation: 10%<br />2. Homework (3): 30%<br />3. Midterm quiz: 30%<br />4. Final exam: 30%",
            "comment_workload": "You need to attend the lab for the participation. The lecture do not take attendance.<br /><br />The most of the assignments require the use of RapidMiner and Microsoft Azure.<br /><br />The workload is normal.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BOhgfkZa8pdQfvIOMUYLH9doJsjIWEtf",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mkliaa",
            "date": "Dec 31, 2017",
            "title": "ISOM3360 2017-18 Fall",
            "comment_content": "Learnt the use of RapidMiner and Microsoft Azure. Some lectures talk about the concepts.",
            "comment_teaching": "The slides are clear. But he could not explain the content well. The classmates always cannoy get what he means and the whole class always stuggle for a minor point for the whole class.",
            "comment_grading": "I got below mean in mid term and final exam score was not released. But I think I am below mean again. But I still got B- in the end.",
            "comment_workload": "Need to attend lab every week for a 3 credit course and finish 3 assignments. But he did not take attendance.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rllocIYhW81rsQya7j3Wi8kbznFlBGd6",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 838,
                    "name": "FENG, Yue",
                    "rating": 1
                },
                {
                    "id": 802,
                    "name": "GU, Jiaying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "makmakmakmak",
            "date": "Jan 19, 2017",
            "title": "",
            "comment_content": "This course mainly focus on understanding the business application of data mining techniques, and give u a brief idea on the various techniques.<br />Most of the time, you will use the software called Weka to do data mining. It is not too complicated as long as you pay attention in class and read the suggested textbook.",
            "comment_teaching": "Well to be honest, I think her teaching is boring and sometimes hard to understand. And by purely looking at the ppt notes, you might not know what it is talking about, so you are highly encourage to attend the lesson and listen and ask questions after class. Lab sessions are easy, the TA teaches quite well and she will give out the answer at the end of each session. Labs are mainly teaching you how to use Weka and cover a small part on Microsoft Azure.",
            "comment_grading": "1. Lab participation: 10%<br />2. Homework (3): 30%<br />3. Midterm quiz: 30%<br />4. Final exam: 30%<br /><br />For both Midterm and Finals, there are 3 parts:<br />True/False<br />MC Questions<br />Long questions<br />For the long questions, they require certain degree of understanding and Final has a lot of the long questions that you need to write out the whole mining process. Midterm is very easy therefore if you score high marks there could help your grade a lot.",
            "comment_workload": "Workload is very small, just 3 HW, midterm and final. The labs just make sure u attend is ok, but paying attention in labs might be able help you with the HW. The HW consists of two parts, part 1 is about what you have learn in class, usually some calculations questions. For part 2, it is a hands on question where you are required to use Weka to process the given information and answer the questions. All the instructions are written clearly on the question so you don't have to worry not knowing how to extract the data. And if in doubt, you can always ask the TA and she will check yours and and give you feedback on how to improve your answers.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fwYP0dahRGxiYTtpuI3yFWJkMuQ3Hdde",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                },
                {
                    "id": 802,
                    "name": "GU, Jiaying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Maurice",
            "date": "Dec 29, 2016",
            "title": "",
            "comment_content": "data mining, decision tree, logistic regression, naive Bayes rule learning, text mining, Descriptive data mining, unsupervised algorithms, association rule learning, clustering analysis, nearest neighbour, search engine analytics.",
            "comment_teaching": "Prof is willing to answer any questions raised. Lectures are fun. Lecture notes can be easy understood.<br /><br />Instructor of tutorial session is nice. She is also willing to answer any questions.",
            "comment_grading": "1. Lab participation: 10%<br />2. Homework (3): 30%<br />3. Midterm quiz: 30%<br />4. Final exam: 30%<br /><br />High mean score for midterm exam, and assignments. No scores for finals are released. <br /><br />Mean C+ I guess. Not good grade for 3000 level business course.",
            "comment_workload": "3 non-difficult assignments.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Y4puCl0zj6JrhlZ1EtPFLeaDFQIrpERq",
            "semester": "2015-16 Spring",
            "instructors": [],
            "is_author": false,
            "author": "043765",
            "date": "Aug 15, 2016",
            "title": "",
            "comment_content": "It was actually quite useful when you mentioned you have SQL, Oracle forms related knowledge during an interview. As the instructor always said, and as I agreed, this course is one of the few courses where you can write down what you have learnt in your CV.",
            "comment_teaching": "I think both of the professor and TA was highly attendable. They will address your problems and reply your emails as if they were using instant messages.",
            "comment_grading": "The grading was slightly lower than I expected.",
            "comment_workload": "The workload could be quite heavy if you have plenty of free riders in your group.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "zFpj8CKtznLah00Gb2OhpanUJbjA3fPP",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 373,
                    "name": "JIA, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Johnny Deep",
            "date": "May 25, 2016",
            "title": "One of the most useful course coping with future",
            "comment_content": "one of the most useful courses in business school which teaches you finding hidden trend and patterns in marketing, finances, basically anything in anyfield (Please note that no specific marketing or finance things are taught, no worries even you have no background).<br />After the course, you can have a very good insights about future business intuition by making use of data instead of intuitive guess.",
            "comment_teaching": "professor is very responsible. Very detailed explaination and teaching materials. He will have consultation section before midterm and final. You must be able to grab the content from him if you want to.",
            "comment_grading": "Professor is easy-going and generous in grading.",
            "comment_workload": "only 4 homework which are not time-sonsuming",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "lUnsQDKm4VT1tmGMOxH9RCKkKx7WBtVE",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hardworker",
            "date": "Dec 11, 2022",
            "title": "",
            "comment_content": "This course provides some of the most important fundamentals for big data and machine learning. Highly recommended if you have interest in those areas but do not have any backgrounds.<br />If you have no background in statistics, some of the math related concepts might be a bit overwhelming. It also teaches you some coding.",
            "comment_teaching": "She explains some concepts very easily. <br />I felt like she made it easy for business students (with less profession in mathematics) to understand.<br />The TA is also very helpful and enthusiastic.",
            "comment_grading": "Grading is reasonable. <br />The grade is distributed among various assignments, so messing one or two up won't affect your overall grade too much.",
            "comment_workload": "Have weekly lab sessions with quizzes.The project might take a long time if you are new to coding.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NInFZEQHEIfjSGGA0mvgK0J6uXFgtmGY",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "John Au",
            "date": "Jan 23, 2019",
            "title": "一個需要自學嘅course",
            "comment_content": "主要圍繞幾個data mining 嘅model, 包括 Decision Tree,&nbsp;&nbsp;Logistic Regression, Naive Bayes, KNN, network 等等, 內容比較簡單基礎,好多時候聽完都係唔明,所以需要上網自行了解,不過唔洗了解得太深,exam都系考比較基礎嘅concept類問題。Lab教你用azure, exam唔考但係project系完全基於azure平台，唔洗present.",
            "comment_teaching": "notes過於簡陋,必須上堂聽講解做notes,我主要都係落堂後再上網搵補充資料了解,唔洗指望唔上堂睇notes都明.Zheng, Rong上堂都算唔錯,問問題都有求必應,冇咩口音所以我會俾A- ~ B+ to teaching",
            "comment_grading": "由於內容簡單，大家考得都唔錯mid-term mean有86左右，SD都係10左右，競爭較大，final較難，但分勝負應該系project度。",
            "comment_workload": "唔大<br />3 assignments<br />1 group project<br />1 midterm<br />1 final<br />得project比較麻煩 其他自己上網做做research都會識，網上好多resource",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ie9xh2l3SH5bOCBuSFSbH8aXys9nvCGX",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "louie",
            "date": "Jan 14, 2019",
            "title": "",
            "comment_content": "Useful content. The lectures focus on data mining theory on both supervised and unsupervised learning. Tutorials focus on application of data mining on Microsoft Azure. The content covered in tutorials will not be tested in midterm nor final but extremely useful for group project.",
            "comment_teaching": "Lectures are useful but not interactive at all. Professor taught in rather slow pace for most of the time so it was easy to follow. For tutorials, attendance was needed. Samuel is a good TA:)",
            "comment_grading": "Good grading. Midterm are MCs and short questions, the questions are very similar to the ones in assignments. So basically you can get full score for both midterm and assignments.",
            "comment_workload": "Group project on using Azure to perform a data mining task. Topics are chosen by your own on Kaggle. Got much help from the TA on how to structure the whole project. Be aware of using applicable data mining techniques instead of just using all of them. <br /><br />Groups will have to submit status reports but not counted towards the grade. The final report took up all the percentage and no peer evaluation.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "D6IwA5MVfKn4n82sQBgqruoNYkgl0zTK",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 373,
                    "name": "JIA, Jia",
                    "rating": 1
                },
                {
                    "id": 802,
                    "name": "GU, Jiaying",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sharon tse",
            "date": "Aug 14, 2017",
            "title": "",
            "comment_content": "This course teaches basic data mining technique, including:<br />Decision Tree Learning<br />Linear Regression and Bias-Variance Tradeoff<br />Logistic regression<br />Naïve Bayes Learning <br />Text Analytics<br />Association Rule Learning<br />Clustering Analysis<br />Nearest Neighbor Classification<br />Ensemble Learning<br />Search Engine Technology<br /><br />(ref to syllabus for more details)",
            "comment_teaching": "Lecture:<br />Since the PPT slides contain a lot of graphs and formulas, which were not self-explanatory, it would takes you a lot of time to self-learn if you do not attend Jia jia's lectures. Reading the relevant chapters in the recommended textbooks would be helpful for preparing quizzes and exams as you might see some familiar graphs.&nbsp;&nbsp;<br />The course emphasizes on understanding of the idea/theory behind the data mining techniques, therefore, attending lecture and reading the textbook are important. <br /><br />Lab:<br />Sophie (Jiaying) walk us through the steps in using Weka and Azure with some data sets for us to practice. During the lab, you have to complete a one-sided worksheet which is quite easy.",
            "comment_grading": "Good.",
            "comment_workload": "Class participation: 3% <br />Lab participation: 7%&nbsp;&nbsp;&nbsp;&nbsp;(Attend most of the labs)<br />Homework x3: 30%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(MC and short question on lecture coverage, real data mining practice with software) <br />Midterm quiz: 30%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(MC and short question on lecture coverage only)<br />Final exam: 30%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(MC and short question on lecture coverage only)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "8JzUSZTiUlNrOHIulNEFfk4pL4BXQ9dv",
                    "name": "ISOM3360Syllabus-2017",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "5cgpKjPrZMvj2K8D1Wa61NWtd0DnNcMB",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1153,
                    "name": "YANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Luweegee",
            "date": "Jun 05, 2021",
            "title": "Great intro course for Data Mining 😁",
            "comment_content": "It's a great introductory course to data mining and machine learning.&nbsp;&nbsp;Highly recommended if you want to learn basic ML concepts without going too deep in theory.<br /><br />🔷 Data Mining basics<br />🔷 Data preprocessing<br />🔷 Decision Tree, Model evaluation<br />🔷 Linear &amp; Logistic Regression<br />📃 Mid-Term<br />🔷 Naive Bayes Model, Text classification<br />🔷 Association rule learning<br />🔷 k-means &amp; k-nearest neighbors<br />🔷 Recommendation systems<br />🔷 Dimension reduction, Ensemble learning<br />🔷 Image &amp; deep learning<br />📃 Final (NOT cumulative)<br /><br />As an intro course, it only teaches the basic concepts of each ML model and it's not math-intensive. Moreover, coding using Python is only taught in the lab session and coding is NOT tested in the exams.",
            "comment_teaching": "Professor is very good at teaching the basic concepts of ML. He uses plenty of examples to illustrate the concepts so that newcomers of ML can still understand. Although he got a Mainland accent, it's not too bad and you can get used to it quickly.<br /><br />The TA is also pretty good in teaching us how to create ML models using Python.",
            "comment_grading": "Grading is slightly not transparent but I got very good grades at the end.<br /><br />Grading Scheme:<br />🔷 Lab quiz - 5%<br />🔷 Class attendance - 10%<br />🔷 Homework x 2 - 15%<br />🔷 Group project - 20%<br />🔷 Mid-term - 25%<br />🔷 Final - 25%<br />(MT and final are open book and not cumulative)<br /><br />They only released the statistics for mid-term (mean: 20.3/25 ; SD: 2.7). My lab quizzes, attendance and homework nearly got full marks. My MT score is waived due to personal reasons and my group project and final scores are unknown. Got an A grade at the end for reasons I don't know 😂",
            "comment_workload": "The workload is acceptable, but the group project can be time-consuming.<br /><br />📃 Lab quiz<br />We need to complete a short quiz after every lab. It has only 5~6 MC questions but they are very tricky.<br /><br />📃 HW x 2<br />Each homework is split into two parts - LQ and coding. The LQs are not too difficult and can be completed within 2~3 hours. The coding part involves building and using ML models. It's not too difficult either.<br /><br />📃 Group Project<br />The group project is quite time consuming. You need to form teams of 3 or 4. You need to choose any business problem you're interested in, formulate it into a data mining problem, run ML algorithms and evaluate the model performance. You need to submit a report at the end. Our group chose to predict whether tomorrow will rain using an Australian weather data-set.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "06ChZBccpIfMJHTUw0Xmw3l5cgQo0Xgl",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 378,
                    "name": "ZHENG, Rong",
                    "rating": 1
                },
                {
                    "id": 802,
                    "name": "GU, Jiaying",
                    "rating": 1
                },
                {
                    "id": 949,
                    "name": "LAI, Sum Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wes",
            "date": "Jan 24, 2019",
            "title": "Rong is boy god, TA is nice",
            "comment_content": "Actually quite interesting and feel like it could be useful in real life.<br />It covers data mining techniques, different stages, and how to apply it in business world.<br />Required a bit mathematical calculation, but as long as you are familiar with it it should not be a problem.<br />lecture materials should be clear enough and be able to cover all you need. Actually solely rely on the lecture notes without attending the lesson is fine enough to pass the course.<br />All lab materials are about Azureml Studio. Paying attention to Sophie then you can complete all the tasks.",
            "comment_teaching": "If you are a girl, Rong's appearance could be an incentive for you to attend his lesson.<br />He is a professor who used to study in US, and his English accent would not make you uncomfortable.<br />He tried hard to interact with students, and since the content is quite interesting (or useful), you would not feel too bored during class (though he is a bit monotone)<br /><br />TA (Sophie and Samuel) are helpful. Whenever we come across any troubles with Azure or team projects, they would always be there to provide help.",
            "comment_grading": "Not really sure about whether its grading is good or not.<br /><br />Midterm: 95.5/100<br />mean: 89<br />SD: 10<br /><br />Final score is not published but i feel i did it well<br />Group projects we should have screwed it up a bit.<br />Attend all lab session<br /><br />Final grade: B",
            "comment_workload": "3 Assignments, but not really difficult. Just 75% calculation + 25% lab materials. Useful for studying for exams.<br /><br />1 midterm 1 final<br /><br />the one that would take most of the time is team project. There are three reports to be submitted (proposal, progress report and final report). The first two are simple, while the last one required quite a lot of effort, since you will have to run many times of Azure and write a ten-paged reports at last.<br /><br />Lab session will take attendance, so better attend all if you want attendance score, plus you will need the lab materials to complete tasks on final project",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}