{
    "error": false,
    "course": {
        "id": 3188,
        "subject": "ISOM",
        "code": "2600",
        "name": "Introduction to Business Analytics",
        "description": "This course introduces students with the foundation needed to apply data analytics to real-world challenges they will confront in their future career. It covers statistical tools in descriptive analytics and predictive analytics, including multiple linear regression, logistic regression and clustering. Emphasis is placed on applications, concepts and interpretation of results, rather than theory and calculations. Students use a computer software for data analysis. For SBM and DDP students only.",
        "categories": [],
        "website": null,
        "credits": 1,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"ISOM\" data-code=\"2500\" href=\"/review/ISOM2500\" target=\"_blank\">ISOM 2500</a>. (<a class=\"course-link\" data-subject=\"ISOM\" data-code=\"2500\" href=\"/review/ISOM2500\" target=\"_blank\">ISOM 2500</a> AND <a class=\"course-link\" data-subject=\"COMP\" data-code=\"1021\" href=\"/review/COMP1021\" target=\"_blank\">COMP 1021</a>) or (<a class=\"course-link\" data-subject=\"MATH\" data-code=\"2411\" href=\"/review/MATH2411\" target=\"_blank\">MATH 2411</a> AND <a class=\"course-link\" data-subject=\"COMP\" data-code=\"1021\" href=\"/review/COMP1021\" target=\"_blank\">COMP 1021</a>) for students without corequisites.",
        "corequisites": "<a class=\"course-link\" data-subject=\"ISOM\" data-code=\"2020\" href=\"/review/ISOM2020\" target=\"_blank\">ISOM 2020</a>",
        "exclusions": "",
        "rating_content": 3.22,
        "rating_teaching": 3.43,
        "rating_grading": 3.7,
        "rating_workload": 3.43,
        "review_count": 81,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 368,
                "name": "WAN, Xuhu",
                "count": 30
            },
            {
                "id": 369,
                "name": "PAN, Baoqian",
                "count": 28
            },
            {
                "id": 795,
                "name": "DU, Lilun",
                "count": 14
            },
            {
                "id": 404,
                "name": "HU, Inchi",
                "count": 7
            },
            {
                "id": 1410,
                "name": "CHAN, Yee Wong",
                "count": 6
            },
            {
                "id": 1373,
                "name": "TONG, Chun Ho",
                "count": 5
            },
            {
                "id": 401,
                "name": "LEE, Wai Hong",
                "count": 4
            },
            {
                "id": 1411,
                "name": "MAK, Chun Cheong",
                "count": 3
            },
            {
                "id": 1600,
                "name": "YIN, Zhendong",
                "count": 3
            },
            {
                "id": 1479,
                "name": "LI, Juncheng",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "odDfMQhbmZvyTWpChdOMWyIHG1v8KzLa",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "LucindaNightray",
            "date": "Jul 14, 2020",
            "title": "a Disaster that suddenly appears",
            "comment_content": "(it is mentioned and it is the same for everyone this semester)<br />I would describe the content being too difficult but the exam is at a suitable difficulty.<br />Some content totally requires you to be mathematic",
            "comment_teaching": "Despite his poetic name, his teaching can never deliver any <br />理論s. His english is barely understandable complemented by content that year 1 business students could hardly absorb/ have the need to do so. <br /><br />The TA's eFforRt is the best thing out of this stupid course. Notice that I said effort coz it is still not very effective but he is very nice and I understand the difficulty of their job in this genius course.<br /><br />Agree that the communication between professors and TA is LAcKiNg. TA: &quot;Oh the powerpoint is not up yet? i don't know ah should be another TA in charge not me? This tutorial just look at mine first la&quot;and also this, which is commonly seen in other ISOM courses, Prof: ASk THE TA DON'T ASK ME<br />(the last one is actually normal though sorry -.-;)",
            "comment_grading": "Assignments: all below mean for 1-2 marks <br />Final: slightly above mean <br />Grade: B-",
            "comment_workload": "I HATE THE HOMEWORK。 But you can definitely get full marks if you have STRONG programming skills/ friends with strong programming skills.<br /><br />For 3 assignments I got 92-94/100 but these are all lower than average. more details need to be provided even though the question did not mention it nor did the professor.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kVA4eiqX0QCzrN0gcooW5XvEG3oWjscr",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ustspace user",
            "date": "Dec 29, 2020",
            "title": "The greatest catastrophe in my u life",
            "comment_content": "This course is ill-designed. It covers content worth of a normal 3 credit course then put it in a half-semester 1 credit course.<br /><br />There are coding parts covered by lab, but all they tell you is to copy the codes and that you don't need to know how to write the codes.<br /><br />Upon finishing the course, you are expected to learn nothing about coding and business analytics.",
            "comment_teaching": "Language<br />I am still not sure what language Lilun speaks, but there's a high chance he speaks English, though some say he was speaking Spanish. Sometimes I suspect that he's actually a Martian who forgets he's on Earth now. From time to time, I still lay on my bed wondering how some students managed to answer his questions in the chat room, which I think is close to super power. Lilun makes this course more of a language course than a statistics course.<br /><br />Slides<br />His slides are messy and crude. If you want to understand the content, you may either do your own research online, or learn the super power to understand his explanation in lectures (I am not sure if he explains well because I haven't been able to understand more than 10 words from his mouth)<br /><br />Explanation<br />Again I am not sure about this one because I didn't know what he was saying",
            "comment_grading": "Assignment x3 — 45% (15% each)<br />Final — 50%<br />Participation — 5%<br /><br />Participation is actually attendance. Attend all lectures and you will get full mark in this part.<br /><br />The final is mind-blowing. If you didn't take a look at the practice paper (the only practice resource he offered), you would suspect that you went to the wrong exam.<br /><br />My grade = B-<br />Assignment 1 = 100/100 (mean=98)<br />Assignment 2 = 96/100 (mean=95.2)<br />Assignment 3 = 100/100 (mean=97.3)<br />Final = 51.92/92 (mean=55.2, SD=12.9)",
            "comment_workload": "3 Assignments. Not hard. Most answers could be found in the slides and in the lab files. But some questions require understanding of the concepts. You can form a group of 3, but doing it alone takes around 1-2 hr per assignment (after understanding the slides).<br /><br />The biggest workload comes from understanding the slides on your own, which might take 3-5 hr per week.<br /><br />Lab attendance is not compulsory, but you need to know how to apply the codes to finish the assignments. So you will need to learn lab materials as well, which takes about 1 hr per week.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JnV2Raov5w2AdJ1YTU5Mvu2OVxbgrhkV",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 404,
                    "name": "HU, Inchi",
                    "rating": 1
                },
                {
                    "id": 1410,
                    "name": "CHAN, Yee Wong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DRose",
            "date": "Jun 09, 2020",
            "title": "Poorly designed syllabus",
            "comment_content": "1.Introduction to multiple regression<br />2.Transformation and interaction of variables<br />3.Regression model selection<br />4.Classification and supervised learning <br />5.Clustering and unsupervised learning<br /><br />For a course with a length of six weeks and only one lecture per week, the content is overwhelming. Not only the concepts themselves are difficult to interpret, but also the instructor struggles to explain them bit by bit due to the tight schedule. Also, the content requires some basic knowledge on linear regression learnt in ISOM 2500 in the previous semester, which I believe that majority of the students in my class have forgotten all of them. The lab session on the other hand is simply about python, teaching us how to do the codings for the content covered in lectures. All in all this course is like a combination of ISOM 2020 and ISOM 2500, but with more difficult content.",
            "comment_teaching": "Professor Hu is a nice and kind professor. Though many of us are lost in this course in majority of the time, he still did his best to explain the difficult concepts with simple daily examples (at least I understood most of the concepts in the end haha). He always try to raise questions and try to eliminate misconceptions, even when none of us are able to answer his questions he doesn't lose his ambition and explains it thoroughly again. Meanwhile he has a good accent comparing to other professors in HKUST, you won't need to adapt to his accent after all.",
            "comment_grading": "Assignments(40%)<br />Attendance/Participation (10%)<br />Final examination(50%)<br /><br />Assignment 1: 100/100 (mean:95.4)<br />Assignment 2: 100/100 (mean:95.2)<br />Assignment 3: 99/100 (mean:92.3)<br />Assignment 4: 98/100 (mean:95.1)<br />Final Examination: 48/65 (mean:36.2)<br />Final grade: A-<br /><br />For some reasons our TA didn't provide us with the detailed statistics of the assignments and the final examination score, I could only use those included in Canvas. Out of my expectation I got an A- in this course haha. In my opinion the grading in this course is not that strict comparing to other courses, even my group mate got a final examination score lower than the mean score but still managed to get a B. Overall the grading is not as catastrophic as the course design.",
            "comment_workload": "The workload is terribly heavy.<br />If you have noticed you could see that we had 4 group assignments throughout the course, normally you would have a week's time to finish them in groups of three or four. Workload could be very light only and only if everyone in your group are coding geniuses, but unfortunately I'm the only one who is familiar with the codings, meaning that I did majority of the work throughout the semester. I usually need to spend hours and hours to review the course contents and the coding part by reading notes and watching the lecture and laboratory videos before actually doing the assignment. After that I would need to spend another two days on the assignment. Sometimes the codes could be copied from the laboratory notes, while sometimes you might need to type the codings from scratch with the help of Google. Basically I would spend a whole weekend and another Monday afternoon on it. My tips? Find a reliable group mate to carry you or else you would be in big trouble.",
            "rating_content": 1,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "NUVZVDTVjM47C6D6PNivaYJWUcy3CzaT",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                },
                {
                    "id": 1410,
                    "name": "CHAN, Yee Wong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mivy Wenceslas",
            "date": "Jun 13, 2021",
            "title": "Let me Clarify ISOM2600",
            "comment_content": "Topic 1:&nbsp;&nbsp;Multiple Linear Regression Model<br />Topic 2:&nbsp;&nbsp;Model/Variable Selection<br />Topic 3:&nbsp;&nbsp;Classification Analysis<br />Topic 4:&nbsp;&nbsp;Clustering Analysis<br /><br />A lot of people say that the syllabus of this course is useless. This is utterly wrong. These are all very practical content for any kind of data science and analysis.<br /><br />The only issue is that there are only 5 weeks to teach, so they only talk about the basics. As a result, people may get confused to what they actually are without prior knowledge. <br /><br />I would recommend you to search online to gain more insights instead, but as an introduction course it serves its purpose.",
            "comment_teaching": "I saw that a lot of posts claimed that Professor Wan has terrible handwriting and horrible delivery. This is partially true. <br /><br />Indeed, his handwriting is quite bad and his delivery throughout is not very fluent, but understandable. More importantly, to compensate this, he gives out a lot more examples in the teachings. <br /><br />Moreover, his notes are actually on point and relevant if you extract carefully. He is also the rare type of professor who provides final review and past paper exercises for you to do, which is extremely practical. He is also willing to answer any questions.<br /><br />I would say he is a professor that prefer writing than saying, and he is definitely passionate in the teachings. If you have any questions, then ask him or search Google first. I do not think he is in any way bad given his notes quality and teachings.<br /><br />He also cut the syllabus on point to save time, given that he spent a lot of time in Topic 0, which is just introduction.<br /><br />For the Lab Session, I got Yvonne Chan. Her job is to basically talk about the code and give you an understanding of it. <br /><br />Now, I do not know who write the code, but there are simpler expressions obviously and the most relevant code such as feature selection is hidden in another file. So, it is not easy to teach these code especially when people don't know much of Python. However, Chan has tried her best to invigorate your interest and answered any questions as well as give you more understanding about the code. I think she has done her job.",
            "comment_grading": "While people are complaining, this is a very competitive course. One mark in the final exam could easily affect one subgrade.<br /><br />10% Attendance<br />40% Assignment<br />50% Final Exam<br /><br />I believe to get an A+, you have to get around 99%-100% overall. If you get around mean in Final Exam, you easily get B at most. Basically, a very competitive course where every mark matters.",
            "comment_workload": "There are attendance, which you can just join the meeting and do something else.<br /><br />There are 2 coding assignments, but you can form a team on your own. You can also copy the code from the Lab, so not difficult. A lot of time is given anyways.<br /><br />Overall, low workload.<br /><br />I would also like to note that this course is largely irrelevant to ISOM2020, not sure how they are corequisite. In this course, you do not need Python in the final exam, only the assignments. In the assignment, they actually use a lot more advanced knowledge than in ISOM2020. Libraries such as Pandas and Matplotlib is used. There is also list comprehension. These are not taught in ISOM2020 at all, so I think it is better to just copy the code in the Lab.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vxkR3IMesZ68WFbSiQoV3YWAT5WbtVFR",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Iloveusthehe",
            "date": "Jun 12, 2020",
            "title": "",
            "comment_content": "5 topics <br />1) Multiple Linear Regression<br />2) Fitting Non-linear Pattern<br />3) Variable Selection<br />4) Classification<br />5) Clustering<br /><br />It is hard to understand all the things at once. You may need to work hard to rewatch the lecture videos if you want to get better grades.",
            "comment_teaching": "Quite clear<br />You will understand what the professor says if you rewatch the lecture videos.",
            "comment_grading": "(50%) Final<br />(40%) Assignments (4 in total)<br />(10%) Participation (attend 5 classes to get full mark)<br /><br />Final exam:<br />--10 questions<br />--2 hours<br />--Mean: 77.9/130 <br />--S.D.: 23.1<br />Me: Slightly above mean --&gt; B<br />**Time management is very very very important! Many people (including me) could not finish the whole paper.",
            "comment_workload": "Heavy workload<br />Assignments are very very very hard and very very very very time-consuming.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aWutf37QGaB5J09fLWlbH06zwB2e2Nks",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 0
                },
                {
                    "id": 1373,
                    "name": "TONG, Chun Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "L7E2O9",
            "date": "Jun 09, 2020",
            "title": "doesn't matter even if you fail the course",
            "comment_content": "Mindblown content, a combination of isom 2500 and isom 2020 and it is 1000x harder than both courses combined.",
            "comment_teaching": "dulilun, a guy who has taught me in total 4 credits (isom 2500 and isom 2600) and still I can hardly hear what he's saying.<br /><br />TA is better at least i can understand what he's saying",
            "comment_grading": "40% assignment: try your best to get full score as you will screw up the final most likely<br />50% final: <br />10% attendance: basically everyone gets it<br /><br />grade: C+, though my final was almost 1 sd below mean, my assignment managed to pull me up a bit so I was below mean for 5 marks overall.",
            "comment_workload": "if there were an F, I would rate this column as F. Mindblown content and mindblown assignment that took you days or weeks to get them. For the assignment, it is totally unworthy for a 1 credit course have&nbsp;&nbsp;4 or even 6 credits workload.",
            "rating_content": 1,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "RNGVdc6eFGEeFcOGtXATrlbkQdTQ76yd",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 1
                },
                {
                    "id": 1373,
                    "name": "TONG, Chun Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "grindingalways",
            "date": "Jun 09, 2020",
            "title": "Poorly designed course",
            "comment_content": "If ISOM2020 is very chur, then ISOM2600 is very very chur plus not so useful if not trashy content. In particular, the coding part of ISOM2600 is very complicated (at least for me) which may be interesting to coding lovers. Anyway, after this course I don't really know what I have learned from it, so the curriculum does need a refinement to make it at least more meaningful, e.g. cut the useless content.",
            "comment_teaching": "Umm I would say the first time I attended du lilun's lesson I could barely hear him because of the accent issue. But afterwards I can adapt to that. Another thing is the content is already rubbish so no matter how good the teaching is doesn't help much imo. After all I need to email the professor for a lot of times to get the concepts clear.<br /><br />The TA Anson, on the other hand, is a good TA and is very helpful. Despite his not so good English accent, we can use Cantonese to communicate. He is a nice TA who will respond to emails in a timely manner.",
            "comment_grading": "Finalized grade not yet out. Will update later.<br /><br />Update:<br />HW1 to HW4 each occupies 10%<br />Participation 10%<br />Final Exam 50%<br /><br />My results:<br />HW1 96/100, other assignments all full marks<br />Participation full marks (just show up in lecture should get you full marks)<br />Final Exam: 89/124 (mean 70.2, around 0.7 SD above)<br />Final score: 85.49/100 (mean 74.5)<br />Grade: A-<br />This is great because generally speaking, around 0.7 SD above might just give you a B+. So despite the content, the grading is quite lenient imo.",
            "comment_workload": "Heavy. Especially for the assignments (done in groups of 3 people) which are the coding part. Spent hours and hours on them which totally are not worthy for a 1-credit course. ISOM2020 also consists of coding, but a huge difference is that for ISOM2600, I don't even know why the coding is constructed like that when I can produce the right answer lol. Anyway, find a good teammate so that you can double check. It doesn't have to be a teammate in the same group because the assignments are the same across all the groups.",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2r0UKdldK0R1RUETD2FBW6iYuoKQemtL",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 1
                },
                {
                    "id": 1373,
                    "name": "TONG, Chun Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Boeing787",
            "date": "May 17, 2020",
            "title": "I don't even know what was being taught in this course",
            "comment_content": "Syllabus<br />1. Introduction to Multiple Regression<br />- Multiple regression<br />- Inference, Prediction, and Model checking<br />2. Fitting Nonlinear Pattern<br />- Log-transformation<br />- Quadratic regression<br />- Use Indicator and Interaction variables in regression<br />3. Model Selection<br />- Best subset, Forward selection, Backward elimination, and Stepwise selection<br />- Model evaluation: Adjusted R-squares, Cp, AIC, BIC<br />- Training set and Validation set, Cross-Validation<br />4. Classification I<br />- Evaluation Criterion for Classification<br />- Accuracy Score, Kolmogorov-Smirnov test, and Area Under the Curve (AUC)<br />5. Classification II<br />- K-Nearest Neighbors Classifier<br />- Naïve Bayes Classifier<br />- Logistic Regression<br />6. Clustering Analysis<br />- K-means Clustering<br />- Hierarchical Clustering<br /><br />The first three topics were easy to handle. Classification was difficult but I found clustering quite fun and interesting.",
            "comment_teaching": "Professor Du is a terrible professor. His English is hard comprehensible and I can't help but fall asleep in his lecture. Since attendance is counted in this course, simply log on to the zoom class and do something else. Don't bother listening to his lecture. Trust me, you can achieve more by self-revision of the PowerPoint slides. The attendance is high as it is counted towards your final grade. If not, I'm sure that less than half of the students would turn up.<br /><br />The labs are pretty much useless. They're only somewhat useful for the assignments. However, if you team up with good people in the assignments, you don't even need to attend the labs. The labs are long, arduous and boring.",
            "comment_grading": "Grading<br />Assignment 1 (3 students/group) 10%&nbsp;&nbsp;<br />Assignment 2 (3 students/group) 10%<br />Assignment 3 (3 students/group) 10%<br />Assignment 4 (3 students/group) 10%<br />Final Exam 50%<br />Class Participation 10%<br /><br />Tip 1: Make sure you pair up with students who are good at coding for the assignments! This would save you so much hassle! <br /><br />Tip 2: make sure to attend every lecture as it counts for 10% of the final grade!<br /><br />Tip 3: Fortunately, the finals won't ask for the coding but focus on content. So rote memorization of the PowerPoint slides would be sufficient.<br /><br />At the time of writing, the grades for assignment 3, 4 and finals have yet to be released. Hopefully the finals aren't too difficult!",
            "comment_workload": "Again, the workload for a 1-credit course is still too high. There are 4 group assignments to be completed within a month! This is insane! The coding involved in the assignments is extremely difficult and way beyond the ability of a year 1 SBM student. Assignment 1 was still manageable but anything beyond that is way too much. We would always spend hours and hours pondering over the assignment a day before the submission deadline. However, the workload for this course is already a stark improvement from ISOM2020. At least there aren't mandatory weekly lab sessions and assignments. This shows how bad the workload was in ISOM2020.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qJPcLLumHwAGizZqlWOLNvwDdRHncctR",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Leannelau524",
            "date": "Jan 04, 2023",
            "title": "",
            "comment_content": "Topic 1: List, Array and Pandas<br />Topic 2: Data Processing<br />Topic 3: Multiple Linear Regression<br />Topic 4: Multiple Linear Regression<br />Programming Language: Python",
            "comment_teaching": "Prof Wan is actually very nice who is willing to answer students’ questions. However, because of his tone, his lectures could be quite boring, especially that each lecture lasts for about two hours. To be honest I didn’t really pay attention to his lectures so I couldn’t really tell if his teachings were good or bad. His ppts are quite clear and easy to understand.",
            "comment_grading": "Lab Assignment 1 (3 students/group) (16%)<br />Lab Assignment 2 (3 students/group) (10%)<br />Final exam (individual, Multiple choice, 1hour) (50%) -&gt; one cheat sheet allowed<br />Class participation (in-class exercise, multiple choice) (24%) -&gt; it’s actually attendance that everyone got full marks<br /><br />I believe many students got full marks in both of the assignments.<br />The mean for final exam is 15.5/30 (high:25 / low:6)<br />I got slightly higher than the mean and final grade is B+<br />(Satisfied cuz I literally didn’t study for the final, I just made my cheat sheet one day before the exam)",
            "comment_workload": "Very light. This course is not difficult to understand. I believe if you put in more efforts, it could be easy to reach A range.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wros0BqWjzWmkh8eYfO5BRHbzlqlKKwX",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                },
                {
                    "id": 1600,
                    "name": "YIN, Zhendong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tsukino",
            "date": "Jul 13, 2022",
            "title": "Great course!",
            "comment_content": "Some data analytics and apply it to real life. But you do not need to write the coding.<br />The contents have strong relationships with ISOM 2500 &amp; ISOM 2020.",
            "comment_teaching": "TA is very patient.<br />Prof PAN's speaking speed is a little fast, but totally, the teaching is good and clear.",
            "comment_grading": "The grading is very good.<br />I got 100% in the in-class exercises and the lab assignments.<br />In the final exam (open book), there was total of 30 MCs, and I got 27/30 correct. All questions are not difficult as long as you spend time reviewing the concepts.<br /><br />My grade: A<br />I was very surprised about that. (Because my grade of ISOM 2020 was not so high as this course)",
            "comment_workload": "The workload is not too heavy, it is suitable for a 1 credit course.<br />In each class, you need to finish an in-class exercise, you can do it with your friends and even ask TA/Prof. When you get correct more than half of the questions, then you can get full marks for your participation.<br /><br />There are two lab assignments needed to do, you can group with 3--4 ppl to finish them. The assignments are related to the lab, and all of them are easy to find the answers.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iClaD8nYVCXKInAjmbuaMHg6WoT1s0W9",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tommy Wong 1221",
            "date": "Jul 13, 2023",
            "title": "Needs time to digest",
            "comment_content": "Topic 1: Pandas and data processing<br />• Topic 2: Exploratory data analysis<br />• Topic 3: Statistical inference<br />• Topic 4: Application of regression in business analysis<br />• Topic 5: Identification of business patterns<br />As someone without coding background, it is tough to catchup the use of Pandas etc. (basically skipped all lectures) Before finals studied for about 1 week, still don't understand the content but I guess I survived???",
            "comment_teaching": "Only watched the videos, decent teaching, very exam oriented which I really like, as you can just simply go through the video, prepare your cheat sheet and not have to bother with ISOM 2600 ever again.",
            "comment_grading": "assignment (30%. ): Students need to work individually.<br />Final Exam(60%) (All MC questions)<br />Attendance(10%): Students are strongly encouraged to attend the lecture regularly for the good un- derstanding of concepts with the help of Python. You will be asked to try all kinds of pandas skills during the lecture. Attendance of the tutorials are not compulsory. However, tutors will help you with pandas and statistical modeling in more details.<br /><br />Find a friend to give you attendance codes if you want to skip lectures.",
            "comment_workload": "2 group work, as long as your teammates are not free riders the workload is manageable. Before the exam, you have to prepare a cheat sheet (2 A4 paper), this is the most demanding part of the course for me.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Kcr5ooFEMMgrTEsOaHovxJzqpcpkNrt4",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "-----",
            "date": "Jun 19, 2023",
            "title": "Grading can be better but not too bad",
            "comment_content": "Combination of Python and content from ISOM 2500. Interesting and useful things to know. Can take time to understand new things such as KMeans and Clustering. Nonetheless, this all comes in useful in other ISOM courses too.",
            "comment_teaching": "Professor was straightforward in terms of teaching. Easy to understand and is willing to answer questions. She also uploaded lecture recordings. But attendance is taken and a code will need to be put in so have a friend give you the attendance code!<br /><br />No attendance for Lab but is useful to attend if you are really struggling",
            "comment_grading": "Grading was an issue. I got above mean in the final and in an assignment yet I only got a B....a B+ would have been fine. Assignments had a high curve to them so make sure you get as close to full marks as possible!",
            "comment_workload": "Not too high. 2 assignments which are done in groups. Just avoid free riders. Exam was MCQ and allowed 2 A-4 cheat sheets (4 sides). Practice resources were given for the exam but in hall honesty, the exam was not too hard.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "topRfgoZPMrd7TF4220ZeZ9V5kglbbxn",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "dos0_282",
            "date": "Jun 16, 2023",
            "title": "bad course",
            "comment_content": "It covers different python models like pandas, numpy, scipy, matplotlib, etc...<br />They simply don't have time to cover all the contents so expect that they will go through the contents really really fast. The powerpoints were kinda useful but the lectures were not useful at all.",
            "comment_teaching": "I wanted to say horrible teaching at first but this isn't the worst that I had encountered this semester so I am going to say that it was fair.<br /><br />The lecture was not as useful as you expected as it was really really boring and the lecturer would only go through the powerpoint and the google colab notes without going deep. No difference with self-studying in my opinion. I didn't attend the lab sessions, not even once.",
            "comment_grading": "The grading wasn't good but acceptable. I got above mean in the lab assignments and above mean 0.4SD in the final. Turns out a B.",
            "comment_workload": "Heavy workload. You are expected to attend all five 2-hour lectures. You have to finish the attendance quizzes during the lectures. There were 2 group lab assignments as well. <br /><br />Imo i don't think that it is unacceptable to ask students to attend all the lectures but PLEASE MAKE THEM USEFUL!",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bQT8ZoedADjLExdsSiYv8l5PwIJHSyya",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "professorwok",
            "date": "Jun 11, 2023",
            "title": "Unsure about the positioning of this course...",
            "comment_content": "As Kris said; it is neither a python course nor a statistic course, but a business analytics course. In reality, you are tested on the outputs and mistakes within the python code, and interpreting the statistics from the computer-generated results. You learn nothing about the theory behind the techniques...<br /><br />As an extension of ISOM 2500 and ISOM 2020, it is assumed you fully understand the contents of those courses before entering.<br /><br />To be honest, I basically learnt nothing as the content is so shallow. <br /><br />Topic 0. Introduction to the course<br />Topic 1. List, Arrays, Graphing (with numpy, scipy, matplotlib libraries)<br />Topic 2. Pandas (pandas library)<br />Topic 3. Recap Single Linear Regression and Multiple Linear Regression (scikit-learn and other libraries)<br />Topic 4. Clustering (k-means method only)<br /><br />Topic 4 is considerably shorter than previous years as many lectures were missed (Due to holiday and fire drills).",
            "comment_teaching": "Kris is a nice person who responds to all your questions patiently. Also, she gives a lot of breaks to do practise questions. However, like with ISOM 2020 and ISOM 2600, the teaching is terrible. She just read directly from the ppt very quickly and does not explain much things in detail, especially the concepts. You are just assumed to memorize everything.<br /><br />The TAs are utterly hopeless... In the lab, the TA goes through the code super quickly with no explanation. they also don't seem to reply many emails, and the assignments have so many typos that they have to reupload them multiple times over the span of a week.<br /><br />There is barely any past paper questions, and the questions are so easy that I feel its better to just search up similar topics online and practise off those.",
            "comment_grading": "Lenient cutoff as the exam is harder than previous years. A-range seems to be big as well.<br /><br />10% Attendance (Count 5/6 lectures)<br />30% Two Group Assignments (on ipynb)<br />60% Final Exam (1 hour, 30 MC questions)<br /><br />The group assignments are super easy and most get full marks.<br /><br />In the final, you are allowed 2 two-sided A4 cheat sheets. NOTE: LAB CONTENT is tested<br />The exam was significantly harder this year, and I think some of the questions are not even taught in the lectures (but they may be small print in the lab or ppt). Also, be sure to revise the appendix and other 'optional' contents; they are also tested.<br /><br />Exam stats (/30): Mean 20.9, SD 4.1 <br /><br />Me: Attendance 6/5, Assignments full, Final 26/30. Finally get A.<br />My friend: 25/30 and also finally get A",
            "comment_workload": "As a 1-credit half-semester course, you are expected to attend 2 hours of lecture and 1 hours of lab per week. I would say the workload is lower than ISOM 2020 but it still feels like a 1.5-2 credit course.<br /><br />The assignments are easy if you work in a group. You can just copy the code based on the samples provided in the ipynb file or the powerpoint. Be sure to triple check your answers because everyone gets full marks.<br /><br />The final questions are relatively easy for the most part. Be careful as many of the questions have 2 obvious answers; its a 50/50 gamble most of the time. Also, ensure to copy everything into your cheat sheets, as you are tested on syntax and output as well.<br /><br />NOTE: Some questions test on combining multiple methods from DIFFERENT LIBRARIES: ITS NOT TAUGHT IN THE PPT OR LAB.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MnWlVjwMQh0jEIBjkqJVjUw5xDAE1TRd",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jcy1021",
            "date": "May 19, 2023",
            "title": "SUPER HORRIBLE GRADE CURVE BE CAREFUL",
            "comment_content": "All the other reviews have said so already. Refer to them. It’s essentially same thing nothing different.",
            "comment_teaching": "There’s essentially no teaching. You have to self study a lot. The teachings don’t really cover what’s really on the exam anyways. They only offer an understanding, but you really really should study yourself.",
            "comment_grading": "This is what I got to talk about. The grading is intensely hard. You literally need to get perfect to be A range. <br /><br />mean=23.6, sd=4.5. This was the stats for my class in final exam. Me and everyone else in class basically gets 100% on the quizzes and assignments so what this means is your final determines everything.<br />I got 25/30 on the finals and got B. 26/30 is B+ 27/30 A- so you get the sense. The score is super close so you really need to study and push for that 100% to get a good mark. One wrong question can legit land you a C.",
            "comment_workload": "There is almost no workload in terms of what you need to hand in. The key workload here is you really need to take time and study. Make sure you get that 27/30 in the finals to hit an A range!",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5f2eeaeRt8ApnlyeC5eeU2LG8ohtxz7T",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chewygummyy",
            "date": "Feb 09, 2023",
            "title": "Quite good grade",
            "comment_content": "This course teaches about business analytics with python, which is hard to learn everything in a 1 cred course lol. You need to use your knowledge learnt in isom 2500 and isom 2020. If you don't do well in both courses, then probably you will also have a hard time in isom 2600.",
            "comment_teaching": "The teacher tried to explain deeply, however, it was still a bit hard to understand tbh. Before the final I just keep repeat the recordings becuz it is very hard to understand everything by just seeing the slides.",
            "comment_grading": "If you got a mark higher than 1 sd, you will mostly get an A! Which is quite good grade lahh. Very out of my expectation cuz I thought this course is a bad grade course.",
            "comment_workload": "The workload is not very heavy. There are lab assignments, participation quizzes, and a final. The lab will give you all the assignments' answers lollll, so you don't need to do anything. for the participation quiz, if you have a friend to give you the canvas code for the quiz, then you don't need to attend the lesson too. The finals are mc which is a bit hard but all of us didn't do very well.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2Zd9tCobLBvG67DwBnWRn6TslAPVaIpu",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                },
                {
                    "id": 1410,
                    "name": "CHAN, Yee Wong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bruhbruh",
            "date": "Jan 25, 2023",
            "title": "",
            "comment_content": "1) Multiple Linear Regression<br />2) Fitting Non-linear Pattern<br />3) Variable Selection<br />4) Classification<br />5) Clustering<br />1 cred course, one lesson per week",
            "comment_teaching": "They are eager to answer questions. You can ask her questions in Cantonese, English or Putonghua after classes. You cannot multi-tasking during lessons as her teaching pace is fast.",
            "comment_grading": "Lab assignment 26% (2 group assignments)<br />Final exam 50% (30 MCs)<br />Class participation 24% by finishing the 6 in-class exercises<br /><br />All are in open-book and open-notes. In-class exercises and final are in MCQs but lab assignment is in python coding. TA will teach and provide almost all answers of lab assignment. So, you may a sub-grade when you do a wrong question.",
            "comment_workload": "Two-hour lesson per week, but all compulsory. Lab assignment are taught by TA. Open-notes and Open-book exam.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wZVBS5QkWTmds5z3qhB4BxV3ErXXTxih",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ansonhk",
            "date": "Jan 15, 2023",
            "title": "It's about LUCK and HARDWORK",
            "comment_content": "Topic 1: List, Array and Pandas<br />Topic 2:&nbsp;&nbsp;Data Processing<br />Topic 3: Multiple Linear Regression – Part 1<br />Topic 4: Multiple Linear Regression – Part 2<br /><br />Taught in a total of 6 lectures. 1-credit course",
            "comment_teaching": "Prof Wan is actually very nice who is willing to answer students’ questions. The ppts are very clear and easy to understand.",
            "comment_grading": "Grading is good!<br /><br />Lab Assignment 1 (3 students/group) (16%)<br />Lab Assignment 2 (3 students/group) (10%)<br />Final exam (individual, Multiple choice, 1hour) (50%) -&gt; one cheat sheet allowed<br />Class participation (in-class exercise, multiple choice) (24%) -&gt; it’s actually attendance that everyone got full marks",
            "comment_workload": "Very light. This course is not difficult to understand. I believe if you put in more efforts, it could be easy to reach A range.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0ZllVIyAOrSzZrzchonOgjaRait4aGcL",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Trebmal",
            "date": "Jan 10, 2023",
            "title": "Manageable",
            "comment_content": "Topic 1: List, Array and Pandas<br />Topic 2:&nbsp;&nbsp;Data Processing<br />Topic 3: Multiple Linear Regression – Part 1<br />Topic 4: Multiple Linear Regression – Part 2<br /><br />Taught in a total of 6 lectures. A bit too much for a 1-credit course in my opinion.",
            "comment_teaching": "Professor Wan may have a strong accent but the handouts and revision materials are understandable.<br /><br />Did not attend any tutorials.",
            "comment_grading": "Lab Assignment 1 - 16%<br />Lab Assignment 2 - 10%<br />Final exam (all MCQ, 2 double-sided A4 cheatsheets allowed) - 50%, of which<br />&nbsp;&nbsp;&nbsp;&nbsp;- 5% from topic 1<br />&nbsp;&nbsp;&nbsp;&nbsp;- 50% from topic 2<br />&nbsp;&nbsp;&nbsp;&nbsp;- 45% from topic 3 &amp; 4<br />Class participation (Canvas quiz in 1 MCQ) - 24%<br />Peer evaluation - Downgrade when necessary<br /><br />To answer the majority of the final exam questions, you really need to understand what is going on for each topic - a reason why the content might be overwhelming.<br /><br />Personally, I prepared by extracting key points in the handouts to the cheatsheets and looked at some tricky topics on YouTube. The recordings are not especially useful. Do pay attention to how some functions behave as well.",
            "comment_workload": "If you have some data science background and played around with the trio of pandas, matplotlib, and numpy before, this course should be much easier. You can even finish the group assignments individually - most of the codes can be copied from tutorials anyways.<br /><br />Even lighter workload if you have a friend who can give you the access code to the Canvas quiz, i.e skipping the lecture.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KyY8DucHAxDaB3TcczDlt7SVyzpgBfOi",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "王子",
            "date": "Sep 15, 2022",
            "title": "Very competitive although easy to understand for the course",
            "comment_content": "Topic 1 ListArray and graphing<br />Topic 2 Pandas and data processing<br />Topic 3 clustering1 - K means<br />Topic 4 clustering2 - hierarchical<br />Topic 5 review of SLR and multiple linear regression<br />Topic 6 more about MLR",
            "comment_teaching": "Kris' teaching is quite clear. She is willing to answer your questions. Ans she has nearly no accent, you can easily listen to what she said as long as you concentrate in nearly 2 hours of lecture.",
            "comment_grading": "Lab assignment 26% (2 group assignments)<br />Final exam 50% (30 MCs)<br />Class participation 24% by finishing the 6 in-class exercises<br /><br />But the grading distribution is very competitive. Nearly one marks in your final exam varied a subgrade.<br /><br />My marks in the final exam:26/30 (B+)<br />30/30 A+<br />29/30 A<br />27-28/30 A-<br />So i don't have A range and mostly the grade is almost determined by your final exam score.",
            "comment_workload": "Almost no workload. The assignments are almost quite similar to the lab demonstration. As long as you understand the logic behind it, you will easily get full marks for the assignment.<br />For the final exam, only need to clear the concept by revising the PowerPoint slide and do the practice questions is ok.<br />Overall, the course is satisfactory.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PTfG3eqZL8DHVLrIC4sEF8eWGWunZaeK",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "boo yay",
            "date": "Aug 26, 2022",
            "title": "stupid course with stupid grading",
            "comment_content": "It's all about python libraries like pandas, numpy, scipy. The content is too much for a one credit course.&nbsp;&nbsp;Basic statistic knowledge is needed. Most of the time you don't get to know why but have to memorize stuff.",
            "comment_teaching": "Her teaching was fine. Willing to answer questions.",
            "comment_grading": "The grading is too stupid. It all depend on the final because everyone get almost full in the other parts. The final consists of 30 multiple choice questions and you cannot go back to the previous question after you submit one question since it was an online exam. The grade was like one grade lower for one mark deducted. I was wrong for only 1 question more than my teammate but got a lower letter grade, which is totally unacceptable because the exam are not designed well&nbsp;&nbsp;enough to classify the students' understanding, especially in the case where you cannot go to the previous question. It's just based on luck I guess.I did all of the teamwork and even taught my teammates. However, because of the stupid exam and stupid grading. I was 1 mark lower than him in the final but all other parts are the same. He got A- while I got B+.",
            "comment_workload": "Too much for 1cre",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Pgf2dmAl5AjlkDK4JHfUoNXnX85lPpUA",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                },
                {
                    "id": 401,
                    "name": "LEE, Wai Hong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KSTC",
            "date": "Aug 24, 2022",
            "title": "Good Grade Course 肯做肯讀就攞到好grade",
            "comment_content": "Topic 1: List, Array and Graphing <br />-&nbsp;&nbsp;List <br />-&nbsp;&nbsp;array <br />-&nbsp;&nbsp;Graphs <br /> <br />Topic 2: Pandas and Data Processing <br />-&nbsp;&nbsp;Missing data <br />-&nbsp;&nbsp;Data slicing <br />-&nbsp;&nbsp;Feature engineering <br /> <br />Topic 3: Clustering – part 1 <br />-&nbsp;&nbsp;K-means <br /> <br />Topic 4: Clustering – part 2 <br />-&nbsp;&nbsp;Hierarchical clustering <br /> <br />Topic 5: Multiple Linear Regression – Part 1 <br />-&nbsp;&nbsp;Review of simple linear regression model <br />-&nbsp;&nbsp;Parameter Estimate and Interpretation <br />-&nbsp;&nbsp;Residual Analysis <br /> <br />Topic 6: Multiple Linear Regression – Part 2 <br />-&nbsp;&nbsp;Multicollinearity&nbsp;&nbsp;<br />-&nbsp;&nbsp;Hypothesis testing and confidence interval <br />-&nbsp;&nbsp;Evaluate prediction accuracy using test set",
            "comment_teaching": "For Prof. PAN, she is passionate and willing to answer our questions even stupid ones in or after classes. Though her tone is a bit weird, it didn't affect a lot as she doesn't have a strong accent compared to other Profs that are also from the mainland. I think it's because she can speak Cantonese too.&nbsp;&nbsp;Besides, she is willing to answer students' questions in 3 different languages.<br /><br />For the TA, his teaching is okay, just moderate. He spoke at a slow pace and in a boring tone that makes me feel it was a waste of time to have a tutorial in real-time mode, so I just watched the recording in 2x speeds afterwards. I think it's a more efficient way as I can have more time to do the exercise on the tutorial material and skip some nonsense.&nbsp;&nbsp;However, he is willing to answer the questions and give out some tips on HW.",
            "comment_grading": "Your grade in the course is based on: <br />Lab assignment 26%, Final exam 50%, Class <br />participation 24% and Peer evaluation. <br /> <br />Lab Assignment 1 <br />(3 students/group, deadline: week 5)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;16% <br />Lab Assignment 2 <br />(3 students/group, deadline: week 7)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10% <br />Final exam <br />(individual, Multiple choice, 1 hour, open book)&nbsp;&nbsp;&nbsp;50%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />Class participation <br />(In-class exercise, multiple choice)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;24% <br />depends on the score, but no need full mark <br />Peer evaluation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Downgrade when necessary<br /><br />My score:<br />Lab Assignment 1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;45/45<br />Lab Assignment 2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;60/60&nbsp;&nbsp;&nbsp;&nbsp;<br />Class participation <br />All full marks, cuz they are pretty easy.<br />Final exam 28/30 mean=23.6, sd=4.5<br />-&gt; A+<br />For the final, even though it's quite easy, you need to be very careful cuz getting one or two questions wrong will make a huge difference in your grade.<br /><br />It's advantageous if you've taken ISOM 2500 before. However, I don't think it's crucial cuz I only get C+ in that course.",
            "comment_workload": "There are only two group assignments and one optional assignment to compensate for the absence, not too much. They may seem difficult when you first see them, but as long as you pay attention to the lecture and tutorial, you will find that they are not so difficult since they are similar to the questions taught in the tutorial.<br /><br />However, if you aim higher grade like me, you will have to watch the recording again and mark sth. down as the content is hard to understand. You will also need to review the HW and in-class exercise questions as well as finish the weekly exercises. After that, you will be well-equipped for the final exam.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nPccmICpyzA4bzeO3E9nudDfxVaKdmTz",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DaisyDuck",
            "date": "Aug 23, 2022",
            "title": "96 only B+",
            "comment_content": "It is not entirely related to Python. But if you need to memorize the thing form ISOM 2020.",
            "comment_teaching": "She was willing to teach and explain the concept again and again, but she taught quite fast. You need time to understand what she said. Overall speaking, she is a good instructor.",
            "comment_grading": "I got almost full mark at around 96, but I only got a B+. <br />If you aim a range, you must get around 97 or above.",
            "comment_workload": "There were quizzes for every lectures, but it is quite easy. If you are willing to finish the after class exercises, you can get high mark.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uMfx9uHTkJBX5sGVp13sQqTir3pYhKGk",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rexxxxxxx",
            "date": "Aug 23, 2022",
            "title": "",
            "comment_content": "Topic 1: List, Array and Graphing<br /><br />Topic 2: Pandas and Data Processing<br /><br />Topic 3: Clustering – part 1<br />- K-means<br /><br />Topic 4: Clustering – part 2<br />- Hierarchical clustering<br /><br />Topic 5: Review of SLR &amp; Multiple Linear Regression – Part 1<br /><br />Topic 6: Multiple Linear Regression – Part 2",
            "comment_teaching": "The teaching is okay. Prof PAN's explains the content clearly, and she will answer your question whatever you have.",
            "comment_grading": "Fair grading.<br /><br />Lab Assignment 1 - 16%<br />Lab Assignment 2 - 10%<br />Final exam - 50%<br />Class participation - 24%<br /><br />Full in Lab Assignment and Class participation, Final exam 26/30 and get B+. (28/30 for A+)",
            "comment_workload": "The workload is fine. Online quizzes every week, two group Assignment and a final exam.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bUeVMgBnrR1pjfIfAEAE0hm1WzbDN7fS",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "blue :)",
            "date": "Jun 13, 2022",
            "title": "Super bad grading",
            "comment_content": "Topic 1: List, Array and Graphing <br />- List<br />- array<br />- Graphs<br /><br />Topic 2: Pandas and Data Processing<br />- Missing data<br />- Data slicing<br />- Feature engineering<br /><br />Topic 3: Clustering – part 1 <br />- K-means<br /><br />Topic 4: Clustering – part 2<br />- Hierarchical clustering<br /><br />Topic 5: Multiple Linear Regression – Part 1<br />- Review of simple linear regression model<br />- Parameter Estimate and Interpretation<br />- Residual Analysis<br /><br />Topic 6: Multiple Linear Regression – Part 2<br />- Multicollinearity<br />- Hypothesis testing and confidence interval<br />- Evaluate prediction accuracy using test set",
            "comment_teaching": "The teaching is okay. Dr. Baoqian PAN explains the codes clearly and the content is easy to understand.",
            "comment_grading": "The grading is unreasonable. <br /><br />Lab Assignment 1 (3 students/group) - 16%<br />Lab Assignment 2 (3 students/group) - 10%<br />Final exam (individual, Multiple choice, 1 hour) - 50%<br />Class participation (In class exercise, multiple choice) - 24%<br />Peer evaluation - Downgrade when necessary<br /><br />I scored 100% in Lab Assignment 1, Lab Assignment 2, and Class participation. In final exam, I scored 26/30 (~87%). Hence, I scored 93.33% overall and managed to get a B+. Very Very disappointing.",
            "comment_workload": "The workload is fine. Only several in-class MC exercise and 2 lab assignments. The assignments are not difficult as the questions are all taught in the lab section. If you pay attention in class and lab you will be fine.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CZ3rWpe9TLOrzpmO0vFnWGDLDSTNJD8b",
            "semester": "2021-22 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Yomogi",
            "date": "Jun 08, 2022",
            "title": "",
            "comment_content": "Learn how to plot graphs and analyze them. A lot codes but till now I still have no idea which line of code performs which function.",
            "comment_teaching": "You can get good grades just by the lecture notes and class exercises. <br /><br />The teaching is fair.",
            "comment_grading": "Simple but tricky questions in the final exam are the only concern in this course.<br /><br />Starting from around 20 marks in the final exam (supposed you got full marks in assignments which is super easy), around 1 mark for a grade. <br /><br />Look, I am an optimistic guy, so I would say it is quite chill to get high marks if you do the revisions and be careful enough in the exam. <br /><br />Get a B+ with a little bit higher than the mean in the final exam. You can do better than me.",
            "comment_workload": "Relax!!! After all, it is just a 1-credit course.<br /><br />Unlike its sister course (ISOM 2010), this course is all about understanding, not coding skills anymore. <br /><br />In the first lesson, I bet you will be like &quot;What the heck am I learning?&quot;. But believe me, you will find the assignments and exams really easy afterwards as all the questions are just another variation of what included in the notes.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nt1XSOB3ZVFdhDoTDuFsTu0SNIShA7Fs",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nononope",
            "date": "May 24, 2022",
            "title": "great course, very insightful, feels very demanding but isnt really",
            "comment_content": "Great introductory course into Business Analytics through python, it revolved a lot around statistical models and python libraries to sum it up - very insightful if you're into BA or IS<br /><br />Topics to familiarize yourself with if no coding experience - <br /><br />lists, arrays and graphs, pandas and data processing, clustering (k-means and hierarchical clustering), multiple linear model (parameter estimates and interpretation, residual analysis, multicollinearity, hypothesis testing and confidence interval)<br /><br />also better to brush on some ISOM2500 concepts - will come in handy",
            "comment_teaching": "prof gave her best and was very kind and attentive to everyone and made all concepts clear - she also knew what she was doing - she may seem like she is going fast but this is what she said to me - you don't have to know how to do everything she teaches - you just need to know how it work and interpret it, that was the game changer for me<br /><br />TA was also pretty nice i heard he helped a lot with the group assignments and the questions in it, very fast with replying as well",
            "comment_grading": "Group Lab Assignment 1 - 16% <br />Group Lab Assignment 2 -10% <br />Class Participation - 24% <br />Final Exam (MCQ -1 hour) - 50% <br /><br />the final was pretty nice and fair tbh - it was variances of the weekly MCQs and i didn't have trouble with it - again it is 10x more manageable than ISOM2020 and will not make you pull your hair out <br /><br />i'm predicting B to A- range - didnt study much for the final",
            "comment_workload": "workload was very minimal - i would say 10x better than the joke of a course called ISOM2020 (do checkout that review of mine)<br /><br />class participation was easy - you make sure to attend all classes and then do the in-class MCQ on canvas in a break out room i got nearly 100% for all, the lab assignment was also pretty straightforward if you follow what the lab says and listen attentively and ask questions you can get 100% - although it seemed very challenging at first",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ww1NFazok9qoldqRz0ElCKiamERwKTvM",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bruhhhh",
            "date": "Feb 02, 2022",
            "title": "Disaster",
            "comment_content": "Topic 1&nbsp;&nbsp;Pandas and data processing<br />Topic 2&nbsp;&nbsp;Exploratory data analysis<br />Topic 3&nbsp;&nbsp;Statistical inference<br />Topic 4&nbsp;&nbsp;Application of regression in business analysis<br />Topic 5&nbsp;&nbsp;Identification of business pattern with clustering (deleted)<br /><br />As a 1 cred course, this is totally disaster. This course is taught at the second half of the semester so anyone would expect the content of this course to be half of that of 3 cred course. However that was not the case. The content is just way too much for a 1 cred course! It should instead be a 3 cred course. The content is also much harder than that of ISOM 2020 and kind of hard to understand.",
            "comment_teaching": "Prof Wan has a bad accent which greatly affects the delivery. The course content is also too much to be covered in merely half a semester. As a result, the pace of teaching is just way too fast and it greatly affects the delivery of knowledge. <br /><br />That being said, he is still a good professor who is willing to answer your question. If the pace can be slower and he could improve his accent, it would be much better",
            "comment_grading": "A. 1 assignment (30%)<br />B. Final Exam(60%)<br />C. Attendance(10%)(IPRS)<br /><br />Surprisingly, the grading this semester is quite good. Everyone should get full mark for attendence. My assignment and final exam just barely reach the mean and I got a B+ at last. Not to mention I didn't finish all lecture recordings and sit the final exam with zero knowledge of topic 3 &amp; 4.",
            "comment_workload": "The workload is very low tbh. No weekly assignments but just 1 final assignment to be handed in before final exam. The TA will teach you how to do it. You can also just copy from your friends (I do this).",
            "rating_content": 1,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zS4ZkgHpCK6Qyb9assts46WR5UcqqMI2",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                },
                {
                    "id": 1479,
                    "name": "LI, Juncheng",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hyang",
            "date": "Jan 27, 2022",
            "title": "",
            "comment_content": "The content is quite useful. Professor emphasizes the connection between coding and real-life examples. It would be easier to follow if you have a firm statistic foundation (ISOM2500).<br />Course Organization<br />\u000f Topic 1: Pandas and data processing<br />\u000f Topic 2: Exploratory data analysis<br />\u000f Topic 3: Statistical inference<br />\u000f Topic 4: Application of regression in business analysis<br />\u000f Topic 5: Identi\fcation of business pattern with clustering",
            "comment_teaching": "Professor is experienced in this field and good at teaching. The TA was very responsive and patient to our questions.",
            "comment_grading": "A. 1 assignment (30%. )<br />B. Final Exam(60%) <br />C. Attendance(10%)(IPRS)<br /><br />Final exam:<br />-Full marks: 30<br />-Mean: 14.8<br />-SD: 4.3<br />-Median: 14<br /><br />My grade:<br />-Assignment: 30/30<br />-Final: 18/30 (36/60 adjusted for weighting)<br />-Attendance: 10/10<br />-Total: 76/100<br />Letter grade: A",
            "comment_workload": "The assignment is a project designed within a financial context, it was pretty challenging to do it individually, but the answer was elaborated thoroughly in the tutorial.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eDC3xlafY31TLqh3pqcZsUyxQ9SJ4Lqd",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 0
                },
                {
                    "id": 1411,
                    "name": "MAK, Chun Cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "abby034",
            "date": "Jan 25, 2022",
            "title": "Totally different from Isom2020",
            "comment_content": "Topic 1: Pandas and data processing<br />Topic 2: Exploratory data analysis<br />Topic 3: Statistical inference<br />Topic 4: Application of regression in business analysis<br />Topic 5: Identification of business pattern with clustering",
            "comment_teaching": "Really bad. His voice was not projected clearly with the microphone. And he talked about things that are out-syl. I didn't really know what are points to note and what are irrelevant. He did not allow much time for practice, most of the time he just typed directly on Python or used jam board to draw. <br /><br />He was basically reading the slides so make sure you revise the slides (I would say each time lesson ends, cuz you will easily forget what he taught)<br /><br />Attendance required. iPRS is used for counting participation.",
            "comment_grading": "Fair grading.<br />Only 1 individual assignment and the final exam. Final exam all MCs.<br />Both have a high mean.<br />For the individual project, make sure you ask TA for help. And attend the labs. Some answers are directly taught or typed in lab materials.",
            "comment_workload": "Light workload.<br />Only the project and final exam.<br />I did not really pay attention to his lectures, and only attend lab sessions.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MsWHbYdaFMvITLkkUQfjT1ij81UPr990",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yl2",
            "date": "Jan 25, 2022",
            "title": "",
            "comment_content": "Topic 1&nbsp;&nbsp;Pandas and data processing<br />Topic 2&nbsp;&nbsp;Exploratory data analysis<br />Topic 3&nbsp;&nbsp;Statistical inference<br />Topic 4&nbsp;&nbsp;Application of regression in business analysis<br />Topic 5&nbsp;&nbsp;Identification of business pattern with clustering (deleted)",
            "comment_teaching": "He is nice and is willing to answer your questions. But his accent is&nbsp;&nbsp;a bit hard to understand.<br /><br />TA is helpful and you can ask him about the assignment.",
            "comment_grading": "Fair<br /><br />10% attendance<br />30% individual project<br />60% final exam",
            "comment_workload": "Only one assignment (4 parts)<br />They canceled the fourth part because topic 5 is not taught , so we just need to finish 3 parts only.<br />you can copy the code from the lab, so the workload is&nbsp;&nbsp;not that high",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6bQdIxdC3npsZAmltITHM4TILqUwIAva",
            "semester": "2021-22 Winter",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "lyy1216",
            "date": "Jan 22, 2022",
            "title": "Bad teaching and really hard project",
            "comment_content": "The course teaches hard and complicated coding. <br />Needs to attend 80% of the class otherwise will have marks deduction.<br />They compiled a tons of topics and contents into a really short period of time (half of the semester).",
            "comment_teaching": "Ugh he almost teaches nothing useful and relevant to the exam. He tells us he self-learned coding and probably thinks we gotta self learn too.",
            "comment_grading": "B",
            "comment_workload": "Online quizzes every week, an individual project and a final exam.<br />The project is extremely hard, made us really confused also very time-consuming.<br />For the final exam, we need to search and learn almost everything by ourselves.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Zga7ttT4KcGPvRY9T0ADAxVnWPKukrjk",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Hiuchingg",
            "date": "Jan 22, 2022",
            "title": "",
            "comment_content": "Course Organization<br />•Topic 1: Pandas and data processing<br />•Topic 2: Exploratory data analysis<br />•Topic 3: Statistical inference<br />•Topic 4: Application of regression in business analysis<br />•Topic 5: Identification of business pattern with clustering",
            "comment_teaching": "Poor teaching. Failed to teach useful details and skills in python.",
            "comment_grading": "Fair",
            "comment_workload": "A. 1 assignment (30%. ): Students need to work individually.<br />B. Final Exam(60%) (All MC questions)<br />C. Attendance(10%): Students are strongly encouraged to attend the lecture regularly for the good un-<br />derstanding of concepts with the help of Python. You will be asked to try all kinds of pandas skills<br />during the lecture. Attendance of the tutorials are not compulsory.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zLOdHg4nHOMdmFUJjHSIXjKUvUrz33i5",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "xxyyzz",
            "date": "Jan 17, 2022",
            "title": "",
            "comment_content": "Topic 1: Pandas and data processing<br />Topic 2: Exploratory data analysis<br />Topic 3: Statistical inference<br />Topic 4: Application of regression in business analysis",
            "comment_teaching": "He is a good guy as he is very willing to answer my stupid questions, but I could barely listen to him due to his poor accent and messy teaching. I learned most content and how to do the assignment from TA.",
            "comment_grading": "10% attendance (10/10)<br />30% assignment (96/100)<br />60% final (I got 7/30 lol)<br />I think his grading is quite fair considering I am dumb at computer stuff. Got C at last.",
            "comment_workload": "Not much workload considering it a one-credit course. The assignment only consisted of 3 parts (1 part was dropped because of insufficient time in teaching) If you attend the labs, you can finish the homework as the TA was very kind and willing to answer your questions.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "viG0KQFAqsnfBp2i2rd2OGr7yeGp107g",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Matthewww",
            "date": "Jan 15, 2022",
            "title": "",
            "comment_content": "The content is quite useful,but if you only have the basic python knowledge it will be pretty difficult for you, as the course included many library(numpy and I forgot) and it takes time for you to understand all.",
            "comment_teaching": "The professor did a great job,he really care about whether we understand the course,he's also really humorous and will alter the syllabus based on our level and progress.",
            "comment_grading": "easy to get good grades<br />88/100 for final assignment<br />90% for final<br />A+",
            "comment_workload": "only 1 final assignment and 1 final and 70% of the assignment was thought during tutorial so pretty light workload.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HaNLL0UHLuqjVsJcDHYmmkCxhxpLw42p",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KaruizawaKei",
            "date": "Dec 19, 2021",
            "title": "",
            "comment_content": "Topic 1: Pandas and data processing<br />Topic 2: Exploratory data analysis<br />Topic 3: Statistical inference<br />Topic 4: Application of regression in business analysis<br /><br />Topic 5 is deleted due to the time limit.<br /><br />He spent 3 lessons in topic 1, and then one lesson per topic.",
            "comment_teaching": "Mr. Wan is a good guy, but not a good teacher.<br />He knows a lot about programming but he is not good at teaching. He did not follow the lecture material during the lessons. Moreover, both his writing and accent are terrible.<br /><br />However, he is really kind and passionate. He is willing to answer questions so I am not going to give E here.",
            "comment_grading": "The grading is super lenient.<br />30% project<br />10% attendance<br />60% final<br /><br />You can copy the code of assignment during tutorial. It means that at least you would not fail in this course.<br />However, the final is quite difficult. The mean is only 15/30.",
            "comment_workload": "The workload in the beginning is high since I expect to complete the assignment on my own. In fact, the workload is low since the assignment code can be copied during the tutorial. <br />there is only one single assignment.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8i5DWuAm04mXU0SkTwY9qWk8vQbd3cN1",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gnzapmn",
            "date": "Aug 17, 2021",
            "title": "",
            "comment_content": "Topic 0: Introduction (Things learnt in Isom 2500) <br />Topic 1: Introduction to multiple regression <br />Topic 2: Fitting Non-Linear Pattern<br />Topic 3: Variable Selection <br />Topic 4: Classification <br />Topic 5: Clustering",
            "comment_teaching": "Professor Pan is willing to answer questions during and after the lecture. But sometimes she just reads according to the powerpoint slides, so it is boring sometimes.",
            "comment_grading": "Homework (2 python coding asm) : 37.24 / 38<br />Final: 29/30 <br />Class participation: 12/12 (full marks if attend 6 lectures)<br /><br />Final grade: A+<br />Comment: The final exam and homework are easy and straightforward. You can get a very high marks if you have listened carefully during the lecture so don't need to be worry about the grading.",
            "comment_workload": "For a 1 credit course, the workload is very low. There is no any group project or any mid term exam for you to complete. You just need to complete the python assignments that will be taught by the tutors, and the python assignments do not require you to work on a full coding but only just some fill in the blanks in the assignments. So, I think the workload of this 1 cred course is relatively low when you are only required to study for a half semester.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3URFAJoxYdV7IIZscMJe5utVosnxmW8F",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 404,
                    "name": "HU, Inchi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "quant",
            "date": "Jun 03, 2021",
            "title": "",
            "comment_content": "interesting and useful",
            "comment_teaching": "prof Hu is really good at explaining things and his english is really clear and fluent",
            "comment_grading": "nice grading<br />2 assignment + 1 final<br />assignment1 95/100<br />assignment2 99/100<br />final 25/28<br />grade A",
            "comment_workload": "workload is acceptable<br />for the 2 assignment, there are 4 people in a group so on average you need to finish only 0.5 assignment. And you don't have to understand the tutorial very clearly, just copy and paste the codes is enough.<br />for final, it's not hard, but you need to try your best to understand the lecture, watching recording is recommended!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TqEa8m9ost75IY7roZRmcNdnLrhJkCmm",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "belowmeanguy",
            "date": "Jan 19, 2021",
            "title": "WTF is happening",
            "comment_content": "Finished the course, got a B, still don't know WTF did I learn.<br /><br />Prof. Wan's English and mic quality is terrible. ***I heard Prof DU's English is even worse***<br /><br />I really have no idea what is Business Analytics even after taking this course. I think it's not really my problem, since getting a B should mean having a certain level of understanding to the course. But no, wouldn't say I learnt something about BA.",
            "comment_teaching": "Prof. Wan drew illustrations on lecture slides, but the handwritings are terrible my dude. No idea what's going on. Many slides are talking about different equations and stuff, but in fact equations are not tested in this course so you can just skip them.<br /><br />Taking this course is like taking DSE. Just do past papers and practice papers, basically memorise the steps and answers, then you will know how to do the final exam. Don't have to understand any concepts to get at least a B-range. BS to see this in university.",
            "comment_grading": "The course structure is amended probably due to the previous feedbacks. So the grading is much much much more lenient when I took this course. Just two assignments and a final exam. Got 100/100 for both assignments (the means are both 9X/100). There are also two surveys that counted participation, literally surveys, just answering which topic you find difficult.<br /><br />Full mark for both assignments<br />Full mark for participation<br />Final exam was around mean<br />Final grade: B",
            "comment_workload": "I think UST is still finding a way to improve this course structure. The previous students were struggling like hell, and my semester was quite easy, in terms of workload. The workload was lower than I expected. The two coding assignments are just basically fill-in-the-blanks questions lol. But they do include questions about concepts.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FuQd9sTSLxfURU3bJAkImodKsg1GmbU3",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jask",
            "date": "Jan 19, 2021",
            "title": "",
            "comment_content": "",
            "comment_teaching": "Her tone may be a bit boring, but she really did a great job in helping us catch up a lot of content, like reviewing what is taught in ISOM 2500 (class attend long long time ago) which is highly related to the content of ISOM 2600 and explaining the difficult part again and again.",
            "comment_grading": "3 assignments<br />1. 100/100<br />2. 96/100<br />3. 100/100<br /><br />final exam: 80%<br /><br />grade: A",
            "comment_workload": "this is an intensive course which is ended in 5 weeks approximately. <br /><br />workload is acceptable, with three assignments and a final exam.<br /><br />those assignments will be able to finish and get full mark if you attend all the lab sessions, so don't worry.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bEXxj69wDm20dpvKVF3DVP2WrPYfUdu8",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "apky",
            "date": "Jan 18, 2021",
            "title": "",
            "comment_content": "Topic 0: Review of Linear Regression and Introduction to Data<br />Topic 1: Multiple Linear Regression Model<br />Topic 2: Regression for Nonlinear Pattern<br />Topic 3: Model/Variable Selection<br />Topic 4: Classification Analysis<br />Topic 5: Clustering Analysis<br /><br />It's a more in-depth discussion based on ISOM 2500, not too related to coding. <br /><br />The coding part learnt from lab session will not be examined in the final exam.",
            "comment_teaching": "It is quite hard to hear what he was saying, as his accent is bad. He would also write a bunch of equations on a piece of paper apart from the lecture slides which is not too useful. I did not attend his real-time lecture at all, self studying is adequate. <br /><br />One thing I appreciate is he make final revision notes, which is quite useful.",
            "comment_grading": "3 assignments (40%. 10%,15%,15% )<br />The last assignment turned out to be just 2 MCQ only<br /><br />Final Exam(55%)<br /><br />Attendance(5%): Two online surveys",
            "comment_workload": "Workload might be more than a normal 1 credit course. However, the homework is quite straight-forward: most of the questions are just copying the codes from the lab materials, but require a bit of modification.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QxkC5Vxsgz0lZuw8YonaOljfOnsEaDGn",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "太監",
            "date": "Jan 16, 2021",
            "title": "",
            "comment_content": "• Topic 0: Review of Linear Regression and Introduction to Data<br />• Topic 1: Multiple Linear Regression Model<br />• Topic 2: Regression for Nonlinear Pattern<br />• Topic 3: Model/Variable Selection<br />• Topic 4: Classification Analysis<br />• Topic 5: Clustering Analysis<br /><br />Content wise, though they say it is so what related to coding but it is actually more related to math especially statistic.<br />The content/concept itself are not so hard to understand given that you read the notes(plus you might have to search google for more detailed explanation)<br /><br />Also, though it is required for you to learn some coding on lab, they will only required you to use them on HW and not included in exam. <br /><br />I personally think it is more like ISOM 2500 than ISOM 2020",
            "comment_teaching": "His note are fine, also it is nice of him to provide revision note at the end of the semester. Though he may add so note during lecture(writing some formula in the blank space), it is just for explaining and I found that I can understand the note without them. Even if you can't understand, you can always search google(it is easily find anyway)<br />However, the biggest problem of his teaching I have to say is his accent. It is quite hard to understand especially when you trying your best to understand these number while listening to him during the 2 hour lecture. It took quite some time to get used to his tone.",
            "comment_grading": "A. 3 assignments (40%. 10,15,15 ): Students are allowed to work individually or in group (group size ≤ 3).<br />All are required to submit on canvas.<br />B. Final Exam(55%):<br />C. Attendence(5%): Two on-line surveys .<br /><br />HW: all full mark (very easily, just follow the lab note)<br />final exam : 197/355 (mean : 165.9)<br />Grade : B+<br /><br />I think the grading is decent. He told us before the exam started that the exam paper is hard and if we can get half of the Q right, we can get a decent grade (I guess he mean B?). Given that the highest score of the exam is only 260 (only 75%) and I only got around 57% score and got a B+ , he is pretty generous.",
            "comment_workload": "light compared to other course, but definitely higher than a 1 credit course should be.<br /><br />HW are easily given you attend the lab, the HW question is almost a direct copy of the lab. There is some conceptual short question need to be done but it is still easily as you can find the ans from lecture notes easily.<br />The thing that takes me quite some time is the practice paper. It is almost the same as the final exam so I spend quite some time doing it and understanding.&nbsp;&nbsp;It is not easily like the real exam so I was worried and spend more time than I should. It was a huge relief when he said we can still get good grade for getting half of it right though.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xd0jfM3zAE39bIiNn65NYpuGfxXNmBgX",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Thomas_128",
            "date": "Dec 13, 2020",
            "title": "",
            "comment_content": "1.Introduction to Multiple Regression<br />-Multiple regression<br />-Inference, Prediction, and Model checking<br /><br />2.FittingNonlinear Pattern<br />-Log-transformation<br />-Quadratic regression<br />-Use Indicator and Interaction variables in regression<br /><br />3.Model Selection<br />-Best subset, Forward selection, Backward elimination, and Stepwise selection<br />-Model evaluation: Adjusted R-squares, Cp, AIC, BIC<br />-Training set and Validation set, Cross-Validation<br /><br />4.Classification I<br />-Evaluation Criterion for Classification<br />-Accuracy Score, Kolmogorov-Smirnov test, and Area Under the Curve (AUC)<br /><br />5.Classification II<br />-K-Nearest Neighbors Classifier<br />-Naïve Bayes Classifier&nbsp;&nbsp;&nbsp;<br />-Logistic Regression<br /><br />6.Clustering Analysis<br />-K-means Clustering<br />-Hierarchical Clustering<br /><br />It doesn't connect with isom2020 very well, its more about isom2500.<br />Please revise the regression part of isom2500 before studying this course, or else it will be super hard for you.<br /><br />It is a 1 credit course, you need to finish ALL the things in half semester, which is super difficult, please try your best to get a B range :)<br />Also try not to waste too much time on it, it just don't worth.",
            "comment_teaching": "Du Lilun has a VERY strong accent, cannot hear clearly and cannot understand what is he talking about.<br />Also, his slides are not very well prepared.<br />Sometimes students ask him things in class, he cannot answer or he cannot answer or explain clearly.",
            "comment_grading": "4 Assignments, 10% each<br />Participation 10%<br />Final 50%<br /><br />All assignments full mark<br />Parti full mark<br />Final mean<br />Grade B-<br /><br />The grading is fair.",
            "comment_workload": "Very high workload, 4 group assignments in total. Need to use python to finish the hw, which WILL NOT BE TESTED IN finals.<br />Wasting your time.<br />Although you won't understand anything in class, you still need to attend lectured because participation is required.<br />It is a 1credit course, but workload and difficulty is like 3 credits or even more :)",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KPhuws5cCkHdbSusosRqXqqSreZq5f4C",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 0
                },
                {
                    "id": 401,
                    "name": "LEE, Wai Hong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ctyw",
            "date": "Sep 01, 2020",
            "title": "",
            "comment_content": "Advance course on ISOM 2500. Originally there are 5 topics including <br />1. Multiple Regression<br />2. Fitting non-linear pattern<br />3. Variable selection<br />4. Classification <br />5. Clustering<br /><br />However, due to the wide teaching syllabus, Prof Wan was not able to finish all of the contents. Only topic 1-4 were tested in the final.<br /><br />As this course will be taken in the second half of the semester, ie there are only 7 lessons, I think it is impossible to finish all of the contents. In most cases, prof. just directly skipped the contents.<br /><br />Tutorials sessions are included. To me, it is USELESS as the TA will only teach you how to use coding for your assignments.",
            "comment_teaching": "Prof Wan is passionate in teaching, he is willing to answer all our questions as well as holding extra Q&amp;A sessions for every single lesson. However, it is hard for me to fully understand what Prof. Wan is talking about because of his accent. But i guess no one will attend the lectures if there is no participation marks.<br /><br />TA is nice and helpful with the assignments.<br /><br />In fact, collaboration between professors and TAs is horrific. During lecture time, professor kept on mentioning that coding needed to be tested in final, while TA said no coding is needed for final.",
            "comment_grading": "(50%) Final<br />(40%) Assignments (4 in total)<br />(10%) Participation (by doing in class polling) <br /><br />Everyone will get full mark for participation.<br />The total mark for each assignment is 100, in which if you hand in the assignment on time you will get 90, for the remaining 10 marks, it will determine by the accuracy of your assignment.<br /><br />My score:<br />assignment: 40/40<br />participation: 10/10<br />final: ~29/50 (58%)<br />grade: B+<br />Practise questions will be given for you to prepare your final exam. 1/2 questions asked in final are similar to those in practise questions. Final only consisted short questions.",
            "comment_workload": "The workload of this course is horrible. You need to take at least 5 hours for each assignment, including understand the coding and lecture notes. Make sure you find a friend who is familiar with coding for the assignment.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OFOCIMd1C2o5EYfQU2UcOJDMBH7DDv8v",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wolfheart",
            "date": "Jun 15, 2020",
            "title": "1 credit course can be a blessing or a curse",
            "comment_content": "Look at &quot;Course Outline 2020&quot; for lesson details.<br /><br />Overall, I found this course difficult. It is harder than even both prerequisite courses, ISOM 2500 and ISOM 2020, combined. Covering all this content in half a semester is plainly preposterous. This part should be especially reworked.<br /><br />Logic behind the theories and concepts make sense after looking at the lessons over and over again. I am not mathematically-gifted and I hate statistics with a burning passion.<br /><br />It doesn't help that those taking this course in spring semester are from Pathway 2 so they are typically more proficient in math, and I traded my soul for a decent grade in this course.&nbsp;&nbsp;:)",
            "comment_teaching": "Kris is, without a doubt, a very good professor. She explains in a clear manner and offers to answer questions in Cantonese, English, or Mandarin. She also offers reasonable explanations and can easily give you that aha! moment to understand the concepts.<br /><br />Lab teaches the part on coding the statistics (the lessons) into Python. &quot;Teaches&quot; is a compliment that the labs don't deserve. Trust me, you only need the files with the code for the lab. Skipping the weekly 50 minute lab has no effect whatsoever on the final exam (which doesn't use Python) or the assignments.",
            "comment_grading": "Components:<br />[40%] 4 weekly coding+stat assignments <br />[10%] Attend 5 out of 6 videos with video on 80% of the class<br />[50%] Final exam<br /><br />My Scores:<br />Assignments out of 100 (100,98,100,100)<br />Attendance (full)<br />Final: 88/130 (mean: 77.9/130, sd: 23.1)<br /><br />Scored B+ for this course and let me just say, the effort isn't worth the grade. In this sense, this course can be a blessing or a curse - a blessing if you mess up or a curse if you try so hard to understand the syllabus and use up time for other more important courses. At least I'm done with this course.",
            "comment_workload": "Absurd. The weekly assignments make you disregard the time that should be allocated for courses with more weighting. Additionally, you just copy and slightly tweak the codes for the prompts given in the assignments. But then, I tried to understand the meaning of the codes and this consumed weekends. By the end of the course, you'll learn only to copy paste codes and not exactly code the statistics from scratch because it's too long.<br /><br />Assignments are weekly and done in groups of 3, and you're free to choose your groupmates. With most scoring well (90+) in assignments, it doesn't matter though. The final exam had crazy time pressure. When I scanned the questions upon receiving it, I knew I wouldn't finish. I didn't even know if I typed the equation free from errors in Excel. I couldn't even read the questions properly. <br /><br />For 1 credit, this course takes the crown for most stressful course.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "nGYnU5rX43DMFWEqAWGIXcdFyQ7Zvn1f",
                    "name": "Course Outline 2020",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "bOG3gc0QnNe59TisOePTIwqtq1OHG3pb",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "K&K",
            "date": "Jun 15, 2020",
            "title": "Introduction to business analytics",
            "comment_content": "please refer to the syllabus others have posted.<br />The content might be a little hard to understand but it really caters to you if you are interested in business analytics. This course will be taught at the second half of the semester.",
            "comment_teaching": "Kris teaches really well! She could speak English, Cantonese and Mandarin so you can always ask question with your mother language after class. Her teaching is very detailed and almost explains everything you don't understand. Listen to the class carefully and take notes! You will fall in love with BA if you take her course. Feel free to ask her anything you are not sure of.<br />The tutorials teach you about applying python to BA. Don't worry if you can't understand the TA... You can finishh the assignments even if you don't go to the tutorials.",
            "comment_grading": "attendance 10%<br />four group assignments 40% (about coding)<br />final exam 50% (about lecture contents, coding will not be tested)",
            "comment_workload": "Not much mandatory workload except for the assignment. The assignment might be a little time-consuming because of coding.<br />You need to review the lecture slides in time for better understanding.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Mqdds6P2l7xGZxf7H7sWtqbClULgqoIs",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 404,
                    "name": "HU, Inchi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ypoons9",
            "date": "Jun 12, 2020",
            "title": "",
            "comment_content": "Introduction to multiple regression<br />Transformation and interaction of variables<br />Regression model selection<br />Classification and supervised learning I<br />Classification and supervised learning II<br />Clustering and unsupervised learning <br /><br />This is a six-week course so the content is not too much. This course requires knowledge based on ISOM2020 and ISOM2500 so it will be much easier if you have good understanding of these two courses.",
            "comment_teaching": "Prof Hu is very goooood! He is nice and patient. Many of us told him we wanna give up on this course at first, then he encouraged us to keep it up and helped us a lot. He kept asking us whether we get any questions and organized some Q&amp;A meetings after class. He also explained those concepts clearly and his accent is not bad.",
            "comment_grading": "Assignments(40%)<br />Attendance/Participation (10%)<br />Final examination(50%)<br /><br />Assignment 1 100/100 (mean: 95.4)<br />Assignment 2 100/100 (mean: 95.2)<br />Assignment 3 100/100 (mean: 92.3)<br />Assignment 4 100/100 (mean: 95.1)<br />Final 46/65 (mean: 36.2)<br /><br />Grade: A-",
            "comment_workload": "The workload is moderate if you get good groupmates. I got great groupmates and we helped each other so we can always finish our work on time. Also, feel free to ask TA and prof if you have any questions, they are pleased to answer.<br /><br />There is lab session but I didn't attend it as it is useless. You can just copy some codes from the lab materials to finish the assignments. You don't have to understand what are the codes doing, just copy them and they will not be tested in the final.<br /><br />Personally, I would say the workload of ISOM2020 is much heavier than this course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "B4d4Ydoeix1VoeLLu7cgeYMx3gJrvcHa",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                },
                {
                    "id": 1411,
                    "name": "MAK, Chun Cheong",
                    "rating": 1
                },
                {
                    "id": 401,
                    "name": "LEE, Wai Hong",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "好好學習",
            "date": "Jun 12, 2020",
            "title": "",
            "comment_content": "Lecture: Useless. Abstract introduction to business analytics. No technical stuff.<br /><br />Lab: Very useful. Use Python to do various analyses. Quite technical and practical.",
            "comment_teaching": "Instructor: SO-SO. She sounds really like a high school teacher, which makes us really bored and sleepy.<br />TA Isaac: Very good and responsive. Nice instruction on the assignment and lab content. Patient response to our email inquiry.<br />TA Elvis: Not helpful. Valueless responds to email question.",
            "comment_grading": "Fair.<br />Above 1 sd in final.<br />Few points deducted in 4 assignments.<br />Final grade: A-",
            "comment_workload": "Extremely high.<br />Spend at least 3-4 hours for every assignment.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "u3kC4uGjC4ahug7z3UAhrEw2XQVgmQnx",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1600,
                    "name": "YIN, Zhendong",
                    "rating": 0
                },
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Potatone",
            "date": "Jun 09, 2022",
            "title": "SHIT TA who is named YIN Zhendong",
            "comment_content": "6 topics<br />last 2 topics related to isom2500(regression)",
            "comment_teaching": "I simply really want to say this TA!!!!!!!!!!! He has no idea how to teach; in the lab, he simply enters the code rapidly, oblivious to the fact that we are only at the beginning of our coding journey. He speaks at his own pace, which I am unable to keep up with. He deducts our group's marks for the assignment because our group work didn't display the output (the requirement of the asm is the code), claiming that he can't evaluate whether our code is right or not without the output, despite the fact that we handed in an ipynb file... <br /><br />In the lab, I expected to practice more of the python code that had been taught in the lecture(like isom2020), but the pace of the lab was even faster than the lecture, and I literally learnt nothing.",
            "comment_grading": "Overall score got around 90%, B",
            "comment_workload": "3 credit course workload",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "I0vth1VhnhRCVpikNSaSTw5uFHQU1bez",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yoyo.y",
            "date": "Dec 18, 2021",
            "title": "",
            "comment_content": "Topic 1: Pandas and data processing<br />Topic 2: Exploratory data analysis<br />Topic 3: Statistical inference<br />Topic 4: Application of regression in business analysis<br />Topic 5: Identification of business pattern with clustering<br /><br />Topic 1 and 2 are quite easy because the Prof spent about 3 to 4 lessons to teach. For Topic 5, I think it is quite hard to understand.",
            "comment_teaching": "A bit boring. Some teaching is chaotic that sometimes the Prof did not follow the ppt to teach. More importantly, he always forgets where he stops in the previous lecture so some concepts may be missed. If you have friends in other sessions, it would be better.",
            "comment_grading": "1 individual assignment (30%)<br />Final Exam(60%): All MC questions about Topic 1 to 5<br />Attendance(10%): total 6 lectures<br /><br />My grade:<br />Assignment: 28.5/30<br />Exam: 40/60 (Total 30 MCs)<br />Attendance: 10/10<br />Total score: 78.5/100<br />Grade: A<br /><br />For another session: Total score: 81/100: Grade: A+",
            "comment_workload": "Only have one individual assignment. However, the assignment is quite difficult that you need to write a program about a prediction on stock price by using the knowledge from Topic 1 to 5. Luckily, the TA has taught you how to do the assignment and has zoom recordings for you to follow to type the program. ^-^",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IIjQXCzrUhn9JKCpw9Q5TyZPQP6Mgjyb",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cai仔",
            "date": "Dec 16, 2021",
            "title": "",
            "comment_content": "because all lectures were taught by him, he adjusted the syllabus to a large extent. students almost needed to know how to write code in the panda, and only with a few new concepts in statistics. ( a lot of knowledge comes from isom2500, but need to know the coding.) and we were taught the panda for three lectures.",
            "comment_teaching": "he is a very nice person and he is very friendly and has two consulting timeslots to answer students' questions.&nbsp;&nbsp;however, it is not helpful. because he put a lot of content in his materials and some of them are not covered, you could not easily find the scale. and I thought he did not explain the concepts clearly.",
            "comment_grading": "assignment 2/2<br />project 98/100<br />final: 24/25<br /><br />grade: A+",
            "comment_workload": "very huge for a one-credit course. need to understand the underlying logic behind the coding, you need to try and write them in person. however, it was not taught clearly in the course, he only run the course and add some new coding in the blank. <br />the TA is very helpful and I studied a lot from him.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "r1e73euhwTqTYXjAHvuMnbrIqQVqSJTy",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Brown",
            "date": "Sep 06, 2021",
            "title": "",
            "comment_content": "Topic 1:&nbsp;&nbsp;Multiple Linear Regression Model<br />Topic 2:&nbsp;&nbsp;Model/Variable Selection<br />Topic 3:&nbsp;&nbsp;Classification Analysis<br />Topic 4:&nbsp;&nbsp;Clustering Analysis",
            "comment_teaching": "He tried to explain the content in detail, but due to time limitation, he could not go so deep. His handwriting by writing with was hard to see. He is a passionate teacher.",
            "comment_grading": "50%) Final<br />(40%) Assignments (2 in total)<br />(10%) Attendance<br /><br /><br />My score:<br />assignment: both 100/100<br />participation: 10/10<br />final: ~27/30 <br /><br />Grade:A-<br /><br />Copy and paste and change a little bit will make score really high mark or even full marks in the assignments.<br />Just attend all lectures and the 10% will be in your bag.<br />Do the past papers provided before exam as the questions are very similar to the practice one.",
            "comment_workload": "not too much. just refer to the lab notes and you can finish the assignments. Copy and paste and change a little bit will make score really high",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "At930I9BOCxYghqquC7TV7LK0YrMlTNz",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kky830",
            "date": "Aug 31, 2021",
            "title": "",
            "comment_content": "Intro to Multiple Regression <br />Fitting Non Linear Regression <br />Variable Selection <br />Classification <br />Clustering",
            "comment_teaching": "She gives many examples to illustrate some concepts and willing to answer questions from chatbox immediately. <br /><br />Have to open camera to take attendance. <br /><br />Group assignments will be either assigned by prof / form by yourself ( she will open a poll to decide the grouping method) <br /><br />Overall her teaching is acceptable and her English is ok to understand.",
            "comment_grading": "Overall A<br />- 2 group assignments 100/100<br />- Exam 27/30",
            "comment_workload": "This course workload is not that much since it has been modified. <br />There are only 2 group assignments and one final exam. <br />And the final exam is 30 mc question. Some of the questions are quite similar with the sample exam paper.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dAffRFwjuDATiqT4Oq0wVIIWl1SkLjjj",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                },
                {
                    "id": 401,
                    "name": "LEE, Wai Hong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "御坂18520",
            "date": "Aug 26, 2021",
            "title": "Useful 1 credit course",
            "comment_content": "Very much similar to content in ISOM2500.<br />• Topic 1: Multiple Linear Regression Model<br />• Topic 2: Regression for Nonlinear Pattern<br />• Topic 3: Model/Variable Selection<br />• Topic 4: Classification Analysis<br />• Topic 5: Clustering Analysis<br />Which are all VERY IMPORTANT in business analysis.<br />The LAB part teach how to use Python program to realize the 4 topics. Since pandas and numpy is very complex, this part is not include in the final, but still very useful!<br />I think this course worth 3 credits but it only take 1!",
            "comment_teaching": "Prof. WAN, Xuhu can explain the content very clearly and detailedly. His Pronunciation is not very recieved but not too diffcult to understand.<br />He is willing to answer questions(even questions that exceed the course range) and he hold extra Q&amp;A sessions for a few topics. By taking his course I really learn something that is useful.<br /><br />The LAB section is not very necessary since the content is not tested in the final, but I think the TA do a very good job in explaining every line of code.",
            "comment_grading": "This course is really a good grade course.<br /><br />10%Attendence<br />40%2 Assignments<br />50%Final<br /><br />Final cover only lecture part, so it is not diffcult,<br />and the mean is very high.<br /><br />Assignment 1(99/100)<br />Assignment 2(100/100)<br />Final (29/30)<br />Grade: A+",
            "comment_workload": "2 Assignments - Quite appropriate for 1 credit course<br />The assignments are in the form of filling python code, since you only need to fill a few lines of code instead of&nbsp;&nbsp;&nbsp;coding for the whole program, it is quite easy to finish.<br /><br />It is also allowed to solve the assignment in group, so if you are not good a python just throw the assignments to your friends or whoever~",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pUPUvWlc0LqVnSPSyrKBQofo0A18l4jU",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                },
                {
                    "id": 1373,
                    "name": "TONG, Chun Ho",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "easonl",
            "date": "Aug 24, 2021",
            "title": "",
            "comment_content": "Please refer to other review for those topic.<br />Besides the topic 0-5, Python will also be taught by TA but Python will only appeared on Assignment, won't be tested on examination.",
            "comment_teaching": "Instead of other reviews mentioning boring, I think Kris (Baoqian PAN) is teaching quite good.<br /><br />However, the TA teached quite poor. It seems there are too much content to teach for the Python. ISOM 2020 are teaching Python step by step so that you can understand very clear. But here, the TA just speak many things that you are impossible to follow. I would say the tutorial is useless for your assignment.",
            "comment_grading": "Two group assignment (3 students/group), mainly Python but also some content about the Lecture. You are not supposed to understand the Python but only using those tutorial python file to check whether what should be filled in for the assignment.<br /><br />Assignment 1 18%<br />Assignment 2 20%<br />Final exam (Multiple choice only, 1 hour) 50%<br />Class participation 12% (Open the Zoom camera can get 2% for each lesson. Optional Python practise can give you 2% to compensate if you miss one lesson. The practise is quite easy and you can have two times for it. I suggest all of you to do it if there is it.)<br /><br />Assignment and participation : All full<br />Exam : 28/30 (mean=23.1, sd=4.8)<br />Marks counted : 96.67/100<br />Grade : A<br /><br />I saw other comments getting 96.89 for A and 97.57 for A+. The exam for this semester is quite easy. It is just a very small mark difference for a subgrade. I would suggest putting more effort on assignment to ensure getting all marks for them.",
            "comment_workload": "Quite low. I try to do the whole assignment instead of dividing them into three parts. But it only take less than 1 hour for the first assignment. The second assignment is a bit more difficult that may take around 2 hours.<br /><br />I believe it is quite low even it is a 1 credit course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "RmSMvWoNtzKFZlhbta0xq6EkSUJxTBUn",
                    "name": "Course Outline 2021",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "ofsrppDQdoFVOiXJuAV6O54AUG1cxkD2",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mag",
            "date": "Aug 23, 2021",
            "title": "",
            "comment_content": "Introduction to multiple regression<br />Fitting Non-Linear Pattern<br />Variable Selection<br />Classification<br />Clustering",
            "comment_teaching": "Super sleepy in every lecture. Actually, she is nice and will answer questions in class. But I think reading PowerPoint by myself is a more efficient way to learn.",
            "comment_grading": "HW1: 92/100<br />HW2: 100/100<br />Class participation: full<br />Final: 29/30<br />Final grade: A<br /><br />The exam was easier than expected. Just finish all the exercises she gives. Even you don't fully understand, you can still find out the patterns of when to apply which equations. I didn't attend one lecture. You can do an optional assignment which is mc about the basic python to get back the attending marks.",
            "comment_workload": "Quite low",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ro96Y4ElgPTSXyxXMY9zFvQjFMkE86gh",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bosco Chan",
            "date": "Jul 18, 2021",
            "title": "Not bad",
            "comment_content": "Ch.0 Review and Introduction <br />Ch.1 Multiple Linear Regression <br />Ch.2 Variable Selection<br />Ch.3 Classification<br />Ch.4 Clustering<br /><br />Attached is the course outline",
            "comment_teaching": "Most of the times the lectures will overrun since half semester is certainly not enough for all the contents<br /><br />But fortunately the professor is not that boring and the lecture slides contains lots of examples <br />In addition, the professor will film extra YouTube videos for topics that are more advanced.<br />He will even set up a questionnaire to ask for challenging topics for filming.<br /><br />This professor does not require the knowledge of python either, as long as u understand the course content, getting an A is possible with 0 knowledge of python.",
            "comment_grading": "Assignment (40%)<br />Final (50%)<br />Attendance (10%)<br /><br />My assignments are 100/100 and 99/100 respectively <br />While final is 28/30<br />And I also skipped half of the lectures ( without logging into zoom )<br />That will get you an A<br />So I would say the attendance is not that important unless you want an A+",
            "comment_workload": "Only 2 assignments and the Final exam<br />Very light workload<br /><br />For the assignments, you can choose to do it on your own or form groups with at most 3 people.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "1pcFlzmWef24hNkXhDupA9JjpKnLS5iz",
                    "name": "ISOM2600_2021",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "mKhh0wyaW5aC9D7t2JFdJVuu6Iz6rGzI",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 404,
                    "name": "HU, Inchi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ged",
            "date": "Jun 06, 2021",
            "title": "Good grade",
            "comment_content": "lectures:<br />Multiple regression, logistic regression, non-linear regression, clustering, model selection<br />labs:<br />Python syntax of these stuffs",
            "comment_teaching": "Prof Hu has dedicated to teaching for many years. He is very kind to answer questions.<br />TA Anson is also good too, although his accent may be difficult to understand sometimes.",
            "comment_grading": "Very easy to catch A range. Just make sure you study hard and review every PRACTICE QUESTIONS before final exam. It is crucial!<br />Update:<br />Assignments: around mean<br />Final: 24/28&nbsp;&nbsp;&nbsp;mean: 19.x<br />A-<br />quite lenient grade",
            "comment_workload": "LOW. I don't know why so many people complained about the wl. I only paid some effort before final exam and caught A range.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6pwCgoAG63EHcGQGA9wiG0JS19OvwYhj",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 404,
                    "name": "HU, Inchi",
                    "rating": 1
                },
                {
                    "id": 1410,
                    "name": "CHAN, Yee Wong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "solarski22",
            "date": "Jun 05, 2021",
            "title": "",
            "comment_content": "Interesting and useful content. <br /><br />Introduction of Business Analytics and Review of Regression<br />Introduction to Multiple Regression<br />Transformation and Interaction of Variables<br />Model Selection<br />Classification Methods <br />Cluster Analysis<br /><br />ISOM2500 took a crucial part in the topics covered in this course, you will have advantages in some parts if you managed ISOM2500 (especially regressions) well.&nbsp;&nbsp;<br /><br />Some harder concepts which appeared in previous semesters are cut. This course is improving.<br /><br />For the labs, some python-related knowledge will be taught. They are mainly some complements to the topics/knowledge taught in the lectures.&nbsp;&nbsp;They won't be tested in the final exam, but they in appear in the 2 group assignments. They are not too hard to handle, but it takes some time if you are not familiar with the background knowledge.",
            "comment_teaching": "Professor Hu is good at teaching. His explanations are clear and easy to understand. His is also very nice. He welcomes student's questions and will reply to emails promptly. <br /><br />The TA, Yvonne is also good at teaching. She will sometimes re-explain some important concepts of the lectures in her lab classes. She explained them quite well. I think she is responsible and helpful. Much better than the ISOM2020 TA Hi**ry, who is rude and useless, you can refer to the comments about him on the ISOM2020 page. <br /><br />The teaching team in this course did a great job. It is different from the mess in ISOM2020.",
            "comment_grading": "The grading is good. <br />Assignments (36%) + Attendance/Participation (14%) + Final examination (50%)<br /><br />The final exam is easy. 30 MC Questions. Not too deep, just some basic things. You will be able to get high marks if you paid attention in class. For this course, 'hard work good grades' holds, which is a big contrast to ISOM2020 or some other courses. As mentioned by the TA, the exercise given is very similar to what will appear in the true final.<br /><br />Mean of HW1: 92 (me below mean)<br />Mean of HW2: 96 (me above mean)<br />Mean of final: 20/30 (me 25)<br />Grade: A-",
            "comment_workload": "Light. Appropriate as a one-credit course. One optional assignment and 2 graded python assignments.&nbsp;&nbsp;Easy to manage. No project.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "hJZX3xUh9LVx2KYKYTpEDOyjlqzVFBBi",
                    "name": "ISOM 2600 syllabus",
                    "format": "pdf"
                },
                {
                    "key": "Tv31dlEd8KKTJzoQC2m3CbyTFoKow662",
                    "name": "Session 0 - Introduction",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "0twjLke5gqZjn2mEKgn8NuycD6mi7RRX",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "krmmu",
            "date": "May 31, 2021",
            "title": "",
            "comment_content": "Chapter 1.Introduction to multiple regression<br />Chapter 2.Fitting Non-Linear Pattern<br />Chapter 3.Variable Selection<br />Chapter 4.Classification<br />Chapter 5.Clustering (no hierarchical clustering)",
            "comment_teaching": "His teaching is quite boring but once you pay attention to his class, you will undertstand what he is teaching. He kept mention that this is a one credit course, so the test will not be diffcult. Actually a lot of difficult content are put in appendix and you don't need to study for it.",
            "comment_grading": "Assignment1(3students/group)18%<br />Assignment 2(3students/group)20%<br />Final Exam(Individual)50%<br />Class Participation12% (Just attend all the lecture and you will get full mark)<br /><br />Overally I get 94 out of 100. Mean is 83.46 and higest is 100. My grade is A. I do not put much time revising for this exam but still I get a quite decent grade. Just remember to fo the practice questions, which is quite similar to the final exam. All exam questions are MC and it should be manageable for must of the students.",
            "comment_workload": "The workload is not heavy. Just 2 asm and one final exam. The assignment can be done in a group of 3. Plz find yourself good teammates, this will greatly lower your workload.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6XynLN3s8Pxs8GNAtlpiIPZFykILTCnN",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kaz",
            "date": "May 14, 2021",
            "title": "",
            "comment_content": "Similar to ISOM2500 but much easier. No much calculations, just theories and concepts. <br />Topics include: <br />- Introduction to Business Analytics and Review of Simple Linear Regression <br />- Multiple Linear Regression<br />- Fitting non-Linear Pattern<br />- Variable Selection<br />- Classification<br />- Clustering",
            "comment_teaching": "She explained the concepts well and the ppt is easy to understand, despite the lessons are boring.",
            "comment_grading": "You could get high marks in final exam as long as you have finished all the review exercises provided. The questions in final are similar to those appeared in the exercises. The assignments are not hard too.",
            "comment_workload": "No heavy workload. Only 3 group assignments throughout the whole semester and one final.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Uw8jxeM1Ko0Mz1P81Hsce7xskZ132fGU",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "hahalol",
            "date": "Jan 20, 2021",
            "title": "hell",
            "comment_content": "tbh I have no idea what have we learnt. They are quite confusing for me.",
            "comment_teaching": "with only 1.5 month teaching plus his eccentric accent, I would say it is hell. plus, his handwriting is too bad that you would not have idea what is he writing. So basically it is useless to attend classes.",
            "comment_grading": "it is not bad tho tbh <br />cuz you can have group asm and I have got great teammates!",
            "comment_workload": "it is not heavy as long as you have good teammates. we got 3 asm and one final and overall is alright.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NgBz9w4X2P77mNm2Gh2FHQ9TQvEk2bwK",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "busi trash",
            "date": "Jan 20, 2021",
            "title": "唔知學乜但又平安度過",
            "comment_content": "Introduction to multiple regression<br />Fitting Non-Linear Pattern<br />Variable Selection<br />Classification<br />Clustering",
            "comment_teaching": "上第一堂就知瀨野，聽佢啲英文仲辛苦過考dse listening，所以聽完第一句就無再聽過書全部掛機。我記得佢仲會周不時問問題，無人答佢會嬲（但真係全部人掛緊機）。好多野佢本身ppt無，佢自己額外寫好多野去解釋，所以想讀得好要專心上堂。",
            "comment_grading": "Assignment 1 (3students/group) 15%<br />Assignment 2 (3students/group) 15%<br />Assignment 3(3students/group) 15%<br />Final Exam(Individual) 50%<br />Class Participation 5%<br />我又覺得幾好grade wor，asm踩mean，final低mean幾分有b-，聽fd講攞A都唔難。",
            "comment_workload": "極細workload，得三份asm，每份都好簡單好少題目，唔識做都輕鬆處理（直接cope返lab materials啲code落去），何況三人一組去做。之前聽講好難好辛苦，可能tutor都知，所以asm變得好簡單，寫program都俾曬提示，份份asm mean都九成幾。<br />final都唔難，利申放棄咗呢個course都可以考接近mean，因為佢俾咗份samplepaper我地，final同samplepaper幾乎一樣，最後我乜都無學過淨係跟住份samplepaper去推邏輯，大家都背samplepaper當溫完（因為大家都真係唔知呢科讀乜）。<br />連prof都叫我地chill啲得1cred，所以final出得唔難，都算好人唔難為我地。",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hYIopyXdQfts2nmgGPKovIWSFtsk6xlM",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Marwin",
            "date": "Jan 19, 2021",
            "title": "not amazing",
            "comment_content": "You need to revise ISOM2500 carefully to be able to understand much of the concepts in this class.",
            "comment_teaching": "Professor Xu is very passionate and caring. He spends time and effort in explaining concepts students find difficult.",
            "comment_grading": "Not the best grading overall.<br /><br />3 assignments in total - the third one was just a simple poll <br />Final exam included everything and was 55% of the final grade. If you do well in the assignments and get slightly above the mean in the final, you can get around B range.",
            "comment_workload": "Not as heavy as I thought, however, the pace is quite fast as it is only a half sem course.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XOIvg8XhmCHuhQpdcg0OlpJixUNQfszu",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LaraC",
            "date": "Jan 18, 2021",
            "title": "quite good",
            "comment_content": "chapter1-3 multi-linear regression<br />chapter4 classification<br />chapter5 clustering",
            "comment_teaching": "i think his teaching so far is good but you need to focus during the lesson. otherwise, you wont understand what he is talking about due to the accent issue.<br />So far his teaching is good as he is willing to answer your question and gives some examples to explain the concept.",
            "comment_grading": "I think the grading is well.<br />If you attend all the lesson and tutorial, you surely will know how to do all the assignment. Before final exam, prof. will provide a practice paper to us, if you know to do all, then final exam won't be too difficult to you.<br />Assignment 1 98/100, mean 98<br />Assignment 2 96/100, mean 95.2<br />Assignment 3 100/100, mean 97.3<br />Attendance 5/5, mean 4.5<br />Final exam 78/92, mean 55.2<br />Final grade A+",
            "comment_workload": "only 3 assignment at all, those are easy.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xhW6s9ye3rez8qXN8chNmr7pXL30x9t5",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hyyy",
            "date": "Jan 04, 2021",
            "title": "",
            "comment_content": "0. Introduction to Business Analytics, Review of Simple Linear Regression, and Data Preprocessing<br />1. Introduction to Multiple Regression<br />- Multiple regression<br />- Inference, Prediction, and Model checking<br />2. Fitting Nonlinear Pattern<br />- Log-transformation<br />- Use Indicator and Interaction variables in regression<br />3. Model Selection<br />- Best subset<br />- Model evaluation: Adjusted R-squares, Cp, AIC, BIC; Training set and Validation set,<br />Cross-Validation<br />4. Classification<br />- Evaluation Criterion for Classification<br />- Logistic Regression<br />5. Clustering Analysis<br />- Hierarchical Clustering<br />- K-means Clustering",
            "comment_teaching": "Quite difficult to follow in class. Remember to pay attention in class and try to ask him questions if you can't follow.",
            "comment_grading": "Assignment 1 (3 students/group) 15%<br />Assignment 2 (3 students/group) 15%<br />Assignment 3 (3 students/group) 15%<br />Final Exam (Individual) 50%<br />Class Participation 5%<br />Leng grade, 2 assignments above mean, 1 below mean, final above 0.9 sd, final grade: A",
            "comment_workload": "only 3 assignments and revise the practice paper in Canvas. Final exam is similar to the pp.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3BBe8OdgRgoq1Q1Zfe9eLpBqOhlmRssz",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "You guess!",
            "date": "Dec 30, 2020",
            "title": "Unexpected good grade",
            "comment_content": "Lecture: only theories <br />Lab: only coding part (for homework only because no need to write code in the final exam)<br /><br />Chapter 0: Introduction to Business Analytics<br />- Review of Simple Linear Regression<br />- Data Preprocessing<br /><br />Chapter 1: Introduction to Multiple Regression<br />- Multiple regression-Inference<br />- Prediction<br />- Model checking<br /><br />Chapter 2: Fitting Non-linear Pattern<br />- Log-transformation<br />- Use Indicator and Interaction variables in <br />&nbsp;&nbsp;regression<br /><br />Chapter 3: Model Selection<br />- Best subset<br />- Model evaluation: Adjusted R-squares, Cp, AIC, BIC<br />- Training set and Validation set<br />- Cross-Validation<br /><br />Chapter 4: Classification<br />-&nbsp;&nbsp;Evaluation Criterion for Classification<br />-&nbsp;&nbsp;Logistic Regression<br /><br />Chpater 5: Clustering Analysis<br />-&nbsp;&nbsp;Hierarchical Clustering<br />-&nbsp;&nbsp;K-means Clustering",
            "comment_teaching": "To be honest, his accent is quite difficult to understand so I choose to skip all the lessons. (simply just 掛機 as there would be attendance counted)<br /><br />Originally I planned to re-watch the lecture videos before final exam, but my friend told me that undertstanding the practice paper is enough, lastly I gave up to watch all videos.",
            "comment_grading": "Although many of them say that ISOM2600 is bad grade course, I would say quite good.<br />(My predicted grade is just B as my final exam didn't exceed 1 sd but still in A range lastly!)<br /><br />My score:<br />Assignment 1 (15%): 96/100 (mean: 98/100)<br />Assignment 2 (15%): 96/100 (mean: 95.2/100)<br />Assignment 3 (15%): 100/100 (mean: 97.3/100)<br />Final (50%): 66/92 (mean: 55.2, sd: 12.9)<br />Attendance (5%): 5/5 (mean: 4.5/5)<br /><br />Overall weighted score: 84.67 (mean: 78.1)<br />Grade: A-",
            "comment_workload": "Not a 1 credit course since the difficulty of the content and the workload are high. BUT it is not that scary in my opinion, just only 3 assignments and 1 final exam. For each assignment, most likely are coding questions but a few would be theoretical questions. For final exam, no need to write any coding but to understand the output from python. <br /><br />Since the assignments can be done with groupmates (max:3 people in a group), it reduces a lot workload.<br /><br />Practice paper is SUPER important for the exam as the format and questions are very similar, you can just all in on the practice paper and revise other courses.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "U7VUcjzOMjOaxsWhwPMlKl6CB7IkAgHL",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Daisychun32",
            "date": "Dec 28, 2020",
            "title": "Dulilun is not bad",
            "comment_content": "Honestly, the content was ambiguous and hard to understand. I believe most of the students felt the same. If you know, you know. The content of 2600 resembles to isom2500. <br /><br />There are only 5 topic on exam, not to difficult if you do the pp. luckily, do not needa test programming",
            "comment_teaching": "I can see that he has the passion to teach. However, his accent is terrible and makes you want to skip his class. Just rewatch the class video with subtitles you will be fine. <br /><br />Not chur",
            "comment_grading": "Grading is quite good<br />I have got 2 hw full mark and 1 98 or Sth <br />Final slightly above mean<br />Have parti marks <br />Overall marks slightly&nbsp;&nbsp;above mean <br />Finally got B",
            "comment_workload": "I would say it is fine. Hw is not difficult, only 3",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "o8cIEVU6KA9UU2n5QrRJnirFU4l4FqFt",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 404,
                    "name": "HU, Inchi",
                    "rating": 1
                },
                {
                    "id": 1410,
                    "name": "CHAN, Yee Wong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Vivianna",
            "date": "Sep 02, 2020",
            "title": "Nice content but too hard for Year 1 student",
            "comment_content": "1: Introduction to Multiple Regression<br />2: Fitting Non-Linear Patterns via transformations<br />3: Model Selection<br />4: Classification Analysis <br />5: Classification Analysis <br />6: Clustering Analysis<br /><br />Concepts will be explained in Lecture while coding will be reached in tutorial. Content is too hard for Year 1 student. Also, it require knowledge in ISOM2500, which I believe most of us have forgotten.&nbsp;&nbsp;Due to too much content, It is quite hard for professor and TA to finish the course. However, it is a required course, so.. GOOD LUCK everyone!!!!",
            "comment_teaching": "Hu Inchi is so nice. He will explain the concept clearly, however, sometimes I still cannot get the point. Sorry.... A little bored with his tone but you won't understand the powerpoint without teaching. Therefore, remember to attend the lesson. Lesson will be recorded too, so we can watch it with 1.5speed.Hehe...<br /><br />TA is so nice too!! Although tutorial is about 50 minutes, she may extend it to two and a half hours to explain the coding clearly and answer your questions.",
            "comment_grading": "Better than I thought...<br /><br />I attended all lecture and tutorial. Also,I studied a night before and tried my best to understand the concept behind the answer of mock paper. <br /><br />Assignment 1: 100/100<br />Assignment 2: 95/100<br />Assignment 3: 100/100<br />Assignment 4: 100/100<br />Exam: 46/65<br />Grade: A-<br />Unexpected results.. <br />Hints: try your best to understand the mock paper.<br /><br />Exam statistics:<br />mean: 36.2 <br />highest: 60",
            "comment_workload": "HW is related to coding. Although you understand the concept and attend the tutorial, you might still not know how to do the homework. I am so lucky that I have good group mate so we can help each others to get the answers.&nbsp;&nbsp;Usually, I need almost one hour to finish one question.. maybe I am too stupid...<br /><br />Exam questions are about calculate and explain the algorithm but professor will only talk about how it suppose to work with computer program. So, I don't know how to do it with my calculator....totally mindfxxked with mock paper......",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JZzL6yrCdxjUxEROwHxXm0SVxYpIHHrq",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "dawnun",
            "date": "Aug 31, 2020",
            "title": "",
            "comment_content": "Topic 0: Introduction to Business Analytics<br />Topic 1: Multiple Linear Regression<br />- Multiple linear regression model<br />- Multicolinearity<br />- Residual Analysis<br />- Case 1: Retail Profit<br />Topic 2: Fitting non-Linear Pattern<br />- Log transformation<br />- Quadratic transformation<br />- Using dummy variable and interaction variable<br />- Case 2: Real estate valuation data set<br />Topic 3: Variable Selection<br />- Best subset selection<br />- Criteria: Cp, AIC, BIC, adjusted R2<br />- Validation set approach and cross validation approach<br />- Forward selection, backward elimination and stepwise selection<br />- Case 3: Wine quality<br />Topic 4: Classification<br />- Distance measure<br />- K-nearest neighbor<br />- Naïve Bayes<br />- Logistic regression model<br />- Case 4: Census Income<br />Topic 5: Clustering<br />- Hierarchical clustering<br />- K-means<br />- Case 5: Financial data",
            "comment_teaching": "A nice professor. She offers Q&amp;A session after each lectures. But her pace in lectures is hard to catch up. <br /><br />I just attend 1-2 lab sessions and then I give up cause I think it's quite time consuming, sometimes it may take about 2 hours.",
            "comment_grading": "10% Class Participation (attend 5 out of 6 lectures) <br />40% 4 Assignments (10%@1)<br />50% Final Exam<br /><br />My Grade: A<br />Asg1: 100/100<br />Asg2: 95/100<br />Asg3: 100/100<br />Asg4: 96/100<br />Final Exam: 109/130 (mean:77.9; sd: 23.1)<br />Class participation 5/5",
            "comment_workload": "The workload of this course is quite large but it's just a 1 credit course in half semester. I spent quite a lot of time to review the notes and lab materials to finish the assignments. <br /><br />I think it should increase the credit or reduce the workload.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OTyA2LIPWfu5DRuwAz0R4DPsBVYA3iNX",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 0
                },
                {
                    "id": 1373,
                    "name": "TONG, Chun Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Iris2134",
            "date": "Aug 29, 2020",
            "title": "又辛苦又爛grade",
            "comment_content": "讀好多野(comparing with isom 2020)，詳細可以睇下其他人send嘅syllabus",
            "comment_teaching": "真心唔明Du Lilun同埋ta講咩，雖然佢哋係好人but...Prof d英文真心唔係好明，ta係tutorial講書都有d一舊舊。但我落堂問ta書，佢會講得清楚好多。大家加油啦！",
            "comment_grading": "Fair la, 因為我真心聽唔明，而且prof畀嘅練習都其實唔係好夠，我係因為assignment做得ok同埋每一堂都有attend先拉到C+<br />記得要attend lessons，佢會take attendance，呢度有10%",
            "comment_workload": "每個星期都要交assignments，仲要都幾難下（我就係聽唔明跟住係咁loop videos都唔明QQ）<br />呢個course嘅assignments可以話係我year1最覺得壓力大同埋多嘅assignments，而且佢只有1 credit",
            "rating_content": 1,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RjJ56Ql6c4Lww8o6MtSDbTkjgY6WIwq0",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "anonymous2023",
            "date": "Aug 28, 2020",
            "title": "",
            "comment_content": "a more in-depth teaching of isom2500 material. <br />Syllabus<br />1. Introduction to Multiple Regression<br />- Multiple regression<br />- Inference, Prediction, and Model checking<br />2. Fitting Nonlinear Pattern<br />- Log-transformation<br />- Quadratic regression<br />- Use Indicator and Interaction variables in regression<br />3. Model Selection<br />- Best subset, Forward selection, Backward elimination, and Stepwise selection<br />- Model evaluation: Adjusted R-squares, Cp, AIC, BIC<br />- Training set and Validation set, Cross-Validation<br />4. Classification I<br />- Evaluation Criterion for Classification<br />- Accuracy Score, Kolmogorov-Smirnov test, and Area Under the Curve (AUC)<br />5. Classification II<br />- K-Nearest Neighbors Classifier<br />- Naïve Bayes Classifier<br />- Logistic Regression<br />6. Clustering Analysis<br />- K-means Clustering<br />- Hierarchical Clustering",
            "comment_teaching": "quite clear",
            "comment_grading": "not bad but you have to understand the concept",
            "comment_workload": "not much, most of them are group work",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "J7OQ2DoSeZeMYjDcpEn5RBFwpqPEK0m2",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 795,
                    "name": "DU, Lilun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Heliumet",
            "date": "Aug 20, 2020",
            "title": "Overwhelmed course, but good grade",
            "comment_content": "The course is poorly designed to be fit in a 6-week course. This course is even tougher than ISOM 2500 (which is a 3-cred semester-length course) From multivariable linear regression model to model selection and different probability theorems, it is absolutely too tough for Year 1 students to follow through. It should have been a 3-cred course like ISOM 2500 and with sufficient guidance throughout the semester.",
            "comment_teaching": "The lecturer teaches quite well despite the horribly designed course structure. He tries very hard to deliver all messages and cover all topics within merely 2 hours in each of the 6 weeks. The TAs are also friendly and willing to answer your questions if you encounter any in doing the group assignment. Yet, the class is really in a rush so lecturer usually cannot handle too much queries in class.",
            "comment_grading": "10% attendance<br />40% assignment (4 in total, 10% each)<br />50% final exam<br /><br />Basically everyone knows they need to attend class, so 10% for everyone. Assignments are to be completed in a group of at most 3 (no assigned groupings), you can allocate workload among your teammates. Moreover, according to observations in Canvas, basically as long as you have done the assignment properly, full marks will be given. So most of the students get these 10%+40%. The grade is determined by final exam. The exam is rather difficult so you no need to worry about high mean (the mean is about 70% only), and finally, the grading is really lenient.",
            "comment_workload": "The workload is very heavy. Within the 6 weeks, 4 group assignments have to be completed. All assignments are to use Python and panda libraries provided to complete the tasks correspond to the topics discussed in class. (linear regression model, best model selection, reasoning, etc) Working time depends on the style and ability of your groupmates. As each person can have their own programming style, it might be a tough work if you divide the assignment into 3 parts for each one to complete.<br /><br />P.S. My group turns out to be one person doing Assignment 1, 2, another doing Assignment 3 and the last one doing Assignment 4, which I think is the most efficient way.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vuR0RV12pVjj5YFHcTB2X2lygRhrcSWb",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                },
                {
                    "id": 1411,
                    "name": "MAK, Chun Cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ustkatielaw",
            "date": "Aug 02, 2020",
            "title": "",
            "comment_content": "Chapter 1: Multiple Linear Regression<br />Chapter 2: Fitting non-linear Patterns<br />Chapter 3: Variables Selection<br />Chapter 4: Classification<br />Chapter 5: Clustering<br /><br />It is like an advanced course of ISOM 2500 in terms of data analytics, except it is infused with python coding skills.<br /><br />(not much coding skills really as all you need to do is copy and paste the TAs' codes into your own program, change the variables and that's all)",
            "comment_teaching": "Prof. Kris Pan is very good. Although she just read out the lecture slides during lectures, she would also give some notes and explanation on the contents. Most of the professors would have a QnA session before the exams as well to clarify our concepts. TA (Isaac &lt;3) is very good as well, feel free to discuss philosophy with him in tutorials. <br /><br />However, communication between profs and TAs &amp; the bridging between previous IS courses are VERY BAD. In lectures, you will hear the professors keep saying 'This is taught in ISOM 2500' (but I don't remember ISOM 2500 teaching the stuff she mentioned) and 'This will be taught by the TA in the tutorial'. Then, the TA will be like 'I don't know what to do as well' as they just know how to code and nothing else regarding the lecture contents.",
            "comment_grading": "the grading consists of assignments, participation and final exam.<br /><br />Participation: just attend 5 out of 6 lectures (2% for each lecture), everyone gets them. For Prof. Pan, you are required to turn on your camera as well (online semester)<br /><br />Assignments: 4 assignments (4x 10%). It is a group-project assignment. You can get all the codes required to solve the assignment by downloading all the files written by the TA during the tutorial. Change the variables and you should get the desired output and write some analysis and interpretation of the data based on your program. Remember to find some good teammates or else you will have to work on everything yourself with the free-riders.<br /><br />Final Exam: 50% of the entire grade. All the professors will give out a sample paper before the exam, and the difficulty is more or less the same compared to the actual paper. (Prof. Pan was kind enough to have chapter review exercises as well but they are very basic) I find the exam to be quite hard and barely finished the paper within the time limit.",
            "comment_workload": "Very Demanding for a 1 credit course. the workload and difficulty of the course are much more than a 3-cred ISOM 2500. The assignments are a bit complicated especially when you don't know anything about pandas and the different packages of python. The knowledge taught in ISOM 2020 is definitely not enough to understand the code and the logic of the code written by the TAs.<br /><br />The lectures part are not very difficult given you really spend time on it. Be prepared that it is not as easy as ISOM 2020 and you really need to understand the topics and the theories behind the contents.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fWVy8p8gQCsrUFeRSJpco7x8TFynva0F",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                },
                {
                    "id": 1600,
                    "name": "YIN, Zhendong",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "_Wh.M",
            "date": "Aug 11, 2022",
            "title": "A 3 Credits Course in Disguise",
            "comment_content": "The content covers the use of several libraries like numpy, pandas, statsmodel etc. in Python to do data analysis. The topics cover regression, K-means clustering etc. To be honest, it is hardly possible to understand the knowledge being taught in 12 hours of lectures. Although I self-learned numpy and pandas before, I still could not follow the lectures.",
            "comment_teaching": "Lecture (PAN, Baoqian): I think she tried to give clear explanations. In conclusion, I think her teaching is okay.<br />TA (YIN, Zhendong): Terrible TA. Didn't know what he was teaching in the lab, and I also think he was not so responsible as a TA. He didn't care whether students understand what he was doing.",
            "comment_grading": "Getting a good grade in this course is difficult, because the difficulty of the lecture is too high.<br /><br />16%&nbsp;&nbsp;Group Lab Assignment 1<br />10%&nbsp;&nbsp;Group Lab Assignment 2 <br />50%&nbsp;&nbsp;Final exam<br />24%&nbsp;&nbsp;Class participation (In class exercise, multiple choice)&nbsp;&nbsp;<br />Lecture attendance is compulsory, but Lab attendance is optional.<br /><br />There were a total of 6 in-class exercises. Each of them had 4-5 multiple choices questions and were quite easy to answer. If you missed one of them, you could compensate it with an individual python assignment.<br /><br />Final Exam (mean: 23.6, sd: 4.5) I got 28/30 in Final Exam, <br />but still got an A-",
            "comment_workload": "Heavy workload for a 1 credit course. You had to do a weekly in-class exercise (that means you cannot skip the lesson), and finish two group assignments. Although the assignments are not difficult, but they are time-consuming, especially you are not familiar with programming.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "93zFu5OPFi2eKOzX2Jgmm2rOgtDQndfk",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ustisfun",
            "date": "Dec 12, 2021",
            "title": "disappointed in myself and the course",
            "comment_content": "Content is quite different from last sem. Last sem focused more on statistics and less on coding. This sem, well, both are involved, and that's why it's much more practical but in a bad way lol",
            "comment_teaching": "Wan Xuhu is nice in person, but the syllabus for this sem is, to be honest, much more practical than before. Being practical itself is not bad, but over 90% of the codes in 2600 are never taught before in 2020, and that makes me so pissed off by the lectures: Wan Xuhu just goes through the slides without explaining what the codes means (e.g. shape[]? add subplot(x,y,z)? fit test?)... Horrendous<br /><br />TA is better. They at least know the project is difficult for us and provided insights eventually.",
            "comment_grading": "I spent the same time to study for 2020 and 2600. I got A+ in 2020, but I expect myself getting a B range in 2600.<br /><br />Attendance: 1/2<br />Project: 98/100<br />Finals: 15/30 (huge disappointment)",
            "comment_workload": "a bit much for a 1-credit course. In ISOM 2020 it was all fun and games with making a order machine. With this order imbalance project, I found nothing but anger and frustration with error popping from time to time.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "q985yopwrMuaWprSnw7zIF6jzfgjwfG6",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Inverse",
            "date": "Aug 15, 2021",
            "title": "Merely a glimpse of business analytics",
            "comment_content": "Multi-variable regression, variable selection &amp; engineering, model selection, classification, clustering, and a introduction of their Python realization.",
            "comment_teaching": "It hasn't been all that easy to understand, but not much of the professor's or the TA's fault. They've done well already with all this bloody content and coursetime.",
            "comment_grading": "Overall = 40% Assignment + 50% Final + 10% Attendance.<br />FYI, our group got 97,99/100,100 for the assignments, two got 29/30 and one got 30/30 for final, all had a full attendance, and everyone got a fair A. Not something that I would call generous even for an ISOM course.<br />The higher-than expected means and minimal S.D.s do explain a part of it, but one does wonder if anyone did get an A+.",
            "comment_workload": "As I said in the title and constantly stressed by the professor in class, this course serves only as an introductory course of Business Analytics. Thus, being such an introductory course of a field that demands much serious maths, statistics and even programming, while only bearing minimal coursehours and credits, the content was inevitably naive yet not easy to understand.<br />Much of the content are actually math or statistics - programming is tested only in the assignments and you don't even have to *write* them yourselves as most of the code has been completed already. You just have to make some simple changes.<br />So...light but not all that easy to understand one may say.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jyqBPuKw86KIOQqbhlLkfX45ZKPmlVro",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 0
                },
                {
                    "id": 1410,
                    "name": "CHAN, Yee Wong",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Rigbones",
            "date": "Jun 06, 2021",
            "title": "So you thought ISOM 2020 was horrible enough?",
            "comment_content": "Content?&nbsp;&nbsp;What?&nbsp;&nbsp;Are you saying I learnt something??<br /><br />In all seriousness, topics covered are useful but they’re delivered in such an awful and unorganised way.&nbsp;&nbsp;If you need to use things taught from this course in the future, well good luck.&nbsp;&nbsp;Introduction to Business Analytics my ass.",
            "comment_teaching": "Xuhu Wan tries to teach well, but fails.&nbsp;&nbsp;<br /><br />I can’t blame it entirely on him though because the course content is just so bad that I don’t even think god can teach it well.&nbsp;&nbsp;I was so glad when I finished with this course.<br /><br />His lecture slides are horrible.&nbsp;&nbsp;Spelling mistakes everywhere, ambiguous use of words everywhere.&nbsp;&nbsp;Just what the hell is “An Toy Example”.<br /><br />Oh and if your TA is Yvonne save some time and grab a coffee with your friend instead of attending the lab.",
            "comment_grading": "10% Attendance<br />40% Assignments (total 2)<br />50% Final exam<br /><br />It’s just a one credit course, give up and focus your time on other courses.<br /><br />Coding in python required only for assignments (not finals), but basically you’re just copying and pasting the code that TA provided in labs.&nbsp;&nbsp;If your TA is Yvonne, ask your friends from other labs for the python file.<br /><br />You don’t even need to ask about finals.",
            "comment_workload": "Workload is heavier than ISOM 2020.&nbsp;&nbsp;But yes the coding knowledge from ISOM 2020 is absolutely useless for ISOM 2600 🙂🙂🙂",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9kr9PYqI0LWtII7ZvtISrl69OeHR9wGE",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 404,
                    "name": "HU, Inchi",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "stephc",
            "date": "Aug 27, 2020",
            "title": "Horrible course basically",
            "comment_content": "1.Introduction to multiple regression<br />2.Transformation and interaction of variables<br />3.Regression model selection<br />4.Classification and supervised learning <br />5.Clustering and unsupervised learning<br /><br />Content is difficult. Seems like 2500 and 2020 didn't really help with this course. Lab and lecture section don't match, so your classmates in the tutorial section may be from different sections.",
            "comment_teaching": "The professor is nice, though majority of the students had no idea what was going on in class. He responds to&nbsp;&nbsp;email fairly quickly.<br /><br />Issac is quite a good TA as well. His lab notes are very organised.",
            "comment_grading": "Assignments(40%)<br />Attendance/Participation (10%)<br />Final examination(50%)<br /><br />Assignment grading were not given out on time, but practice exam really helped. Recommend doing the practice paper and going to the tutorial for preparing for exam. Coding part was not included in the exam.",
            "comment_workload": "4 group assignments but still a heavy workload. Mostly python coding but difficulty level is much higher than 2020. Lab notes/ material are very helpful when you are trying to figure out the assignment because you can mostly copy and paste from lab notes and just change something.",
            "rating_content": 1,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "z8xHlg6m7Z4KyZS0fsNIQ6rrqaN5kikz",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 368,
                    "name": "WAN, Xuhu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "holam",
            "date": "Dec 10, 2021",
            "title": "ISOM 2600",
            "comment_content": "Highly recommended for those who have taken ISOM 3540 / ISOM3400 / ISOM 3360 / ISOM 4530 / ISOM 4540. (For those admitted 2018-19 or before) This course would be the best grade booster with minimal effort. Welcome for all COMP students too! With ISOM2020 together, you guys can har SBM bb in these 2 credits! (Hint: register in Fall to har those pathway 1 students)<br /><br />It is noted that the topic covered by this professor is MUCH LESS than other semesters before since this is the first time that one professor take care of all 6 sessions, which give him great flexibility in amending the syllabus and coverage. No clustering, no interaction terms, no lambda function. Then this course becomes a ridiculous, just compare the syllabus of 19-20 Spring with 21-22 Fall, you cannot imagine this is the same course.<br /><br />You can also expect the questions are very practical in python. If you get rubbish grade in ISOM 2020, you basically can die in the exam. Even if you did well in ISOM 2020, the coding in this course is much more difficult.",
            "comment_teaching": "nothing to mention since i do not really pay any attention and usually i just go into the classroom in the last 10 min to take the IPRS",
            "comment_grading": "Attendance (10%)<br />Go in the classroom in the last 10 min to take IPRS<br />No attendance for tutorial, just skip it<br /><br />Assignment (30%)<br />Order imbalance multiple regression project.<br />The content is very easy if you have completed ISOM 4530 project. Even you have not, 80% of codes are copy and paste from lecture python file.<br />However, I got no idea why professor said it is so difficult and then remove one part of the project (waste my time to do Task 4 lol)<br />The key is that you need to use apply / rolling well and then it is very easy.<br /><br />Still, if you know nothing, you should go to the tutorial sessions since TA basically write nearly all the codes for you (as far as I know) <br /><br />Final Exam (60%) with double sided cheat sheet<br />1 hour is so rush for these 30 MC. Do not fake by the sample exam, difficulty of actual exam is 10x higher. <br /><br />Most of the questions are trying to be tricky and really test that whether you have tried to run all codes in the lecture python file. Very tiny things are asked, like the position of the graph generated. Be very careful in the exam. I got get 2 questions wrong due to careless.......&nbsp;&nbsp;&gt;.&lt;<br /><br />Let's try to give some examples.<br />a = [1,2,3,4]<br />b = [7,8]<br />a.append(b)<br />a[-2]<br />What is the output?(3/4/7/8)<br /><br />Which of the following codes can select the numbers with larger than 50?<br />x = [20,70,100,120,10,80]<br />A. newlist = [t if t &gt; 50 for t in x ]<br />B. newlist = [t if t &gt; 50 else np.nan for t in x ]<br /><br />We have the data in the layout of&nbsp;&nbsp;AAA, BBB, CCC (from left to right, in same row)<br />Which code can produce the histogram of CCC?<br />A. axes1=plt.subplot(1,3)<br />axes1.hist(df[&quot;CCC&quot;])<br />B. axes1=plt.subplot(3,1)<br />axes1.hist(df[&quot;CCC&quot;])<br /><br />Please make sure you know the expected output of norm.cdf(Z) / norm.ppf(Z) / 1-norm.cdf(Z) / 1-norm.ppl(Z)<br /><br />There are so tricky ffill and bfill questions / loc and iloc questions. You need to be a good compiler yourself &gt;.&lt;<br /><br />One question also requires you calculate the sum of residual squares given the data.describe() result (i.e. a summary table), of which it is definitely not easy if you just have 2 minutes to calculate.<br /><br />The exam requires you to understand BOTH statistics and coding, without either one you cannot answer the questions. Only 4-5 questions out of 30 is pure coding questions. All others you have to combine with statistical knowledge.<br /><br />L1 Statistics:<br />Attendance (10%) Mean: 8.88/10<br />Assignment (30%) Mean: 27.09/30<br />Final Exam (60%) Mean 14.4/30 Median = 14/30 Highest 26/30 SD = 4.3/30",
            "comment_workload": "3 hours to complete the assignment<br />3 hours to prepare for the exam (to make the cheat sheet / run all the codes in the lecture python file once)<br />1 hour to take the exam<br />10 min x 6 = 1 hour to take attendance<br />Total workload for this 1 credit = 8 hours<br />And 20 minutes to write this review!",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "LbjbNHAz8ITq6QqlK0XYXUmLwGTezDwk",
                    "name": "FinalGuidelines",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "OPOHL5GP7lQt8Uue7HzMfOuPQLqwDxZE",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 369,
                    "name": "PAN, Baoqian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Saik",
            "date": "Jun 11, 2020",
            "title": "Terrible workload; decent content but need better design",
            "comment_content": "Someone else pasted the syllabus already, I am not gonna repeat. Tho many may not agree, I think that the content itself is pretty good. We can learn both concepts and try to code it out and give interpretation, making the course pretty practical. I think the content is quite like ISOM 3400.<br /><br />However, the downsides of this course is that the content was too much for a one credit course, and it should be extended to a full semester duration instead of only half. Since there are only 6 lessons, the professor and TA(in lab) are always in a hurry, they just have time to introduce the terms, explain what it does and then rush through it, no mathematical derivation/proof, and no intuition explained.",
            "comment_teaching": "Very good. Professor Pan’s accent is not native but comfortable, she explains clearly and patiently answer the questions raised by students. She even made a Cantonese Q&amp;A session where she spend hours on using Cantonese to teach again and answer questions. But again, it is not easy to follow her pace in lessons since the course schedule was tight and therefore she taught really quickly, I think it was not her problem tho.",
            "comment_grading": "Attendance 10% (have to attend 5 lessons out of 6)<br />Assignments 40% (4 in total, 10% each)<br />Final 50%<br /><br />For me<br />Attendance full<br />Assignment 399/400 (-1 due to a typo; I think most ppl can score 90+ in each assignment)<br />Final 127/130 (mean77.9, sd23.1)<br />A+ finally<br /><br />Since it seems that many people give up in this course because of its crazy workload, so if you can understand all the course contents and do the sample final, which has quite a lot of similarities with the actual final, you would be fine. Given the effort and time taken to obtain this grade, I don’t think the grading is very good.",
            "comment_workload": "The worst part of this course. If the workload in ISOM2020 is 1.5 credit, this course is ~3.5 credits, even the workload of 2020 is so light compare to this course.<br /><br />Personally, I spent ~2hrs on lecture, additional 2-3hrs on revising the lecture, take notes and replaying the lecture video, and then ~1.5hr on learning the lab code, finally ~3hrs on the assignment each week! The assignments are difficult, they require you to be able to follow the labs to code, and then use your lecture concepts to explain/ interpret. What our group do was each do the hw once all by ourselves and cross-check. It was painful but it’s the only way that we get most out of this course.<br /><br />To make this course better, they should increase the credit to 3 and make it last for the whole semester!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        }
    ],
    "composer": []
}