{
    "error": false,
    "course": {
        "id": 684,
        "subject": "ISOM",
        "code": "3310",
        "name": "e-Business Management and Web Analytics",
        "description": "This course introduces the fundamental concepts and technologies of e-commerce and e-business management. Topics include e-business models, e-business infrastructure, e-security, e-marketing, e-payment methods, web development, web analytics, and social media analytics.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2040,
            2030,
            1940,
            1910,
            1840,
            1810,
            1740,
            1640,
            1610,
            1530,
            1440
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.28,
        "rating_teaching": 3.39,
        "rating_grading": 4.22,
        "rating_workload": 3.5,
        "review_count": 18,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 363,
                "name": "TEH, Jack Her Hock",
                "count": 13
            },
            {
                "id": 1096,
                "name": "LEE, Dongwon",
                "count": 5
            }
        ]
    },
    "reviews": [
        {
            "hash": "JimePD2312s6S8P9UYqemw5mNTxIrRUO",
            "semester": "2016-17 Summer",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kabul",
            "date": "Aug 16, 2017",
            "title": "Not too bad.",
            "comment_content": "Content is very useful. It gives us many insights regarding e-business and start-ups, such as various types of business models, high-velocity decision making, long tail theory, community-based Internet marketing, etc. Some of the business models are really interesting and may sometimes be counterintuitive. For instance, there is a venture capital based in Europe which encourages copy-cat business models and emulating competitors, and as it turns out it's become very successful. Another notable example is the striking contrast of the fundamental strategies between two e-commerce giants, eBay (a largely unregulated bazaar) and Amazon (more regulated to ensure quality), and the reasons of why the two seemingly different strategies made both companies successful. It also digs into a more technical aspect of e-commerce, including the use of cookies, web bugs, e-currency, cryptology, etc. during the second half of the course. BTW the cryptology part looks pretty hard for me...<br /><br />It looked like to me a hybrid of marketing and IS courses. I took MARK2120 the same semester and I found the marketing knowledge helpful in this course. If you like start-ups and business models, there you go. Otherwise, this course may merely be a piece of memorization-based bullsh!t. Of course you can easily manage to get a decent grade with rote, mechanical recital, but if you really wanna learn something from this course you'd better understand the rationale behind each company's strategies and business models.<br /><br />Topics included:<br />1️⃣ Introduction to E-business and Business Models<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Introduction to E-business<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 E-commerce Business Models<br />2️⃣ E-marketing and E-advertising Management<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Internet Marketing<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Web Advertising<br />3️⃣ Google and Search Engine Optimization (SEO)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Case of Google<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Search Engine Optimization<br />4️⃣ Web Statistics &amp; Web Analytics<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Long Tail<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Internet Information Gathering Tools<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Personalization<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Web Analytics<br />5️⃣ E-commerce Applications - Retailing &amp; Auction<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Case of Amazon<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Case of Blue Nile<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Auction<br />6️⃣ E-commerce Applications - Uber &amp; Airbnb<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Platform Business Model<br />7️⃣ Electronic Payment System &amp; Security Control<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Payment<br />8️⃣ Encryption &amp; Cloud Computing<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 E-security<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;🔶 Encryption",
            "comment_teaching": "Everything aside from the professor's accent is fine. At least he's really kind to us. Sometimes it's quite difficult to understand what he's conveying in the lectures, but after lectures we can always ask him questions to make out what's going on.<br /><br />One thing that could have made the course better is that there should have been IMO a separate tutorial teaching us how to make the website and conduct the web analytics in the project, cuz most of us in the class had a hard time figuring out what to do. Most of the groups even forgot to collect the data for web analytics using the StatCounter website and this caused quite a lot of troubles.",
            "comment_grading": "💯 Grading is pretty lenient. Even though my group screwed up the presentation (below mean) I could still get an A.<br /><br />Course requirements:<br /><br />Assignments - 23%<br />✏️ 5 Assignments - 15% <br />✏️ In-class Assignment (best 8 out of 9) - 8%<br /><br />Group Project - 22%<br />💬 Project Presentation - 10%<br />💻 Web Site Design - 5%<br />✏️ 2 Project Reports - 7%<br /><br />Exams - 55%<br />✏️ Midterm - 20%<br />✏️ Final Exam - 35%<br /><br />Make sure you burrow through the exam content coz exams are gonna be the most decisive factor of your grade. Quite a few questions in the exams will not be mentioned in the study guideline he gives to us, so if you wanna achieve A-range, you should go over all the extra stuff out of what the guideline has mentioned. Get yourself particularly familiar with the reading materials and all the business-model thingy cuz they're the most likely to appear in the long questions in the exams. Memorize what kinds of tactics the companies mentioned in the articles use and you'll be fine in the exams.<br /><br />And make sure you don't miss any deadline - in this course, every % of your total score counts! Missing any assignment (3%) will significantly suppress your grade.",
            "comment_workload": "The schedule is quite packed for a summer course. Note the number of ticks I've chosen on the top of this review. Right within 2 weeks there comes the midterm, and after another 2 weeks the final exam approaches you. Other than exams there will be a total of 5 individual assignments, a group project on web analytics (with presentation), endless reading materials and in-class worksheet for every lecture (read: compulsory attendance).",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KjEQpgQxB7qPEGhAsg0Ex1miWorBYc04",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mwk",
            "date": "Aug 11, 2020",
            "title": "Nice content, f**king that Tommy NG TA",
            "comment_content": "The content is quite updated. You can know more about the world's top entrepreneurs' development and their business model through this course.<br /><br />1. Introduction to e-business <br />2. Business Model Canvas &amp; Unicorns<br />3. Business Models: Google &amp; Netflix<br />4. Project Proposal Due (Zoom Meeting)<br />5. Digital Marketing I <br />6. Digital Marketing II<br />7. Search Engine Optimization (SEO), Web Statistics &amp; Web Analytics<br />8. e-commerce Applications: Retailing &amp; Platform Business <br />9. Security Control &amp; Encryption<br />10. Project Presentation<br />11. Final Exam (9:30 am-12:00 noon)",
            "comment_teaching": "JACK's teaching is quite boring, it is torturing for a 3 hours lesson. One good thing is we are having online classes, not required to open cam. But be aware that Jack will ask questions randomly. He will call all students' name to answer questions.<br /><br />FUCK THE TA<br />FUCK THE TA <br />FUCK THE TA<br /><br />Tommy NG FUCK YOU<br />Just not be caught by the TA for any mistakes",
            "comment_grading": "Assignments (5)10% - one 70/100, other all 100<br />After class exercise (best 8/9)15% - all 100<br />Reading Assignment (5)15% - all 100<br />Class Participation 15% - unknown<br />Project Presentation10% - 8/10 ; mean 7.1<br />Project Report (2)10% - 1.95/100; mean91.1, 2.95/100; mean 94.8<br />Web Site Design 5% - unknown<br />Final Exam20% - 70/100; mean 75.68 sd9.13<br /><br />my grade: B<br /><br />Actually the grade is not very leng at all, all my groupmates got B range, but our project got above mean.<br />Assignments just do it very hea is fine, most of the time, TA will directly give 100 marks. BUT I HAVE BEEN SUSPECTED BY THE TA, HE SAID I COPIED ONE OF THE ASSIGNMENT DIRECTLY FROM ONLINE. He first gave me 20/100, after I sent email to ask him, he changed to 70. <br /><br />The TA is not responsible at all, he just gave me the total mark of my exam. I already hold my temper saying I would like to know more regarding the mistakes made. The biggest issue to your score is due to the high turnitin rate. BUT THE FACT IS THERE IS NO TURNITIN IN THE EXAM. And it is an open book exam. I tried my best to use my own words.",
            "comment_workload": "Chur.<br />The schedule is quite packed for a summer course. Every class has after class exercise. <br />Every week has at least one reading assignments<br />Every week has at least one assignments<br /><br />Though all assignments can hea do, project groupmates are more important. 5 people in one group. Web design is hard. A good groupmate who know how to use wix.com is crucial.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 5,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8fKvgeSshfoU7rasKOr8KCaZJgzueo2p",
            "semester": "2014-15 Summer",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "vs",
            "date": "Aug 25, 2015",
            "title": "Disorganized professor, interesting content",
            "comment_content": "Introduction to e-marketing, e-commerce, m-commerce including topics like web analytics, auctions, e-commerce business models and advertising models, stickiness, long-tail theory, e-payments, security measures, e-currency [e.g. Bitcoins] etc etc. Relevant case studies and newspaper articles are featured. Straightforward, memorization-based, not too much synthesis, but interesting to learn IMO.",
            "comment_teaching": "Meh. He has an entertaining Malay accent. Professor was very disorganized, forgot to upload documents onto the Canvas portal and failed to properly address topic and contents of the group presentation. TA not too much of help either.",
            "comment_grading": "Make sure you nail the exams. I did f*k up my final exam [40% weighting], so my standing went from an A+ to a B at the end. Everything else aside from the exams should be relatively straightforward to capture [participatory grades, presentation, report, couple of assignments]",
            "comment_workload": "Pretty light. Must attend classes though, because as it is a Summer course pace is very fast - even though the contents may seem simplistic to trivial, the slides are very very ambiguous and have not nearly enough notes on their own to make self studying worth it. Make sure you get a good [read: diligent] group of groupmates together. Powerpoint has to be effective, just like other business school powerpoint presentations that you've had to put together.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hwMrklMJ6o7W5AFhywZA03eq6uEU8ixi",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DanielChan326",
            "date": "Jun 28, 2019",
            "title": "Great course and easy to earn grade",
            "comment_content": "Overview:<br />The Internet is reshaping the way we do business. Despite the dot com bubble in the beginning of the century, the world economy is more digitized than ever before. The Economist magazine once reported, “No company can any longer afford to ignore the internet, even if it does not sell much or anything at all online.” [15 May 2004, p.9].&nbsp;&nbsp;Firms must rethink how they generate and deliver value, as well as how they attract and retain customers.<br /><br />The focus of learning is to provide students with an understanding on how organizations can exploit and have exploited Internet and related technologies as a means to effectively reshape their business strategy. This course introduces fundamental concepts, principles and technologies of e-business management; including web development, web and social media analytics, online marketing techniques, online payment methods and cybercurrency.&nbsp;&nbsp;This course is suitable for students from a whole range of science, engineering and business backgrounds. <br /><br />Upon completion of the course, the student will be able to:&nbsp;&nbsp;<br /><br />Describe the content and interconnections of the e-business model using the blocks of the CANVAS model.<br />Describe the basic marketing concepts needed to understand internet marketing.<br />Identify and describe basic e-business marketing and branding strategies.<br />Analyze web traffic, visitor analysis and search engine optimization.<br />Discover useful knowledge from Web hyperlinks, page content and usage log.<br />Understand the importance of the supporting role of electronic payment and security system in e-commerce.",
            "comment_teaching": "He can always use less than 2 hours to teach everything; and then he can leave earlier than he suppose to work for. <br /><br />7 x&nbsp;&nbsp;reading assignments on class with very short time for you to digest.<br /><br />When I ask him for assistance in making web analytics, he simply says we are business students and supposes to know how to figure it out.... I mean.... I come to class to learn because there is someone gets paid and suppose to teach, hear this is heartbroken and I really want to drop this shit course.... but it is too late now;)",
            "comment_grading": "Midterm tips for u: (20%)<br />- every main ideas from the ppt<br />- every unclear pictures in ppt<br />- every startup company's name and what they sell<br />- How much Unicorn worth? 1 billion!<br />- Every reading assigned by him can be found in the LQ<br />- every start-up websites name<br />- Every on-class reading assignment's main idea and company names.",
            "comment_workload": "No workload significant",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8w5kIUPXoAwyxlSmzerNXn1lovGVFBbA",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1096,
                    "name": "LEE, Dongwon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sharken",
            "date": "Jan 29, 2019",
            "title": "",
            "comment_content": "Basic e-business concept<br />1. E-business foundation <br />2. E-business application <br />3. Web design and ux<br />4. Web analytics <br />5. Search engine optimisation <br />6. E-mail marketing <br />7. Paid search<br />8. Mobile commerce<br />9. Display advertising <br />10. Social media<br />11. Blockchain",
            "comment_teaching": "基本上係照住notes讀 有時會provide extra example 去解釋d concept 但其實如果唔識個concept 既話 google一Search 就有好多解釋 算係易明",
            "comment_grading": "Individuals assignment <br />&nbsp;&nbsp;&nbsp;&nbsp;- google digital garage (做到就滿分） （10%）<br />&nbsp;&nbsp;&nbsp;&nbsp;- article review (10%）<br />Group project (20%)<br />&nbsp;&nbsp;&nbsp;- 幫間ngo做ppc and Seo strategy optimisation <br />&nbsp;&nbsp;&nbsp;- have a final presentation 對象係ngo 代表and professor <br />Mid term exam (20%)<br />&nbsp;&nbsp;&nbsp;- easy and straightforward <br />&nbsp;&nbsp;&nbsp;- mc + short q<br />Final exam (25%)<br />&nbsp;&nbsp;&nbsp;-non cumulative <br />&nbsp;&nbsp;&nbsp;- mc + short q<br />&nbsp;&nbsp;&nbsp;-straight forward <br />Class participation <br />&nbsp;&nbsp;&nbsp;- 有兩三堂guest speaker 做sharing 有去take attendances就滿分 （5%）<br />Quizzes <br />&nbsp;&nbsp;&nbsp;&nbsp;-因爲上堂冇時間quiz所以最後全速人都滿分 （10%）",
            "comment_workload": "唔太辛苦<br />考試最緊要明個concept 勁多mc 考你application 同concept definition<br />Article reviews 比較煩 幾曬時間 又要睇文又要延伸 同埋有 word limit",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "fi6a0FmeRWQonvos5CpU8AkIuUgBOTCA",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1096,
                    "name": "LEE, Dongwon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hellooo",
            "date": "Aug 08, 2023",
            "title": "",
            "comment_content": "Easy content (quite interesting) <br />- E-business fundamentals<br />- Search engine marketing<br />- Social media marketing<br />- Email marketing<br />- Web design and user experience<br />- Display advertising<br />- Mobile commerce<br />- Cryptocurrency and Blockchain",
            "comment_teaching": "Prof is nice, will provide some examples for further explanation. He has a bit Korean accent but overall easy to understand. He is willing to answer questions.",
            "comment_grading": "Good. If you study all lecture materials, then you should be able to get a good grade.",
            "comment_workload": "Midterm (mainly MCs + SQ)<br />Exam<br />Attendance (group presentations, industry expert seminar)<br />2-3 individual assignment (Google Analytics + one essay)<br />Project (Help NGOs to promote and achieve certain goal, nice and interesting experience)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vHIzac7P9wXJmxI0TmeWWEZpQMYHfiap",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1096,
                    "name": "LEE, Dongwon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "eosl999",
            "date": "May 20, 2023",
            "title": "",
            "comment_content": "Introduction to e-commerce and focus on technical subjects (SEO/SEM, digital marketing, cryptocurrency, web design etc)",
            "comment_teaching": "Engaging and funny professor but sometimes rushes over things",
            "comment_grading": "Not received yet<br />20% midterm<br />30% final<br />assignments = 10%<br />grou project = 30%<br />attendance/participation = 10%",
            "comment_workload": "Midterm: covers topics from start of semester up till midterm <br />Final: non-cumulative; only covers topics after midterm <br />Assignment 1: complete online google analytics 1 or google analytics 4 course and submit a copy of certificate to TA; since the course certificate is issued after completing a test, can find answers online to do test quickly<br />Assignment 2: business idea proposal based on movie ready player 1<br />Group Project: provide a SEM plan for NGOs and present this (no report needed)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "446LAlRK5ZmKK93utUbVHlsu0g27dwm5",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1096,
                    "name": "LEE, Dongwon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "VLi",
            "date": "May 24, 2021",
            "title": "The Best IS Course in UST",
            "comment_content": "1. E-Business Fundamentals (3 sessions)<br />2. Search Engine Marketing (2 sessions)<br />3. Web Analytics<br />4. Web Design and User Experience<br />5. E-Business Theories and Applications (2 sessions)<br />6. Display Advertising<br />7. E-mail Marketing<br />8. Mobile Commerce<br />9. Emerging Topics in E-Business (Crypto and Blockchain)<br />10. Industry Expert Seminar (2-3 Guest Lectures)<br /><br />In short, this course is like an easier extension of ISOM2010.",
            "comment_teaching": "Professor Lee is a passionate individual and is not an asshole. Although he has a thicc Korean accent, it is still understandable if you compare his lectures with Jiajia. His slides and lectures are easy to understand and on point, well-above the IS course standard. His style is a lot more relaxed so he does not cold-call or force students to turn on their cameras.<br /><br />His course is more like a business strategy / digital marketing course than an IS course; you will be able to tell the difference in teaching style and methods for this course in a positive way. It could be a little boring, but the content is useful.<br /><br />He responds to emails very quickly and always gives a clear response if you have doubts. <br /><br />Having connections in the industry, he invites guests to share industry trends and views, which adds a lot of value in the learning process.<br /><br />While most IS professors will tell you how amazing IS is and give you the crappiest learning experience and grade, Professor Lee offers major good vibes; you can tell he genuinely wants good things to happen to his students, preparing us with more up-to-date industry knowledge and setting us up for success in many ways.",
            "comment_grading": "Class Participation : 10%<br />• I've attended every class and turned on the camera for like half of the lectures.<br />• I've only participated once or twice in class, and sometimes I comment in the zoom chat, grades were not released for this component so I don't know how well I did in this component.<br /><br />Individual Assignments : 15%<br />• Assignment 1: Complete Google Digital Marketing Course (10%)<br />• Assignment 2: US Tech stock trading simulation based on content learnt in class (5%)<br />• Assignment 1 is a completion grade and grades were not released for Assignment 2.<br /><br />Group Project : 25%<br />• Throughout the semester, a group will develop a search engine marketing (SEM) strategy for a<br />non-profit organization in Hong Kong.<br />• Group projects consist of two parts: <br />1) develop a search engine optimization strategy (SEO) and<br />2) develop and implement a paid per click (PPC) strategy.<br />• A group will be acting as consultants and deliver a search engine marketing strategy to the client<br />NGO.<br />• Grades were not released for this component.<br /><br />Midterm Exam : 20%<br />• If you study for it, you will do well; it's memorization-based and not tricky at all. <br />• I scored 1 SD above mean here.<br /><br />Final Exam : 30%<br />• Same style as Midterm; grades were not released for final.<br /><br />Final Grade: A",
            "comment_workload": "The workload is generally appropriate and closer to the lighter end.<br /><br />I personally think the group project has the heaviest workload; you actually have to run a digital marketing campaign. After which you would analyze results with your team and put them into a 15-minute presentation along with what you learned.<br /><br />The other assignments are easy and manageable.<br />Just study hard for the Midterms and Finals; memorization-based, no tricky stuff.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "d8pjdbLW3bXrzU1svL6UcYUB1ESV5o4v",
                    "name": "Syllabus_ISOM3310_S2021",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "EBNQFJcZ44h8l4uA3KjBX4rsw5NSFjL3",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1096,
                    "name": "LEE, Dongwon",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cwyyy",
            "date": "May 23, 2021",
            "title": "Recommend to IS Students",
            "comment_content": "10 topics covering both foundations and advanced topics about e-business are: <br />1. Fundamentals: History, Characteristics of e-Commerce, Business Model Canvas, Internet (TCP/IP) etc.<br />2. Search Engine Marketing<br />3. Web Analytics<br />4. Web Design &amp; User Experience<br />5. E-business Theories &amp; Applications(Platform, Network effects)<br />6. Display Advertising<br />7. E-Mail Marketing<br />8. Mobile Commerce<br />9. Social Media<br />10. Cryptocurrency<br /><br />The content is quite up-to-date. It would be interesting if you are into e-Commerce industry. The content itself is not hard to understand too. The content covered in Fundamentals part is more like ISOM2010. Easy to begin with.",
            "comment_teaching": "Quite boring to be honest... The professor does not have much accents so it's easy to understand, but he is quite monotonic and simply reads out the slide only. He provides some extra examples to illustrate the idea occasionally. Many videos are played during the lecture and some of them are quite long, so it gets bored (sometimes the professor still keeps on talking even when it's time to end the class). <br />He sometimes left out some blanks in the slides so you have to fill the words back (just a few throughout the entire semester). The slides are easy to understand because they are quite wordy... it won't be a problem even if you skip the lecture and read the slides yourselves.",
            "comment_grading": "Midterm (20%) &amp; Final (30%): Straightforward, easy if you revise all the lecture materials (Unexpectedly, there are many questions about definitions lol so make sure you know the terms). MC and short-essay questions (Some calculations about costs and impressions are also included)<br /><br />Project (25%): Should be find if you find yourselves some motivated groupmates. You should launch an SEO campaign for an NGO, so make sure you applied the concepts and techniques covered in Search Engine Marketing part. Just remember to include key concepts and specific terms in presentation.<br /> <br />Assignments (15%): 2 assignments in total. <br />(Assignment 1: 10%, Assignment 2: 5%) Just remember to complete them on time and you will get full marks. Not very complicated. <br /><br />Class participation (10%): He said in the beginning of semester that he will give out extra credits for those asking thoughtful questions or answering questions in class.... But obviously he did not have enough time for that... So you can probably ignore this part lol I didn't participate in class but still got a good grade. But REMEMBER TO GO TO THE GUEST LECTURES FOR TAKING ATTENDANCE!<br /><br />Got above mean 1 SD for mid-term, full mark for Assignment 1. Unknown for other parts (but I think they are all good?)<br />Got an A- at last :)",
            "comment_workload": "OK as an IS elective course. The workload is not high but you still need to put in effort for the project part. <br /><br />Mid-term &amp; Final: Easy if you remember all the stuffs from the slide. Nothing tricky. Good if you can memorize things well.<br /><br />Project: Make sure you give yourself enough time to draft the campaign before launch. My group was the first batch for the project and literally got 4 DAYS to discuss everything. A very rush schedule so better if you can get yourself a later timeslot. (Our group didn't manage to grab the later ones...)<br /><br />Assignments:<br />1. Need to complete Google Digital Garage online course. Submit the certificate through Canvas. Some questions to answer after watching each video, but resources are available online. Easy to get full mark. <br /><br />2. Investment portfolio report (3-page) from an equity trading simulation. You need to choose some stocks to invest throughout the semester, and then explain the reasons behind and the stock performance with news and industry reports. Kind of annoying for a student without any financial idea like me. Just add those e-business concepts discussed in class then you'll be fine!",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZjJmxgqpdyReDxg30YJqZCuDobZ8jRxR",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ustbuddy",
            "date": "Aug 29, 2020",
            "title": "Good elective course for IS student",
            "comment_content": "It teaches basic e-commerce business model, like how e-commerce emerge and advance. I personally think that the most practical part would be the technique of e-business marketing and branding strategies, such as SEM and SEO. Quite fun to create a website and promote it on Google.<br /><br />•\tDescribe the content and interconnections of the e-business model using the blocks of the CANVAS model. <br />•\tDiscuss the lesson from the failures of Unicorn.&nbsp;&nbsp;<br />•\tIdentify and describe basic e-business marketing and branding strategies.<br />•\tAnalyze web traffic, visitor analysis and search engine optimization.<br />•\tDiscover useful knowledge from Web hyperlinks, page content and usage log.<br />•\tUnderstand the importance of the supporting role of electronic payment and security system in e-commerce.",
            "comment_teaching": "Prof. TEH teaches fairly well. His accent is quite interesting(positively), you won't fall asleep easily. The pace of teaching is fairly good in terms of a summer course. Sometimes he reads out from the slides and sometimes he adds elaboration off the cuff. He skim through some interesting/important content such as SEO and blockchain tech very quickly, while I wanted to know more about it. <br /><br />He shows 1-2 videos about e-businesses such as Amazon, Netflix, etc every lesson.<br /><br />However, he only gave minimal/nearly none guidance on the group project. We didn't know what he is asking for in the presentation, as well as the project report.",
            "comment_grading": "Grading is good. Nearly everyone got full marks on the assignments (40%) and participation(15%).<br /><br />We got a 1-2 marks above mean in the project report and slightly below mean in the project presentation. <br /><br />He didn't release the exam score so I can't judge.<br /><br />Got an A at the end.<br /><br />Course Assessment:<br />Assignments (5)\t\t\t\t10%<br />After class exercise (best 8/9)\t\t\t15%<br />Reading Assignment (5)\t\t\t15%<br />Class Participation \t\t\t\t15%<br />Project \tPresentation\t\t\t\t10%<br />Project Report\t(2)\t\t\t\t10%<br />Web Site Design \t\t\t\t5%<br />Final Exam\t\t\t\t\t20%",
            "comment_workload": "Workload is not so heavy. Just a final exam, project, and 2-3 easy assignment(Reading material required) every week. <br /><br />You don't have to read every part of the reading material, just simply search the key word would do.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nYES6vI8ZXFv5bqiX5qsCA35GQomFPOD",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rsternyin",
            "date": "Jul 20, 2019",
            "title": "Good Grade, Heavy Workload",
            "comment_content": "Week 1<br />- Electronic Commerce Introduction<br />- Business Model Canvas<br />- Start up <br />- Google<br />- Netflix<br /><br />Week 2<br />- Digital Marketing<br />- Long Tail<br />- SEO<br />- Social Marketing<br /><br />Week 3<br />- Personalization<br />- Web Analytics<br />- Amazon<br />- Platform Business<br /><br />Week 4<br />- E-Security<br />- Payment<br />- Encryption",
            "comment_teaching": "Super heavy accent, probably from Malaysia.<br />Not just reading the powerpoint but indeed teaching quite useful knowledge, describing current market situation.<br />However, I believe he has some problems in listening skills. During many presentations, he will just listen to a part of it and make an assumption that all of our presentation is going to be about that much, often misinterpret your idea, difficult to communicate as he won't take much of your idea and insist on his own.<br />Asking TA will be more helpful as she will mark your website, but try your best not to make professor confused during presentation or else you will GG.",
            "comment_grading": "Pretty good grade<br />Assignments (4)&nbsp;&nbsp;8%<br />In-class reading (best 5/7)&nbsp;&nbsp;5%<br />Reading Assignment (3)&nbsp;&nbsp;12%<br />Project Presentation 10%<br />Project Report (2)&nbsp;&nbsp;10%<br />Web Site Design&nbsp;&nbsp;5%<br />Mid Term&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Final Exam&nbsp;&nbsp;30%<br />Assignment full marks.<br />Reading assignment one got 95/100, others all full.<br />Inclass reading full marks.<br />Project proposal full marks.<br />Midterm above mean 0.3 sd<br />Website 4.8/5<br />Presentation 9/10<br />Project report 97/100<br />Final unknown<br />Final Grade: A",
            "comment_workload": "Super heavy workload.<br />10 lectures in total: <br />1 for presentation, 0.5 for midterm, 0.5 + 0.5 guests talk, 1 for final<br />= 6.5 lectures really teaching<br />7 in-class readings in total, which means almost each lecture got one reading.<br />Every two lectures got 1 assignment + 1 reading assignment<br />Before midterm is the a small project proposal presentation (not count) and the business proposal<br />Two days before final is the deadline of final report + final presentation<br />Chur die.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "T1BFiGNzoNApXruvmQGkqnXg4NEHBSqa",
            "semester": "2017-18 Summer",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kristy",
            "date": "Aug 20, 2018",
            "title": "Fast Pace Summer Course",
            "comment_content": "An introduction on e-Commerce business with a focus and hands on experience on SEO (Google Ads) usage. This course introduces fundamental concepts, principles and technologies of e-business management; including web development, web and social media analytics, online marketing techniques, online payment methods and cybercurrency.",
            "comment_teaching": "Because it is summer course, the pace is very fast. You could miss out easily if you miss class since the professor on average covered two chapters of handouts every class. Even though, not many guidelines were given about the project during class. But you will have consultation time for each team. As for midterm and final, guidelines will be given before exams and this was the most relevant material for reference.",
            "comment_grading": "Assignments (4)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;12%<br />In-class Assignment (best 8/9)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8%<br />Project Presentation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />Web Site Design&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5%<br />Project Report (2)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10%<br />Mid Term&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Final Exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;35%<br /><br />Assignments are short questions with instructions if actions are needed. They are usually easy and not much time consuming. <br /><br />The grading overall is fair. Yet since project and assignment scores varies little, it is not easy to get a very high grade.",
            "comment_workload": "As in such short time period, the workload is relatively heavy - midterm, projects and final can take place every two day. Yet you could get it handled if you have a nice group. <br /><br />For the project, you need to create a website, and make google ads for your product or services. It is excited to see the ads taking effect on Google and it is definitely the fun part. Yet doing the analysis, presentation and report are still quite a lot to do. The advice is to start your campaign as early as possible since the time period when the ads is effective and available for analysis is short.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sPRWuyORLJ7PjarDj2RZ8RRrUFadufOX",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "troll",
            "date": "Jan 22, 2017",
            "title": "Disorganized professor, good grading",
            "comment_content": "This course's content is very disorganized that lecturer separate different parts of the course with no sense.<br />There is even no indicator for topics of different lectures and the pictures that he used to illustrate the model was so small and unclear that no one could read it.<br />There are some readings (from new york times) that you need to memorize in mid terms and exam that would be send to you before examinations. <br /><br />What you learn in the lecture actually does not help much in your project. You are required to present and do a report about starting up your own e-business. Nearly no guidelines were given and it was the most confusing projects I have ever done. He would give you a hundred dollars to play with Google Ad words but turn out it seems that he does not care about it at all.<br /><br /><br />From class and quota:This course introduces the fundamental concepts and technologies of e-commerce and e-business management. Topics include e-business models, e-business infrastructure, e-security, e-marketing, e-payment methods, web development, web analytics, and social media analytics.",
            "comment_teaching": "Dull, nonsense and confusing.<br />Lecturer:<br />Please do not expect any from this lecturer as you would learn all the content by yourself at last. Super stong Malay Singaporean accent that I don't know why he could be teaching in UST. Disorganized lecture notes as well as his teaching in class, I feel helpless when I ask him questions about the lecture content or project.<br /><br />He is quite stubborn in which he banned all topics that he dont like (even we found successful references from other countries)&nbsp;&nbsp;and he does not make enough responses to the progress report or any submission about the project. Marking of the project was not transparent. Most people feel like the questions he raised after presentation were nonsense.<br /><br />Ta: <br />slow marking for assignments.<br />Just saw him at the last lesson, no extra comment for him.",
            "comment_grading": "I take this course because the grading is good only.<br />86.4 % -&gt; B<br />for all project related items-&gt; below mean<br />presentation -&gt;&nbsp;&nbsp;sightly above mean<br />Mid term -&gt; mean<br />Final -&gt; Sightly above mean<br />Assignments -&gt; mean",
            "comment_workload": "Light workload, assignments were easy and the projects depends on how hard you and your group mate work for it. <br />Mid term and final just about memorization and many long questions were about the readings and some MC were about the examples he mentioned in class.<br /><br />Good luck for people who are going to take this course.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MoGSZT7kRHMkkH26qw0H8ZoAbsw914bm",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Stephcy",
            "date": "Sep 14, 2016",
            "title": "Easy grade, bad prof",
            "comment_content": "ISOM3310 - Electronic Commerce and e-Business <br /><br />Management <br />This course introduces the fundamental concepts and principles of e-commerce and e-business management. Topics include e-business models, e-business infrastructure, e-security, e-marketing, e-payment methods, relationship between e-business and traditional business, the roles of customers, suppliers and employees, future development, etc.",
            "comment_teaching": "Super strong Malay Singaporean accent. I don't think he's actually qualified to teach since most of the stuff he says is either on the slides, common sense, and occasionally nonsense. Extremely disorganised and forgets what he says himself. At one point my group was given a 0 for the first component of our group project because he didn't even bother to read nor check if we handed it in. We had to remind him that we had submitted it and even then, he completely did not grasp what our content was and somehow deviated completely off of what we wrote. It's also concerning how he doesn't really know how to use a computer e.g. how to fullscreen a youtube video and so on.",
            "comment_grading": "Quiz and final are pretty easy so as long as you study the slides and the readings. His final study guide is basically what the exam will be about (except for one or two questions that were on completely unrelated materials that he did not discuss in class). But do go for paper checking. I found a few mistakes and it seems he arbitrarily awards marks for the short answers.<br /><br />Overall an easy ISOM course to score a nice grade on so it's worth taking if you're willing to stand the professor. But note that other people will be doing well too so if you slack on the easy exams and don't do the assignments, prepare for a below average grade.",
            "comment_workload": "Standard and easy group project and presentation. Assignments are basically reading comprehension so they don't involve any reading. The exams don't require that much studying for -mostly memorisation. Not a course that will take up too much of your time.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eoViKyr0CbvWJkXW3fXPRVRX8jxXaZkK",
            "semester": "2020-21 Summer",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "skmt_kn14",
            "date": "Aug 08, 2021",
            "title": "",
            "comment_content": "1. business models<br />2. e-commerce intro<br />3. Google, Netflix<br />4. Digital marketing &amp; longtail<br />5. Search Engine Optimization &amp; social marketing<br />6. Amazon, Personalization &amp; web analytics<br />7. payment, platform business model<br />8. blockchain, encryption, e-security<br /><br />I think the content is quite interesting. It is very similar to ISOM2010 and marketing courses. The group project is a marketing campaign with the use of some technical tools (e.g. Wix, Google AdWords, Statcounter).",
            "comment_teaching": "Prof will randomly ask people to answer questions and show 3~4 videos every lesson. Sometimes he will end the lecture early when he finished teaching all the content of the day. It seems he will not reply the emails related to technical problems in the group project. So we have to learn the web design, web analytics, google ads and other things by ourselves.",
            "comment_grading": "Assignments (5)\t\t\t\t10%<br />After class exercise (best 8/9)\t\t\t15%<br />Reading Assignment (5)\t\t\t15%<br />Class Participation \t\t\t\t15%<br />Project \tPresentation\t\t\t\t10%<br />Project Report\t(2)\t\t\t\t10%<br />Web Site Design \t\t\t\t5%<br />Final Exam\t\t\t\t\t20%<br /><br /><br />Super good grade -&nbsp;&nbsp;assignment full marks, project proposal and presentation hit the mean, project final report above mean a bit, other parts unknown. <br />Finally get an A.",
            "comment_workload": "Quite a lot of readings and assignments to finish. There are a total of 19 assignments in 24-day summer semester. I think each can be finished within an hour since you can get full mark as long as you write a lot of words. <br /><br />The final exam is open-book and short-essay format. There are 4 questions and each contains 2-3 sub questions in 2 hours. Just need to spend 2~3 days studying the lecture slides and reading materials then you can perform well in exam. Follow the study guide is ok.&nbsp;&nbsp;<br /><br />Group project workload depends on your groupmates. <br /><br />Overall workload is acceptable and worth the grade.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5MsjRiCoNUTx6tNKzEV0Qvp8YXXrja68",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lmk",
            "date": "Jul 22, 2019",
            "title": "",
            "comment_content": "The history of e-commerce<br />The different business models of some well-known e-commerce like Amazon and Netflix<br />The strength of e-commerce like long tail<br />Digital Marketing like search engine ads<br />Encryption and security<br />(NO Maths involved)",
            "comment_teaching": "The professor has a strong Malaysia accent.<br />In his lecture, he will use some videos to illustrate some ideas.<br />He is friendly to answer your questions after class.<br />There are few assigned readings for you learn more and the content is interesting.<br />The pictures in the lecture notes is very blurred so sometime you need to search from the internet to find the picture for revision.",
            "comment_grading": "The most decisive factor is the Finals exam and the project.<br /><br />4 Assignments - full mark<br />Attendance - full mark<br />Proposal - full mark<br />Final report - nearly full mark<br />Presentation - 9/10<br />Midterm -&nbsp;&nbsp;0.5 SD above<br />Final - unknown. I think I score above mean but not above 1 S.D as I screwed up one long question.<br /><br />Final grade - A",
            "comment_workload": "4 assignments <br />class exercise (attendance)<br />proposal<br />Final report<br />presentation<br />Midterm<br /><br />The project depends on how much time you spend on the project. Also, it is strongly recommended to prepare well for the presentation as it is one of the decisive factor of your grading. Time management is important. So, it is important to find good groupmate to reduce the workload. The project is about starting a marketing campaign for your company with the use of AdWord and Web Analytic. It is not hard and straightforward. <br />For the Midterm and Final, you just study and understand the concept of the lecture notes and assigned reading and everything will be ok. No tricky question. It is okay to study before 1 to 2 days as the content is not difficult to understand. There is study guide for the midterm and exam, all the questions are within the guide.<br />The assignments are not time-consuming, you can finish within 2 hours. Basically, only reading comprehension. <br />You need to attend the lecture for the class exercise.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8YzRv1VvsJc7bq9kRK3mbRxHJ0hqWMAw",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ytsang",
            "date": "Aug 30, 2021",
            "title": "",
            "comment_content": "Content mostly about the platform business, web analytics only used in the web design group project<br /><br />Course Content included:<br />L1 - Introduction to e-Business<br />L2 - The Business Model Canvas<br />L3/4 - Google/Netflix<br />L5 - Digital Marketing Introduction, Digital Marketing, The Long Tail<br />L6 - SEO, Social Media Marketing<br />L7 - Amazon, Personalization, Web Analytics<br />L8 -&nbsp;&nbsp;E-commerce Payment System, Platform Business Model<br />L9 - Blockchain, E-security, Encryption",
            "comment_teaching": "Teaching is good and clear. Tech always interacts with students to answer questions and share opinions.",
            "comment_grading": "Grading is normal, so so, not bad. Presentation grading criteria are not very clear and flat among groups. <br /><br />For group project, the task was to build a webpage and made ad on Google (adwords and adsense). However, it is not easy for a newly-establish website to be trusted and it is hard for us to do analytics. Teh did have some methods to analyse but we thought it was somewhere unfair.",
            "comment_workload": "Workload not very high but assignments and exercises come one by one.<br /><br />There are in total 5 assignments, 9 after-class exercises, 5 reading assignments, 1 present with the report, and 1 final exam.<br /><br />The assignments are not difficult to do but come right after every lesson. The lesson ends at around 12:10 every Monday, Wednesday, and Friday. However, the after-class assignments were dead at 17:00. It made a huge burden on me as I had another afternoon summer course that ended at around 16:30.<br /><br />For website design, it is pretty easy. We are required to use the Wix platform to complete the web design and suggested using StatCounter for website analytics. Teh is familiar with StatCounter and uses it quite well. However, I think it is not a very popular tool among web developers. And Wix limits many functions that Teh want us to do in the free version while the paid accounts cost tens of dollars.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "PKmuAxcSRQ6vWQwYOUjJ0xDp0HjjK7GG",
                    "name": "ISOM3310_Syllabus",
                    "format": "doc"
                }
            ]
        },
        {
            "hash": "NPM1KXCW4qnDyZLyRBgTnMfnlc3Gf5t4",
            "semester": "2017-18 Summer",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kvothe",
            "date": "Aug 15, 2018",
            "title": "Braindead course for an Okay grade",
            "comment_content": "Content wise it's extremely easy. If you've done Mark2120 and ISOM2010 you pretty much will understand 70% of the content. The other 30% is understanding the case studies that he presents in class and be able to utilize it in essays in the midterm/final.<br /><br />If you understand how to read and memorize, there will be nothing in this course that will be hard for you.",
            "comment_teaching": "Despite how other people have phrased it, honestly Professor's Jack accent isn't all too bad. He tries to keep his classes 50% slides, 30% videos/discussions and 20% in class assignment.<br /><br />You should always show up in the last hour of the class as that's when he usually hands out the assignment. There's 10 assignments total and you're only allowed to miss 1 of them.",
            "comment_grading": "If you're aiming for a high grade, this might not be the easiest course to do in order to get a good grade as the means will be high and the sd will be quite wide.<br /><br />I got 1 sd above mean in the midterm and 100% for the proposal and above mean for assignments and submitted 9/10 of the in class readings.<br /><br />My final grade was still A- and one of my friends who got below mean in the midterm still managed to get a B+ in the end.<br /><br />You can slack off in this course and still get a decent grade, but don't bother trying hard for this course as I do not know anyone who got an A/A+ in this course at all (in a class of 70).",
            "comment_workload": "Braindead easy, but tedious.<br /><br />Remember to check the deadlines for each one as some of them are just two days apart which can be a hassle, if you're doing more than one course at the same time.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}