{
    "error": false,
    "course": {
        "id": 672,
        "subject": "ISOM",
        "code": "2310",
        "name": "Fundamentals of E-Commerce: Business, Technology, and the Society",
        "description": "The course covers important topics related to e-commerce including unique features of e-commerce technology, the history and background of the Internet, the evolution of e-commerce from its early years to today, key components of e-commerce business models, major trends of business-to-business,  business-to-consumer, and consumer-to-consumer services, the use of various techniques such as search engine analytics, online social networks, and location-based technologies, as well as the ethical, social, and political issues related to e-commerce.  Various prominent e-commerce models and development will also be covered in the course.",
        "categories": [
            "Common Core (SA)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2130,
            2110,
            1930,
            1830,
            1730,
            1630,
            1530,
            1510,
            1430,
            1420,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.23,
        "rating_teaching": 4.29,
        "rating_grading": 3.84,
        "rating_workload": 4.26,
        "review_count": 31,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 367,
                "name": "WANG, Jing",
                "count": 22
            },
            {
                "id": 363,
                "name": "TEH, Jack Her Hock",
                "count": 8
            }
        ]
    },
    "reviews": [
        {
            "hash": "WnCs8qSCODrX1PZks7Id2IpTN7Z8gMYk",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "klaudius",
            "date": "Aug 24, 2016",
            "title": "Good teacher",
            "comment_content": "- History of e-commerce<br />- Internet services and mobile apps<br />- Porter's five competitive forces<br />- E-commerce business models<br />- Online retailing <br />- Online services<br />- Business model of google, netflix, facebook<br />- Social marketing<br />- Mobile and local marketing<br />- Crowdsourcing<br />- Privacy and Information Rights<br />- Intellectual property right",
            "comment_teaching": "Good teacher ! She is nice and friendly to her students and also remembers their names. She also like to discuss issues about e-commerce with her students and open to suggestions",
            "comment_grading": "Grading is good. Around 20% get A range. Final and Midterm Exams are relatively easy, just make sure you memorize the slideshows and you will do just fine",
            "comment_workload": "Light workload, she only gives 1 project for the whole semester to make a presentation about e-commerce",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BMdVdsnMQ88wFWgmCmISgrBn3KmD1ncE",
            "semester": "2013-14 Spring",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sableye",
            "date": "Aug 16, 2015",
            "title": "",
            "comment_content": "It's all about the history of Internet Commerce. As a non-business student in DSE, I was clueless about how most business works when I first got into SBM.<br /><br />The course gave me a lot of insights of how big tech companies work nowadays. Like Amazon, Google etc.<br /><br />The professor also talks about how many companies failed in the dot-com bubble, also the history of the technologies nowadays, like how the telegraph or the telephone act as the main means of communication in the past. <br /><br />The course talks about a lot of concepts that have been / will be covered in other ISOM courses. The concepts include Long Tail, Network Effect, First Mover Advantage etc.<br /><br />There is also a project which doesn't have a strict guideline so you can choose whatever topic you want as long as it is related to the class concepts.",
            "comment_teaching": "The professor is nice, he likes getting responses from the class, but it won't be counted as attendance. He sometimes like to make fun of the students, but he is nice (and quite hilarious in some aspects) in general. <br /><br />He likes to use videos and documentaries in his teaching.<br /><br />He also prints lecture notes for the students each class, which is very non-environmentally friendly but nice of him.<br /><br />He doesn't mind people skipping his lessons.",
            "comment_grading": "It's generally nice grade. I got less than above 1 sd in mid term, around mean in project and unknown in finals, and I got B+ in the end. I think I screwed up in my final because I left an hour early.<br /><br />I think the professor is good grade, or at least not a broken grade. And it all depends on your effort put in the exams.",
            "comment_workload": "A few short assignments, project report and project presentation.<br /><br />And you form your group yourselves. 3-5 people.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "l9Yf2UWD6GX4tM9nUBRxMVCcZPR5Aa01",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "kllauak",
            "date": "Jul 21, 2018",
            "title": "Mediocre course, hard to get good grade.",
            "comment_content": "Content is easy to make sense of, but difficult to truly understand as the concepts seem deceivingly simple and abstract, sometimes not even rigorous. Because of this, slight misconceptions will prove to be detrimental in the midterm and exam, especially in T/F questions.<br /><br />Midterm and Final exams are extremely tricky. MC T/F questions asked were mostly trick questions instead of being straight forward like any common core should. Needless to say, business students will have a huge advantage in identifying such tricks unbeknownst to students from other schools. <br /><br />No past papers were given and the practice paper consisted of only 5 MC and 1 short essay was definitely not adequate for revision. As such it is very easy to fall for the traps and get zero credit unless you are absolutely crystal clear about the concepts.",
            "comment_teaching": "Average at best. As a mainland professor, her English is ok, but listening to her is still boring, and teaching is mediocre, as expected of any average professor. She does encourage class discussion by asking questions<br /><br />I don't even understand how she gets the &quot;common core teaching excellence&quot; award as there certainly are better professors than her.",
            "comment_grading": "Bad would be an understatement. Mean scores are too high as +1SD is already very close to the full mark, and -1/-2SD is very likely, which means students like me who perform adequately (as stated by the ILOs) will still get a bad grade. <br /><br />Furthermore, the grading of the project and presentation is shady. Mean, and SD was given for midterm, but no SD was given for final. Project grade was not released, and so is the class participation, peer evaluation and attendance. Of course the attendance mark can be determined if you attend every lecture like I did, but others are still unknown.",
            "comment_workload": "Very light workload. No homework, no assignment. Just a group project and presentation.<br /><br />Project is conveniently divided into multiple sections that can be completed individually, so freeriders can be dealt with easily. As a group of 5 with 2 freeriders, workload is still manageable for 3 persons.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jhtnhzxPTGRUzmstnIDCALZiWPeS7gs9",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Welium",
            "date": "Jul 03, 2018",
            "title": "",
            "comment_content": "-History of e-commerce<br />-business models<br />-Case Study at several e-commerce companies including Google, Facebook, Netflix<br />-Crowdsourcing<br />-IP rights and privacy related issues over internet<br />Overall a good Common Core course to take to know more about the business world.",
            "comment_teaching": "Good teaching overall.<br />Reasonable pace of teaching with suitable interaction, very knowledgeable with the topics, able to solve most questions students asked.<br />Articulation of the instructor is not the best, but still at an acceptable level.",
            "comment_grading": "I would say OK.<br />I got +0.5SD in bot mid term and Final, and get a B+ overall.&nbsp;&nbsp;Memorization could solve most problems appears in the exams.",
            "comment_workload": "Relatively light.<br />The only assignment is a group project that discuss the business model of an e-commerce company you choose, and the project has some very clear guidelines to follow plus there is a consultation period that the instructor would give further advice on the proposal you submitted.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "j8sTHmIUo9Z38Xs1YuX0uf2ljATowNyW",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HiuYau",
            "date": "Sep 08, 2016",
            "title": "",
            "comment_content": "The content is quite interesting. It talks about the evolution of information technology and application.",
            "comment_teaching": "He is a good professor which teaches well with heart. Although it may be a bit hard to understand his english, his lectures are interesting. And always end class early.",
            "comment_grading": "The grading is very good.",
            "comment_workload": "Only 4 assignments for one page. Answer questions that are quite easy. Examination is easy without too much to study. There is a project to be done in group of 4, with many topics to choose. It is easy and the presentation is casual. Do not take attendance.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vpluqIyh0aWjVWkKuI3S3G16Pyd3KqrJ",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hbe",
            "date": "Aug 26, 2022",
            "title": "pretty good CC",
            "comment_content": "topics/concepts related to e-commerce: <br />its history, unique features of e-commerce technology, Porter’s five forces analysis, business models, successful examples of e-commerce companies, <br />social, mobile and local marketing, <br />ethical, social and political issues associated with e-commerce.",
            "comment_teaching": "tho her voice is a bit flat, Prof Wang explains things clearly and sometimes plays youtube videos. her ppt is really clear and concise. usually has one discussion session to encourage interaction every class and jot important points down so we wont miss.",
            "comment_grading": "class participation: 10% <br />Midterm Quiz :&nbsp;&nbsp;20% <br />Final Exam : 40% <br />Project Final : Report 18% +Presentation 9% +Peer evaluation 3%<br />grading is not so transparent, only know i got abt 18 in midterm, my final grade is A",
            "comment_workload": "acceptable. review notes and ppt before exams and it should be fine. group project takes some time but dates and requirements are stated clearly from day 1. good planning and making sure everyone does his/her part will help.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "G9RkQdbQ2lxsACiMyDguROJhEvBoc7wq",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cheesechess",
            "date": "Aug 03, 2022",
            "title": "好靚grade嘅背書course",
            "comment_content": "同ISOM2010差唔多 <br />講下Internet發展點樣令commerce方式轉變 講下唔同嘅business model，midterm後將之前學過嘅concept套用翻去唔同公司上面，所以都係學返嗰啲嘢。<br />全部内容都淺白易明，唔洗太刻意背，所以即使唔中意背書都可以揀。",
            "comment_teaching": "照讀slides，有時有重要concept/問問題會寫返，唔會miss重點。<br />但把聲音好催眠，會訓著。",
            "comment_grading": "- MIDTERM:<br />MCQ: 9/10(mean:6.9)<br />ESSAY: 9/10(8.9)<br /><br />- FINAL:<br />MCQ: 8.25/15(9.7)<br />ESSAY: ?/18<br />CASE STUDY: ?/7<br /><br />- GROUP PROJECT: ?/?<br />交report之前會交一次proposal 佢會講曬有咩要改善，比分都鬆手<br /><br />-平時上堂答下問題，因爲係zoom，所以跟住人打喺chatbox就ok<br /><br />- Overall got A-，俾分超鬆手！！！",
            "comment_workload": "超少workload，得一份group project，係分析一間e-commerce company，做曬guideline有嘅嘢就ok，平均分翻開每人做好少嘢。<br />不過決定topic要快，唔可以撞題目。",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ozX51OmYGRnjJn56rPOMx8sJ6s3CDjs7",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "//Snow.",
            "date": "Jun 20, 2022",
            "title": "Nice course, learnt alot",
            "comment_content": "Upon completion of this course, you will: <br />=Understand the role of Internet features in shaping e-commerce <br />=Know the history and background of the Internet&nbsp;&nbsp;&nbsp;<br />=Understand the evolution of e-commerce from its early years to today <br />=Learn to analyze a firm’s competitive environment by using Porter’s five forces model <br />=Know the key components of e-commerce business models <br />=Identify the major features and trends of online retailing and services <br />=Understand the business model of search engines such as Google <br />=Understand the business model of content providers such as Netflix <br />=Understand the business model of social network sites such as Facebook <br />=Understand the capabilities of the search engine marketing <br />=Understand the capabilities of the new social, mobile, and local marketing <br />=Recognize the main ethical, social, and political issues raised by e-commerce",
            "comment_teaching": "The professor is very kind and friendly and replies to questions in the chat box very swiftly. She gives out nice grading too.",
            "comment_grading": "Class parti: 10%<br />MT quiz: 20%<br />Final: 40%<br />Project - final report: 18%<br />Project: presentation: 9%<br /><br />-----------------------------------------------<br />I got A-",
            "comment_workload": "No assignment, but with a project with 5-6 ppl in a group. You will get a good grade if you got great groupmates lmao<br /><br />Just attend the lessons and reply to the question shown on the ppt",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VsUlNNnaLrEeFf5LFuTTKL76zzLL5Nln",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hehehe6",
            "date": "Jan 21, 2022",
            "title": "",
            "comment_content": "1. Overview of the Course<br />2. The Internet and the Web: Technology Background<br />3. Internet Services and Mobile Apps<br />4. E-Commerce: Concepts and History Project Announcement<br />5. Porter’s Five Competitive Forces<br />6. Business Models for E-Commerce<br />8. Online Services<br />9. Google’s Business Model<br />11. Case: Netflix<br />12. Case: Facebook<br />13. Search Engine and Social Marketing<br />14. Mobile and Local Marketing Project Proposal<br />15. Crowdsourcing<br />16. Privacy and Information Rights<br />17. Intellectual Property Rights<br />18. Project Presentation",
            "comment_teaching": "The professor clearly explains every detail, so it is pretty easy to understand the concepts. This was one of the courses that I didn't need to review after the class to try to understand what I learned in class. It's a common core course after all, so the content is pretty simple and self-explanatory.<br />The professor is very nice and will answer your questions after class.",
            "comment_grading": "Class Participation: 6%<br />Midterm Quiz: 24%<br />Final Exam: 40%<br />Project:<br />1. Final Report: 18%<br />2. Presentation: 9%<br />3. Peer Evaluation: 3%<br /><br />The professor is lenient when it comes to grading. As long as you put the effort into studying, you should be fine.",
            "comment_workload": "There is not a big workload. There are no regular assignments.<br /><br />There is one group project though. You'll have to form your group at quite an early stage of the time, so make sure you find the right people. I made the mistake of forming a group before really knowing the people. Don't make the same mistake. Make sure others in the group also have similar work standards to yours, or else you would struggle. If you can't form a group, I think it's also a good idea to let the professor assign you the group randomly.<br /><br />But overall, I would recommend this course if you're looking for a common core course!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mkHkIJ6unmP4WqoKum1C3c4nK1zMHXjp",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "yukihalo",
            "date": "Sep 01, 2020",
            "title": "",
            "comment_content": "Talked about some basic business models performed in E-commerce. Some of them are pretty up to date. <br />Some companies are used as examples eg Netflix and Google for case studying.",
            "comment_teaching": "Very boring, basically reading out ppt. <br />Need to attend the lectures because there are things not included in the ppt will be mentioned, like the answer of the questions in ppt.<br />CHINESE english pronunciation",
            "comment_grading": "Class participation 10%<br />Midterm quizes 20%<br />Final exam 40%<br />Project<br />- Final report 18%<br />- Presentation 9%<br />- Peer evaluation 3%<br /><br />Midterm 12.58/20<br />Final and project grade not shown<br /><br />Final grading: C",
            "comment_workload": "Not heavy. <br />Exams can refer to ppt but still better to attend lectures.<br />Get some good group mates for your project.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OSNYxSKHtOmnEo4DaYYINMKE3IuDfJrN",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kentung",
            "date": "Aug 18, 2020",
            "title": "",
            "comment_content": "The course is easy to obtain. (don't have to queue in the waitlist even I registered it late, which initially makes me feel that it is not a great course that not many want to register it, but time proved the otherwise.)<br /><br />Some parts of the contents are interesting and most parts are easy to understand that just feel like common sense, just it is explained with some fancy/professional words. The contents are related to our daily life as well.<br /><br />The course uses some famous e-commerce companies as examples like Netflix, Facebook and Google.",
            "comment_teaching": "Professor is nice.<br />Atmosphere is nice (online teaching)<br />She is responsive that she is very willing to answer our questions during lecture. (I think online teaching facilitates that as students can just type in questions and professor can easily see it. Shy/can't-speak-fluent-English people can ask questions easily too.)",
            "comment_grading": "The grading is nice.<br /><br />Participation: 10%<br />Midterm Quiz: 20%<br />Final Exam: 40%<br />Project Final Report: 18%<br />Presentation: 9%<br />Peer Evaluation: 3%<br /><br />Midterm and final exam are easy. But the time is a bit tight so remember to do it faster. Don't have too much hesitation.<br /><br />The only flaw is that for the final grading, she didn't explain too much about how come we get the grade she gave us, especially for the final report.",
            "comment_workload": "The lecture is not boring so even though there is participation mark, I don't feel any burden at all. She says if you ask/answer questions, you will have a higher participation mark. Many people actively participate so the atmosphere is nice.<br /><br />I got an A-. I jot notes and pay attention in class. I only read through all the lecture notes briefly before mid term and final exam. I think the workload is light. It doesn't take too much extra time outside classes to get good marks in exams.<br /><br />But the project is more time consuming. You have to do research, write proposal and practice with group mates regarding the presentation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "s3hwOe8gzFY2PUXtJFEwgnaA100EZu5o",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ogt",
            "date": "Jun 06, 2020",
            "title": "",
            "comment_content": "Content covered is as described in the other reviews. Overall, this course was ok, but almost everything is very intuitive. I feel like I have a better understanding of e-commerce, but I could have definitely learned all this online very easily if I needed to.<br />Some of the topics included are outdated in my opinion. When we did a case study of Netflix, most of the lecture focused on Netflix's original business model (mailing DVDs to people), and we barely discussed the new Netflix we all know (video on demand) so I was a bit disappointed by that.",
            "comment_teaching": "Teaching is good. She is a very nice professor, willing to answer questions and help students. English is good.<br />This semester was ONLINE due to covid19, but she still managed to interact with us, mainly through the chat which she went through regularly.",
            "comment_grading": "Class Participation 10%<br />Midterm Quiz 20%<br />Final Exam 40%<br />Project Final Report 18%<br />Presentation 9%<br />Peer Evaluation 3%<br /><br />This course lacks transparency when it comes to grading, the only score we received was for the midterm, the rest I have no idea.<br />Because the content is quite intuitive, the midterm mean was very high. Mean was 16.4/20 and SD is 2. I got 16.17/20.<br />Nonetheless, I ended up with an A-, so I must have done well on the rest.<br />I have no idea how she graded class participation as it was all online and we only exchanged with her through the chat.",
            "comment_workload": "Overall fine. You barely have to study for the midterm and final, just make sure to review the content and her study guide. For the final, make sure you can calculate PageRank of a page and ROI because there were questions on both those topics, which are not necessarily intuitive and can help you differentiate yourself from others in the final.<br /><br />For the project, I think the workload is quite heavy but you have plenty of time to work on it and if all tasks are shared equally between members then it shouldn't be too bad. Presentation slides should be clear and easy to look at as the presentation is only 13 minutes to cover almost 10 different topics.<br />Good project companies in my opinion: Airbnb, Foodpanda, HKTV Mall",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2StqZmWRYG6YayN6ENCgmNN7bbNLeuMv",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mmmeow",
            "date": "Jan 22, 2020",
            "title": "伏 （？）",
            "comment_content": "The content is not bad. As a BBA student myself, I find the topics quite interesting. It's like a mixture and introduction of a few bba courses.",
            "comment_teaching": "Her teaching is ok. She encourages students to discuss in class. We form groups to discuss and it is better if you answer questions in class.",
            "comment_grading": "I got a C+ ..<br />The mean for the midterm is 79.6 and I was slightly below it. I don't know how did I perform in both the project and the final.",
            "comment_workload": "As a common core, it has 1 midterm, 1 final and 1 group project with a proposal, report and a presentation, so I don't think the workload is that light but fair.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FKQiLc6HcHGNtBCjbJ3SC7xFXVgoIO5s",
            "semester": "2018-19 Spring",
            "instructors": [],
            "is_author": false,
            "author": "lucas123abc1",
            "date": "Aug 20, 2019",
            "title": "It is a good course that gives you an insight into e-commerce",
            "comment_content": "This course is helpful in learn more about e-commerce, including the business model, history and the relevant technology.",
            "comment_teaching": "The content is explained clearly using PowerPoint. The pace of teach is appropriate. The class is pretty interactive and questions are welcomed after class.",
            "comment_grading": "The grading is decent.",
            "comment_workload": "In general, the workload is appropriate. <br />There is only a group project studying the business model of an e-commerce company. You would need to submit a project proposal at around the time of midterm and do a final presentation before the final exam.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fOLde0wGnBNIpNgeCBgx0683tOLLqXUE",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hcak",
            "date": "Aug 19, 2019",
            "title": "",
            "comment_content": "easy to understand<br />most content are common sense<br />will have advantage if you are a business student<br /><br />-The Internet and the Web<br />-Internet Services and Mobile Apps<br />-Business Models for E-Commerce<br />-Online Retailing<br />-Online Services<br />-Google,Netflix,Facebook<br />-Search Engine and Social Marketing<br />-Mobile and Local Marketing<br />-Crowdsourcing<br />-Intellectual Property Rights<br />-Privacyand Information Rights",
            "comment_teaching": "Nothing special, just reading from slides, you can just skip lessons, but she will take 3 random attendance.(probably is the lessons of project presentation)<br /><br />She likes to ask questions in class so people who are active to answer her questions may add marks.",
            "comment_grading": "The grading system is not that transparent as we didnt know our score of final exam and project.<br />and I think mostly depend on your project marks~",
            "comment_workload": "medium workload i would say~<br />have final report and presentation<br />midterm only have MCQ<br />final have both MCQ + short q",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "p1lb8kKp428n5twIc9xuxlcTC2qzuwc5",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "zkc521",
            "date": "Jul 25, 2019",
            "title": "Similar to ISOM2010",
            "comment_content": "The course is talking about how to do business online. The content is not easy-understanding, and it is 70% similar to ISOM 2010.",
            "comment_teaching": "Prof. Wang is really a patient and helpful teacher. When you raise questions after class or even in the class, she would be nice and happy to answer your questions.<br /><br />Also, her power point is definitely readable and user-friendly. She would upload exam/mid-term guideline before the exam/mid-term, and that really helps. You can just follow the scope covered in the guideline.",
            "comment_grading": "It is not hard to get a high grading, as long as you do study before exam or test.<br /><br />Also, rising up your hand and answer easy questions raised by professor can help professor to remember you better.",
            "comment_workload": "Low workload.<br />Other than mid-term exam and final exam, one group-based project is supposed to complete.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UjQ3mpEo34mAeiMte087FHKpR0kRkIWf",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lmk",
            "date": "Jul 22, 2019",
            "title": "Good cc",
            "comment_content": "E-commerce history<br />The business models of some successful e-commerce like Netflix, Google and Facebook<br />Social Marketing<br />Privacy and intellectual right<br />Encryption<br /><br />(NO maths involved and the concepts is not difficult, you do not need to have a business background)",
            "comment_teaching": "The professor is very friendly and she could remember the students. She encourage interaction in class. She could explain the concept clearly and she is very kind to answer the students question after class.",
            "comment_grading": "The grading is fair and mostly depend on your midterm and final. So study hard for the exam is crucial.<br /><br />Midterm - above mean 1 sd<br />Finals - unknown but I had screwed up so I think I got a mean.<br />Presentation and Project - As the professor gives good comments in our project, I think we get an above mean score. <br /><br />Final grade - B+",
            "comment_workload": "The workload is medium. <br /><br />For the project, it is about introducing an e-commerce business model. As there is lot of part to be included in the project, it is very important to find good groupmate to reduce the workload.<br /><br />For the midterm and final exam, you just study the guide provided then everything will be ok. There are MC and long question. The MC tests your understanding so sometime a little tricky. The long question is straight forward and test your memorization.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eIbaJyFsnQwLiCfyzOdwlyyxVcz6Cu7I",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ds",
            "date": "Jun 10, 2018",
            "title": "",
            "comment_content": "- History of e-commerce<br />- Internet services and mobile apps<br />- Porter's five competitive forces<br />- E-commerce business models<br />- Online retailing <br />- Online services<br />- Business model of google, netflix, facebook<br />- Social marketing<br />- Mobile and local marketing<br />- Crowdsourcing<br />- Privacy and Information Rights<br />- Intellectual property right",
            "comment_teaching": "Okay la, just reading the whole slides. I don't need to attend class, but she take 3 random attendance which is 3% from our score.",
            "comment_grading": "I don't know how she give out our score. We didn't get our 30% presentation score, but suddenly the letter grade is out and I got a really bad score. I wish she's more transparent in giving out scores.",
            "comment_workload": "only 1 project for the whole semester, but you have to do it your best. I don't know how she grade it since she doesn't give us our score.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lWmhqYp1uk9X0ArEw8UuysYEYaey46ne",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rey",
            "date": "Jun 28, 2017",
            "title": "OK Course, but shady grading",
            "comment_content": "Topics covered in this course are useful and fun to learn. It includes some review of ecommerce businesses out there, techniques, principles, and strategies being used in the industry. Pretty relevant basics if you want to start an online company.",
            "comment_teaching": "Teaching is a bit boring, reading through the slides. Skipping the class won't matter as long as you have the slide.",
            "comment_grading": "Shady grading. Have mid term, peoject, and final. Final's grade is not released.",
            "comment_workload": "Workload is quite high on the project, which need a presentation at the end. Not recommended to go with FYP's or other heavy project based courses. Best to go with introductory course.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8eJpasc6QqQW5HmUKhMs4C7266sCkBBv",
            "semester": "2012-13 Fall",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nonshallknow",
            "date": "Jan 31, 2017",
            "title": "",
            "comment_content": "The content is quite interesting. It talks about the evolution of information technology and application.<br />not too difficult :)!",
            "comment_teaching": "He is a good professor which teaches well with heart. Although it may be a bit hard to understand his english, his lectures are interesting. And always end class early.",
            "comment_grading": "The grading is very good. <br />Not too bad and easy to get good grade since have 2-3 revision lessons to help us revise and have cheat sheet to assist.<br /><br />and homework and assignment are easy to attain 80% grading~ so no worries la!!!!!!!!!!!!!",
            "comment_workload": "He is a good professor which teaches well with heart. Although it may be a bit hard to understand his english, his lectures are interesting. And always end class early.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0pi87dYVjT0WBkhaPKLeRUFb86XVccPO",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "aejonathan",
            "date": "Jun 24, 2016",
            "title": "Good grading course",
            "comment_content": "The course mainly covers about :<br />- History of e-commerce<br />- Internet services and mobile apps<br />- Porter's five competitive forces<br />- E-commerce business models<br />- Online retailing <br />- Online services<br />- Business model of google, netflix, facebook<br />- Social marketing<br />- Mobile and local marketing<br />- Crowdsourcing<br />- Privacy and Information Rights<br />- Intellectual property right",
            "comment_teaching": "The professor is really nice and she likes to ask the students opinion about things related to the course and she appreciates all of the answer. She is also very helpful if you have something you do not understand.",
            "comment_grading": "25% A range<br />The grading scheme is :<br />30% midterm : T/F, multiple choices and essays. It is relatively easy, hence the mean is high (around 85/100)<br />10% attendance : no attendance taking. However, she remembers all of her students and so you will get higher attendance point if you attend the class and actively participate in the class by answering her questions. <br />20% group project <br />40% final : 10 multiple choices, essay and case analysis ( mean 83 / 100 )",
            "comment_workload": "The workload is light.<br />She gives review guide for midterm and final so just study from there.<br />And you get around 2 months to prepare for the group project which consist of a presentation and report on an e-commerce company.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "C0nrIwQU7pdnbtZLh6xkruBIXdX6bsw8",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "orangeorange",
            "date": "Jan 25, 2016",
            "title": "",
            "comment_content": "The content of this course is quite simple, which is about e-commerce. Development and business cycle of some of the famous companies like Facebook , Tencent are also taught.",
            "comment_teaching": "The professor is quite funny and he explains concepts clearly. At the beginning or the end of almost each classes, he will introduce some news articles about that topic. Some&nbsp;&nbsp;of the articles will be examed, so make sure to pay attention when he is explaining the articles.",
            "comment_grading": "Assignments\t20%<br />Presentation 10%<br />Two Progress Reports 5%<br />Mid Term&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\t20%<br />Final Exam&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\t45%<br /><br />just normal grading",
            "comment_workload": "There are around 4 assignments, the questions are very simple, of one page long, and most of people just get full marks. For both mid-term and final, he will provide a study guide, you have to study those concepts on the guide and read all those articles (make sure to read because some of the short questions will be about the contents from the articles. )",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xU8Cdx7nySetKXcdRQ8DDDFh6xsfumsi",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anshul",
            "date": "Jan 22, 2016",
            "title": "",
            "comment_content": "The course is on topics of e-commerce and innovation with specific terms explained with help of case studies of various companies",
            "comment_teaching": "He is a good Professor,actually nothing much to teach in the course and its just basic stuff,he is interactive and explains things well",
            "comment_grading": "Since its not a tough course grading can be competitive, scoring 1 sd above mean throughout the course in all exams and projects should ensure A range, however messing up one of them can bring you down heavily to C,But the course is really easy to score. Just be careful with Presentation as I feel prof has a soft touch for korean girls",
            "comment_workload": "Not much of a workload, just follow the study guide given by prof and study for 1-2 days and u will get a good score",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OS04Ob4Y9z32xkYROGRvZUoEHMxovilC",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Laurie",
            "date": "Jan 21, 2016",
            "title": "",
            "comment_content": "I think the topics are interesting. If you are slightly interested in internet technology, you may discover and learn a lot. Also, the topics are easy to handle.",
            "comment_teaching": "I think professor's tone are a bit weird but not a big problem. and the professor is welcome to answer all questions.",
            "comment_grading": "I think the grading is fair. I think most people get full mark in their assignment and the midterm mean is not quite high. As long as you do homework and study, you won't get a bad grade.",
            "comment_workload": "The workload is quite light. Assignment and projects are not that difficult and the professor will release a study guide before exam. All the topics included will be shown, just study all the topics there and go to the exam:)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EUglMoLYgF5GsT526BPzNNC0lj2LoOxy",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "butter",
            "date": "Jan 09, 2016",
            "title": "",
            "comment_content": "The content is well prepared to initiate students to the internet revolution. I found one or two concepts very useful. For those who already have an idea, it might be boring.",
            "comment_teaching": "Good teacher overall. Lectures are interesting. try not to miss the lectures. A lot of questions are from lectures",
            "comment_grading": "The exams and assignments are highly scorable. If you know your stuff, you can ace it. But the downside of it is that the mean is usually high. <br />Presentation is usually where the grade is decided due to high scoring exams",
            "comment_workload": "very light. Preparation for exams shouldnt take more than two- three days",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "t80kV5OLcrIpjs2gYdesegrlL3UOuuWx",
            "semester": "2014-15 Winter",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tuna",
            "date": "Sep 28, 2015",
            "title": "",
            "comment_content": "It's indeed an easy course. I do not have any background in either business or e-commerce. Yet, I can still catch up with the content.",
            "comment_teaching": "Jing is a really nice professor. She remembers all the students faces and she uses various media to let us understand the concept. She opens to any questions. And she replies email promptly.",
            "comment_grading": "The grading system is not that good to me. Though she mentioned that she gave out quite a lot of As for last year, i do believe she changed this year. I got a really high mark in mid-term and final and I attend all the lectures. However, I did not get a A range at last.",
            "comment_workload": "Though she does not require any readings, however, in just three weeks time, the course required a mid-term, group project and final exam. It seems like you have to finish everything in a short period of time. It's really hard to complete a group project from deciding the topic, doing research, and finally come up with a presentation and final report.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Jz2r6pzlNGmisyxaghl9PZIcjR0Rqam2",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "frisjwara",
            "date": "Aug 26, 2015",
            "title": "",
            "comment_content": "ISOM 2310 is an introductory course to learning about e-commerce. As it is a common core course, the professor taught some basic economic principals as well (such as Porter's Five Forces), and relates it to the current topic. We also had a section on several successful e-commerce businesses (Google, Netflix) and learned how they started, how they operate, how they gain their revenue, etc. It's a great introductory course for people with or without business background to learn about e-commerce.",
            "comment_teaching": "The professor is very nice and very open to suggestion, feedback, and questions. Given her background and experience in the field, she is able to explain the technicalities in e-commerce in lieu of just the business side of it. Her teaching style is a mix of lecture, PowerPoint, and videos, and she tries to converse with every student. If I remember correctly, she knows the names to most people in her class. She also gives review sessions during the lectures before the exam, and provides a study guide with key points to study from, too.",
            "comment_grading": "Our final grade is compromised of a mix of elements. We have a mid-term, a final, a group project, and participation marks. Participation marks aren't that hard to get, as she gives a default 7-8/10 if she sees you in class frequently. She's also a generous grader when it comes to test answers.",
            "comment_workload": "Studying for the test isn't hard, as it is a common core course and just requires you to memorize/remember the slide contents and review her study guide. The group project is basically just reviewing an existing e-commerce company to report about and present it to the class, which isn't hard either. No other homework whatsoever.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5aACxiuwSURUBujRZFd2UF5lrAxUvSva",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 363,
                    "name": "TEH, Jack Her Hock",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "meh",
            "date": "Aug 21, 2015",
            "title": "",
            "comment_content": "一開始會講下理論<br />例如innovation, creative destruction, kronos effect之類<br />去到中後期就會開始有case study<br />例如: Google, Apple, Uber, Airbnb<br />內容唔算太難 算係深入淺出<br /><br />MT/Exam睇返study guide嚟溫就ok<br />有MC,SQ同Essay<br /><br />Optional Textbook可以完全ignore",
            "comment_teaching": "教授講英文嘅口音幾奇特(類似馬拉口音？<br />上堂有時會播下片 幾輕鬆<br />懶啲嘅可以走堂都得",
            "comment_grading": "Grade算係咁<br />唔會爛",
            "comment_workload": "合計有兩份written assignment+一份group report+一次group presentation",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "d5J8KItpfLjho5kfNgmQSnlfh120Ez1l",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jasa",
            "date": "Jan 03, 2022",
            "title": "Not the best CC, so treat it as Plan B",
            "comment_content": "See others.<br /><br />Content is too easy, resulting in poor grading.",
            "comment_teaching": "She teaches super slow; I usually do 2.0x her lecture videos.<br /><br />She is helpful to your questions on projects or lecture material anytime you reach out.",
            "comment_grading": "Lack transparency. We have a midterm, group project, and final exam. Only the midterm exam was graded.<br /><br />Also, the exams are all super easy, so the midterm means is extremely high, like 21/24.<br /><br />So, I think the differentiation is mainly the project, but none of us knows the grade.<br /><br />Yet, if you are competitive enough (卷), you could get a good grade.",
            "comment_workload": "Okay. One midterm, group project, final exam, class parti. <br /><br />For class parti, she has a photo book on her desk, so you may need to answer or ask dumb questions in class. Also, there are 3 IPRS without prior notice, so ATTENDANCE IS NEEDED.<br /><br />For the exam, you just need 2 days to purely memorize all lecture notes. <br /><br />For the project, it includes the first draft (8page), presentation (12min), and final report (15page). Workload depends on your LUCK. Try to team up with people sitting on the first row then you should be safe.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "USntYV8JmkX8PGGgKx3XcVsyaGFtbrq3",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "josephine3028",
            "date": "May 29, 2019",
            "title": "",
            "comment_content": "Content is really related to real world,&nbsp;&nbsp;even my friend study computer told me the content is close to what they have learn (just with. more businesses aspect). Suitable for year 1 student.&nbsp;&nbsp;<br />And learn to analyse a company with business model",
            "comment_teaching": "Prof is funny and nice.&nbsp;&nbsp;Videos and examples were remarkable.",
            "comment_grading": "2exam:&nbsp;&nbsp;with MCQ&amp;SQ no cheat sheet, but there are lots of things to remember(which necessary for SQ in exam)<br />Project : choose a e- commerce by ourself and analyse it with business model she taught us.",
            "comment_workload": "The workload is low, but lots of things need to remember in exam.&nbsp;&nbsp;The project us fine as long as the group mates are sane.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DPzNqeW1snQIXN3P8PoNvH0J94biAUVZ",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 367,
                    "name": "WANG, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "FKU_ISOM2310",
            "date": "Jun 06, 2017",
            "title": "Chronicles of Internet Commerce",
            "comment_content": " Understand the role of Internet features in shaping e-commerce<br /> Know the history and background of Internet<br /> Understand the evolution of e-commerce from its early years to today<br /> Learn to analyze firm’s competitive environment by using Porter’s five forces model<br /> Know the key components of e-commerce business models<br /> Identify the major features and trends of online retailing and services<br /> Understand the business model of search engines such as Google<br /> Understand the business model of content providers such as Netflix<br /> Understand the business model of social network sites such as Facebook<br /> Understand the capabilities of the search engine marketing<br /> Understand the capabilities of the new social, mobile, and local marketing<br /> Recognize the main ethical, social, and political issues raised by e-commerce<br /><br />MEMORIZE ALL THE WORDS IN ORDER TO ANSWER THE ESSAY TYPE QUESTIONS, OTHERWISE, YOU SCREW UP.",
            "comment_teaching": "SHE WILL ANSWER YOUR QUESTIONS AND SHE IS VERY KIND.<br />SHE IS A PASSIONATE AND GOOD TEACHER, BUT SHE DOESN'T GIVE YOU A GOOD GRADE EVEN IF YOU SPENT EFFORTS.",
            "comment_grading": "Very Bad, don't register this course<br /><br />Class Participation 10%<br />Midterm Exam 30%<br />Final Exam 40%<br />Project 20%!!!!!!!!!!SO FKIN' IMPORTANT<br /><br />Having gd teammates is VERY important because they can ruin your final grade if they framed you at the peer-evaluation.<br />If your teammate didn't give you gd reviews on peer-evaluation, YOU SCREW UP!!! YOU WILL DEFINITELY RECEIVE A C+, NO DOUBT!!!!!!<br />Even if you scored 88/100 in the midterm and 70/100 in the final,<br />YOU WILL DEFINITELY RECEIVE A LETTER GRADE:C+, NO DOUBT!!!!!!<br /><br /><br /> &quot;Since I am not able to observe each of your effort, I have to evaluate based on the outcome.&quot;<br />SO, YOU KNOW WHAT TO DO IN ORDER TO HAVE A GOOD GRADE <br /><br />In fact, the project counts 99% of your grade!!!!",
            "comment_workload": "NOTHING BUT A GROUP PROJECT",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}