{
    "error": false,
    "course": {
        "id": 673,
        "subject": "ISOM",
        "code": "2400",
        "name": "Global Information Infrastructure and Policy",
        "description": "This course provides a panorama review of the global information infrastructure from technology, policy, social and business perspectives. Key issues include next generation information infrastructure, Internet of things, anti-spamming legislation, universal service, digital convergence, network interconnection, the WTO’s agreement on telecommunications, cloud computing, green ICT, and regulatory environment of multimedia services. It will also address the increasing importance of Web 2.0-enabled information infrastructure in business innovation.",
        "categories": [
            "Common Core (SA)",
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2220,
            2120,
            2020,
            1920,
            1820,
            1720,
            1620,
            1520,
            1420
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.76,
        "rating_teaching": 4.11,
        "rating_grading": 4.14,
        "rating_workload": 4.24,
        "review_count": 37,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 388,
                "name": "XU, Yan",
                "count": 35
            },
            {
                "id": 801,
                "name": "NG, Ka Wai Tommy",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "UuwEQ0zlR3NrkjtgJXfRI9BRX5XH5ftf",
            "semester": "2014-15 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "enigma",
            "date": "Aug 23, 2015",
            "title": "Nice professor. Intense schedule.",
            "comment_content": "The course is only available in winter semester as a 2-week intensive course.<br /><br />As seen from the course description, the course content are mostly above technology of communication. The course focuses on wireless communication technologies such as mobile phone service, WiFi and its related technical issues. Some history of telecommunication, especially of the US and HK will be covered. <br /><br />Personally I think the content of the course is quite intriguing. Living In a metropolitan nowadays you may find wireless communications compulsory, but you may not know how the quality is assured. The course provides loads of detailed background of telecommunications and allows students to appreciate the technologies and rationales of policies of wireless communications in different regions.<br /><br />The course is suitable for people who really prefer learn new stuff&nbsp;&nbsp;to good grade, though grade is quite fair too.",
            "comment_teaching": "Accent: although the professor is from mainland China, his accent of speaking English is not difficult to understand.<br /><br />Context: The professor is so knowledgeable in this ground of study. This may be the reason that he can provide loads of interesting facts and examples during class. He even shares his own research contents and share his opinions to the class on some issues of information infrastructure and policy.",
            "comment_grading": "Both midterm and final above 1 SD.<br />Grade B+<br />Not as good as expected but it's fair as the class is competitive.",
            "comment_workload": "1 Midterm:<br />An online take-home quiz at the end of week 1. Answers can be found from lecture notes and facts from lecture. You should make sure that your answers are all correct.<br /><br />1 Final:<br />Close book exam at the end of week 2. Memorize some important facts and significant history background.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "maQ5XTaapecVWcW2k8VqzpEn6tNFduG9",
            "semester": "2015-16 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "whyuenac",
            "date": "Feb 16, 2016",
            "title": "",
            "comment_content": "The content is not difficult to handle. Although the course is run in just two-week time, I don't feel suffocated since many examples of the course is from real-world, like Japan DOCOMO, Korea, United States AT&amp;T.",
            "comment_teaching": "Video available after class. Some long questions are based on what professor said in class, which is not written on lecture notes. MC+Fill in the blanks+Long question (around 30+30+40). The long question are not asking you to write essays, just listing of points. <br />Midterm is take-home canvas. You can try google them, but I am sure you will not find them. I see someone asking them in some technical forum, but I see that these questions are very soon being banned by the forum administrator (they may know you are asking exam questions....)",
            "comment_grading": "The grading is fair. Probably only one guy got A+, which requires 95+ in both midterm and final. I scored A (all 90+) and am the sixth highest in class. In my failed attempt to ask for A+, the professor replied that the other 4 people higher than me is also A, who have overall 92-95 marks based on what I saw from TA during paper checking session. I don't know the rest.",
            "comment_workload": "The workload is not heavy. If you understand course material during lectures, you will certainly score high, Pay more attention to making the cheat sheet for the final exam. It helps a lot. <br />First half only covers first half questions<br />Second half only covers after-midterm materials though some final questions have questions about materials before midterms since some lecture materials are the same in both half.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3nttxfvgAgeGyjR9hRxeyoojn4zUbUOk",
            "semester": "2016-17 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Chase",
            "date": "Jan 10, 2018",
            "title": "ISOM 2400",
            "comment_content": "Too tedious, Not going to be useful in the later life.<br />Very detailed.",
            "comment_teaching": "Good guy, he seemed passionate about what he is teaching. He was a head? of EMBA school. His delivery was good.",
            "comment_grading": "Good grading. Received A with fair amount of work.",
            "comment_workload": "2 weeks of concentrated lectures, and good outline of workload with tests. He allowed people to have the mid term as a homework, so I suggest that you do it with group of friends. there is also a cheet sheet you can use for the final.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mIvTXZjP3b7MCOFrKD9DLXVG7uYCTu1s",
            "semester": "2020-21 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ypoons9",
            "date": "Jan 29, 2021",
            "title": "Think twice before taking this course",
            "comment_content": "Introduction to the Information Infrastructure<br />Digital Convergence; Wireless Communications and Spectrum Regulation<br />The Next Generation Information Infrastructure<br />Business and Socioeconomic Implications of Information Infrastructure<br />Innovation 2.0<br />Diffusion of Technology Innovation; Case Study: SMS Adoption in Hong Kong and China<br />Theoretical Framework of Information Infrastructure Deregulation<br />Organizational Restructuring of Information Infrastructure: From Monopoly to Competition, and to the Bubble and Its burst<br />Network Interconnection; Local Network Competition in Hong Kong<br />Foreign Direct Investment in Telecommunications and WTO’s Basic Telecommunications Agreement<br /><br />The content is too technical so you may easily feel bored if you are not really interested in telecommunications.",
            "comment_teaching": "He is quite experienced and knowledgeable, can give detailed explanations and examples. And he is willing to answer questions. He replies to emails quite fast too. Overall a nice guy.<br /><br />Yet, sometimes you may find difficulties understanding his mainland accent.",
            "comment_grading": "a mid-term assignment (50%);<br />a final exam (50%).<br /><br />Mid-term Assignment (on-line assignment)<br />Mean: 38.9 out of 50<br />High: 47<br />My result: 44.3<br /><br />Final exam: not released <br /><br />Grade: A<br /><br />I would say the grading is pretty good since I knew I made some mistakes right after the final exam and I heard that Prof Xu gave maximum A-range.",
            "comment_workload": "The heaviest part comes from the 3-hour lecture. Since the PowerPoints don't provide detailed explanations, you need to jot many notes during lessons but it is not easy to focus in class. Even a small word in a table was tested in the final exam...",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XE0q0Kaxx9h2qYJkiN6yEumt8WhwEPM3",
            "semester": "2020-21 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Winnie the Pooh",
            "date": "Jan 25, 2021",
            "title": "Super intenseeeeeee",
            "comment_content": "Content is kind of boring about telecommunications and their policies.",
            "comment_teaching": "Prof Xu don’t have the Chinese accent when speaking English which is pretty nice.",
            "comment_grading": "Grades aren’t out yet when I am writing this. But I am sure my grades are bad because this course is not as easy as said on ustspace.",
            "comment_workload": "One midterm One final only.<br />But as I am studying during winter semester, there is 3-hour lecture per day which is quite a nightmare. DONT THINK THAT TAKING THIS COURSE DURING WINTER SEMESTER CAN GET YOU EASY 3 CREDITS!!!!",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "R9AtOTSMCd0ETh71H1SHrBCxtxN9vSXN",
            "semester": "2017-18 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kagaho",
            "date": "Feb 28, 2018",
            "title": "Intensive but intriguing course",
            "comment_content": "Content in this course is nothing difficult to understand. With lecture videos provided, you can easily comprehend the course materials even without going to class. This course talks about the telecommunication industry/ regulation and have many real life examples included. Professor would also invite some guest speakers in the last lecture to share about future trend in telecom/ daily operations &amp; regulation in the industry.",
            "comment_teaching": "Professor's tone might be a bit boring considering that this is a 3-hour lecture. However, professor Xu is definitely an expert in the industry and you can learn much from him if you pay attention.",
            "comment_grading": "The grading in this course is pretty good. The midterm is a take-home exam and you can score a pretty decent score as almost all the answers can be discovered in the notes. It just takes time for you to figure out the answers. The final exam is more difficult comparatively. But you are allowed to bring a cheat sheet with you so everything should be alright.",
            "comment_workload": "Workload is fair for this course. There are only 1 midterm and 1 final exam, without any assignments. Perhaps the most &quot;chur&quot; part is the 3-hour lecture itself. However, professor is considerate and gives a 20-minute break every lecture.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ztHc6cua8kDFQYLFc5UxogJOyYmXGmTU",
            "semester": "2017-18 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "horos",
            "date": "Feb 01, 2018",
            "title": "intensive course",
            "comment_content": "Then content is informative. Both technology and history will be mentioned in lecture notes. The history part may not be tested in mid-term but it was tested in this semester so remember to jot down some historical facts on cheat sheet or just remember all of them if you want to score high marks.<br /><br />The number of pages of lecture notes is always about 100 pages and most of the pages has only pictures. You may need to pay attention on what professor said in lecture.<br /><br />Lecture videos are provided.",
            "comment_teaching": "The professor is knowledgeable but sometimes the content of lecture is not really relevant to the topic.",
            "comment_grading": "Not quiet sure about the grading but you can get B if you scores about mean in both mid term and final exam.",
            "comment_workload": "Low workload<br />1 mid-term exam and 1 final exam only<br /><br />For mid-term exam:<br />online exam conducting on canvas. About 100 MC questions and a few short questions explaining relevant content which professor has said in lesson<br /><br />For final exam:<br />one page of A4 cheat sheet can be brought into the exam. Only second half lecture notes will be covered.<br />MCs + fill-in-the-blank Questions + Short Questions",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fCGidS7AAKIqetb8afZzsWhjyl1fRDgf",
            "semester": "2016-17 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CCYYTT",
            "date": "Jan 24, 2017",
            "title": "",
            "comment_content": "Topics mainly include basic signal and telecommunications technology, development of telecommunications industry in Hong Kong and America, global regulatory framework of communications industry, innovation and Web 2.0 and convergence of communications service.",
            "comment_teaching": "Informative. The professor teaches and explains a lot of content which are not on the powerpoint slides so you have to pay attention and jot notes for your understanding.<br /><br />Nice professor.",
            "comment_grading": "Quite good.",
            "comment_workload": "Low workload but quite an intensive course <br /><br />One take home midterm(40%) + One final(60%)<br />For the final exam, you can bring an A4 double-sized cheatsheet.<br /> <br />Total ten lectures within 2 weeks(3 and a half hours per day and a 20 minutes break in the middle of the lectures), lecture videos provided.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XHhralxh4Or54j5E70xxXdwFiu1uWGpJ",
            "semester": "2016-17 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jesssss",
            "date": "Jan 20, 2017",
            "title": "",
            "comment_content": "Many lectures notes, as everyday 3.5 hours lesson, but it does have lecture video, so it's ok to not attend the lesson. It teaches about some histories of technology and telecommunication. It's a bit boring and many people studied this course, so maybe a bit competitive.",
            "comment_teaching": "Had lecture videos, has little break after 1 hour lesson.",
            "comment_grading": "have b to b+ if u have mean.",
            "comment_workload": "low. Just one midterm and final exam. Midterm is open book and do online and final exam has cheat sheet about A4 size. No presentation or any quiz.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FNKxhCwQTEmuVnRRh6vk9pmZ2YXlIZaS",
            "semester": "2015-16 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ATKmode",
            "date": "Mar 14, 2016",
            "title": "",
            "comment_content": "Mostly about the history, principle, future development of telecommunication.<br />The content is very board and the lecture notes are thick as hell<br />It is too intensive for a winter course",
            "comment_teaching": "3 hrs every day and lasted for 2 weeks<br />Have lecture video on canvas, but it is too long<br />and the sound of the video difficult to hear.",
            "comment_grading": "Under half/one sd in the midterm assignment<br />but scored one sd above in final exam<br />so the final score is about mean<br />the grade the B, which is quite OK.",
            "comment_workload": "No attendance was taken and the midterm exam was an online assignment in the weekend.<br />The assignment was consist of many MC problems, some fill in blanks and short question.<br />The final exam had the same format as the online assignment and a both-sided A4 cheat sheet is allowed.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LwAxV9FhGsD2Y1Cf9S9GiD4yHk5CTi98",
            "semester": "2015-16 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Constant",
            "date": "Feb 15, 2016",
            "title": "Interesting Course and Fair Grade",
            "comment_content": "This course introduces some basic knowledge about telecommunication infrastructure, such as how it works, some relevant history about its development and what's the current infrastructure on our telecom. After this course, you will definitely learn something.",
            "comment_teaching": "The instructor is quite knowledgeable, and illustrate all the materials detailed. Actually, I encourage you to go to the class every day, it is much better to understand the materials. In addition, he can also answer all the questions if you have one after class.",
            "comment_grading": "Fair Grade.<br /><br />Midterm:<br />Mean: 81.6 <br />SD:Unknown after adjustment. I guess it is about 10.<br /><br />Final:<br />Mean: 75.6<br />SD:Unknown. I guess it is about 11, told by TA.<br /><br />Therefore, if you get both above one SD, you will get almost B+ since the class is quite competitive. This grade is quite fair. <br /><br />Be careful, some of the problems are quite tricky. Well, I got into it.",
            "comment_workload": "Only Midterm and Final.<br />Open online quiz for Midterm.<br />Double A4 pages for Final.<br /><br />Considering the schedule, this course is quite rush and you have to review a lots of materials in a short time, about almost 80 pages average for each chapter and some may be above 100 pages.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tgnEuHNDnqvCpu0QejoInloifpOF57Mn",
            "semester": "2015-16 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tiffanymak",
            "date": "Jan 30, 2016",
            "title": "",
            "comment_content": "The course materials are easy to understand, basically the course covers the policies and histories of the telecommunication industry.",
            "comment_teaching": "The professor explains everything clearly. He had video taped the lecture for students to revise after lesson, it is strongly advised to attend the lesson although there are lecture videos.",
            "comment_grading": "",
            "comment_workload": "The workload of the course is very light, only a midterm assignment and a final exam. The midterm assignment is a take-home and open book assignment submitted online. The final exam allows you to bring in an A4 cheat sheet.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vAyi7w4gFPSXd5EvXwYeIO2ajL0Amq2S",
            "semester": "2015-16 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "marina",
            "date": "Jan 25, 2016",
            "title": "",
            "comment_content": "The winter course was really intensive. The professor made it pretty condense-only 2 weeks! The first part covered information infrastructure, with a lot of technical concepts explained. The second part covered a lot of &quot;policy&quot;, &quot;history&quot; concepts of the telecom industry. He explained everything in a pretty clear way, but I have to say some of the words he used on lecture notes were a bit difficult to follow. It would be better if you reach out and ask further explanation after class.",
            "comment_teaching": "He explained everything pretty clear. The exam was mainly to test a lot of details in the lecture-very very detailed!!",
            "comment_grading": "By the time of writing, I have no idea about grading. But I heard it is pretty good.",
            "comment_workload": "Not a lot of workload. But the biggest thing to do was to get everything on your final exam cheatsheet!!-then you won't miss anything.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bN9Jsbi0MqIuIYjv1Xe6srAODIASYIX1",
            "semester": "2022-23 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Poly",
            "date": "Jun 29, 2023",
            "title": "",
            "comment_content": "Has a relatively large amount of content to be packed within a 2 week course. 100 page of powerpoint per lecuture.",
            "comment_teaching": "Very long lecture. And a bit boring. Many important content is not included in the lecture notes,hence you need to maintain a high concentration to write notes. The professor sometime run out of lecture time and have to skip some pages or overrun.",
            "comment_grading": "1 take home midterm and 1 final exam with cheat sheet.<br />Attantence is not taken.<br />Easy to get a high score for both midterm and final exam as long as you have written adequate notes during the lecuture.",
            "comment_workload": "No homework at all.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9GprVL5TI7cHYf8Of9ilfzAUpdCwd6yp",
            "semester": "2022-23 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Akaza",
            "date": "Feb 02, 2023",
            "title": "An unnecessarily intensely scheduled course during winter",
            "comment_content": "Lectures :-<br />1) Introduction to information infrastructure<br />2) Digital technology and convergence, and wireless communications.<br />3) Next generation information infrastructure<br />4) The business and socioeconomic effects of information infrastructure<br />5) Innovation 2.0<br />6) Diffusion of innovation, the adoption of SMS in HK and China<br />7) Telecommunications policy and regulations, argument over natural monopoly, necessity and feasibility of information infrastructure competition<br />8) Organisational restructuring of information infrastructure<br />9) Network interconnection, from universal service to universal choice (local fixed network competition in HK)<br />10) Foreign direct investment in telecommunications and WTO's basic telecommunications agreement<br /><br />I would say 30% of the course is common sense, and the rest requires you to memorise rather than understand.",
            "comment_teaching": "The lectures are actually quite helpful, because the slides are rather abstract and don't contain explanations of the concepts or anything. So I would suggest you to at least watch the recordings like I did (btw, I didn't attend a single lecture). Furthermore, his English is better than most HKUST professors so that helps as well.",
            "comment_grading": "The grading scheme is quite favourable but the grades are competitive (unduly so) - 50% mid-term and 50% finals. I say favourable because the mid-term exam is a 3-day take-home over-the-weekend canvas quiz with unlimited attempts. Therefore, chances that you will get around full marks for mid-term and hence secure the 50% of the grade are high. Well, of course thats only a given if you actually put it in some effort despite the fact that most answers are found on the lecture slides and i'm sure many people just use command+F. However, this also means that other people will get a good score on their mid-terms, consequently making the grading competitive. <br /><br />Nevertheless, the mean for the mid terms was surprisingly low given these conditions - 82.7/100. The high score was 95.5/100 and I attained 93/100.&nbsp;&nbsp;I expected the mean to be at-least 90%.<br />(FYI, the upper quartile was 92.8/100 hence out of 130 people, 25% of the people were potentially in the A-range, including myself. However, i am not sure if the professor assigned the entire UQ as A-range).<br /><br />The finals did not at all include the content from mid-term, and not even indirectly so, hence you can practically forget everything you learned before mid-terms, and it wouldn't affect your understanding of the content for finals. Personally, I thought the whole exam set-up was absolutely ridiculous (absurd, almost laughable), not the exam itself since it was quite easy but rather the set-up. Although the exam took place in-person, &quot;in order to save paper and go green, the exam will take place on canvas as a quiz&quot; - professor. At first thought, you might think that it's acceptable and perhaps not even a bad idea, but trust me I thought so too as well until 40min into the exam. The exam is 3 hours long, and I saw people leaving after 30 minutes .............without actually submitting the quiz lol. The incompetent TA did not even bother checking if they submitted the quiz, so I'm sure they just went to an isolated place and finished the quiz while looking at all their notes and by searching on the internet.<br /><br />Anyways, the exam was rather straight-forward and I believe you can secure a good grade even without cheating if you attend all lectures because the slides are rather abstract. The score wasn't released, but I somehow got an A. I was confident before even going to the finals, but after seeing that ludicrousness, I lost hope and thought I would end up getting B-range because everyone who cheated is going to get a very high score, hence manipulating the grade curve.",
            "comment_workload": "As the other reviews also say, this is a very intense course and does have a relatively heavy workload given the time-span of the course. However, since the content for finals is so different from mid-terms, you can just focus on the topics after-mid terms which reduces your overall workload by half.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fahZ0wq7ods8h3Ae9II9ki7eHUob9iw7",
            "semester": "2022-23 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "disaster",
            "date": "Feb 01, 2023",
            "title": "",
            "comment_content": "A very short two week course. But need to have about 3 hours and 30 minutes per lesson exclude the 20 minutes break.<br />Content: <br />January 3: Introduction to the Information Infrastructure<br />January 4: Digital Convergence; Wireless Communications and Spectrum Regulation<br />January 5: The Next Generation Information Infrastructure<br />January 6 AM: Business and Socioeconomic Implications of Information Infrastructure<br />January 6 PM: Web 2.0 and Innovation<br />January 7-8:&nbsp;&nbsp;&nbsp;&nbsp;Mid-term Assignment (on-line assignment)<br />January 9: Diffusion of Telecommunications Services; Case Study: SMS Adoption in Hong Kong and China<br />January 10 AM: Theoretical Framework of Information Infrastructure Deregulation<br />January 10 PM: Organizational Restructuring of Information Infrastructure<br />January 11: Network Interconnection; Local Network Competition in Hong Kong<br />January 12 AM: Foreign Direct Investment in Telecommunications and WTO’s Basic Telecommunications Agreement<br />January 17: Final Exam with one A4 sized cheat sheet only include content after mid-term assignment",
            "comment_teaching": "I think the teaching is fine. But professor changed some lesson time which may need to have two long lessons a day. I think it will be fine if you skip some lessons and just take recordings at home because no participation is counted.",
            "comment_grading": "The grading is fair.<br />50% from mid-term assignment and 50% from final exam<br />Mid-term assignment 90/100<br />Final exam: don't know <br />Finally A",
            "comment_workload": "The workload is very low.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LwxheDvSXp5S7HKH3Ow8FOul9tNMZtBB",
            "semester": "2022-23 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Thomas Tse",
            "date": "Jan 30, 2023",
            "title": "ISOM 2400",
            "comment_content": "This course is a 2-week intensive course, with 3.5hr (1.5hr + 20 min break + 1.5hr) lectures from Monday to Friday.<br />In terms of content, the part before mid-term is mainly about the technology involved in telecommunications and some history about it.&nbsp;&nbsp;But this part is quite easy to understand because this course only covers the basic of them, and the mid-term is an open-book assignment, so don't worry about it.<br />The part after the mid-term is mainly about telecommunications policy and some real-life examples. <br /><br />Content:<br />- Introduction to the Information Infrastructure<br />- Digital Convergence; Wireless Communications and Spectrum Regulation<br />- The Next Generation Information Infrastructure<br />- Business and Socioeconomic Implications of Information Infrastructure<br />- Web 2.0 and Innovation<br />- Diffusion of Telecommunications Services<br />- Theoretical Framework of Information Infrastructure Deregulation<br />- Organizational Restructuring of Information Infrastructure<br />- Network Interconnection; Local Network Competition in Hong Kong<br />- Foreign Direct Investment in Telecommunications and WTO’s Basic Telecommunications Agreement",
            "comment_teaching": "The professor is very friendly and he sometimes gives out interesting facts about himself and the lecture content. It is quite fun to attend his lectures. Though it is a 3.5hr lecture, luckily we had a 20min (sometimes 30 min) break. <br />The professor likes to have some interactions within the class, sometimes he would ask students to answer some questions, and sometimes he would just ask students to have a discussion among themselves.<br />The professor has very little accent only, which will not affect your learning at all.",
            "comment_grading": "- mid-term assignment (50%)<br />- final exam (50%)<br /><br />The Mid-term is an open-book assignment and students need to finish it within the weekend.<br />The final exam is a close-book exam, students need to do it on Canvas on campus. We can bring a cheat sheet (1 A4 sheet, both pages), 3 hrs to work on the 64 questions.<br /><br />mt<br />mean: 82.67/100<br />high: 95.5/100<br /><br />final: unknown<br />grade: unknown",
            "comment_workload": "Barely any workload, and no assignments during the weekdays. But the preparation for the Final is really important and time-consuming, as students need to spend time preparing the cheat sheet which covers 5 lectures (hand-written only, not printed).",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "r54NT30F4Qnhm2S875cteWtucyEmeM8K",
            "semester": "2022-23 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "survivor",
            "date": "Jan 26, 2023",
            "title": "",
            "comment_content": "- Introduction to the Information Infrastructure<br />- Digital Convergence; Wireless Communications and Spectrum Regulation<br />- The Next Generation Information Infrastructure<br />- Business and Socioeconomic Implications of Information Infrastructure<br />- Web 2.0 and Innovation<br />- Diffusion of Telecommunications Services; Case Study: SMS Adoption in Hong Kong and China<br />- Theoretical Framework of Information Infrastructure Deregulation<br />- Organizational Restructuring of Information Infrastructure<br />- Network Interconnection; Local Network Competition in Hong Kong<br />- Foreign Direct Investment in Telecommunications and WTO’s Basic Telecommunications Agreement<br /><br />Before mt technical stuffs, after mt boring policy content. Overall useful knowledge.",
            "comment_teaching": "Flat tone, easily fall asleep.<br />The prof likes to have interaction in class, he will randomly point to a person and ask he/she to ans a question or give opinions. There might be small discussion with the person sitting next to you. He once asked people to present in front of the class which led to a 30-min overrun.",
            "comment_grading": "- mid-term assignment (50%)<br />- final exam (50%)<br /><br />Mt open book, finish within the weekend.<br />Final can bring a cheatsheet, 3 hrs to work on the paper but only 64 questions.<br /><br />mt<br />mean: 82,7/100<br />high: 95.5/100<br /><br />final not yet released <br />grade not yet released",
            "comment_workload": "Not much workload, except the 3-hr lecture time from mon to fri. A pretty intensive 2-week course.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "foVT8ZycmuBGg4Z09pNAcRDRvJU6LQWw",
            "semester": "2021-22 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hzzz",
            "date": "Jun 29, 2022",
            "title": "Good grade if you spent time on it",
            "comment_content": "Very intensive, 60p-90p of ppt every lecture. Make sure you are interested in the topic, otherwise you will be bored to death. Technical details about telecom in mainland and hong kong, government regulations, some history and basic econ in telecom firm (perfect competitive market, monopoly etc.)",
            "comment_teaching": "Kinda monotone but I am okay with that, first week is very intensive but I can catch up quickly. 3.5hr for each lectures, with 10-20min break. Prof. XU is kind and willing to answer your questions. He also likes asking students questions during the lectures. <br /><br />Suggestion: go out and take a walk during the break, or you gonna fall asleep.",
            "comment_grading": "midterm: 89.67/100 (mean 80.8)<br />final: 87.5/100 (mean 66.5)<br />Final exam is not covering the content in mt.<br />I worked really hard at the first week as there are lectures everyday, not really paying so much attention in final tho. A little competitive, still got an A.<br /><br />Suggestion: make sure you make your own notes as only 1 A4 paper of notes is allowed in final.",
            "comment_workload": "I guess this is the most chur course? Or maybe all winter courses are chur like this. Anyway there are 5 lectures in first week following with a mt so make sure you attended the lectures. Fortunately final is not covering content in mt so you can save a lot of time.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sJ3TcH4lhGxY0QMJmnIsGcu9qZFEHzk0",
            "semester": "2020-21 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Aeternus96",
            "date": "Feb 17, 2021",
            "title": "Good course intense schedule",
            "comment_content": "The contents are very interesting. But it may be very burdensome since it covers hell lot of contents in 2 to 3 weeks.",
            "comment_teaching": "Professor is from mainland, but his accent is very easy to understande because it studied in UK. He know a lot of things about the content, and his lecture is not confusing. Everything is clear.",
            "comment_grading": "Grading is fair. Everything comes from the lecture slide. The exams have 4 parts. T/F, Multiple choise, Fill in the blank, and essay. It is very easy to get a good grade in midterm since it is an open book online exam for three days. Everyone uses ctrl+F in pdf file to find the solution. <br /><br />But the final is not easy. The final is very tight. Each sesson gives about 30 minutes, and each problem must be solved in one minute. Otherwise, you will not have time to finish the exam. The final result is not released, but if you are able to answer all of the problems, you can get a good grade.",
            "comment_workload": "The workload depends on the style of your study. If you want to get an A range grade, you have to memorize all the matrials. And the workload will be huge. But if you want to get an B range grade, professors lecture, and reading the ppt once will be enough.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WP13vOudrsWFZRrCbN6hhCBXl30sQpaw",
            "semester": "2020-21 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "{Curly Braces}",
            "date": "Feb 09, 2021",
            "title": "Competitive Course",
            "comment_content": "Broad Contents. From signal transmission to the telecommunications industry to history, Foreign Direct Investment, and Network Competition, Interconnection, and many more.<br />You can see that the contents are very broad, while you are studying all of them within 2 weeks.",
            "comment_teaching": "Despite the fact that you have to take 3-hour lessons and 10 lessons, you may think this would be very boring.<br />However, in fact, Prof. Xu has made an interesting speech and many figures to keep you out of boredom.",
            "comment_grading": "Not too good and not too bad. Since this course is quite competitive, the grade can come out can be lower, or higher than your expectation.<br /><br />Grading Scheme:<br />Midterm (Open book, 50%)<br />Final (50%)<br /><br />Got 79.5 in midterm (mean: 77.8)<br />The Final exam is unknown since Prof. has already said not to release the score.<br /><br />Final grade: B-<br />The reason for such a low final grade can be reasoned as, again, this course is competitive. This could be due to the fact that I got below mean in the final, which even overcome the 1.7 marks above mean advantage in midterm.<br /><br />It is heard that A-range is for the top 25% of students.",
            "comment_workload": "Yes. 10 lectures each with 80+ slides. Even though the final is non-cumulative, you still have to handle the contents for over 400 slides in the assessments.<br />It is fine in the midterm since it is open book and it has 3 days limit.<br />But for the final, it would be much harder. Even you are prepared with cheat sheets, there can still be tricky questions.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "alC5bwnsEa3hJVD42gnS9Z3tztlZM5lL",
            "semester": "2018-19 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "iancheungg",
            "date": "Jan 24, 2019",
            "title": "mediocre content",
            "comment_content": "First week emphasis on technology aspects of telecommunication, second week focus on telecom history/regulation. Technology stuff is fun to know but history of telecom is quite useless to be honest.",
            "comment_teaching": "Professor tries hard to explain concepts and is very welcome to questions by students. With occasional jokes in lessons, three hours of class is still a bit too long.",
            "comment_grading": "easy to get B.<br />Midterm is quite easy with unlimited attempts. Around a hundred MCs and 3 essay question.<br />Final's structure are the same as midterms",
            "comment_workload": "No workload expect for a open book midterm.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gCQuAqfNcdPAeYhncWP7IrY8Z5Z3E6UV",
            "semester": "2018-19 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Au Tsz Chun",
            "date": "Jan 24, 2019",
            "title": "",
            "comment_content": "The course is quite intensive.<br />First 2 lectures are teaching technical things and the remaining is mostly about business and history of telecommunication",
            "comment_teaching": "Professor XU is good at telecommunication and he will share his experience during the lecture. But 2 weeks 3 hours lecture is quite tired and you need to attend lesson and drop notes to understand the content.",
            "comment_grading": "Mid-term mean is 91.5 and it is quite high as he gave all students full marks in MC session.",
            "comment_workload": "One mid-term on canvas with 2 days working time. One final in 3 hours. Both mid-term and final include MCs, short questions and long questions. No assignment.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EwgwYqt66XB52UObCtHssAkOPedtrK6C",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "eileen～",
            "date": "Jan 24, 2019",
            "title": "Bad Class",
            "comment_content": "boring and not useful unless you are really interested in telecommunication and network.",
            "comment_teaching": "The professor is good, but because of the boring content, you can't focus on class. Otherwise, the professor is from EMBA, and very knowledgable.",
            "comment_grading": "very bad!!!! the worst class I have ever taken. If possible, don't take this class forever. the quiz is difficult to find answer. and as for final exam, it's hard to conclude all the details on one single past paper. Not as good as expected.",
            "comment_workload": "little. just a quiz and final exam.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vu9TqTdCxNZV46AO9Q0DxoeTyPKDn3wk",
            "semester": "2018-19 Winter",
            "instructors": [],
            "is_author": false,
            "author": "meaningless",
            "date": "Jan 23, 2019",
            "title": "",
            "comment_content": "The course introduces some knowledge about the telecommunications industry in the world,including the past history,current development,etc. Quite easy to understand with very detailed explanation. Even you don't understand,just feel free to ask professor or watch the lecture videos again!",
            "comment_teaching": "Professor Xu is definitely an expert in what he is teaching that he provided lots of real-life examples with detailed explanation. Although the 3-hours lectures sometimes could be tiring,he gave 20-mins breaks to students. Also,he is very friendly and willing to answer students' questions. Lecture videos available.",
            "comment_grading": "Not yet released.<br />Midterm @50% (online-assignment)<br />Final exam @50%<br />Mean for midterm is quite high (91.1/100) because of the unlimited attempts allowed",
            "comment_workload": "Quite light. Just pay attention and jot down what professor mentioned in the class in every lecture should be fine. Double-sided one page A4 cheatsheet is allowed in final exam. Don't forget to put EVERYTHING on the cheatsheet!!!!!!!!!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9lBCbZ9HLeTXhRf5nkTqN3GZOJoalber",
            "semester": "2018-19 Winter",
            "instructors": [],
            "is_author": false,
            "author": ":):):):)",
            "date": "Jan 22, 2019",
            "title": "Will modified after grade releasing",
            "comment_content": "I take it as common core. I dun hv business background and I am mainly technology oriented person. <br /><br />Divided into 3 parts: Technology, socionomics, policies (US and HK)<br /><br />Technology part is the easiest part to follow, and not so deep into the principles...so if you dun hv engineering background (electronic + computer science), sometimes may get lost I guess...but it is still ok. <br /><br />policies is the hardest part in my opinion...since there are so many facts in the notes...and some technical terms are so specified",
            "comment_teaching": "Slow at the beginning of the lecture, and speed up at the end and rush the note -_- Some explanations are only given in the lecture but not notes, for example, the graph in the notes are only explained in his speech on the lesson. SO a must to attend lectures (or u can watch the lecture video:) )",
            "comment_grading": "Midterm: online midterm over weekends :| And...suddenly change policy: everyone get full score in mc part... due to a bug in the score courting: some students try several hundreds attempts to submit the answer in order to try all possible combinations in mc WTF @@ Therefore, it is changed to give everybody full score in mc part ... while I only submit one time and I work it alone&nbsp;&nbsp;-_- It is a wastage of my hard work in midterm, so unfair to me...@@ It make the mean ~91-92 % wtf == (I could still get 90+ even mc part is not given to be full==)<br /><br />Final: Not yet released, but only can bring 1 cheatsheet to the exam, some points I was missed to copy into the cheat sheet -_- aiya.....<br /> <br />Grade: not that good...I guess above mean 1 sd still B+",
            "comment_workload": "2 weeks intensive courses...good! Since in normal semester, you still work as a deadline fighter, I dun see any difference between winter course and regular course (and even less course material in my opinion :) ) <br /><br />Also, motivation usually lost in regular semester over 3 months:(&nbsp;&nbsp;, and u could spend more time in winter semester due to low credit load :D It is good to take it and reduce workload in regular semester...(as someone who overload every semester, winter course is a good choice to reduce workload in common core:D )",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fgoaeKhZt10qhhq6zL9sl41ZGbZvMdz8",
            "semester": "2016-17 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ParcoLeung",
            "date": "Jan 25, 2017",
            "title": "",
            "comment_content": "The powerpoint is not quite clear. He gives us many examples for each point. Therefore, if we just look at the powerpoint, it's hard for us to know all about the contents. As a result, it is recommended that you should get into the lecture everyday",
            "comment_teaching": "Professor used to giving us many examples in order to elaborate more about his teaching, such that we can fully understand the point of each content",
            "comment_grading": "It's ok I think. Since the midterm can be done by friends together, it is easy for us to get a higher mark and grade.",
            "comment_workload": "No workload at all except the midterm and final exam",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "joMHJd9Bxt1RWbSr3LhUuZD6ZPILH1wY",
            "semester": "2021-22 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Marcus_chen",
            "date": "Feb 07, 2022",
            "title": "",
            "comment_content": "The course cover the technology aspects of telecommunication during the first week,second week will focus on the regulation, history and policies of&nbsp;&nbsp;telecommunication.",
            "comment_teaching": "3 hrs lecture with some break, even though professor Xu english is good, it is still boring. <br />Recording will be posted on canvas.",
            "comment_grading": "midterm 50%&nbsp;&nbsp;final 50%<br /><br />all the exam will have True or false ,MC,filling the blank and essay.<br /><br />midterm will be held online and open book with unlimited attempt.<br />The mean of midterm is 80.83/100<br /><br />final has cheat sheet with A4 size.<br />The mean is 66.5/10",
            "comment_workload": "low workload, one midterm and final",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Wad5GDlcetbbHgWDoJQsazvSM1S0VCTu",
            "semester": "2020-21 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MakFF",
            "date": "Nov 09, 2021",
            "title": "",
            "comment_content": "最初因為唔記得drop搞到冇咗winter holiday. But it turns out ok.<br />The most impressive one is prof teaching the concept of regulating natural monopoly. <br /><br />It was like 大開眼界 and this knowledge helped me progress in my job.<br /><br />意外地無悔讀的common core",
            "comment_teaching": "讀ppt with some explanations. Just reading ppt by yourself is confusing, but with his explanations, it clears out a lot.<br /><br />考試前一星期爆loop recording",
            "comment_grading": "equivalent to your effort.",
            "comment_workload": "50+ pages per ppt and there were 10 lecture notes.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ed1IQUBFPiOTlZpCdlvsHU9vwN5yAq2K",
            "semester": "2018-19 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "大帥哥狄奇",
            "date": "Jan 24, 2019",
            "title": "Boring course",
            "comment_content": "Mostly information about telecom and networking. A lot of content in powerpoint which are mostly words every slide. The content is pretty useless if you are not IS student. It is a little bit too much for a 2 weeks course too.",
            "comment_teaching": "The professor is quite good. There will be lecture videos every lesson so you do not need to attend any class if you are willing to spend 3 hours in front of the computer every day.",
            "comment_grading": "Grade not yet received.<br />Midterm mean&gt;90% as you can score by attempting hundreds of time.",
            "comment_workload": "Not much workload. No homework/projects.<br />Midterm quiz (cover lecture 1-5) on Canvas with unlimited attempts so you can work with friends to find all the answers.<br />The final exam (cover lecture 6-10) is a little bit more difficult but if you put everything on cheatsheet and attend every lesson, you should be fine.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Vk0K1M3naZNvajCqTtPUzXIFxU15cXh0",
            "semester": "2017-18 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Unknown31415",
            "date": "Jan 21, 2018",
            "title": "Good Instructor, Heavy workload",
            "comment_content": "1. Technical Stuff about telecom (modulation, demodulation)<br />2. History of telecom<br />3. Policies of telecom<br />4. Marketing stuff of telecom<br /><br />Overall: quite interesting but may get bored due to the intensiveness of the course",
            "comment_teaching": "The professor is from the EMBA, and teaching is really good.<br />The professor is from mainland but his English is adequate.",
            "comment_grading": "Result not out yet, so IDK, but I heard that it is quite good",
            "comment_workload": "One mid-term assignment and 1 final exam with one-page cheat sheet. <br />Workload is relatively low for a 3 credit course but since winter sem only lasted for 2 weeks, 3 hr lecture per day for 5 days per week could actually be quite tiring.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zxOc3OwM1p5tCvW57BNAbQwG8tfWCcX7",
            "semester": "2021-22 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "UB0000",
            "date": "Feb 10, 2022",
            "title": "Not a bad choice in Winter Term in terms of grade",
            "comment_content": "The first half of the course is rather technical, about the technology and application involve in telecom industry. The second part is related to some economics and policy development in the industry. Not really useful or interesting unless you want to work in telecom industry.<br />Some reading is provided, but it is not necessary to read them.",
            "comment_teaching": "Professor Xu's accent is not perfect, but quite satisfactory from my experience. It is not too difficult to understand and follow his words. Also, he tries to interact with students and invite external guest to give us a sharing, which may help you to understand more about the current telecom industry. Fortunately the sharing is out of exam syllabus. <br /><br />For Mr Ng, the TA, the only problem is that sometimes he upload the lecture materials just before the lecture. His main duty is to help Prof Xu.",
            "comment_grading": "50% midterm, 50% final. <br /><br />Midterm: Last for 48 hours, &quot;open everything&quot;, but only focus on the first half of lecture materials. You may prepare by scanning the PowerPoint briefly. <br />Mean: 80.8/100 Highest:98/100 My score: 94.5/100<br /><br />Final: Close note, last for 1.5 hours. You may bring a 2-sided A4 cheat sheet. You may want to recite some important points in the lecture and slides as the time is tight. <br />Mean: 66.5/100 Highest:95/100 My score: 88.5/100<br /><br />Final grade: A+ (I didn't have any relevant background but I did invest time in the course.)",
            "comment_workload": "The course become less intensive this year. as it turns into a 3-week course instead of 2-week, excluding exam. Although we still have 10 3-hour lecture, we have more time to revise for midterm and final, plus a day of break.<br />You need not worry about working with hw or project everyday, but you still need to revise the lecture if you want a good grade.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "G562RH6CDuSelv4d9DQj0YMwgrq8OogV",
            "semester": "2021-22 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                },
                {
                    "id": 801,
                    "name": "NG, Ka Wai Tommy",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "grindingalways",
            "date": "Feb 10, 2022",
            "title": "Good course to take if you want to boost your GPA in winter!",
            "comment_content": "You can find the content from others' reviews, but basically, the first part is something very technical, and some are actually overlapping with the content of ELEC1010 so if you have taken ELEC1010 before you would feel much easier to understand. And then some lectures cover the historical side of how telecommunications develop over the years, including changes in policy. There are also lectures that talk about somewhat more interesting topics, such as diffusion of innovation and innovation 2.0.<br /><br />But after all, the content to me is very boring, and I had a hard time trying to focus during class so I skipped all of them and watched lecture videos in the end.",
            "comment_teaching": "Professor Xu is a nice and friendly professor. I actually think his accent is a bit hard to understand, so I had to frequently pause the lecture recordings and go back to listen again. And the reason why I tried to catch every word that he said is that the mid-term and final exams cover more than just the lecture slides. Sometimes Professor could share more information in class and they would be tested as well, so be aware of that. Anyway, he replied to emails very promptly. I have sent emails to him at midnight and he responded to me after a short while.",
            "comment_grading": "Mid-term and Final both occupy 50% respectively for the final grade. They are non-cummulative. Mid-term is a take-home one that lasts for a couple of days, while for final it's supposedly taken at school but due to COVID it's switched to online (closed book, but 1 A4 chear sheet, both sides allowed). You may send email to TA to ask the specifics of your score breakdown as well as distribution.<br /><br />Mid-term (50%)<br />Mean: 80.83/100<br />Me: 98/100<br /><br />Final (50%)<br />Mean: 66.5/100<br />SD: 16.2<br />Me: 83.5/100<br /><br />Final Grade: A+",
            "comment_workload": "Harsh to me. As I was taking an internship as well, the workload from the course is very huge given its intensive nature. Each lecture note nearly consists of 100 pages, and the exams are more like a memorization game, so I rushed and stayed up all night to make the cheat sheet for the final exam, and it was very painful. But I think efforts will certainly pay off for this course!",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Jod18BTMLWFI13xIuPMaVquXLvN8klKC",
            "semester": "2015-16 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Duke of N.T.",
            "date": "Mar 14, 2016",
            "title": "",
            "comment_content": "The contents are original and board. However, be prepared to be familiar with that much of content. You'll need to apply it to the exam. There are also quite a lot of readings which probably you will not have time to read just in two weeks. So, focus on understanding the lectures. Go kill yourself if you sleep in this class! You won't sleep in the cinema, don't you?",
            "comment_teaching": "I don't know the professor personally. He is quite good I think, we rushed up to the front after lecture and ask him questions for almost half an hour, and he explained with clarity and gave us insights. One thing must note is that he is very well versed in the field, some of the readings are written by him..",
            "comment_grading": "I don't have anything to say about this...not a math course..but if you used those concepts and examples you should be fine..",
            "comment_workload": "This is probably the course with the lightest workload in terms of...tangible work. One mid-term (assignment) which you need to do on canvas, and one final exam. But you have to devote the afternoon of all weekdays (Mon to Fri) for two weeks, and the after lecture time for revision. That is the hidden workload.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "T9R9efQfhtC5aee0lWSJpqyry9iG9nIa",
            "semester": "2021-22 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Timmy Chung",
            "date": "Jan 27, 2022",
            "title": "",
            "comment_content": "The first part is mostly about some technical knowledge like how the telegraph works and the future prospect of technology. Most of the contents are not updated (there are still 3G in the PowerPoint).<br /><br />The second part is about the economic value of telecommunication and the regulations. It is more interesting in my opinion.",
            "comment_teaching": "Professor Xu teaching is alright, his English is very clear and you can easily understand what he said. He adds some videos to make the lessons less boring but 3 hours lecture is still exhausting.",
            "comment_grading": "Midterm 50%<br />Mean 80.8/100<br />Final 50%<br />Mean 66.5/100<br /><br />There are T/F, multiple-choice, filling blank and essay. Mid-term questions are alright and you can find most of the answers by searching the PowerPoint. However, some of the questions are not included in the PowerPoint but taught by the professor in class.<br /><br />Thanks to Covid, the final become an online exam. I would say it is actually easier than the mid-term and the time is very tight.<br /><br />The grade is not released yet, I would update it later.<br /><br />Edited: The grade is the same as expected, so the grading is acceptable.",
            "comment_workload": "There is no assignment, only mid term and final. However, it is quite intensive to attend 10 lessons of 3 hours in 3 weeks.",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ujhEwJSCUzzVoiS0Rs4N3PfkvrThfN0W",
            "semester": "2018-19 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pumpkin",
            "date": "Jan 22, 2019",
            "title": "QUITE GD",
            "comment_content": "THE CONTENT IS QUITE BORING AND NOT USEFUL WHICH IS ABT TRANSFORMATION OF TELECOM. INDUSTRY. TOPIC IS QUITE DULL WHICH ISN'T USEFUL FOR NON-IS STUDENT",
            "comment_teaching": "HE TAUGHT QUITE GOOD AS HE IS GOOD AT EXPLAINING&nbsp;&nbsp;GRAPHS WHICH IS GOOD FOR YOU TO UNDERSTAND DEEPER",
            "comment_grading": "GRADING ISN'T FARE IN MIDTERM AS HE MENTIONED IN EMAIL THAT IT WOULD ONLY COUNT LAST ATTEMPT WHICH GIVES YOU UNLIMITED MULTIPLE GUESS. AFTER SUBMISSION, PROF. SAID THAT HE WOULD GIVE ALL MC MARKS AS LONG AS YOU SUBMIT IT, SO IT IS NOT FAIR !<br /><br />FOR FINAL, IDK",
            "comment_workload": "U HV TO STUDY!",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NcQXE5Xq1dQXYk7WCTjQDwnqRZpccNt2",
            "semester": "2020-21 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lemon juice",
            "date": "Feb 24, 2021",
            "title": "烂课",
            "comment_content": "很无聊的东西，从技术讲到政策，没有什么实际意义",
            "comment_teaching": "就那样，教授人挺好",
            "comment_grading": "考试是最烂的部分，全部是课件里的内容，包括一些无趣的组织和政策名字，还有essay。就是看查资料的速度和写essay的水平，我相信这些考试内容并没有任何实际用处。最后final没有出分就有了letter grade，让人感到怀疑。",
            "comment_workload": "没有workload，你只需要会写essay并且查资料够快就能拿高分",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}