{
    "error": false,
    "course": {
        "id": 712,
        "subject": "ISOM",
        "code": "4740",
        "name": "Enterprise Resource Management",
        "description": "Basic concepts and practices of enterprise resource management; popular enterprise resource planning software packages, such as SAP R/3 for discussing and building integrated business solutions.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2220,
            2210,
            2120,
            2110,
            2020,
            2010,
            1920,
            1910,
            1820,
            1810,
            1720,
            1710,
            1620,
            1610,
            1520,
            1510,
            1420,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"ISOM\" data-code=\"2700\" href=\"/review/ISOM2700\" target=\"_blank\">ISOM 2700</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.06,
        "rating_teaching": 4.19,
        "rating_grading": 4.5,
        "rating_workload": 3.56,
        "review_count": 16,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 365,
                "name": "LAU, Ronald",
                "count": 14
            }
        ]
    },
    "reviews": [
        {
            "hash": "ciY6Wz0k8mbsrSKjqe3dz69c2PKfM72w",
            "semester": "2020-21 Winter",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AnsonChengacac",
            "date": "Feb 09, 2021",
            "title": "Interesting Winter Course",
            "comment_content": "It is a winter course review:<br />Day 1: Introduction<br />Day 2: Contemporary Issues and Latest Development<br />Day 3: Managing Business Process Change<br />Day 4: Introduction to SAP<br />Day 5: Learning SAP-SD,MM,PP<br />Day 6: Integrated Business Process - 1<br />Day 7: Integrated Business Process - 2<br />Day 8: ERPsim Logistic Game<br />Day 9: Enterprise Systems Implementation<br />Day 10: Business Analytics<br />Day 11: ERPsim Logistic Game<br />Day 12: Final Exam<br /><br />Yes only 12 days, meaning that workload will be super high.",
            "comment_teaching": "Ronald is a good professor that has taught for many years. One good thing about his lecture is he will mention some details or hints that would be useful for the online quiz after class, so jot notes in class (even it is a 3hrs and 20 minutes lecture; 10 min break in the middle).<br /><br />TA is helpful and responsive for the email.",
            "comment_grading": "Quite good.<br /><br />Online Quiz/Participation: 20<br />Case Analyses: 10<br />Lab exercise: 20<br />ERP simulation games: 10 (20% for practice; 80% for real)<br />Final Exam: 40<br /><br />I think the mean is B, +0~1SD can already get A-.<br />The grade is highly dependent on your performance in final exam.<br />(tips of getting high marks will be discussed in &quot;Workload&quot; session.",
            "comment_workload": "- Online Quiz/Participation<br />After every lecture, you need to finish an online quiz.<br />i.e. Mon lecture, deadline for online quiz: Mon 23:59<br />but Fri lecture, deadline for online quiz: Sun 23:59<br />Good arrangement, but still, quite stressful to have quiz every day. You need to remember you have an online quiz every day....<br /><br />Each online quiz consists of 5 MC@0.4 (total: 2; 30min).<br />Parti adds up to online quiz score.<br />Each parti equals 0.2 scores.<br />There are online videos for each topic, they are only useful for online quizzes, not likely to appear in final.<br /><br />- Case Analyses<br />Actually, there are open-ended questions, so don't copy from other sources.<br />Try to get some insights from lecture notes.<br /><br />- Lab exercise<br />Simply follow the guide (wont appear anything related to SAP in final)<br /><br />- ERP simulation games<br />Performance in simulation game might differentiate you from others, maybe.<br />Depends on your groupmates and your strategies.<br />Make sure to connect the data to Excel through OData that can update the sales data in Excel for analyzing data.<br />Compete with others to get the highest in business valuation.<br /><br />- Final Exam<br />Discussion in the class will very likely appear in final, so make sure you pay attention in class and jot notes. You got plenty of time to do, normal difficulty, no worry.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3E7A6yPo5vaJnt83iniX7WkKmIL7EFBO",
            "semester": "2018-19 Winter",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nandattou?",
            "date": "Mar 17, 2019",
            "title": "Good Winter Course",
            "comment_content": "Objectives of his course:<br />\t• Learn how to make decisions with ERP<br />\t• Learn the concepts and industry practice of ERP<br />\t• Learn the basic applications of ERP<br /><br />The course introduce the concepts of ERP, how it came about, how different business utilize ERP, Contemporary Issues and Extended ERP applications, Understanding Business Processes, Enterprise Systems Implementation, and a little bit about Business Analytics.<br /><br />There are videos online that talk more about different concepts with more detail but video content and slide lectures are pretty different. Slides are much simpler and are discussed during class.",
            "comment_teaching": "Professor Ronald has been teaching this course for several years so it's safe to say that he's more than knowledgeable about ERP systems. Occassionally, it does get a little boring but he does try to make it fun by including his own experiences and analogies about the concepts. There wasn't any difficulty at all in trying to understand the concepts. I would say it was pretty straightforward.",
            "comment_grading": "iPRS / Participation 10<br />Case analyses 10<br />Lab exercises 20<br />ERP simulation games 20<br />Final exam 40<br />Total 100",
            "comment_workload": "iPRS was conducted every day so attendance was pretty much mandatory. To be prepared for iPRS, make sure to watch the videos and note them down and read the slides which are released a day before, sometimes he also includes the concepts he discussed during class so do pay attention during class. iPRS means are pretty high say 0.8 to a perfect 1, costing 0.2 points for each questions with a total of about 5 questions. <br /><br />For case analyses, there are only 2 cases given. There are questions given in the syllabus to help build your case so it's not all that difficult to apply knowledge from the course into the case. Be sure to get above mean for both cases.<br /><br />Lab exercise are, I would have to say, the most annoying assignments. Each assignment would take me at least an hour to do with SAP. But the level of difficulty is easy as there are guidelines to follow on how to complete the assignment. Be sure to get a perfect score on all of the labs.<br /><br />ERP Simulation Games were one of the most interesting activities of the course. You get to operate as a business to procure and transport goods to the warehouse and retail stores as well as match and adjust the pricing to dominate the market. Make sure to have a good strategy and good teammates to earn a good ranking. The 1st game constitutes only 5% while the second game constitutes 15%. My team did better in the 1st game. A tip is to make sure you procure goods everyday. <br /><br />My thoughts during the final exam was that it really caught me off guard. I don't really know how I did but to be frank, I didn't think it was easy at all. Most of the questions were based on class discussions so NEVER SKIP CLASS, slides were also a part of the questions whereas video content were little to none at all. <br /><br />Overall, I got an A which thank god meant that I probably did fine at the final exams. Considering all the above factors, I got mostly above mean for iPRS, Cases, aced my labs and did get 1st for 3 rounds during&nbsp;&nbsp;first simulation and 1st for 1 one round at final simulation. I would recommend this course to anyone who needs a good grade to boost their grades as well as people who are interested in ERP.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "OeFolGtWf2VGJniddbzWcWaQ04VMc3Vl",
                    "name": "ISOM4740SyllabusW2019",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "ofhUEjny8xMtKA3u8vlAwW7jzUAfYUne",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bbbbb",
            "date": "Jan 24, 2020",
            "title": "Good choice as OM elective",
            "comment_content": "This course covers topics below:<br />Introduction to ERP<br />Technology enablers<br />Contemporary issues &amp; latest development (ERP, SaaS…)<br />Diagnosis of business process problems<br />Managing business process change<br />Introduction to SAP<br />SAP-SD, MM, PP<br />Integrated business process<br />ERPsim<br />ERP implementation<br />Business analytics",
            "comment_teaching": "Ronald is an experienced professor in OM. Although some of the lectures are boring, the concepts and content are clearly explained. There will be video on canvas to further explain the topics as well, which may help to you understand more before you go to lecture.",
            "comment_grading": "Got an A. Not sure about the score of final exam. Easy to get full mark of online quiz &amp; lab exercise. The most uncontrollable part is the simulation game as it is a relative score in the class as the your team is completing with other teams in the class. <br /><br />Online quizzes 9.8/10 <br />Case analyses 9.7/10 <br />Lab exercises 20/20 <br />ERP simulation games 18.3/20 <br />Final exam unknown/40 <br />Total 100",
            "comment_workload": "Workload is acceptable as a 4000 level course. Although it seems a lot to do, each task won't take a long time to complete.<br /><br />Quiz<br />There is a quiz every week in canvas. The quiz usually covers the online video and the previous/coming week’s topic. Time limit is 30 minutes per quiz but it usually takes you less than 10 minutes to complete.<br /><br />Case<br />There are 2 cases in the semester. You have to write answer 3 questions for each case with 1-2 pages single spaced. I usually start reading the case and completing the essay a night before the deadline(due before class). The case will be graded in identification of issues, analysis, comments of solutions, concepts, use of language. <br /><br /><br />Lab exercise<br />Lab exercises are assignments about using SAP. You can choose to complete with the time given in lecture, or at home. There are 4 lab assignments in total. It is easy as all instructions and guidelines are clearly provided. TAs are willing to help you to solve your problem too.<br /><br />Sim game<br />ERP simulation games are about running a real business about setting price, inventory management and distribution in the supply chain. It is the most enjoyable part of the course. But make sure you have a good team with good communication and strategy. The first and second simulation game contribute 4 and 16 percent respectively. <br /><br />Final exam<br />Final exam is conducted in canvas this semester. Not very difficult if you understand all the concepts.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zlo7pbh2XqJ0L13cXLkHdOLI2RwspK0o",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LewisYip",
            "date": "Jan 22, 2020",
            "title": "Ronald Lau",
            "comment_content": "He is a very good teacher and there are 2 very helpful TA solving our problems.",
            "comment_teaching": "It is a bit long for a student to sit in a class for 3 hrs.<br />So, he provides a break in the middle and at the end of the lesson, the people who finish first could leave immediately.",
            "comment_grading": "Grading is normal.<br />Do better to get a better grade.<br />I got a B range and I think so far so good",
            "comment_workload": "The workload is quite a lot.<br />Every week has the assignment to hand in, but that's easy when you follow the step.<br />So, no need to worry about it.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3OM5MPIFU5eYcO4gYjuxIhYZlvLZGfCx",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ustarange",
            "date": "May 11, 2023",
            "title": "",
            "comment_content": "Week 1:<br />Introduction<br />Technology enablers<br />Week 2:<br />Managing business process change<br />Diagnosis of business process problems<br />Week 3:<br />Case discussion on Cathay Pacific <br />Introduction to SAP<br />Week 4:<br />Contemporary issues and latest development<br />Learning SAP-FI <br />Week 6:<br />Learning SAP-SD<br />Customer relationship management (CRM) system<br />Week 7:<br />Learning SAP-MM and PP<br />Supply chain management (SCM) system <br />Week 8:<br />Integrated business process<br />Master data<br />Week 9:<br />Enterprise systems implementation<br />Make-to-stock (MTS) scenario<br />Week 10:<br />Case discussion on Bloom &amp; Grow Asia (A)<br />Integrated business process: Review exercise<br />Week 11:<br />Case discussion on Bloom &amp; Grow Asia (B)<br />SAP reporting and analytical tools<br />Week 12:<br />Business analytics<br />Excel's pivot table",
            "comment_teaching": "Prof is very nice and helpful but the lecture is a bit too long and might not be very interesting.",
            "comment_grading": "iPRS quizzes / Participation 20%<br />Case analyses 10%<br />Lab exercises 20%<br />Final exam 50%<br /><br />Most people got almost full marks in the IPRS, case analyses, and lab exercises, as they are not very hard and the grade is not harsh too. Therefore, the final exam will determine your grade. If you just want to get a pass, you already got about 50% from IPRS and homework. If you want an A range, then study hard for the final exam, the exam will not be very easy as it covers the content of the whole semester. Overall, quite good grade as it is easy to get a B range when you don't miss the hws.",
            "comment_workload": "Fair workload, most homework is not very hard because there are guidelines for the ERP lab hw, but it is very time consuming, usually taking 3-4 hours to finish it. For case analyses, just read the case and write for about a paper to response to the question.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nK3NbvyyyTXs1EDb7ghtTm6itfpc7fhk",
            "semester": "2022-23 Winter",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KaruizawaKei",
            "date": "Jan 31, 2023",
            "title": "",
            "comment_content": "Day 1: Introduction, Technology Enablers <br />Day 2: Managing Business Process Change , Diagnosis of Business Process Problems <br />Day 3: Case Discussion , introduction to SAP<br />Day 4: Contemporary Issues and Latest Development , Learning SAP-FI <br />Day 5: Customer Relationship Management&nbsp;&nbsp;, Learning SAP-SD <br />Day 6: Supply Chain Management&nbsp;&nbsp;,Case Discussion ,Learning SAP-MM, PP <br />Day 7: Integrated Business Process <br />Day 8: Enterprise Systems Implementation ,Integrated Business Process <br />Day 9: Case Discussion ,Integrated Business Process <br />Day 10: Case Discussion ,SAP Reporting and Analytical Tools&nbsp;&nbsp;<br />Day 11: Business Analytics&nbsp;&nbsp;,Excel’s Pivot Table&nbsp;&nbsp;<br />Day 12: Final Exam",
            "comment_teaching": "Good teaching. Prof Ronald illsutrated the concept in detail and slowly so that most of us could follow.",
            "comment_grading": "Super lenient grading...<br />20% case studies assignments<br />20% iPRS (4 out of 5)<br />10% Lab<br />50% Final Exam<br /><br />Most students got full mark rather than the Exam.<br />The exam is super easy.",
            "comment_workload": "The workload mainly came from the 3.5 hrs lectures per day... Those case studies, lab, iPRS quizs are very easy.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LyJG4ckpiwagiXRSNoLYYqWvUYY4rzPk",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hayoha",
            "date": "Dec 30, 2022",
            "title": "Out of the expectation (grade &amp; Workload)",
            "comment_content": "Course goals:<br />1. Compare the strategic values and limitations of enterprise systems.<br />2. Discuss the basic concepts and practices of process-oriented management in <br />a global, competitive environment.<br />3. Define the skills and knowledge to successfully implement an enterprise <br />system in organizations.<br />4. Identify the new development of ERP software and applications for facilitating <br />e-business.<br />5. Demonstrate examples of business process integration through the use of ERP <br />core applications and modules.<br />6. Identify the tangible benefits of enterprise integration for decision making using <br />ERP analytic tools and Excel.<br /><br />You will also know more about SAP (basic information + practical experience).",
            "comment_teaching": "Professor Lau is kind and he tries to explain the content with more examples and graphs. But I hate 3 hours long Lecture as It is so difficult to focus. There is a break in between. I think I did not fell asleep because&nbsp;&nbsp;the teaching style is interactive (and I choose to sit at the first 2 row).",
            "comment_grading": "IPRS quizzes/ Participation 20%<br />Case analysis 10% (total 2 cases, 5% per one)<br />Lab exercises 20% (3 SAP Lab assignments)<br />Final exam 50%<br /><br />There are total 5 quizzes, and only counting the best 4 out 5. But they are very difficult, you need to find the answer fast enough. I scored 4/5, 3/5, 3/5, 3/5, 3/5 for my 5 quizzes. so eventually I have 13 out of 20 in the Quizzes. Participation (answering questions in class/ help finding the typos in the book) can add up to 4%.<br /><br />My grade: A+<br />Quizzes/ Participation: 17/20<br />Case 1: 4.5/5<br />Case 2: 4.8/5<br />Lab: 20/20<br />Final: not released<br /><br />The seating plan was fixed in around week 6-8. Seem the participation was started only after the sitting plan settled.",
            "comment_workload": "Have some short videos need to watch before lecture. You may need to write notes and memorize some key terms as the content will be tested in Quizzes.<br /><br />Quizzes: content in PPT, content discussed during lectures and the content inside the book<br /><br />Case: each one I took around 1-2 days to finish, the length is around 1-2 pages.<br /><br />Lab assignments: all steps are given and Professor is happy to help you if encounter any problem. But they are very time-consuming (each one average take me 10-12 hours to finish, but this could be depending on different people). Professor said should be everyone getting full score since he and TA are helping + having step by step guide)<br /><br />Final exam includes calculations, short questions and long questions, no MC. (2 hours, open book: only Professor's book, can drop notes on it)<br /><br />Professor is kind, so he gives his book about ERP to everyone for free and it has around 200 pages. That is also the final's syllabus. The lecture PPTs and videos' content are included inside.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "c5qmxSkZRwJK0uBDIrtfFX1kEDRM4F4H",
            "semester": "2020-21 Winter",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rotten tomato",
            "date": "Feb 04, 2021",
            "title": "A Hectic But Good Winter Course To Take",
            "comment_content": "The course is all about ERP, which includes the tech enablers, background, issues, implementation of ERP, and process change.<br />It also teaches the use of SAP-ERP, including FI, MM, SD, PP.<br />And at last, it will cover MRP, business analytics, and pivot table.",
            "comment_teaching": "Ronald is a good professor, his lessons are informative and he can explain the points clearly. However, it is a winter course which we need to attend 3 hours every day, so it can be boring sometimes. <br />Even though he said videos on Canvas won't be tested in the exam, it is still very useful in understanding the topics and some answers for both the online quizzes and final exam can be found in the videos, so it is important to watch all the videos imo.",
            "comment_grading": "Online quizzes/ Participation (20%): 15.2/20<br />Case 1 (5%): 4/5<br />Case 2 (5%): 4.2/5<br />Lab exercises (20%): Full marks<br />Sim game 1 (2%): 9th/13 teams<br />Sim game 2 (8%): 11th/ 13 teams<br />Exam (40%): 48/50<br />Final grade: A-<br /><br />Not difficult to get full marks in lab.<br />Online quizzes consist of 5 mcq each day and answers can be found mostly from the canvas videos and ppt.<br />Prof stated that he didn't expect a perfect answer in cases, so as long as you pay some effort, you can get good marks.<br />Sim games are not very important in this semester as even the worst-performing team can also get 8.8/10<br />Exam consists of 25 short questions and is not difficult except for the MRP calculation part which is a bit complex and time-consuming, but the exam is still easier than online quizzes in general.",
            "comment_workload": "As it is a 2 weeks, 3 hours per day course, there are assignments due almost every day, and the fact that the exam is conducted the day after the last lesson makes the schedule a lot tenser if not already. But as Ronald said, if you can survive the first few lessons, the course is actually not that demanding and difficult.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FR6R2QeLdEnV7ciSY9M4a5VDfgvzVOED",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "iloveis",
            "date": "Jan 30, 2019",
            "title": "A HEAVY workload yet rewarding course",
            "comment_content": "Different ERP concepts will be taught but they are fragmented and difficult to follow at first glance. You have materials from canvas &quot;e-book&quot;, canvas video, in-class lecture slide, in-class materials. They are somehow in the same module but not really related to each others. So it takes quite a lot of time, especially before final exam, to understand these concepts. Overall, I would say this course is not just about ERP, but a broader perspective into Operational Management and to certain extent related to information system. So it's a perfect match if you are majoring in both IS and OM, you will find these concepts to be practical and useful.",
            "comment_teaching": "Teaching is hard to follow. Like what I mentioned, the materials are fragmented. You need to spend quite a lot of time just to re-organize such materials into one place. But after that, you will then realized that all these concepts are related&nbsp;&nbsp;to each other, Ronald is helpful and special thanks to the TA, she helped me a lot for lab exercise.",
            "comment_grading": "Grading is unexpectedly good for this course lol. Our group scored the last runner up for the team simulation game but I somehow managed to get a &quot;A&quot; grade for this course. Thanks Ronald, I love u :) <br /><br />Overall, the simulation games, cases or in-class activities do NOT really make a difference to your final grade. There are only one grading criteria in fact, your final exam. Pay extra effort to look into details (really, the little details) in the slides, especially in the online canvas book and put such names/ concepts/ components into the cheat sheet because they will be tested in the final exam. Specifically, they will ask you what are the Three components in XXX, so if you just understand the concepts but forgot the exact wording, you will still score 0 for the question. <br /><br />So the key is to make a perfect cheat sheet for the final exam. Pay extra attention to details.",
            "comment_workload": "HUGE workload. Literally one of the largest workload courses I have taken during my 4 years study in the university. You will be like study two courses at the same time. It involves nearly all tasks that can be assigned: Project, lab exercise, case study, stimulation game, exam, online quiz, in-class iPRS ( this is difficult). You need to spend TONS of time to complete the tasks on time. There are deadlines on deadlines, it means that after you have completed one task, the other task will soon due in just a few days after. If you don't manage to allocate your time effectively in this course, for my personal advice, don't register this course and go for another OM elective lol.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Q3iCxTRFEsHi8TnJVEDSCbaEgQ4qFDaw",
            "semester": "2018-19 Winter",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "thyc0309_",
            "date": "Jan 30, 2019",
            "title": "For OM major students, this is a very good way to spend your winter semester.",
            "comment_content": "Enterprise Systems and Integrated Business Solutions, Technology Enablers for ERP (IT architecture, SOA, SaaS...), Contemporary Issues and Extended ERP Applications (SCM and CRM), Managing Business Process Change, Implementation issues, and Business Analytics &lt;-- Lecture contents<br /><br />Modules of Sales and Distribution, Materials Management and Production Planning, and how to integrate all of them in a complete business process &lt;-- Lab (SAP) contents",
            "comment_teaching": "Students need to read the ppts beforehand and watch the lecture videos he put on Canvas before coming to lectures, as he will cold call students to answer his questions related to those contents. Two-second hesitation and you're over.<br />Other than that, he did try to make the lectures interesting and relaxing by giving lots of examples and telling us some interesting facts behind the contents. Will divert some time into talking about his own experiences and making some jokes (although sometimes not funny...).<br />After all, he has been teaching for ~30 years. Show some respect to him.",
            "comment_grading": "10% iPRS / Participation<br />10% Case Write-ups x2<br />20% Lab exercises (follow the lab menus closely and you'll easily get full marks)<br />20% ERPsim logistics game (4% for First round and 16% for Second round with Power BI, btw you gotta learn Power BI yourself beforehand)<br />40% Final Exam (Short questions, an MRP problem, a problem of calculating CTC cycle time, and case study questions)",
            "comment_workload": "The workload is not smaller than in Fall semester and the course lasts for only two whole weeks in January, so it may seem high for some people. For me since I don't have anything else big to do other than taking this course, I think the workload is acceptable.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "rZ7uBjQM2L10qdapxsQT716tYcND9Duo",
                    "name": "SyllabusWinter2019",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "Yq0RI9BEwhvhowdVRTT8n192iq0zCvy0",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Handsome",
            "date": "Jan 30, 2019",
            "title": "Very very hard, very very heavy workload",
            "comment_content": "ERP is very very very difficult, you will gg when you go to take the final exam. Remember to write down the system name in cheatsheet, otherwise you will also gg. Remember to find good groupmate for simulation. I think the tutorial materials are well prepared, TA is very responsible. For this semester it is close-book, but i know previously it is open book. Ronald said he was making the new textbook. Good luck guys/",
            "comment_teaching": "Ronald is good, ERP is hard. Ronald is interesting, he always talked about his stories, but it's not related to the course materials. Ronald always asks students randomly for the questions, you only have around 1 second to think about it, if you lose it you will byebye. remember to answer more questions to earn parti.",
            "comment_grading": "Bad:( But maybe I did it very bad ;( i don't know, im lost.",
            "comment_workload": "3 lab homework (each you need 2 hours)<br />3 hours lecture per week<br />no midterm<br />2 case study<br />2 simulations<br />participation for every class is required<br />every week have online quiz<br />every lecture have iprs (count grading)",
            "rating_content": 1,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EFyTQeSnz4LHL5SI1j4yndFFHakeUkkH",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jamky",
            "date": "Dec 28, 2018",
            "title": "An amazing course with amazing grade",
            "comment_content": "Great content teaching the evolution of enterprise systems, process change, SDLC, business analytics, and usage of SAP software.",
            "comment_teaching": "Lecture slides are too simple when compared to materials on Canvas (pages). Beyond a 3-hr lecture every week, blended learning is also needed. Canvas materials are not exactly same as online videos, making it difficult to follow what's in the videos when referring to Canvas materials.<br /><br />Teaching style is quite boring 🤫 for a 3-hr lecture though a short break will be available during lesson.",
            "comment_grading": "Grading scheme:<br />Parti 10<br />Online quizzes 10<br />Case analyses 10<br />Lab ex 20<br />ERP simulation games 20<br />Final exam 30<br /><br />Its unexpectedly good grade that I scored A- given our project performed not well (ranked at last fourth) in simulation games which we think: OMG, we are going to have a poor grade but the result is not bad at all.",
            "comment_workload": "Not really heavy given no mid-term exam and project. Being somehow active in class is enough, what's more important is your simulation games and final exam.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "on9q8H2De9dRbthxAWkqtMCy5gdjBjCs",
            "semester": "2017-18 Winter",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Esmer Ng",
            "date": "Feb 27, 2018",
            "title": "",
            "comment_content": "It is mainly about the development of ERP systems in global businesses as well as local small businesses, comparing and contrast different ERP architectures, constructing a process flow diagram and solving a material requirements planning (MRP) problem. <br /><br />Must purchase the textbook because most of the exam questions could be found in the textbook.",
            "comment_teaching": "幾鍾意prof嘅教法，起碼我堂堂都有聽書同jot notes，要學嘅content唔算真係多，除咗多咗少少嘢做之外。",
            "comment_grading": "Participation 20 <br />Case analyses 10 <br />Lab exercises 10 <br />ERP simulation games 10 <br />Final exam 50 (open book only, could not bring any notes)<br /><br />Parti I got 20/20<br />Case analyses 8.xx/10<br />Lab exercises 10/10<br />ERP simulation games 9.xx/10<br />Exam (didn't release marks)<br />Overall: A",
            "comment_workload": "Winter Sem 嘅workload會同平時嘅一樣，唔會少到，所以會感覺上好多嘢做，因為都係有五個Lab exercise, 2份assignment，同埋simulation game要玩。",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tcP5gL73c5IoAqOJyj5hdjrVjR6tXbDc",
            "semester": "2017-18 Winter",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ihategpprojects",
            "date": "Feb 05, 2018",
            "title": "Funny professor, can learn SAP too",
            "comment_content": "This course mainly teaches you the history, features, pros &amp; cons of ERP. Also describe how ERP can facilitate customer relationship management (CRM) and supply chain management (SCM), as an extension of ERP software. <br />Ronald usually would spend half of the lesson to do the lecture, then the other half will go to the lab and learn to use SAP software. <br />Learning material requirements planning (MRP) is very useful.",
            "comment_teaching": "I like Ronald style as he is willing to share his own experience with us and constantly ask questions to encourage the students to think actively. <br />Although he was a bit frustrated with another course students complain of too messy for having the notes and course book for study at the same time,&nbsp;&nbsp;I like to read the course book so much as it is more detail. Anyway, the notes and course book are complementary.",
            "comment_grading": "Quite good for me, got A- even I didn't finish my MRP question and spent a lot of time to find the 冷門 answers in the course book during the exam. Pay attention to what Ronald said in the lesson, as some of the answers are not written in the notes nor the course book. But also have many long questions are straightforward. <br />You must be very familiar with your course book in order to find the answers immediately.<br /><br />Grading criteria: <br />Participation 20% <br />Case analyses 10% <br />Lab exercises 10% <br />ERP simulation games 10% <br />Final exam 50%",
            "comment_workload": "Almost every lab will have an assignment due by next lecture, but it is really easy just need to follow the manual. <br />No project, no midterm. Just simple lab assignment, moderate class exercise and a final.<br />It is an open book exam, students are only allowed to bring the course book written by Professor Lau.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lJfbWs0SPgGSo8lvfl8XHAbQCNe4AQWY",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 365,
                    "name": "LAU, Ronald",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hihihihi",
            "date": "Jan 09, 2016",
            "title": "For fall sem's reference only as winter sem is a litte bit different",
            "comment_content": "Mainly about the introduction of ERP, the pros and cons of ERP, the introduction of different kinds of ERP, the function of SAP, some system implementation knowledge.<br /><br />It will have a set of ppt notes and Ronald's own textbook, but half of the ppt notes are not included in the textbook so you will need to write that down in your textbook (exam open book). One important point is Ronald likes to talk about sth not in the notes and textbook but those are tested, so pay attention in the class. <br /><br />You will need to play a simulation game which counts your marks, but doesn't really matter if you lose. <br /><br />Attendance is counted.",
            "comment_teaching": "I would say it's Ronald teaching style xd. For me, he explains concept quite clearly, and have a lot of examples with some are his personal experience. Sometimes funny and sometimes a little bit boring, but at least I understand what he delivers.",
            "comment_grading": "Ronald's grading is always not bad. It doesn't have midterm, and all other scores (case, attendance, simulation game) are quite similar among each other, so the most important one is your final exam mark. <br /><br />My friends and I didn't really do well in final as we have some questions do not really know how to do, but we all at least get b range and some a range.",
            "comment_workload": "Two group case, two lessons for playing simulation game, some in-class exercise and final exam.<br /><br />Group cases are okay, final exam is a little bit tough because you will needa take time to sqeeze all things in the textbook, but Ronald provides a study guide you can choose to allocate your time in studying the chapters.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Oo4xn7ZU5awZstgtYcjKqikkKkF37ean",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "886kiu",
            "date": "May 15, 2023",
            "title": "",
            "comment_content": "Many slides and professor had provided us with a detailed textbook made by him. We could always review the contents easily and in detailed.",
            "comment_teaching": "Blended learning. Professor doesn't mention much about the course content in class. However the lesson videos are clear and there are many sources to review after lessons.",
            "comment_grading": "Professor Lau has really adequate grading on the course. I reached mean for the exams but got a b range.",
            "comment_workload": "Not much workload for a 4 credit course. Few assignments throughout the semester but not hard to complete. Follow the instructions provided then can complete really quick.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}