{
    "error": false,
    "course": {
        "id": 1280,
        "subject": "LANG",
        "code": "2030H",
        "name": "Technical Communication I",
        "description": "The course provides students with a broad introduction to English within the discipline of engineering. A central aim of the course is to encourage students to analyze critically the wider social implications of engineering products and processes, through the careful examination of texts (and other media) beyond their own specific engineering field and to communicate effectively by delivering oral presentations and writing reports on topics relevant to all engineers.",
        "categories": [],
        "website": "http://cle.ust.hk/courses/lang2030",
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "CORE 1403 OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1404\" href=\"/review/CORE1404\" target=\"_blank\">CORE 1404</a> OR LANG 1003 (prior to 2022-23)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.11,
        "rating_teaching": 4.61,
        "rating_grading": 4.7,
        "rating_workload": 4.28,
        "review_count": 54,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 412,
                "name": "CHAN, Jessica",
                "count": 13
            },
            {
                "id": 877,
                "name": "LI, Eugene",
                "count": 10
            },
            {
                "id": 464,
                "name": "CARMICHAEL, Sarah",
                "count": 9
            },
            {
                "id": 427,
                "name": "SADHWANI, Dinesh Arjan",
                "count": 5
            },
            {
                "id": 335,
                "name": "WONG, Chun Ho",
                "count": 4
            },
            {
                "id": 409,
                "name": "KASTEN, Keven Sterling",
                "count": 2
            },
            {
                "id": 462,
                "name": "LEE, Joyce Yuen Yee",
                "count": 2
            },
            {
                "id": 302,
                "name": "HO, Susanna Pui San",
                "count": 1
            },
            {
                "id": 468,
                "name": "NORTHERN, Andrew Christopher",
                "count": 1
            },
            {
                "id": 1050,
                "name": "SAKURAI, Kazuhiro",
                "count": 1
            },
            {
                "id": 1125,
                "name": "MA, Wai Leung Bruce",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "3popmQsxElmc1WHWGlmm7rXFzaTagPFF",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "beansprout",
            "date": "Jan 20, 2020",
            "title": "Take this course over the non-H one if you're fluent in English",
            "comment_content": "The content is okay and there a few language tips you can pick up but nothing revolutionary. The course is split into two parts, the first is about engineering code of ethics and the second about presenting an innovation. The rest of the course is mostly about how to structure, write and present the assignments you're given. Don't get too bogged down by the specifics they teach and focus on expression, most of the grading is on language.<br /><br />In each part, you'll be put in small groups and have a topic which you'll base your individual report and group presentation on. In the first part you'll basically analyze and evaluate the conduct of engineers in 1 of 6 disaster cases using given code of ethics. I personally found these codes to be quite restrictive as they made the arguments samey and extremely one-dimensional. We were only given one slide each in the presentation and weren't encouraged to use cue cards. In the second part your group will have to come up with an innovation and essentially present what makes it good (feasibility, workings, benefits etc.). This part was quite fun for me, but you need a good innovation.",
            "comment_teaching": "The instructor was very friendly and encouraged students to participate in class throughout the entire course, even when instruction went online due to protests. Students who answered questions got to pick their topic first so look out for that. She also actively answered any questions regarding the course so take advantage of that as well. Overall, it was one of the better classroom environments in UST.",
            "comment_grading": "Good grades for 2030H. Definitely take this over non-H if you are fluent in English, it'll probably be a better grade. The small class is basically almost all internationals, only people who got English deducted on entry get to take this class I think.<br /><br />Even though I forgot lines and got lower grades than my groupmates in the first presentation. I still managed A+ through later assignments. The presentation is 1/3 group content grade and 2/3 language, so focus on that more.<br /><br />Attendance and &quot;completion of out-of-class activities&quot; counts 5% but you can miss up to 3 classes (although sick leaves won't be accepted).",
            "comment_workload": "The workload is not that heavy with 2 essays (1000 and 1400 words) and 2 presentations (5 mins per person). The increased word count compared to the non-H course may take a little more time, but you skip vocab quizzes and get more room to write so it's good. <br /><br />However, the assignments aren't that well-spaced, with the essays and presentations often a week or less apart near midterm and finals. Since the essay is directly related with the presentation, I would recommend finishing the essay early for more time; although your groupmates might not be as organized.<br /><br />There are out of class videos to watch and 4 after-class “comments” you need to post on canvas but how serious you take it is entirely up to you.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OvJKg3rYs4JxEQS26B3FbuFuiiGZF136",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 877,
                    "name": "LI, Eugene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mark_",
            "date": "Jun 08, 2022",
            "title": "Don't take this in an online semester",
            "comment_content": "You can only enroll in this course if you got A+ in LANG1003, or if you credit transferred the English language requirement.<br />(Edit for 2022 and later students: Under the new CC system, I assume you will either need CORE1404 or A+ in CORE1403, where CORE1404 is only for those who credit transferred English.)<br /><br />The content is honestly quite mundane. There are two units.<br /><br />The first unit is about engineering safety and responsibility, where you will learn:<br />- The HKIE and WFEO code of ethics<br />- How to write a technical report on an engineering disaster (this is the assessed piece)<br />- How to present an engineering disaster<br />Each group of 3-4 is assigned one of 6 case studies.<br /><br />The second is engineers and responsibility:<br />- What is a technical innovation<br />- How to write a proposal report<br />- How to present a product proposal<br />Each group of 3-4 comes up with their own innovation.",
            "comment_teaching": "Probably the thing I enjoyed least about this course :|<br /><br />I don't know if it's because it's an online semester and everyone is just tired of talking through Zoom, but the classes this semester were... awkward.<br /><br />Classes were not that interactive as nobody really talked much. Instructions for the in-class activities were almost never clear and we would just get sent into breakout rooms not knowing what to do.<br /><br />There were also a lot of organisational issues this semester.<br /><br />Overall, I learnt more from just skimming the coursebook. Not really happy with the teaching.<br /><br />Nothing against Eugene; I think he's nice and is a good person and tried his best. But, the teaching and organisation this semester was not great. It's probably better in a F2F semester.<br /><br />One good thing is that Eugene lets you choose your groups for one of the units.<br /><br />PS. For the first 3 (still online) lessons, we had Jessica Chan, who was incredible and somehow made classes really interesting even with a quiet class. She had to dip due to timetabling issues.",
            "comment_grading": "Epic grading.<br /> <br />Breakdown:<br />- Practice tasks (5%)<br />Unit 1 (engineering disaster): <br />- 1000-1500 word technical report (25%) <br />- 14-16 minute long presentation (20%).<br />Unit 2 (engineering innovation):<br />- 1400-1600 word proposal report (25%)<br />- 14-16 minute long presentation (20%)<br />- Peer evaluation via iPeer (5%)<br /><br />The practice tasks are easy and are just 4 canvas discussions.<br /><br />I got my unit 1 grades, but Eugene usually doesn't release them.<br /><br />Report grading scheme: <br />Task Achievement/Organisation/Vocab/Grammar (all /7)<br />My score: 7/6/7/7<br /><br />Presentation grading scheme:<br />Task Achievement (Group)/Vocab &amp; Grammar/Delivery Skills<br />My score: 5/6/6<br /><br />But note that my friend got points taken off in the delivery criteria for a nonsensical reason like his camera not showing his face properly...<br /><br />I didn't get my unit 2 grades. I thought my report and presentation were good but not amazing.<br /><br />Somehow, I got A+ despite my poor unit 1 presentation and likely &quot;ma ma dei&quot; (mediocore) unit 2 stuff. I was honestly expecting an A-. ¯\\_(ツ)_/¯ <br /><br />I did talk a lot in class, so maybe Eugene values participation more than anything else. I think I was one of the people who talked the most in class.",
            "comment_workload": "It all depends if your groupmates are proactive. In an online semester, it's far more likely your groupmates will ghost you. Take this in a F2F semester if you want groupmates that respond to you.<br /><br />For every piece of work, whether you can get it done quickly depends on your group's cohesion. That is, whether your group will go through and summarise sources for the engineering disaster in a timely manner, whether they will work with you to finalise your engineering innovation, and whether they will show up to the presentation rehearsals. If they do, then the course will be a breeze.<br /><br />If not though, then... good luck!<br /><br />The only exception to this is the technical report on the engineering disaster. If you work fast and can digest information quickly, then you can get a pretty good score on it even without the help of your group.<br /><br />PS. If you know LaTeX, I recommend using it to write your reports. It's much easier to manage your citations and your document will look clean and professional.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 6,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5eX3wvwAIlGCZUzekasUDUrZo5fGKvue",
            "semester": "2017-18 Spring",
            "instructors": [],
            "is_author": false,
            "author": "LOLOL",
            "date": "Jun 04, 2018",
            "title": "Good Grade Lang Course",
            "comment_content": "I will say the content isn't particularly interesting, but somewhat useful. The first part of the writing focuses on analytical writing and the second part focuses on proposal writing. You have to do a group presentation for both of them as well.",
            "comment_teaching": "Derek Wong (can't find him on the instructors list) is a very nice teacher. His lectures aren't boring and he offers many help after lecture too so it is very good. Gives you his FB as well so you can find him after lecture.",
            "comment_grading": "I believe the grading is very nice considering it is a lang course.<br />The grading scheme is as the the following:<br />5% Participation<br />25% Analytical Report (out of 7777)<br />20% Analytical Presentation (out of 777)<br />30% Proposal Report (out of 7777)<br />20% Proposal Presentation (out of 777)<br />Personally, I got 7767, 577, 6767, 777 respectively and received and A+ in the end which I believe is very good indeed.<br />I believe the majority of the H class falls inside the A range as well so the grading is pretty nice.",
            "comment_workload": "The workload generally isn't very big, you only have to submit two essays (around 1500 words for each) and prepare two fifteen minute presentation throughout the semester. The first presentation and essay, however, is around midterm period so control your time well and you will be good.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "b4c9eVTEypmIEOQMUnwnBRxdBekwV5Lg",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jjm",
            "date": "Jun 10, 2020",
            "title": "Do the H-stream if you're fluent!",
            "comment_content": "This course, although offered at Honors level, did not teach me anything new; neither in terms of grammar/vocab, structure or report writing, as all of this was covered in high school (IBDP). The only interesting content we learn is some background on engineering ethics and going into depth about a real-life case.<br /><br />There are two parts: part one covers engineering ethics, in which we learn about ethical codes of conduct, and part two covers engineering creativity, which aims to familiarise students with the design process of a self-created innovation. In part one, students are assigned a group and an ethical case study (e.g. Boeing 737MAX, Flint water crisis, etc.) which needs to be analysed, summarised in a report and presented to the class. Part two is similar in that we are put in groups and have to present. But here, we have to come up with a brand-new innovation and justify its viability and technical details.<br /><br />In this course, we are also expected to acquire mastery of grammar, appropriate vocabulary and writing style, as well as structured report-writing.",
            "comment_teaching": "Jessica is a very engaging instructor who really puts her soul into teaching this class. She always gave us timely and relevant feedback on our reports and homework assignment and was always open to answer questions and offer advice. However, in class, you are expected to be alert at all times as she will randomly call on students to participate. Also, because this semester was taught online, we were put into Zoom breakout groups at least two or three times each class, in which we were expected to complete tasks (i.e. online word doc) in a very short time. I would often feel quite exhausted after class.",
            "comment_grading": "For each part one and part two of the course, students are expected to write a report and give a group presentation/seminar. The grading is generally quite good. As a fluent English speaker/writer and you should be fine as long as you are familiar with the grading rubric for each assessment.<br /><br />Part 1: Ethics group presentation (group and individual) - 20%<br />Part 1: Ethics analytical report 1,000-1,500 words (individual) - 25%<br />Part 2: Innovation presentation (group and individual) - 20%<br />Part 2: Innovation Proposal report 1,400-1,600 words (individual) - 25%<br />Group work contribution - 5%<br />Participation (homework, attendance, class preparation, etc.) - 5%",
            "comment_workload": "There will always be a steady flow of work to do, but nothing too crazy. Every few weeks you will be assigned minor homework (e.g. one paragraph practice), but most out-of-class work will concern the projects and reports. You will need to allocate some time to write the essays (the earlier the better) and work with your groups on the group projects (progress needs to be recorded on canvas).",
            "rating_content": 2,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Pd8OAjphC94DJLQ49uBpfkTzpSwuClk7",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 462,
                    "name": "LEE, Joyce Yuen Yee",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Pang.",
            "date": "Jan 07, 2017",
            "title": "",
            "comment_content": "If you are registered in this class you most likely have the language skills to participate in class activities.<br />You will need to do a lot of talking in class. For people who like to socialize with others, this should be an enjoyable course. On the other hand, if you're like me and dislike talking about things that you are not interested in, then this course would be a nightmare.",
            "comment_teaching": "A somewhat nice instructor, though she has the tendency to keep asking the same people over and over again to answer her questions during class.",
            "comment_grading": "Most people get A.<br />My English is not that good so I got B+ which is probably the lowest you can get in this course.<br /><br />On the bright side you take 1 English LANG course only instead of 3, so it's a pretty nice deal.",
            "comment_workload": "Same as LANG2030 with the following exceptions:<br />- No vocab tests<br />- The word count range is doubled.<br /><br />Officially you can skip at most 6 lessons.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "w2Kddx3sxkyYzXZZLynKqqEKM9LVXIm4",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 464,
                    "name": "CARMICHAEL, Sarah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "legendarychriz",
            "date": "Dec 23, 2016",
            "title": "Good Grade BUT A RANGE IS NOT GUARANTEED! NOT GUARANTEED! NOT GUARANTEED! NOT GUARANTEED!NOT GUARANTEED! NOT GUARANTEED! NOT GUARANTEED!NOT GUARANTEED! NOT GUARANTEED! NOT GUARANTEED!NOT GUARANTEED! NOT GUARANTEED! NOT GUARANTEED!NOT GUARANTEED! NOT GUARANTEED! NOT GUARANTEED!NOT GUARANTEED! NOT GUARANTEED! NOT GUARANTEED!NOT GUARANTEED! NOT GUARANTEED! NOT GUARANTEED!NOT GUARANTEED! NOT GUARANTEED! NOT GUARANTEED!NOT GUARANTEED! NOT GUARANTEED! NOT GUARANTEED!NOT GUARANTEED! NOT GUARANTEED! NOT GUARANTEED!",
            "comment_content": "It teaches you how to write a technical report, and teaches you how to describe with a more formal tone, and applies in the world of engineers.",
            "comment_teaching": "Teaching is excellent. The instructor gives an extremely good atmosphere in learning, there are in-depth discussions, and ideas are generated. <br />Everyone enters and leaves the classroom with a smile.",
            "comment_grading": "People say A range is guaranteed.<br />I say NO.<br /><br />I got a fucking B+ at last.<br />A FUCKING B+<br />A FUCKING B+<br />A FUCKING B+<br />A FUCKING B+<br />A FUCKING B+<br /><br />Because I fucked up my essay with one 4, while having some 5 and 6.<br /><br />Well from other perspective, the lowest grade is B+, still an excellent grading course.<br /><br />Now I watching other 17 students getting A ranges and me crying with a B+.<br /><br />I suggest you guys take 1002A and 1003A if your IELTS get a bare 7.5 and DSE English with 5 or below, you may get 2 A ranges in there, if you want As, this is not the place.",
            "comment_workload": "Very Very low.<br />Do projects and presentations only.<br />People who enrolled into this class have a better mindset and a better expression of English language, making the project so smooth.<br />While the essay requirement is higher than 2030, there is no vocabulary test in 2030H, making it less workload.<br />I have a very good time with my project groupmates, I think this course is the best one in my university life.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CGeFk6heGzqoWdn3dqQGe6jatMi1NgPv",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 877,
                    "name": "LI, Eugene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DrainGang",
            "date": "Jun 05, 2021",
            "title": "You are here for grades, nothing else.",
            "comment_content": "Honestly after the semester I can't tell you a thing I've learnt.<br /><br />The course is split into 2 parts, the first part is engineering ethics, so you would learn about the importance of not letting people die as an engineer and important lessons such as &quot;bribes are bad&quot;. The second part is engineering innovations, so you would look at a bunch of technologies that will never make it to the market. <br /><br />This course despite being a LANG course, doesn't touch on English at all, all the writing skills you get from this course is stuff like &quot;remember to use subheadings and topic sentences.&quot; <br /><br />Feedback on your assignments are also quite unhelpful, all of my feedback were under 30 words, and doesn't point out my errors and mistakes in a substantial way that would help me on my future writings.",
            "comment_teaching": "Not sure why people hype up this part of the course so much considering the course material.<br /><br />Lectures consists of looking at examples given on the textbook, and then discussing them with your classmates, but there's really nothing to discuss since it doesn't help with our language skills in any meaningful way. You have to attend though, since skipping 6 or more classes means you would fail the course, so join and then autopilot your way through it.<br /><br />Perhaps this is down to the particular instructor, but ours just repeated whatever was on the textbook so it's really boring, he also missed an entire lecture by joining the wrong zoom call.",
            "comment_grading": "25% Analytical Report: A report based on an engineering disaster, doing your own research and coming to your own conclusions. You are given NO guidelines on how to write it other than a VERY basic framework. <br /><br />25% Proposal Report: A report based on an engineering innovation that you and your group came up with. Again, no guidelines other than a basic one, and you are given no feedback from the first report to help with the second one, protip: use cliche buzzwords like Internet of Things, Blockchain, etc!<br /><br />20% Presentation 1: Report on the engineering disaster that you and your groupmates have written, your groupmates will not be too bad at English, but you also can't change what they have written, so if they write pretty poor quality stuff, your marks here will be affected negatively, but if you have good groupmates, this would be very simple as you can collaborate with them for a simple, 5 minute long presentation. There's also a seminar where people are VERY unlikely to ask you more than 1 question.<br /><br />25% presentation 2: Report on your engineering proposal, same as the first one, but instead of a seminar you get a Q&amp;A where you are likely to get NO questions. For both of the presentations your intonation and fluency are both important as well, so keep them in mind.<br /><br />5% Groupwork: literally 3 CANVAS discussions.<br /><br />5% Practice tasks: literally 4 CANVAS discussions, I don't even know they existed until I was writing this review.<br /><br />Despite my grievances with this course, the grading is indeed excellent, for the very little amount of work that I did (90% of which is just trying to figure out what they wanted me to write), I got an A. Great little boost to your GPA in an otherwise sea of poor grades and C ranges.",
            "comment_workload": "Good workload.<br /><br />2 essays and 2 presentations through the semester, all can be finished in 2-3 days, all of them are group work as well, but since this is an H course, your groupmates should be competent at English, and not slack too hard, but don't expect them to carry your weight, they can still write very mediocre/copy and pasted stuff that would not help you at all.<br /><br />The presentations are based on what your group wrote, and your part would last at most 5 minutes, so it is also not very difficult.<br /><br />Sometimes the instructor would have you do something for the next class, but note:<br />1. it's not included in the credit <br />2. you have a LOT of time to finish it during the class.<br /><br />so it's whatever.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hak5V7TG8TRvtWFP0Y4fxRN2Oz2EB0l2",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "16y39y",
            "date": "Dec 25, 2020",
            "title": "love jessica so much",
            "comment_content": "The course is divided into 2 main parts: engineering ethics and innovation. I wouldn't say the content is useless, but don't expect to learn mind-blowing stuff and be inspired. Nonetheless, I learned how to organize and structure my writing to make it more cohesive and coherent.<br /><br />In the first part, we discussed and wrote about famous engineering accidents in history, all of which were caused by engineers who made debatably immoral actions. Personally, I enjoyed this part more as the issues were usually in &quot;grey areas&quot; so there were no absolute correct answers, and it was fun to analyze their ethical dilemmas.<br /><br />The second part was about creating an engineering innovation. We were taught how to write an engaging introduction and a good literature review to establish a &quot;niche&quot; for our new innovation. I also learned how to write about complex engineering mechanisms, which I enjoyed. But if you're like me and you don't really have a brain or liking for innovation, you might not enjoy this part as much.",
            "comment_teaching": "I love Jessica so much. She somehow manages to be engaging but chill at the same time, so it's always fun and never stressful to go to her class. In fact, this class is my favourite class to go to each week.<br /><br />She often sends us into breakout rooms to discuss some tasks, and creates useful Office documents for us to collaborate on. Coupled with the fact that my classmates in the H stream speak fluent English and are all willing to talk, I had the most fun in breakout rooms compared to any other class (there was rarely awkward dead air!)<br /><br />In terms of participation, we never had to worry about gaining the points since she would call on us to answer her questions. From what I remember, she's pretty fair with this and everyone gets called 1-2 times at least in each lesson.<br /><br />She's also very helpful and patiently answers all our questions about the essays and presentations. I also appreciated her detailed feedback (constructive criticism) so you know what you're missing and what to improve on next time.<br /><br />Long story short: love Jessica, I have no complaints at all.",
            "comment_grading": "Excellent grading that saved my dying cga. I'm pretty sure everyone at least gets a B+ in the H stream, and if you put in normal effort, you will most probably get A range.<br /><br />Ethics Report: 7/6/7/7<br />Ethics Presentation 6/6.5/7<br />Innovation Report: 7/7/7/7<br />Innovation Presentation: 6.5/7/7<br />Final Grade: A+<br /><br />Not sure how the grade curving works, but from my experience having strong peers in the class doesn't ruin the curve or your grade. Everyone just ends up with generally good grades which is wonderful.",
            "comment_workload": "Not light but not that heavy either. 2 long reports (around 1000-1500 words) + 2 presentation videos (5 mins) + some short Canvas writing tasks throughout the sem. I'm not particularly good at writing and coming up with content so it took me 3-4 days to write each long report, but it's totally possible to finish the writing in less than a day. Totally acceptable though, considering it's a LANG course and there are no exams and vocab tests (in the H stream).",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "s5eNmequMvVGHTNc9D1LnG2Xmm4XG7OW",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 335,
                    "name": "WONG, Chun Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ogt",
            "date": "Jun 10, 2020",
            "title": "OK content - Amazing grades!",
            "comment_content": "The content in this course is OK, but overall nothing too exciting. It will introduce you to all to properly write a report and proposal by making you do activities on different topics (introduction, how to be analytical, what to cover in a feasibility review/literature review, conclusion...). Everything is engineering related.<br /><br />The course does not cover any grammar/vocab stuff.",
            "comment_teaching": "This semester was ONLINE due to covid19. Derek was a really good teacher, who created a positive learning atmosphere. He often started the class by talking about his life which allowed us to know him better.<br />He taught the material he decided was important. Unlike other teachers in lang 2030H, he acknowledged that some of the normal content from 2030 is unnecessary for students with an advanced level of English and hence skipped those parts.<br /><br />During the project periods, he organized sessions where he would just let us work on our essays, provide feedback, and answer questions.<br /><br />Overall, he was very friendly and helpful. I believe he was well-liked but all students in our class.<br />The only downside was the time he took to grade and provide feedback on our work (~3 weeks).",
            "comment_grading": "PART 1:<br />Presentation on&nbsp;&nbsp;an&nbsp;&nbsp;engineering&nbsp;&nbsp;ethics issue (group and individual) = 20%<br />Analytical report on an engineering ethics issue (individual) = 25%<br />Everything is out of 7. For the presentation, I got 6/7/7 and report 6/6/7/7.<br /><br />PART 2:<br />Presentation of a proposal for an engineering innovation (group and individual) = 20%<br />Proposal report for an engineering innovation (individual) = 25%<br /><br />Group work = 5%<br />Participation &amp; attendance = 5%<br /><br />This translated into an A+. The grading for this course is very good. Take this course if you need a CGA boost.",
            "comment_workload": "The workload is very concentrated around the two project periods where you have only a few days to write your report/proposal and prepare the presentation. Other than that, no workload!<br /><br />My advice:<br />- Start early (~5-7 days before the deadline)<br />- Read it out loud before submitting<br />- Run it through a grammar checker (Grammarly) to eliminate silly mistakes<br />- Follow the guidelines because they care a lot about that<br />- For the proposal, start thinking about ideas early on &amp; make sure it is feasible",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aZF2lkObKZyJ5VAr5exBA1Va2do61juq",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 468,
                    "name": "NORTHERN, Andrew Christopher",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hautonjt",
            "date": "Jan 21, 2016",
            "title": "Be glad you are able to take this course.",
            "comment_content": "The content is not too boring I suppose. Every class we cover a few chapters of the technical communications book. There's some interesting ethical issues and whatnot that were discussed, as well as an opportunity to come up with your very own technological innovation, which is kinda cool.",
            "comment_teaching": "Teaching is pretty great, every class you get something interesting to do. There's quite a bit of interaction between peers. There are also a few group activities and such. Andrew is quite good at making the class entertaining and not too boring.",
            "comment_grading": "The grade you'll get is probably A-range. If you're taking this course, your English ability is probably of a high calibre. It's a great chance to boost your GPA.",
            "comment_workload": "Two essays and two group projects are assigned. LANG2030H students are exempt from vocabulary quizzes, so no need to prepare for those. Good groups are easy to find, since there's no risk some random person not knowing any English and needing some &quot;carrying&quot;.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "W7sauFigA6PiQ7D0mNU85KIN5Z5Ci3lQ",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 427,
                    "name": "SADHWANI, Dinesh Arjan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Manu",
            "date": "Jun 29, 2023",
            "title": "LANG 2030H",
            "comment_content": "Engineering Ethics <br />Innovation Project",
            "comment_teaching": "Dinesh is an interactive teacher and looks to always engage each student in the class. He is very specific and clear with what he expects in each of the assignments and is always available if you have any doubts regarding the assignments.",
            "comment_grading": "As long as you are willing to pull in the effort, you are pretty much guaranteed a good grade in this course. Dinesh thoroughly explained the marking criteria to us and what he was looking for in the presentations and reports. You will achieve a good grade if you look to fulfill all the criteria.&nbsp;&nbsp;This course is definitely a GPA Booster and engineering students should take this course.",
            "comment_workload": "Not too heavy of a workload. The course grade comprises two group presentations and two written reports, one on engineering ethics and the other on the innovation you develop as a group.&nbsp;&nbsp;<br /><br />Group Presentation: <br />- Ethics <br />- Innovation <br /><br />Written Report:&nbsp;&nbsp;2 [ 1000 Words each]",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XAitd2N2uVkRNvJYGYBtCYAgGyKhOLUd",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 877,
                    "name": "LI, Eugene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tree123",
            "date": "Jun 06, 2023",
            "title": "",
            "comment_content": "Part 1: Engineers and Social Responsibility<br />Part 2: Engineers and Creativity",
            "comment_teaching": "Eugene is a dedicated professor committed to creating an engaging discussion environment and provides students with plenty of opportunities in and out of the classroom. In terms of teaching, the course is discussion-driven so some students may struggle as the content being taught is minimal. Feedback prior to submissions is lacking, but students are able to ask Eugene questions to scope the general expectation.<br /><br />You will learn more from your peers than your teacher, so hope for a class containing extroverts or DDP/minor in business students (they usually have more experience with presentations).",
            "comment_grading": "20% Group presentation and seminar discussion<br />25% Individual analytical report<br />20% Group presentation on engineering innovation<br />25% Individual engineering innovation proposal report<br />5% iPeer<br />5% Practice tasks<br /><br />I received 25/25 for the analytical report, and A+ range overall. The other assignments weren't handed back.<br /><br />Most students in this class have a strong English background, so the &quot;easy A range&quot; belief is slightly misleading as students who aren't as fluent will struggle during discussions and group presentations.",
            "comment_workload": "Written assignments were doable, although it was somewhat challenging as ethics can be controversial depending on the stance. The group presentations were a nightmare as freeloaders are inevitable, but I'm thankful that the imbalanced workload didn't affect the group presentation grade too much.<br /><br />My suggestions for future LANG2030H students are to be proactive, read discussion topics and relevant ethical issues, and have an open mind. For the analytical report, remember to write about ethical implications with reference to the code of conduct. For engineering innovation, the innovation doesn't have to be complicated for a good grade. Also, don't freeload.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tkXUaBtl6GLHTz9YDQ9qnx9W56lUNJrl",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 427,
                    "name": "SADHWANI, Dinesh Arjan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ernestlweeeee",
            "date": "Dec 15, 2022",
            "title": "Boring course but its compulsory",
            "comment_content": "First-half is about ethics and responsibility as an engineer, second-half is about innovation (i.e. you come up with an idea yourself).<br /><br />Very easy topics, but also very boring, and since attendance isn't compulsory, you can skip a reasonable amount of classes.",
            "comment_teaching": "Personally abhore Prof. Dinesh's teaching.<br /><br />Wastes a lot of time seeking student's responses, but our class is very much introverted and no-one speaks up. As such, content is covered very slowly since theres so much awkward silence, which makes you question why you even came to class.<br /><br />If you have friends, attend the same session, makes class more fun.<br /><br />He doesn't really define assignment parameters, but they are easy enough to handle them individually, and if you have enquiries just email him.<br /><br />Recommend transferring to Prof. Jessica's session, don't make the same mistake as I did.",
            "comment_grading": "Very subjective grading and nit-picky, but gives fair reasons for grade deduction.<br /><br />e.g. &quot;stares at screen too frequently while presenting&quot; is a valid reason.",
            "comment_workload": "2 reports and 2 group presentations<br /><br />Group presentations are easy (free-riders doesn't have that much of an impact for these presentations), its the reports that are annoying to complete.<br /><br />A word limit of 1000 and 1200 for each each reports for their respective topics with a 10% buffer, and with the amount of content to be covered in each report, you'll most likely sacrifice either content quality or breaching the word limit, so either way you'll get marks deducted.<br /><br />Beware of content allocation to each sub-sections of the report, since not all sub-sections share the same weighting/emphasis.",
            "rating_content": 5,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "O3h39PMqGFF1KJOjwk8EdaxOCiBmYcaI",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 427,
                    "name": "SADHWANI, Dinesh Arjan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wkwkwkkwkw",
            "date": "Dec 11, 2022",
            "title": "Nice course",
            "comment_content": "Part 1: Engineers and Social Responsibility<br />Part 2: Engineers and Creativity<br /><br />Part 1 basically teaches you about ethics involving engineering.<br /><br />Part 2 teaches you how to create and present technological innovations.",
            "comment_teaching": "me no like",
            "comment_grading": "The grading for this course is very good (based on past reviews. Will update once I get my letter grade).<br /><br />Grading scheme:<br />25% Analytical Report<br />20% Group Presentation<br />25% Proposal Report<br />20% Innovation Presentation<br />5% Practice Tasks<br />5% iPeer<br /><br />Analytical Report:<br />Write a report about an engineering disaster that was assigned to your group. You have to write about what happened, what caused it, and the ethical implications involved in the incident. Make sure to focus more on the ethical implications.<br /><br />Group Presentation:<br />Present an analysis of the engineering disaster to the rest of the class. Make sure to make eye contact with the audience and use hand gestures. Do not read off a script.<br /><br />Proposal Report:<br />Come up with a technological innovation with your group and write an individual proposal report.<br /><br />Innovation presentation:<br />Present your innovation to the rest of the class.",
            "comment_workload": "Little to no workload.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uDw6wCY88XbCiiuK8Ren0Amol6jWEcvs",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 427,
                    "name": "SADHWANI, Dinesh Arjan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ltxtftrsn",
            "date": "Aug 21, 2022",
            "title": "",
            "comment_content": "Easily understandable and interactive course content, with adequate support on technical communication through writing and speaking in English.<br />The course is split into two parts, where in groups students work on two reports and presentations, one was an accident analysis and the other was a product proposal.",
            "comment_teaching": "The instructor was able to help engage discussions in class, and give generally helpful insight on skills and weak points of students, which can sufficiently help on their improvement.",
            "comment_grading": "Good grade course, lucky to have good groupmates with no free-riders.",
            "comment_workload": "Little to no burden in terms of workload, only a few minor assignments, and generally just two reports and presentations at the end of the two parts.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "R97PUG3xyMd185hcqqw4HX98rj7HzeEw",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yayayayyaya",
            "date": "Jul 14, 2022",
            "title": "",
            "comment_content": "The course introduces you to academic writing, the HKIE, presentation skills and writing academic reports.<br /><br />The first report and presentation is about a case study where you have to decipher what the engineers did wrong referring to the HKIE. <br /><br />The second report and presentation is on an innovation that is missing something and you suppose to fill in that niche. Overall it was quite fun and interesting.<br /><br />This is a very useful course and I thoroughly enjoyed the content of this course.",
            "comment_teaching": "Jessica is a brilliant teacher. She is very organized and gives constructive feedback. She is also approachable and it is easy to ask her for help when you struggling.",
            "comment_grading": "This is a Honour course so the grading can't really be bad. It is pretty impossible to see how well you doing as the rubric only contains the feedback and doesn't let you know the mean. <br /><br />As long as you participate in class, do the activities for attendance and dun leave the report till the last minute, then I think you'll be fine.",
            "comment_workload": "There are 2 reports and with each report comes a short presentation about the report. No exams or quizzes, but there are some activities you must do for attendance (like 2 paragraphs). But overall the workload is low.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3mq8Yx4DTzKq90XrKZaVTFsnNDyolSf9",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 877,
                    "name": "LI, Eugene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gonpachirou",
            "date": "Jun 27, 2022",
            "title": "Great for people who are confident in their English.",
            "comment_content": "[COURSE OVERVIEW]<br /><br /><br />\t1. Engineers and identity<br />\t\ta. No assessments<br />\t2. Engineers and social responsibility<br />\t\ta. Analytical report on engineering ethics issue (individual) / 25%<br />\t\t\ti. Look at a case that happened in the past and some of the ethical issues of that particular case, using your understanding of a set of engineering ethical standards<br />\t\tb. Group presentation and seminar discussion / 20%<br />\t\t\ti. Present the same case in (a) as a group.<br />\t3. Engineers and creativity<br />\t\ta. Proposal report (individual) / 25%<br />\t\t\ti. Propose an innovation of some sort<br />\t\tb. Group presentation / 20%<br />\t\t\ti. Sharing your engineering innovation<br />\t4. Peer evaluation of contribution to TechVention group work by iPeer / 5%<br />Practice tasks: Satisfactory completion of Practice task 1, Practice task 2, Practice task 3, Practice task 4 and attendance of the Library Workshop / 5%",
            "comment_teaching": "Teaching is very accommodating with lots of questions asked, lots of opportunities for debate and discussions. Students in this semester's course were very proactive and were not afraid to be vocal about their thoughts and opinions on course articles or other students' presentations.<br /><br />The first presentation is a seminar, which means that the last third of the presentation is used for Q&amp;A. Students ask and ask again (follow-up questions) and are graded on their ability not only to present but to answer these questions on-the-spot.<br /><br />The second presentation is less seminar-like and more like a Shark Tank pitch. Still very nervewracking. Pay close attention to your eye contact and pitch. Do not look as if you're reading off of a script.",
            "comment_grading": "Extremely generous!<br /><br />Don't know if this is restricted to Eugene, but most of the class got A-range.<br /><br />Our class was pretty competitive, though, which might have played a role in the skewed grade distribution!<br /><br />Attendance is taken but SPOILER: it doesn't matter!<br /><br />MY GRADES<br />Ethics (First half) 6677, 677 (26/28, 23/24)<br />Innovation (Second half) 7777, 567 (28/28, 21/24)<br />Overall = A+",
            "comment_workload": "Very, very, very low.<br />Besides the two reports and two presentations, there's almost no after-class work to do.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BMBF2QeqZeRlv0VFHZZztldNtliSZY4M",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 877,
                    "name": "LI, Eugene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Qmin",
            "date": "Jan 27, 2022",
            "title": "It's good",
            "comment_content": "Two big projects:<br />1) Engineering disaster<br />2) Engineering innovation<br /><br />For both you need to write:<br />1) Individual paper (~1600 words)<br />2) Group presentation<br /><br />For the first project (Engineering disaster) you have to choose among a number of different options. Choose wisely and choose fast. Don't get pushed into other unwanted topics because you choose late. <br />As everyone else says, almost everything is group-based. This means you should choose your groupmates wisely. If you like you're groupmate, you can bring your members for the next project as well.",
            "comment_teaching": "It's really enjoyable. He explains very clearly, the textbook and the ppt guide you very well, and the course is not difficult at all. He encourages you to give your ideas, so don't be afraid and just tell the class what you think.",
            "comment_grading": "There is attendance.<br />All that really matters in the end tho is your two big projects.<br />By the way your pronunciation matters for the presentation. If you accidentally make a pronunciation mistake during your presentation it will affect your grade.<br />You should focus on your research paper since it's the only part of the grade that is 100% on you. Ofc you should talk to your partners while writing your paper as well.",
            "comment_workload": "Not much. Just projects, making ppt and presentation, etc. There are a lot of group projects, so manage time well with your groupmates. This is the part where you need to dedicate your time. The only big workload is the individual research paper, which is kind of a burden, but it's really not too too hard. Overall, the workload is really fine.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iHrlDAyeoPJAfZkrzIP7FI3XwRi8uUa4",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 877,
                    "name": "LI, Eugene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "pud",
            "date": "Jan 24, 2022",
            "title": "Enjoy your time here",
            "comment_content": "Not much really, mainly surrounding Engineering ethics and different presentation skills.<br /><br />I think the idea of this course is not to teach you stuffs from the book. Its more about how you present your idea on different scenarios. I personally enjoyed it as I think I did learn some very useful daily presentation skills.<br /><br />Becareful who you pick as your groupmates! you do get alot of group projects and discussions!",
            "comment_teaching": "I would give an A+ if I can.<br /><br />quite literally I would feel bad if I dont write this to appreciate Eugene's teaching.<br /><br />Hands down the best teacher ive ever come across. Very chill, treats students like a friend more than a teacher-student relationship.<br /><br />He encourages you to speak and discuss with classmates which is a must as you really have to speak to learn from this course.",
            "comment_grading": "Very good. I got A-.<br />Attendance is counted into grading<br />no exams.<br /><br />everything is graded by assignments. Which are almost always group projects.<br /><br />no need to stress if your essay is bad or not. I dont think this is how they grade you. Make sure to follow the instructions given on Canvas and on the e-book and be sensible.",
            "comment_workload": "To me it's fine. Most group projects can be completed within 2 hours if you and your groupmates are able to do so. On the safe side, leave 1-2 days buffer to sort problems and rehearse your speech and split your work with your groupmates.<br /><br />your grades are pretty much all depending on group projects, presentation, and reports (Written individually). Everything is checked by Turnitin so don't think about copying. That's very much the point of having this course: Learn to create something but not copying. Also remember to write it in details to show you are actually giving in efforts.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lhEDj5DcBgvpx3bn3t5mKyEfDo8QfsgZ",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 877,
                    "name": "LI, Eugene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "just_a_student",
            "date": "Jan 12, 2022",
            "title": "",
            "comment_content": "Course content is centered around the 2 essays you will write throughout the semester. Your first essay will be about engineering ethics, so in the first half of the semester, you will learn about code of ethics, example cases, and some example for how to write each sub-heading for your essay. <br />In the second half of the semester, you will learn about project innovation, you will follow similar patterns as in the first semester; learning what is an innovation, some examples of innovation, and lastly examples on what to write for each sub-heading in your project proposal.<br />Course materials will all be provided on canvas including the textbook. Tbh content is not really about the English language itself",
            "comment_teaching": "Eugene is a pretty chill professor. He is pretty lenient and also teaches in a way to stimulates discussions. You will mostly learn by following this scheme:<br />Eugene presents a topic &gt; discuss it together (may / may not in breakout rooms) &gt; and then he will summarize from what the class talked about. He mostly doesn't mind if the discussion goes off-topic. <br />As I said in the content section, don't really hope for Eugene to teach the English language actively; however, if you have any questions you can email him directly or ask him in class",
            "comment_grading": "Grading is from 3 main sources:<br />- 2 Essays<br />- 2 Group Presentation (from the essay)<br />- Some Canvas Discussions<br />As long as you do all the work you will get a good grade. All of your work will be done individually but you will be in a group as you will most likely share information with each other.<br /><br />I didn't do some of the discussions and I don't personally think I wrote an amazing essay nor give out a great presentation; however I still got a A-.",
            "comment_workload": "The workload is fair. Both essays are required to be around 1500 words each, however you will get a lot of time to do it. Do the discussions weekly if you can. You can easily do it like 1 week before the deadline if that is what you preferred.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YzpTT1qfNqzxaj5Tau6GRvBoLpAzWfOj",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 877,
                    "name": "LI, Eugene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "arnav03",
            "date": "Jan 09, 2022",
            "title": "",
            "comment_content": "There are only 2 sections in this course:<br />1. Engineers' Responsibility and Ethics<br />2. Creative and Innovative Ideas in Engineering<br /><br />Quite basic stuff here. Generally not that difficult for someone who has a good command of English in writing and speaking.",
            "comment_teaching": "Eugene is generally a cool professor, doesn't really mind going off-topic most of the time to keep the class involved, and usually likes to involve the entire class in the discussions. Even though we were on zoom, it almost felt as if the interaction was in-person",
            "comment_grading": "The grading is split into 4 parts: <br /><br />Topic 1:<br />Essay and Group Presentation <br /><br />Topic 2:<br />Proposal and Group Presentation<br /><br />This course is almost a guaranteed grade booster as everyone I know has gotten an A or an A+ in this course by simply having a good command of English, some basic understanding of ethics, and creative concepts.",
            "comment_workload": "The workload is also generally quite lite, there are like 3 discussions that you need to post on canva and besides that, there are 4 graded assignments. As long as you follow the rubric, you shouldn't face a lot of trouble.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "T4pRNbVYyeUxSQ0unsBQxIWyi0Z5fb7w",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AnonStudent",
            "date": "Jan 05, 2022",
            "title": "",
            "comment_content": "There are two main sections of this course: <br />1. Engineers and Social Responsibility<br />2. Engineers in Creativity<br /><br />In both of these sections, we do a 15 minute group presentation and an individual essay amounting to 1,000-1,500 words.<br /><br />In the first section, each group is assigned a case study, and we analyse the ethical issues for our presentation and then individually write our own essays (formal). <br /><br />In the second section, each group must come up with an innovation to first pitch through a presentation (providing an analysis of existing technology, a technical description of the innovation and a discussion of the limits and benefits of this innovation), then write it into a formal essay. <br /><br />Pay attention to the rubrics and how you're marked.",
            "comment_teaching": "Jessica is a really good teacher. She involves the class really well, and speaks well too. She's friendly and approachable and classes were never really boring. <br />Class sizes were small too so every student was always involved.",
            "comment_grading": "Only got one excellent and a bunch of Very Goods, maybe one satisfactory but I still got an A, so grading seems good.",
            "comment_workload": "This entire course is coursework, no exams. There are two essays and two presentations which isn't really that bad. It should be alright for students who are fluent in English.<br />If I am being completely honest, most of the work I did was last minute, and it ended up being fine (not amazing but passable at the least).<br />Though it will likely happen, avoid leaving work to the deadline (just do bits as you go).",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jywsc3ZR9Z9EkQY8nYPD2sHmMf2GPEqG",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 877,
                    "name": "LI, Eugene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "copper_star",
            "date": "Dec 30, 2021",
            "title": "Year 1 taking LANG 2030H",
            "comment_content": "Part I: Engineers and Social Responsibility<br />In the first part of the course, you will learn the 'Code of Ethics' (HKIE and WFEO). Based on these 'Code of Ethics', you are going to form a group of two people and practice analyzing the video called &quot;Incident at Morales&quot; by making a short PowerPoint presentation. After the practice, you will form another group of four people. Your group will analyze one of 6 cases related to ethical dilemmas on the Canvas by writing an individual 1300-1500 words analytical essay and presenting 16 minutes group presentation.<br /><br />Part II: Engineers and Creativity<br />In the second part of the course, you will learn various criteria for evaluating inventions, how to write a good introduction, and learn how to establish a niche. Then, you will form a group of 4 people. Your group will gather the ideas and introduce your group's new invention to your classmates by writing an individual 1400-1600 words proposal essay and presenting 16 minutes group presentation.",
            "comment_teaching": "This course was delivered in real-time online mode via Zoom this semester. Eugene LI was good. He always wants to interact with students. Even though my name is quite difficult to pronounce, he ended up memorizing my name and calling me every lecture when other students didn't answer his question, haha. He was always calm when teaching. He used various features on Zoom such as annotation function and clap function.",
            "comment_grading": "GPA booster course<br />Part I Analytical Report (1300-1500 words): 20%<br />Part I Group Presentation (16 min): 25%<br />Part II Proposal Report (1400-1600 words): 20%<br />Part II Group Presentation (16 min): 25%<br /><br />Group Work: 5%<br />Practice Task (+Library workshop attendance): 5%<br /><br />During the presentation, your attitude such as pronunciation, intonation, fluency in speaking, and eye contact (regardless of in-class or Zoom) is much more important than emphasizing your content on your PowerPoint. Your content is already evaluated through your essay. Be fluent during your presentation.<br /><br />FYI, I am a Year 1 student who had done IBDP and got A- in total.",
            "comment_workload": "It may take some time to do research and write a 1500 word analytical essay for Part I and a 1600 word proposal essay for Part II.&nbsp;&nbsp;Make sure that you don't write the essay in one day. Practicing the presentation may take some time for some groups.<br /><br />During the course, you must participate in the Library workshop. You just need to attend the 1-hour-workshop one time. <br /><br />If you had done IB English A, you can easily follow what's going on in the lecture. No big skills are needed. Just basic skills for writing essays in English and presenting in front of people fluently in English are needed.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "25GzJU0l2zGqsWYzXbuGBfSe9yiMXXgn",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "astro7",
            "date": "Dec 26, 2021",
            "title": "Chill instructor, boring content, but above all, an amazing GPA booster.",
            "comment_content": "Honestly, the content isn't all too interesting. This course has me wondering at certain points where I could be applying the things I learnt in real life. The things you learn and cover in the course are mainly helpful towards you completing your main assignments.<br /><br />Weeks 1-7: Engineers and social responsibility - pretty much a guide into ethics and its implications. In a class of 18, we're split into groups of 3 and we all have case studies to analyze. We have to submit an individual report by week 6 and have a group presentation by week 7. <br /><br />This part is pretty boring, we just review case studies and find causes and ethical implications behind our assigned incident.<br /><br />Weeks 8-13: Engineers and creativity - this is where the course gets more interesting. We're put into a scenario where we have to come up with an innovation. Several aspects go into it and they're covered in the course - literature review, technical description and feasibility &amp; benefits. Similar to the ethical analysis in the first half of the course - split into groups of 3, individual report and group presentation.<br /><br />It's tough to come up with a decent innovation, but the rest shouldn't be all too complicated once you have the right resources that you can use in the report and presentation.",
            "comment_teaching": "The course is pretty boring but the instructor, Jessica, taught it in a rather engaging way. She's been teaching LANG2030H for a long time, and she was one of the only two instructors for this course in the semester. Jessica was really helpful with the assignments as well, you could email her anytime for clarification and she would reply pretty quickly. She also gives feedback for assignments within the same week (and from what I've heard, the other instructor doesn't do that). You can't go wrong with picking Jessica as your instructor for LANG2030H, she might be a little tough in terms of giving feedback but I guess that's expected from an honours course.",
            "comment_grading": "Since this is an honours course, you're guaranteed a good grade if you put in the effort. Most of my classmates who took this course have gotten anywhere from an A- to an A+, and the subgrade difference comes down to how well you present and how you write up your report. If you're in your first year, this course will give your CGA a much-needed boost, so check if you meet the prerequisites, and enrol in this course if you do.<br /><br />Because this is a LANG course, the CLE department makes attendance mandatory so you can't skip all of your classes. I'm not sure what the upper limit of absences is but I got away with missing 3 of my classes.<br /><br />One more thing to note when reading Jessica's feedback - she doesn't give numbers, so you'll have to convert her descriptors to numbers. Basically: &quot;Excellent&quot; = 7, &quot;Very good&quot; = 6, &quot;Good-Very good&quot; = 5.5 and so on<br /><br />My grades for this course were:<br />Analytical report:<br />Task achievement - 5.5/7<br />Organisation - 6/7<br />Vocabulary - 6.5/7<br />Grammar - 6.5/7<br /><br />Seminar presentation:<br />Task achievement - 5.5/7<br />Vocab and grammar - 6/7<br />Delivery - 5.5/7<br /><br />Innovation proposal report:<br />Task achievement - 6.5/7<br />Organisation&nbsp;&nbsp;- 7<br />Vocabulary - 7<br />Grammar - 6.5/7<br /><br />Innovation presentation:<br />Task achievement - 6/7<br />Vocab and grammar - 6.5/7<br />Delivery - 6.5/7 <br /><br />I ended up getting an A+ in this course with those grades.",
            "comment_workload": "This might be one of the crappier aspects of the course because the major assignments come at the WORST possible times. For both of the reports, they have to be 1500 words in length. If you can, do start the reports early and get it over with as soon as you can. Finding sources to cite can get time-consuming. I made the mistake of procrastinating and I started my reports around 2 days before the deadline, and those days were probably some of the most stressful ones in the semester, so don't make the same mistake as I did :(<br /><br />On top of the reports, you have to do around 4 assignments which are around 150 words each so it's not too much of an issue but if you're aiming for an A or A+, make sure you hand in an assignment of decent quality and not a half-assed one.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RllIEYd4taPuuuftKIrj7HPdxCCTAr2h",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "leon czolgosz",
            "date": "Dec 25, 2021",
            "title": "Great teaching. Choose H stream if you can.",
            "comment_content": "Part 1: Engineering ethics<br />How to make decisions as an engineer while considering all perspectives and balancing them. Write a 1300-1500 word essay on an engineering failure case (assigned by instructor) and analyze the ethical issues involved, then do a 14 minute group presentation.<br /><br />Part 2: Innovation<br />How to write a proposal that convinces people to support your invention. Write a 1400-1600 word proposal on an invention (that you have to think of yourself) and do a 14 minute group presentation.<br /><br />Content is ok. This course will not improve your English. The essays are a mixture of how to convey everything clearly and concisely and thinking until your head hurts in hopes of making stuff up to pad your essay out. You can write more compared to the normal stream which is better. The invention part was really hard because you can literally choose any area, but it has to be realistic.",
            "comment_teaching": "Jessica is awesome. She's one of the best instructors in UST. She gives really good advice and guidelines for the essays, so even though attendance is not required, the lessons are a must go. She tries to make the lessons interesting with group work. She grades our assignments in a few days and although she can't tell us our exact scores, she gives useful feedback.&nbsp;&nbsp;If you see the course that's taught by Jessica, take it. You will not regret it.",
            "comment_grading": "25% essay<br />25% proposal<br />20% presentation 1<br />20% presentation 2<br />5% Group work for presentation 1 &amp; 2<br />5% 4 assignments<br />Unlike the normal stream, there are no vocab quizzes.<br /><br />Pretty reasonable. Stick to the checklist given in the coursebook and the tips given by Jessica in the lessons and your essay will turn out ok. My first one was good but I trashed the second one. For presentations, just try to relax. Unfortunately, I have anxiety and suck at memorizing stuff. Apparently we have to look and sound natural instead of reciting. But I got good grades. <br /><br />If you're in H stream your score will be better than most others. I got A-.",
            "comment_workload": "The workload is manageable. The main problem you'll face are your group mates. It really depends. Groups were randomly assigned by the instructor. Unfortunately, there was a jerk in my first group and my second group had communication failure. But things turned out alright and hopefully I will never have to work with these people again. But there are some great people in this class that I enjoyed working with in class. Oh yeah, you have to talk a lot in this class. Sorry introverts. I managed ok though.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DCgsD9bXmfGxGx5FfR23E0vFSeQLNSs7",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HeumilWang",
            "date": "Dec 18, 2021",
            "title": "LANG2030H",
            "comment_content": "LANG2030H is mainly divided into two parts: ethical dilemmas from an engineer's point of view and coming up with one's own innovation. <br /><br />Students learn about how to be 'analytical' and write something subjective objectively. Different parts of an essay, and what content to include in each section. Not the most exciting content.",
            "comment_teaching": "Jessica is always well prepared and passionate about teaching. She encourages students to participate and doesn't create any pressure within the classroom. She tries to create a humorous atmosphere. <br />She is willing to do more work herself to make sure there is no confusion. <br />She reads all of the students' paragraphs and gives constructive feedback.",
            "comment_grading": "Her grading is somewhat strict but because it is an Honors class the final grade is not too bad. Participation is not part of the grade so you can get away skipping class as long as you write and good essays and present well.",
            "comment_workload": "few short paragraph submissions, 2 individual essays, 2 group presentations. Essays take quite some time to write as students have to be 'analytical'.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Y86kXlEj5TgnsSUjBKBDV9BmBRxf2wUp",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1125,
                    "name": "MA, Wai Leung Bruce",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "asdfghjkl123",
            "date": "Sep 04, 2021",
            "title": "Very good grade",
            "comment_content": "Do not except to learn something new. <br /><br />You have to form a group of 3-4 people and work with them throughout the whole course.<br /><br />The first part is related to engineering ethics, which is a bit boring. Each group has to work on a distinct case study, such as Fukushima Daiichi nuclear disaster. You have to point out different ethical problems involved. <br /><br />The second part is related to innovation. Each group has to come up with an innovative idea that can solve an existing idea. This part does not require very detailed technical description. It mainly focuses on the creativity and the way expressing the idea.",
            "comment_teaching": "The instructor is very nice and friendly. He is willing to listen to every student. When teaching, he doesn't follow the coursebook, instead he has his own sets of notes and sometimes he teaches something that is very useful but is not covered in the coursebook. He doesn't teach everything inside the coursebook especially those are useless. He also talks about every parts of the essay and presentation in details. He lets us know what are his grading criteria and writing/speaking skills that can lead to a higher grade.<br /><br />His teaching style is fun, not boring. He usually finishes his lecture within one hour. Then, he lets us to have group discussion discussing the assessments.",
            "comment_grading": "The only bad thing about Bruce is that he did not tell us our scores. I think I have done quite a good job in the 2 presentations and the first essay. I only spent 2 hours to do the second essay so I think I have done a bad job here. However, I got an A+ at the end. So this course is a really really GOOD grade course. <br /><br />Also, as I have a very good time with my groupmates, I don't think the workload is heavy and this course is probably the easiest and best course in my university life.<br /><br />If you have a chance to choose between 2030 and 2030H, please choose 2030H. It is really good.",
            "comment_workload": "There are an individual essay and a group presentation in each part of the course, i.e. 2 essays and 2 group presentations in total. Only 1000-1500 words are required for each essay. It can be finished within one day. For the presentation, you have to do it in group. <br /><br />There are also 4 after-class homework, which can be done within 2 minutes. <br /><br />There is no vocabulary test in 2030H.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oZANjEb4PMW6C6bHtqacKHlsBBQTravU",
            "semester": "2020-21 Spring",
            "instructors": [],
            "is_author": false,
            "author": "oxoxox",
            "date": "Sep 02, 2021",
            "title": "Reasonable workload, very good grade",
            "comment_content": "Nothing related to English at all.<br />The course consists of two parts: engineering ethics and innovation technology. Each part had a piece of individual report and a group presentation.<br /><br />The first part of the course was especially tough. We had to form small groups of 2-3 people each to work on a different case study. There were 12 very wordy reading materials for my case and I didn't quite understand the content at first. I spent two days reading all the materials and trying to link up everything I have read. It was tough because I had a free rider in my group. <br /><br />The second part was fun, you only have to use your creativity to 'invent' different technology and do a proposal on it.",
            "comment_teaching": "interactive lesson",
            "comment_grading": "First part <br />25% Analytical Report: minimal instructions given other than a grading rubric. Have to figure out different parts yourself<br /><br />20% Presentation 1: Basically combining all groupmates' Analytical reports for a 5-minute long presentation. if you have good groupmates you should be fine.<br /><br />Second part <br />20% Proposal Report: again minimal instructions were given other than a grading rubric. You will have to rely on your groupmates' and your creativity. <br /><br />25% presentation 2: 5minute presentation on your group's 'innovation' with Q&amp;A. Basically its a Q&amp;A session between your group and the instructor<br /><br />5% Groupwork<br /><br />5% Practice task<br /><br />Very good grade, I don't think I did too well in the first part still managed to get A-.",
            "comment_workload": "again if you have good groupmates you should be fine",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "s9NT9AAOVxlGcWicQH0PoFaMaibUsBiJ",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 877,
                    "name": "LI, Eugene",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Shady",
            "date": "Jun 05, 2021",
            "title": "Good Course",
            "comment_content": "This course or 2030 is required for all engineering students.<br /><br />The Honours version in terms of content is not very different from the regular one. <br /><br />The course has 2 parts<br /><br />Part 1: Engineers and Social Responsibility<br />Part 2: Engineers and Creativity<br /><br />Part 1 mainly deals with the ethics and social implications of our actions as engineers. Through the classes, there are numerous cases we analyse and discuss.<br /><br />Part 2 subsequently deals with innovation within the diverse fields of engineering. It also covers the feasibility of set innovations. We similarly analyse cases and discuss these innovations in class",
            "comment_teaching": "Very good instructor. <br />Always looking to answer students' questions. <br />Makes the classes interactive and interesting.",
            "comment_grading": "There are discussions individual and group. <br />These are not graded directly but must be completed. <br /><br />There is a presentation and report for each of the 2 parts.<br /><br />Final scores not handed out <br /><br />Final grade : A+",
            "comment_workload": "Decent Workload<br /><br />Discussions only take 10-15 minutes to write<br /><br />Reports can take a few days. <br /><br />There are no exams so its easy to handle",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WsLrDk02LX7XrxzuZrVNxmP6PfFQMoct",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Versa",
            "date": "Jan 21, 2021",
            "title": "Pretty good course",
            "comment_content": "It's a fairly straightforward 2 part course. <br />In the first half of the semester, we covered engineering ethics. This part is predominantly a case study, wherein you analyse an engineering mistake, and write a report on the ethics of it. The ethical cases are interesting so it isn't much of a chore to read about them. The writing part is quite technical though, so it will be a little dull.<br /><br />Soon after, you have to make a presentation on the same topic. You'll probably have to record a 15-minute long video with 2 teammates. <br />Trust me. don't try to do it in one take....<br /><br />The second half is a lot better. You design and describe an innovation that you've come up with, with your team. This is the good stuff, but once again, it gets annoying when you finally start writing and presenting.",
            "comment_teaching": "Jessica Chan was a great teacher. She was pretty fun and actually made the concepts graspable. The nature of the subject itself was light, at least in the class, so that helps too. She's a delight to learn from.",
            "comment_grading": "Part 1: <br />25% Ethical case analysis report<br />20% Ethics presentation<br />2.5% attendance and participation<br /><br />Part 2:<br />25% Technical invention report<br />20% Technical invention presentation<br />2.5% attendance and participation<br /><br />Pretty easy, not gonna lie. I thought I absolutely messed up my Part 1, and honestly, my grade descriptors seemed indicative of a very average performance. Part 2 was way better, though and is probably what pulled my score up. I ended up with an A+, which was something I wasn't even able to do in high school level english... So yeah, just follow the instructions but be a little creative.",
            "comment_workload": "Annoying workload, tbh. It may not be a lot, especially for a person who's good at forming sentences on the spot. But for me, I spent 5 hours recording videos to get 5 minutes of content out. <br /><br />The reports themselves are supposed to be around 1500-1600 words long, which seems long initially. But honestly, by the end, I wished I had 100 more. There isn't much homework, and is quite light a subject, all-in-all. But when the deadline finally shows up, it gets very stressful very fast... Especially if you procrastinate as much as I did. Though, even at its worst, it was one of my lighter subjects.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HgO5xUeaGZriSV0MOelph3ToGxRRZQGf",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 335,
                    "name": "WONG, Chun Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "s.ting",
            "date": "Jan 19, 2021",
            "title": "GOOD COURSE GOOD GRADES GOOD INSTRUCTOR",
            "comment_content": "covers 2 modules. materials provided and taught in lessons will help you complete your coursework well<br /><br />Part 1 Engineers and Social Responsibility<br />Unit 1.1 What are engineering ethics?<br />Unit 1.2 Analyzing ethical issues in engineering<br />Unit 1.3 Analyzing an ethical case<br />Unit 1.4 Identifying facts in an engineering disaster<br />Unit 1.5 Analyzing an engineering disaster<br />Unit 1.6 Expressing opinions and taking a position<br />Unit 1.7 Finalizing your analytical report and citing sources<br />Unit 1.8 Presenting ethical issues<br />Unit 1.9 Taking part in seminar discussions<br /><br />Part 2 Engineers and Creativity<br /><br />Unit 2.1 The creative engineer<br />Unit 2.2 Introducing a creative project (1)<br />Unit 2.3 Introducing a creative project (2) (w/ technical design form)<br />Unit 2.4 Reviewing literature and comparing technologies (1)<br />Unit 2.5 Reviewing literature and comparing technologies (2)<br />Unit 2.6 Giving a technical description (1)<br />Unit 2.7 Giving a technical description (2)<br />Unit 2.8 Describing feasibility and benefits, concluding and putting together your proposal<br />Changes to Proposal Presentation (with expanded notes on zoom recording)<br />Unit 2.9 Presenting an innovation (1)<br />Unit 2.10 Presenting an innovation (2)<br /><br />Part 1 is basically the stuff you learn in high school, adding on to engineering ethics which should flow inside every single person yet never taught in school.<br />Part 2 is the fun part where you get creative!",
            "comment_teaching": "I have to say Derek is one of the best instructors in ust/lang dept. <br />Always available to answer questions, be it through email or during lecture hours/off lesson hours, gives constructive feedback on how you could improve in your work and encourages us to speak up in lectures. He is super nice and starts off each lecture with a casual chit-chat or some good music, making zoom lectures more enjoyable and chill.",
            "comment_grading": "absolutely excellent grading, gpa saver<br /><br />Part 1:<br />-1 group&nbsp;&nbsp;presentation&nbsp;&nbsp;&amp;&nbsp;&nbsp;seminar&nbsp;&nbsp;discussion&nbsp;&nbsp;on&nbsp;&nbsp;an&nbsp;&nbsp;engineering&nbsp;&nbsp;ethics issue (group and individual) (20%)<br />-1 analytical report on an engineering ethics issue (individual) (25%)<br />Part 2:<br />-1 group presentation of a proposal for an engineering innovation (group and individual) (20%)<br />-1 proposal report for an engineering innovation (individual) (25%)<br />Overall: <br />Contribution to group work for Part 1 and 2 assessed tasks (5%)<br />Participation:&nbsp;&nbsp;&nbsp;Lesson&nbsp;&nbsp;&nbsp;preparation,&nbsp;&nbsp;&nbsp;assigned&nbsp;&nbsp;&nbsp;out-of-class&nbsp;&nbsp;&nbsp;activities, class participation and attendance (5%)<br />(as long as you're willing to speak in class which shouldn't be a problem in the H stream, doesn't matter what you say, Derek makes it like you're talking to a friend so feel free to talk!)<br /><br /><br />got an A+ (something that never happens to an SENG student lmao)",
            "comment_workload": "workload is fair<br />-2 reports: analytical report + proposal report (both ~1500 words)<br />-2 presentation (pre-recorded videos that you can record a billion times until you find a fluent and perfect one)<br />-a few short canvas discussions/writing tasks to complete, which should be short and easy and Derek guides you through what you have to do<br /><br />Derek leads you through when to start working on the assignments and provides pretty useful feedback as you work through them, so you get a better sense as to what to focus on, lessening the workload during the process.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nJtH2iaGF4YWSorIVK0K1gaGM0UATNp4",
            "semester": "2017-18 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Kelvin Y",
            "date": "Jul 28, 2020",
            "title": "If you can register in this course you probably will get a decent grade",
            "comment_content": "Engineering English, basically how to write more technical stuff. Also some stuff about ethics in engineering.",
            "comment_teaching": "Derek Wong was my teacher. He was alright, not an especially good or bad teacher but he was chill.",
            "comment_grading": "I didn't really try that much and got a B+. If you can enroll in this course you probably have a decent level of english anyways. Just do the work and you'll be fine. If you want an A range then go talk with the teacher/email him to ask for his thoughts on your essays earlier.",
            "comment_workload": "It's an english language course, expect essays and presentations. If you can enroll in this course you can probably write essays and do presentations just fine anyways. I did most of them in one day (I'm lazy and always did them the day before).",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rEIFJZc9yhcHEQkDEPulpPU1KbubsBXl",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "freshman",
            "date": "Jul 03, 2020",
            "title": "",
            "comment_content": "This course aims to talks about ethical issues in the engineering field.",
            "comment_teaching": "Jessica is an excellent teacher. She encourages discussion and invites everyone to participate in class.",
            "comment_grading": "Part 1: Ethical Assignment<br />Report: 25%<br />Presentation:20%<br /><br />Part 2: Proposal Report<br />Report: 25%<br />Presentation: 20%<br /><br />Out-of-class activities: 5%<br />Group work for both Part 1 and Part 2: 5%<br /><br />As this course is an Honour Course, there will not be any vocab quizzes. Moreover, the overall grading distribution of this course is pretty decent. It would be wise to be active in class",
            "comment_workload": "The workload is considerably high. Everyone has to submit an essay on canvas every two weeks. Furthermore, students would need to spend time with groupmates after class in order to finish their projects and reports.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GoIRqNUlA16kM8NTs4vvAdCUBKgxO9SD",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "windT.T",
            "date": "Jun 11, 2020",
            "title": "Great Instructor, Good learning atmosphere even in online mode",
            "comment_content": "Just like LANG2030, this course is divided into two parts, the first half is about ethics of engineers, where we have to analyze an industrial accident based on provided resources and additional research. The second part is about creativity, where we have to come up with an innovation and write a proposal report for it. <br /><br />I would say the contents is like a typical language course, which focuses on teaching how to present well in different contexts. Personally, I think this quite useful since I have never encountered this in my secondary school.",
            "comment_teaching": "Jessica's teaching is definitely one of the best in UST! As an language instructor, her pronunciation is easily understandable, and I am not easily distracted. Also, she utilized ZOOM and Office 365 well, and the use of breakout rooms and shared documents can really simulate traditional group discussions and interactions. <br />For the small assignments, Jessica will provide timely feedback and it is valuable to improve the writing, the core part of assessment of this course.",
            "comment_grading": "Part 1: Ethical Assignment<br />Report: 25%<br />Presentation:20%<br /><br />Part 2: Proposal Report<br />Report: 25%<br />Presentation: 20%<br /><br />Out-of-class activities: 5%<br />Group work for both Part 1 and Part 2: 5%<br /><br />No vocab quizzes. <br /><br />Since this is a H-stream course, the grade distribution is really good. As a local student, although there are many elite students from foreign countries, with an average score of 5.5/7 (under the elpa scale), I still managed to get A- at the end. My presentation and writing skills are not particularly good, so I think this is really good indeed.<br /><br />For the group work, since students in H-stream have higher English ability, the work go quite smooth and I feel enjoyable working with them.",
            "comment_workload": "In LANG2030H, students need to write more because there is no vocab quizzes (I guess). But normally, if you do more research, you will have more to mention in your report and so the word limit is not a problem to you. However, DO start earlier since proofreading is time-consuming and you have to make sure that you fulfilled all the requirements of your submission. Just follow what Jessica have mentioned in class and you will be fine, and it implicitly means DO NOT skip classes :)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vDnDsnlILGGAu4prJDtyP7jaKDPcEra3",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "!gpa_god",
            "date": "Jun 11, 2020",
            "title": "Decent course, amazing instructor,",
            "comment_content": "Content-wise, same as the normal 2030 class, except you gotta write slightly more words and don't have to deal with those horrendous vocabulary/grammar tests. <br /><br />The first half of the course covers engineering ethics (code of conduct of HKIE and the international broad-based guidelines). The second part mainly focuses on the presentation and writing of new &amp; innovative engineering ideas.<br /><br />There are two assignments in this course, one for each topic (ethics and innovations). For ethics, we were told to split into groups with an assigned topic and write an analytical report for the ethics portion of the course. <br /><br />As for the second part - innovation, we were required to form a group again (different from the first one) and come upw with an &quot;innovative&quot; idea for an imaginary engineering innovation competition. You basically just have to write a proposal with your teammates and work on a presentation.",
            "comment_teaching": "Jessica is a BBC (British born Chinese). She was raised in the UK and naturally her English is impeccable (don't forget that her alma mater is Oxford). She always pick students randomly to answer questions and since lectures were delivered in an online manner, we were put into &quot;breakout groups&quot; and had to work on tasks in an online Word document format. <br /><br />Jessica always gave us back feedback (or critique) on small weekly homework or assignments in a timely manner. Honestly, she is one of the best instructors I have met in UST.",
            "comment_grading": "Part 1: Ethics group presentation (group and individual) - 20%<br />Part 1: Ethics analytical report 1,000-1,500 words (individual) - 25%<br />Part 2: Innovation presentation (group and individual) - 20%<br />Part 2: Innovation Proposal report 1,400-1,600 words (individual) - 25%<br />Group work contribution - 5%<br />Participation (homework, attendance, class preparation, etc.) - 5%<br /><br />I have heard that the grading floor of 2030H is a B+. The chances of you getting an A- or higher is pretty high (since the initial requirements for this course is pretty high). A solid 10/10 for the grading part of this course.<br /><br />(I only got an A- for this course and I kinda deserved this as reflected by my crappy review writing skills)",
            "comment_workload": "Frankly speaking, there ain't that many homework/assignments to work on. But if you are one of those DDP students/those with 20+ credits in one semester, then you are advised to work on your assignments at least 5 days before the deadline.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1PhZOxCjLE7dUfiAtHrJvEFmntc5rezj",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 412,
                    "name": "CHAN, Jessica",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yaboi",
            "date": "May 22, 2020",
            "title": "Not the most useful course but fun nonetheless",
            "comment_content": "Unit 1 was about ethics and how they were related to engineering. We looked at a few cases and determined the different ethical violations.<br />Unit 1.1 What are engineering ethics?<br />Unit 1.2 Analyzing ethical issues in engineering<br />Unit 1.2 Analyzing ethical issues in engineering<br />Unit 1.3 Analyzing an ethical case<br />Unit 1.3 Analyzing an ethical case<br />Unit 1.4 Identifying facts in an engineering disaster<br />Unit 1.4 Identifying facts in an engineering disaster<br />Unit 1.5 Analyzing an engineering disaster<br />Unit 1.5 Analyzing an engineering disaster<br />Unit 1.6 Expressing opinions and taking a position<br />Unit 1.6 Expressing opinions and taking a position<br />Unit 1.7 Finalizing your analytical report and citing sources<br />Unit 1.7 Finalizing your analytical report and citing sources<br />Unit 1.8 Presenting ethical issues<br />Unit 1.8 Presenting ethical issues<br />Unit 1.9 Taking part in seminar discussions<br />Unit 1.9 Taking part in seminar discussions<br /><br />Unit 2 was about coming up with an &quot;innovation&quot; and then presenting it in a report and a presentation.<br />Unit 2.1 The creative engineer<br />Unit 2.2 Introducing a creative project (1)<br />Unit 2.2 Introducing a creative project (1)<br />Unit 2.3 Introducing a creative project (2) (w/ technical design form)<br />Unit 2.3 Introducing a creative project (2) (w/ technical design form)<br />Unit 2.4 Reviewing literature and comparing technologies (1)<br />Unit 2.4 Reviewing literature and comparing technologies (1)<br />Unit 2.5 Reviewing literature and comparing technologies (2)<br />Unit 2.5 Reviewing literature and comparing technologies (2)<br />Unit 2.6 Giving a technical description (1)<br />Unit 2.6 Giving a technical description (1)<br />Unit 2.7 Giving a technical description (2)<br />Unit 2.7 Giving a technical description (2)<br />Unit 2.8 Describing feasibility and benefits, concluding and putting together your proposal<br />Unit 2.8 Describing feasibility and benefits, concluding and putting together your proposal<br />Unit 2.9 Presenting an innovation (1)<br />Unit 2.9 Presenting an innovation (1)<br />Unit 2.10 Presenting an innovation (2)<br />Unit 2.10 Presenting an innovation (2)",
            "comment_teaching": "Jessica was an amazing teacher. She made the classes very interactive and frequently used the Zoom breakout rooms, polls and other participation features. She gave detailed feedback and responded to emails quickly. If you are reading this in the future 2019-20 only had online classes on Zoom.",
            "comment_grading": "As long as you participate and understand the presentation and essay structures properly, you'll do well. Your grades are determined by the course coordinator, so you will only know your grade at the end of the semester. The teacher will tell you how well you did in the task from Very Poor to Excellent, but they can't tell you the letter grade.",
            "comment_workload": "Not a lot. Two essays and two presentations in total. You will work in two groups so in a way, your success is based on your group but if your group isn't working much, tell Jessica, she'll help. Attendance is tracked and you can only miss 5 classes until you fail the course. Attend all classes if possible because she normally mentions important points about the graded assignments. She will give small pieces of homework every now and then, usually a 100-150 word paragraph.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BIEoSBOrRlWjaNG6c2Z7FZ1ZjMS4YLhf",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 335,
                    "name": "WONG, Chun Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Timothy_Tsui",
            "date": "Jan 18, 2020",
            "title": "If you can take the H course, forget about the normal one.",
            "comment_content": "It's a LANG course so don't expect to learn too much about engineering here. But you can surely get your language-related skills improved in this course.<br />The first part of the course is about engineering ethics, you need to write an essay and do a presentation regarding a specific case, in which you need to analyze certain ethical conduct of the engineers involved.<br />The second part is about creativity, you basically need to come up with some sort of innovative project and do the exact same things that you did in the first part.",
            "comment_teaching": "Derek is a patient and easygoing person. The classes are enjoyable and rewarding, even in the second half of the semester when we had to have courses on canvas.",
            "comment_grading": "Good grades, period.<br />Don't worry if you feel your work is inferior compared to your classmates, just do your best and the grades won't disappoint you.<br />Remember to use something like Grammarly to check everything you've written to make sure your piece is grammatically correct.<br />Takes attendance but you probably don't want to miss any class anyway.<br />No vocab quizzes!",
            "comment_workload": "Not the workload that I would expect for a 3 credit course. If you're a&nbsp;&nbsp;deadline fighter be prepared for some sleepless nights before the ddls.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fCxkdgc1ONafdK7pmrnrn6I7FanC3Svf",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 464,
                    "name": "CARMICHAEL, Sarah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jpmaboi",
            "date": "Aug 17, 2019",
            "title": "",
            "comment_content": "Basically teaches you about topics related to engineering and related vocabulary and writing skills. The course is split into two parts: laws and ethics for engineers and creative design/project<br /><br />The first part focuses on ethics, different ethical guidelines related to engineers, as well as looking into some cases where failure to follow ethical guidelines lead to disasters.<br /><br />The second part focuses on new designs and products, and how engineers can present a new product.<br /><br />You will look into the issues at hand, and learn some related English skills, such as jargons and how to structure a report.<br /><br />Overall, it's pretty fun. Pairing language with a variety of situations/cases makes the experience interesting, and I was able to use what I learned in this course to do better in other courses.",
            "comment_teaching": "Teaching is rather interactive. Expect some question and &quot;back and forth&quot; discussion from the instructor and a lot of discussion with your neighbors. In my opinion, this is a good way to train speaking skills, but it may pose some trouble if you're shy like me.",
            "comment_grading": "One group project and one individual report for each part. Grading for the four assignment is about the same(forgot the actual number lol sorry). Grading is good, I was about middle in my class and I got an A-.",
            "comment_workload": "The group projects and individual reports are manageable if you have enough time. If you understand the case really well and are good at writing you can even write up a half-decent report over a weekend. For me, the deadlines were about a week away from other mid-terms and finals, so it wasn't too stressful. <br /><br />However, there's a minimum attendance requirement and if you miss too many classes you will fail, so make sure to get a doctor's note if you do get sick. There is also a library course on citations.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pUsQtNpnG9YWrqmqFIYaaEWrKzGGscQ0",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 464,
                    "name": "CARMICHAEL, Sarah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "BitCoinsNotCoin",
            "date": "Jun 05, 2019",
            "title": "Great course, great grading, highly recommend",
            "comment_content": "Two parts. <br /><br />Part 1: Engineering Ethics. Engineering Disaster Case Report + Presentation.<br /><br />Part 2: Creative Design. Creative Design Report + Presentation.",
            "comment_teaching": "Very Interactive. A lot of opportunities to practice public speaking. Sarah Carmichael is really good at hosting discussions. Every student in class got to share constructive opinions.",
            "comment_grading": "Very good grading, because the general level of English ability is higher.&nbsp;&nbsp;Grading Based on Engineering Ethics Disaster Case Report, Presentation, Creative Design Report, Presentation, and Attendance(in class performance, punctuality, e.t.c).",
            "comment_workload": "Workload is manageable if time is managed correctly. No midterms, no finals. 4 mini assignments, 2 projects, 2 presentations.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9qT10uOgXTCqlx6uSk0DYxMqH0pwmIJB",
            "semester": "2017-18 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Rabin",
            "date": "Jan 24, 2019",
            "title": "",
            "comment_content": "mainly focusing on ethical issues regarding engineering aspects. The course has no exam and instead you will be graded upon projects done with your group and multiple essays submitted regarding different ethical issues and how to approach each of them.",
            "comment_teaching": "",
            "comment_grading": "",
            "comment_workload": "The workload was not too much as we would be given tasks every week to go home and re-visit so we can have further discussions in class. The topics would mainly be about technology or something that can be used by technology to enhance our lives, etc.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uiENywJlF2oQtrAngExoYyiJjZg5C6dK",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 335,
                    "name": "WONG, Chun Ho",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "whateverrr",
            "date": "Jan 20, 2019",
            "title": "good grade course",
            "comment_content": "Since it is a language course for engineering students, the contents are more or less centered on engineering ethical issues and new innovations.",
            "comment_teaching": "Derek Wong is a humorous and serious lecturer, you will never get bored in his lecture. I really like the way he allowed us to express our ideas freely and interactively and listened to our opinions patiently during lecture. I really appreciate how he prepared to introduce the topics.",
            "comment_grading": "A very good grade course, most of the students can score within the range of A. The lecturer is lenient and not harsh on the grading. As long as you can fulfill the requirements given, you can score at least 5 or 6 out of 7 in the essay.",
            "comment_workload": "The workload was not heavy when compared with other major courses. There are usually some tasks like writing a 150-word passage before the next lecture. Apart from that, as long as you are not a deadline fighter, you will never find this course is a demanding course. But if you are, you will only need to rush on your thousand-words essay before the deadline.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9FsOQeaktRo0lrKr0BZE9NPg3sQICwVA",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1050,
                    "name": "SAKURAI, Kazuhiro",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anisha",
            "date": "Jan 09, 2019",
            "title": "",
            "comment_content": "The units are mostly about engineering ethics and project proposal on which you have to write one essay each. Then there are group presentations on those. <br />Personally, I thought both the parts were quite easy to do since most of the reading materials for the ethics cases were provided and the project essay did not have to be extremely technical and accurate.",
            "comment_teaching": "The professor was extremely nice and welcomed a humorous approach to teaching. He created an interactive atmosphere in the class and encouraged everyone to participate and emphasized on the fact that it's not WHAT we think that he cares about but HOW we think it. <br />However, if I am being picky, I did not like how we had to present to our peers and then our peers would give us feedback. Honestly, that was not very helpful since our peers are just as skilled and experienced as we are and it should have been the professor giving us feedback.",
            "comment_grading": "Very good grading. The professor was extremely lenient and gave me all 7s and one 6 even though I thought my essays and presentations were average.",
            "comment_workload": "You gotta submit some canvas discussions every now and then and review your classmates' work as well. Other than that, the only workload comes before essay submission and preparing for the presentation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "369DN4oVMNAdqinkhwsrqRkVVxODFsMh",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 409,
                    "name": "KASTEN, Keven Sterling",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Aaron W",
            "date": "May 22, 2018",
            "title": "",
            "comment_content": "Just write two reports and do two presentations. You honestly don't learn much of anything, but it was super enjoyable nonetheless. You also have the chance to meet and get to know really cool people.",
            "comment_teaching": "KK was super fun and chill, and I really enjoyed the class. He also gives really good advice about writing and presenting. One funny piece of advice he gave me was that my first presentation was good, but he could tell that we were just memorizing a script, so he told us not to write a script for the second one (just write down a few key points), so it'll sound more natural. I took his advice and basically winged the second presentation, which actually went pretty smoothly ahaha.<br />Unfortunately, he told us that he'd be leaving after the spring semester, which is a shame since he's honestly a great instructor and a really nice guy.",
            "comment_grading": "Technical Report: 6.5 7 7 7<br />Presentation: 6 7 7<br /><br />Innovation report and second presentation grades weren't released.<br /><br />Overall: A+",
            "comment_workload": "The workload depends on how much effort you put in the course, but if you have good English, it isn't very difficult and it won't take up too much of your time.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6SwSAVmAwEss0ioWYStlA2JG1Ryei4wB",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 427,
                    "name": "SADHWANI, Dinesh Arjan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jricafort",
            "date": "May 10, 2018",
            "title": "",
            "comment_content": "The content, which is about ethics and presenting creative ideas, is not the most interesting content in the world, but definitely useful and relevant to our professions. The content pertains to writing formally and presenting your ideas effectively.",
            "comment_teaching": "Dinesh is the most chill teacher in the history of the universe. His teaching style is insightful, going into depth about the content a lot more than most teachers, and I think that the insight is what makes his lessons more interesting than the majority of lecturers at UST.",
            "comment_grading": "The grading is fair. Getting full marks is difficult, but not unreasonably so.",
            "comment_workload": "The workload, which consists of two essays and two presentations, is appropriate for a three-credit level course, and possibly even below-average.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nMXcfxNXThi1gSCHRH5wNmvfRZUgq47s",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "donald0211",
            "date": "Mar 20, 2018",
            "title": "Generally OK",
            "comment_content": "The course has split into two sections, first one is about engineering ethics and the second one is about innovations. The first one is quite easy as you only need to complete projects and presentations based on the ethics given in the textbook. The second one is rather difficult because you have to think of an innovation that haven't been done before or is an improvement of an existing product.",
            "comment_teaching": "The teaching is good, the atmosphere is quite relaxing you really don't feel like it's a normal lesson. The lesson is interactive and most of the time we are doing group works and sharing to others and receive comments from the other groups. Therefore from it you get to learn a lot.",
            "comment_grading": "The course grading is based on two written assignments, two presentations and attendance scores. The second part which is innovation one weighted more than the first one a bit(only a few percent).<br />The grading is okay but I think it could be better. I got on average 6 overall and got a B+.",
            "comment_workload": "Workload is less because for H class students do not need to take vocabulary test. Although sometimes there are assignments such as writing a summary on a video that is around 100 words which is quite easy. Other than that there are only two reports to write and two presentations need to prepare.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bo5o1moynJGZVtb5cdDIyBebqRd6yQHP",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 464,
                    "name": "CARMICHAEL, Sarah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JhanNG",
            "date": "Jan 23, 2018",
            "title": "",
            "comment_content": "Divided into two main parts: engineering ethics and innovative ideas. Tbh this course is very boring, but attendance is required so better attend the class. (not sure about the penalty of skipping class). Lecturer will make you talk in every class, so basically it's just a talking session twice a week.",
            "comment_teaching": "This instructor is rather strict, does not allow phones or chit chat in class. A good instructor overall, in my opinion.",
            "comment_grading": "For H classes we have no vocab test so the grading all depends on the projects. There are two projects in total, the first one is about engineering ethics and the second one is engineering idea. Pretty lame actually, but for good grade you have to put some effort into your projects, including written report and group presentation. Take note that H class students (abt 1.5k) have to write more words than mainstream class students (abt 1k).",
            "comment_workload": "All you have to do is write two reports in total. Very light workload overall. The instructor gives HW sometimes, but mostly easy one and does not counted in grading.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wA7vatygIxJlf1sRpTeP8iTBJwl7Z5qM",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 464,
                    "name": "CARMICHAEL, Sarah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hskris",
            "date": "Jan 23, 2018",
            "title": "",
            "comment_content": "The course was divided into two parts throughout the semester. First half is about Engineering ethics and the other half focuses on Engineering innovations. You will learn how to analyze ethics cases, write reports and technical papers, and present.",
            "comment_teaching": "The instructor teaches in a very engaging way. She always involves the students in class actively. She also doesn't mind when you have some questions or want to talk about something outside class.",
            "comment_grading": "If you get in the H-class then you should be already pretty good in English. Writing and speaking shouldn't be a problem for you. This course just tries to teach you how to do it in a technical style. There are 7 score levels for the assessment of presentation and writing, and H-class students did pretty good, like 5-7 score, which could get you around A range.",
            "comment_workload": "There are plenty of homework of writing essays on Canvas (like every week) but they are quite easy and doesn't take much time. And then there are two long technical writing tasks (1000+ words) for the midterm and final, with a group presentation afterwards (15 mins). It sounds difficult and lengthy, but really it doesn't take as long as you thought of once you start.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FpWxkyJQ8xgsp1SgVISnU7hUoWpsbwHg",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 464,
                    "name": "CARMICHAEL, Sarah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kyu Won Shim",
            "date": "Jan 15, 2018",
            "title": "",
            "comment_content": "This course is mainly composed of engineering ethics, technical description and innovative writing. For me, engineering ethics was relatively not interesting compared to other two parts of the course. Throughout the course, you will learn how to evaluate certain cases in the perspective of engineering ethics. Moreover, you will also learn how to correctly write technical description and innovative writing.",
            "comment_teaching": "The instructor is experienced and encourages students to be engaged in the class. However, she does not notify homework through Canvas, which can be sometimes confusing for the students.",
            "comment_grading": "The grading for this course includes two essays and two presentations. Overall, if you get mixture of 6s and 7s for all assessments, 'A' range is assured. Lastly for the presentation, the instructor prefers students to memorize rather than depending on the script. Students should also actively contribute in the class to give good impression to the instructor.",
            "comment_workload": "Workload for this course is doable. Homeworks are easy to complete but just don't forget to do it. Morever, make sure to manage your time well for the two essays, since it will be very stressful to complete those essays overnight.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HizhP4NorVlgZb1qSt6Md0WSg0gPVvoD",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 464,
                    "name": "CARMICHAEL, Sarah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MEMENTO",
            "date": "Dec 25, 2017",
            "title": "",
            "comment_content": "The content includes ethics in engineering filed and innovative technology. Basically you follow the textbook that you need to buy for this course, and the content is not too difficult.",
            "comment_teaching": "The professor was very enthusiastic, and she always made us discuss with each other and present our ideas to the others. If I'd liked regular english class, I would have liked this course.",
            "comment_grading": "The grading scheme is very generous. If you get above 5.5 on average, I think you'll get at least A-, which is very good. I think the lowest you can get in this course is B+, unless anyone fails.",
            "comment_workload": "The workload was more than moderate, because you need to do online discussions and write two essays in total, as well as having to prepare for 2 presentations, which is 15min per each group each. If you are prepared for writing essays and doing presentation from your highschool, then the workload would become very low.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "asjr9kNiG83S2IfxfmffCZsqm7q7tKl4",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 464,
                    "name": "CARMICHAEL, Sarah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ddd",
            "date": "Jan 08, 2017",
            "title": "",
            "comment_content": "Course is divided in 2 parts: <br />Engineers and social responsibility,<br />Engineers and creativity.<br /><br />At the end of the first part you need to write an analytical report on some ethical issue (assigned to you by the prof) and prepare seminar presentation on the same topic. <br /><br />At the end of the second part you need to write a proposal report on an invention of your choice (it must be something creative and innovative) and deliver a presentation about it.<br /><br />Attendance requirement: after missing 3 classes - they send a warning letter to you and your department<br />after missing 6 classes - you fail",
            "comment_teaching": "The teacher was okay, not very enthusiastic, but at least she is experienced and can give you a valuable feedback on the proposals and presentations.",
            "comment_grading": "seminar presentation: 20%<br />analytical report: 25%<br />proposal presentation: 20%<br />proposal report: 30%<br />participation: 5%<br /><br />I don't know about the rules, but after summing up the scores from all the assessments I got slightly above 90% and it was A+.",
            "comment_workload": "5 online homeworks (very easy, ~200 words of writing)<br /><br />sometimes you will be asked to watch or read something before the class",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7ckA91nqbCAZUOStWyNQxVU8L4RVvHYS",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 462,
                    "name": "LEE, Joyce Yuen Yee",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "1984",
            "date": "Jan 05, 2017",
            "title": "",
            "comment_content": "There are two main parts to this course, namely engineering ethical cases and introducing creative project. <br /><br />We have to write analytical report and present it for the first part. For the second part of the course, we are required to write a proposal report on our creative project and present it.",
            "comment_teaching": "Overall, Ms. Joyce is a great instructor. She teaches very clearly. The class sessions are really relaxing and fun throughout the semester.",
            "comment_grading": "OK.<br /><br />Get 6666 (out of 7) in analytical report<br />6666 (out of 7) in ethics case presentation<br />6777 (out of 7) in proposal report<br />6666 (out of 7) in creative project presentation<br /><br />Result: A",
            "comment_workload": "Very OK (if you do not do things in last minute). There's not much to do in this course except writing two reports, submitting out-of-class assignments (usually writing short essays), presenting two of your reports. Also, there are no vocabulary tests.<br /><br />*attendances required",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NyQJxedhSMcb2VhiCskdmJ71YHG43SHq",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 464,
                    "name": "CARMICHAEL, Sarah",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "coco1997",
            "date": "Dec 12, 2016",
            "title": "good course",
            "comment_content": "Very similar to TOK&nbsp;&nbsp;in IB, much easier though. Just listen in class and you'll be fine. You have to talk in class so the teacher loves you.",
            "comment_teaching": "The instructor is very good. She always jokes around with us and doesn't care if we go on our phones",
            "comment_grading": "Very good grading. If you get all 6s I think you'll get an A. Good chance to pull up your GPA or think about other courses.",
            "comment_workload": "Very little workload, got carried by Pishun Homworks every week or so which is not graded, but counts towards participation marks.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2XbKSTGEginW4s6DiWXags1bZh8riGEC",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 302,
                    "name": "HO, Susanna Pui San",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "prashcr",
            "date": "Aug 25, 2015",
            "title": "Great course",
            "comment_content": "Learnt a lot about the different aspects of technical communication, focused on report writing, presentations, and use of language. As a DSE student, course was quite useful since we don't do many reports or presentations in secondary school.",
            "comment_teaching": "Quite interactive, lots of group discussion/peer assessment in class. Class materials were highly varied, including short videos, news clippings, magazine and journal articles, in addition to textbook. Lecturer was very friendly.",
            "comment_grading": "Grading is absolute. Easy A-range if you're proficient in English. Don't miss too many classes because professor's impression of you is quite important.",
            "comment_workload": "Very reasonable for engineering students. Weekly 100-200 word writing task, along with 4 vocab quizzes, 2 individual reports and 2 group presentations + reports over the semester.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ICQVtVjnJlU6fBDlX9jOkNbYTPWuooyH",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 409,
                    "name": "KASTEN, Keven Sterling",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "SamK",
            "date": "May 24, 2017",
            "title": "",
            "comment_content": "The course itself is easy.<br />However, I didn't enjoy the course cause our instructor was not qualified to teach.",
            "comment_teaching": "The instructor was so bad.<br />He was irresponsible, lazy and not qualified for teaching this course.<br />Our group had some trouble while doing our project, he stepped in and flipped a coin.",
            "comment_grading": "grading was awful.<br />Even though I wrote fine piece of writing, I only able to get 5.5 for the assignments.",
            "comment_workload": "there is not much.<br />one report and presentation for ethics,<br />one report and presentation for innovation.<br />ethic report is 1000~1500<br />innovation report is 1400~1600<br />both presentation is about 15min per group",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}