{
    "error": false,
    "course": {
        "id": 741,
        "subject": "LANG",
        "code": "1320",
        "name": "German in the World of Science and Technology",
        "description": "This is a course for learners with no previous knowledge of German. It aims to offer students a foundation in German language and related German culture, with an emphasis on practical oral communication, and consideration of the impact of major German achievements in the world of Science and Technology. By the end of the course, students will be able to communicate appropriately in German on a variety of everyday topics.",
        "categories": [],
        "website": "http://cle.ust.hk/courses/lang1320",
        "credits": 3,
        "semesters": [
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 4.83,
        "rating_workload": 4.67,
        "review_count": 6,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": []
    },
    "reviews": [
        {
            "hash": "AKs4rnfLtWhr7dMPXRdDm5cqfXUbvxIq",
            "semester": "2015-16 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Hot and Sexy",
            "date": "Dec 26, 2015",
            "title": "",
            "comment_content": "成個course都好簡單<br />係介紹german好入面既grammar同日常生活既話題同少少既grammar <br /><br />mid term前係自我介紹同german既發音<br />mid term會好focus on rammar 例如nominativ、akkusativ 同一d既sentence structure<br /><br />只要你上堂專心跟住instructor 其實都冇乜問題",
            "comment_teaching": "好有耐性<br />而且好風趣 上堂完全唔會覺得佢好悶<br /><br />而且佢好著重每個同學既進度<br />所以基本上每一堂佢都會同大部份既同學用德文去問佢問題<br />每一個都會問好多 所有問題都係之前教過既野<br />如果冇溫過咁去上堂你會覺得好chur",
            "comment_grading": "mid term&nbsp;&nbsp;一半人A range<br />但其實mid term只係佔15%<br /><br />final 冇講成績 但只係佔25%<br />presentation 佔30%<br />oral assessment 佔20%<br />class participation 佔10%<br /><br />我最後A-",
            "comment_workload": "其實都冇乜workload<br />但presentation一定要比心機做<br />因為佔30%<br />同埋要用德文去present 一個德國發明既產品或者人物 present 5-10分鐘<br />所以準備既過程比較chur<br />但平時workload係細到等於冇咁濟<br />得閒可能寫少少文咁",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "G6OW2lkCZJkRSRYXFDfNY1I6mE1MYBQ7",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "LuQ",
            "date": "Jan 27, 2021",
            "title": "Great course, great teacher, and great grading",
            "comment_content": "The absolute basics of German, we only went through the first 8 chapters of the A1.1 textbook. So if you have previous knowledge of european languages, that's an easy boost above your peers because the lesson pace was a bit slow for me.<br /><br />Stuff we learnt include:<br />- Basic self-introduction<br />- Few verb conjugations and very basic sentence structure<br />- der/das/die of nouns<br />- singular and plural forms of nouns<br />- Hobbys<br />- Time",
            "comment_teaching": "Elizabeth/Frau Mok is very eccentric when teaching. She makes the class exciting and easily interactive. Though having online classes may hinder that as it doesn't translate nicely through zoom. If the class is full of introverts and Elizabeth would like students to talk more, it just ends in awkward silences, more awkward than what I'd imagine in face-to-face. And because it's zoom, she may think that it's an internet issue or something and that we couldn't hear her or vice versa, but it's just people not answering. So please, do be proactive, I've never had such relaxing course since high school with a lot to gain from it<br /><br />But otherwise, she loves to introduce her culture (Austrian) to us when we had our presentations. She's also amazingly nice that she even offered to meet up for coffee to anyone on campus, when Covid regulations were relaxed before.",
            "comment_grading": "As expected from a level 1 language course (with some culture study), grading is good. The grading doesn't solely rely on a few assignments, so if you'd mess up one, you can easily make up for it next time. Another review clearly showed the grade distribution already.<br /><br />Interestingly, though the final speaking test was worth 10%, it only lasted 5 minutes less! Really hard to practice for this on my own, my tip would be to try your best to speak German during class, Elizabeth would be more than happy to help, in and out of class.<br /><br />In the end, I got A-, messed up my final writing test by running out of time and focused on the reading a bit too much.",
            "comment_workload": "She gave some homework that she'd go over the next lesson. As for the big assignments that counts for some percentage of the grade, Elizabeth would show them to us really early during the semester, so that gave me quite a lot of time to arrange the best time to do it. E.g. the Cultural essay outline was given nearly 2 months prior to the deadline. <br /><br />The only 'difficult' part i'd say is the final written test (incl. listening, writing and reading). Just spare some time to fully digest the content, mostly the keywords and grammar would be enough. The textbook has an abundant of practice tests, along with additional ones from Elizabeth's worksheets. There's also CD in the workbook for practicing listening.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HzMnlYSKxrFPSEvVAHPCuNvZ6GQiBrj6",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "qjk",
            "date": "Dec 23, 2020",
            "title": "epic grading",
            "comment_content": "Basic German course.<br />You will learn how to introduce yourself in German, how to talk about your family, your studies/job, your hobbies, etc., and how to talk about the time.<br />You will also learn some basic German grammar such as the articles (der/die/das), singular and plural.<br />Don't expect to be able to hold a conversation in German after this course, because I wasn't. But this course is still very interesting, and healthy for your GPA!",
            "comment_teaching": "The lecturer (Frau Mok) is very nice and does a good job of teaching the content.",
            "comment_grading": "The grading is EPIC!!!!! I completely fucked up my spoken interview (worth 10%) and still got an A+!!! Fucked up as in I couldn't even comprehend what she was asking and probably answered some unrelated stuff. I also handed in one homework (counted in participation score) 1 week late.<br /><br />I think all foreign language LANG courses have epic grading because they don't have to grade on a curve or something.<br /><br />5&nbsp;&nbsp;Listening Comp.<br />5&nbsp;&nbsp;Writing (out-of-class)<br />5&nbsp;&nbsp;Reading Comp.<br />5&nbsp;&nbsp;Cultural Discussions<br />5&nbsp;&nbsp;Speaking (out of class)<br />5&nbsp;&nbsp;Writing (in class)<br />5&nbsp;&nbsp;Präsentationen<br />10 Listening Comp.<br />20 End Test: Reading and Writing<br />10 Spoken Interview<br />20 Hand in Cultural Essay",
            "comment_workload": "Very light, some very simple homework, like worksheets, presentations(record audio and send to her) now and then.<br /><br />The finals were during the last week of class, instead of in the finals period, so I was a bit annoyed as I had to to work on 3 essays and 1 project during that week in addition to revising for the finals. Maybe Frau Mok doesn't know how to apply to ARR to arrange a final exam during the finals period or something.<br /><br />But the finals were quite easy. Revise for a few hours and you will have no trouble.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pGO7aPbKmPCFDtSt2Bheyx8GffAjKLPz",
            "semester": "2019-20 Spring",
            "instructors": [],
            "is_author": false,
            "author": "strugglinglolol",
            "date": "Aug 28, 2020",
            "title": "",
            "comment_content": "Useful day to day German. Totally beginner level.",
            "comment_teaching": "Elisabeth Mok is a nice teacher who is willing to connect with her students. She is also a funny teacher so no worries if you are afraid that the class might be boring.",
            "comment_grading": "As long as you did study for it a good grade shouldn't be hard to achieve. Especially homework is also counted towards the grade and could get good marks if you use online resources.",
            "comment_workload": "The workload is alright, there are homework, presentation and a listening and written exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KSuFmg2xKUs5TMkthkezp9N1P6GQGgpI",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Sze Chun",
            "date": "Dec 14, 2017",
            "title": "",
            "comment_content": "You'll learn basic German phrases for greeting such as &quot;who are you ?&quot;, &quot;How are you&quot;,and also the sentence structure of German, you will also learn some common noun in German and lastly learn how to order food in a restaurant. These are actually really useful if you want to travel to a German-speaking country!",
            "comment_teaching": "Elisabeth Mok is the instructors for 2017Fall, she is a very nice teacher, she always interact with students to push us to speak more German.<br />Also she is so nice that she bring snacks for the whole class every lesson.",
            "comment_grading": "Really good grading. As long as you pay attention and practice speaking, you'll be fine. <br /><br />There is a midterm &amp; a final exam. You'll also have an oral exam towards the end. Also you&nbsp;&nbsp;need to do a presentation about any German inventors/Inventions/Brand, in&nbsp;&nbsp;which you are allowed to present in both English and German.<br />The midterm and final exam are not difficult if you pay attention in class, the whole course only covers 3 chapter of German so it doesn't take much time for you to study.",
            "comment_workload": "Workload is generally alright. You'll get 4-5 homework to finish, but usually they are not graded, she only requires you to hand in your homework on time.<br />For the presentation, it is a 5 to 10 minutes talk, so maybe you need some time to get yourself prepared.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vN5Xk6KNJuUk7pyS3CwPXzTMIoKgTqWe",
            "semester": "2015-16 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Krispy",
            "date": "Jul 10, 2017",
            "title": "Interesting &amp; Fun Course!",
            "comment_content": "The class is generally quite easy and you'll be able to catch on if you pay attention &amp; attend each session. You'll learn basic German phrases such as 'How are you', 'Where are you from', 'What are you studying?', and how to order food in a restaurant. These are actually really useful if you want to travel to a German-speaking country! <br /><br />You'll also learn about grammar and the feminine/masculine/neutral terms. This is the confusing bit, but if you practice, it'll be a breeze.",
            "comment_teaching": "Michelle is the nicest teacher you'll ever meet! She makes sure you get the pronunciation and grammar right, so she might come off as strict at first. She's also very encouraging, so don't be afraid to ask her questions!<br /><br />Not sure if she does this anymore, but she baked a cake for our class party on the last day! And yes we had a class party with German food! (I'd say thats the highlight of the course XD)",
            "comment_grading": "Really good grading. As long as you pay attention and practice speaking, you'll be fine. <br /><br />There is a midterm &amp; a final exam. Plus she'll also take attendance. You'll also have an oral exam towards the end, and you'll be evaluated based on your pronunciation and whether you're able to carry a conversation in German. The final was actually harder than expected, but don't worry if you don't know how to answer a number of questions! I skipped quite a lot of questions in the final but still managed to get an A.",
            "comment_workload": "Workload is generally alright. You'll get worksheets to complete, which aren't difficult and you can easily finish them in less than 10 minutes. Pay attention in class and the worksheets will be a breeze. You probably might have to spend more time on your presentation, because you have to present entirely in German, so that's gonna take some time. But overall, workload is generally fair for language course. Just try not to cram everything last minute for the final exam, as it is quite tough. Make sure you really practice speaking and actually understanding the grammar before you go in to the exam room.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}