{
    "error": false,
    "course": {
        "id": 2853,
        "subject": "LANG",
        "code": "3022",
        "name": "Science Communication in English (Chemistry)",
        "description": "The course focuses on developing students' ability to communicate chemistry knowledge to the general public through effective writing and speaking skills. In writing, students learn the specific skills to write genres of both expository and persuasive nature, and reflect on how to explain chemistry concepts in an accessible manner without losing the scientific complexity. In speaking, students learn how to communicate chemistry notions and implications to nonexpert audiences using short videos and oral presentations with appropriate rhetorical and stylistic devices. For CHEM students only.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"LANG\" data-code=\"2010\" href=\"/review/LANG2010\" target=\"_blank\">LANG 2010</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4,
        "rating_teaching": 2.5,
        "rating_grading": 4.5,
        "rating_workload": 2,
        "review_count": 2,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 881,
                "name": "FARMER, Rebecca",
                "count": 1
            },
            {
                "id": 1049,
                "name": "CHEUNG, Colin",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "qcqxOunrReWWv14vREElk6g0zVIg3ptz",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 881,
                    "name": "FARMER, Rebecca",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gazelle",
            "date": "Jun 14, 2020",
            "title": "My first A+ in lang course XDD",
            "comment_content": "Module 1<br />Unit 1: Introduction to science communication<br />Unit 2: Story-telling: spoken science communication<br />Unit 3: Story-telling: written science communication<br />Unit 4: Writing style for the public<br />Unit 5: Self reflection and learning review<br /><br />Module 2<br />Unit 6: Controversy and opinion in science<br />Unit 7: Science in the news<br />Unit 8: Critical reading and writing skills<br />Unit 9: TED talks: ideas worth spreading<br /><br />Assessment<br />Speaking 1: Science communication blog video (20%)<br />Writing 1: Pop-science article: Tell the story of the development of a chemistry idea (20%)<br />Speaking 2: TED-talk style talk on a chemistry controversy (25%)<br />Writing 2: Op-ed article on a chemistry controversy (25%)<br />Participation: In-class discussion and out-of-class work (10%)<br /><br />No doubt, course materials are nicely prepared. Though, don’t trust everything the handout or teacher tells you – critical thinking is important. There is no single presentation skill nor writing technique that could be applied to every single speech or article. In the end, which techniques to be used should depend on the actual context. Sometimes, a piece of good article could be written without explicitly using any of those “skills”.",
            "comment_teaching": "Before the start of each lesson, Rebecca usually chats with students casually. This is a good time to practice your spoken English and share with her your interesting moments of life. <br /><br />Since this is an online course, she likes to have break-out room discussion. It is sometimes a waste of time. Some discussion questions are literally unrelated to course materials. Plus, dead air always happens. Often, I ended up browsing my phone until Rebecca interrupts to ask questions. I doubt whether this kind of discussion can really facilitate our learning. <br /><br />Apart from break-out room discussion, consultation is also not particularly meaningful. She won’t proofread your script/essay anyway. Without showing her what is written, it is difficult to ask specific questions and clear up your confusions. Discussing your concerns with your friends is sometimes more direct and helpful, IMO. <br /><br />Although discussion-based teaching might not be effective, you can still learn a lot from out-of-class work (refer to “Workload”).",
            "comment_grading": "Decent. Not even Chin lang could give me such a high grade.<br /><br />Rumor has it that Rebecca gives few A range grades. Never imagine she could have given me an A+. If I were in Collin's class, he would probably give me an A- only. You see, instead of Rebecca (master in chemistry), Collin (who teaches labu and knows little about chemistry) is the real killer. Better swap to Rebecca’s class if you are in Collin’s.<br /><br />FYI, my performance: <br />Speaking 1:&nbsp;&nbsp;5.5&nbsp;&nbsp;6&nbsp;&nbsp;5<br />Writing 1:&nbsp;&nbsp;6&nbsp;&nbsp;6&nbsp;&nbsp;6.5<br />Speaking 2:&nbsp;&nbsp;6&nbsp;&nbsp;5.5&nbsp;&nbsp;6<br />Writing 2:&nbsp;&nbsp;6.5&nbsp;&nbsp;6&nbsp;&nbsp;6.5<br />Participation: unknown (but likely to be full score)<br /><br />Letter grade: A+ (unexpected)<br /><br />Number itself is not that meaningful. She won't give you full score in any items anyway. However, quality of work matters. Uniqueness of topic and quality of argument basically define your grade. If your topic and argument are mediocre, even with superb English, you will still receive a shit grade (just like huma course term essay). To impress your instructor, you need to present him/her something fantastic and memorable. People are just too easy to get bored, isn't it?<br /><br />Remember, for advanced-level lang courses like this, being 1st in class will only guarantee you an A-. If you want something more than that, you need to differentiate yourself from 1st in class in the past – perform well in assessments, speak up constantly in class and respond critically to instructor's questions and classmates' comments, and write something meaningful in discussion forum. <br /><br />In short, leave your instructor a deep impression and persuade him/her you are good (just like what you do in an interview).",
            "comment_workload": "Workload ranges from medium to very high. <br /><br />Aside from assessments, there are a number of out-of-class works such as short video recording, short paragraph writing and Canvas discussion. You don’t need to spend much time on these if you just want a passing score. However, if you aim high, better treat every out-of-class work seriously. You will find Rebecca’s feedback constructive and inspiring which can help you better prepare for your assessment tasks.<br /><br />For example, it was not until Rebecca commented on my op-ed paragraph that I realized my argument does not hold water. I changed my stance and modified the structure of essay afterwards, and eventually do good in the final assessment. So, don’t be afraid of making mistakes, as long as you can realize and correct them later.<br /><br />IMO, main workload arises from self-education. Just imagine you are teaching someone on a topic that even you don’t have a full understanding. To avoid being conceptually wrong, you have to spend time researching on the background and technical details. Also, to lower the risk of being challenged, in your presentation/writing you need to be logically rigorous and avoid unjustified claims. Reading journals and research summaries might help, in this case. <br /><br />Before submission, better ask your friends who are not chemistry major to read through your script/article. Sometimes, they can spot out what you have overlooked.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QL2Wa0lrziNHiD8l7Z4wfeBFRo6sZPOa",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1049,
                    "name": "CHEUNG, Colin",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "綿綿頭上飛花",
            "date": "Sep 08, 2022",
            "title": "Instructor with NO chem bkgrd but think chem is SIMPLE",
            "comment_content": "Module 1<br />Unit 1: Introduction to science communication<br />Unit 2: Story-telling: spoken science communication<br />Unit 3: Story-telling: written science communication<br />Unit 4: Writing style for the public<br />Unit 5: Self reflection and learning review<br /><br />Module 2<br />Unit 6: Controversy and opinion in science<br />Unit 7: Science in the news<br />Unit 8: Critical reading and writing skills<br />Unit 9: TED talks: ideas worth spreading<br /><br />ME: How is story telling relevant to chemistry?<br />Colin: It is useful when you are being a sales or need to tell the public about chemistry.<br />Given that many of us will be working in the laboratory after graduation, I don't see any sense in learning story telling techniques and doing TED talks. But who even thought of knowledge gaining in LANG course?",
            "comment_teaching": "I have nothing to comment on his teaching because I was daydreaming most of the time.<br /><br />BUT, his comments on assessments are rather BULLSHIT. When you decided on your topic for the chemistry idea or chemistry controversy, he will literally ban ALL our ideas, with the comment: Your ideas are too simple, too general. Is not like something people with no chemistry background will know. Hello? What I purposed was Carbon Nanotube, are you sure you know what this is? And the suggestion he gave was talking about thing people don't know, like C60... Can't see such a HUGE difference with C60 and Carbon Nanotube.<br />And if you give an example which is too hard for him to understand, he will mark down your content marks with the reason: I cannot understand your topic.<br />Funny.<br /><br />Another thing is that he don't give feedback to you as he promised. He will just ban your idea during consultation sessions even when he promised he will give feedback on our topics before the consultation. And he doesn't reply emails, its such a joke that he said we can email him for questions.",
            "comment_grading": "His gradings are harsh.<br /><br />I got an average of 4/5 for both speaking 1 and writing 1. (Fyi I got an average of 5/6 in LANG2010).&nbsp;&nbsp;A few of my classmates got similar or even lower grade. There was no feedback on both writing 2 and speaking 2.<br /><br />I don't know if it is because I did good in writing 2 and speaking 2 (which I think smaller chance for this to happen) or is it because the curve was good, I got an A- eventually. All I can say is the results was good but the process was a torture, and all of us deserve a good grade from the CLE.",
            "comment_workload": "I had this course ONLINE.<br /><br />Assessment:<br />Speaking 1: Science communication blog video (2.5-3 mins) (20%)<br />Writing 1: Pop-science article: Tell the story of the development of a chemistry idea (500-700 words) (20%)<br />Speaking 2: TED-talk style talk on a chemistry controversy (5-7mins video)&nbsp;&nbsp;(25%) <br />Writing 2: Op-ed article on a chemistry controversy (1000-1200 words) (25%)<br />Participation: In-class discussion and out-of-class work (10%)<br /><br />There are those quizzes like LANG2010 counted toward participation. The workload is even higher than LANG2010 because you need to produce 2 videos which wasted a lot of my time towards the end of the semester. You need to think a lot to find a topic that matches the grading criteria which is often a concept that you are unfamiliar with.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}