{
    "error": false,
    "course": {
        "id": 1286,
        "subject": "LIFS",
        "code": "2220",
        "name": "Biochemistry II",
        "description": "Principles of bioenergetics and cellular structures; glycolysis, citric acid cycle, electron transport, oxidative phosphorylation and chemiosmosis; carbohydrate, lipid, amino acid and nucleotide metabolism; photosynthesis and nitrogen fixation.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2030,
            1930,
            1830,
            1730,
            1630,
            1530,
            1430
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"LIFS\" data-code=\"1902\" href=\"/review/LIFS1902\" target=\"_blank\">LIFS 1902</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.5,
        "rating_teaching": 4.44,
        "rating_grading": 4.38,
        "rating_workload": 4.13,
        "review_count": 16,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 490,
                "name": "KO, Robert Kam Ming",
                "count": 16
            }
        ]
    },
    "reviews": [
        {
            "hash": "YnmD8Yig5eyl6836DGufZ2BoX8G97ss9",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Paolo",
            "date": "Jun 05, 2019",
            "title": "Not as hard as one might think...",
            "comment_content": "CH1: Chemical Logic and Introduction to metabolism <br />CH2: Glycolysis<br />CH3: Krebs Cycle (aka. Citric Cycle or TCA Cycle)<br />CH4: Oxidative Phosphorylation and Oxygen<br />CH5: Pentose Phosphate Pathway<br />CH6: Carbohydrate Metabolism<br />•CH6.a: Gluconeogenesis<br />•CH6.b: Glycogen Metabolism<br /><br />CH7: Lipid Metabolism<br />•CH7.a: Fatty Acid Biosynthesis and Oxidation<br />•CH7.b: Membrane Lipids, Sphingolipids, Sphingolipids, Steroids, Isoprenoids, and Eicosanoid<br />CH8: Metabolism of Nitrogenous Compounds<br />CH9: Nucleotide Metabolism<br />CH10: Integration of Metabolism<br />CH11: Extracellular Chemical Signal<br /><br />Chapter 1 - 6 = Exam I (midterm)<br />Chapter 7 - 11 = Exam II (final)<br />Assignment = 300 word Essay on any topic related to the syllabus<br /><br />The Exams are all multiple choice + short answer questions. Though Professor Robert changed the Exam II format to True or False, so im not sure if he will stick to this in the future. But regardless they do not affect the difficulty too much.<br /><br />Professor Robert will almost all the time test you on information that was covered in the lecture powerpoint ONLY. <br /><br />Often times, he will discuss the medical issues related to each chapters. Thats mainly to aid you on your essay writing, as the role of the essay is to see how well you can discuss about what you learn form each chapter.",
            "comment_teaching": "Professor Robert's teaching is excellent. IDK what exactly to say. I quite enjoy his lectures.<br />He talks not too fast or not too slow. <br />He teaches with enthusiasm. <br />He is funny and makes jokes often.<br />He does his best to relate ecah chapter to our everyday life.<br /><br />Though occasionally, he spends too much time explaining some slides.<br /><br />Nevertheless, his lectures will make you understand the powerpoints better. I'd recommend you to attend the lectures, and if you miss his lectures, he uploads recorded lectures for you to play.",
            "comment_grading": "Grading of examinations are dependent on the normal distribution curve. Professor Robert hands out the grades very well, i believe 1 SD is enough for at least A-. <br /><br />For Exam I:<br />mean = 59.05<br />SD = 19<br />my marks = 79.5 (just 1 SD above mean)<br /><br />not sure about my Exam II or my essay marks, but i got a solid A in the end.",
            "comment_workload": "I'd say the workload is light, but thats mainly because im good at memorising facts, not to brag or anything. And yes, there are quite a lot of memorising for this course.<br /><br />You don't have to know the chemical formulae of each reactants and products, but you have to at least know their name, and the chemical logic for each reactions. <br /><br />You'll also have to know the enzymes that are the regulation points for each metabolic processes. You'll learn the ways of regulation in class, but there are substrates that regulate enzyme activity which are called allosteric effectors. Each regulatory enzymes have unique allosteric effectors, so you'll have to remember them all.<br /><br />As scary as this may seem, however they are not that difficult to understand. And if you understand them, these will make sense to you, and this will make memorisation less difficult.<br /><br />My advise to you is to NEVER leave your revision to the last minute. Allocate at least 2 weeks to review all your notes. <br /><br />Another advise is to study ACTIVELY, not passively. Since you will be dealing with lots of facts, you have to make sure it stays in your long term memory. How to do this is to KEEP testing yourself. After making your summary notes, divided into sections, cover a section and try to recall all the key points there. <br />Any point you fail to recall, take note of it so the next time you test yourself again, you're more likely to remember it.<br /><br />As for the 300 word Essay, its a piece of cake as long as you understand the necessary chapters, and you have at least 2 weeks to complete it.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BmDrcf1djUbxJtDQI2klT22nrTbbScSu",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
            "date": "Jun 16, 2023",
            "title": "",
            "comment_content": "The main topics covered include:<br /><br />1.\tGlycolysis<br />2.\tTricarboxylic Acid Cycle<br />3.\tOxidative Phosphorylation<br />4.\tPentose Phosphate Pathway<br />5.\tGluconeogenesis<br />6.\tGlycogenesis &amp; Glycogenolysis<br />=== Exam 1 ===<br /><br />7.\tLipogenesis &amp; Lipolysis<br />8.\tAmino Acid Metabolism<br />9.\tNucleotide Metabolism<br />10.\tBasic Cell Signalling<br />=== Exam 2 ===<br /><br /><br />The examinations are not cumulative, but some questions in Exam 2 would require knowledge from Exam 1. Hence, it would better if you can review some key concepts regarding carbohydrate metabolism prior to Exam 2. The contents are not too difficult to understand per se, but it definitely takes time to remember all the individual biochemical processes.<br /><br />I personally do not find the course contents interesting, nor do I consider them particularly “useful” for future studies, unless you are deeply captivated by metabolic systems.",
            "comment_teaching": "I did not attend any of the lectures after the first 2. However, since all lecture videos are provided, I did watch most of them before the examinations.<br /><br />Like most other comments, I think Professor Ko’s explanations are clear, but honestly too slow – so slow that you would have already forgotten what the last point was about upon hearing the next. Whilst this would be OK for other courses where contents between each segment may not be too closely linked, it is definitely a hurdle for this specific course, since it requires students to understand a metabolic pathway holistically from its constituent reactions.<br /><br />Since Professor Ko spoke very slowly, watching the lecture videos at 2-times speed is tolerable.",
            "comment_grading": "Total score calculation:<br />(Fraction of Exam 1 Score) * 45 + (Fraction of Exam 2 Score) * 45 + (Essay Score)<br /><br />Statistics of each part:<br />(Full | LQ | Mean | Median | UQ | High | SD)<br />Exam 1:\t(69 | 32 | 43 | 43 | 53 | 69 | 12.74)<br />Exam 2:\t(83†| 34 | 46 | 47 | 59 | 80 | 15.63)<br />Essay:\t(10 | 6 | 7 | 7 | 7 | 10 | 0.89)<br />Total:‡\t(100 | 47 | 60 | 59 | 73 | 95 | 16.15)<br />[All values except SD are rounded to the nearest integer;<br />SD is corrected to the 2 significant figures.]<br /><br />† I forgot the exact full score for Exam 2, and I was not free for its paper-checking session. I heard that the full score is 83, but I cannot verify this claim.<br />‡ Since all scores are released centrally via the Canvas announcement system, I have computed the canonical statistics via Excel, under the assumption that the full score of Exam 2 is 83. A bimodal distribution can be observed from the total score distribution.<br /><br />My scores: {66 / 72 / 9} → A+<br /><br /><br />Not sure about the overall grading, so I will put a “B” here.<br /><br />I would suggest putting some efforts into the essay even though it only contributes 10% towards the course grade. One reason for this is that an acquaintance of mine, who initially ranked highly in class, experienced a significant drop in rank due to subpar essay scores. I presume Professor Ko would be more thrilled to mark essay topics that interest him, or are related to his field of research.<br /><br />P.S. The topic I wrote was not taught in class. You can basically write whatever you like as long as it is related to the course content (at least for this year), in addition to the topics provided.",
            "comment_workload": "There is not much actual workload aside from the 300-word essay, which can be finished within a few hours.<br /><br />As for the revision, looking through all metabolic pathways at once is definitely intimidating, but since Professor Ko would not ask about the exact mechanistic details of each biochemical reaction, rote memorisation is not that necessary, unlike some other courses (*cough* Organic Chemistry I and II *cough*).<br /><br />Still, you would need to remember the names of important enzymes, allosteric effectors, and covalent modifications. If you are taking this course together or after LIFS 2040, you should be familiar with most of these regulatory mechanisms (e.g., phosphorylation and dephosphorylation). Particularly, most of the pathways learnt in this course are actually regulated by feedback controls, so additional memorisation of allosteric effectors is usually not necessary as long as you know what the downstream products are.<br /><br />I would suggest spending around a week of time reviewing the lecture videos, and piecing all individual reactions together into a single summary afterwards for easier revision. Since learning how individual metabolic pathways cooperate to yield specific physiological responses is the ultimate goal of this course, I believe making a concise overall summary of all biochemical reactions taught would help.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QppG4ohnNkcHgBza8XPm2morTV5X7pjQ",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sonic12",
            "date": "May 31, 2022",
            "title": "Review of LIFS2220",
            "comment_content": "Ch1 Energetics of Life<br />Ch2 Introduction to Metabolism<br />Ch3 Glycolysis<br />Ch4 Citric Acid Cycle<br />Ch5 Electron Transport Oxidative Phosphorylation &amp; Oxygen<br />Ch6 Pentose Phosphate Pathway, Gluconeogenesis, Glycogen Metabolism<br />Ch7 Lipid Metabolism<br />Ch8 Metabolism of Nitrogenous compounds<br />Ch9 Nucleotide Metabolism<br />Ch10 Integration of Metabolism<br />Ch11 Extracellular Chemical Signals<br /><br />All sorts of biochemical pathways. Quite a lot but typical coverage for biochem II course.",
            "comment_teaching": "This semester was an online semester, and somehow the lecture's pace was super fast. Even the professor didn't understand why the whole lecture ended earlier than expected.<br /><br />The teaching was ok. However, the pace was too fast so it was a bit hard to catch up while revising at the same time.<br /><br />The professor calibrates lecture time super accurately when he says 5 min, it is exactly 5 min. The lecture time is 1hr 20min but the professor sometimes ends the lecture earlier depending on which content is covered that day. He usually gives us 5min break during the lecture to rest our brain cells.<br /><br />Overall, decent teaching and time arrangement is quite flexible and reasonable.",
            "comment_grading": "Online semester<br /><br />-- Essay(10%) --<br />Write a 300-word essay about a biochemistry topic. The topics will be provided by the professor.<br /><br />Spend one day on an essay should be enough<br /><br />-- Final Exam (90%) --<br />The midterm was canceled because of the pandemic situation, so the final exam was super important. <br />All T/F questions. You need to understand concepts thoroughly to answer them correctly.<br /><br />mean: 119&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;sd: 13.33<br />High: 148&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Low: 81<br /><br />-- My score --<br />Essay: 15/20<br />Final: 142/154<br /><br />Overall: A+",
            "comment_workload": "This course covers all sorts of biochemical pathways. That means you have whole sets of enzymes, substrates, cofactors, etc. to recite. <br /><br />You need to revise it daily or you'll end up forgetting things as the course covers so many things. I suggest that if you are not good at memorizing things and not diligent enough, don't take this course. It is quite arduous to spend a lot of time understanding and remembering things.<br /><br />Of course, this is a science course, so requires an understanding of concepts as well but you need to remember many things to do well in this course.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "3VOQyj25yNo0ngVmBqMP0dzbvKAH0DCJ",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ym7135",
            "date": "Jul 17, 2017",
            "title": "",
            "comment_content": "I would say this course has a lot more content than a lot of Life Science courses, but it is definitely the highlight for anyone doing the BCB Major. In my semester the order of topics were:<br />1) Energetics and basics of biochemistry<br />2) Glycolysis <br />3) Citric Acid Cycle<br />4) ETC <br />5) Pentose Phosphate Pathway <br />6) Gluconeogenesis and Glycogen metabolism <br />7) Lipid metabolism <br />8) Nitrogenous compounds <br />9) Nucleotide metabolism <br />10) Integration of metabolism <br />11) Extracellular regulation (aka signalling) <br /><br />Each topic can go in a lot of depth, but what is good about this course is that you ONLY focus on what the professor has mentioned in the lecture (there is NOTHING in the exam which requires outside reading), and definitely focus on what the professor keeps emphasising and repeating.",
            "comment_teaching": "A majority of the course was taught by Robert Ko (except lipid metabolism), and honestly one of the best professors in Life Science. He teaches with a lot of enthusiasm and passion, explains the powerpoint in great detail, and he relates a lot of the knowledge to a wider perspective like weight loss, exercise, and diseases. The guest professor for lipid metabolism is quite similar, but he only teaches 3 lectures. <br /><br />Exam-wise, whatever both professors mention in class is more than enough for exam revision, so I suggest reviewing all the lectures either by being present or watching it in Canvas. If they repeat certain concepts a couple of times in class this concept is for sure going to be examined.",
            "comment_grading": "There are two exams (not really classified mid term and final), both being 45%, the first one covers 1) - 6) from above, the second exam is the rest (but 7) - 11) highly depends on 1) - 6) so I do suggest going over it briefly for Exam II). <br /><br />Each exam is about 60% MCQ (regular), 20% with the more than one answered MCQ and 20% with essay questions. But very honestly the exams are SIMPLE QUESTIONS TO VERY COMPLEX CONCEPTS - basically if you understand and memorize the lecture materials properly the questions are quite simple. <br /><br />There is also a 300 Word Assignment worth 10%, you choose your topic from a list of 6-7 assigned to the class. This is given towards the end.",
            "comment_workload": "This course is mainly understanding the concepts and preparing for exams; there are a lot of materials to go over. <br /><br />If you want to be time effective and get a good grade, my biggest advice is don't read the textbook - it goes over too much that is not required, a lot of stuff that is required is not present in textbook. Take detailed notes from the lecture and study that. <br /><br />The assignment will take no longer than a day to research and complete.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9YoUwGNhghp8fMJT5t0aULfluHVh48nA",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mikeset",
            "date": "Jun 25, 2017",
            "title": "",
            "comment_content": "The content isn't that difficult, it is just that there are lots of concepts to memorize from, not necessarily understanding. The contents of the course are simple and give a basic knowledge of carbohydrates, nitrogenous compounds, and lipids.",
            "comment_teaching": "Explains every single powerpoint slide with great detail and gives out additional information that can be applied in our daily life. He introduces other Life Science teacher to teach part of syllabus where he thinks they will explain the syllabus in a better way than he will, so I think this will be beneficial for us. <br />Skipping a few classes may not be a problem as the lectures are uploaded in Canvas.",
            "comment_grading": "45% Exam I<br />45% Exam 2<br />10% Short Essay<br /><br />The exam wasn't too hard that you cannot do, but some parts of the Exam II comes from Exam I even though it is not cumulative. Be sure to read some chapters before the midterm for the Exam II (Finals).",
            "comment_workload": "It is a very easy going course, you just need to review every week and I think it should be fine. As there are no assignments, this course is easy to handle. The essays will be given at the end of the course when you are done with the syllabus, just make sure to choose the right topic.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aPgU8U4vc5d5lvyaFuGgmt6VaggpZilE",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Chris K",
            "date": "Jun 04, 2016",
            "title": "Just some info about this course",
            "comment_content": "See the attachment :)",
            "comment_teaching": "Prof. Ko teaches with passion and interest, so he sometimes talks some topics that are not included in the syllabus or exam. But he tells the students that which type of information will not be on the exam which is very helpful.<br />His powerpoints are very concise and short with quite a lot of diagrams, so it is recommended to watch the lecture video or attend the lecture. Also, professor asks students to understand not memorize, but personally I think it requires memorization. It is impossible to memorize the whole metabolism of molecules, but some names are important in the exam.<br />His accents are sometimes quite hard to understand but acceptable. He uploaded all the lectures in my semester, but understanding what professor is saying through the video is harder than actually going to the lecture due to background noise.",
            "comment_grading": "I personally think the exam itself is not that hard, but quite confusing with a lot of questions. Exams consist of both MC and short answer questions, but I personally found hard to get full marks in the short answer questions. It you actually spend some time studying this course, it is quite easy to get within mean+-sd range.",
            "comment_workload": "The grading is based on one essay and two exams. The length of the essay is only 300 words, so it is not that big of a deal.<br />For exams, there are a lot of metabolism for different substances like carbohydraets, proteins etc... I think finiding out the keypoint or crucial info is very important for this course because it is impossible to memorize everything. <br />Overall, workload for this course is mainly preparation for exams.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "i7EIVGHili3KOZMpQUz7AzWPOLkOIvbo",
                    "name": "LIFS2220_Syllabus_1516",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "P5hxLcqo1iEqJtoKdTnCUMTjPbyngyYT",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Noyonika",
            "date": "Aug 21, 2023",
            "title": "Did this course without doing Biochem 1 first",
            "comment_content": "The course content was quite tricky, the pathways are super detailed and can take a really long time to memorize. They are topics you might have briefly touched upon prior to the course but can expect to learn in much more detail in this course.",
            "comment_teaching": "Professor Ko is very enthusiastic about the subject and often touches upon interesting and relevant topics which are outside the syllabus. His straightforward explanations can make a seemingly intimidating concept very easy to understand.",
            "comment_grading": "The grading is quite good. Around 30% of the class gets an A grade.",
            "comment_workload": "There is barely any workload. The only assignment is to write a 300-word short essay based on a topic in biochemistry, which is due at the end of the semester. Other than that, only revision for midterm and finals is required.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "038IF04VXsjc0u2rukmD1eAVIlyP9lfi",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "我的小狗",
            "date": "Jul 06, 2023",
            "title": "Better than expected",
            "comment_content": "1. Energetics of Life<br />2. Introduction to Metabolism<br />3. Glycolysis<br />4. Citric Acid Cycle<br />5. Oxidative Phosphorylation<br />6. Pentose Phosphate Pathway<br />7. Gluconeogenesis<br />8. Glycogen Metabolism<br /><br />===== Midterm =====<br /><br />9. Lipid Metabolism<br />10. Metabolism of Nitrogenous Compounds<br />11. Nucleotide Metabolism<br />12. Integration of Metabolism<br />13. Extracellular Chemical Signals<br /><br />===== Final =====",
            "comment_teaching": "Prof. Robert Ko is very enthusiastic when teaching this course, especially since he has been teaching for decades! He is one of the best LIFS professor which taught me.<br /><br />His lectures may get boring over time and you may get sleepy after attending his lectures but his notes are kind of sufficient for the exams. I did not attend his lectures after the first one but he posts recordings which you could watch anytime. There is no attendance so don't worry about skipping class :). He explains every pathway slowly so that you could understand it easier and he also has some slides which are not tested in the exam but allows us to understand the biochemical processes which are happening in our daily lives.",
            "comment_grading": "Midterm: 45%<br />Final: 45%<br />Take Home Essay: 10%<br /><br />I was surprised with my grade.<br />My Midterm: 52/69<br />My Final: 57/80<br />Take Home Essay: 7/10<br />Stats of the exams and essay could be viewed at other reviews for 2022-23 Spring.<br /><br />Final Grade: A-<br /><br />I was definitely not expecting A range but thank you Prof. Robert Ko!",
            "comment_workload": "Just 2 exams and 1 300-word essay.<br /><br />The workload may look light but the contents of the exam may be overwhelming so you may need to put more time into this course to memorize the names of the substrates, enzymes and coenzymes as well as understanding and relating the different pathways together.<br /><br />Need to put it in extra effort to get A range.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rY8Ny4asfQ0iwl3RmPBZsuYHdj39BEiP",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ggg_",
            "date": "Jun 16, 2023",
            "title": "Biochemistry II",
            "comment_content": "Basic biochemistry pathways as listed below:<br />Energetics of Life<br />Introduction to Metabolism <br />Glycolysis<br />Citric Acid Cycle\t<br />Electron Transport &amp; Oxidative Phosphorylation<br />Pentose Phosphate Pathway<br />Gluconeogenesis<br />Glycogen Metabolism<br />---------------------- midterm ------------------------------<br />Lipid Metabolism&nbsp;&nbsp;<br />Metabolism of Nitrogenous Compounds\t\t<br />Nucleotide Metabolism<br />Integration and Control of Metabolic Processes<br />Integration of Metabolism<br />Extracellular Chemical Signals<br />------------------------ final -------------------------------",
            "comment_teaching": "Honestly I don't like Robert KO's teaching style... For me, he speaks too slowly that makes me sleepy and hard to concentrate, and his explanation of the slides doesn't make the structure and relationship between different parts very clear. To have a more systematic point of view, I would recommend reading the textbook. However, as the opposite extreme, the textbook contains way too many details, which causes difficulty in grasping the key points. Therefore, a combined approach would be to attend the lecture and get a brief idea about what you should know, read the textbook to understand it better, and return to the concise slides before exams.<br />There are nonetheless some good things about his teaching. He usually combines the abstract pathways with some daily life experience, which helps with understanding the concepts. He also provides practice questions and tutorial questions, which is helpful for revision before the exams. However, some of the things covered in tutorial questions seem to be not appearing in the lecture notes, which is a bit confusing.",
            "comment_grading": "I think this course is known for relatively good grades (but maybe not that good as biochemistry I? not sure...)<br />45% midterm (first half)<br />45% final (non-cumulative)<br />10% short essay with a topic on metabolism-related issues in lifestyle, health, and diseases (300 words)<br />The topic of the short essay is briefly covered in class, but some extra reading may be needed.<br />The exam is composed of MCs that are 1 point each, MC that are 2 points each, and some T/F statements that are 1 point each. Some of the exam questions is very similar or the same as the review questions.<br />Me: <br />midterm: 66/69, Mean: 43.07, SD: 12.30, High: 69<br />final: 74/89? (forgot the full mark) Mean: 7.02, SD: 0.90<br />short essay: 9/10, Mean: 7.02, SD: 0.90<br />A+",
            "comment_workload": "It's better to start the revision 1 week before the exam, as there are quite some reactions and pathways to remember. You don't need to remember the chemical reaction formula, but you need to know the flow of the pathway, its purpose and function, the substrate, product, some important enzyme, regulatory point, allosteric regulators, etc. Familiarizing yourself with the contents by attending the lectures and reading the textbook may be good. Understanding a bit of the underlying chemistry mechanism may help with your memorization. It's also useful to write and draw the pathways down in your own way and making comparisons. I would say the workload is not too high.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rcCqoIiIQY3IY9bjNnExbX5vRmK9X3Nm",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Frankie:)",
            "date": "Jun 08, 2022",
            "title": "Good and lenient Grading",
            "comment_content": "Carbohydrate Metabolism I<br />1. Glycolysis<br />2. Citric Acid Cycle​<br />3. Electron Transport<br />4. Oxidative Phosphorylation<br /><br />Carbohydrate Metabolism II<br />1. Pentose Phosphate Pathway<br />2. Gluconeogenesis<br />3. Glycogen Metabolism<br />&nbsp;&nbsp;<br />Lipid Metabolism:<br />1. Fatty acid Oxidation and Biosynthesis<br />2. Metabolism of Glycerophospholipids<br />Eicosanoids<br /><br />Metabolism of Nitrogenous Compounds​:<br />1. Nucleotide Metabolism<br /><br />Integration and Control of Metabolic Processes:<br />1. Interdependence of Major Organs in Fuel Metabolism<br />2. Hormonal Regulation of Fuel Metabolism<br />3. Extracellular Signalling<br /><br />1 Final exam(no midterm) covers all topics above",
            "comment_teaching": "Good, Professor teaches in a slow-paced manner",
            "comment_grading": "Good and lenient<br /><br />My Score:<br /><br />Final Exam(90%): 148/154 <br />Mean:119.4 SD: 13.3 Highest:148 Lowest:88<br /><br />Essay(10%): 19/20 <br />Mean:N/A(Majority get 15 or above) Highest:20<br /><br />Letter Grade: A+<br /><br />The final exam of this semester consists of 154 T/F, no MCQ no short or long Questions.<br /><br />The arrangement for the final exam for this semester was due to the upsurge of COVID-19 cases. Otherwise, there will be midterm and final exam in MCQ format.",
            "comment_workload": "Light to moderate.<br /><br />Only need to revise a week before the final",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fTfUpQt4NXct1gUn3sxtt6Z8pRQ8FMYg",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "letmegohome",
            "date": "Jun 03, 2022",
            "title": "Good teaching, but takes time to digest",
            "comment_content": "Carbohydrate Metabolism I<br />1. Glycolysis<br />2. Citric Acid Cycle​<br />3. Electron Transport<br />4. Oxidative Phosphorylation<br /><br />Carbohydrate Metabolism II<br />1. Pentose Phosphate Pathway<br />2. Gluconeogenesis<br />3. Glycogen Metabolism<br />&nbsp;&nbsp;<br />Lipid Metabolism:<br />1. Fatty acid Oxidation and Biosynthesis<br />2. Metabolism of Glycerophospholipids<br />Eicosanoids<br /><br />Metabolism of Nitrogenous Compounds​:<br />1. Nucleotide Metabolism<br /><br />Integration and Control of Metabolic Processes:<br />1. Interdependence of Major Organs in Fuel Metabolism<br />2. Hormonal Regulation of Fuel Metabolism<br />3. Extracellular Signalling<br />A lot harder than 2210",
            "comment_teaching": "Professor speaks slowly. On the one hand it's a good thing bc you could catch everything easily; on the other hand it's a bit easy to fall asleep <br />However the content is still very well-organized, and the teaching is absolutely fine",
            "comment_grading": "Can check others' review for the scheme.<br />I got 133/154 for final and 17/20 for the essay<br />Eventually got an A, which is completely out of my expectation, as I was expecting an A-<br />Very good grading course<br />My friend ranked 10th in the class and got A+",
            "comment_workload": "Definitely not light.<br />A lot to digest",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TJpbKumSELonmKJIh88bQa0VKLbZv9Zm",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Leon2002",
            "date": "Jun 01, 2022",
            "title": "Understand the functions of enzymes and the purpose of the chemical pathway .",
            "comment_content": "Carbohydrate Metabolism I<br />1. Glycolysis<br />2. Citric Acid Cycle​<br />3. Electron Transport<br />4. Oxidative Phosphorylation<br /><br /> Carbohydrate Metabolism II<br />1. Pentose Phosphate Pathway<br />2. Gluconeogenesis<br />3. Glycogen Metabolism<br />&nbsp;&nbsp;<br />Lipid Metabolism:<br />1. Fatty acid Oxidation and Biosynthesis<br />2. Metabolism of Glycerophospholipids<br />Eicosanoids<br /><br />Metabolism of Nitrogenous Compounds​:<br />1. Nucleotide Metabolism<br /> <br />Integration and Control of Metabolic Processes:<br />1. Interdependence of Major Organs in Fuel Metabolism<br />2. Hormonal Regulation of Fuel Metabolism<br />3. Extracellular Signalling",
            "comment_teaching": "Ko’s teaching is slow and he reads out the PowerPoints. But he speaks clearly and answer questions during breaks or after class if there is time.<br /><br />His notes are also succinct and understandable. He also released ” Q and A” word documents for each chapters and two PowerPoint quizzes. You may use them as study tools.<br />There is also a review session at the end of the semester where he gives a quick summary of every content taught in the past 3 and a half months. You can also ask questions there and clear you misunderstanding just before the final exam",
            "comment_grading": "Exams: 90%<br />Short essay: 10%<br /><br />I only have final exams this semester and all questions are T/F and very straightforward. But the hard part is determining the final products of the lipid degradation. I did not study well at that part and did miserably in predicting the resulting number of acetyl and fats.<br />So be sure to understand the process of lipid degradation and other chemical pathways as well.<br /><br />Final exam: 117/154<br />Short essay: 19/20<br />Final Grade: B",
            "comment_workload": "The 300-word short essay can be done in a day and the topics are related to the lectures. (Tip: choose one that you are interested)<br /><br />The final exam is straightforward but&nbsp;&nbsp;you have to understand and memorise every concepts and the chemical pathway.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ogE9ALp69wYcA2y9brwwkgtE06ZNWaZ7",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KIKC",
            "date": "Jan 25, 2021",
            "title": "",
            "comment_content": "ONLY BISC AND BCB students need to study this course in year 2 spring semester. BIOT students do not need to study it.<br /><br />The content of this course:<br />Chemical Logic and Introduction to metabolism <br />Glycolysis<br />Krebs Cycle <br />Oxidative Phosphorylation and Oxygen<br />Pentose Phosphate Pathway<br />Gluconeogenesis and Glycogen Metabolism<br />Lipid Metabolism<br />Metabolism of Nitrogenous Compounds<br />Nucleotide Metabolism<br />Integration of Metabolism<br />Extracellular Chemical Signal",
            "comment_teaching": "Overall, professor' teaching is quite good. He did not speak fast and it was very easy to follow. He explained all the concepts and mechanisms clearly. He also answered all questions which came from students. Feel free to ask him if you have any questions. However, his notes were too detailed so you may need a lot of time to study it.",
            "comment_grading": "10% short essay<br />90% final<br /><br />The format of final is T/F in this semester.<br />My final: above mean 1 mark<br />My short essay: unknown<br />Final grade: C+<br /><br />The final is the most IMPORTANT, it contribute your final grade 90%! The mean is C+ and the SD of the final is small.",
            "comment_workload": "The workload is quite low. There are only one short essay (about 300 words) and one final. Since there are not any midterm, the content you need to revise for the final are quite huge. You need to study it as early as possible.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eJR9JWsFw06fqrnOtm7AKzm5yNO9T6qJ",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YAYAYA",
            "date": "Aug 19, 2019",
            "title": "",
            "comment_content": "Basically, you have to remember a lot of mechanisms and components in the metabolism pathways. Be prepared that all these can be quite boring and confusing. So don't start your revision a few days before the exams. <br /><br />In fact, as an intermediate course in Life Science, knowing these content can help you perform better in the advanced courses and research projects.",
            "comment_teaching": "Prof. Ko is teaching quite well, and the powerpoints are written in details.",
            "comment_grading": "I didn't get a good grade, and I attributed that to my own laziness. Again, don't start your revision just a few days before the exams.",
            "comment_workload": "I just remembered the MC Questions in the exam...",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jE61sHCRZar9P0s6x6Ar9XSrndOKVjcT",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Leoa",
            "date": "Aug 17, 2017",
            "title": "The best course I have even taken",
            "comment_content": "教下kreb cycle, glycolysis, glucogenesis, fat synthesis, oxidative phosphorylation, purine and pyrimidine base的breakdwon.... 中學果時學大致咁學過，但呢個course當然教得深入好多，每個step既compound同enzyme都要記到好熟, 主要都係背野，concept唔難，肯溫就得。<br />可以睇番lecture video",
            "comment_teaching": "Prof. Ko 係我暫時讀過既course最好既prof. D notes整得好清楚明白，亦會講多好多notes無既野，上佢堂唔會覺得眼訓，好樂意答學生問題，超nice。因為係香港人，所以佢D英文我聴得好舒服。<br />教fat果幾堂請左個退休教授尼教，但個人認為教得麻麻地，但教既野幾得意。",
            "comment_grading": "係我expect之內，20% A range。之前佢話如果overall無40%既分數會F,但其實差少少拎到40%都唔會F。<br />個人認為final考得比midterm難，both exams都有mcq and long question, 仲有一part mcq 係幾個choices都岩，要好熟D concepts。",
            "comment_workload": "1Midterm，1Final，1Assignment (幾條唔同既題目中簡一條，寫下對果條問題既睇法同建議）",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6eZjCIG0iycTVsDP9xK2JmhqVlHcDZSp",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 490,
                    "name": "KO, Robert Kam Ming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Shin, Woo-hong",
            "date": "May 31, 2023",
            "title": "worthy course",
            "comment_content": "Session 1 Energetics&nbsp;&nbsp;of Life <br />Session 2 Introduction to Metabolism <br />Session 3 Glycolysis <br />Session 4 Citric Acid Cycle <br />Session 5 Electron Transport Oxidative Phosphorylation <br />Session 6 Pentose Phosphate Pathway <br />Session 7 Gluconeogenesis <br />Session 8 Glycogen metabolism <br />Session 9 Lipid Metabolism <br />Session 10 Metabolism of Nitrogenous Compounds <br />Session 11 Nucleotide Metabolism <br />Session 12 Integration of Metabolism <br />Session 13 Extracellular Chemical Signals <br /><br />General metabolic pathways &amp; related diseases<br />You better buy the textbook if you want to learn more detailed content. (helped me a lot)<br />Fruitful contents.",
            "comment_teaching": "I believe he is one of the best professors in the LIFS department. His ppt is very organized and he teaches in a slow-paced manner. <br />So, I highly recommend you to take his lecture and ask questions.",
            "comment_grading": "Midterm 45%: 56/69 (1.2 sd above)<br />Final 45%: 72/80 (2 sd above)<br />Take Home Essay 10% 7/10 (not sure) <br /><br />Prof. Robert Ko is a friendly professor, the exams were straightforward.<br /><br />Letter Grade: A",
            "comment_workload": "2 exams with one take-home essay. <br />It looks light but contains pretty heavy contents, if you want to get a good mark you need to study hard.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}