{
    "error": false,
    "course": {
        "id": 3542,
        "subject": "MARK",
        "code": "4290H",
        "name": "Judgment and Decision Making for Marketers",
        "description": "This course covers both normative and psychological aspects of decision making with specific reference to marketing and consumer decisions. The course will introduce the building blocks of decision making such as belief and utility assessment and will contrast the economic models of decision making with psychological models that take into account various biases in judgments and choices. The course will also introduce experimental design and analysis relevant for marketing decisions and will discuss the marketing applications of behavioral decision research.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2210,
            2110
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MARK\" data-code=\"2120\" href=\"/review/MARK2120\" target=\"_blank\">MARK 2120</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4,
        "rating_teaching": 4,
        "rating_grading": 5,
        "rating_workload": 4.5,
        "review_count": 2,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 509,
                "name": "MUTHUKRISHNAN, Anaimalai V",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "FWnXuBpETPUT9rseKbI2rTeXjvpM4DJF",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 509,
                    "name": "MUTHUKRISHNAN, Anaimalai V",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "noidealol",
            "date": "Jan 31, 2023",
            "title": "",
            "comment_content": "- Introduction&nbsp;&nbsp;<br />-Decision Making via Experiments: Experimental Methods in Psychology &amp; Business&nbsp;&nbsp;&nbsp;<br />-Analysis of Variance – A simple case&nbsp;&nbsp;<br />-Analysis of Variance –Factorial Designs, Interactions, and other topics <br />-Consumer Decision Making - An Overview <br />-Decisions Involving Multiple Objectives- Normative&nbsp;&nbsp;<br />-How People Make Decisions Involving Multiple Objectives&nbsp;&nbsp;<br />- Subjective Probability <br /> - Decision Making under Uncertainty I&nbsp;&nbsp;<br />-Decision Making under Uncertainty II – Prospect Theory&nbsp;&nbsp;<br /> -Decision Making under Uncertainty III – Single &amp; Multi attribute Utility Elicitation and Evaluation&nbsp;&nbsp;<br /> -Biases in Probability Assessment&nbsp;&nbsp;<br />-Decision Trees and Roll Back Method <br />-Revising Judgments Based on Additional Information I – Value of Perfect Information <br /> -Revising Judgments Based on Additional Information II– Value of Imperfect Information <br /> -Behavioral Decision Theory Findings in Marketing <br /><br />It involves many calculation although it's a mark course, but most of them are something that we've learnt before.",
            "comment_teaching": "I personally found his accent a bit difficult to understand. He made use of notes on word documents (instead of ppt) during lectures,&nbsp;&nbsp;and some questions on the textbook. I think textbook is useful for learning the concepts.",
            "comment_grading": "Quiz I – 20% <br /> <br /> Quiz II – 20% <br /> <br /> Quiz III - 25% <br /> <br /> Group Presentation – 20% <br /> <br />&nbsp;&nbsp;Project – 10% <br /> <br />Class Participation – 5%. <br />&nbsp;&nbsp;<br />Additional Activity (Marketing Experiments) – 2% <br /><br />I had no idea how he graded on the group presentation and project because the marks of highest and lowest in class were very close, so work hard on quiz.",
            "comment_workload": "Each quiz is about 2 hours so it's quite chur. But practicing the questions on textbook would be enough. <br /><br />There are two group projects so make sure not to miss the deadline.For the 20% group presentation, just follow the guidelines. For the 10% project, prof did not provide much guidelines so we had to figure it out by ourselves.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ubQb1pz99Ifse9D4G9EauYAJylrGiHoj",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "hopexmoon",
            "date": "Jan 04, 2022",
            "title": "Easy if you are good at/like isom2500",
            "comment_content": "Introduction<br />Decision Making via Experiments: Experimental Methods in Psychology &amp; Business<br />Analysis of Variance – A simple case<br />Analysis of Variance –Factorial Designs, Interactions, and other topics<br />Consumer Decision Making - An Overview<br />Decisions Involving Multiple Objectives- Normative<br />How People Make Decisions Involving Multiple Objectives<br />Subjective Probability<br />Decision Making under Uncertainty I<br />Decision Making under Uncertainty II – Prospect Theory<br />Decision Making under Uncertainty III – Single &amp; Multi attribute Utility Elicitation and Evaluation Biases in Probability Assessment<br />Decision Trees and Roll Back Method<br />Revising Judgments Based on Additional Information I – Value of Perfect Information<br />Revising Judgments Based on Additional Information II– Value of Imperfect Information Behavioral Decision Theory Findings in Marketing<br /><br />Many calculations but actually similar with the basic stuff taught in isom2500 (ANOVA, probability). Most of the chapters just have calculation problems, but they are not too hard, just memorize formula then you will be fine. While a few other chapters require memorization, but they are about some psychological theories so it is quite interesting.",
            "comment_teaching": "Prof has an Indian accent. Some may find it difficult to understand. He also teach on notes and textbook questions in class (but not ppt) and never turned on the projector in class. So sometimes we are quite lost where he is talking about lol. But overall he teaches well, and you can always read the textbook yourself when you don't understand.",
            "comment_grading": "Quiz I – 20%<br />Quiz II – 20%<br />Quiz III - 25%<br />Group Presentation – 15%<br />Project – 15%<br />Class Participation – 5% (those who do not attend the class face-to-face should contact me for an alternative assignment).<br />Additional Activity (Marketing Experiments) – 2%<br /><br />all quizzes above mean <br />no idea on presentation and project <br />got A range",
            "comment_workload": "3 quizzes throughout the semester<br />1 group presentation (15 min, just analyse an article assigned and present the findings and implications)<br />1 project (5-8 page write-up, only prepare simple questionnaire)<br /><br />Overall, I think it is just a normal 3-cred course workload. I believe it is a relatively-light workload MARK course.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        }
    ],
    "composer": []
}