{
    "error": false,
    "course": {
        "id": 846,
        "subject": "MARK",
        "code": "3220",
        "name": "Marketing Research",
        "description": "Basic research tools and procedures used in marketing research, and strategic uses of marketing research information in managerial decision making.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610,
            1510,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MARK\" data-code=\"2120\" href=\"/review/MARK2120\" target=\"_blank\">MARK 2120</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.15,
        "rating_teaching": 3.56,
        "rating_grading": 3.93,
        "rating_workload": 3.34,
        "review_count": 41,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1249,
                "name": "LIU, Jia",
                "count": 10
            },
            {
                "id": 773,
                "name": "LIN, Song",
                "count": 8
            },
            {
                "id": 506,
                "name": "VAN DER LANS, Ralf",
                "count": 6
            },
            {
                "id": 507,
                "name": "SALVACRUZ, Joseph",
                "count": 6
            },
            {
                "id": 514,
                "name": "WANG, Wenbo",
                "count": 3
            },
            {
                "id": 900,
                "name": "LEE, Bernard",
                "count": 3
            },
            {
                "id": 1382,
                "name": "SHI, Mengze",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "2OmroXrMhNYWVV0hkGzNMlH8AmsIF5Ia",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1249,
                    "name": "LIU, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jasmine_bb",
            "date": "Aug 08, 2022",
            "title": "Fair 4 credits course",
            "comment_content": "Introduction<br />Marketing Research Process<br />Research Design I: Exploratory Research<br />Research Design II: Descriptive &amp; Causal Research <br />Data Collection I: Measurements<br />Data Collection II: Questionnaire Design<br />Data Collection III: Sampling<br />Data Analysis I: Preliminary Steps<br />Data Analysis II: Descriptive Analysis<br />Data Analysis III: Hypothesis Testing (Part 1)<br />Data Analysis IV: Hypothesis Testing (Part 2) <br />Data Analysis V: Regression Analysis (Part 1)<br />Data Analysis VI: Regression Analysis (Part 2) <br />Special Topic: Conjoint Analysis<br />Reporting Research <br />Synthesis",
            "comment_teaching": "Jia introduced some most updated marketing trend towards the end of the course such as DOOH, they were interesting. But then sometimes her teaching was unclear. As the lessons were conducted online, it was hard to explain concepts, but Jia tried her best. Overall, a good and helpful teacher.",
            "comment_grading": "Quizzes – Best two out of three 40<br />Individual Assignment 5<br />Class Participation 8<br />Marketing Experiment 2<br />Group Project 45<br />• Research proposal (10)<br />• Exploratory research (10)<br />• Final Report (10)<br />• Presentations (15)<br />Total 100",
            "comment_workload": "It is a 4 credits course, so you can expect the workload. My tips: work with someone that has a similar working style, or you could spend days on the group project. Also, try your best to answer questions in class, as participation could mean a lot, say&nbsp;&nbsp;at least 1 sub grade.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NRTVVBjH18cZKfRvwidzMd5cCF3DCaIC",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1249,
                    "name": "LIU, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "therock",
            "date": "May 30, 2020",
            "title": "unbelievably bad prof",
            "comment_content": "The content was relatively interesting towards the beginning, but to be honest the prof was so bad that I just stopped going to lectures and I even skipped the last quiz (she takes best 2 out of 3) so I missed like 1/3 of the content covered in class. A shame, since marketing research seemed like a field I might be interested in. Similar stuff to ISOM2500, except this time the focus is meant to be on SPSS (though I have yet to figure out how that works, she never really explained and tbh it wasn't super necessary-- only for the project).",
            "comment_teaching": "Definitely one of the worst profs at UST (probably second worst after the dude who didn't speak english in that first sem calc class). Don't understand how she's a prof, she barely can even read off her own slides. Oh and she gets confused by everything and contradicts herself all the time so keep that in mind during your project (simple ideas=good, she might have a better chance understanding those). I hope for whoever has to take this course that you'll get to do it in person, her technology skills were that of a grandma, so good luck if you have her on Zoom like us virus sem kids did.",
            "comment_grading": "Can't comment on letter grading since I opted for Pass/Fail and won't know my score.",
            "comment_workload": "Workload isn't too bad for a 4 credit course (felt like a normal 3 credit course to me). The project is by far the most significant part of the workload, other stuff throughout the sem is pretty ok, plus there's no final to study for. The quizzes are fine, since we had our sem online we had open notes which meant if you can command+f you were ok. Not sure how it would be though without this added benefit...",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "tbgMPnQmTpFAgMynL0tip4UJfKEh4PfJ",
            "semester": "2016-17 Spring",
            "instructors": [],
            "is_author": false,
            "author": "avv",
            "date": "Mar 28, 2019",
            "title": "WORST PROFESSOR IN MARKETING",
            "comment_content": "The content itself is useful especially if you looking to go into Marketing Research for a career. But this course may ruin your expectations",
            "comment_teaching": "Joseph is the worst fucking professor. He keeps bullshitting throughout his teaching and shows some useless videos",
            "comment_grading": "Bad grading. Exam was so weird where all the answers were 'Option C'. It was fucked up.",
            "comment_workload": "Heavy workload. You'll need to submit a mid-term report. final report + presentation. Getting good group members is critical. I had a bad group. There have been cases where each member rates the other member badly on peer eval",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iFMLzKYGt8a2C2MzSg4J4ZIA4511Bzrb",
            "semester": "2017-18 Spring",
            "instructors": [],
            "is_author": false,
            "author": "ckaisam",
            "date": "Aug 20, 2018",
            "title": "",
            "comment_content": "the content mainly talks about the process of a market research, from planning to executing.<br />a little bit content is similar to ISOM2500 which is about statistics.",
            "comment_teaching": "korean prof has bad English pronunciation and has unclear explanation on some topics.",
            "comment_grading": "the midterms are averagely essay and the mean score is very high. it is needed to be very careful to answer each questions. the midterms include mc and short questions.<br />bad grading on project because the prof has bias on our topic",
            "comment_workload": "moderate<br />it includes 3 midterms, and take the grades of the best two midterms.<br />it includes a report about doing marketing research on certain issue. it requires presentation and final report.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SHFauzuCNnpAHbEUlUGrW3CPBoWkE7T6",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 507,
                    "name": "SALVACRUZ, Joseph",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rachelwaiyan",
            "date": "Aug 08, 2018",
            "title": "",
            "comment_content": "Not a lot of contents as you only learn some tools to finish your projects. But involve some calculations and logic thinking.",
            "comment_teaching": "Joseph is quite funny, but sometimes it is hard to follow which he is saying. He will give your PPTs and show you some videos during the lesson. And there are some in-class exercises for you to learn the ideas. No need textbook.",
            "comment_grading": "Be active in the class and try to apply all the contents that he taught in the lessons then you can get a good grade. Don't skip lessons and sit on the front row to let him remember. Try to answer questions.",
            "comment_workload": "The workload is very large as you have to complete a project with different stages. You will be very busy within the semester and may always find the professor. You will have to have many meetings with your teammates. It is important to find good teammates otherwise your grade will be badly affected and you will have a lot of works to do. <br /><br />The mid-terms and final are quite easy. Try to get high mark as it can save your grade.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BvjI1yyoI6vlNVooTjWTRaIZ4muXoeRm",
            "semester": "2017-18 Spring",
            "instructors": [],
            "is_author": false,
            "author": "benedict egg",
            "date": "Jun 09, 2018",
            "title": "I hate the professor",
            "comment_content": "Basic principles and tools in marketing research: from problem formulation to research design, and from data collection to data analysis<br /><br />Mainly information about different research methods such as survey.<br /><br />Will teach about SPSS in the tutorial.",
            "comment_teaching": "My professor is&nbsp;&nbsp;Maeng, Hyun Chul&nbsp;&nbsp;Maeng, Hyun Chul&nbsp;&nbsp;Maeng, Hyun Chul very important has to say it three times.<br /><br />Worst professor I have ever met. Simply read out the powerpoint, and his explanation was very confusing ( maybe bc of his English). When we asked how can we improve our project, his advice was useless and so confusing, not sure what he actually wanted. <br /><br />Do not need to attend the tutorial, he doesn't know how to use SPSS himself, if you attend the tutorial he will use most of the time asking you to do the questions by yourself( he told us to google how to use SPSS ) ( and then he started to slack). At last, he revealed the answer by directly following his own guidelines. If you want to learn SPSS you can do it by self-study, you will need it in the project.",
            "comment_grading": "My professor is Maeng, Hyun Chul very important<br /><br />Weighting<br />Quiz 1 (Best of three exams) 20 points<br />Quiz 2 (Second best of three exams) 20 points<br />Individual:&nbsp;&nbsp;Class Participation 8 points<br />Group Project:<br />Research Proposal 5 points<br />Exploratory Research 10 points<br />Questionnaire design 5 points<br />Presentation 10 points<br />Final Report 20 points<br />Marketing Experiment 2 points<br /><br />So the quiz (about 40%), project (50%)<br /><br />The quizzes are very easy, making it very easy to get high marks, so the sd should be very small. While the project has an sd of ard 8.XX, out of 100.<br /><br />I got 38 &amp; 40 out of 40 for 2 quizzes, Project under mean ard 1.3 sd (T_T) I got a C+ at last. I email the professor and he said I am at mean for participation and among top 5% for the quiz, top 5%!!! C+ huh??? Maybe it's becoz the variation of the quizzes is so small, but still, I can't see why the project can pull down my grade in such a large extent. It's 4 cred man!&nbsp;&nbsp;So I guess the project can determine your overall grade, I think my group work really hard on the pj, but still...<br /><br />PS: If you can choose btw 2 professors for this course, DON'T CHOOSE HIM, if you can't swap, I will drop the course if I were you(jkjk) (actually I may really drop it)",
            "comment_workload": "My professor is Maeng, Hyun Chul very important<br /><br />Just memorize the ppt you can score high marks on the quiz, don't even have to memorize the very detailed information, only very little calculation needed.<br /><br />You have to answer questions to get the parti card. The pj has quite many things to do. <br /><br />But overall I think not much to do as a 4 creds course.",
            "rating_content": 5,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2vtqXiBpnU3duFypeis57dk57R3J3RrH",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 507,
                    "name": "SALVACRUZ, Joseph",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jocelyn",
            "date": "Aug 17, 2017",
            "title": "",
            "comment_content": "First half of the course was considerably straight-forward and the content was clear and easy to understand. However, the second part of the course presented to be much more challenging with a lot of data and software working.",
            "comment_teaching": "Joseph is an enjoyable professor and always makes the classroom relaxed and light-hearted.",
            "comment_grading": "The grading is decent as long as you form a good group because Joseph puts great emphasis on the group project. Do well on the first quiz because the second one is much more difficult in terms of content.",
            "comment_workload": "Relatively heavy workload, with a large emphasis on the group project.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ciZ3Umkfj9OEg1631OpuFeepGqRG6FKN",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 507,
                    "name": "SALVACRUZ, Joseph",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "unspecified",
            "date": "Jun 16, 2017",
            "title": "",
            "comment_content": "Extremely boring content. If you do not like statistics, you are not going to enjoy the content in this class.",
            "comment_teaching": "Prof. Salvacruz is an okay teacher for 3220. He explains things well, but skips through the content extremely quickly and does not really give examples for us to do in class so we can follow along.",
            "comment_grading": "Grading is not too bad. Mean for all the quizzes, midterms, and project, finally got a B in the end.",
            "comment_workload": "I would say there is a decently heavy workload. The project is quite difficult to complete, and there is a lot of materials tested for all the quizzes and midterms. Make sure to do well in your first midterm because it will get much harder after that.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Fouvq54P1CI0nNQt3409ztnE77kzqhXD",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1382,
                    "name": "SHI, Mengze",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "markmajorer",
            "date": "Aug 02, 2023",
            "title": "",
            "comment_content": "You can get useful insights about market research. I personally found the project rewarding since we got to fully conduct research and interpret data by ourselves.",
            "comment_teaching": "His teaching is overall very good. He does well in giving examples and demonstrations which makes us understand the material better.<br />However, I felt like his teaching became less engaging as it got close to the end of sem. Maybe it's just because the material itself focused more on the information and numbers rather than gathering different ideas.",
            "comment_grading": "It was fairly nice. Felt like the quizzes were a bit challenging, but looking back, they could be easily solved if you pay attention to the lectures and take notes on the lecture notes. The quizzes sometimes contained materials that were not written on the lecture notes. It was sometimes about a video or a case that the professor showed during the lecture.",
            "comment_workload": "You have to work steadily throughout the semester because you have three divided reports to do. I guess it solely depends on whether your teammates are hardworking or not.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "twvdGZvnMPXnLOXgRpeeL7UgyG1qLMC9",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1382,
                    "name": "SHI, Mengze",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GotMarkMajor",
            "date": "Jun 08, 2023",
            "title": "Fair workload, pretty interesting contents",
            "comment_content": "Marketing research process and techniques<br />- problem formulation (client meeting), exploratory research (in-depth interviews, focus group), descriptive research, sampling techniques, scales, questionnaire design, hypothesis testing, conjoint simulation, etc.<br /><br />Lecture slides are quite informational so you can use them for preparing quizzes and projects.<br /><br />3 tutorial sessions for data analysis techniques but not mandatory to attend.<br /><br />Professor gives you required reading portion of the textbook before each class. <br /><br />Textbook: Brown, Tom J., Tracy A. Suter, and Gilbert A. Jr. Churchill,<br />Basic Marketing Research, 9th<br />Edition, CENGAGE Learning.",
            "comment_teaching": "I appreciate Professor Mengze's teaching style for several reasons. Firstly, he puts the extra effort to make the content engaging, ensuring that students remain interested and involved throughout the lessons. Moreover, he effectively talks about real-life examples from his own experiences to elucidate the theories we discuss in class.<br /><br />Furthermore, Professor Mengze actively encourages participation from all students in the classroom. This means that even introverted individuals can fairly contribute to the classroom discussions by making some effort to express their thoughts. By creating an environment where everyone's input is valued, he ensures that every student has the opportunity to make meaningful contributions to the learning process. Even at the end of the semester, he gave us additional chances to boost class participation points by making a short video that is somehow related to the course.",
            "comment_grading": "Component Points<br />(Individual) Quizzes – Best two out of three 2*100 Points<br />(Individual) Class Participation 40 Points<br />Marketing Experiment 10 Points<br />Group Project<br /> Research proposal 60 Points<br /> Exploratory research 60 Points<br /> Final Report 70 Points<br /> Presentation 60 Points<br />Total 500 Point<br /><br />Quizzes <br />Quiz 1: 92/100 (highest 95)<br />Quiz 2: 80/100 (highest around 85)<br />Quiz 3: 84/100 (highest 84)<br /><br />Class participation: Very good (3)<br />Group project: mean<br />Presentation: mean<br /><br />Final Grade: A+",
            "comment_workload": "Managing the workload for the group project becomes manageable as long as you and your team members avoid the tendency to leave everything until the last minute. This is particularly relevant for second-year Marketing major students who are enrolled in both MARK 3220 and MARK 3420. The school has taken careful consideration in planning the project workload, providing different timelines for completing major tasks within each course's group project. <br /><br />Exam (3 quizzes) difficulties are within expectation, but as a result, mean and std are quite high and compact.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tfQXkA41HREqJWmJgA3zdp6MjyjaYSQk",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 514,
                    "name": "WANG, Wenbo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "heyaheyahei",
            "date": "Dec 13, 2022",
            "title": "",
            "comment_content": "The course is designed to teach you the basic principles and tools in marketing research, from <br />problem formulation to research design, and from data collection to data analysis.&nbsp;&nbsp;Students will <br />learn how to design a market research to address management problems from analysts’ perspective, <br />as well as how to evaluate and interpret research findings from clients’ perspective.&nbsp;&nbsp;The learning <br />may be beneficial to future careers in market research, consulting, marketing management, data <br />analytics, and entrepreneurship. <br />There are two modules of the course. The first module introduces the building blocks of marketing <br />research, including problem formulation, research design, and data collection methods. The second <br />module teaches you how to use statistical tools to answer research questions. <br />A major objective of the course is to give you some “hands-on” exposure to techniques that are <br />fundamental to most marketing research.&nbsp;&nbsp;To that end, you will conduct a small-scale research <br />project together with a group of classmates. The project can help you understand the concepts and <br />methods learned in class and prepare you for conducting large-scale research in your future career.",
            "comment_teaching": "fair",
            "comment_grading": "Not in a heavy workload<br />3 quizzes in total <br />only count best 2 quizzes<br />1 above mean 2 below mean<br />and I got B+ finally<br />The project and assignment are the important factors to depend your grade<br /><br />Quizzes – Best two out of three 40<br />Individual Assignment 5<br />Class Participation 8<br />Marketing Experiment 2<br />Group Project 45<br /> Research proposal (10)<br /> Exploratory research (10)<br /> Final Report (10)<br /> Presentations (15)<br />Total 100",
            "comment_workload": "not in a heavy workload,<br />the project is not challenging but it is time-consuming.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7iBfOOOxVtRizQfCYLX9tdSPOpRKMXnV",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1249,
                    "name": "LIU, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "racoon",
            "date": "Jan 25, 2022",
            "title": "",
            "comment_content": "One of the most practical and useful marketing courses that I had in UST, and I think it is because generally, marketing courses are rather intuitive. However, this course also equipped you with fundamental concepts on how to design a good consumer behaviour survey, and how to critically evaluate research data using SPSS.",
            "comment_teaching": "Although sometimes her explanations were a little bit unclear due to her accent, overall, she is very kind and willing to help if you encountered any problems, especially in group projects.",
            "comment_grading": "1.Best 2 out of the 3 quizzes (40%)<br />2.Individual assignment (5%)<br />3.Class participation (8%)<br />4.Marketing experiment (2%)<br />5.Group project (45%)<br />• Research proposal (10%)<br />• Exploratory research (10%)<br />• Final report (10%)<br />• Presentation (15%)<br />Got an A in the end. As long as you understand the materials and concepts in this course, actively participate in class and take notes, you will at least get a B. P.S, Please choose your group teammates WISELY since the group project workload is quite demanding.",
            "comment_workload": "If you want to take this course, please make sure that you don't have any other 4 credits courses because this course requires huge amount of effort if you wanna get a good grade.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xj1UA5ln9QRXAOYj4XI3rhglNSrLuEX8",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 773,
                    "name": "LIN, Song",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cosby",
            "date": "Aug 22, 2021",
            "title": "Good professor",
            "comment_content": "Really good content, go in depth into the whole marketing process",
            "comment_teaching": "Good teaching, professor really go into the details so you could have good understanding without going too deep so you get confused",
            "comment_grading": "Good grading, got A+ in the course, but the mean is quite high so you have to be careful not to lose any points.",
            "comment_workload": "Workload is reasonable, you have 3 exams where only two of the highest counts, I end up not going to the finals as I already achieved very high scores. You have a final report and presentation at the final exam period which will really teaches you to use SPSS, all in all great course",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uqgAb8DUZb87B9ZlVsSI90ZHnX3RhE5S",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1249,
                    "name": "LIU, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "waiyo",
            "date": "Aug 28, 2020",
            "title": "",
            "comment_content": "Can help us to understand how to do marketing research. The course is designed toteach youthe basicprinciples andtools in marketing research, from problem formulation to research design,and from data collection to data analysis. Students will learn how to design a market research to address management problemsfrom analysts’ perspective, as well as how to evaluate and interpret research findingsfrom clients’ perspective.The learning may be beneficial to future careers in market research, consulting, marketing management, data analytics, and entrepreneurship.",
            "comment_teaching": "No really clear explaination because she came from mainland.&nbsp;&nbsp;We are using Zoom this sem. Therefore, sometimes we are hard to follow because there will be some internet connection problems. However, she is willing to answer our questions.",
            "comment_grading": "Grading depends on your group project and group mates.",
            "comment_workload": "Quizzes (Best two out of three) : 40%<br />Individual Assignment : 5%<br />Class Participation : 8%<br />Marketing Experiment : 2%<br />Group Project : 45%<br />Research proposal : 10%<br />So group project really counts a lot. It is important to note that when grading a group project, they will take into account how well you incorporate the feedbacks in the earlier stages. Therefore, the grade is an overall assessment of how you learn throughoutthe whole project.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BFhzLZ5GN1I0VwrLe9EBZSp3d77EZJ49",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1249,
                    "name": "LIU, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "o_o",
            "date": "Aug 13, 2020",
            "title": "",
            "comment_content": "(I) The Marketing Research Process (Lectures 1-7)<br />- Research process<br />- Problem formulation<br />- Research design<br />- Data collection<br />(II) Analysis Tool (Lectures 8-14)<br />- Descriptive analysis<br />- Hypothesis testing <br />- Regression analysis<br />- Conjoint analysis <br />Most of the course content should be studied in ISOM 2500 so it should be easy.",
            "comment_teaching": "The professor has strong mainland accent so you will find it hard to follow at the beginning. However the course content is easy so you don't need much effort to catch up even if you skipped the lecture.",
            "comment_grading": "Quizzes - Best two out of three - 40%<br />Individual Assignment - 5%<br />Class Participation - 8%<br />Marketing Experiment - 2%<br />Group Project - 45%<br />- Research proposal - 10%<br />- Exploratory research - 10%<br />- Final Report - 10%<br />- Presentation - 15%<br />Total 100%",
            "comment_workload": "A lot of project work. But it is separate into different stages and the Professor will give comments on your work in each stage. Follow the instructions the professor gave you and changed accordingly then you will find it easier in writing Final Report and less workload at the end of the semester.<br /><br />Although you can understand the content even though you skipped the lecture, I still suggest you to attend as participation is counted. The professor will jot down the name of the students if they answered questions.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kJVv1aDeGHwyhKGk0kxayuUsh48aZmMQ",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1249,
                    "name": "LIU, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "penguin3220",
            "date": "Jun 14, 2020",
            "title": "",
            "comment_content": "It is quite easy before the 2nd quiz cuz after quiz 2 it requires a little bit of calculation.",
            "comment_teaching": "Her mandarin accent is very strong... I either got headache after lesson or sleep for the second half of the lesson... most likely she just read the powerpoint to you, but sometimes she teaches something that is not in the powerpoint so I have no clue when should I focus in class.",
            "comment_grading": "The grade is quite fair (it is predictable after reading through the reviews on UST space)<br /><br />Quizzes – Best two out of three 40%<br />One of the quizzes is above 0.8 SD and another one above 1 SD<br /><br />Individual Assignment 5%<br />12/15 (Mean: 10.8/15)<br /><br />Class Participation 8%<br />Sometimes participate in class<br /><br />Marketing Experiment 2%<br />Full marks (2%)<br /><br />Group Project 45%<br />Overall above mean a bit<br /><br />Final Grade: A-",
            "comment_workload": "The workload of the group project is high and it demands quite a lot. Make sure you have some good quality groupmates:)",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "v6nDssuDRC6dMtyivoo5l09vt7cVx4rf",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1249,
                    "name": "LIU, Jia",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "mei you qian",
            "date": "Jun 10, 2020",
            "title": "Below standard instructor",
            "comment_content": "The contents are ok but quite boring. They could be useful in the future if you are going to pursue your career in market research. Most of the contents were heavily focusing on stats from the beginning, though - if you are not really into stats, it could be difficult. <br />The last half of the course mainly uses IBM SPSS program to conduct hypothesis testing. <br /><br />There are 3 quizzes throughout the semester. The best 2 count. <br /><br />There is a group project which consists more than 50% of your grade. Your group will choose one company and conduct a market research on their behalf. You will write 3 reports and do 1 final presentation. <br /><br />Using the class contents for your project is very essential - you should apply the concepts from the planning stage, so make sure you at least read the slides. Textbook is required but I never used it. <br /><br />But the instructor had structured the course very poorly - for example, she talked about how we should write our reports in the last session but we had to write 2 reports before that class. I will talk more on the instructor in the next section.",
            "comment_teaching": "The worst teaching I had in UST so far. Full-stop. <br /><br />If you think you had the worst instructor, you should really try tuning into her lecture for 1 minute. I somewhat feel bad to say that but I really don't at the same time and here is the reason why. <br /><br />First of all, her English level is below standard. Her mainland accent is super THICC. Even towards the end of the course where we got used to her accent, it is still extremely unclear on what she is exactly trying to say. She even has difficulties understanding our questions, too. tbh I don't know how she is a prof, giving me hopes that even I could do PhD. <br /><br />Her teaching was 99% just reading off the slides. But again, as her Engreeish is very poor, she can't even read off the slides. So you may just read slides instead of wasting your precious time.<br /><br />She could not explain the concepts very well either. Her trying to explain the principle behind statistics was extremely poor. It was mere gibberish. The problem is, it is very important to fully understand the statistical concepts for this class. If I did not take maths with stats option in high school, I would not have had any idea on what is going on in class. <br /><br />Especially her tutorials were near useless although it only happened twice. Watching Youtube videos myself helped me more than attending her tutorials. <br /><br />Overall, her teaching is incompetent. If there is an option, swap to other instructors.",
            "comment_grading": "Deadass. I got full marks for the final report and above mean for the other two reports. Although my presentation grade was unknown, I do not think it was that below the mean. All my quizzes were nearly 1SD above the mean. I got below mean for the assignment which accounted for 5% of my grade. I attended all of her lectures (although it was a waste of time). I ended up with B+. (I chose letter grading for this damn corona sem oof)<br /><br />Moral of the story? The course's grading is really poor. It is very much likely to pull your GPA down.",
            "comment_workload": "Workload is heavy although you should consider this is a 4-creds course. <br /><br />Your grade mostly depends on the market research project. I had really good group mates for this project. No free-riders, we all equally worked hard because we were close friends at the first place. Yet, it took us really long time for the whole project, especially for the final report and the presentation. We pulled several 4-5 hours meeting for the project. I don't know how I would have pulled off the project if I were surrounded by free-riders in the group. <br /><br />You have a lot to study for the quizzes if you want good grades. They are not easy. MCQs are tedious and there are short answer writing questions as well. The mean of quizzes is also around 50-65 out of 100. <br /><br />There is a weekly reading material but no one does it. <br /><br />Basically, you are doing everything except midterm and finals for this course.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TXGS359CcTSc7gqC14vpOc05JzY9DnxT",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1249,
                    "name": "LIU, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cleen",
            "date": "Aug 13, 2019",
            "title": "",
            "comment_content": "Class content was interesting, but confusing at times. Sometimes evolved into a math class so ISOM2500 knowledge will be great. <br /><br />Topics went into the Marketing research process (zooming in on each part). These included exploratory research, descriptive research, casual research, data collection, analysis, and reporting. <br /><br />Not too difficult.",
            "comment_teaching": "Prof tended to rush through concepts. During our tutorials, she would rush through new things on SPSS, and some students just recorded the class and went back home to actually absorb. <br /><br />However, during the class she would respond well to questions, and always gave constructive feedback. <br /><br />Overall, she is a friendly sweet teacher who tries her best. She could be more organised though.",
            "comment_grading": "The grading was frustrating at first. The professor added grading aspects to our idea proposal - which doesn't make sense. After all it is a proposal so she can tell us what she thinks. There was no rubric either - so my group and I were not very happy about this. <br /><br />However, overall if you read the slides, and read the book you should be fine. <br /><br />There are 3 quizzes, and the best out of the 2 will get counted. Many people did well enough for the first 2, that they did not show up for the 3rd. <br /><br />Individual assignment, you can work together and all get 100% - no problem as well. <br /><br />It is good to participate in class as well.",
            "comment_workload": "Workload was very high because of the group project. My advice is group with the right people, because if you end up with free riders, you will definitely suffer. <br /><br />Other than that, the slides do not have too much content, so workload is acceptable.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "keKLzu8ws5u0HERHgj6YO6yAq5Ryoty5",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 1249,
                    "name": "LIU, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lonelyguy",
            "date": "Jun 11, 2019",
            "title": "A good course to test your listening ability",
            "comment_content": "Basic statistics stuff, some are similar to ISOM 2500. If you have a good foundation on ISOM 2500, this course should be fine.<br /><br />The course mainly focuses on the basic principles and tools in marketing research, from problem formulation to research design, and from data collection to data analysis these 5 main blocks.",
            "comment_teaching": "She has a super heavy accent. It was quite difficult to understand her words.<br /><br />She did not explain the concepts very clearly and it was so easy to get confused. Also, she did not discuss the topic deeply and you needed to figure it out by yourself. That's why having a solid background in ISOM 2500 definitely helps you a lot!<br /><br />She is very nice and smiles a lot, yet she is strict in projects and presentations. So, do prepare well for the project. She had 2 optional tutorials in the semester for SPSS teaching but actually were quite useless.",
            "comment_grading": "9 am class. No one attended the class. I guess there were only 10 students in the classroom every lesson. Also, no one would answer the questions, so you could just answer without effort. This perhaps might affect the participation score.<br /><br />Grade Components:<br />40% Best 2 out of 3 Quizzes: above 0.7 SD and mean <br />5% Project Proposal: 9.5/10 (Mean: 8.5)<br />10% Exploratory Research: 20/20 (Mean: 18)<br />15% Final Report: unknown<br />5% + 10% Presentation 1 + 2: unknown<br />8% Class Participation: unknown<br />5% Individual Assignment: 99/100 (Mean: 89.2)<br />2% Research: 2/2<br /><br />Final Grade: A",
            "comment_workload": "Super Heavy. The project is super time-consuming. You need to hand in:<br />- 1 project proposal (5 pages)<br />- 1 Exploratory Research (10 pages)<br />- 1 Final Report (16 pages)<br />- 1 Presentation (either project proposal or exploratory research)<br />- 1 Final Presentation<br />= 3 reports and 2 presentations in 1 semester. RIP<br /><br />Individual Assignments: Case Study. Use simple regression to analysis the case by SPSS. Totally no idea what is happening as she did not teach us how to use SPSS in the tutorial. You need to figure it out all by yourself. <br /><br />Quizzes: Quizzes are fine but she had MC and short questions and her MCs were very tricky.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6tTutZlmctJekex94JmT8GlmSYvXy8La",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 900,
                    "name": "LEE, Bernard",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "uststudent123",
            "date": "Mar 19, 2018",
            "title": "",
            "comment_content": "Content is basically about how to use the program SPSS and basic statistics for calculation. This is very useful as you can do number crunching yourself in the future with the software.",
            "comment_teaching": "Bernard is a very kind teacher and answers many concerns by students. he is also a very flexible teacher and provides breaks when students are tired.",
            "comment_grading": "The grading is pretty lenient, if you score above mean and do well on project you could score a high B or even an A .",
            "comment_workload": "Workload is okay with MC quizzes as well as a large group project. It would most likely be 4 in a group which would lead to less workload compared to some personal projects in other courses. The quizzes are not too tough but the mean is quite high.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nOr6T6vYO66EYRSiIiEZKI3Otxc2fbWr",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 506,
                    "name": "VAN DER LANS, Ralf",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ustmarketing",
            "date": "Jan 24, 2018",
            "title": "",
            "comment_content": "Very structured course. Useful and practical. Required course for marketing major which teaches you the whole process of a marketing research. Learnt a lot from the course.",
            "comment_teaching": "Ralf is a very nice professor. Clear and organized lessons and lecture notes. A bit intense during lessons though as he asks you question at any time. He is also quite strict in grading but always gives you useful advice.",
            "comment_grading": "Average grading.",
            "comment_workload": "Quite heavy workload with 3 quizzes and a marketing research project which includes a lot of steps. Requires you to do focus groups and surveys and then data analysis and presentation which is very time consuming.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NcveFjHK1cn0ffPqKhhedfSRxK6124aX",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 506,
                    "name": "VAN DER LANS, Ralf",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "linda",
            "date": "Jan 22, 2018",
            "title": "",
            "comment_content": "Learning about the basics of Marketing Research and carrying out some by ourselves is fun and enriching.",
            "comment_teaching": "Prof is very good and keeps us engaged throughout all lessons. Always asking questions to make the classes more interactive.",
            "comment_grading": "Grading is fair, if you put in enough effort and use the knowledge you learnt in class for the project, and study for your quizzes, it should be no problem.",
            "comment_workload": "Workload is relatively heavy due to the group project, but overall the project is interesting to work on so it is kind of worth it.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "g1UXyoBdx0c8epXVvE9MJ1KC4IoaZoj9",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 773,
                    "name": "LIN, Song",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "IT",
            "date": "Jan 20, 2018",
            "title": "",
            "comment_content": "Generally quite simple. Include some statistical knowledge. <br />The formulas will not be tested in quizzes, only the concept will be tested.",
            "comment_teaching": "Lin Song is nice. However, the lecture is quite boring. He normally just repeats the content in the powerpoint. <br />He always ask some simple questions in the beginning of the lesson to recap what's taught last lesson, it is a good chance to gain participation.",
            "comment_grading": "Quizes (total 50%) <br />One quizzes above 0.5 SD, another above 1 SD. <br />Project and presentation should be good. <br />Final grade: A",
            "comment_workload": "3 quizzes, count the best two. <br />One research project to work on. 5 people a group. <br />Workload should not be too heavy if you have sound group mates.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fp7lY4LwxyBMSGobtYQ9AhPUUvfvQ0WT",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 900,
                    "name": "LEE, Bernard",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "wahahapurewater",
            "date": "Sep 05, 2017",
            "title": "Prof sucks",
            "comment_content": "This course teaches the whole process of conducting a marketing research, namely:<br />i.problem identification <br />ii.research design <br />iii.data collection design <br />iv.sampling design <br />v.data analysis and solution generation<br />Also, we are required to design and implement a research project which focuses on an existing company.<br />The course content itself requires some mathematics and a strong analytical mind (kinda different from other marketing course). Professor will also teach you how to use the software SPSS for data analysis, which is quite useful but troublesome.",
            "comment_teaching": "OKAY. BERNARD SUCKS.<br />He simply read out the powerpoint slides in class. When students raised questions, his answers didn't hit the core problem. Sometimes I even suspect that he himself doesn't know the answer as well. Moreover, he isn't familiar with his own syllabus, which surprised me a lot. I once asked him about proposal guidelines as it is not clearly stated in his documents. He told me not to care that much because the proposal does not count marks. In fact, the proposal counts 10%! Worst marketing professor ever.",
            "comment_grading": "- Term Test 1: 20%<br />- Term Test 2: 20%<br />- Group project:<br />Presentation: 15%<br />Research Proposal: 10%<br />Exploratory Research: 10%<br />Final Written Report: 15% <br />- Individual Class Participation/In-class exercises: 8%<br />- Marketing Experiment: 2%<br />Bernard's midterm are quite hard, midterm contains mc and short questions. In some MCs, the words used in A B C D choices are too hard. My friends and I don't know what to choose even though we understand the question. <br />Mean=B-/C+",
            "comment_workload": "Quite heavy. Project requires much workload as it is energy and time consuming. If you got free riders in your group (which is my case), you gotta work A LOT, especially the data analysing part.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "y5uluQyy0eJPwiYDYJpoR6VgSb9GVQ91",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 507,
                    "name": "SALVACRUZ, Joseph",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ust Toxic Boy",
            "date": "Aug 25, 2017",
            "title": "So So",
            "comment_content": "The Content is about using some advanced statistical method and calculation (the concept from ISOM2500) to conduct some Research to analyze the data.",
            "comment_teaching": "He is relatively a lazy professor . 坦白講 我聽左咁奈都覺得佢真係好亂 又唔整齊&nbsp;&nbsp;上堂講書又成日飛黎飛去。<br />所以有的選最好都唔好選佢 只會後悔。",
            "comment_grading": "Term Test 1&nbsp;&nbsp;20%<br />Term Test 2&nbsp;&nbsp;20%<br />Group Project:&nbsp;&nbsp;(35%, peer-assigned) <br />Presentation 15% <br />Reports&nbsp;&nbsp;: Research Proposal 10% – Exploratory Research 10% – Final Written Report 15%&nbsp;&nbsp;<br />Class Participation/&nbsp;&nbsp;In-class exercises 10%<br />Marketing Experiment 2%<br />It sucks since you will have no idea about how do your grade come from. I have a midterm higher than mean 1SD and one below a little bit , got B- in projects but I still got a C+ .That's unbelievble",
            "comment_workload": "The Workload actually is fine. Just rmb to go to the class and answer more questions such that he will recognize you and I think the grade mainly depends on his impression on you. <br /><br />1Project is fine and 2 midterm is not very hard so I think overall about exam is not hard .",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VwEBZgNl7K9xdacb29ccvBRgGY4y3VO1",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 507,
                    "name": "SALVACRUZ, Joseph",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "kty",
            "date": "Aug 25, 2017",
            "title": "",
            "comment_content": "主要係教你用唔同既方法去收集消費者既意見，之後再用一D方法去計D result，再唔係淨係得questionnaire，單純咁計下有幾多人揀呢個answer咁樣",
            "comment_teaching": "都幾差，我上左一個sem都唔知佢教緊乜，D notes又唔organize<br />如果你唔係坐第一排既人基本上會覺得浪費緊自己時間，所以我嗰組到左最後都只係得representative返去take attendance<br />project方面，佢deadline前兩日先會比guideline你，話你知要交D咩，所以完全唔洗好耐之前就開始擔心project，你根本冇得擔心",
            "comment_grading": "Term Test 1&nbsp;&nbsp;20%<br />Term Test 2&nbsp;&nbsp;20%<br />Group Project:&nbsp;&nbsp;(35%, peer-assigned) <br />Presentation 15% <br />Reports&nbsp;&nbsp;: Research Proposal 10% – Exploratory Research 10% – Final Written Report 15%&nbsp;&nbsp;<br />Class Participation/&nbsp;&nbsp;In-class exercises 10%<br />Marketing Experiment 2%",
            "comment_workload": "以一個4 credit 既course離講都okay geh<br />quiz 幾日前溫就得 (要溫得好深入)<br />project 一定要有6個人呀唔係好辛苦",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sNDEzI4rvAZ1fIwit50GTyaygGO7ASNx",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 773,
                    "name": "LIN, Song",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wong123",
            "date": "Aug 23, 2017",
            "title": "",
            "comment_content": "Is mostly related to what they teach in ISOM 2500. Not much technical materials included. Mostly is about how to use different systems like SPSS, Qualtrics etc.",
            "comment_teaching": "There is a total of two tutorials, but it is all about the usage about SPSS which will not be tested. Therefore the tutorial is not a must to attend.",
            "comment_grading": "Acceptable, B grade for average students.",
            "comment_workload": "High work load. The project is the hardest part. The project mainly focuses on how you acquire your data and how you analysis it. To achieve a higher grade, it is important to design your questionnaire better so you can gain the most out of it.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cPffNd16F2aXYa4QbJuVlJ1LNxXSsB5j",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 507,
                    "name": "SALVACRUZ, Joseph",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Sparkler",
            "date": "Aug 10, 2017",
            "title": "What are you talking about???",
            "comment_content": "First half of the course content is quite easy as there is none of math. However the second would be a little bit difficult which includes some math and software.",
            "comment_teaching": "Joseph is lazy and working slowly. When he was teaching the software, he just asked us to play around!! But there is nothing to play. no one knows what going on and keep asking neighbour.\\<br />He even didn;t provide a correct way to find the answer.",
            "comment_grading": "Both of the term test above about 1 SD<br />and the final project got B.<br />Final Grade B<br /><br />Although he said that he would set up some questions from the book, but there should be only one or two. Not worthy to read the book. just study PPT is okay. Jot note in lesson",
            "comment_workload": "Fair<br />Two term test and the final project.<br /><br />Dont skip lesson. need to sign",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EdohMMYxLH1XjCWmdf6WINzVsPBNijOz",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 506,
                    "name": "VAN DER LANS, Ralf",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Annacyy",
            "date": "Aug 09, 2017",
            "title": "",
            "comment_content": "Ralf explains every details of market research clearly. You must pay attention during the lessons to take notes as many questions in quiz are not covered in the PPT given. He will also ask about the content in talks in his quiz. Project is very important!",
            "comment_teaching": "You must pay attention in his class. And dont be late as he will ask you questions.",
            "comment_grading": "His grade is relatively fair.&nbsp;&nbsp;My group project just on mean. But many quizzes are above 1 SD. And I got B+.",
            "comment_workload": "Workload is heavy in group project.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aRH8KXrKTRkIVWdb7JfxMTXEfd4puaN5",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 506,
                    "name": "VAN DER LANS, Ralf",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "olle",
            "date": "Feb 26, 2017",
            "title": "terrible workload but great professor",
            "comment_content": "Rules and principles about marketing research as well as its methods. The content itself is really abstract and easy in the beginning but it gets more mathematical (Statistics) toward the end of the semester. <br />Mostly, the content is more straightforward than ones in other marketing courses. <br />The content really realistic and practical. <br />For more preparation and understanding, I highly recommend reading the textbook. If you read according chapters before every class, the content should not be that overwhelming.",
            "comment_teaching": "Professor Ralf is always well prepared for his class contents and questions from students. He seems to know the most effective way to teach the content of the class. I really enjoyed listening to his lecture because his slides were well organized and clear to understand. <br />His in class activity at the end of each class helped a lot to understand the content taught that day.",
            "comment_grading": "I think he is a fair grader. If you attend his lectures and pay attention, you will be fine. <br />Make sure you get good grades in the first two quizzes because the last quiz seems to be the hardest and he only counts best two quizzes out of three. <br />Make sure you pick hardworking groupmates because this group project requires a lot of work you can't afford free riders at least for this course. <br /><br />Quiz 1 (Best of three exams) 100 points<br />Quiz 2 (Second best of three exams) 100 points<br />Individual Class Participation: 40 points<br />Group project:<br />Group Project Presentation: 60 points<br />Reports: 190 points<br />Marketing Experiment: 10 points<br />Total: 500 points<br /><br />Got 92 out of 100 for first quiz (0.96 SD above mean)<br />93 out of 100 for second quiz (1.3 SD above mean) (didn't attend the 3rd quiz)<br />54 out of 60 for presentation (1 SD above mean)<br />187 out of 200 for group report (1 SD above mean)<br /><br />Got an A overall",
            "comment_workload": "Professor expects semi-professional marketing research reports so you might have to spend a lot of time on the reports for good grades.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "jiDQ5n7LjtJu771Zway9QHm7enKavOHL",
                    "name": "MARK 3220 Syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "eJsRu8YWvWFUw5Tyfz8KZgBfRye7Z8fY",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 506,
                    "name": "VAN DER LANS, Ralf",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "WKY",
            "date": "Jan 20, 2017",
            "title": "Quite good",
            "comment_content": "The first quiz is quite easy but the latter part starts to be more statistical. For his quizzes, you will see multiple choices but also short questions so you better get very familiar with what he says in class.",
            "comment_teaching": "He always asks questions and expects students answer him in class. If you are late, he may ask you to answer his questions.",
            "comment_grading": "Only take the best two quizzes out of three. Each counts for 20%. Projects takes up to 50%.",
            "comment_workload": "Only quizzes and project which counts for 50% for the course so you better try harder in your group project.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UjCWEmLnD67Yq0HZo3j1Tzuonws7cP71",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 773,
                    "name": "LIN, Song",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sheryl",
            "date": "Jan 07, 2017",
            "title": "",
            "comment_content": "This course generally teaches the whole cycle of marketing research. From problem formulation, research method to writing a report, which I thought quite comprehensive. It is a fundamental concept for marketing students to understand how to conduct a marketing research in order to understand consumer behavior. <br />After mid-term, there is statistical content which I found quite confusing for some of students. Students with less understanding in statistics must pay more effort in this part.",
            "comment_teaching": "Prof. Song is a nice teacher, he allows interactive atmosphere in the classroom, which make teaching the statistical part less boring. Two in-class project consultation are conducted, so students can ask about the details of their marketing research project, which I found quite helpful.<br /><br />One point to make is the release of grade is quite slow, for the first quiz, it takes nearly two weeks to have the result.",
            "comment_grading": "Best 2 quiz out of total 3 quizzes 40%<br />Class participation 8%<br />Marketing Experiment 2%<br />Grp Project (Present 10%, Final report 40%)<br /><br />There is PRS and participation card for counting total participation rate.<br />However, each student is not limited to take one card per lesson, and it caused students rush to take the card as hard as they can, which I think is unfair to quiet students.",
            "comment_workload": "I think the workload is quite hard. Not only you need to conduct a market research with a little guidelines (the prof and TA do not help much in problem formulation), you need to submit two interim reports during the research which is quite exhausting.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TQWMTQtS8rRgibqLtciO6YMcDtjDi1p5",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 773,
                    "name": "LIN, Song",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cysummm",
            "date": "Jan 05, 2017",
            "title": "",
            "comment_content": "The main content of the course is about the five stages of conducting a marketing research. They are easy to understand but I think only the content taught in lessons may not be sufficient to deal with the problems you would encounter in conducting your own marketing research. <br />Other than lectures, there is also 2-3 tutorials and guest lectures which doesn't take attendance.",
            "comment_teaching": "He has typical Asian/ Chinese accent of English but is easy to understand. Through he has only started teaching in HKUST few years ago, he go through the lessons nice and slow yet might be a bit boring and sleepy sometimes.<br />His notes are neat so you have to jot notes in order to remember how to come up with them. <br />Also, he welcome questions after class and kindly answer them all even for very long time.",
            "comment_grading": "2% Marketing experiment<br />8% - Class Participation<br />40% - Best 2 out 3 quizzes (= mid-terms and final)<br />10% - Group project presentation<br />40% - Group project final report<br /><br />Participation cards would be distributed when you answer his questions and usually the questions are not so difficult. The attendance would be taken in the first 30 mins of the class through iPRS. <br /><br />The quizzes are in a format of ~20 mcs, 10-15 T/F, 3 long questions. They are quite straight forward and require you to remember the key concepts. <br /><br />I would say this is determining factor of the grades. Quizzes with an average of = mean could get B to B+ but the marks of group project would not be released.",
            "comment_workload": "The workload of the project is quite heavy, other than that is fine. You are required to hand in assignments time to time about the project (your own marketing research) which aren't graded. <br />Through the project, you have to set decision questions and research questions, conduct some exploratory research, exploratory research, writing report and presentation.<br />The most painful and time-consuming part should be getting conclusion from focus groups, setting questionnaire, doing hypothesis testing, and writing 15 pages final report.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DWgCFDp1MIHmEdSDJHiwK29dyqHxEtA4",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 506,
                    "name": "VAN DER LANS, Ralf",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "USTCURRY",
            "date": "Aug 22, 2016",
            "title": "Good Course",
            "comment_content": "You can get basic knowledge about marketing research such as how to create an appropriate survey.",
            "comment_teaching": "Ralf is an enthusiastic professor. He explains the concept clearly and answers students' questions patiently.",
            "comment_grading": "Quizzes (200 points)<br />Group project:<br />Reports (190 points)<br />Presentation (60 points)<br />In class participation (40 points)<br />Marketing experiment (10 points)<br />Usually the difference in quizzes is small. So group project plays an important role in the grading.",
            "comment_workload": "Workload is quite heavy as you need to complete a marketing research. <br />There are 3 reports you need to submit.<br />Basically you have one month to finish each report.<br />1. Research proposal <br />2. Exploratory research<br />3. Final report <br />Remarks: Only Final report will be counted in final grading.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TtoatZVLw1FanYxAcZH3C5j319pex0KZ",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1249,
                    "name": "LIU, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yomogi",
            "date": "Jun 08, 2022",
            "title": "",
            "comment_content": "A professional perspective of carrying out a complete market research. An interesting course if you want to be involved in the marketing industry later on.",
            "comment_teaching": "Explain everything clearly in the classes. Can't think of a problem about her teaching.",
            "comment_grading": "Please do not underplay the participation marks in this course cos everyone gets similar marks in quizzes and projects. The narrow grade point gap means participation marks (8%) are a tiebreaker to help you outperform the others greatly. <br /><br />I got above half a SD in all the quizzes and around mean in group projects. But my participation marks pushed my grade to an A, which was quite unexpected.",
            "comment_workload": "4-credit course, so you get the idea. <br /><br />Starting this course with diligent group mates can save you from three-month unending nightmares. If you are eager to see sunrises from time to time, then you can dismiss my advice. <br /><br />Time management is also another concern as there is no ample time for each task.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PXki0dgfmkAS1uBUspoCL6hfV59F9v94",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 514,
                    "name": "WANG, Wenbo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "soni",
            "date": "Sep 11, 2019",
            "title": "",
            "comment_content": "The content is engaging and interesting, in addition to being highly applicable in real life businesses.",
            "comment_teaching": "One of the best professors I've had in HKUST. He makes classes fun and engaging and is always willing to help if you need extra support, whether it be on your project or with quiz results.",
            "comment_grading": "Multiple multiple choice on the exam throws people off a lot, which can be annoying, but if you study properly it should be okay.",
            "comment_workload": "As the workload is spaced out it is is manageable, especially if you engage in classes.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aDemS2rVoJihaW5ZaUpV4Htb19sfoH7H",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 900,
                    "name": "LEE, Bernard",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "alfieeeeee",
            "date": "Oct 08, 2017",
            "title": "",
            "comment_content": "The method of marketing research will be taught. which is very useful for marketing project. More technical things like SPSS will be taught as well to analysis the data you collected. Attendance would be taken by IPRS.",
            "comment_teaching": "Teaching is just simply read out the slides and give out some examples. Lesson usually end early and there is only one lecture per week. Only two tutorials throughout the course and you must attend. Bernard is a friendly professor and he can remember most of the students' name.",
            "comment_grading": "It focuses on the result of your midterms. Feel like the quality of your marketing project won't make any effect to your grade. I got a C+ with three midterms below mean within 1 SD.",
            "comment_workload": "Fair. like other marketing course, there is only one final presentation and report. There are three mid-terms through the course. The highest two will be picked for grading. Midterms are in mc format.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SBtkldjbkTKXxWfbdPDHTEnvv64HwNSr",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 773,
                    "name": "LIN, Song",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hoi Ki",
            "date": "Jan 15, 2017",
            "title": "",
            "comment_content": "Tools and procedures about market research. Some stats and calculation methods and some advanced techniques. <br /><br />Best 2/3 quizzes 40%<br />Participation 8% (answer questions and get cards)<br />Marketing Experiment 2%<br />Group project presentation 0%<br />Final report 40%",
            "comment_teaching": "Interactive, will ask you questions in class but very simple and straight forward. Should have no problem to answer the questions if you attended the previous lecture and looked at the powerpoint. Open to your opinions and will adjust accordingly. Easy going and answer your questions quickly no matter email or in person.",
            "comment_grading": "Quite good grading as he follows the grade distribution. Got an A by scoring above the mean for the quizzes and final above 1 SD. Group project will affect your grade the most as it counts towards 40% of entire grade. Did quite good on the group project and presentation which allowed us to achieve a better grade.",
            "comment_workload": "Main workload from group project but not hard to handle as you have the whole semester to work on it. Finding group mates that won't free ride the project is most important. If everyone had an even contribution in the project it should be quite easy to finish everything on time. Some small summaries to be submitted during the semester to monitor your progress on the project.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "XTaO4RIPDiYWqgicZE4f1vmYTLDfPFQM",
                    "name": "2016 Fall Syllabus MARK 3220",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "4fUBfPEAovYyOmKWBcc3GvpwFgOoJnA2",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 773,
                    "name": "LIN, Song",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Chan Lok Yiu",
            "date": "Jan 21, 2016",
            "title": "",
            "comment_content": "It's generally about how to do a marketing research. The content is quite useful and straight-forward.",
            "comment_teaching": "The professor is always well-prepared. However, you need to jot notes during classes.",
            "comment_grading": "Quite good. All my quizs are higher then the mean by 1 SD/ 2SD and I got a B+. But I expected a better grading.",
            "comment_workload": "Workload is heavy as you need to do a Marketing research project throughout the whole semester and it is quite difficult. Also, there are totally 2 quizzes and 1 final exam which are non cumulative.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JB9LYzszTwkHbJ2geZt5uicilRjg79W9",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 773,
                    "name": "LIN, Song",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lychau",
            "date": "Jan 12, 2016",
            "title": "",
            "comment_content": "The content is not hard to understanding as each lesson only covers very little content. Only some test in the analysis part may require more attention.",
            "comment_teaching": "Prof Song Lin is very nice. Compare to Ralf it seems his class has less workload. His powerpoint is also very neat and tidy. If you listen to his examples in class you can understand the concepts easily.",
            "comment_grading": "Pretty good most of the quizes are quite easy. You can get good marks easily",
            "comment_workload": "Only the project may require more logical thinking. It is important to think carefully in the planning stage. Especially designing the questions for your questionnaire. Other areas that may need more effort is to ask your friends to participate in the focus group.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zbJnnJ0rvFIpXk0enWvHNkaeGahTkMwK",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 514,
                    "name": "WANG, Wenbo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ajay kumar",
            "date": "Feb 04, 2022",
            "title": "ECON2123",
            "comment_content": "content is easy if you did DSE Econ.<br />Just the simple Macroeconomics concepts.",
            "comment_teaching": "her teaching is quite good. she is pretty straightforward and makes everything flow very easily. strongly suggest you take her class. she is very nice and patient. she had all classes on zoom, mid term on zoom too. only need to go to uni for final exam. best econ prof so far. do register her class if possible",
            "comment_grading": "her grading can be nice if you actively participate in her class and answer her questions. sometimes she gives extra credit for her effort in class. the quizzes and class participation is where you can maximize your grade. she said attendance is not needed but she gave some points for people who attended class and answered her questions.",
            "comment_workload": "not that much workload. just 3 assignments and 5 or 6 quizzes. most quizzes are pretty easy to do if you pay attention in class. the final exam can be a little difficult but mid-term is easy. just revise all material and make sure you don't spend too much time on drawing the graphs.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}