{
    "error": false,
    "course": {
        "id": 884,
        "subject": "MATH",
        "code": "2411",
        "name": "Applied Statistics",
        "description": "A systematic introduction to statistical inference, including the necessary probabilistic background, point and interval estimation, hypothesis testing.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1840,
            1830,
            1810,
            1740,
            1730,
            1710,
            1640,
            1630,
            1610,
            1540,
            1530,
            1510,
            1440,
            1430,
            1410
        ],
        "prerequisites": "A passing grade in AL Pure Mathematics / AL Applied Mathematics OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1014\" href=\"/review/MATH1014\" target=\"_blank\">MATH 1014</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1020\" href=\"/review/MATH1020\" target=\"_blank\">MATH 1020</a> OR  <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1024\" href=\"/review/MATH1024\" target=\"_blank\">MATH 1024</a>",
        "corequisites": "",
        "exclusions": "IEDA 2510 (prior to 2018-19), <a class=\"course-link\" data-subject=\"IEDA\" data-code=\"2540\" href=\"/review/IEDA2540\" target=\"_blank\">IEDA 2540</a>, <a class=\"course-link\" data-subject=\"ISOM\" data-code=\"2500\" href=\"/review/ISOM2500\" target=\"_blank\">ISOM 2500</a>, <a class=\"course-link\" data-subject=\"LIFS\" data-code=\"3150\" href=\"/review/LIFS3150\" target=\"_blank\">LIFS 3150</a>",
        "rating_content": 3.71,
        "rating_teaching": 3.27,
        "rating_grading": 3.73,
        "rating_workload": 4.27,
        "review_count": 103,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 542,
                "name": "YU, Chi Wai",
                "count": 50
            },
            {
                "id": 528,
                "name": "CHING, Avery",
                "count": 22
            },
            {
                "id": 1253,
                "name": "HU, Yu",
                "count": 15
            },
            {
                "id": 1202,
                "name": "XIA, Dong",
                "count": 5
            },
            {
                "id": 524,
                "name": "WONG, Chiu Fai",
                "count": 2
            },
            {
                "id": 689,
                "name": "LEE, Man Ching Kitty",
                "count": 2
            },
            {
                "id": 729,
                "name": "TO, Tsz Chung",
                "count": 2
            },
            {
                "id": 1480,
                "name": "ZHANG, Weizhong",
                "count": 2
            },
            {
                "id": 1662,
                "name": "YAO, Jing",
                "count": 2
            },
            {
                "id": 388,
                "name": "XU, Yan",
                "count": 1
            },
            {
                "id": 691,
                "name": "AU, Cheuk Yin",
                "count": 1
            },
            {
                "id": 884,
                "name": "ZHAO, Yuqi",
                "count": 1
            },
            {
                "id": 1118,
                "name": "YANG, Can",
                "count": 1
            },
            {
                "id": 1383,
                "name": "LIANG, Shixin Phyllis",
                "count": 1
            },
            {
                "id": 1407,
                "name": "ZHU, Huichen",
                "count": 1
            },
            {
                "id": 1448,
                "name": "ZHAO, Jia",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "nElucgQSM39fOuIPfZrOdjALwu4NJf3Y",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Brian",
            "date": "May 30, 2017",
            "title": "Uhh this is the uhmm best course in UST",
            "comment_content": "Probability, sets, RVs, expectations, descriptive stats, statistics, point estimators, hypothesis testing, and linear regression",
            "comment_teaching": "The umm teaching is uhh by far the bestuh part of the course. I have uhhhh taken a umm class with Avery before, and uhhh I have finally gotten accustomed to uhm uhh uhhh his uhh methods of uhm instruction. <br /><br />The uhh key is to ummm focus very closely on uhhhh what he says in class. Not just uhhh on uhhh what's already uhh on the given lecture notes, but umm every single &quot;uh&quot; or &quot;um&quot; he says. With uhhh each &quot;uh&quot; comes a uhhh complex combination of ummm emotion and uhhh uhh um ... meaning behind all those theorems and uhh proofs he writes on the board. Understanding these uhs is uhhh crucial to scoring well on the exams.",
            "comment_grading": "Mt mean 17/25<br />Final mean 30/70<br />Mean is B-<br /><br />You will get fucked by both because half of it is mcq.",
            "comment_workload": "WebWork<br />Overall not uh bad course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 40,
            "vote_count": 46,
            "voted": false,
            "is_upvote": false,
            "comment_count": 8,
            "attachments": []
        },
        {
            "hash": "B8N0XOsgF3deo4VjzOVBAKDPD38haWRZ",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "!gpa_god",
            "date": "Aug 09, 2021",
            "title": "Fuck the cheaters",
            "comment_content": "Chapter 1: Descriptive Statistics<br />Chapter 2: Probability<br />------<br />The tools for analysis<br />Chapter 3: Random Variables<br />Chapter 4: Estimation<br />Chapter 5: Hypothesis Testing<br />------<br />Testing Methods<br />Chapter 6: Simple Linear Regression<br />Chapter 7: ANOVA models<br />Chapter 8: Distribution Fitting<br />Chapter 9: Non-parametric tests<br /><br />Dunno why Dr Yu loves proving so much, that shouldn't be the main focus of 2411.",
            "comment_teaching": "I have no idea why people praise his teaching style like there isn't a better prof than him. (Personally, I find Prof. Edmund Chiang better than him). Maybe this is just personal preference.<br /><br />Dr Yu's English is intelligible, but not the greatest. He also purposely leave out a lot of the content in the notes so you have to attend the lectures and copy them down.<br /><br />Dr Yu tries very hard to make his notes look attractive to non-MATH students (aka students who despise the boring looking LaTeX default font). But unfortunately ending up with notes that are more colourful than my fucking RGB keyboard. He also includes some statistics-related comics into his notes, which I find pretty useful to explain some of the more abstract concepts.<br /><br />This is another personal aesthetics preference but the inconsistent font size triggers the fuck out of my eyes. Sorry bud, I ain't 70 years old. No need to shove that coloured extra BOLD + underlined shit into my face.",
            "comment_grading": "40% Assignments (4 assignments)<br />60% Final<br /><br />I am sorry, even to this day I still don't know what I scored in the final exam. Wanna appeal for your grade? NOPE, ZERO CHANCE.<br /><br />On a side note, so many people violated the webcam protocol. Hmm, I wonder why there's an entire page of motherfuckers basically just showing their face instead of their computer screen and their desk. As far as I am aware, Yu Chi Wai did not do anything to deal with the sUsPiCiOuS sTuDEnTs. #AcademicIntegrity my ass",
            "comment_workload": "4 assignments, usually 1/2 easy questions mixed with a few moderate level questions. Pretty manageable.<br />But don't be a deadline fighter, better start working on the assignments early cuz this guy doesn't accept late submissions.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 30,
            "vote_count": 33,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "dBf016RjTX3Py3GX4VTMHDZrZKU7IUVg",
                    "name": "NO PAPER CHECK FUCK YOU",
                    "format": "png"
                },
                {
                    "key": "CoR2LcK7gFPP7vmJXthMzceqAoiuEmB9",
                    "name": "CHEATING FUCKERS",
                    "format": "jpg"
                }
            ]
        },
        {
            "hash": "oqBdKtOgjhYrUhHj2rod7YtFlvJCeIR1",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LuckyTiger",
            "date": "Jan 21, 2022",
            "title": "Is Dr Yu Chi Wai okay?",
            "comment_content": "8 chapters.<br />Ch0 Intro<br />Ch1 Descriptive stats <br />Ch2 Probability<br />- messy after this point<br />Ch3 Random Variable<br />Ch4 part 1 Point valued estimation<br />Ch4 part 2 Interval valued estimation<br />Ch5 Hypothesis testing<br />Ch6 Simple linear regression<br />Ch7 Analysis of two independent random variables<br />Two-sample problems<br />Ch8 Distribution fitting<br /><br />Frankly, I don't know what I learnt this semester so I really can't elaborate much. To my simple mind, this course is just a bunch of formulas stacked one on top of another to build a tall tower of hopelessness, confusion and dread. Every time, I wanted Dr Yu Chi Wai to explain the idea behind the formulas, he would most often, immediately assure us that this will be covered in another course, and since this course is not a very advanced course, we don't have to worry about it. So in another words, he's presenting formulas, and expecting us to utilize them without knowing the meaning of these formulas in exams. That is also known as fraud.",
            "comment_teaching": "Firstly I have two concerns: his lecture notes and his <br /> delivery<br /><br />Respectfully, is Dr Yu Chi Wai okay? It seems as though he is oddly fixated and almost comedically ambitious in trying to make his lecture notes look different every 3 chapters. Let me dive into the intricacies of his lecture notes, which I analyzed and appreciated this semester.<br /><br />Chapter 1, 2, 3, 4: A4 pages of lecture notes. Wait, it seems like the notes.. are somewhat slightly misaligned. What the? I tried clicking on words, and it's actually non-clickable. Here's my theory: he used his precious time to print print out the notes using his ORIGINAL pdf file, and sloppily scanned every single page on the using the printer, hence the misalignment, and combined these set of into a pdf and give this weird pdf file to us on canvas. What was the purpose? Is he purposely trying to mess with students? I'm sure he is a good person, but what message is he trying to send to students?<br /><br />Chapter 5,6 : A4, finally, a set of lecture notes that are clickable, copy paste-able!<br /><br />Ch 7: Out of nowhere, Dr Yu Chi Wai comes in hot and he changes to powerpoint format. On the 63rd slide, he has masterfully added fashionable circles as design elements.<br /><br />ch8: He's back to no good again. It's the worst of the worst. This time, it is A4 but in each A4 page, there are two powerpoint slides. Unclickable. So his original file was a powerpoint presentation. Through hypothesis testing there is enough evidence to support that this statement is contained in the 95% confidence interval: using his original ppt file he changed settings to print out two slides per page, then he scanned these printed pages on the printer, combined them and gave us non-clickable, ppt slides on an A4 pdf file. <br /><br />God knows what he'll do next semester. Now, is there anything wrong with the formatting? No.&nbsp;&nbsp;I have mainly talked of the formatting of his lecture notes. Don't even get me started on the actual contents. There's a lot of color, rainbows, random clip-art, boxes and rectangles, some outlined, some filled-in with color.<br /><br />Next, his teaching: No.<br /><br />I think that he is a good person. No, he's probably a great person to talk to. I should have went to his office hours. I bet he answers questions easily and he's announced in class that he was a dean-list student at HKUST previously. However, critically speaking, his has no teaching capability to be teaching at a university position, let alone teaching. In fact, he seems to want to become a doodle/comic/manga artist seeing how passionately he tries to add it into math class. Did I mention, he made some male students choose between two hot female celebrities in class. No comments, I would consider that it is inappropriate.",
            "comment_grading": "There is simply no information on how I did on my exam. At the same time, I do not want to know. So I guess it's a win for Dr Yu Chi Wai and a win for me.<br /><br />Grade C.",
            "comment_workload": "Light, 4 assignments with 4-5 questions I think, that's it. However, the homework questions were really hard for me. I went to math support center and asked the student helpers who were so kind to spend, collectively, hours to help me with the questions. Truly saints. <br /><br />I think what I was supposed to do, is realize that this is a 4 credit course and try to learn through the textbook instead of getting a chance to complain about the instructor every chance I got this semester.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 14,
            "vote_count": 16,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "f8ISGeZGPDVseN6IjUHFj1kpYGh4Q5wu",
                    "name": "Chapter 3-min",
                    "format": "pdf"
                },
                {
                    "key": "ooxWDiTzTqSvR18BTNU569BbNu6B2T6F",
                    "name": "Chapter 6-min",
                    "format": "pdf"
                },
                {
                    "key": "efJ9nkEX1z6ydc8cFnYrCgeHr3PWpK6n",
                    "name": "Chapter 7_1_Two-sample-cases-min",
                    "format": "pdf"
                },
                {
                    "key": "zBuqIkXE9rstyfacY70Z0Z8IKgHZnm4z",
                    "name": "Chapter 8_Distribution_Fitting-min-pages-1-3",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "YE2bgQi004uLqYWZgkTACaFfCVYVScHb",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Think",
            "date": "May 20, 2018",
            "title": "Don't take this course from this instructor",
            "comment_content": "Permutation, combination, PDF, CDF, Z score, Chi-square, t-score, linear regression, etc. basic stat stuff. The course content itself is not bad. The only reason this course sucks is the instructor and the content of final. Don't need to give a thing about classes, just pick up a good stat book and prepare yourself for the ill-minded final. Class content does not help you at all the moment you enter the exam venue.",
            "comment_teaching": "It is better to have a 17 year old AP/IB taking student to stand on the podium to teach. Maybe he knows math, but he doesn't know how to teach math in a way that students would understand and apply it in solving problems. Moreover, he should see a doctor for his UUUHHing-between-every-word disease.",
            "comment_grading": "Midterm was easy.<br /><br />After final, you are murdered.",
            "comment_workload": "Just webwork. No need to go to class. In fact, it is better to not go to class in that you will have much more time to do other more productive stuff. Trust me, its waste of time to listen to him lecturing. Exam questions show zero relevance with the lectures.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 13,
            "vote_count": 16,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "CCZ5KaXZgh3g8fAVlPzm0TvAnXitHLSr",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Squidgy",
            "date": "Jan 11, 2021",
            "title": "I dunno what I took away from this course",
            "comment_content": "As what I mentioned above in the title, I have no idea about it.",
            "comment_teaching": "Yu Chi Wai is a professor with enthusiasm. BUT, I need to say sorry to all those Yu Chi Wai fans. His teaching is somewhat a disaster.<br />1. His strong accent of Cantonese makes his words become really vague and unclear, through his microphone and zoom, the situation gets even worse.<br />2. His lecture notes are useless for self-learners. He would write PLENTY of additional notes which are not uploaded to Canvas. Moreover, sometimes he used ppt that is different from the notes, and he didn't upload it as well. <br />I tried to concentrate at the course during 9 am with the ambiguous tongue and an unclear lecture notes, and I found it impossible, so I quit it.<br />Even I tried to look at the recorded video afterwards, the teaching style is still so boring and confusing. Maybe I'm just not a big fan of statistics :P",
            "comment_grading": "There are 3 classes, I don't know if the gradings are graded together or not.<br />My overall score: 67.9/100<br />mean: 66.2<br />Another class mean: 63<br />My score: B-<br />Just a poor grade class",
            "comment_workload": "4 assignments, so the workload is light. Everyone gets full marks,&nbsp;&nbsp;so the deterministic grading item is final exam. Good luck :P",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 9,
            "vote_count": 10,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QTJHkB0qBBq1e3atGz0kNKszqv1XwaJZ",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Marco_XD2000",
            "date": "May 23, 2022",
            "title": "A Professor who do not know what is he doing",
            "comment_content": "(Copy from another review)<br />8 chapters<br />ch0: Introduction to Statistics<br />ch1: Descriptive Statistics<br />ch2: Probability<br />ch3: Random Variables<br />ch4.1: Point-valued Estimation<br />ch4.2: Interval-valued Estimation<br />ch5: Hypothesis Testing<br />ch6: Simple Linear Regression<br />ch7: Analysis of two independent random variables<br />Two-sample problems (Confidence Interval and Hypothesis Testing)<br />ch8: Distribution Fitting Or Distribution comparison<br /><br />Do not choose this course if you have another choice.",
            "comment_teaching": "The lecture is boring. Dr.Yu was just reading his boring powerpoint and his speaking tone makes me want to sleep. However, since we have to open the webcam for attendance, the whole lecture feels like torture.<br /><br />The final exam was a mess. The exam instruction was unclear and need many clarifications. There are no clear instructions on how to submit exam answers, figuring out how to submit the answers by ourselves is also a part of the exam. If you cannot submit your answer within 3 mins, you are over. <br /><br />Also, the communication between professor and TAs seems insufficient. Sometimes the TAs teach something out of syllabus. The night before the final exam, the TAs sent an exam Zoom link to us. And the next morning, Dr. Yu told us not to trust the TA and provided some new Zoom links.<br /><br />The TAs are pretty good tho. I can really feel their passion for teaching.&nbsp;&nbsp;They prepared the tutorial materials well and they can explain the solutions clearly. Actually, I think I learned more in the tutorial than lecture. Some self-study and tutorials should be able to understand most of the materials.",
            "comment_grading": "Scheme 1: HW (35%) + Exam (65%)<br />Scheme 2: HW (30%) + Class participation (10%) + Exam (60%)<br />3 asm 1 final<br />Need to open camera for class participation",
            "comment_workload": "3 assignment 1 final, workload is light.<br />However, if you want to aim for a high grade, an enormous amount of self-studying is needed. <br />The reward is not proportional to your effort in this course. If you are the type of a little bit hard-working person who wants to get a good grade without solid background knowledge, this is not the course for you. If you are a very hardworking person with 100% determination to get an A+ no matter what, this is the course for you.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 7,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "odlJDKM13ytSO5kErk0cQgz3wuiigFVf",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "別問我是誰",
            "date": "Jul 20, 2015",
            "title": "內容簡單易理解既 stat course",
            "comment_content": "開頭教d probability (MT 亦主力考呢d)，跟住有 random variables, point estimation, confidence interval, hypothesis testing, linear regression, goodness of fit test，同埋R (一個stat software)。<br /><br />final 個陣佢講明會出 R 既題目 (比input問output / 問input)，結果出左4-5條o係short questions，要背定部分 R functions 先好去考。",
            "comment_teaching": "由於我無上過 lectures, teaching 既grade 係比教我既 TA。<br /><br />如果純粹想讀完呢個stat course就算, 唔想理解背後既原理, proof, 某程度上成個course 只係上tutorial 同埋溫 tutorial notes 就夠。教我個ta整既 notes 精而簡，上堂個陣亦講解得好清楚。<br /><br />TA個網: https://sites.google.com/site/ustmathxing/2411",
            "comment_grading": "MT Final 都 above mean 0.3-0.4sd，最終拎 B。比起1013/1014就當然好grade得多。",
            "comment_workload": "我每星期只係上一堂一粒鐘 tutorial (已經足夠)，workload 不高。",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H1nVIU5JDaeWGGKqDjNMUOh7slhJsAs1",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SargeSmoke",
            "date": "Dec 23, 2022",
            "title": "Subpar Statistics Course, but I recommend to take something else",
            "comment_content": "The content of this course covers the following 8 Chapters:<br />1. Descriptive Statistics<br />2. Probability<br />3. Random Variables<br />4. Estimation (Maximum Likelihood Estimators, Bias, Confidence Interval)<br />5. Hypothesis Testing (t-test, p-test)<br />6. ANOVA (Two-Sample Tests, F-Distribution, Tukey HSD)<br />7. Linear Regression (Least Square, R-squared)<br />8. Compare Distribution (Q-Q Plot, Kolmogorov-Smirnov Test, Pearson’s Chi-Squared test)<br /><br />Introduction to a multitude of statistical methods, concepts and their applications that are important for future courses such as machine learning. Important concepts, but are taught much better elsewhere",
            "comment_teaching": "Professor Yu paces himself quite well, he actively answers questions in class and encourages students to answer his questions regarding certain topics. However, he still possesses certain glaring issues in his teachings.<br /><br />My first main issue is the lack of recordings of the lecture, as it forces students to always attend his lectures, otherwise, they will miss important key ideas, solutions and proofs that are integral to solving certain exam questions. (P.S. I do not understand the focus on proofs in homework + exam questions when the course is focused on application). This is an issue since the Professor intentionally removes solutions to examples or even full proofs from the slides; if you do not have them, you better research now or else you cannot solve HW or Exam questions. <br /><br />Additionally, the Professor intentionally refrains from posting the full lecture slides on a specific chapter, as such, I literally have to re-download the same lecture slides multiple times since it is always updated at the beginning of the lecture. <br /><br />Lastly, his actual explanations of the concepts in class are quite vague and convoluted. They are not intuitive in the slightest and I am even more confused about the concept after his explanation. In essence, attend his class for solutions and proofs, and delve further into the explanations behind the content after class.",
            "comment_grading": "Homework Sets (4 x 10%)<br /><br />Midterm (30%) - Mean: 54.05%, Median: 53%, Upper Quartile: 67%, Lower Quartile: 43%<br /><br />Finals (30%) - Mean: 53.35%, Median: 55%, Upper Quartile: 65%, Lower Quartile: 43%<br /><br />Homework should not be neglected as they contribute a significant portion to your overall grade. Getting below the mean within a Homework Set will set you back a sub-grade, and the Mean for each Homework Set is roughly ~95%.<br /><br />Examinations are non-cumulative, as such the Midterm Examinations covers Chapter 1-4, while the Final Examination covers Chapter 5-8. All questions on the exam are variants of examples covered in class/homework or require conceptual understanding from lecture content. Therefore, by simply familiarising yourself with the slide's contents (especially the examples) and writing important equations in your cheatsheets, you can do decently in the exam. Exam questions will include proofs, hence, if the Professor focuses on deriving certain equations during lectures, be sure to record the procedure and understand it. Additionally, certain R code syntax questions will appear, be sure to note down each R Function and what each parameter is for during exam preparation (honestly, pretty stupid to ask about code syntax).<br /><br />I scored below the mean in the Midterm, and above mean in the Finals. All my homework sets are around mean and my final grade was B.",
            "comment_workload": "Homework sets are released monthly (in the middle of the month), ranging from 5-8 Long Questions. Each question requires careful calculations or proofs. All Homework Sets will require certain questions to be completed in R, so be sure to familiarise yourself with the syntax. Most homework would require 2-3 days to accomplish, so be sure to start early (do not be like me who stays up till 10 AM finishing a homework set).<br /><br />Exam preparation will include preparing a sufficient cheatsheet containing notable equations, R syntax/code and procedures. It is important to spend some time familiarising yourself with the slide's examples as a variant of them might appear in the exam. Spend a good few days before the exam studying to perform decently.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "Ep0NtQ6OWQCoOJALY7tnr8IpJTy7WAx5",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rind",
            "date": "Dec 22, 2020",
            "title": "The details will be given in MATH2421...MATH3423...MATH4432 :)",
            "comment_content": "Chapter 1: Descriptive Statistics<br />Chapter 2: Probability<br />------<br />The tools for analysis<br />Chapter 3: Random Variables<br />Chapter 4: Estimation<br />Chapter 5: Hypothesis Testing<br />------<br />Testing Methods<br />Chapter 6: Simple Linear Regression<br />Chapter 7: ANOVA models<br />Chapter 8: Distribution Fitting<br />Chapter 9: Non-parametric tests<br /><br />This course teaches you all the things you need to analysis data without giving much details on how the formula is coming from...However, you have to know something that NOT IN THIS COURSE to explain many formulas and equalities. That makes everything hard...<br /><br />Moreover, there will be so many symbols representing many abstract quantities. You will be overwhelmed by the symbols. Make sure that you know how to calculate each quantity to get your answer :)",
            "comment_teaching": "Well, I will say his English is not bad but lacking emphasis and intonation (will be much better if you watch the video 1.5x).<br /><br />Very interesting drawings and slides in the class. His notes are missing so many essential parts which will be examined, do remember to jot notes in class :)<br /><br />Maybe this semester he teaches MATH3423, and he will teach MATH 2421 in spring. He always talks about details in MATH 2421/3423. I am not saying this is not good. If you love statistics and find these topics interesting, then it will be great. However, for someone like me not very interested in statistics and don't know WTF is going on when he talks about those things in higher level courses, it feels bad. I feel horrified every time he said &quot;In MATH2421, 3423, 4423...&quot;. I understand why he is doing this because the content in this course are difficult to explain without the extra details. Well, maybe it is just for curiosity, maybe we can just ignore all these contents :D<br />BUT some of these extra details will be examined in the final exam with some hints that state some facts in MATH2421, OMG, HOW AM I GONNA DO THIS????<br />Maybe it will be great if you study this course after taking MATH 2421??? I am pretty sure you will get an A.",
            "comment_grading": "40% assignments<br />60% final<br />Assignments:&nbsp;&nbsp;best 3 out of 4 (very good policy)<br /><br />The final is difficult, I am speechless.<br />One student asked him before the final whether mgf will be examined. He said no :)<br />But it appears in the exam. WTF???",
            "comment_workload": "4 assignments<br />No attendance<br />1 final only",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "NHqkm85Kv83QWTzUFzQUEUDI1nEDr4AJ",
            "semester": "2016-17 Summer",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "iluvpeggyb",
            "date": "Jan 16, 2018",
            "title": "Math 2411 Review",
            "comment_content": "Chapter 0:Introduction to Statistics<br />Chapter 1:Descriptive Statistics<br />Chapter 2:Probability<br />Chapter 3:Random Variables<br />Chapter 4:Confidence Interval maybe? (i forgot lol<br />Chapter 5:Simple Linear Regression<br />Chapter 6:Hypothesis Testing maybe? (i really forgot&nbsp;&nbsp;<br />Chapter 7:Confidence Interval and Hypothesis Testing<br />Chapter 8:ANOVA models<br />Chapter 9:Distribution Fitting",
            "comment_teaching": "Dr. Yu is a very good professor. He is the most patient teacher I have met in my life probably. Sometimes when I come up with some stupid ideas and ask him about that, he never scolds me for wasting his time.<br /><br />His lecture notes are very creative and informative. Even you skip some of his lectures you can still catch up by self-studying. Though I suggest attending all the classes. :)",
            "comment_grading": "Good. There are two marking schemes in this courses.<br /><br />s1: 90/100<br />s2: 95/100<br /><br />Maybe ppl in summer term are too good, finally i get an A.",
            "comment_workload": "It's adequate. Do all the review questions in Dr. Yu notes and revise them about 100 times is more than enuf.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kjk7WjJTBRCVrbiyrIjxp4bPVfwjwRvk",
            "semester": "2016-17 Summer",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Seeking4u()",
            "date": "Aug 29, 2017",
            "title": "A course that teaches you how to prepare cheat sheet and use calculator",
            "comment_content": "Introductory statistics course with little emphasis on proof.<br />0. Introduction to Statistics<br />1. Descriptive Statistics<br />2. Probability<br />3. Random Variables<br />4. Estimation<br />5. Hypothesis Testing<br />6. Simple Linear Regression<br />7. Confidence Interval and Hypothesis Testing<br />8. ANOVA models<br />9. Distribution Fitting",
            "comment_teaching": "The instructor is friendly and approachable. You can ask him questions after the class ends or during office hour. He will briefly review concepts taught previously at the beginning of lesson. He also goes through review questions step by step to let us know how to &quot;apply&quot; statistics to solve problems.<br />Skipped most of the tutorials so no comment for TA.",
            "comment_grading": "There are two grading schemes for this course.<br />Midterm: 35%<br />Final: 65%<br />OR<br />Final: 100%<br />The higher score will be used to determine your grade. If you bomb your midterm exam, you can make a comeback in the final exam. Overall the grading scheme is pretty lenient. Just make sure you don't make careless mistakes so that you can stay in A range.",
            "comment_workload": "Only one midterm exam and one final exam. Light since this is &quot;applied&quot; statistics, you don't have to know what's going on behind the formulas. A well prepared cheat sheet (1 double sided A4 for midterm and 2 double sided A4 for final), technique to play with calculator and carefulness will lead you to A range.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PREspsKZyIIWJJ24RJRSfLRoDVjQvdiR",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Techni",
            "date": "Jun 02, 2017",
            "title": "實用又吾太難Grade既MathCourse",
            "comment_content": "PS︰本人冇M1底。<br /><br />MidTerm前既野︰<br />一開始既Probability係冇乜用既；<br />跟住有D高級D既Probability︰Binomial同Poisson；<br />不過跟住既Expectation好重要，又實用；<br />跟住既StandardNormalDistribution超重要，超實用！<br /><br />MidTerm後既野︰<br />主要有3種Distribution︰StandardNormal、ChiSquare、Student。我地會學點樣用吾同既樣本數據，配合埋上面果3種常見既Distribution尼估計可靠既數字，包括整體既平均數同標準差。",
            "comment_teaching": "PS︰本人冇上過Tutorial。<br /><br />AVChing︰表裡不一既阿叔。<br />佢係出哂名既Killer，佢Kill在佢出既卷超難，試面上既書都未必搵到佢既出既題型，但係佢比Grade倒係幾靚。<br />上佢頭果幾堂，可能因為佢既語氣同個Tone，我真係超想打佢…= =|||不過之後就習慣了…<br />其實佢教書教得吾太好，因為吾多會教你計實數，只係會係咁講Theory…同埋佢教書淺入深出既程度太吾合理…<br />不過佢勝在對教書有好強既責任感同熱誠，佢超吾介意你地去佢Office，趁佢咬緊三文治時問佢數，佢仲會噴住屑片咁好仔細咁教你做數…= =|||<br />雖然佢思試有D守舊，同幾嚴肅，不過佢都幾鐘意嘗試幽默一下同埋鼓勵我地再接再勵。<br />最後！佢比Grade堅鬆手！5成人ABRange！",
            "comment_grading": "Overall︰Stand Normal Distribution。<br />20% A，30% B，30% C，20% D/F。",
            "comment_workload": "好似每兩個禮拜一次Webwork，你吾想做既可以去Math.SupportingCenter Chok D答案番尼。我地依然有超好人既杜子聰同AVChing。",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZrvKOHX4OWPD1YH8BS0f7mi9X1RKokuB",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "gossipgirl",
            "date": "Jun 10, 2016",
            "title": "",
            "comment_content": "Mainly divided into 2 parts : Probability and Statistics. <br />Probability part is bearable... Statistics part is boring and difficult to visualise.",
            "comment_teaching": "Don't take this course if he's teaching. Lecture notes are badly written. No slides used. Notes released for every class after the class. No numerical example in the notes (Ya right and he called it a statistics class!)",
            "comment_grading": "Webwork 5%<br />Midterm 25%<br />Final 70%<br />Too much weightage on the final... Means tend to be very low ... ~11/25 for Midterm and ~33/70 for Final.<br />Mean + Sd&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--&gt;&nbsp;&nbsp;B+/A- <br />Grading is not very harsh but the course experience is pathetic.",
            "comment_workload": "Very little workload. Cumulative Final.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GFy1MBJphLOxJw1GER3mnm3Rb0R8o4Y8",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1662,
                    "name": "YAO, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ahzzzz",
            "date": "May 24, 2023",
            "title": "MATH2411 not that bad in this semester?",
            "comment_content": "---Content For Midterm---<br />1. Descriptive Statistics<br />2. Introduction to Probability Theory<br />3. Discrete &amp; Continuous R.V. and Probability Distribution<br />---Content For Finals---(including 1-3)<br />4. Parameter Estimation: Point Estimation &amp; Interval Estimation<br />5. Hypothesis Testing<br />6. Simple Linear Regression<br /><br />R code will not be tested in the exam",
            "comment_teaching": "Among all the horrifying Math lecturers I ever met, Prof. Yao's teaching is not bad. She has a relatively clear accent and her delivery is not bad.&nbsp;&nbsp;<br /><br />Just that this is a Math course in UST, if you are not that interested in math, watching the recording or going to University Youtube can save you more time.<br /><br />Go to the tutorials if you think they are helpful.",
            "comment_grading": "Two grading scheme<br />10% Homework + 30% Midterm + 60% Final<br />OR<br />10% Homework + 90% Final<br />Maximum of the total scores between the two schemes will be take to determine the final grades<br /><br />---Statistics and Grade---<br />Midterm: 43.5/50 (max =50, Q3 = 46, Q2, 42.5, Q3 = 35)<br />Final: 61.5/80<br />Letter grade: A- (Overall 81.675)<br /><br />係我眼中出乎意料地leng grade.... 可能因爲math course absolute grading 嘅原因? 但佢地final冇俾任何stats所以好難講<br /><br />(As a statistics course they do not release much statistics, interesting....)",
            "comment_workload": "Almost 0 workload.<br /><br />You get four assignments which are easy and straightforward. Furthermore in this semester, they put less attention in R code. R is only required for the assignments which is really a blessing.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "wu7MINGpF2pZ4bVQch281LYme2d5qYtS",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yuanfu",
            "date": "Feb 16, 2023",
            "title": "Controversial but really good for me",
            "comment_content": "Allow me to paste from other's as I'm too lazy:<br />1. Descriptive Statistics<br />2. Probability<br />3. Random Variables<br />4. Estimation (Maximum Likelihood Estimators, Bias, Confidence Interval)<br />5. Hypothesis Testing (t-test, p-test)<br />6. ANOVA (Two-Sample Tests, F-Distribution, Tukey HSD)<br />7. Linear Regression (Least Square, R-squared)<br />8. Compare Distribution (Q-Q Plot, Kolmogorov-Smirnov Test, Pearson’s Chi-Squared test)<br /><br />Comment: Really helpful for all future researchers. Note that the R language is used and will be tested, but my COMP 1021 level understanding is enough.",
            "comment_teaching": "Comment: Depends on what you expect. Some students who expect an engaging atmosphere may get disappointed as Hu Yu is not that type of instructor. In addition, his slides may not be clear enough for a brief review before exams. However, he can clearly elaborate every idea in his slides, and he gives some proofs in class, which are not tested but are useful for the higher level math courses. He is also willing to answer students' questions with brief and organized words. The TA might be less helpful, but as long as I have become the only one attending the tutorial, I could freely ask any questions with respect to my homework.",
            "comment_grading": "40% Homework * 4 (Me: 100/100; 100/100; 95/100; 100/100)<br />30% Midterm on chapter 1-4 (Me: 83/100)<br />30% Final on chapter 5-8 (Me: 81/100)<br />Letter grade: A+<br /><br />Comment: Extremely good grade as there is no other math courses that generously evaluate 40% of your performance by open-book, open-discussion, and open-web assignments. Moreover, the contents of the exams are quite similar to the problems in the assignments. Students are allowed to bring an A4 cheat sheet to the exams. As long as you can understand the assignments (the concepts, the proofs, but NOT ONLY the formulas) and get them close to 100%, you can definitely get into A range. Compared to the notorious Y* C** W**, Hu Yu is definitely the choice for this course (disclaimer: I have never taken any course instructed by Y* C** W**).<br /><br />Edit: Some others say that the exam time is very limited. Indeed, I totally disagree. Nearly no calculation or derivation of formulas is needed during the exam, so the examination time is at least manageable for me. Just don't try to learn the course material from the cheat sheet during the exam.",
            "comment_workload": "Comment: Quite light for a 4-credit math course. Only 4 problem sets with about 4 questions each, and as discussion is encouraged, all students get very high scores. Personally, it takes me 3-4 hours for a problem set, but I will discuss for additional 1-2 hours with my classmates. Since an A4 cheat sheet is allowed, understanding, which usually comes from classroom and does not take time to review, is much more crucial than the formulas on the cheat sheet. In short, a 3-4 hour review before the exam is enough. I won't tell you I started the revision one day before the final exam, and stayed up late for the World Cup final that night right before the examination date.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "M9tsnmSsjI3Gso530tG7OPNLCwqa5yf2",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yhanbai",
            "date": "Dec 25, 2022",
            "title": "the instructor is to blame",
            "comment_content": "The content definitely covers most of the important statistics concept, but not in a systematic way. You will find yourself sometimes confused&nbsp;&nbsp;in some more complicated examples because some fundamental knowledge are not taught in advance. For those who do need t statistics in future career, I highly recommend you look for a legit textbook and learn from the very beginning. I have seen the textbook from ISOM2500 and ELEC2600 (both are statistics classes) These textbooks are well-organized and fully explained. I sincerely recommend any students consider these 2 courses if math2411 is not required by your major.",
            "comment_teaching": "Prof Hu clearly doesn't have any experience in teaching UG students. <br />1. Forget about his attitude. He could make multiple mistakes in his slides, and he actually won't release a complete version of slides to the students because he simply won't finish his slides. (he loves preparing his slides along the teaching progress, which I think is so irresponsible for students who want to preview the contents)<br />(he doesn't feel like changing his bad habit even if some students ask for it)<br />2. He is simply so bad at making students understood the contents. IDK probably he is too smart, he could not resonate with&nbsp;&nbsp;students' learning thinking pattern. So you can find him failing to explain some basic concepts. This is lethal for beginners in statistics, like me. After the final exam, I still find myself lost in some basic concepts. (eg. Q_Q plot chapter, his teaching was legit trash, so I refer to ISOM2500 textbook. It includes vivd graphs and and formal definitions. I simply discuss with my friends for about 20 min and manage to get it lol)",
            "comment_grading": "40% hw<br />30% mid<br />30% final<br />all exams last for 1.5 hr. Wildest dream ever! 不想出考卷直说OK？<br />grading curve is not bad at all, I simply want to roast the percentage.",
            "comment_workload": "I think it's fair for a 4 credit course. Even though much work you put on it is meaningless lol.<br /><br />Still, highly recommend you take ISOM2500 and ELEC2600&nbsp;&nbsp;if 2411 is still taught by Hu Yu.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vIuXNrbifBV2N3MhxkjwYAX4vV7qPN7T",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 0
                },
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Serendipity",
            "date": "Dec 30, 2021",
            "title": "So stupid course",
            "comment_content": "Chapter 1: Descriptive Statistics<br />Chapter 2: Probability<br />------<br />The tools for analysis<br />Chapter 3: Random Variables<br />Chapter 4: Estimation<br />Chapter 5: Hypothesis Testing<br />------<br />Testing Methods<br />Chapter 6: Simple Linear Regression<br />Chapter 7: ANOVA models<br />Chapter 8: Compare Distribution<br /><br />Content not clear enough to tell students what the course is doing. Btw, almost all his notes are from other profs.",
            "comment_teaching": "So bad. I keep watching his recording half of the semester and usually it costed me the whole Saturday to review the course material. However, l started to self studying afterwards and it is much quicker than watching the recording. But if l met some questions during self learning and I came back to watch the recording, his teaching does not help me at all. He just repeated the notes.",
            "comment_grading": "4hw 40% Almost everyone get full marks<br />final 60% mean24 high53<br />So bad. Even though you studied all semester and reviewed so hard during final preriod, you can not even get above mean score.",
            "comment_workload": "Intermediate. 4 hw during the semester, but all questions about R code won't be taught at class, you have to learn it yourself. TA will only give you a more 130pages pdf for you to self-studying.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "fn9T5ijM9Gid1VrWxEd2rQuBwLNhkKjd",
                    "name": "0.-Introduction",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "8aAP7iL7QYdlXIOfL7oTtAan2X0qHx9P",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Dc528",
            "date": "Mar 17, 2021",
            "title": "同想象有落差",
            "comment_content": "內容如往年一樣<br />如Course title, 應用居多, 唔太會教你derive啲式, 變相背野多",
            "comment_teaching": "開頭啲野簡單都ok, <br />但越教Tone越悶, 會成日講out sy野, 無重點<br />Lecture notes都一般, 難自學",
            "comment_grading": "40% Asm 60% Final<br />Asm大部分人都滿分, Final決勝負, <br />Final居多concept題, 唔喺靠操就得<br />Asm: 滿分 Final: 唔太記得<br />Overall: below mean 1.x 分, C+<br />Overall mean: 5x, sd: /<br />Fair grading",
            "comment_workload": "無mt <br />4cred嚟講得4份Asm, 每份都唔算多",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H1KLC6En4LPxECN1PWyjJ1Zx0HvKUSI8",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "hayden tse",
            "date": "May 21, 2018",
            "title": "實用、唔太難；如果avery ching教，自問自學能力強先好take，leture,note,textbook全部都好廢",
            "comment_content": "Before midterm:<br />Sets <br />Probabilities<br />Random Variables<br /><br />After midterm:<br />Expectations<br />Descriptive Statistics<br />Statistics and their Distributions<br />Estimators<br />Hypothesis Testing<br />Linear Regression Model<br /><br />midterm前都係中學core野，冇m1野<br />今個sem教得好慢，cut左好多野<br />anova提過下但冇考，regression model只需要識代數字砌公式<br />重點係Hypothesis Testing",
            "comment_teaching": "開sem前已經有唔少人同我講過av清啲堂係廢嘅<br />我上咗一堂就明白點解佢可以咁出名<br />av清講野lag機好多&quot;um&quot;，表達能力可以用毛新宇黎形容<br /><br />[毛新宇]教你在兩分鐘之內不斷說話但是什麼都沒有說https://youtu.be/6ncLfulLj8Y<br /><br />tutorial個TA會email份note俾我地，note有練習，答案就要上堂對",
            "comment_grading": "好似係分唔同tutorial黎計grade<br />hw5%<br />7份webwork mean4.11/5<br /><br />midterm25%<br />mean15.24/25, sd6<br />9題mc 3題long questions<br />俾左1份pastpaper<br /><br />final70%<br />mean28.5/70<br />13題mc 3題long questions 2.5hours<br />會俾2份pastpaper，但因為今個sem cut咗太多野，pastpaper冇參考價值<br /><br />我total52.29, mean47.85，b-",
            "comment_workload": "同其他math course一樣，得hw midterm final唔多野做<br /><br />av清嘅note係for你已經明左個理論之後溫習用<br />學個理論就靠上堂<br />不過佢嘅堂實在太廢，我成個sem只上左2堂<br />全部野都係睇textbook、youtube、khan academy自學<br /><br />textbook:<br />&quot;Probability and Statistics for Engineers and Scientists&quot; (7th Edition Prentice Hall) by Ronald E. Walpole, Raymond H. Myers, Sharon L. Myers and Keying Ye.<br />本書本身冇問題，問題係av清唔跟書教，自己free style，textbook深過佢好多，所以好難睇書自學",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "d2WKQhhr0osekEKPXwAC25Sh81t8ehz3",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "stereo",
            "date": "Dec 18, 2016",
            "title": "爛notes爛grade但係內容有趣",
            "comment_content": "今個sem進度慢 (紅日, 8號波, 佢教得慢 etc), cut左好多野冇教<br /><br />Midterm前教既Set Notation同Counting &amp; Prob都係DSE內容<br /><br />Midterm後教Statistics, Estimator, Hypothesis Testing, 同埋極入門既linear regression (同2111既linear regression做法好唔同)<br /><br />course content其實唔錯既...",
            "comment_teaching": "上lecture其實還好, 但係佢份lecture notes廢到喊, 上網搵tutorial notes仲易明+ 好用過佢果份, 未見過有lecture notes會冇寫final有用既式<br /> *** final都未考就搵唔返佢d lecture notes rofl ***",
            "comment_grading": "5% webwork, 25% midterm, 70% final<br />midterm final 都唔難, 但係個grade勁爛<br /><br />midterm 滿分25, mean/SD 16.15/6.16; <br />final 滿分70, 可以帶任何print出黎既野, mean/SD 45.9/13.84<br /><br />course overall mean/SD 66.59/19.06, 高0.4個SD有B.... 高0.96 SD A-",
            "comment_workload": "no workload, 得7份webwork, 每一份都唔難<br />做final pastpaper 10題有8題都因為cut syllabus而唔洗做, 自己做tutorial既example或者帶埋入去試場睇算啦2333",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5YPAvzaAZqtgJh0QyL2bCo8E1hg8Bilm",
            "semester": "2014-15 Summer",
            "instructors": [
                {
                    "id": 524,
                    "name": "WONG, Chiu Fai",
                    "rating": 1
                },
                {
                    "id": 729,
                    "name": "TO, Tsz Chung",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "The Last A",
            "date": "Aug 16, 2015",
            "title": "",
            "comment_content": "Summer上<br />佢cut左p－value個科<br />mid－term前係probi<br />final係stat d野<br />如果有讀過m1係會幾易carry既一科<br />後期goodness／anova個d同小學sub數無分別<br />而且比用計數機，final係好易既一件事",
            "comment_teaching": "黃超廢唔太識用英文教書<br />口疾到呀媽都唔認得<br />有唔明自己私底下去佢office搵佢教仲好<br />佢廣東話講野係正常但成日帶人遊花園<br />ta都幾好人",
            "comment_grading": "都幾爛grade下<br />mid term踩mean＋final 近滿分都追唔到<br />最後得B<br />final好多人都好高分，變左midterm分grade<br />total mean應該得c<br />不過每個instructor唔同grade自己睇返",
            "comment_workload": "得mid-term同final<br />其實真係好輕鬆<br />分別係4：6比例<br />但衰一個個grade都差好遠",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8B3v0GseQW7Qsb0719TaIp0C3Dabdirj",
            "semester": "2022-23 Summer",
            "instructors": [
                {
                    "id": 1662,
                    "name": "YAO, Jing",
                    "rating": 1
                },
                {
                    "id": 1383,
                    "name": "LIANG, Shixin Phyllis",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "APKB",
            "date": "Jul 30, 2023",
            "title": "Nice Prof but bad grade due to few quota, Comments from M2 students",
            "comment_content": "Set, Probability (M1 level), R.V., Normal/Poisson/Binomial Distribution, MGFs, Point Estimation, z-/t- table and chi-sqaured table, Hypothesis Testing, Simple Linear Regression<br /><br />Some simple R language function.<br /><br />Emmm, if you took M1 before, it will be a easy course. But some integration and e^x series involved. Quite boring actually.",
            "comment_teaching": "Prof explains so many proofs and so kind to answering questions. Good ppt and accent of English.<br /><br />IA explains exam-orientedly. Tutorial is very useful. She is so gooodddddd at explaining and demonstrating. Can speak Cantonese, Mandarin and English.",
            "comment_grading": "Only 51 students in class, so it is hard to have good grade. Those elites are too strong and careless mistakes bring you downgrade. <br /><br />30% Assg<br />70% Final (1-page A4 cheatsheet, too easy)<br /><br />95.325% → A",
            "comment_workload": "10.5 hrs lecture per week and 3 hrs of tutorial per week. (total 4 weeks)<br /><br />4 assignments and a final exam only. Each assignment costs about 2 hours to finish. (make me don't understand why it is a 4 credit course in this summer)<br /><br />Oh ya, just do some DSE M1 or HKALE M&amp;S past paper, also some QB before exam.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vxNmT5Cdo9ZgDvEN9xJ94rVpIURy7nrZ",
            "semester": "2021-22 Summer",
            "instructors": [
                {
                    "id": 1480,
                    "name": "ZHANG, Weizhong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nic14",
            "date": "Aug 15, 2022",
            "title": "Good grade; Take 2421 first",
            "comment_content": "Typical content of MATH2411<br /><br />Textbook: Probability and Statistics for Engineers and Scientists 9th edition (The book is only for MATH major students)<br />(1) Descriptive Statistics (Chapter 1)<br />(2) Introduction to Probability Theory (Chapter 2)<br />(3) Discrete Random Variables and Discrete Probability Distributions (Chapter 3, 4, 5.1, 5.2, 5.5)<br />(4) Continuous Random Variables and Continuous Probability Distributions (Chapter 6.1, 6.2, 6.3)<br />(5) Point Estimation, Interval Estimation, Testing Hypothesis (Chapter 8.1-8.7, 9.1-9.6, 9.8-9.14, 10.1-10.5, 10.10-10.11)<br />(6) Simple Linear Regression (Chapter 11.1-11.6)<br />(7) ANOVA (Chapter 13.1-13.3)<br />(8) [If time permits] Goodness of fit test/ Non-parametric statistics (Chapter 10.11)<br /><br />The last lesson is a revision session, so non-parametric statistics were not covered. Also, the professor excluded the following materials in the final exam:<br />F Distribution<br />ANOVA<br />Goodness of fit test (aka chi-squared test)<br /><br />Topic (2) - (4) are knowledge from MATH2421, but they take up 5 weeks in this course. The professor teaches (1)-(2) slowly to make sure everyone gets the basics, but he went through (3)-(4) quickly and only a limited amount of distribution was included. So you better take 2421 before this course.<br /><br />The programming language used is Python, instead of R in previous semesters. Personally, I think Python is easier.",
            "comment_teaching": "The professor's teaching is acceptable.<br /><br />He tends to teach slowly in the beginning to make sure everyone gets the basics. This could be boring if you already know the content. In the later half of the course (statistics part), his speed returns to normal, so you will feel better.<br /><br />When he teach, he would first read the powerpoint slides. There is evidence that he made the slides himself, especially since this is my first time seeing CS style powerpoint slides in MATH courses. Then use whiteboard app to demonstrate some examples so you understand how to calculate.<br /><br />He also speaks quite slowly. It would be better if he could speak faster. Also, this semester is face-to-face but he did not come to the classroom, so you can enjoy face-to-face zoom teaching in the classroom.<br /><br />My suggestion is to take 2421 first and skip the first 6 weeks of lectures.",
            "comment_grading": "Very good grading.<br /><br />30% Assignments. (mean = 95.3)<br />10% PA. (PA1 mean = 79.8, PA2 mean = 85.4)<br />60% Final Exam. (mean = 59.55, median = 60)<br />Overall mean = 71.68, sd = 18.75<br /><br />I heard someone with total score 91 A+ and 85 A.",
            "comment_workload": "The workload is light.<br /><br />7 Assignments. They are questions from the textbook and you can check the answers. The first 4 covers the probability part and are longer at 15-20 question each. After some students complained about the length of homework, the remaining 3 (statistics part) is reduced to 5-8 questions.<br /><br />2 PA. The PAs are simple and short (typically within 30-40 lines). The professor gives out part of the answer in class or by Whatsapp and Wechat groups. You only have to read through the code and change/add a little bit yourself. The professor said he intensionally made the PA simple since some students may not use Python before.<br /><br />1 Final Exam (2 hours). Open notes (only materials in canvas). The exam is slightly more difficult than other instructors, some questions combine content from different topics and are not discussed in class. However, the exam is not long (6 short questions only), so you could finish easy questions first and still have enough time to think.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FpFtRwTgc9Niuo0qOuJV42PpCeYzG6t9",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SamuelLee",
            "date": "May 06, 2022",
            "title": "On the perspective of A level entrant",
            "comment_content": "Probability, distributions, estimation, confidence interval, hypothesis test, ANOVA, and quantile plot are the topics. Most topics involve the use of R.<br /><br />As I have completed IAL S1 and S2, I think 50% of the material has been gone through, and in terms of hypothesis testing it has more depth than breadth (there is no approximation in hypothesis test).",
            "comment_teaching": "Dr Yu speaks in a monotonic way and requires us to turn on our camera, and he assigns each of us a class number. This semester he was like a high school teacher. His lectures were boring overall and I learnt more through the tutorials or seeing web pages. <br />The TA was OK, despite he is from mainland China his accent is still understandable and he explains the examples quite clearly. The only downside is that he forgot to release one of the assignment solutions.",
            "comment_grading": "2 schemes.<br />Assignment x3 (30% or 35%)<br />Class participation 10% (only scheme 1)<br />FInal 60%/65%<br /><br />My scores:<br />Assignments: 90 95 92 (mean: 90 86 87)<br />Attendance: 100<br />Final: 48/90 (mean: 30, sd: 13)<br />Overall: 69.22/100 (mean: 54, high: 75.9)<br />Grade: A<br /><br />I thought I messed up the final exam but I feel very surprised when I got close to the highest score.",
            "comment_workload": "Just three assignments this semester, and a final exam. Not too large. However, try to download the textbook and do questions from it if you want a better grade.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fU9VL18zUbKeDA3EeOINiqP94N0cXqDC",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "珍珠鸡",
            "date": "Jan 23, 2022",
            "title": "課堂內容比較多",
            "comment_content": "課程內容包括很多不同知識點，不但是紙墨筆的統計學運算，還要學習用R裡面的program去出答案。內容雖然多，但只要理解了，其實每種統計方法背後的操作都差不多。包括最初的一些比較簡單的venn diagram和probability的運算，各種Test以及Hypothesis的結合與運用，其實都挺有趣的，但是文字比較冗雜。",
            "comment_teaching": "教授的課件有出現一些精美可愛圖案，有提神作用，但是ppt內容很冗雜，重點知識不突出，上課也不太有趣。因為有recording，f2f的課由一開始坐滿到midterm的時候已經快寥寥數人了。",
            "comment_grading": "雖然內容比較繁複，但是百變不離其中，所以只要理解了一些，後面很大部分都能懂。我比較懶惰，基本中後期已經沒再上過課了，recording也沒有補，只是每份assignment再追看之前的ppt，已經能夠補給知識然後HW挺高分，之後的final用了兩天複習所有ppt，還可以準備cheatsheet，最後C+，雖然grade不高，但自認根據我的學習努力程度，C+已經算是這樣了。",
            "comment_workload": "Workload不高，大概是20幾天一份hw，每份hw三至四大題，都有20幾天時間做，時間很充裕；一個sem總共有四份hw，足夠追及過往知識。<br /><br />沒有midterm，只有final。",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EwD2yS5pgPlhzJNSOgqPNM8QprVU39DS",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "adrainkwok",
            "date": "Jan 22, 2022",
            "title": "Don't know what have I studied",
            "comment_content": "8 chapters<br />ch0: Introduction to Statistics<br />ch1: Descriptive Statistics<br />ch2: Probability<br />ch3: Random Variables<br />ch4.1: Point-valued Estimation<br />ch4.2: Interval-valued Estimation<br />ch5: Hypothesis Testing<br />ch6: Simple Linear Regression<br />ch7: Analysis of two independent random variables<br />Two-sample problems (Confidence Interval and Hypothesis Testing)<br />ch8: Distribution Fitting Or Distribution comparison<br /><br />Very hard to understand after chapter 2<br /><br />Chapter 5 is very vital as it is very useful in the later chapters!!",
            "comment_teaching": "The lecturer was interesting but teaching is poor. I had to spend hours to revise the teaching materials to learn the things. I think I just have to attend the tutorial as the tutor taught the same things.<br />However, he was good at drawing manga .",
            "comment_grading": "4 Hw + 1 Final<br />1: 100/100<br />2: 100/100<br />3: 85/100<br />4: 90/100<br />Final: Don't show marks<br />Grade: A<br /><br />He told us that the passing rate&nbsp;&nbsp;of his lecture was higher than the another ones.",
            "comment_workload": "4 Hw + 1 Final<br />Challenging problem Sets (spending a lot of hours to think of the answers)<br /><br />Can bring a A4-sized cheat sheet to the exam, copy as much as possible<br /><br />The final exam consist of MCs (super horrible), short questions and long questions.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eepZjX1oxTO7aCs7Cl80K1xjKPKgH5Vm",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                },
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "juuuuuuruo",
            "date": "Dec 22, 2021",
            "title": "NO Take if you have other choices",
            "comment_content": "He will only tell you （actually tell you from ppt modified by other instructor before) if you know something, then the other things is what what what distribution without any explanation.",
            "comment_teaching": "Huyu just read the ppt and read aloud the ppt and end the class, YCW will blow water whole class without telling you anything valuable. What I can do is just only read the poor ppt modified by other instructor.<br /><br />Also you need to self-learn R-code, which is meaningless and stupid comparing to Python but some still keep to use, maybe they just only know that. So stupid to self learn and also the exam will contain R-code",
            "comment_grading": "4 HW weight 10% separately and final exam weight 60%, YCW said he is too lazy to make the midterm.<br /><br />The due of HW is stupid at the afternoon instead of 2359.<br />I submit the HW4 a week before the day and make a mistake resubmit again(just change a file name) at that day 2100. Huyu keeps the HW rule to reduce me 70% of the HW grade, which means 7% total assessment.......A little grade lower........<br /><br />final:<br />mean/me/high/full<br />24/30/53/69<br /><br />So stupid final paper, meanless course",
            "comment_workload": "self-learn depends.<br />for me I just read the poor ppt.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wF9DZLYgI6Jp8luG0FGptxLcdnSW0x4c",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wscc",
            "date": "Jan 26, 2021",
            "title": "",
            "comment_content": "Contains probability, random variables, estimation, hypothesis testing, linear regression, ANOVA, distribution.<br />Not very difficult.",
            "comment_teaching": "HU Yu is better than YCW. But the class is still kind of boring. HU always shuts down the video very quickly, just one second after he says &quot;the class is over for today&quot;, so there's no time to ask for questions after class.",
            "comment_grading": "Not good.<br />Almost everyone got full marks in the assignments, which counts for 40% of the total grade. TA didn't check the assignments very carefully, I had a mistake in data but still got a full mark. The final exam counts to 60%. So the final is decisive factor. <br />Mean can only get c+. Higher than mean about ten point can get B+.",
            "comment_workload": "Four assignments and one final exam, no midterm.&nbsp;&nbsp;Each assignment has four questions. If for the first three assignments you all get the full mark, you don't need to do the fourth one. <br />Quite slight workload compare to other courses.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IljZTBMBZg5JFNngOxo6s39GxYASWbc3",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 1202,
                    "name": "XIA, Dong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JJThompson",
            "date": "Jun 08, 2019",
            "title": "Xia Dong gives WAY BETTER grades!!!",
            "comment_content": "Basic Statistics, where you can definitely handle without any rigorous stat knowledge background. If you did M1 in DSE, you should know a lot of the covered contents.<br /><br />Contents as follow in Chapters:<br />0. Introduction <br />- Basics definitions<br /><br />1. Descriptive Statistics <br />- Box&amp;Whisker, 3Ms, etc...<br /><br />2. Probability <br />- Conditional Probi, **Baye's Thm**(very important in Midterm)<br /><br />3. Random Variable (*POPULATION*)<br />i) Probability Mass, Density functions, Expected value E(x), Variance Var(x) <br />[with EASY single var Calculus]<br />ii) Distributions: Binomial, Poisson, ***Normal*** <br />[learn how to identify when use which distribution]<br /><br />4. Estimation<br />i)&nbsp;&nbsp;Point Estimator: Biasness, Precision, Goodness of point est.<br />[Use many E(x), Var(x)]<br />ii) Interval Estimator: **Confidence Interval (C.I.)**<br />[Z,T,Chi-squared, basically refer to these 3 distribution tables]<br /><br />------- Midterm -------<br /><br />5. Hypothesis Testing: <br />i) Null(Ho) vs Alternative(H1), Type 1 &amp; Type 2 Errors, Power<br />[Reject or NOT reject Ho, One-sided(&gt;or&lt;), Two-sided(!=), simple]<br />ii) Z,T,Chi-squared Test using Ho &amp; H1 <br />**[Concept same as C.I. (Chap 4ii)]**<br /><br />6. Simple Linear Regression<br />- Linear regression <br />**[Use your calculator and programs]**<br /><br />7. Two Sample Testing<br />- Concept same as Chap 5, but analyze 2 variables <br />[Added F Distribution and F tables]<br /><br />8. ANOVA (Analysis of Variance)<br />- Compare significance difference in variances for &gt;2 populations<br />[USE CALCULATOR PROGRAM, DON'T WASTE TIME!]<br /><br />------- Final -------- (Cumulative)<br /><br />I don't know about the exact situations of previous semesters, but Prof. XIA is giving out simpler contents. Contents are well organized and much more trivial than most MATH courses.<br />They are really easy, so prepare for high means though not as high as I had expected.<br /><br />HWs are trivial and you will manage to finish them shortly with the lecture notes. HW mean is around full as usual.<br /><br />On my opinion, contents after midterm are far more straightforward and require more or less the same concepts: C.I.s and Hypothesis tests. So if you can master them, you can consider all-in final.",
            "comment_teaching": "Personally, the lectures and tutorials are quite boring, but nevertheless I like how Prof. Xia teaches as he sometimes would make some jokes that turn the atmosphere more joyful (though nb laughes usually XD). <br /><br />I think Lectures are definitely not necessary, you can skip all of them if you don't mind losing the bonus and confident enough. Self learning and occasional practices are more important. I read through the notes before lectures and found contents not difficult to follow.",
            "comment_grading": "This semester the grading is split into 2 schemes and take the higher one:<br />Scheme 1: 5% HW + 30% Midterm + 65% Final<br />Scheme 2: 5% HW + 95% Final (All-in)<br />Additional 5% Bonus from Attendance.<br /><br />Mean of my session (vs me):<br /><br />Midterm: <br />52.34/70 (57/70)<br />Final: <br />59.97/90 (82/90)<br />Total: <br />71.03/100 (91.56/100 Scheme 2)<br />[Excluding the Bonus]<br />Grade:<br />Mean ~= B- (A+)<br />[P.S. I didn't expect to have Scheme 2 marks higher.]<br /><br />Printed/Handwritten Cheatsheets can be brought, 1 and 2 pieces of A4 papers respectively for Midterm and Final.<br /><br />For details of the exam formats and grade distribution you can refer to the other review post of this 1819 Spring Sem.<br /><br />In particular, there will be many A+ questions scattered around Lecture notes and Tutorial notes which will be tested in both exams (1 question per exam). You better know how to do them if you want good grades, and if you don't understand how to do them, SIMPLY COPY THEM INTO YOUR CHEATSHEETs and GET ALL THE MARKS, these questions in exams will be 99% the same as the A+ questions in Notes.<br /><br />Meanwhile, as I mentioned in Content, use your calculator wisely and include useful programs and build-in regression functions to reduce your error and time. I used normal fx-50fh only and you will find handful of programs online to handle most questions.",
            "comment_workload": "Workload is very light:<br />- 4 Canvas HWs which are easy<br />- 2 exams<br />- 5% attendance<br /><br />Worth taking to boost grades with lowest effort.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dJVmVQ5vrMEbwb5IhsTd7yWYUraXQtqQ",
            "semester": "2017-18 Summer",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Shirleyyyyy",
            "date": "Aug 23, 2018",
            "title": "",
            "comment_content": "before midterm is mostly what you have learned from high school(m1)<br />after midterm we are learning about hypothesis testing/simple linear regression/distribution fitting<br />i didn't study m1 in high school <br />but i think it's not hard to study this statistic course if you pay effort",
            "comment_teaching": "not bad but prof speaks so fast <br />and his pronunciation is not clearly enough<br />but if you pay attention you can still understand what he is saying",
            "comment_grading": "two grading systems<br />1: mt30% final70%<br />2:final100%<br />use the higher score<br /><br />mt:<br />max 70/70<br />min 18.5/70<br />mean 58.44/70<br />median 62.5/70<br />final:<br />mean 44.28/60<br /><br />me: mt 63/70 final 45/60<br />got a B+<br />that's not bad for me &gt;&lt;",
            "comment_workload": "no workload at all<br />there is no homework only one midterm and one final<br />just do revision and prepare well <br />that's enough",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BoEeTZrmCz7w8uVzoaOEqjC2yVKf7YkH",
            "semester": "2017-18 Summer",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                },
                {
                    "id": 689,
                    "name": "LEE, Man Ching Kitty",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MrBlueWhale",
            "date": "Aug 22, 2018",
            "title": "Oh My God Easy Grades",
            "comment_content": "Pretty introductory course about pretty easy stuff there is not much difference about this than M1 from what I have heard for at least the first half of the course. And IB statistics options is more than enough for the first half of the course again. A levels further higher math would rekt everyone in the first half of the course without studying. Proofs and difficult stuff will be in other higher level courses",
            "comment_teaching": "Pretty good but then the stuff he teachers are easy",
            "comment_grading": "Oh my god good grades everywhere. This year plp did well but instead of curving our grades to dog shit and punish everyone for doing well he gave everyone good grades!!!!! 10/10!",
            "comment_workload": "Finish the tutorial stuff which is not a lot and listen in class not much extra exercises is needed. In fact he goes through all the questions in his midterm during his review session in the midterm so if you listen you will do very well. A lot of plp get high scores, so you may I have to look for careless mistakes in exams.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 3,
            "attachments": []
        },
        {
            "hash": "xJO2wi0Hz4syw5ld62ruMzGQk3HUQXnq",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tomy Chan",
            "date": "Dec 18, 2016",
            "title": "",
            "comment_content": "This course is applied math and the questions type are applied too. But the notes is theoretical. The contents of reference books is quite easy which help you to have a better understanding on the concept. But the level of exercises is too low compared with those question in the midterm and exam.",
            "comment_teaching": "The instructor explain the concepts clearly. But there are too less examples. Also, the examples are easy compared to midterm and exam.",
            "comment_grading": "I got C+. Don't know mean and sd.",
            "comment_workload": "You should make sure that you have a full understanding and do more exercises as the questions in the exam is strange.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RjcnZLfFtY2iieIu5Gl5NAxsYAzS19PY",
            "semester": "2013-14 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "有名你叫Hea精",
            "date": "Aug 08, 2015",
            "title": "",
            "comment_content": "基本入門STAT野<br />有讀過M1既人話係M1野黎姐<br />對MAJOR MATH既人黎講 唔會好難<br />但如果你自問對DSE MATH既PROBI好厭惡 <br />如非必要就唔好揀喇 事關MT前都係呢抽野",
            "comment_teaching": "佢教書都幾悶<br />英文唔係好好聽<br />但個人好NICE<br />上過兩堂咁多姐<br />所以佢教成點就唔多評論~",
            "comment_grading": "我唔知FINAL考成點<br />但我估我MEAN多少少啦<br />MT就岩岩好MEAN<br />我拎B <br />MATH入面算係咁啦<br /><br />兩份都係考MC+SHORT Q",
            "comment_workload": "0<br />除左NOTE入面有D練習上堂做下<br />無咩特別要交既野<br />TUTORIAL我無上過<br />所以我唔知有無練習",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MHw9ARE7IrrfoA13SvODXAJ0FgyMerN4",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "whateverla",
            "date": "Aug 18, 2023",
            "title": "The details will be discussed in MATH2421",
            "comment_content": "descriptive statistics, probability, Naive Bayes classifier, random variables, point estimation, interval estimation, hypothesis testing, simple linear regression, ANOVA model.<br /><br />This course is good as an introductory course in statistics, and the content is well arranged. What is more uncomfortable is that some conclusions and theorems will be interspersed with proofs, and then I have a hard time reviewing these proofs, only to find that the exam only tests calculations and some standard question types, which makes me review lonely. But if you are interested, it is still very interesting to deduce these things.",
            "comment_teaching": "The tutorial is still quite useful. Although TA is LIKE a bit Buddhist, it is more comprehensive. It will also talk about the contents of assignments, give you an idea and even directly tell you the answers to some questions.<br /><br /><br /> One of the most common words of YCW is: The details will be discussed in MATH2421/MATH3423 (probability/statistical inference). . . Because 2411 still focuses on the application of concepts and conclusions, he did not expand on the proof part but left it in other courses (however, I have already finished MATH2421 taught by Xia Dong and Xia Dong did not expand on these things)",
            "comment_grading": "At the end of the term, prepare a cheat sheet of R codes and a cheat sheet of notes. When reviewing, you should practice R codes so that you can know how to input data and get the answer with the simplest code during the exam; you should also practice calculations, and if you have spare time, get familiar with some hands on calculation procedures. There are one or two questions in the exam that will allow you to calculate by hand without using R codes. At this time, you need to be familiar with the corresponding steps and calculate quickly.",
            "comment_workload": "NOT TOO BAD FOR ME",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QLPOoNjBEsbtgx1CsImVizpzq3nnU92Z",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "A for sure",
            "date": "Jul 20, 2023",
            "title": "比effort就靚grade course",
            "comment_content": "Ch. 1 Descriptive Statistics<br />Ch.2 Probability<br />Ch.3 Random Variables <br />Ch.4 Parameter Estimation<br />Ch.5 Hypothesis Testing <br />Ch.6 Simple Linear Regression <br /><br />basic background by myself: dse m1 5*, math major SF track<br />Content 唔多，算係易handle嘅一個math course，可以自學到，功課要用R，MT冇出過R但final 有要求你揀啱嘅data做數，頭一半嘅content如果有M1 底可以skip（除非你自己唔記得哂啲野），後面hypothesis testing 同linear regression 係煩少少如果啱啱接觸，其他都還好。",
            "comment_teaching": "之前睇啲review話ycw教得好差，我覺得又未去到差，但真心有啲悶，見啲人話佢上堂成日prove啲冇用嘅野，佢係真係成日prove野，但又唔係全部都冇用，final最尾嗰條proof佢上堂有講。我差唔多都有上每一堂，雖然可以睇返片但佢會成日上堂派handout同寫啲notes冇嘅野，所以上堂係為咗安心。",
            "comment_grading": "Scheme 1: HW（10%) + MT (30%) + Final (60%) <br />Scheme 2: HW (10%) +MT (0%) + Final (90%) <br /><br />HW 1: 95/100 (mean: 88.6)<br />HW 2: 100/100 (mean: 86.5)<br />HW 3: 100/100 (mean: 87)<br />HW 4: 100/100 (mean: 82.8) <br /><br />MT: 47/50 (min: 0, Q1: 35, Q2: 42.5, Q3: 46, max: 50)<br />I would say this is the easiest MT ever! I lost 3 marks because of the graphs.<br /><br />Final: 61.5/80 (min: 0, mean: 42.9, max: 73.5)<br /><br />Final grade: A",
            "comment_workload": "4 Assi<br />1 MT<br />1 Final<br />pretty light workload",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "X4WRBMQSkhkpAuooPE9isNVkXcOd7ps0",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hatsunemiku",
            "date": "Jun 04, 2023",
            "title": "Fair grading for average ust math course(?",
            "comment_content": "---Content For Midterm---<br />1. Descriptive Statistics<br />2. Introduction to Probability Theory<br />3. Discrete &amp; Continuous R.V. and Probability Distribution<br />---Content For Finals---(including 1-3)<br />4. Parameter Estimation: Point Estimation &amp; Interval Estimation<br />5. Hypothesis Testing<br />6. Simple Linear Regression<br /><br />R code will not be tested in the exam",
            "comment_teaching": "Bad accent.<br />Poor teaching attitude.<br />Helpless professor.<br />Poor PowerPoint slides.<br />Anyway, I attended 2 lectures and skip all the remaining lectures,<br />Khan academy, rpbp, Herman Yeung etc. are always your help",
            "comment_grading": "I think you may only get interested in the grading.<br />For other details please see other's comments.<br /><br />For me,<br />Assignment: 92,100, 88, 88 /100 (mean: 88.6, 86.5, 89.0, 82.8)<br />Midterm: 44/50 (mean: 35.69)<br />Final: 44.5/80 (mean: 42.86)<br />Letter grade: B (Overall 68.9%)<br /><br />Relatively good grading for a math course lower than 70% still gets a B grade.<br />Relative grading.",
            "comment_workload": "4 assignments only",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "csGRmfrcCz8XUYvtjv5VqFk5xOpw9Bnx",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "LLLLLLouis",
            "date": "Jan 30, 2023",
            "title": "",
            "comment_content": "1. Descriptive Statistics<br />2. Probability<br />3. Random Variables<br />4. Estimation<br />5. Hypothesis Testing<br />6. ANOVA<br />7. Linear Regression<br />8. Compare Distributions<br /><br />Midterm: Ch.1-4<br />Final: Ch.5-8<br /><br />One two-sided A4 cheatsheet is allowed for both midterm and final. But no paper checking for midterm (and final).",
            "comment_teaching": "Notes reader and there are many mistakes in lecture notes.<br /><br />Another thing is, there are no lecture recordings available unless you request for it. The TA would not give the lecture recordings to you if you do not provide a suitable reason and proof. So basically forces you to attend every lecture.",
            "comment_grading": "HW 40% (Each HW 10%, 4 HWs in total)<br />Midterm 30%<br />Final 30%<br /><br /> The mean is around B-",
            "comment_workload": "4 HWs in a whole semester. Each HW has about 4 questions",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "B3uIPulsDuVXb9y8OT1TDXU6usnHpTsM",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Moony",
            "date": "Oct 19, 2022",
            "title": "Hard to accomplish, need special attention on homework",
            "comment_content": "Basic understanding of statictics, not hard. The content arrangement is satisfactory. However, the course slide is designed in an unacceptable manner. Hard to figure out the key point.",
            "comment_teaching": "Acceptable teaching. Since it is a statistics course, it will be better if focus more on the knowledge itself but not on how to prove it is true.",
            "comment_grading": "Easily get below mean on homework set, then C+ or B- taken. The grade scheme is quite different from the other Math course, the four homework set are weighted heavier than midterm.",
            "comment_workload": "Compare to practice problem, hard to finish. Weighted heavily in grade scheme.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gaPsdPXtVwYAgB7IIyYZ3p1uogVNgxZV",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nobody...",
            "date": "Aug 21, 2022",
            "title": "",
            "comment_content": "This course covers the below topics:<br />- The basics of probability theory<br />- Conditional probability<br />- Operations of probabilities<br />- Discrete and continuous random variables<br />- Probability distributions<br />- Expectation<br />- Moment generating functions<br />It gives a systematic introduction to: <br />- Statistical inference<br />- The point and interval estimation<br />- Hypothesis testing<br />- ANOVA<br />- Linear regression<br /><br />Also, the software environment for statistical computing and graphics &quot;R&quot; is needed to be used. R codes are included in the course.",
            "comment_teaching": "It is in online mode. Only lecture notes (PowerPoint) are given. He expected us to write notes in lectures so the notes are not completed. Also, the notes are different from the ones he used in the class.",
            "comment_grading": "No midterm exams and have two grading schemes. <br />Scheme 1: <br />HW (35%) + Exam (65%)<br />Scheme 2: <br />HW (30%) + Class participation (10%) + Exam (60%)<br /><br />- That no late submission will be accepted.<br />- The maximum of our total scores will be taken to determine our final grade. <br />- The counting of the class participation is after the Add/Drop period.<br /><br />The requirements for class participation are below:<br />(1) Turn on your cam (Face shown clearly) during lectures.<br />(2) Use a valid Zoom name with an assigned number.<br />(3) Join a lecture not less than 65 minutes in total.<br />(4) Use a SINGLE zoom account to join a lecture. <br /><br />*All the above requirements need to be fulfilled in order to get the corresponding class participation.",
            "comment_workload": "Total having three assignments and a final exam.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vl0FWdbAw0xFKFl9EFaY2DSqrhh5UpwR",
            "semester": "2021-22 Summer",
            "instructors": [
                {
                    "id": 1480,
                    "name": "ZHANG, Weizhong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sofy Twilight",
            "date": "Aug 12, 2022",
            "title": "Good Grade (Instructor factor)",
            "comment_content": "Well Just like statistics (I said something like this before?)<br />Basic descriptive statistics<br />Intro. to probability<br />Random variable<br />Distribution function (Multivariable required when taught, but not required in exam)<br />Expected value<br />Confidence interval<br />Likelihood function<br />Maximum Likelihood Estimation<br />Hypothesis testing<br />Linear Regression<br />============================== (Scope 'till final exam)<br />ANOVA<br />Estimate of distribution function",
            "comment_teaching": "Just like ordinary Department of Mathematics<br />Keep talking, keep listening, and keep sleeping<br />But the professor is a good guy<br />I attended some tutorial in the early stage of the course, Ms. Liang's tutorial notes are quite good",
            "comment_grading": "Very good grading<br />According to Prof.<br />33% A-range<br />42% B-range<br /><br />30% Homework<br />10% Programming<br />60% Final Exam<br /><br />I scored: <br />28.5/30 (Mean should be like this) Homework<br />10/10 (Mean should be like this) Programming<br />55.8/60 (Mean: 35.73 SD: 13.32) Final Exam<br />94.3 (Mean: 71.68 SD: 18.75) Total<br />A+<br />Actually very good, I expected A only",
            "comment_workload": "Light, Just 7 homework, mark on do-or-not basis<br />The programming may need some Python ability, but you may master it very soon",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5dfTV7XJe5QWaOx3QfVWRSRgCxLZpyu4",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "wongyuning",
            "date": "Jun 13, 2022",
            "title": "interesting course, terrible exam arrangement",
            "comment_content": "Use of R software<br />Probability:<br />basic probability<br />sets<br />counting<br />conditional probability<br />discrete and continous random variables and their probability distribution<br /><br />Statistics:<br />point estimation and sample statistics<br />different distributions(ie. T distribution)<br />confidence interval<br />method of moment estimator<br />hypothesis testing<br />simple linear regression<br />ANOVA Model and tests",
            "comment_teaching": "I think Dr. Yu's teaching is ok. I can understand the content easily just by attending his lectures. Dr. Yu also include some practical examples in his lecture notes and show how to use R software to solve the problem. overall, i think his teaching is nice.<br />for TA, they are willing to answer questions but her shaky voice makes it hard to understand what she says during the tutorial. <br />The tutorial notes are useful since it includes some exercise. I basically prepare the final exam just by reviewing Dr. Yu's lectures and doing the exercise in the tutorial notes.<br /><br />However, there is a fatal issue in teaching part of this course. TA and professor lack communication. Due to this problem, TA may sometimes teach something that is out of syllabus,or did not teach anything about a certain chapter, etc. Furthermore, the lack of communication between TA and Professor also lead to another problem, a terrible exam arrangement.<br />We are only given 3 minutes to upload our written answer. We don't know anything about the rundown of the final, don't even know the ending time of the exam. Before the exam, a TA and professor sent 2 different zoom meeting to us. It is quite obvious that they don't know what each other are doing at all.<br /><br />for final, I believe that most student cannot finish all questions in time since time is very limited, but the question difficulty is adequate.",
            "comment_grading": "there are 2 scheme.<br />Scheme 1: HW (35%) + Exam (65%)<br />Scheme 2: HW (30%) + Class participation (10%) + Exam (60%)<br />you can solve the exam question if you have done your revision(my revision method is stated in teaching part)<br />I attend every class so i think the participation should be full mark.<br />Assignment 1: 97/100<br />Assignment 2: 95/100<br />Assignment 3: 98/100<br />final exam score: 52/90<br />my final grade is A+<br /><br />Note: there is no way to appeal for your score, so I don't know exactly which scheme is used for me.",
            "comment_workload": "1 final and 3 assignments, very light workload.<br />but need to do more practice(especially practice to use R instead of tables to solve problems) in your free time.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nKrd56BG0fqfAOWKBoKinSotKZtzPSP8",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Simon:)",
            "date": "Jan 11, 2022",
            "title": "A difficult course",
            "comment_content": "1: Descriptive Statistics (some basic things)<br />2. Probability (independent, union, complement, if you studied M1 before, then you can catch up this chapter easily)<br />3. Random variable (pdf, pmf, cdf, mgf, start on this chapter, things are more difficult)<br />4. Estimation <br />5. Hypothesis Testing <br />6. Simple Linear Regression <br />7. ANOVA<br />8. Compare Distribution (only 1.5 lessons)<br /><br />It will teach you how to use R ( a statistical program) to solve some problems. Many contents will not be fully explained as it is a beginner course of MATH 2421/3423. You will learn more when you study these courses.",
            "comment_teaching": "Although the speaking tone of Dr. Yu is very boring, he made many interesting figures and effects in his ppt. I didn't attend most of the lectures because it was very easy to fall asleep and it had recordings. <br /><br />Many stuff in this course can not be explained well and Dr. Yu always says &quot;you will know more about this when you study math 2421/3423&quot;. Therefore you need to memorize many things without having a full understanding. However, you can bring a 2-sided cheat sheet in the final exam.",
            "comment_grading": "4 assignments (40%, which means each one weights 10%) only and no midterm, final weights 60%.<br /><br />The mean of assignments are always 9x%<br />I got two assignments full, and 90% for the other two.<br /><br />The marks of the final are unknown and there was no paper-checking. However, it seems that the other class which was taught by HU, Yu could see their marks. Finally, I got C+. <br /><br />The final is super difficult so I think the grade is appropriate.&nbsp;&nbsp;But of course, I won't say this is a good grade course as much effort should be put.",
            "comment_workload": "only 4 hw, each 1 has 2 weeks to finish, so the workload is not high as a 4 credit course. The hw is difficult but you can search answers from chegg :). <br /><br />Much effort should be put into revising the course materials.&nbsp;&nbsp;Understand as much as you can!",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YhRDuBrYBqarPu5j4KvrEq60H3z8yCrO",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hayleychan",
            "date": "Jan 07, 2022",
            "title": "",
            "comment_content": "The whole course is teaching you how to use R to analyse the data. <br /><br />1: Descriptive Statistics (eg: histogram, line graph, quantile) <br />2. Probability (eg: independent, union, complement)<br />3. Random variable (eg: pdf, pmf, cdf, mgf)<br />4. Estimation (eg: estimator)<br />5. Hypothesis Testing (eg: z-test, t-test, chi sq test)<br />6. Simple Linear Regression (eg: y=a+bx)<br />7. ANOVA<br />8. Compare Distribution<br /><br />As I have learnt some part before, I think the content is not that hard but topic 3 and 4 is the hardest one.",
            "comment_teaching": "The teaching of Prof Hu is normal. He just use the ppt and explain on it. However, need some time for him to reply your email. And you may get the answer from the TA in tutorials only.",
            "comment_grading": "4 Assignment mean: around 85-95%<br />Final mean: 23.4/69 SD: 10 highest: 53<br />I got 3 assignments full mark 1 assignment 99/100 and 38/69 in the final exam. <br />I got an A grade which is much better than I expected. My friend got 18 in final and full mark in all assignments. Finally he got C+.",
            "comment_workload": "The workload of this 4 credit course is not too high actually. Only 4 assignments and the final exam. However, some assignment is too difficult and even the teacher in math support center don't know how to do lol. Besides, you need to self learn R program as the lecture don't talk much about it. And the final exam is too freaking hard. Need to spend a lot of time study on it. However the past paper is different from the real exam lol.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MYabi8RdCzSsdzYZfK9ZXWkjo0dwsCPi",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "haha1234",
            "date": "Jan 03, 2022",
            "title": "",
            "comment_content": "1.descriptive statistics<br />2.probability<br />3.random variables<br />4.estimation<br />5.hypothesis testing<br />6.simple linear regression<br />7.ANOVA<br />8.compare distribution<br />Basic stuff of statistics. Chapter4-8 is the core topic in my opinion. Since this is a introduction course to statistics compared to other courses, you will be confused by some concept which the professor think it should be taught in other courses.",
            "comment_teaching": "Hu Yu 's teaching is not bad. He explain everything clearly in the lecture notes although he will not make much extension. He asks whether we have questions from time to time. Even more he send us a questionnaire to help to improve his teaching. I could tell he do try his best to make his lecture understandable. Some of my friends complain another instructor YCW saying that both his teaching and lecture notes are terrible. So I would recommend Hu Yu if you plan to take this course.",
            "comment_grading": "40% assignment<br />60% final<br />Could not tell for the whole class since it share little statistics of this course. But for me it's quite good :). <br />Assignment full<br />Final 46 max69, mean23.4, high53<br />and it turns out A+.<br />The final composes of MC and written questions, most asking you some concept and do calculation based on it. But you need to allocate your time properly since there are quite many questions. And one two-sided cheat sheet is allowed.<br />But the content is not that difficult to be honest. So if you spend time on it i think it is not hard to get over 1/3 of the score to be above mean.",
            "comment_workload": "To be honest, the workload is quite light. Only 4 assignments in the whole semester and each include only 3-4 problems.<br />But you need to self-learn R code to solve the problem since the instructor will not teach much about it.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "McDW1Te9w7GowhpHmCMxcHkkh0ECDbC4",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "b2",
            "date": "Jan 23, 2021",
            "title": "Boring class with a bad grade",
            "comment_content": "The content is pretty standard statistical stuff with things like probability distributions, random variables, hypothesis testing, and regression models.<br /><br />There were also shorter topics near the end focusing on some new topics like ANOVA models and other models to use when we can't assume a normal distribution.<br /><br />One highlight about the content was the use of R software integrated with the course which I believe is extremely useful especially since this course is about applied statistics.<br /><br />There are quite a few proofs in this course so be prepared to understand the material in depth if you want a good grade. <br /><br />Overall it is better than MATH 2421",
            "comment_teaching": "The lectures are extremely boring with almost no interactions in the class. The professor's voice has no tonal shifts while speaking and a lot of pauses that are very distracting. Not engaging at all and perfect to put you to sleep.<br /><br />The TA's English was difficult to understand and they made a lot of mistakes in the tutorials which only helped to confuse me. I don't think I gained much by attending all the tutorials",
            "comment_grading": "Harsh grading. There were 4 assignments put of which the best 3 are selected and I got a full mark in each of them. However, since most people also get close to the full mark the main factor in determining your grade is the final exam.<br /><br />The final exam tested too much with too little time even though it was 3 hours long. Multiple sections with many proof questions. Thank god for the multiple choice section at the start of the exam.<br /><br />I got slightly above the mean in the final exam and my friend got a score on the mean. I ended up with a B- and he got a C+.",
            "comment_workload": "The best part about this course is the light workload with only four assignments, no homework and a single final. <br /><br />However, if you want a good grade I would advise you to practice every week and try to understand all the proof as they are tested in the finals.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BzLun71nk5maUcaHBYk5dlLcafrcOa1l",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LALA8310",
            "date": "Jan 12, 2021",
            "title": "Nice Prof",
            "comment_content": "This course covers the material about probability theory, random variables, probability distributions, expectation, a systematic introduction to statistical inference, including the point and interval estimation, hypothesis testing, and linear regression modeling, ANOVA, and goodness of fit test.",
            "comment_teaching": "patient and passion prof<br />use hand-writing notes and slides to teach<br />will always provide supplementary proof<br />will stay after zoom to ask questions and you can ask in Cantonese!!! You should reg him if you are local, he is good at answering questions in Cantonese than English!!",
            "comment_grading": "40% HW<br />60% Final<br />4 hw, but only count best 3<br />I got full mark in hw<br />and higher than mean ~5 scores, no median/sd/mean provided<br />And I got B",
            "comment_workload": "Light.<br />One assignment per 2-3 weeks<br />but you should take more time on revising his notes as they are useful!!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wsoKC5vwMAVn34QYWNxq9vUNEewzkqgq",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JYY",
            "date": "Jan 06, 2021",
            "title": "Useful course",
            "comment_content": "Goes through these chapters:<br />- Intro to statistics<br />- Descriptive Statistics<br />- Probability<br />- Random Variables<br />- Estimation<br />- Hypothesis Testing<br />- Linear Regression<br />- ANOVA Models<br />- Comparison Distribution<br />- Nonparametric Tests<br /><br />The course also teaches R studio for these chapters. Gives a good introduction to statistics.",
            "comment_teaching": "Professor tries his best to teach and is willing to take feedback as well as answer questions in class. <br />Tutorials were helpful as well.",
            "comment_grading": "60% exam<br />40% assignments (best of 3 out of 4 assignments)<br /><br />Exam mean: 42.1/100<br />Assignments: pretty sure most people got full marks the mean for each assignment was pretty close to full marks<br /><br />Very low mean for finals due to difficulty of exam. Final had 20 mc and lots of short answer questions which you either use write the answers, type them out, or use R code and submit them all in one pdf. Exam had way too many questions, impossible to do them all in the time given.",
            "comment_workload": "4 assignments, if you got full marks on the first 3 then you can choose not to submit the last one since they take the best out of 3.<br />Do have to study quite a bit and do more practice problems on your own to get better grades though.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sw8a1D315vzZ8WQqpxaTW97RIywqpsdX",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ogt",
            "date": "Dec 31, 2020",
            "title": "Introduction to Statistics",
            "comment_content": "Basic statistics content:<br />- Probability<br />- Basics of statistics<br />- Hypothesis testing<br />- Linear Regression<br />- a few other topics<br />- How to use R Studio<br /><br />You do not need to know many proofs, only a few covered in class. On the other hand, there are dozens of formulas to know, fortunately, our exam was open book.",
            "comment_teaching": "The professor has good intentions. He responded to questions during class attentively.<br /><br />I will comment that the grading transparency could be improved. After the final score came out, the professor said no grading scheme&nbsp;&nbsp;and no solutions would be provided for the final. How are we expected to appeal then?",
            "comment_grading": "60% final<br />40% assignments (best 3 out of 4)<br /><br />The final decide your grade, as the mean on the assignments was virtually full score and they only took the best 3.<br /><br />My final score: 52/100<br />Mean: 42.1/100<br /><br />Quite a low mean despite the exam being open book... The exam contained quite a few problems, some of which I was not very familiar with. It also had MCQs with multiple answers which is always tough.<br /><br />=&gt; B",
            "comment_workload": "OK.<br />Every assignment is fairly short and straightforward, just need to apply the formulas. I don't know whether they even look at your answers or just grade based on effort, because I got full score for every assignment despite some of my answers being a bit dodgy.<br /><br />For the final, I went through the lecture notes and did a few practice questions.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "w6zy8pgOKmqFO9nkU39MAyTy9ZGgYifp",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "『　　　』",
            "date": "Feb 29, 2020",
            "title": "",
            "comment_content": "Before Midterm<br />-Introduction to Statistics<br />-Descriptive Statistics<br />-Basic Probability Theory<br />-Random Variable and Probability Distribution<br /><br />After Midterm<br />-Parameter Estimation<br />-Hypothesis Testing<br />-Distribution Fitting<br />-Simple Linear Regression<br />-ANOVA Models<br /><br />Before the midterm, it is more about probability.<br />The most difficult part in the midterm should be moment generating function others should be not difficult to understand.<br /><br />After the midterm, it is more about statistics.<br />Make sure that you can follow the concepts of Estimator and Estimate (e.g. the difference between X_bar and x_bar). Then you should be able to follow the materials afterwards easily as those are just computational problems. For those who have a financial calculator, remember to take it to the exam as it is very useful to find mean var etc. and it is also very useful when you are doing questions related to simple linear regression.",
            "comment_teaching": "YCW is one of the best lecturers in the Math Department, he teaches really well in lectures (but the online recorded lecture video for the remaining chapters is very boring though...). You may ask him any questions after lectures and he is willing to stay behind to answer your questions if he doesn't have anything urgent to do after the lecture.<br /><br />Remember to attend his lectures if you want his notes, his notes are very precise but have many blanks that you need to fill in during the lecture and there are no lecture videos for his section but only Avery Ching's one, uhhhhh which is uhhhhh kind of uhhhhh &quot;interesting&quot; is provided",
            "comment_grading": "Midterm Statistics (Full mark 55)<br />Mean: 24.1971<br />sd: 10.44704<br />Max: 55<br />Median: 23<br />Min: 4<br /><br />Final Statistics: (Full mark 42)<br />mean: L1:25.1, L2:29.1<br /><br />Grading Scheme:<br />5% Webwork 5% Written Assignment 30% Midterm 60% Final<br />or <br />5% Webwork 5% Written Assignment 90% Final<br /><br />The Midterm is quite hard this semester, there consist of a bunch of short question(25 marks) and three long questions, I believe that most of the students have totally no idea on how to solve those 3 questions so the mean is below 25.<br /><br />The Canvas final consist of mostly R questions, so the final is kind of easy as all students can find the codes in the notes. As mentioned by other reviews there were serious technical issues during the final exam so the whole final was postponed for an hour. I believe the grading scheme was adjusted quite a bit because of this.<br /><br />The grading of this semester (this semester only!!!!) is very good.<br />I got 36 in the final and I got an A. And there is someone who scores a little below mean but still manage to get B-.",
            "comment_workload": "Normal Math course workload.<br /><br />Although the written assignment could be difficult, you can ask YCW for help if needed.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TlRcVdcydRU0bkjFd7G8A3201naoGbcX",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "MikhailB",
            "date": "Feb 27, 2020",
            "title": "",
            "comment_content": "The contents of the course are pretty interesting; the course covers all the basic statistical concept. If you did stat in school, there wouldn't be much new staff except R programming. R programming is pretty fun.",
            "comment_teaching": "The teaching is pretty bad. I personally did not attend any lectures or tutorials, and I did not even watch recordings of lectures because they are so useless. On the other hand, notes provided by the professor for the course are very good. + There are a lot of online stat resources that can teach you everything you need to know.",
            "comment_grading": "The midterm consisted of a lot of hard proof questions and the mean for it was around 30%. <br />We had a zoom-based final due to protests and the virus. The final was easy and focused primarily on R. <br />The mean for the final was 25.1/42.",
            "comment_workload": "If you did stat in school, then workload would be light. If not, then prepare to suffer.<br />There are three assignments; they require 30 min to 1 hour to complete each. Webwork Homeworks were easy (they only took max 20 min to complete).",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Fp9JKZMGr2D8H7sBMsePaFcV19cyCIxL",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ldd",
            "date": "Aug 22, 2019",
            "title": "Tough but Good Grade",
            "comment_content": "Everything the same as the Fall &amp; Spring Semesters. Due to the limit of time, Chapter 7 is omitted. However, if you want to have a better understanding of this course, I strongly suggest you follow the recommended textbook and do exercises related to each topic. The textbook provides proofs of some more fundamental theorems (not included in lectures). <br /><br />Here is the course syllabus:<br />Operations of Probabilities and Basic Counting Principles <br />Conditional Probability <br />Discrete Random Variables<br />Continuous Random Variables<br />Basic operations in R&nbsp;&nbsp;&nbsp;&nbsp;<br />Data Analysis <br />Point Estimation<br />Confidence Interval<br />Hypothesis Testing <br />Linear Regression<br />Goodness of Fit Test",
            "comment_teaching": "I can't fully understand the professor's accent. However, as I do not always listen to the professor, it doesn't matter. The only reason I stick to every lecture is that the professor always includes fancy demonstrations. They are charming!!!!!",
            "comment_grading": "The professor used a picture to demonstrate that he does not grade students using a normal distribution. Actually, he gave at least 3 A+s to my friends (about 60 students). <br /><br />Grading: 70% Final + 30% Assignments<br />(Allows 2 cheat-sheets)<br /><br />Have all distributions recorded, know how to check a proposed distribution, and you will get good grades. <br />(Remember to bring your calculator)",
            "comment_workload": "Very inadequate assignments. To get better grades, you need to do more exercise. if you rate the workload of Math&nbsp;&nbsp;1013 or 1014 to 5, then the workload will be rated to 3.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vlccbZSpuTh3uDcD69N7sNQnwSLBMJyl",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "leaf",
            "date": "Feb 02, 2019",
            "title": "",
            "comment_content": "The content of this course is standard. One of the topics (goodness of fit) is not included because of the other lecturer did not have enough time to cover. The content is a combination of S1, S2, and S3 for those who did a-level and some extra bits. So this is like a revision except that there is more proof.",
            "comment_teaching": "The lecture is a bit boring but he tries to make some jokes in class with anime characters. The tutorial questions are mostly from the textbook and previous exam question. The tutorial",
            "comment_grading": "The grading is fair. As the grade is all based on mid-term and final, just review the materials before the exam and don't make careless mistakes.",
            "comment_workload": "Super light workload. No homework, no webworks, no attendance. Just a midterm and final. Good for those who are exam oriented.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qgoEGn64FdetjL66hH5vT1bqYgVjvcv1",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1202,
                    "name": "XIA, Dong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wen moon ser",
            "date": "Jan 26, 2019",
            "title": "",
            "comment_content": "Pretty standard. Learn a lot of formula and very basic concepts of statistics from this course. Before midterm is basically DSE Core part stuff. After midterm is M1 and beyond.<br /><br />It is very boring. If you want to learn something conceptual, please go to MATH2421. You can nail this course by just knowing how to use the formulae and how to use your calculator.<br /><br />1. Descriptive Statistics<br />2. Probability<br />3. Random Variables (Binomial Distribution)<br />---------------------------Midterms---------------------------------<br />4. Random Variables (Poisson Distribution)<br />5. Estimations<br />6. Hypothesis Testing<br />7. Simple Linear Regression<br />8. Two Independent Samples<br />9. ANOVA<br />10. Goodness of Fit (canceled due to not enough time)",
            "comment_teaching": "Dr. Xia's teaching is quite good. He originally used the whiteboard to present his idea and everything was quite messy. He also refused to upload lecture notes in the very beginning. Someone has expressed opinions to him. He listened to those suggestions.<br /><br />He used iPad instead for writing lecture notes and everything was very neat and tidy. In class, He would explain the concept once first then go through some essential examples one by one. Although the flow may seem very tedious, it was very helpful to my learning. He also uploaded all the material to canvas.<br /><br />Sometimes, he would 'steal' some memes from Dr. Yu and make jokes with them. This also made the class become more intriguing.",
            "comment_grading": "There are no assignments for this course. Somebody may like it but personally, I don't like it. All the knowledge from this class is very vague as there is lack of exercise. Especially this is a math course. There are 1 Midterm and 1 Final. There are 2 grading systems.<br /><br />Grading System 1:<br />35% Midterm<br />65% Final<br /><br />Grading System 2:<br />100% Final<br /><br />Midterm General Performance:<br />Mean: 56/70<br />*Most people did very well in midterm. This can give you a huge advantage.<br /><br />Final General Performance:<br />Mean: 35.21/70<br /><br />Overall General Performance:<br />Mean: 63.57/100<br />SD: 17.39/100<br /><br />My Performance:<br />Midterm: 58/70<br />Final: 49/70<br />Overall: 74.5% (under system 1)<br /><br />Final Grade: B<br /><br />I would say the grade is not so good. However, it is a typical grading curve for MATH courses in UST.",
            "comment_workload": "Basically no assignment, no workload.<br /><br />Just need to revise for 1 midterm and 1 final.<br /><br />Even the Formula sheet has been designed by the professors. This course really no workload at all.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1beKSYfCwjxuSFMKrUi2hzAyKYFRPp4v",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "onionbob",
            "date": "Jan 10, 2019",
            "title": "",
            "comment_content": "Pretty normal, as long as you memorize most of the question type and ways of dealing it.<br />Formula sheet is given in final so no need for memorizing the formula, but you need to know the symbol and meaning of each formula first so it is pretty hard.<br />There is almost NO proof in each formula which you could not really understand or learn many things at all.",
            "comment_teaching": "The teaching is boring.<br />At least lecture notes (without answers of questions unfortunately) is given in the website.<br />The notes have some pictures that are funny but he just follows the notes to teach.",
            "comment_grading": "Below mean = C+ or below<br />A normal grading in HKUST, many areas of student will study it so it is not very competitive at all.",
            "comment_workload": "NO homework.<br />NO assignment.<br />NO attendance.<br />ONLY midterm and final.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VCDMwKoqEosG3Kn9L70kPP5qehg1MqVd",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 1202,
                    "name": "XIA, Dong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "阿晴",
            "date": "Jan 05, 2019",
            "title": "Midterm 淺 Final 深",
            "comment_content": "冇webwork<br />midterm前m1嘢<br />midterm後就深好多，但來來去去都係嗰幾個concept",
            "comment_teaching": "佢啲英文發音就。。。<br />但係都明明哋佢講緊咩<br />每堂都有Break<br />新Prof，比啲包容佢<br />佢example幾多，多過Dr. Yu<br />但出分出得好慢，midterm 6星期先出，但佢話一早改曬，係另一班未改完，Final好啲，一月頭出分，對卷後即出龜",
            "comment_grading": "唔係計mean and SD<br />Grading透明度「低」又唔係Absolute Grading<br />我都唔知佢點解派咁低Grade比我",
            "comment_workload": "0 workload<br />因為冇功課<br />只有midterm and final<br />no webwork",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AuOhYmuL4b8PepYVZpMPlcpjwiozpFmE",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hahahahahahahah",
            "date": "Jan 03, 2019",
            "title": "UST mean=C+唔係傳說🥺",
            "comment_content": "Midterm前M1 stats syllabus <br />Midterm 後 一堆confident interval +hypothesis <br />Testing + regression analysis",
            "comment_teaching": "余智偉堂堂都會寫好多嘢畀你 嗰啲嘢就係考試佢想見到你地寫嘅嘢 好長氣 但上曬堂點都唔會fail",
            "comment_grading": "2 grading scheme<br />All in final or 35%mt 65%final<br />我Midterm 63/70<br />Final 34/70<br />Total:63.07/100<br />Midterm 數據：<br />max:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;70.00<br />Q3:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;63.00<br />Q2:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;57.00<br />Q1:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;50.75<br />min:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;30.00<br /><br />Final mean 64%<br /><br />Here are some statistics of the TOTAL scores (in %):<br />mean: 63.57<br />sd:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;17.39<br /><br />max: 98.57<br />Q3:&nbsp;&nbsp;&nbsp;76.79<br />Q2:&nbsp;&nbsp;&nbsp;64.86<br />Q1:&nbsp;&nbsp;&nbsp;51.36<br />min:&nbsp;&nbsp;22.86<br /><br />結果我踩mean得C+ :(",
            "comment_workload": "得mt final 佢個webpage啲exercises 又係每個chapter得幾題 好快就做得曬",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "JO0afUJcjJ14r8dUFbnRUttA007Guz2E",
            "semester": "2017-18 Summer",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pandaman",
            "date": "Aug 21, 2018",
            "title": "Best Math Professor Ever",
            "comment_content": "- Descriptive Stats (Box Plot, Quartiles, etc.)<br />- Probability<br />- Random Variable<br />- Estimation, Confidence Interval<br />- Hypothesis Testing<br />- Linear Regression<br />- ANOVA<br />- Goodness of Fit Test<br /><br />Topics are easy compared to stuff like integration / matrix, just memorize the procedures and plug numbers into formulas (better fully understand the concepts of course)<br /><br />Usage of R functions are included in syllabus vs previous semester (to replace usage of distribution tables), they are simple to understand",
            "comment_teaching": "- Clear teaching + Hands-on exercise in class<br />- Detailed notes with fun memes inside<br />- Free color printed notes *with binding*",
            "comment_grading": "(30% Mid-Term + 70% Final) OR 100% Final<br /><br />Mid-Term Stats: (Full Marks 70)<br />max:\t70<br />Q3:&nbsp;&nbsp;&nbsp;\t67.25<br />median:\t62.5<br />mean:\t58.44<br />Q1:&nbsp;&nbsp;&nbsp;\t52.5<br />min:&nbsp;&nbsp;\t18.5<br /><br />Final Stats: (Full Marks 60)<br />mean: 44.28<br />no other stats available",
            "comment_workload": "No Webwork, Mid-Term and Final only<br /><br />Two sided A4 cheat sheets allowed in both exams",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rBNhIn6Cbsxqyt3bLdaleu41uYbDo8qv",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Smallpenguin",
            "date": "Jun 13, 2018",
            "title": "謹慎選instructor，否則自求多福",
            "comment_content": "probability,set（midterm 前）,random variables, point estimation, confidence interval, hypothesis testing, linear regression, goodness of fit test,堂上有show下點用R呢個software.",
            "comment_teaching": "我真心覺得佢唔識教2411，上堂係咁prove而唔係教點應用，應該係話考試嘅野跟本係自學返來咁制，你上堂係咁prove，又話唔考，上堂係咁抄抄抄，其實我係網上睇份notes仲好過，完全唔知上堂學到d咩，反而自己上youtube/tutorial自習仲好過，我真係未見過有人教書教得咁差，早知上個sem reg其他tutor好過，我講真，你一去做webwork就知佢上堂同做題目考試係兩回事，prove可能係要睇係要識，但咁教法真係害死人。",
            "comment_grading": "你攞mean，都係C啦，我tutorial個班低過隔離班幾分，我又踏我班個mean，咁就C咗，final mean係28.5/70分，midterm係易嘅~15/25",
            "comment_workload": "做webwork，但由於堂上太廢嘅關係，愈到後面做得愈煩，你會發覺好似題題都唔識，上網揾，勁煩，你會開始懷疑上堂有L用，你會feel到exam會炒到high，重要嘅野要講多次，如果你係要揀avery教，你自求多福啦，final做卷個陣唔好做到懷疑人生。",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "spYyuRvfTpGh83dYfPVtu1tJoZmm3LCz",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "frankcs",
            "date": "Jun 02, 2018",
            "title": "",
            "comment_content": "Week 1\tIntroduction to Set Theory<br />Week 2\tThe Notion of Sample Spaces and Probabilities<br />Week 3\tConditional Probabilities<br />Week 4\tRamdom Variables and their Distributions<br />-- midterm --<br />Week 5\tExpectation and Variance<br />Week 6\tIndependent Random Variables<br />Week 7\tDiscriptive Statistics<br />Week 8\tStatistics and Their Distributions<br />Week 9\tEstimators<br />Week 10\tThe Student, chi-square and F Distributions<br />Week 11\tHypothesis Testing<br />Week 12\tLinear Regression<br /><br />Basically a &quot;formula class&quot;. A bunch of formulas without proofs. Barely learnt anything.",
            "comment_teaching": "BAD. Keeps saying &quot;UGH...UGH...UGH...&quot; the whole semester. Notes are useless, only formulas, no proofs, no example problems.",
            "comment_grading": "webwork 5% ( seriously??)<br />midterm 25%<br />final 70%<br /><br />MEAN: <br />midterm: 18.29/25<br />final: 34.83/70<br /><br />Me:<br />midterm: 24/25<br />final: 54/70<br />overal: 83% --&gt; A<br /><br />Contents before midterm are super easy, like high-school-level easy. Final is much harder, and his notes are shit. DO NOT RELY ON HIS NOTES SOLELY.&nbsp;&nbsp;Bring a textbook with you for the final. <br /><br />Grading is actually pretty good.",
            "comment_workload": "Only webwork.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SieNU3wAMLlXajKVID9wsYkFGP0gVRew",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KennyLam",
            "date": "May 27, 2018",
            "title": "",
            "comment_content": "Content: <br />Ch1. Set;<br />Ch2 Probabilities;<br />Ch3 Random Variable;<br />Ch4 Expectation;<br />Ch5 Descriptive Statistics<br />Ch6 Statistics and their distribution;<br />Ch7 Estimators;<br />Ch8 Hypothesis testing;<br />Ch9 Linear Regression Model <br /><br />Mid term 前是學番中學 probability, 所以是會好輕鬆<br />但是一過mid term 就會學好多M1　",
            "comment_teaching": "上Lecture主要是教proof 為主,得好少example. 所以最好都去上tutorial , 會幫到你明白個topic.",
            "comment_grading": "Mid term mean : 17.17/25<br />Final mean (open-book): 33.83/70 <br />Overall mean: 55.17/100<br />佢俾grade 俾得好鬆手, overall 66% 都有B+",
            "comment_workload": "Workload 只有 webwork, mid term 同final . 不過要好多額外嘅時間去溫翻上堂嘅野,唔是就好易上堂聽唔明",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7l0Tm82wYKCpIsTrCwAF30WUK5Ajo8Kp",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Selenium",
            "date": "May 22, 2018",
            "title": "grade比想象中好",
            "comment_content": "幾實用<br />set theory<br />probability<br />expectation<br />distribution(binomial,poisson, normal, standard normal)<br />chi-squared distribution<br />estimator(point, interval)<br />hypothesis testing<br />linear regression",
            "comment_teaching": "教得有D...唔知點講好...<br />上lecture唔太有用, proof唔會考番, 但教既concept都有用<br />Tutorial教既野有用,幫到考試, OK<br />但係自學都係重要<br />D堂cover 唔哂D重點, 例題不足<br /><br />BTW 佢教PROBI教左成個幾月又超多例題, 之後D野教得勁RUSH, 1個月內講哂estimator, confidence interval, hypothesis testing同linear regression,仲冇MUD例題,我理解得好辛苦...強烈建議預習!",
            "comment_grading": "靚(同其他MATH course比)<br />webwork 4.53/5<br />midterm 22/25 ( mean 1x)<br />final 28/70 ( mean 3x)<br />overall below mean 4%左右 --&gt; B-<br />PS 冇讀過M1<br />PS 仲有樣野好, 就係極速出GRADE :)",
            "comment_workload": "幾重下<br /><br />課後要花大量時間查參考書,上網GOOGLE先知做緊MUD<br />自學好重要!!<br />功課有webwork,都算易",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ScAA6Lb8JPAAsIOxeQuf1wudBhuoyVga",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "ge0ffr3ylau",
            "date": "May 18, 2018",
            "title": "Very boring class",
            "comment_content": "Very concise notes, the professor just read the notes but it's hard to understand what he is trying to say, plus the examples are useless compared to what is in the midterm and final.",
            "comment_teaching": "Just reads from his notes, no further explanation and examples are useless. Tutorials provide notes and sometimes with answers, however it is not consistent and mostly cannot relate to the exams.",
            "comment_grading": "Bad grade, the mean is like 50%, unless you have learned statistics before then it would be a good grade for you",
            "comment_workload": "7 webwork exercise, once per two weeks, good enough",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tjR2Dh3w58oCSMNfjSc2rOGh1sfUmMlq",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Taipei frog",
            "date": "May 17, 2018",
            "title": "",
            "comment_content": "probability, expectations, random variables, statistics, estimator(point and interval), hypothesis testing, simple linear regression<br />(Actually this course contains the basic stuff that involve with statistics, and I do believe it will be useful if you are going to deal with them for data analysis course later on )",
            "comment_teaching": "Avery just read what he is going to write in class, and if you are not familiar with the topic, you basically cannot understand what he is talking about especially when the course comes to distributions and testing. He rarely gives examples that help you understand the concepts.&nbsp;&nbsp;<br />Tutorial is useless( and I believe it depends on the TAs).&nbsp;&nbsp;If you wish to have some practice, go to this website: https://sites.google.com/site/ustmathxing/2411<br />which I think it really helps a lot although some of the material may be out of scope.<br />Moreover, if you understand Mandarin, go to this website: <br />https://www.youtube.com/watch?v=GIiPvrwEx0I&amp;list=PLfS0WrMWEu_4pz_ELrzGBG3G3m2TURF6T&amp;index=0<br />These 8 online open courses provide everything that will be taught during the semester, and provide better examples and better explanations. (So I wonder if there is any reason for me to go to the class<br /> (╯-_-)╯ ~╩╩",
            "comment_grading": "I believe the grade will be very low since it is hard to understand what Avery is teaching...",
            "comment_workload": "Only 7 webwork (most of the answer can be found using Google )<br />You can find more practices online and inside the textbook if you really want to work hard.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ej9Fw55MW0pvL3FBz9FFgB2jyue37BHy",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yanie Tam",
            "date": "Mar 13, 2018",
            "title": "",
            "comment_content": "Midterm前係中學野<br />Venn diagram, mean, variance, population mean, sample means<br />都係d基礎嘅stat野<br /><br />Midterm後就係hypothesis test<br />同埋好多真係關於統計學嘅野<br />所以final會難過midterm好多",
            "comment_teaching": "Yu Chi Wai其實教得幾好<br />Powerpoint又精簡<br />自學都睇得明<br />不過佢d note成日都冇answer<br />要你上堂抄",
            "comment_grading": "Midterm炒左 above &lt;0.5 sd<br />Final好似above 0.5 sd<br />但係都係得B-<br />Final明明佔多d-.-",
            "comment_workload": "0workload<br />又冇assignment<br />又冇present<br />得midterm final:)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OCtIUEZ6n1yxd7DVeKEnMRet7Q6N3Nlc",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bat",
            "date": "Jan 24, 2018",
            "title": "good grading, need to memorize quite a lot",
            "comment_content": "Chapter 1-3 is about probability<br />Chapter 4-9 is about statistics<br />Chapter 4 is where you should focus most of your energy in because other chapters (5-9) are all easy to understand once you get the hang of chapter 4.",
            "comment_teaching": "The lecturer is pretty nice and the slides are funny with some anime jokes connecting to the statistics field. I found it funny but the slides are pretty hard to understand.<br />He goes through the slides of each chapter and when he finishes, he goes through problems for that chapter.",
            "comment_grading": "I found the grading to be good, however, my friends didn't find it great. There are 2 types of class, one where all the math students are in, the other, where all the non-math students are in. I am not sure if they are graded on the same curve, hence if you are in the non-math class and you are above mean, that might not mean you can get an awesome grade. I think the average grade for the course is B-",
            "comment_workload": "The workload is abysmal, meaning that you do not have to do anything other than going to the midterm and final exams. I am pretty lazy so I grade it as A.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PEBvEFqI8Wy4o2ohiR4CTqRW1Eb8WaNF",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "NTS",
            "date": "Dec 29, 2017",
            "title": "MATH 2411",
            "comment_content": "The following is the flow of the course:<br />Chapter 0 Introduction to Statistics<br />Chapter 1 Descriptive Statistics<br />Chapter 2 Probability<br />Chapter 3 Random Variables<br />Chapter 4 Estimation<br />Chapter 5 Hypothesis Testing<br />Chapter 6 Simple Linear Regression<br />Chapter 7 Confidence Interval and Hypothesis Testing for Two-sample Problems<br />Chapter 8 ANOVA Model<br />Chapter 9 Goodness of Fit Test<br /><br />There is also review questions and problem sets for some chapters.",
            "comment_teaching": "His teaching before the midterm was alright.. Perhaps the content is not difficult to most of the students. However, the nightmare started when he taught hypothesis testing, which is the main topic throughout the course. Basically he is not teaching but just self-talking, in the sense that he simply does not care how you understand the course. What I do feel is he just wants to finish the schedule on time.<br /><br />His pronunciation is another tragedy. He carried extremely heavy Cantonese accent.. Also in the period after midterm, he project<br /><br />If you find you can't follow him on lectures, that's normal and the advice is don't go to class anymore until you have self-studied the materials, otherwise it is wasting time and useless. Almost all the things taught after midterm is covered in the lecture notes except the solution for review questions.",
            "comment_grading": "By the time I wrote this comment, the grade is not released because of his slow marking speed (Same situation happened in midterm: There is a month gap between midterm day and paper checking session). So don't expect he will release the grades in short time.<br /><br />But the marking scheme is basically ridiculous. He required your solution to have exact wordings with his work. I got a question with absolutely correct mathematical concept but he said my explanation was not &quot;explicit&quot; enough.",
            "comment_workload": "Absolutely zero workload except the revision for the midterm and the final exam. But don't need to bother too much.<br /><br />At most two calculators are allowed in both exams. In the midterm, you are allowed to bring a two-sided A4 paper for cheat sheet, on which u can write down all the necessary formulas or quantities you like. For the final exam, he gave an official formula sheet so you don't need to prepare this. So what you need is just knowing all the equations and their corresponding usage, and plugging it the numbers. THAT'S IT!!",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "C5y9pf7g1yOV157cwgKfpkgJYepm29qc",
            "semester": "2016-17 Summer",
            "instructors": [],
            "is_author": false,
            "author": "Neutrinoller",
            "date": "Aug 31, 2017",
            "title": "",
            "comment_content": "All about formulas of statistics and some examples related to them. You do not have to understand the reason but always know how to use the formulas.",
            "comment_teaching": "It is easy to learn how to apply those materials in class. Sometimes the teaching is interesting for comic pictures are quoted to help understand.",
            "comment_grading": "Good. Easy when you prepare a nice cheat sheet.",
            "comment_workload": "Only one midterm exam and one final exam. Light since this is &quot;applied&quot; statistics, you don't have to know what's going on behind the formulas. A well prepared cheat sheet (1 double sided A4 for midterm and 2 double sided A4 for final), technique to play with calculator and carefulness will lead you to A range.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9jpnd0UTbXrovcDio1zOw8jZ5z4zojGo",
            "semester": "2016-17 Summer",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                },
                {
                    "id": 689,
                    "name": "LEE, Man Ching Kitty",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "helloitdog",
            "date": "Aug 23, 2017",
            "title": "Not bad not bad...",
            "comment_content": "Probability and distributions (Binomial, Poission, Normal)<br />Confidence interval<br />Simple Linear Regression<br />Hypothesis Testing<br />ANOVA test<br />Statistical methods with two factors <br />Goodness of Fit Test<br /><br />A general statistics course. Students mainly from MAEC. Studying as a COMP major requirement.",
            "comment_teaching": "Spoonfeeding type of teaching. In very detail did Dr. Yu try to teach his students how to tackle questions by doing exercises in class. The notes are printed by him but you have to bring it to class or else you can't fill the blanks in his notes. <br /><br />Tutorials are terrible, with wrong answers and tutorials at 9am right before Friday's lecture. In total 4 hours of lecture time in a single day. Frustrating.",
            "comment_grading": "Not bad.<br />Midterm (Ch1-3) 35% Final (all chapters) 65%<br />OR<br />Final 100%<br />No webwork/assignments<br />MT mean 52.22/70 SD18.16<br />Final mean 41.99/60 SD16.83<br />All in'd final, getting nearly 90% yet it's a B+... Meh.",
            "comment_workload": "Light to none<br />Do exercise before MT and Final<br />Ask questions after lecture if you don't understand sth. Dr. Yu responds to emails fast. <br />Exercise that Dr. Yu gave is sufficient for you to prepare for your exams.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "scAUgFvgtngWeDE9RJdgJn1TdSVaNggS",
            "semester": "2016-17 Summer",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ryanmmm",
            "date": "Aug 21, 2017",
            "title": "",
            "comment_content": "midterm 前 主要講probability ( conditional ,total probability , R.V. 同 distributions)<br />midterm 後就大部分都係 hypothesis testing 同 linear regression",
            "comment_teaching": "十分好 每教完一個chapter都有一大堆review questions 同我地一齊做 一步一步咁教 聽完實明做緊咩",
            "comment_grading": "有2套grading scheme<br />Scheme 1<br />35% mid-term exam<br />65% final exam<br /><br />Scheme 2<br />100% final exam <br /><br />以較高分的scheme&nbsp;&nbsp;計total score",
            "comment_workload": "0 workload <br />冇webwork, 唔take attendance , 仲有得all in final<br />做熟notes 內的examples 就得",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nDc6LKaigbBIA132SCDqMUo942tmpGEy",
            "semester": "2016-17 Summer",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bohr",
            "date": "Aug 12, 2017",
            "title": "Interesting Course",
            "comment_content": "The topics taught in MATH 2411 as follow:<br />1.&nbsp;&nbsp;&nbsp;&nbsp;Descriptive Statistics<br />2.&nbsp;&nbsp;&nbsp;&nbsp;Probability<br />3.&nbsp;&nbsp;&nbsp;&nbsp;Random Variable and Probability Distribution<br />4.&nbsp;&nbsp;&nbsp;&nbsp;Estimation<br />5.&nbsp;&nbsp;&nbsp;&nbsp;Testing Hypothesis<br />6.&nbsp;&nbsp;&nbsp;&nbsp;Simple Linear Regression<br />7.&nbsp;&nbsp;&nbsp;&nbsp;Two-sample Problems<br />8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ANOVA (Analysis of Variance) <br />9.&nbsp;&nbsp;&nbsp;&nbsp;Goodness-of-fit test<br /><br />The most interesting part is probability and random variable part as it involves some basic integration technique learn form 1013 and set theory. <br /><br />The remaining part (4-9) is quite boring as we just follows the rejection criteria and carry out lots of calculation",
            "comment_teaching": "He taught style is interesting and explained the concept clearly in the lecture",
            "comment_grading": "The final exam is quite easy. <br /><br />Grading Scheme:<br />1. Mid-term Exam: 35% Final Exam: 65%<br />2. Final Exam: 100%",
            "comment_workload": "Not much",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dh1BGjndG9qap7G9ggxN5ns44S7mTJDh",
            "semester": "2016-17 Summer",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Aron",
            "date": "Aug 12, 2017",
            "title": "short summary for applied statistics",
            "comment_content": "I will say that the content is so-so.&nbsp;&nbsp;It didn't require too many logic thinking unless you want to know why the equation or theorem are grounded. All you need is a well-prepared cheat sheet, so you can just copy and paste on the exam paper. Strike a balance between eye-comfortableness and content abundance is very important, haha.",
            "comment_teaching": "The teaching is acceptable.&nbsp;&nbsp;&nbsp;The lecture notes available online is not all completed.&nbsp;&nbsp;Some spaces are left for you to jot down what the lecturer says in class. So,&nbsp;&nbsp;totally relies on online lecture notes are not recommended. It is sometimes annoying that you may miss many things if you skip some lectures, results from late wake-up habits, time clash, etc.",
            "comment_grading": "The grading is not yet released. But what my belief is that you always deserve your grade ranging from D to A+ unless there exist unacceptable mistakes in grading your midterm or final or system error.&nbsp;&nbsp;Because in my thought, your effort will always pay off in the exam.",
            "comment_workload": "The workload is worth a 3 credit course. If you just aim at performing well in the exam, you need not understand the theorem. Just copy it in cheat sheet and apply it in the exam.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Lv7yMovV37xH9oeAYiQie7AU88zD15cj",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "kittycatapult",
            "date": "Jun 22, 2017",
            "title": "",
            "comment_content": "probability and stats<br />open book final( good luck with that)<br />literally printed everything still didnt help",
            "comment_teaching": "professor is honestly cancer<br />he can't teach uh uh uh uh<br />his notes are garbage i'm not even kidding<br />do not expect to pass if you study using his notes<br />dont take this course if avery ching is teaching",
            "comment_grading": "lol absolutely trash<br />dont take it with avery ching<br />super strict grading<br />be happy to pass honestly<br />im pretty sure no one gets an a+",
            "comment_workload": "usual webworks<br />not too many<br />difficulty is nothing compared to the final",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BZMyXk3xbo0CmsF7klEdrglJDJUNSYJY",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "cmL",
            "date": "Jan 27, 2017",
            "title": "",
            "comment_content": "基本stat既野: set theory, probability, discontinuous distribution, continuous distribution, confidence interval, hypothesis testing 等等.<br />內容唔深入, 易明, 但唔係教晒.",
            "comment_teaching": "上堂係咁寫白板，但係抄黎都係無用，lecture notes上完堂先update，d notes 好難睇得明.<br />Tutor notes 自己睇都明 唔一定要上.",
            "comment_grading": "webwork 5%<br />midterm 25%<br />final 75%<br />final open book. 淨係帶lecture notes會出事.<br />overall above ~0.9sd B+",
            "comment_workload": "得webwork轉鬆",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kzwEpyP4mChMJubrPL2T0lgGxo2n1JUa",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "stalin",
            "date": "Jan 20, 2017",
            "title": "",
            "comment_content": "Notes 接近系無內容，需依賴tutor和reference&nbsp;&nbsp;book。<br />另外學既同hw都好basic，不足以應付考試程度。",
            "comment_teaching": "英文講得唔錯，但經常教考試外既野。而實際syllabus 既野就唔太深入。",
            "comment_grading": "Hw: 5%<br />Mid: 25%<br />Final: 70%<br /><br />由於本人愚鈍，只知道踩mean會好伏。",
            "comment_workload": "平時既workload非常低， hw少而且簡單basic， 但當然自己要根據自己悟性投入一定時間做練習。",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hwCfIJSDoAAH9rxtMzCV8bLjphFXJuAv",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "kkm135",
            "date": "Jan 17, 2017",
            "title": "",
            "comment_content": "2411 係一個打好基本Stat. 知識既course, 教授內容唔難<br />Midterm 主要考中學Probability<br />Final 焦點放番Stat. 包括Estimation, hypothesis testing, linear regression (av ching只係講左好基本既Formula)",
            "comment_teaching": "雖然av ching既聲線同咬字好清晰, 老遠都聽到佢把聲, 但你係唔知佢教緊咩, 難follow 佢教既野, 上堂果陣無Lecture notes去解釋果D concept, 要等佢教完之後/等佢得閒先post 番上1-2堂Lecture notes 係佢個website, 真係唔知同自己上網查有咩分別, YouTube 教學仲好過佢教<br />仲有佢有時會晒半堂時間講Theorem proofs, 而呢D proofs係唔洗考, 只係For 興趣, 呢個係Stat course 唔係Stat proof呀。<br />Application examples 極少同淺; Exam 只會聚焦某幾個topics, 印象中Bayes thm. binomial, poisson distribution midterm同final 都無考過",
            "comment_grading": "Midterm 25%<br />Final 70% (MC佔~40%)<br />Webwork 5%<br />1分等於Total grade 1%<br />Me midterm 16/25 final 42/70 webwork 5/5 overall b-<br />如果你想拎 a range, reference book 唔少得, 同埋要有好強自學能力",
            "comment_workload": "2星期 1 webwork, 輕鬆做<br />No projects/assigment",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JWAgDTjs4LegRTpLRHhNuP1XdqrhcOLj",
            "semester": "2015-16 Summer",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                },
                {
                    "id": 691,
                    "name": "AU, Cheuk Yin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "c_kyle",
            "date": "Jan 06, 2017",
            "title": "",
            "comment_content": "Content is limited but easy,maybe MATH2421 is more helpful and rigorous,however 2411 is the prequisite of 2421,so better take 2411 in advance.<br /><br />If you know how to use the calculator efficiently and carefully,you can get a good grade.(Indeed I learnt how to use the calculator in this course!)",
            "comment_teaching": "I think the TA taught much better than the instructor.<br /><br />The teaching was a little boring,but in general clear and helpful.<br /><br />The TA explained problems clearly,carefully,and patiently,and he showed some proof of the theorem.Excellent TA!",
            "comment_grading": "Everyone gets a very high score,I did not do very well in the midterm.Midterm is very easy.<br /><br />The final exam is much harder,but a double-sided&nbsp;&nbsp;cheat sheet and good command of calculator will help a lot.",
            "comment_workload": "Not much.<br />But to get good grade,perhaps finishing all problems in the tutorial will be helpful.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "EBxoe4WiGy7IvxCgOfZLJLG7wVholiq0",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "grqm",
            "date": "Dec 17, 2016",
            "title": "",
            "comment_content": "Before midterm:<br /><br />- Fundamentals of set theory<br />- Basic combinatorics and probability, e.g., Counting, multiplication rule, independent events, conditional probability, Bayes' theorem<br />- Discrete and continuous random variables and probability distributions, e.g., binomial, Poisson, normal distributions<br /><br />After midterm:<br />- Expectation<br />- Descriptive statistics, e.g., histogram, mean, mode, median, quartiles<br />- Estimation, hypothesis testing<br />- Linear regression (very briefly introduced)<br /><br />This course is called APPLIED statistics. <br /><br />Avery Ching somehow managed to make it like THEORETICAL statistics. The lecture notes are mostly proofs - which weren't tested at all!<br /><br />He did give a few numerical examples, but all of them are elementary, way too easy compared to exam problems.",
            "comment_teaching": "Mediocre at best.<br /><br />Don't expect to learn anything useful from his notes. I learned a lot more from WebWork.",
            "comment_grading": "5% WebWork<br />25% Midterm<br />70% Final<br /><br />Midterm mean and sd: 13.65/25, 6.58<br />Final mean and sd: 43.62/70, 14.24<br />Total mean and sd: 61.76/100, 19.9<br /><br />I got a B+ for getting around a total score of 0.75 s.d. above the mean.<br /><br />Not lenient but not absurdly strict like many other maths courses.<br /><br />But the final was too heavily weighted!",
            "comment_workload": "Definitely had to spend some time.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BZCtITO1o3esB3OsIm199TJzXyxr1dRL",
            "semester": "2015-16 Fall",
            "instructors": [],
            "is_author": false,
            "author": "cmw_c",
            "date": "Jan 25, 2016",
            "title": "",
            "comment_content": "the content before mt is really easy, about probability <br />after that, it got harder. <br />but its great that we can get&nbsp;&nbsp;a cheat sheet in final. so, we just need to sub numbers into the formula to get the answer (of course, you have to understand the formula first)",
            "comment_teaching": "prof is really nice <br />he explained examples in details and step by step<br />easy to follow <br />and he is funny!!",
            "comment_grading": "i just above mean a little bit in mt and final<br />i got b+",
            "comment_workload": "very slight workload...<br />no webwork, no assignment",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vE6tYtSTnYhD3nku7FktO5UXp1yIB6Dy",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kk._.",
            "date": "Jan 18, 2016",
            "title": "",
            "comment_content": "Topics covered in midterm include probability, Venn diagram and some basic charts. Topics after midterm are more difficult. Review questions are important and you must understand. Overall the contents are not difficult.",
            "comment_teaching": "He is good in a way that he does not teach very fast like other lecturers and everytime when he finishes a topic he will finish review questions with students step by step. Sometimes I did not know what's going on until he demonstrated the review questions.<br /><br />But tutorial is useless as the tutor kept teaching out syllabus materials.",
            "comment_grading": "The grading is good, not too strict when compared to other Maths courses.",
            "comment_workload": "Very light workload. No assignment. Only one midterm and one final.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jhTkaH3N69bDN1g259Eezs1jhL50iD1b",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "dondyu",
            "date": "Jan 12, 2016",
            "title": "",
            "comment_content": "Before midterm: Probability and some basic statistical concepts like mean and sd. After midtem: distributions, hypothesis testing, estimation, linear regression. <br /><br />Concepts are relatively easy to understand. To solve questions on the exam you just need to know how to use formulas most of the time. Cheatsheet is allowed on the final exam. <br /><br />You also need to remember the R-codes, which is essentially a statistical programming language (just basic ones). <br /><br />For a lot of problems you need to type a lot of data into the calculator, so a minor mistake can lead to a whole question wrong, which is stupid in my opinion. Using a more sophisticated calculator might be advantageous",
            "comment_teaching": "Rarely attended class, because it is pretty boring. The teacher is okay, but the lecture is not efficient.<br /><br />Review questions are very important to be understood, because the exams are based on them. Some exam questions are almost identical to the review ones. Review questions are covered only in class so make sure you get the solutions somehow.",
            "comment_grading": "Grading is fair, overall mean was 71, sd 19. Since the material is relatively easy, this course could help you raise your gpa, if you put enough time into it.<br /><br />Your final grade is counted by 40-60 or 0-100 scheme depending on whichever gives you a higher result",
            "comment_workload": "The workload is not that hard. You don't have to be smart in order to succeed in it, since it doesn't make you think and analyze. You generally just need to know how to use the formulas and solve review questions.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JJ1MSRyOdxugQj1nOSM3XzqvM2PxqkHI",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "papabubble",
            "date": "Jan 08, 2016",
            "title": "",
            "comment_content": "Only cover probability in midterm exam.<br />After midterm, it will cover normal distribution, hypothesis test, linear regression and other testing method. You just need to follow the equation to solve the problem.<br /><br />In the final exam, no distribution was given, you have to understand how to read R code, all the probability was given in R code. You are allowed to bring one formula sheet to final but SO MANY regulation have to be followed.<br /><br />Actually, the lecturer didn't regulate what calculator you can bring. If you have one graphic calculator, it would definitely helpful.",
            "comment_teaching": "I think his explanation is clear but the class was a little bot boring. Each chapter follow up with review questions and some with supplementary exercise, that provided us better understanding of course materials.",
            "comment_grading": "Total mean 71.xx% above mean 0.3SD got B<br />I think the grade is quite good among math course.",
            "comment_workload": "No assignment but you really have to attend the class if you want to get good grade. It's because the exam questions mostly are copied from review questions, which only discuss in class and will not upload answer.<br /><br />Tutorials are not helpful at all. My TA copied worksheet form last year tutorials but the content of previous semester were different form this semester.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nVwwBB9JlBgKTTTowV57BWDS6NwylF7A",
            "semester": "2014-15 Summer",
            "instructors": [
                {
                    "id": 524,
                    "name": "WONG, Chiu Fai",
                    "rating": 1
                },
                {
                    "id": 729,
                    "name": "TO, Tsz Chung",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "左右手",
            "date": "Aug 16, 2015",
            "title": "簡單但爛Grade o既stat course",
            "comment_content": "mid term 前教probability，都係講下pmf, pdf 戈d m1/AS M&amp;S 野，mid term 後講stat，主要教plug 公式，唔要求derive 公式，學完都唔係好明白背後的數學原理(想知建議睇書)，但應用黎講算ok，一個數學course 黎講算好唔數學。計數機方面，建議大家帶fx-50fh 同991es+ 入場考，前易入program 計sum of poisson distribution 的prob同埋計anova，後者計integration 同regression",
            "comment_teaching": "Instructor 英文基本上係0表達能力，連照ppt 讀都可以狂疾，好似用緊56k 打lol 聽聲咁。堂上唔上都無所謂，notes 都可以唔睇，最緊要都睇下 tutorial notes --summerize 曬你要用同知的公式同教你點用。TA 講得幾清楚的，所以都建議上Tutorial。",
            "comment_grading": "無功課，mt,final 4:6。好爛grade，mid term 難道比sample 大，錯a part 就錯到落尾，唔比step/method 分。Final 大力救市，但太易，所以都係鬥小心，同埋鬥禁機。<br /><br />Overall above 1.x sd，B+，mean 應該係C。",
            "comment_workload": "無咩壓力，考前練下禁機同埋做下Tutorial notes 就得。",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2yevgvwRHvMlwtIk9pDK1oNwGf85vcBJ",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gi Grade",
            "date": "Dec 30, 2022",
            "title": "",
            "comment_content": "1. Descriptive Statistics<br />2. Probability<br />3. Random Variables<br />4. Estimation<br />------------ Mid-term ------------<br />5. Hypothesis Testing<br />6. ANOVA<br />7. Linear Regression<br />8. Compare Distributions<br /><br />Very Important thing in this course: R-code<br /><br />Mid-term: Ch.1-4<br />Final: Ch.5-8<br /><br />One two-sided A4 cheatsheet is allowed for both midterm and final. Since the topics did not overlap, you do not need to worry about writing 8 Chapters of things onto one A4 cheatsheet.<br /><br />There are questions related to R code in the exams as well so make sure to write some R code on the cheatsheet.",
            "comment_teaching": "The accent of prof is fine. It is easy to understand, but there are many mistakes in his lecture notes so basically all notes are marked &quot;v2&quot; at last. He basically just read through the powerpoint and include some proof during lectures.<br /><br />However, I cannot understand why the prof keeps giving partial notes. It is so meaningless. For example, when he would teach the first 15 slides in the following lecture, he only put the first 20 slides on canvas and the file is named Ch.1 (part 1). Then next lecture he teaches until slide 30 so before lecture, he uploads a new file called Ch.1 (part 1, 2). I cannot understand what is the use of it. Why not just upload the whole chapter to let us review it?<br /><br />Another thing is, there are no lecture recordings available unless you request for it. The TA would not give the lecture recordings to you if you do not provide a suitable reason and proof. So basically forces you to attend every lecture.",
            "comment_grading": "HW 40% (Each HW 10%, 4 HWs in total)<br />Midterm 30%<br />Final 30%<br /><br />My grades:<br />HW 93.75/100 (Mean 91.7/100)<br />Midterm 57/100 (Mean 53.6/100)<br />Final 61/100 (Mean 52.3/100)<br />Grade: B<br /><br />I think the mean is around B-",
            "comment_workload": "4 HWs in a whole semester. Each HW has about 4 questions, which take about 2-3 hours to complete each HW. Acceptable workload.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kiM3YJ5FtzdTD8RQ3U5rVOMmj37ij6tc",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "冰菓",
            "date": "Dec 23, 2022",
            "title": "",
            "comment_content": "Descriptive statistics<br />Basic probability theory<br />Random variables, distribution, special random variables<br />Point estimation, confidence interval<br />hypothesis testing, p-value, t-test<br />Midterm<br /><br />Two sample tests, ANOVA<br />Linear Regression<br />Q-Q plot, K-S test, Goodness-of-fit test<br />Final<br /><br />R code &lt;- don't overlook this",
            "comment_teaching": "I can follow most of his teaching. <br />His English is good.<br />The pace is nice, he seldom speedruns (almost never).<br /><br /><br />He is a busy guy.<br />If you have questions,<br />office hour is available every week, email, or online canvas discussion can do as well.<br /><br /><br />FYI, my final gets 25th quantile, doing only 1 pp,<br />so I think he teaches just fine?",
            "comment_grading": "4 Assignments (4x10%)<br />1 Midterm (30%)<br />1 Final (30%)<br /><br />Some statistics for the statistics course:<br />Final <br />Mean: 53.35<br />Median: 55\tHigh: 83<br />Upper Quartile: 65\tLow: 0<br />Lower Quartile: 43\t<br /><br />Midterm<br />Mean: 54.05<br />Median: 53\tHigh: 93<br />Upper Quartile: 67\tLow: 18<br />Lower Quartile: 43",
            "comment_workload": "4 Assignments about 4 questions each.<br /><br />Just cross check your assignments or ask the professor if you have questions about the assigments. <br /><br />For the final and midterm, it is packed and contains lots of non-trivial questions(for me?)<br />You may train your intuition for that.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "32ZNjOFVUvBRe2t0vyxYrnTqPpNNqart",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1253,
                    "name": "HU, Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "沈梓頌",
            "date": "Aug 12, 2022",
            "title": "MATH2411 review",
            "comment_content": "Need to think and listen carefully to understand, but if you understand the first 4 chapters you understand everything.<br /><br />Quite RStudio intensive, which is the most terrible language of any language, ever, and if I ever meet the dev he would likely be hospitalised",
            "comment_teaching": "Ok, Prof Hu is open to being asked questions. I only don't understand because I doze off sometimes but if you look over it a few times it's not too hard. He could simplify a bit though",
            "comment_grading": "Ok, shit grade for final exam but still B, also got some questions wrong in homework but still high 80%-low 90%. Not too bad",
            "comment_workload": "More RStudio work than actual doing math in some homework.<br /><br />You can get around this if you have a&nbsp;&nbsp;GDC with stats function",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9cKERIitnIsosmgYTBijrQ223JDBIDXk",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 1202,
                    "name": "XIA, Dong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Justin Li",
            "date": "Aug 22, 2019",
            "title": "Easy high school statistics course",
            "comment_content": "Basic and common statistics topics, including: Probability, Random Variables, Estimators, Hypothesis Testing, Linear Regression and ANOVA (Analysis of Variance).<br />Interestingly, up to 85% of contents in this course overlaps with contents in IB Maths HL Statistics option, AP Statistics, A-Level Statistics or any statistics high school courses, yet not all above courses allow credit transfer, so some students take this course without learning much new stuff.",
            "comment_teaching": "Professor is quite enthusiastic in teaching the course, and he tries to add interesting contents to his teaching to make it less boring. Lectures are easily to follow but may be rather fast in pace for students without simiilar math background. <br />Tutorials however are less useful unless you need help to solve certain problems, and it was quite difficult in understanding the TA's English when explaining the concepts.",
            "comment_grading": "5% from homework (Canvas Quiz), very easy and basic questions as long as you know the content. <br />Either 30% from mid-term exam and 65% from final exam, or 95% from final exam, whichever is higher<br />This makes the course exam-intensive, so study hard and perform well in exams.<br />Additional 5% bonus from attendance.<br />Around top 25% of students gained A-range. Reaching around 85-90% will give you an A in this course.",
            "comment_workload": "For students who took overlapped high school courses this course has very few workload apart from revising for some new contents. In contrast, students who never learned similar topics before may find it slightly difficult to follow due to the fast pace. <br />The exams allows one (mid-term) or two (final) sheets of double sided A4 paper brought in as formula sheets. It will take some work to write down all formulae but you can write whatever notes you want to bring it to the exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "O0cy8j9NN1EP8eY43bUrusheySm8hBtf",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 1202,
                    "name": "XIA, Dong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "present42",
            "date": "Jun 08, 2019",
            "title": "introductory level stat course",
            "comment_content": "1. Descriptive Statistics<br />2. Probability<br />3. Random Variables<br />4. Estimations<br />--------------------Midterm-----------------------<br />5. Hypothesis Testing<br />6. Simple Linear Regression<br />7. Two Independent Samples<br />8. ANOVA<br />--------------------Final----------------------------<br /><br />As you can see from the chapter name, this course deals with the intro-level statistics. This course mainly focuses on understanding what is going on in the world of statistics. In order to understand how those tools work (especially, the proof of theorems and properties), you should enroll in higher level courses.",
            "comment_teaching": "To be honest, don't expect too much from this course.<br />You need to study and understand all the concepts by yourself. <br /><br />One great point about teaching is that lecture notes prepared by the professor were really good.",
            "comment_grading": "In this semester, we had two grading schemes:<br />Scheme 1: 5% homework + 30% midterm + 65% final exam<br />Scheme 2: 5% homework + 95% final exam<br /><br />In addition, there was &quot;attendance bonus&quot;.<br /><br />Homework consisted of four problem sets which were quite similar to the problems from the lecture notes. Most of students could handle them without difficulty.<br /><br />Midterm and Final were quite similar to each other. They had two main parts: (1) theoretical questions and (2) application questions.<br />In order to answer theoretical questions, you should understand the purpose of various statistical tools and how to derive some important concepts (e.g. confidence interval).<br />Application questions were similar to questions you saw from lecture notes and quizzes. <br />[Another piece of advice] Be accustomed to how to deal with your calculator. <br /><br />Midterm General Performance:<br />Mean: 49.67/70<br /><br />Final General Performance:<br />Mean: 58/90<br />SD: 17<br /><br />Overall General Performance:<br />Mean: 67.24/100<br /><br />My Performance:<br />Midterm: 70/70<br />Final: 85.5/90<br />Overall: 96.75% (scheme 1)<br /><br />Final Grade: A+<br /><br />=================================================<br />The summary of the grades are as follows. <br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Grades&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Precentage %<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A+&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8.57<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8.57<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8.57<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;B+&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;9.14<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;B&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;13.14<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;B-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;11.43<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;C+&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;12.00<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;C&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10.86<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;C-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8.57<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;D&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5.71<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;F&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.43",
            "comment_workload": "You don't worry about the workload.<br />Just be prepared for midterm and final.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KxJHODk8Csf4oSizyc3Kkxt48teiuoJY",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "238",
            "date": "Jan 26, 2018",
            "title": "prof wears slippers!",
            "comment_content": "Of all the maths course I have taken in HKUST, this gives the best and most relatable materials. Also, if you are into thinking deep of maths concept this course is quite good as many concepts are introduced in great length. Before midterms, the concepts are quite easy but questions are more difficult. After midterm, many equations with seemingly horrible symbols are introduced but really you just have to chill and relax and handle them. Once you get past the point of being scared of them, everything becomes easier.",
            "comment_teaching": "OK but I have never seen a professor wearing slippers to class. The attitude is quite casual but still, I could see he makes a lot of effort in teaching and to be fair, Steve Jobs wear the same set of clothes to work so he did that too! In lectures, we always discuss his fashion sense it's a great topic to discuss really highly recommend you guys take yu chi wai :) Just to feel comfier if you usually wear slippers to uni.",
            "comment_grading": "Grading is just normal, mean should be C+... I always feel sad for HKUST where a C+ is just a normal mean range, should be B+! In the midterm, the questions are mostly from past papers so if you get source it should be easy enough to get a satisfactory score. In finals, you really need to understand the codes to answer and not to confuse yourself!",
            "comment_workload": "NO WEBWORK! Enough said. There is midterm and finals only. If you feel like that is a huge pressure, just find sources. And even I only spared 4 days for revising finals I still think is sufficient? Just chill.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OOSRDK6ulDAMmuLYwaGqtDm3lUbcSsyz",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 1118,
                    "name": "YANG, Can",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YukiLee",
            "date": "Dec 30, 2017",
            "title": "",
            "comment_content": "the probability part before midterm is not difficult and similar to what is learned in high school math.<br /><br />statistic after the midterm quite hard to understand (especially if you cant understand chapter 4, you will easily get lost afterward), but if you are not interested in the proof, its ok to know how to use the equation, and cheat sheet/formula sheet can be used in the exams. (may not be okay for those who want an A+ anyways :D)",
            "comment_teaching": "Actually, I just attend his first lesson LOL, so really can't tell how his teaching was.<br /><br />Before midterm I did sit Yu Chi Wai lectures, well, it really bore and hard to follow his Hong Kong accent. But the demonstration shown in class is quite clear.<br /><br />I nearly study all materials by myself, and it's not too hard to do so.",
            "comment_grading": "there is two grading scheme. One is midterm 35%, final 65%, the other one is final 100%. I would say the midterm is much more easier, so try not to all in final LOL.<br /><br />For the grading in my semester, the mean of midterm and final are 49/70 and 39.6/72. I got around 1 sd above mean in both of them, around 77% total course marks and I got an A :D<br />I'm not sure will different lecture used the different curves, but the grade is really satisfactory LOL. Cant imagine that I can get an A with 77% course marks.",
            "comment_workload": "very light workload<br />no webwork (but some exercises are provided in Yu Chi Wai's website, you can do it if you want.)<br />one midterm with a double side A4 cheat sheet<br />one final with given formula sheet",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AisLTLtwa2ETWso1ubmxaKidv9MmWnun",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "E",
            "date": "Jun 02, 2017",
            "title": "Avery Uhhhhhhhhh Ching",
            "comment_content": "Garbage. Utter shit. The course content is pathetic. The instructor Literally gives zero fucks. And uhhhhhhh, he like to uhhhh a lot. The content is truly bullshit. DONT TAKE THE COURSE IF THIS NEANDERTHAL IS TEACHING!",
            "comment_teaching": "If only I had a dollar for every time He said Uhhh. Out of all the professors who ever taught me, Avery ranks pretty high in the top 10 hated professors on my list. He is absolutely horrible. You have better luck learning from a little baby who only says uhhh than learn a single thing from this idiot. Didn't go to a single lecture after the first week. The fact that Avery is a TEACHING FACULTY is beyond my understanding. Hate that guy.",
            "comment_grading": "Utter bullshit. He forgot to grade one question in my final so make sure to go to the paper checking! Ended up with ~2sd above mean -&gt; A. My friend however, 0.4 sd below mean -&gt; D!! What the actual fuck?! Who the fuck does that?!",
            "comment_workload": "Webwork only. Don't rely on his notes. Find a good stat book and self study the content and practice a lot. That sack of shit doesnt prepare you for the final. <br /><br />In conclusion: fuck Avery, and I hope he gets fired ASAP.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pDjYfLbKnL4FE5iV2THcurZTJE5t4Dqp",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 1
                },
                {
                    "id": 884,
                    "name": "ZHAO, Yuqi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MathJJ",
            "date": "May 29, 2017",
            "title": "easy course",
            "comment_content": "課程內容:<br />1. Set Notation <br />2. Probabilities <br />3. Random Variables <br />4. Expectations <br />5. Descriptive Statistics <br />6. Statistics <br />7. Estimators <br />8. Hypothesis Testing<br />9. Linear Regression<br /><br />中學有讀過M1會好輕鬆 因為得 Hypothesis Testing 同 Linear Regression係新野",
            "comment_teaching": "Avery教書唔清楚<br />(上左第1堂同最後果堂)<br /><br /><br />Tutorial可以唔洗上<br />TA每堂派張WORKSHEET叫你做數 <br />最尾果15分鐘CHECK ANSWER<br />BTW 佢會EMAIL SEND返QUESTION同SOLUTION比你",
            "comment_grading": "5% webwork<br />25% mid-term<br />70% Final<br /><br />算幾好GRADE 踩MEAN有B-<br /><br />Webwork:&nbsp;&nbsp;Mean:85.87/100&nbsp;&nbsp;&nbsp;SD: 20.7<br />mid-term (CLOSED-BOOK EXAM)&nbsp;&nbsp;mean: 16.56/25&nbsp;&nbsp;&nbsp;SD: 5.31<br />Final:( OPEN BOOK EXAM)&nbsp;&nbsp;mean: 33.56/70&nbsp;&nbsp;&nbsp;SD:10.11<br />Overall:&nbsp;&nbsp;mean: 54.4/100&nbsp;&nbsp;&nbsp;SD:13.84<br /><br />me:<br />Webwork: 5/5<br />mid-term: 10/25 (below 1 SD)<br />Final: 37/70(above 0.35 SD)<br />Overall: 52/100<br />有B-",
            "comment_workload": "little workload<br />成個COURSE得7份WEBWORK <br />每份5-7題到<br />都算輕鬆K.O<br /><br />如果唔識做 去問GOOGLE大神<br />一定搵到答案",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZdDRJLJQMAfVjBXlfdhbPjEWKv4wq8y1",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "FkuAvery",
            "date": "Jan 22, 2017",
            "title": "",
            "comment_content": "d野好入門,好多THEORY講下遲D先知點PROVE,識用就得。<br />STAT D野可以背",
            "comment_teaching": "垃圾<br />AVERY只係識得背NOTES,寫到塊白板天花龍鳯咁。<br />上堂D EXAMPLE次次都係coin,die同埋card。但係D WEBWORK就關於電制。上堂D EXAMPLE會難運用到落D WEBWORK到。<br />STAT D野佢只會講下就算,D EXAMPLE好少,完全唔會令你明到個CONCEPT。NOTES每堂完之後會UPLOAD上佢個WEBSITE,上堂D野NOTES會有不過冇PROVE咁LO,但係我覺得上堂黎都哂氣。<br />問佢野又串串槓,問D野唔夠SPECIFIC會比佢窒。講野把聲嘈到成層都聽到,所以上堂唔需要記得邊間房,最嘈最拆個間入去就得。<br />TUTORIAL有3個TUTOR,我上過其中兩個,第一個男GE MAINLAND攞去燃燒都會製造環污染。一開始會比時間你做,之後佢會DEM係白板到,但係佢會做下做下係到傻笑,同埋佢會揵一堆野出黎先開始教。佢教把聲又細又LUR,完全唔知講咩,而且佢只會教你點做但係唔會教你個CONCEPT。show左一堆STEP出黎但係完全唔知發生咩事(當然佢教下教下都會傻笑)。要靠自己揣摩佢D STEP點黎。<br />上左一堂之後我就SWAP左去第二個女MAINLAND TUTOR到,佢D NOTES除左題目仲會有埋summary(雖然好似係抄另一個TUTOR),但係起碼會明依個CHAPTER講咩。同埋佢會邊教邊講解,容易D FOLLOW。但係佢又係好細聲,而且最後一個chapter冇NOTES。",
            "comment_grading": "Webwork 5%<br />Midterm 25%<br />Final 70%<br /><br />ME:<br />5/5 webwork<br />10/25 midterm(below mean 1sd)<br />52.5/70 final(above mean 7-8 mark)<br />b-<br /><br />midterm只考PROBABILITY,個比例太重,錯左一條LONG Q就冇左6-7分。<br />final 主考STAT同open book,乜都帶哂入去就得,STAT D野好多NOTES有,不過差左你識唔識用D THEORY,所以考之前做哂TUTORIAL會好好多",
            "comment_workload": "輕鬆,係每個星期要做WEBWORK",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "W5Zcu0cWMKgnu5xyQP6aUOitlTKYWG1W",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ujjwal malik",
            "date": "Feb 03, 2016",
            "title": "",
            "comment_content": "not allocated appropriate time to each topic<br />topics before midterm are really easy",
            "comment_teaching": "interactive professor<br />spoon feeds you<br />if you attend lectures, you shall fair well<br />the book he recommends has good questions<br />but only do that when you finish tutorial questions<br />tutorial answers are uploaded by the ta which include solutions as well",
            "comment_grading": "b grade if you get mean<br />no homework<br />no quiz<br />topics before midterm are really easy",
            "comment_workload": "be regular<br />professor spoon feeds you , if you attend lectures, you shall fair well in the exam<br />no homework<br />no quiz",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WWUfYjut58cKYokYaY3mZIrMXZJF1Gbx",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "api",
            "date": "Oct 15, 2018",
            "title": "",
            "comment_content": "Most people will have had learned the midterm information in high school, but afterwards, you start learning real statistics. Also, you will learn a bit about how to code R. <br />Chapter 0: Introduction to Statistics (pdf) <br /><br /><br />Chapter 1: Descriptive statistics <br />Chapter 2: Probability <br />Chapter 3: Random Variable and Probability Distribution <br />Standard Normal Table <br />Chapter 4: Parameter Estimation <br />Chapter 5: Hypothesis Testing <br />Chapter 6: Simple Linear Regression <br />Chapter 7: Confidence Interval and Hypothese Testing for two-sample problems <br />Chapter 8: ANOVA model<br />Chapter 9: Goodness of fit test",
            "comment_teaching": "The teaching isn't great and mostly boring, so you can skip lectures if needed.",
            "comment_grading": "Mid term 35%<br />Final 65%<br />There are no assignments, and the entire grade is based off of the two assessments. <br />Did not receive grades back, so not sure what the averages or any other statistics for the course are so far.",
            "comment_workload": "There isn't much workload besides studying for the two exams",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dS9ggtFGhNtaBBAGfIs62Tygod4OLv8n",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Adriancc",
            "date": "Oct 09, 2018",
            "title": "Not bad!",
            "comment_content": "Actually quite boring if attending the lessons, and most of it before mid term are actually high school m1 stuffs. But after mid term, there are many of things not related to m1 much and need to spend more time to know about it.",
            "comment_teaching": "Quite boring but the bad point is that some notes will be provided only when you attend lectures. But actually this lecture can be skipped if you are very busy, but make sure to attend tutorial to know how the questions to be done.",
            "comment_grading": "Mid term 35%<br />Final 65%<br />No assignments, actually mid term is quite important if you aim high grade at all.",
            "comment_workload": "No workload completely, only study mid term or final before the exam. Even the lectures notes would not be difficult to understand, not time consuming at all.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "buS3twZgAG9QXbCt7jq2Ku0WcCC8NwrA",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1407,
                    "name": "ZHU, Huichen",
                    "rating": 0
                },
                {
                    "id": 1448,
                    "name": "ZHAO, Jia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "miketony",
            "date": "Aug 27, 2020",
            "title": "",
            "comment_content": "This course covers the material about basic probability, random variables, probability distributions, expectation, a systematic introduction to statistical inference, including the point and interval estimation, hypothesis testing, linear regression modelling, and analysis of variance.<br /><br />Super easy and they are m1 stuff before the midterm. However, the materials after midterm are also not difficult at all. <br /><br />This semester focused more R than the calculations. Prof. always",
            "comment_teaching": "Prof Zhu speaks so slow, she always uploaded the updated file right before the lesson begin, which we may not know whether there may be some amendments on the ppt.<br /><br />For the tutorial part, they mainly teach R techniques and not focus on the calculation part.",
            "comment_grading": "Absolute Grading: <br />A+:&gt;95, A: (90,95], A−:&nbsp;&nbsp;(85,90]B+:&nbsp;&nbsp;(80-85], B: (70-80], B−:&nbsp;&nbsp;(65,70]C+:&nbsp;&nbsp;(60,65], C: (50,60], C−:&nbsp;&nbsp;(45,50]F:&lt;50<br /><br />Midterm 25%<br />Final 30%<br />Group Project 25%<br />Homework 20%<br /><br />Midterm +1 s.d.<br />Group Project, Final mark Unknown<br />Homework: around 80%<br /><br />Grade: B+<br /><br />I think the grading is good among other math courses.",
            "comment_workload": "Adequate",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kDcRzGkFYW2PFMyUQ82gidx8JB228y3F",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lmacchch",
            "date": "Jun 21, 2022",
            "title": "Shit Course, Bad Grade",
            "comment_content": "我唔知佢講的咩，shit content， useless",
            "comment_teaching": "shit teaching<br />唔知佢講嘅咩 聽講都不如自學",
            "comment_grading": "Bad grade<br />2 grading scheme: 35% assignment+ 65% final or 30% assignment+ 10% participation +60% final<br />得好grade關鍵在於assignment+participation一定要滿分,因為final分都好低<br />我本人：抄左final 但assign+participation 滿分 所以overall 過mean 1 sd<br />A-<br />另外 記得做r code cheatsheet 佢考好多r code",
            "comment_workload": "almost 0<br />因為其實都冇咩必要平常學呢一科<br />final前溫下書 做做cheatsheet就得",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Z5uCZu2cSPU8nIZnC9tKJERAcI3tFhdW",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "South",
            "date": "Dec 26, 2021",
            "title": "This course is an absolute disaster",
            "comment_content": "Basic statistical inference teaches you how to use R to get what you want instead of telling you what you are calculating. Without knowing a thing about probability, it's quite confusing especially when it comes to the confidence interval because you absolutely have no idea what he's doing and what you are doing, he just reached you to use some method to calculate something.",
            "comment_teaching": "First, maybe Dr. Yu is a good person.<br /><br />However, I would not say that I like the way he teaches. Maybe it's just some easy stuff for someone who has a background in statistics and probability, but we are just new to them. What's worse, I don't think Dr. Yu understand that. He goes over the content too quickly without explaining why.",
            "comment_grading": "Four assignments, each accounts for 10%of the total mark.<br /><br />There is no midterm exam, but the final exam will carry 60% of your fate.<br /><br />Understanding what the concepts are and being flexible is crucial. Knowing how to calculate the stuff and doing homework will eventually result in a B range.<br /><br />I just studied less than 10 hours in total for this course, and I got an A-. I could have gotten better grades if I could develop my interpretation of the critical concepts, like p-value, power, etc.<br /><br />One more word: knowing how to interpret the concepts in the graph (officially probability density function graph) is essential. I got A- because I forgot that in the final exam.<br /><br />He just released the grades without letting us know the final scores.",
            "comment_workload": "Because you don't get anything from his lectures, you will need to work a lot after class to understand the content.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IPtTixWxbl1F4T735flbpzx4QbzN2ZhY",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "http",
            "date": "Jun 01, 2017",
            "title": "",
            "comment_content": "It was about <br />1. Set Notation<br />2. Probabilities<br />3. Random Variables<br />4. Expectations<br />5. Descriptive Statistics<br />6. Statistics<br />7. Estimators<br />8. Hypothesis Testing<br />9. Linear Regression",
            "comment_teaching": "Avery teaches very fast, his voice is a bit boring, so I wasn't very attentive. Don't ever expect you can study by yourself, as the notes he provides are too simple. Remember to study the examples he teaches in the lessons.",
            "comment_grading": "This depends on the semester that you have register. Which means your peers marks affect you very much, and of course Avery's paper's difficulty is a factor too. For example, in 2016-17 Fall, students complains the paper is difficult and the grading is harsh. In this semester, the midterm was easy, I personally got full mark, as it was only simply probability. However, the mean was like 14/25. For the final, I got less than half, but the mean was 29/70, so I was still above mean. At the end, I got 1 SD higher than mean in overall, and get B+.<br />Conclusion: Make sure your peers are stupid enough so they make you get higher grade.",
            "comment_workload": "Easy. I never consider webwork as a workload, and this course has no other homework. Just 5% webwork, 25% midterm and 70% final.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "Zvi0F0FVA1MtwwebxsMEsg8KQf42kXCx",
            "semester": "2017-18 Winter",
            "instructors": [
                {
                    "id": 388,
                    "name": "XU, Yan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wwwkkk",
            "date": "Jan 20, 2018",
            "title": "sorry write in wrong place ISOM 2400",
            "comment_content": "For midterm<br />1)Introduction to the Information Infrastructure <br />2)Digital Convergence; Wireless Communications and Spectrum Regulation<br />3)The Next Generation Information Infrastructure<br />4)Business and Socioeconomic Implications of Information Infrastructure<br />5)Innovation 2.0 <br /><br />For final<br />6)Diffusion of Technology Innovation; Case Study: SMS Adoption in Hong Kong and China<br />7)Theoretical Framework of Information Infrastructure Deregulation<br />8)Organizational Restructuring of Information Infrastructure: From Monopoly to Competition, and to the Bubble and Its burst<br />9)Network Interconnection; Local Network Competition in Hong Kong<br />10)Key Issues of Global Information Infrastructure: International Settlement, IP Telephony, and the WTO",
            "comment_teaching": "Professor always uses many examples to establish the idea which is easy to understand.<br /><br />Professor XU comes from mainland China, however, his accent is quite clear to listen to.<br /><br />He always tries to invite people to answer his questions and get involved in class. (but as always only a few people will answer him TT)",
            "comment_grading": "a)a mid-term assignment (40%)<br />The mean is about 76/100. The highest mark is about 96/100 (quite high)<br /><br />b)a final exam (60%).",
            "comment_workload": "Only one on-line mid-term test and one final exam<br /><br />For the online midterm, you do it at home. You can access Internet or notes to get the answers. The format:<br />1) ~70 MC question<br />2) ~40 fill-in-the-blank question<br />3) 3 short question<br /><br />For the final exam, one A4-size cheat sheet will be allowed. The format is close to the midterm quiz.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jPNLKXXbJzvLtjKsvsd1Q1c34Re5dOzj",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sleepingbag",
            "date": "Jan 31, 2022",
            "title": "",
            "comment_content": "The basics about statistics. Those math knowledges are not only useful in statistics area, the concept behind them are also pretty commonly seen in other math topics. The content also covers using R to realize some statistic practice which is pretty fun.<br /><br />But if you don't have a good math background, know nothing about probability and statistics, then it would be a bit hard for you.<br /><br />For CS student, if you want to dig into some ML areas that related to a lot of math, then choose this course. I also took 2421 before but I don't think 2421 is really helpful for studying ML.<br /><br />For DSCT student, this course is really important. Use all your effort to study this course thoroughly.",
            "comment_teaching": "Professor Yu taught with passion and designed different ways to let student understand the concept of statistics. He is also really willing to answer students question. <br /><br />For those who get a bad grade and blame on Professor YU, you probably didn't try to solve the difficulty you faced when you were studying this course.",
            "comment_grading": "The concepts in this course are too not hard. Therefore you are expected to learn all the concept throughly. The exam questions would test different topics together. Overall the difficulty is between medium and hard. Also you have to be really familiar with theorems and the technique of solving some particular problems because the time constraint is pretty strict.<br /><br />If you have confidence in writing the exam questions, then A range is not difficult at all.",
            "comment_workload": "I think the homework is a bit hard. But it wouldn't take too much time. No midterm only final. <br /><br />Studying exam would take some time to be familiar with the solution of some questions and also R code. But of course studying exam takes some time...<br /><br />Overall the workload is really light.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "7VCi6fJWmDDxSDDp1o0v6HRTx7HLQdlv",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Zaki",
            "date": "Jan 20, 2021",
            "title": "GOOOD GRAADE",
            "comment_content": "Probability <br />R code<br />hypothesis-testing",
            "comment_teaching": "GOOD<br />The teacher is very nice.<br />YCW is very very good, he is a responsible teacher.<br />Alright, all in all, he can give you a nice experience .",
            "comment_grading": "I don't waste my time on this course,<br />but during the exam, I find something interesting, and I just write two proofs, finally, get a good score.",
            "comment_workload": "Not so much<br />but need to review<br />you need to know that no pain no gain.<br />And work hard to get the best grade, so don't just play the game,<br />log in zoom and have fun with us.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Dp5NeK0X1u2svxcd1KZaiTxmRIkLp6TV",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 542,
                    "name": "YU, Chi Wai",
                    "rating": 1
                },
                {
                    "id": 528,
                    "name": "CHING, Avery",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "想當年",
            "date": "Feb 16, 2020",
            "title": "【special semester because of HK situation and COVID-19】",
            "comment_content": "prerequisite: 識 HKDSE M2 嘅 calculus 已經夠 (basic differentiation, integration by substitution, by part)<br /><br />***************<br />Online final :<br />大部份題目都要用R，打R code一定要熟",
            "comment_teaching": "Dr YU Chi Wai (L2) :<br />Dr余智偉 是HKUST最風趣嘅instructor之一，上堂時不時都會畫圖，仲有powerpoint/lecture notes d 圖，都係好正！<br />重要的 theorem 和 R-code 係晒他的lecture notes 入面，應該都好齊<br />落堂可以用廣東話問他野，他都會答<br /><br />************<br />由於延遲到2月才考final，有時間睇L1 video。<br />Dr CHING Avery (L1) :<br />比較多proof，會明得比較深入。",
            "comment_grading": "Midterm statistics:<br />Mean: 24.1971/55<br />sd: 10.44704<br />Max: 55/55<br />Median: 23/55<br />Min: 4/ 55<br /><br />Final statistics: (L2, from Canvas)<br />Mean: 29.1 High: 42 Low: 11 <br /><br />For me:<br />midterm 30/55<br />postponed online (Canvas) proctored final 37.5/42<br />grade = A+<br /><br />今年online final本身16:30考到17:30，但不幸有technical issue，所以我們要等多1小時（即17:30）才開考，考到18:30。唔知係咪因為咁，所以俾得特別靚grade呢！<br />總之，thanks Dr Yu！！<br /><br />&quot; Because I had a very painful experience of invigilating online exam this Monday, I don't want to have 2 exams this course. &quot; (Dr Yu, MATH2421)<br /><br />Grading of the Course:<br />WebWork&nbsp;&nbsp;5%<br />Written Assignment 5% <br />Midterm examination 30%/0%<br />Final examination 60%/90%<br />The max total score will be taken to determine students' grades.<br />(This course is essentially graded by curve.)",
            "comment_workload": "webwork + 幾份 hand-written assignment ，4-credit course 來說不算多",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}