{
    "error": false,
    "course": {
        "id": 880,
        "subject": "MATH",
        "code": "2343",
        "name": "Discrete Structures",
        "description": "Logic: propositions, axiomatization of propositional calculus, deduction theorem, completeness and soundness. Combinatorics: permutations and combinations, generating functions. Set theory: basic operations on sets, relations, countable and uncountable sets.  Third year and fourth year students require instructor's approval to take the course.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2230,
            2130,
            2030,
            1930,
            1910,
            1810,
            1730,
            1630,
            1530,
            1430
        ],
        "prerequisites": "A passing grade in AL Pure Mathematics / AL Applied Mathematics; or <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1014\" href=\"/review/MATH1014\" target=\"_blank\">MATH 1014</a>; or <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1020\" href=\"/review/MATH1020\" target=\"_blank\">MATH 1020</a>; or <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1024\" href=\"/review/MATH1024\" target=\"_blank\">MATH 1024</a>",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"2711\" href=\"/review/COMP2711\" target=\"_blank\">COMP 2711</a>, <a class=\"course-link\" data-subject=\"COMP\" data-code=\"2711H\" href=\"/review/COMP2711H\" target=\"_blank\">COMP 2711H</a>",
        "rating_content": 3.55,
        "rating_teaching": 2.45,
        "rating_grading": 4.27,
        "rating_workload": 4.82,
        "review_count": 11,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 557,
                "name": "CHEN, Beifang",
                "count": 11
            }
        ]
    },
    "reviews": [
        {
            "hash": "Ms6EoJUMqI7FMj5JW3UdVnJmSZ3ks2Xa",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 557,
                    "name": "CHEN, Beifang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kotenbek",
            "date": "Jun 08, 2021",
            "title": "Easy A range",
            "comment_content": "Basically the same content as the previous posts.<br /><br />If you want to check out the course content then look at the professors website: https://www.math.ust.hk/~mabfchen/Math2343/<br /><br />Personally, I think the content is not full. For example, the concepts like the big-oh notation was not covered in the lecture notes.<br /><br />My suggestion for reading other than the course textbook is Introduction to Combinatorics by Brualdi",
            "comment_teaching": "TBH, I don't know how the teaching was conducted after I stopped looking at the recordings.<br /><br />In the beginning, when I attend the classes, the professor literally burped and he just read/skimmed through the lecture notes. So, I do not think the lectures are useful.<br /><br />Although, tutorials are very useful for understanding the concepts. As if to say that they glue your self-learnt material",
            "comment_grading": "You could find your grade here:<br />&nbsp;&nbsp;&nbsp;&nbsp;https://www.math.ust.hk/intranet/grading/student/YYYY_TERM/<br />YYYY -&gt; year (e.g. 2021) and TERM -&gt; fall/spring/... (e.g. spring)<br />TL;DR: easy grades without any pressure during the semester<br /><br />HW: you get a full score for submission<br />Attendance: your name should be present on the zoom meeting, but no talking required (I just put my computer to attend the zoom meeting before I went to sleep)<br /><br />Both the midterm and the final were take home:<br />1) midterm take home for ~5-6 hours<br />2) final take home for ~24 hours<br />I don't understand why the prof released the exam papers after dinner time. So, for midterm I completed it around 11:50 pm. Also, the final was released for 24 hours and I had another final during that time. <br /><br />HW: 60/60 (mean: ~8/10 for each HW, high: 60) - 15%<br />Attendance: 22/24 (mean: 17/24, high: 24) - 10%<br />Midterm: 81/100 (mean: 52.31, high: 81) - 30%<br />Final: 81/100 (mean: 58.54, high: 93) - 45%<br /><br />Grade: A",
            "comment_workload": "Almost nothing. The concepts tested are all in the lecture notes. So, when you write your exams you can refer without any problems. Also, could use some code/calculators for your problems. Do not trust chegg as some of my friends referred to it. I saw a lot of solution which were wrong. I personally coded some of my exam questions. You could find some templates to do it geeksforgeeks.<br />Also, some calculators provided by instructors of waterloo university",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "D65jK045qcQ4Qw8vaSPu6vi0aMophLCW",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 557,
                    "name": "CHEN, Beifang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chrisppro",
            "date": "May 29, 2017",
            "title": "Good grades but bad teaching",
            "comment_content": "The range of the covered content is quite broad, so it doesn't go in too deep.<br /><br />Before the midterm, you learn basic set/logic theory, relations, counting.<br /><br />Until final, you learn recurrence relations, graph theory, boolean algebra, number theory, discrete probability.<br /><br />The lecture notes are well organized, but contains some mistakes, so be careful.<br /><br />The general content/theory shouldn't be too hard compared to other math courses (very easy to be honest if you are decent at math).",
            "comment_teaching": "Teaching is not very good.<br />The professor doesn't speak very fluent English, so the delivery of the teaching is not very comprehensible. He tries quite hard to let the students grasp the concepts. But, because of the English and his delivery is not in a very organized manner, the efforts seem to be in vain.<br />But, the good thing is you don't need to go to the lectures every time even if you want to ace the course.",
            "comment_grading": "The grading is very very good compared to other math courses.<br /><br />Personally, I didn't do so well in the midterm (above 0.5sd), but I did quite well on the final (more than 1sd above),&nbsp;&nbsp;so I got a letter grade of A.<br />Even though my final score was about 1sd above, you can get a high grade (considering the fact that other math courses give you B+ when you get 1sd, this is very good).",
            "comment_workload": "Workload is extremely low.<br />You have to turn in 3 assignments, but you don't get graded on your performance, but just based on your submission on time (full marks if turned in on time).",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Evfu2yu5wdnof2pEIxwUxlbWdH93AO63",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 557,
                    "name": "CHEN, Beifang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SmokingPuddle58",
            "date": "Jun 06, 2023",
            "title": "Beifang good grade guy nah",
            "comment_content": "If you are seeing this review, I believe you are a MATH-CS student and thinking of whether to apply for curriculum deviation so that you can replace it with COMP2711(H). My suggestion is:<br /><br />If you really want to learn something useful for COMP3711 (One of your required course), turn left apply deviation go for COMP2711(H). You will definitely learn something useful there.<br /><br />If you just want some good grades that can boost your GPA, stay here and stick with Beifang. In here the grading is super lenient. Beifang claims he seldom fail people and the grading is better than the university suggested grading. However his teaching is not good (refer to TEACHING part)<br /><br />Talking about content, he covers more than in 2711, for example, in graph theorey, he covered Prim's and Kruskal's algorithm, which is supposed to covered in COMP3711. Because he covered many contents so he could not explain the concept deeply. And therefore the exams are really simple that focuses on more application (Using inorder preorder postorder to search a tree, Applying DFS,BFS algorithm, find the minimum spanning tree etc) instead on proving. There is little proving in the final exam paper (iirc only 1 6-mark question is about proving)",
            "comment_teaching": "The teaching is really not that good. He is like Kin Li but better than Kin Li. He also read lecture notes but I can see he really want to interact with his students but sometimes he failed.<br /><br />Note that the attendence is compulsory (10% of total). Thus use the time wisely 🙂<br /><br />Talking about him, he is really a nice guy. If you have any questions go to his office and he will answer you these questions.",
            "comment_grading": "Lenient and super nice<br /><br />Beifang promised the grading will be better than the usual grading in UST (25% A-range something like that)<br /><br />I eventually got an A-. For statistics and gradings, please refer to the graph in below (Copied directly from grading of math dept)(Idk why I cant upload image).<br /><br />MATH2343 Section: 1A<br /><br />Hw\tAtten\tMterm\tFinal<br />Total no.\t6\t1\t1\t1<br />Weights\t0.15\t0.1\t0.3\t0.45<br /><br /><br />Hw1\tHw2\tHw3\tHw4\tHw5\tHw6\tAtten1\tMterm1\tFinal\tTotal<br />Base Mark\t100\t100\t100\t100\t100\t100\t18\t100\t100\t100<br />Mean\t96\t100\t92\t92\t96\t94\t14.26\t54.94\t59.44\t65.4<br /><br /><br />Hw1\tHw2\tHw3\tHw4\tHw5\tHw6\tHw%\tAtten1\tAtten%\tMterm1\tMterm%\tFinal\tFinal%\tTotal%\tGrade<br />100\t100\t100\t100\t100\t100\t100\t18\t100\t67\t67\t75\t75\t78.85\tA-<br /><br />Midterm is 1 hour and 20 minute and final is 3 hours.<br /><br />I thought the mean will be high because the exam is easy, however the mean is still around 50 or something. Some people just simply give up and leave the examination hall early. As long as you did pay some effort you will be fine and can get some good grade for this course.",
            "comment_workload": "Workload? As large as epsilon!<br /><br />For assignment part, because the course has no grader, so as long as you submit your assignment you get marks. Also for our TA she just finish the question and give answer to us. For some exercise there are even answers at the back of the lecture notes. <br /><br />For exam, the exam questions are very easy that some of them come from the lecture notes and some of them come from the past paper. As long as you memorized the examples in the lecture notes you will be fine (He got a list of final coverage list. Go revise them. Maybe you can also ask Beifang before final. He will then tell you what will be set in the question paper.)<br /><br />So for workload I would like to give an A",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2kTAPXlr4DqljEWs0OynHTO9kncXE7pp",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 557,
                    "name": "CHEN, Beifang",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ISIS-Adam",
            "date": "Jan 28, 2023",
            "title": "",
            "comment_content": "I think most of the students taking this course are math-cs student. And I strongly recommend you take COMP2711 instead of this course.",
            "comment_teaching": "It is difficult to understand what he is talking about. So many &quot;this&quot;, &quot;ok&quot;, &quot;and&quot;. During the lecture, you will probably hear some sounds like<br />&quot;this ^* and ^*^ this %&amp; and %&amp;*&amp; this *(&amp;*^% OK? OK? OK?&quot; <br />But the attendance was compulsory.<br />I suggest you just looking at the note by yourself during the lecture. Don't pay attention to what he is saying.",
            "comment_grading": "Although the teaching is terrible. But the grading is so good. I easily got A+. And my friend got the lowest score of overall. He had gotten C+. You can get full mark once you submit your homework. The question in exam was so simple. Some of them even was directly copy from the lecture note.",
            "comment_workload": "As you can get full mark once you submit your homework, the workload is light.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pVzov8MzA60a1fbyqDdHrXam1Wa8djFN",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 557,
                    "name": "CHEN, Beifang",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Sum06",
            "date": "Aug 25, 2022",
            "title": "",
            "comment_content": "Basic concepts of various topics<br />Not too deep into that topic<br /><br />1. Basic Set Theory, Functions<br />2. Countable Set, Truth Table<br />3. Logic<br />4. Relation<br />5. Number Theory<br />6. Midterm Revision<br />7. Recurrence Relation<br />8. RSA, Counting, Inclusive-Exclusive Principle, Pigeonhole Principle<br />9. Euler Path, Tree searching<br />10. Hamilton Cycle, Planar Graph<br />11. Discrete Probability<br />12. Boolean Algebra<br /><br />I think topics after midterm are easier because most of them are related to graph and diagram instead of proof.",
            "comment_teaching": "Very strong accent, don't know what he was saying.<br />Suggestion: read notes &amp; tutorial can help you<br />But examples in tutorial always harder than in exam",
            "comment_grading": "Good grading<br />Attendance for tutorial: full mark (10%)<br />Assignment: full mark if you hand in on time (even there are mistakes in the assignment) (15%)<br />Midterm: (30%) 72/100 (mean: 48)<br />Final: 45% 62/100 (mean: 55)<br />Grade: A range",
            "comment_workload": "Light workload (even lighter than some 3 credit course)<br />3 Assignments (will not use too much time to do) <br />Originally 5 assignments, but not enough time, so the last 3 assignment combine as one (choose 10 questions from the 3 assignment by yourselves)<br />He didn't change mid-term and final exam question. So if you have source, just memorize them.<br />Open book exam and some questions are from notes",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "s4WjmUPA0G30JEfIXtJsjeFx3UT6j721",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 557,
                    "name": "CHEN, Beifang",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Carson yuen",
            "date": "May 18, 2022",
            "title": "Good Grade Poor Professor",
            "comment_content": "Sets, Sequences, and Functions<br />Elementary Logic<br />Relations<br />Induction and Recursion<br />Counting<br />Basic Graph Theory<br />Recursion, Trees, Algorithms, Probability<br />Boolean Algebra",
            "comment_teaching": "Professor 係mt同final 前後都冇出過正式announcement 講scope<br />照書讀 <br />可以話上堂完全唔知佢講緊乜<br />上左4堂頂唔順冇再上",
            "comment_grading": "tutorial 有attendance Tutorial 好重要 <br />Final 8題 只要有past paper 有5題你會見過 tutorial 都會做過<br />Attendance, homework, midterm,<br />and final count 10%, 15%, 30%, and 45% respectively<br />My attendance Full<br />Homework Full<br />MT 49/100 Mean:47.8 High :76",
            "comment_workload": "Hw 只要你有交就有分 交足一定full 而且tutor 唔會點睇<br />接近0 workload",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yD8ZdPUcUEC9zxObxH6nl8k1c57yzBJc",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 557,
                    "name": "CHEN, Beifang",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "sentiment.zero",
            "date": "Jun 06, 2018",
            "title": "",
            "comment_content": "From this course, you learn:<br />Graph Theory<br />Binary Relations<br />Boolean Algebra<br />Discrete Probability<br />Set Theory<br />Divisibility in Integers<br /><br />etc.<br /><br />These concepts would be useful for further COMP courses.",
            "comment_teaching": "There are some mistakes in pdf. Also, since professor CHEN merely announces about midterm or final, you must attend the lecture and correct pdf by yourself to follow the course.",
            "comment_grading": "Grading is slightly better than other math courses.<br /><br />100% in HW<br />73% in Midterm (Mean: 53, SD: 18)<br />79% in Final (Mean: 60, SD:21)<br />------------------------------------------<br />Total 80.05%, about 0.8 SD above, got A-",
            "comment_workload": "Light workload. There are total 5 to 7 assignments, but TA gives 100% for them if you just hand in.",
            "rating_content": 5,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yKkx9THeOMp0xZ0DVEhAqokZ7jOKiJNO",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 557,
                    "name": "CHEN, Beifang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Andy Dai",
            "date": "May 30, 2018",
            "title": "",
            "comment_content": "Main topic:<br />Set theory<br />Logic<br />Number divisibility<br />Binary relation<br />Recurrence relation<br />Counting and probability<br />Graph theory",
            "comment_teaching": "The professor's English is very bad<br />You are very hard to follow <br />Self-study would be more efficient than attending the lecture",
            "comment_grading": "Don't trust any review before 2017-2018 spring,<br />It isn't a good grade course as before.<br />I got 62.5% which is higher than the mean total 2% and got a B- only<br />Just similar to other math course mean = C+/B-.",
            "comment_workload": "Very light workload as there are 5 Homework only.<br />Hand in for 1 mark otherwise 0<br />No need to do all the Q correctly",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "dqb8FbnMAwfLv5VnJI5SaDczIFwOK8rH",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 557,
                    "name": "CHEN, Beifang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cshime",
            "date": "May 29, 2018",
            "title": "Don't think it is a very good grade course",
            "comment_content": "Topics are:<br />Set theory<br />Logic<br />Number divisibility<br />Binary relation<br />Recurrence relation<br />Counting and probability<br />Graph theory",
            "comment_teaching": "Actually the lectures are quite boring, just like other math course, simply reading the content on pdf files. But Prof Chen is a nice guy, always asking students if they really understand the solution. Also, in the lectures near the end of the semester, Prof Chen would ask you which topics you think it is difficult, and try to not asking them in the final exam paper, I think it is good for someone who really attend the class.",
            "comment_grading": "Don't trust other reviews saying having overall mean would have a B letter grade. I got a C+ even if I got just 0.6 points below overall mean.<br /><br />The grading scheme for this semester is:<br />5 assignments (with sum 15%)<br />1 midterm (35%)<br />1 final (50%)<br /><br />Assignments can only be full mark or 0 mark, you got full mark if you hand in on time. So many of the student got full mark.<br /><br />[30/5 edit]<br />This part I changed to C as today's paper checking session I got 1 more mark from my final exam paper, and my letter grade become B-! Prof Chen is a really nice person, he usually give you the partial credits when you really try to attempt the question on the final exam paper. Therefore, paper checking session is really important as some of the partial credits he may got missed.",
            "comment_workload": "Workload is just very very light.<br />With just only 5 assignments, hand in on-time to get full mark, very good and easy to get that 15%. You can just do a half of it and submit to the TA, and you can get full mark. Also, some assignments are attached with solution, you can copy....<br />Compare to other math courses, it is very light workload.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xHqpe4l9f5jTZ3KQC6oEVawZpQpzpPGJ",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 557,
                    "name": "CHEN, Beifang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "出前一丁",
            "date": "Dec 04, 2016",
            "title": "A nice course on maths",
            "comment_content": "Set theory<br />Logic<br />Counting<br />Binary Relation<br />Recurrence Relation<br />Graph Theory<br />Induction<br />Divisibility (Number Theory)<br /><br />Actually all easy topics except recurrence relation (lazy to memorize), will be vary easy to handle for a yr2 student with enough math knowledge<br /><br />Please refer to his website:<br />http://www.math.ust.hk/~mabfchen/Math2343/index.htm",
            "comment_teaching": "Seldom attend lesson (morning lesson), but quite enjoy the lessons actually.",
            "comment_grading": "Mid-term:below 0.5 sd<br />Final: mean<br />H.W.: All done<br />Grade:B<br />Rare good grade course in math department, and can sub. Comp2711<br /><br />Commnets on Math 2711:<br />https://ust.space/review/COMP2711<br /><br />Use a few minutes and you will be attracted by this course.",
            "comment_workload": "Low, there are a few hw, counting about 15%, but it just count whether you have done, no matter correct or wrong, and also not difficult<br /><br />Conclusion:easy",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ENjtxxXriMP8u0vtSFdaecnidLyh6Jjo",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 557,
                    "name": "CHEN, Beifang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Trevis@MATH",
            "date": "Jan 12, 2019",
            "title": "Cover 太多 topics",
            "comment_content": "Week 1-2\t\tSets, Sequences, and Functions<br />1.1–1.7\tDivisibility, Sets and Subsets, Operations on Sets<br />\t\tSets and Subsets, Operations on Sets<br />1.5, 1.6 \tFunctions, Sequences<br />1.7&nbsp;&nbsp;\t \tProperties of Functions<br /><br />Week 3-4 \tElementary Logic<br />2.1, 2.2 \t\tPropositional Calculus<br />2.3, 2.4 \t\tMethods of Proof<br />2.5, 2.6\t\tLogic in Proofs, Analysis of Arguments<br /><br /><br /><br />Week 4-5 \tRelations<br />3.1, 3.2, 3.3\tRelations, Digraphs and Graphs, Matrices<br />3.4\t\t\tEquivalence Relations and Partitions<br />3.5\t\t\tIntegers Mod p<br /><br />Week 5-6 \tInduction and Recursion<br />4.1, 4.2&nbsp;&nbsp;\t&nbsp;&nbsp;Loop Invariants, Mathematical Induction<br />4.3, 4.4&nbsp;&nbsp;&nbsp;\t&nbsp;&nbsp;Big-Oh Notation, Recursive Definition<br />4.5, 4.6&nbsp;&nbsp;&nbsp;\t&nbsp;&nbsp;Recurrence Relations, More Induction<br />4.7&nbsp;&nbsp;&nbsp;\t&nbsp;&nbsp;Euclidean Algorithm, Linear Diophantine Equation<br />&nbsp;&nbsp;&nbsp;\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\t&nbsp;&nbsp;Modular Linear Equation<br /><br />Week 7-8&nbsp;&nbsp;\tCounting<br />5.1\tBasic Counting Techniques, Permutation, Combination<br />5.3\tInclusion-Exclusion Principle<br />5.4\tCounting and Partitions<br />5.5\tPigeon-Hole Principle<br /><br />Week 9-10&nbsp;&nbsp;&nbsp;\tBasic Graph Theory<br />6.1, 6.2 \t \tGraphs, Euler Paths and Circuits<br />6.3, 6.4 \t\tTrees and Rooted Trees<br />6.5* \t \t\tHamilton Path and Circuits, Planar Graphs<br />6.6 \t \t\tMinimal Spanning Trees<br /><br />Week 11-12&nbsp;&nbsp;&nbsp;&nbsp;\t Recursion, Trees, Algorithms, Probability<br />7.1–7.5&nbsp;&nbsp;\t \t Depth-First Search, Breadth-First Search<br /> \t \t&nbsp;&nbsp;\t Polish Notation, Minimal Spanning Trees<br />8.1–8.3&nbsp;&nbsp;\t \t Digraphs<br />9.1–9.4&nbsp;&nbsp;\t \t Discrete Probability<br /><br />Week 13&nbsp;&nbsp;&nbsp;&nbsp;\t Boolean Algebra<br />10.1–10.5&nbsp;&nbsp;\t Boolean Expressions",
            "comment_teaching": "The lecture seems quite boring but the professor is really, really, really nice and helpful.",
            "comment_grading": "Final letter grades will be given at the end, based on the results of homework, midterm and final exams. Attendance, homework, midterm, and final count 10%, 15%, 30%, and 45% respectively.",
            "comment_workload": "Problem sets will be distributed from time to time. All of them will be collected by tutors in tutoring sessions before the due dates. Tutors will keep the records of all grades. Since we have no graders, the problems will be checked on the 0-1 base, that is, full mark for handed in problems and zero mark for not. There are 6 problem sets in total.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}