{
    "error": false,
    "course": {
        "id": 903,
        "subject": "MATH",
        "code": "4051",
        "name": "Theory of Ordinary Differential Equations",
        "description": "Existence and uniqueness theorems of ordinary differential equations, theory of linear systems, stability theory, study of singularities, boundary value problems.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            1930,
            1630,
            1530,
            1430
        ],
        "prerequisites": "(<a class=\"course-link\" data-subject=\"MATH\" data-code=\"2350\" href=\"/review/MATH2350\" target=\"_blank\">MATH 2350</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2351\" href=\"/review/MATH2351\" target=\"_blank\">MATH 2351</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2352\" href=\"/review/MATH2352\" target=\"_blank\">MATH 2352</a>) AND (<a class=\"course-link\" data-subject=\"MATH\" data-code=\"3033\" href=\"/review/MATH3033\" target=\"_blank\">MATH 3033</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"3043\" href=\"/review/MATH3043\" target=\"_blank\">MATH 3043</a>)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 4,
        "rating_workload": 5,
        "review_count": 1,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 556,
                "name": "HU, Jishan",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "cbPhLQ5NhwQKnXIgKMDVzkjUYSMvpjrD",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 556,
                    "name": "HU, Jishan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "junwen971",
            "date": "Apr 28, 2023",
            "title": "Very satisfying analysis class with comfy, reasonable workload",
            "comment_content": "Class is split into 2 sections (one before, one after midterms). First section deals with the existence and uniqueness of solutions to linear systems of ODEs. We start with setting the ground rules via lots of standardized notation, then move on to learning about Lipschitz continuity, and how to use it to test for the uniqueness of a solution. Various continuity theorems regarding pairs of solutions to a system are also provided. Then, how to prove the existence of solutions is covered by the class teaching you about ways to take an existing system of ODEs and convert it into different forms, i.e. equivalent problems. Other more-specific situations are also covered, like Arzelà–Ascoli and Peano Existence.<br /><br />The second part focuses on analysing the stability of the solutions, by looking at the system of ODEs in matrix form, and playing around with its eigensystem to classify its phase plane, as well as ways to test stability. For example, by constructing a Lyapunov function to use as a metric on the phase plane.",
            "comment_teaching": "Prof Hu is an excellent Professor. He is very familiar with the course content and able to handle all questions from the students, and is also willing and able to entertain alternative solutions or ideas posed by the class. His classes are well-paced -- for example he has enough time in his lectures to give breaks and to occasionally talk about his experience as a mathematics student in the past -- while still covering the content completely and comprehensively. He is also very contactable via email, which is good for students who have questions to ask in private.<br /><br />In addition, he is accommodating and hears all the students in class out. For example, he switched online platforms to Canvas at the class' request, and he also prepared hardcopy printed versions of the entire set of lecture notes, in order to make the midterms more convenient for the whole class (it was closed-book with reference to the lecture notes allowed).<br /><br />Lastly, he is personable and fun to learn with. I needed to get extra classes in order to bring sufficient classes back to my home university (I am an exchange student), and when I approached Prof Hu in his office during Week 1, he was prompt in answering to my pre-requisite waiver, while also explaining to me in-person the scope of the class, demonstrating his deep understanding and familiarity with the material.<br /><br />Overall I am very satisfied -- this class was by far my favourite among all the classes I took in my time in HKUST as an exchange student, which is a testament to the sturdy and well-executed nature of the teaching under him. <br /><br />A brief word of compliment to the TA Qiu Jiayu too -- he is fast and responsive to the class' questions, and also helps the class with the graded homework by providing a guide to the thought process of related problems, and giving hints in the form of the first few steps.",
            "comment_grading": "10% Homework, 45% Midterms, 45% Finals.<br />Midterms ONLY covers Chapter 1 -- existence and uniqueness of solutions to linear ODE systems.<br />Finals ONLY covers Chapter 2 -- analysing the stability of solutions to linear ODE systems.<br />This makes the midterms as important as the finals, which is precisely why both are high-weightage and equal, at 45%. The 10% homework is a little scary, but marking in the exams is reasonable -- the markers will give your thinking the benefit of the doubt. Marking in homework is stricter, however, and you can expect to lose 1/10 marks per careless mistake (though, subsequent results built upon that careless mistake will not be penalized), for example.",
            "comment_workload": "Very manageable. Just 6 homework assignments across the semester, each being 1-3 questions. The TA will often discuss at least one of the questions in each assignment, so you could just copy his discussion and get 50-100% of that question / those questions done, already, if you are pressed for time. (Of course, it won't get you full marks if you just did that and didn't do the rest of the homework, lol.)<br /><br />That said, the workload is manageable -- the questions themselves don't take too long to do, and you can email the TA or prof for further help. One hour should suffice? Thus, that amounts to half an hour of homework a week on average, which is insanely, dramatically, starkly manageable compared to other high-level mathematics classes like Matrix Computation or Topology.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}