{
    "error": false,
    "course": {
        "id": 948,
        "subject": "MECH",
        "code": "2020",
        "name": "Statics and Dynamics",
        "description": "Fundamental course on the analysis of the equilibrium and dynamic behavior of mechanical systems. Statics: equilibrium of particles and of rigid bodies; distributed forces; analysis of structures, including, trusses, frames, cables and beams. Dynamics: kinematics of particles; kinetics of particles, Newton's second law, energy, momenta, impact dynamics; systems of particles; kinematics of rigid bodies; kinetics of rigid bodies in two and three dimensions. For students with major in MECH, AE and MEGBM only.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510,
            1410
        ],
        "prerequisites": "(<a class=\"course-link\" data-subject=\"MATH\" data-code=\"1012\" href=\"/review/MATH1012\" target=\"_blank\">MATH 1012</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1013\" href=\"/review/MATH1013\" target=\"_blank\">MATH 1013</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1020\" href=\"/review/MATH1020\" target=\"_blank\">MATH 1020</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1023\" href=\"/review/MATH1023\" target=\"_blank\">MATH 1023</a>) AND (<a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1111\" href=\"/review/PHYS1111\" target=\"_blank\">PHYS 1111</a> OR <a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1112\" href=\"/review/PHYS1112\" target=\"_blank\">PHYS 1112</a> OR <a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1312\" href=\"/review/PHYS1312\" target=\"_blank\">PHYS 1312</a>)",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"CIVL\" data-code=\"2110\" href=\"/review/CIVL2110\" target=\"_blank\">CIVL 2110</a>",
        "rating_content": 4.17,
        "rating_teaching": 4.13,
        "rating_grading": 4.43,
        "rating_workload": 4.43,
        "review_count": 30,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 565,
                "name": "MA, Lok Wang",
                "count": 24
            },
            {
                "id": 829,
                "name": "LEE, Ricky Shi-wei",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "uKH9LHhUUGAMBdvPT4JfXdHhFbknfqLN",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Midnight919",
            "date": "Jan 10, 2020",
            "title": "",
            "comment_content": "Fairly similar to high school physics or the Kinematics content in IB Physics. It covers topics such as reaction forces, torque/moment, and kinematics. Yet, providing a broader and in depth analysis regarding said topics with calculus or other relevant mathematical skills. A build up of necessary pre-requisite skills for taking Solid Mechanics (MECH 2040) later on.",
            "comment_teaching": "Robin is a very passionate lecturer and he thoroughly goes through each example question which are found in all of his lecture slides. Online materials which aid understanding are not provided but additional practice questions can be found on Canvas. <br /><br />The method which he teaches the course content and notes referenced within the lecture slides may not be adequate to many individuals. It is recommended to refer to the course followed textbook to fully grasp the content.",
            "comment_grading": "The grading for this course is fairly loose and lenient compared to other MECH courses. However, the major drawback of the course is that the content is relatively easy compared to other courses, hence, the assignments and quizzes typically score a high mean. Therefore, the achieved grade in the end may not reflect your performance throughout the course.<br /><br />During the semester which I had taken the course, the final exam was canceled and replaced with a timed, open-book, handwritten, online submitted assignment. Hence, I am uncertain about the difficulty of the final exam.<br /><br />Assignments: 20% (4% each)<br />In-class Quizzes: 30% (10% each)<br />Final Exam: 50%<br /><br />Overall Achieved Grade: A-",
            "comment_workload": "The workload of this course is fairly low. However, there will be spikes (self initiated) prior to the date of in-class quizzes. <br /><br />There are only 5 assignments/homework exercises which each contain roughly 3 questions per assignment. However, each assignment is straight forward to complete if you are able to follow the taught content.<br /><br />The assignments are handed out bi-weekly and are given one week from the distributed date to complete.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "q1jWYKVSFDYyeKwAs92MK5RGHQdfsK6r",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KWing",
            "date": "Jan 26, 2022",
            "title": "An easy course",
            "comment_content": "1. Statics: equilibrium of particles and of rigid bodies; distributed<br />forces; analysis of structures, including, trusses, frames, and<br />beams<br /><br />2. Dynamics: kinematics of particles; kinetics of particles, Newton's<br />second law, energy, momentum, impact dynamics; systems of<br />particles; kinematics of rigid bodies; kinetics of rigid bodies in<br />two and three dimensions.<br /><br />The concepts are from high school physics but the calculations are more complicated, so you need to be careful. Also, some simple calculus are involved and they are really important because nearly half of the dynamics questions in final exam required us to do calculus. Don't miss that :)",
            "comment_teaching": "Professor Ma explains everything clearly. You don't even need to ask him questions. Also, he has done a lot of questions with us during lessons and, most of the time, he taught us how to do them step-by-step. <br /><br />But the tutorials were not quite useful. The TAs were just doing the questions without teaching you how to do them. However, the answers were uploaded after the tutorial, so nothing needs to be worried about.",
            "comment_grading": "5 Assignments – 20% <br />3 online quizzes – 45% (60 minutes each)<br />F2F final exam– 35% (3 hours)<br /><br />I got full marks in all assignments and 95/100 in all quizzes. Since all courses from MAE Department will not announce the marks of final exam, I don't know the result. I got an A at the end. <br /><br />p.s. he said only the top 20% can get into A range, but seems like quite a lot of people are in A range.<br /><br />p.s. The marking scheme of the quizzes are weird. I got the answers and some steps wrong but they just deducted 5 marks.",
            "comment_workload": "1. Assignment<br />· 2-3 questions per assignment <br />· mainly focus on statics <br />(but I think dynamics is more difficult, so I don't understand why they did this)<br /><br />All the assignments are not difficult, even if you really don't know how to do them, you can still find the answers from the internet. <br /><br />2. Quiz and Exam<br />· 2-3 questions per quiz<br />( All quizzes mainly focused on statics)<br />· 6-8 questions in exam (half half)<br /><br />The quizzes and exam are not difficult, sometimes they are easier than the supplementary exercises and questions from tutorials, so you just need to finish them and you will be able to get a nice grade.<br /><br />THE MOST IMPORTANT THING is both TAs and professor are lazy. They just reuse the questions from past assignments, quizzes and exams again and again and make some minor changes. If you really have no time to study, some free past paper websites can help you. You don't even need to purchase sources from seniors.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "CYnJv4YWE4KiGJ7S0l0yXsbmQBHDBp8l",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Yoyo Lam",
            "date": "Nov 18, 2021",
            "title": "",
            "comment_content": "It comprises of two parts, static and dynamic. Both are relatively easy, most of it is just high school physics. <br /><br />In static, you would be calculating just F=ma for most of the time, calculating the force of the component in the truss. Just need to be careful when deriving the equations.<br /><br />In dynamic, you would be calculation motion, including velocity, acceleration, momentum, energy, and Newton's law.<br /><br />It should be the easiest course in the MAE curriculum. But if you are so eager in studying, you may be a bit disappointed since there are not many things to learn in this course.",
            "comment_teaching": "Robin is a great tutor. I have never seen a professor as patient as him. The pace of the lessons is extremely slow, you may be a bit impatient during the lessons sometimes. He really explains step by step and does the questions together with you. <br /><br />I really recommend taking the lectures, doing the question together with him, although sometimes you may feel he is too slow, you would understand and be able to solve the questions.",
            "comment_grading": "I think the grading is fair, quite a good grading compared with other mech courses. Robin is nice.<br /><br />The question in the exam is similar to the one in the lecture notes and they are not that hard.<br /><br />In this semester, we have all exams in online mode. Robin is so fair that he draws all the questions himself by hand to avoid cheating. I really appreciate that.",
            "comment_workload": "Low workload. 4 assignments, 3 quizzes with a final. <br /><br />If you really attend the lesson and do the questions with him during the classes and do the homework by yourself, I think there are not many things for you to revise and you don't really need to take a lot of time studying before the exam. <br /><br />I think this is the lowest workload course already in all the mech courses.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3iOyKLfhLJuJUU2GVGYapQQIK1a1L5RR",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ho Ka Ying",
            "date": "Jan 23, 2020",
            "title": "Very Easy course",
            "comment_content": "About force, moment and kinematics. <br /><br />Mainly high school physics (sometimes even more&nbsp;&nbsp;straight forward than DSE), very few things are new. <br /><br />It is very easy and a bit disappointing as well, as not much things have been learnt.",
            "comment_teaching": "Prof Ma teaches in a slow pace, so it is impossible to fail to understand. The lectures are about going through examples, which are easy too.",
            "comment_grading": "It is an easy course, so just be careful in calculations and it is ok.",
            "comment_workload": "As the content is easy, so very light workload. We have quizzes instead of midterm, so it is less stressful.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FGrsIV1GsAVLBXCpKCeL0fxP9vjC22by",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Garvin",
            "date": "Aug 20, 2019",
            "title": "",
            "comment_content": "It is similar to HKDSE Physics, It covers topic as Mechanics such as action and reaction force, torque. Yet, it provide more advance investigation with methods using calculus or others mathematical skills.",
            "comment_teaching": "Robin is a very Passionate Lecturer, stay consistent in your attendance to have a good impression. Also, robin opt not to provide any online materials other than answers of quizzes and exams",
            "comment_grading": "The grading of Mech 2020 is rather loosen as Robin is a very kind and nice lecturer. As long as you maintain a good revision in his lecture notes and have all homework revised, it will be rather easier then other mech course to achieve a decent grades.",
            "comment_workload": "The workload of this course is mainly coming from the quizzes and homework. First off, there are only 3 quizzes in 2018-2019 fall, also the homework isnt weekly. Therefore, although it is not the most relaxing but it will not be the one will the most burden among all major required course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nPWhVfKjmFVnf6EvcdDlnxSeyWNuRhDo",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HKG_SIGMA",
            "date": "Dec 25, 2016",
            "title": "WTF?",
            "comment_content": "Fundamental concepts for mechanical engineering.<br /><br />Statics: Total Force (in x y z directions) = 0<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Total Moment (in cw/acw directions) = 0<br /><br />Dynamics: a=dv/dt<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;v=ds/dt<br /><br />Basically these are what spend (bother) you the whole semester. Not difficult to understand if you have studied PHYS before.",
            "comment_teaching": "Robin is a passionate teacher but his teaching techniques really need improvements. He tends to do examples in class instead of explaining. If you feel confused about the contents, please raise your hand to ask.",
            "comment_grading": "TBH, pretty bad compared to previous terms. The mean was around 54 out of 100 in the midterm. This may be because of the changes in questions. Very tough! It's also a factor which a very minor fault in your answers may deduct 15 marks out of 30 from a question.",
            "comment_workload": "Not heavy. 5 assignments throughout the semester. 1 midterm and 1 final.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6GvHtdehVar0LSW21CBbWOaQevREYY6e",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "液化陽光",
            "date": "Jan 22, 2016",
            "title": "Unbelievably hard final exam",
            "comment_content": "Quite simple content of theories with a lot of questions. But it has covered all the things. You can refer to the book to have more explanations if you don't go to the courses (but actually even you go you can still have many questions).",
            "comment_teaching": "I could feel that Robin (MA, Lok Wang) seldom prepare for this course (He was in charge of 2 more difficult courses). He read his&nbsp;&nbsp;courseware and kept asking students do more exercise (actually he was right...). But the course was so boring that I fell asleep again and again.",
            "comment_grading": "Quite fair.<br />Almost full mark in homeworks (everyone can have)<br />Full mark in midterm.<br />Got 1 question wrong in final. (He announced all answers just after the exam..!!)<br />But I missed one in-class exercise (3 in total). Although it was not included in course syllabus.<br />And I got A. It is quite fair.",
            "comment_workload": "Nearly no workload in normal times.<br /><br />But the final was really really difficult. It is very important to do more exercise in study break.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "b39GBkXbM12QaAM0tct9s72cocknpTOL",
            "semester": "2022-23 Fall",
            "instructors": [],
            "is_author": false,
            "author": "JasonYTC",
            "date": "Jun 22, 2023",
            "title": "",
            "comment_content": "Course cover force as a vector; Equilibrium; Analyse of turss;Kinematics and kinetics of an object; Enegry meothods<br />Half of the contectn is a review of mechanics part of PHYS1112<br />Equations are clearly outlined",
            "comment_teaching": "Professor really spent a lot of time to slove textbooks problems in lecture(For me most of the questions are easy)<br />Tutorials also give some example question to slove",
            "comment_grading": "Assignments 15%<br />Quiz 45 %<br />Final 40%",
            "comment_workload": "Work load is not heavy<br />5 assignment, 1 per two weeks<br />3 Quizes each take 60minutes<br />Final exam can allow student to bring their cheats sheets",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KAY9KdIQDzEX6nj0mNpwsV8yuO52Wu16",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Alphor",
            "date": "Feb 02, 2023",
            "title": "Slightly difficult topics with a very enthusiastic instructor",
            "comment_content": "As the topic says, 80% Statics, and 20% Dynamics.<br />Working with forces and acceleration of Trusses.<br /><br />Basically F=ma to the roof, <br />and sprinkle some a = v^2 / r.<br /><br />Basic Trigonometry and Linear Algebra skills are very important in this course. Practice working with Triangles and 3 equations - 3 unknowns can help a lot.",
            "comment_teaching": "Very enthusiastic, fun and caring professor. Even got a tablet just so the students at the back could see better. Patient with questions and a consultation period is available after every lecture. May be a bit fast in teaching.",
            "comment_grading": "Lenient grades. But people are competitive (Quizzes Mean can reach up to 93%).",
            "comment_workload": "Homework every other week, 3 Quizzes and 1 Final of 3.5 hours of intense equation solving. Practice and develop your own method of organizing information can help a lot.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "njCAJcTW5ttkNfWIcfhpimPvRzy0ZXNQ",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "P.T",
            "date": "Jan 26, 2023",
            "title": "Do as much exercise as you can, then you will get a good grade",
            "comment_content": "- mainly talking about equilibrium no matter in static or dynamics. It is not too difficult to understand.<br /><br />- this course will be easy if your geometry is good since there are lots of angles <br /><br />-need to draw free body diagram, sin law cos law need to be used frequently<br /><br />- dynamic part is more difficult than static, but it is quite similar to high school motion.",
            "comment_teaching": "Robin teaching style is definitely my type. He is very friendly, play music before class and quiz.<br /><br />He will do lots of exercise with us during the class, also giving lots of example and exercises for us for practising. He does it almost every class. Honestly, skipping class occationally like me will still be fine. But you do need to read back or watch back recording.<br /><br />BTW, He is definitely not a killer:)",
            "comment_grading": "15% for HW<br />45%for 3 quizzes (60 mins each)<br />40% for final exam (3 hrs)<br /><br />- For assignment, most ppl got full marks. mean At least 90%. Not difficult<br /><br />- For quizzes, mean is around 60-70%( not so sure)<br />It is not difficult if you have done some exercises in lecture notes or from Robin's. Some questions are very similar. And there are only 3 questions in each quiz.<br /><br />- For exam, It is obviously more difficult than quizzes. Doing insufficient exercise will be doomed. Really need to think in exam. In quiz, many ppl early leave, but final not much. You can imagine the difficulty. But doing sufficient exercise will be fine. Also, no need to worry about time. 3 hours is more than enough.",
            "comment_workload": "-5 assignments in total, 3 questions each, easy enough if you go through the lecture notes, doesn't take much time to complete.<br /><br />- Practice makes perfect definitely can apply in this course.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zCAkKYmUQTLdjt3vsY6Gf2ECKzOY4sqf",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ernestlweeeee",
            "date": "Dec 15, 2022",
            "title": "Easy course (tldr: do hw, revise a little for quiz, get rest and relax for final exam)",
            "comment_content": "If you've taken MECH 1906 or CIVL 1100, you'll be fine.<br /><br />This course talks about forces in equilibrium, objects in motion and vectors, but to simplify its just high school physics (Mechanics) mixed with calculus.",
            "comment_teaching": "I'm sorry Robin but your style of teaching is just not my type. Great person, plays music before class, very friendly, but not my style of teaching sadly.<br /><br />Extensive problem analysis and step-by-step solving in class, but then he does it almost every class so stuff that needs to be learnt get taught with gaps in between.<br /><br />If you like doing exercise in class with the professor, then he'll be great for you. Otherwise, just skip classes like me(skipped like two-thirds of the semester lmao) and read the lecture notes from time to time.",
            "comment_grading": "Very distributed grading system<br />15% for HW<br />45%(???) for 3 quizzes<br />40% for final exam<br /><br />Its not that hard unironically, except for final exam, so you'll get good grades.",
            "comment_workload": "5 assignments, 3 questions each, easy enough if you go through the lecture notes, doesn't take much time to complete as well.<br /><br />3 quizzes, 3 questions, they're fairly simple so do some revision and you'll be fine. Alternatively, questions may be identical to previous semesters so look at past quizzes if you don't want to revise.<br /><br />Final exam was reasonably more difficult than the quizzes, but you have 3 hours to solve 7 questions so don't worry about time. Doing more revision probably won't help much, so keep a clear mind, get enough rest, get enough food, and relax.",
            "rating_content": 5,
            "rating_teaching": 2,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BUPdL6ufFojN62F5rBZHXr3tM6VHuqNP",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "B747",
            "date": "Dec 14, 2022",
            "title": "正爆Professor",
            "comment_content": "The course have two main parts, Statics and Dynamics. The content are not difficult and most of the content are base on your high school knowledge and year 1 content. You may check out other comments for more detail about the course, but overall the content are the easiest among year 2 mech courses from my perspectives.",
            "comment_teaching": "Professor Ma is so cool! Even though he is quite serious during teaching, but before lesson he will play different style of music like K-pop, Rock, Jazz, Classical, you name it! <br />His teaching is also very good. He explained the concepts really clear, and the contents are not really hard at all, so no worries for some mech students who are weak in calculus and physics.",
            "comment_grading": "15% Homework (5 in total for this semester)<br />45% Quizzes (1 online quiz &amp; 2 f2f quizzes for this semester, 15% each)<br />40% Final exam<br /><br />No attendance and iPRS required<br /><br />I’ll update my grade after it’s released.",
            "comment_workload": "There are many sources for Homework and Quizzes so it’s should not be a problem.<br />The final exam this year is a bit more difficult compare to the quizzes, but still ok. <br /><br />Honesty I’m not a model student because I didn’t attend any of the lessons in the remaining half semester, but I still got good results in quizzes and homework (I studied all the contents for quiz 2 &amp; 3 just a night before and still higher than mean :) ), so it’s nothing compare to other mech/math courses.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fCdnZXRk9HdwOnDWQgECQKkG2DjZRKdP",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jimmylcm",
            "date": "Jan 24, 2022",
            "title": "very good grade",
            "comment_content": "easy to hard<br /><br />it is a good course for beginner of mech major<br /><br />According to the course description (Syllabus) of MECH2020:<br /><br />Fundamental course on the analysis of the equilibrium and<br />dynamic behavior of mechanical systems<br /><br />Statics: equilibrium of particles and of rigid bodies; distributed<br />forces; analysis of structures, including, trusses, frames, and<br />beams<br /><br />Dynamics: kinematics of particles; kinetics of particles, Newton's<br />second law, energy, momentum, impact dynamics; systems of<br />particles; kinematics of rigid bodies; kinetics of rigid bodies in<br />two and three dimensions.",
            "comment_teaching": "very good and clear<br />instructor will do the question in notes with you in lesson<br />instructor can explain question i ask very clear<br /><br />however, the tutorial is not quit useful since it just do some question similar in lesson, and you can get the question and answer of tutorial in canvas directly.",
            "comment_grading": "5 Assignments – 20%<br /><br />3 online quizzes – 45% (60 minutes each)<br /><br />Online final exam– 35% (3 hours)<br /><br />my grade<br />hw1 90/100<br />hw2 100/100<br />hw3 100/100<br />hw4 90/100<br />hw5 100/100<br />online quiz 1 95/100<br />online quiz 2 100/100<br />online quiz 3 85/100<br />final not anounce<br />over all A-",
            "comment_workload": "very light<br />5 homework, each homework with 2-3 question<br />3 online quiz, each online quiz with 2-3 question<br />1 final exam with 6-8 question<br />no midterm",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "a8MCM4YzkVEHonYNOop5Q1ThKVk9zMk6",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "IDKdf",
            "date": "Mar 16, 2021",
            "title": "",
            "comment_content": "Basic concepts and calculation for u to prepare for solid mechanics (MECH2040).<br />Most of the content is similar to the calculation from CIVIL1100.",
            "comment_teaching": "Although Robin Ma's teaching is quite clear, his teaching speed is slow. If you are a slow-learner, Robin will be your best choice. His final exam is challenging, indeed, which you cannot find answers during or even after the exam.",
            "comment_grading": "5 assignments 20%<br />3 online quizzes 45%<br />Online final exam 35%<br />As u can see, online quizzes occupy a large portion of the grade and prepare for the quizzes.<br />I got an A-, where I didn't spend much time in it.",
            "comment_workload": "Fair workload 5 assignments are quite easy to handle.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SEJKFUDUaWL5WhkLBqam4qc7VxXXe6KD",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jaja_308",
            "date": "Jan 19, 2021",
            "title": "",
            "comment_content": "FBD, Moment, internal forces, sheering and bending diagram, Kinetic Diagram, radial and transverse forces, etc",
            "comment_teaching": "Robin taught in details with the homework examples. He explained it step by step and you can understand the problem solving skill from his notes. Just sometimes you might find it quite repetitive, but it still good to have a detailed explanation.",
            "comment_grading": "Final exam is way different from the assignments, quiz and hw. Though similar methods could be applied in the exam but the questions were complicated to understand.",
            "comment_workload": "Hws roughly every two or three weeks, 2-3 question every time, not hard if you read the notes and listened to examples.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "g1vpnrKF10hg1vHSzNeo4HWV2gqmInIO",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fishfillett",
            "date": "Dec 15, 2020",
            "title": "online sem makes it hard",
            "comment_content": "mainly about force and components in static and dynamic movements. it is quite similar to the IB physics option B curriculum (engineering physics), the difference from it is that the knowledge is more related to calculus.",
            "comment_teaching": "robin is quite passionate about the lecture and he provides examples along with lecture notes during the lecture and solves them in depth. however, in some of his lecture notes, he left some important equations blank so we are required to fill them in on our own. this makes revising a little inconvenient.",
            "comment_grading": "the grading is relatively lenient in homework sets and quizzes. this semester, the grades are distributed as below:<br /><br />homework: 20%<br />quizzes: 45% (15% each)<br />final exam: 35%<br /><br />however, the final exam this year is very difficult. the level completely differs from the homework and quizzes. the questions were not as explicit and there were a lot of values added in the structure analysis questions that was quite confusing. although the exam is deliberately made difficult, it is completely not what we expected.",
            "comment_workload": "overall light workload, there are 4 homework sets in total and 3 quizzes that should not take you a lot of time. there are around 3 questions in the homework sets, as well as the quizzes. the quizzes are conducted in class (around 1 hour each), so there are no midterms.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uKHcRM9d3xMESqh486uu1yTgBFhnHjlq",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ggghihi1",
            "date": "Jan 19, 2019",
            "title": "算靚grade course",
            "comment_content": "簡單野 force moment之類中學學過曬<br />Statics:&nbsp;&nbsp;equilibrium&nbsp;&nbsp;of&nbsp;&nbsp;particles&nbsp;&nbsp;and&nbsp;&nbsp;of&nbsp;&nbsp;rigid&nbsp;&nbsp;bodies;&nbsp;&nbsp;distributed forces;&nbsp;&nbsp;analysis&nbsp;&nbsp;of&nbsp;&nbsp;structures,&nbsp;&nbsp;including,&nbsp;&nbsp;trusses,&nbsp;&nbsp;frames,&nbsp;&nbsp;and beams<br />Dynamics: kinematics of particles; kinetics of particles, Newton's second&nbsp;&nbsp;law,&nbsp;&nbsp;energy,&nbsp;&nbsp;momentum,&nbsp;&nbsp;impact&nbsp;&nbsp;dynamics;&nbsp;&nbsp;systems&nbsp;&nbsp;of particles;&nbsp;&nbsp;kinematics&nbsp;&nbsp;of&nbsp;&nbsp;rigid&nbsp;&nbsp;bodies;&nbsp;&nbsp;kinetics&nbsp;&nbsp;of&nbsp;&nbsp;rigid&nbsp;&nbsp;bodies&nbsp;&nbsp;in two and three dimensions.<br />Forces in a plane<br />Forces in Space<br />Rigid Bodies: Equivalent System of Forces<br />Equilibrium of Rigid Bodies<br />Analysis of Structures<br />Trusses, Frames and Machines<br />Force in Beams<br />Kinematics of Particles<br />Newton’s Second Law<br />Equations of motions<br />Energy and Momentum Methods",
            "comment_teaching": "詳細notes基本上同書寫嘅野一樣唔想上堂可以借本書睇就ok<br /><br />Vector Mechanics for Engineers Statics SI(Beer, Johnston and Mazurek – McGraw Hill) <br />Vector Mechanics for Engineers Dynamics SI(Beer, Johnston and Cornwell – McGraw Hill)<br />有問題可以send email問robin極快有reply",
            "comment_grading": "3 個quiz全部above mean<br />5 份hw全部滿分<br />final冇出 不過相信應該炒咗<br />最後A-<br /><br />3 quizzes: 30%<br />5 assignments: 10%<br />final: 60%<br />其中一個quiz 個mean 比較低",
            "comment_workload": "一般<br />兩個星期一份hw<br />連續考幾個mech course嘅midterm比較chur 其他時間都好hea<br />quiz出得好簡單 佢劃咗範圍的話一定係出返嗰啲野 如果唸太多反而更低分 全部題目都係書到出<br />所以如果想高分一定要做書",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pDDy0oyfNLvgdjmTnw2GLBaGQPFjuynS",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bbmadevipalive",
            "date": "Jan 04, 2019",
            "title": "Not a hard course...fundamental kinetics",
            "comment_content": "Statics<br />zero force member<br />ball-and-socket joint structures<br />force equilibrium<br />trusses frames<br />Dynamics<br />rectilinear and curvilinear motions<br />energy and momentum<br />conservation of energy<br /><br />Dynamics is harder than statics",
            "comment_teaching": "Concise lecture notes <br />main points <br />tutorials notes were also useful<br />Concepts were well explained in lectures and example questions were demonstrated<br />Just study the lecture notes and tutorial notes and the quizzes and final should not be hard to you<br />Nice professor!!",
            "comment_grading": "Lenient grading",
            "comment_workload": "5 homework<br />3 quizzes instead of a midterm(to urge us to study regularly)<br />and a final exam<br />The final exam was much easier than expected<br />I guess many guys scored high",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cOfrJ7tQfmNqZS2KtZ5cKP7K928EuVQA",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 829,
                    "name": "LEE, Ricky Shi-wei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MS01",
            "date": "Dec 29, 2017",
            "title": "L2 MECH2020 Review",
            "comment_content": "Course Topics:<br />1. Types of forces, moments and couples<br />2. Equilibrium and free body diagram<br />3. Description of forces and moments<br />4. Equilibrium equations<br />5. Trusses analysis, methods of joints and sections<br />6. Frames and machines<br />7. Kinematics of particles<br />8. Rectilinear and Curvilinear motions of particles<br />9. Kinetics of particles: Newton’s second law<br />10. Equations of motions<br />11. Angular momentum of particles<br />12. Kinetics of particles: energy and momentum methods<br />13. Conservation of energy<br /><br />I would say it is the in-depth or enhanced version of PHYS1112. If you did quite well in PHYS1112, you won't have any big problem in this course.",
            "comment_teaching": "3 hours lecture on the same day, which is quite long and boring. The professor just follow the content of ppts. i skipped most of his lecture and self-study the content.",
            "comment_grading": "Assignments:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20%<br />Quizzes:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;30%<br />Final exam:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;50%<br /><br />Since quizzes are similar with questions in assignments, the mean score is quite high. The mean is around 70/100 for Quiz 1 and 80/100 for Quiz 2 &amp; 3.<br /><br />P.S.: The quizzes for L1 and L2 are different, while both L1 and L2 use the same exam question paper <br />-----------------------------------------------------------------------<br />My Score:<br /><br />Assignment: 100%<br />Quizzes: 65/100; 95/100; 100/100<br />Final Exam: Unknown, I guess I got about 80%<br /><br />Final Grade: A-",
            "comment_workload": "5 Assignments in total. Most of them are extracted from the textbook and you can easily find the solution in google or solution manual if you have source.<br /><br />3 Quizzes in total. Questions are similar with those appear in assignments with changing numbers only.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Rjkx8fIKBP4MhMKQBEyQIax8XbGA0T8E",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 829,
                    "name": "LEE, Ricky Shi-wei",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gkdlgkdl",
            "date": "Dec 22, 2017",
            "title": "Fairly good course",
            "comment_content": "lecture 1 : introduction and statics of particles<br />lecture 2 : rigid bodies and equilibrium<br />lecture 3 : distributed forces<br />lecture 4 : analysis of structures<br />lecture 5 : internal forces and moments<br />lecture 6 : kinematics of particles<br />lecture 7 : kinetics of particle<br />lecture 8 : energy and momentum methods<br />lecture 9 : system of particles<br />lecture 10 : kinematics of rigid bodies",
            "comment_teaching": "Fairly Good <br />TA is helpful",
            "comment_grading": "Quiz 30%<br />Assignments 20%<br />Final 50%<br /><br />There are 3 quizzes and 5 assignments which are easy. Especially, if you did assignments, the questions for quizzes are just the same with assignments, but different numbers. If you study textbooks and try to solve some questions in the books, you will definitely get high marks.<br /><br />I couldn't get grade yet, but I am expecting A.",
            "comment_workload": "Workload is light. Assignments are quite easy, if you study the textbooks and search from the internet.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0oQ9gAwapowCYvgihIRRv37XnO1dbt4Z",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "chohyunni",
            "date": "Aug 25, 2017",
            "title": "",
            "comment_content": "Course Topics:<br />1 Types of forces, moments and couples<br />2. Equilibrium and free body diagram<br />3. Description of forces and moments<br />4. Equilibrium equations<br />5. Trusses analysis, methods of joints and sections<br />6. Frames and machines<br />7. Kinematics of particles<br />8. Rectilinear and Curvilinear motions of particles<br />9. Kinetics of particles: Newton’s second law<br />10. Angular momentum of particles<br />11. Kinetics of particles: energy and momentum methods<br />12. Conservation of energy",
            "comment_teaching": "The professor's English is not that good as she has a very strong Chinese accent. Other then that, she answers student's questions.<br />Make sure you use spend listen to her very well during the class, most of the exams are from what she discusses from the class.",
            "comment_grading": "The grading is actually not that bad. If you studied general physics or chemistry hard, this class should be very easy. The mean is about 80%. As long as you come to classes and work hard, I think this class is doable.<br />Homework 15%<br />Mid-term examination 35%<br />Final examination 50%",
            "comment_workload": "The following textbooks are helpful:<br />Vector Mechanics for Engineers: Statics<br />Vector Mechanics for Engineers: Dynamics<br />Beer &amp; Johnston, McGraw-Hill<br /><br />You would spend around 7-9 hr of studying per week.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Eu8scWu79Ad2iO6uxnKs2NItOm2KAR7G",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jaico",
            "date": "Jan 25, 2017",
            "title": "",
            "comment_content": "Fundamental course on the analysis of the equilibrium and dynamic behavior of mechanical systems. Statics: equilibrium of particles and of rigid bodies; distributed forces; analysis of structures, including, trusses, frames, cables and beams. Dynamics: kinematics of particles; kinetics of particles, Newton's second law, energy, momenta, impact dynamics; systems of particles; kinematics of rigid bodies; kinetics of rigid bodies in two and three dimensions.",
            "comment_teaching": "Teaching speed is suitable and providing a lot of examples in the lessons. Prof. Ma is willing to listen to students opinion in order to adjust the content in the lesson and the finals.",
            "comment_grading": "Prof Ma said the grade is based on Outcome Based, but I am not sure. However if your marks are higher than mean for all quiz, midterm and final, at least you will have a B.",
            "comment_workload": "Only a few homework in this course. Both midterm and final includes Long question and MC questions. Those MC questions are relatively easy.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xNn2V8xw3pov3LtCshL9iocHtA09SltL",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cfszeto",
            "date": "Aug 08, 2015",
            "title": "",
            "comment_content": "Fundamental course on the analysis of the equilibrium and dynamic behavior of mechanical systems. Statics: equilibrium of particles and of rigid bodies; distributed forces; analysis of structures, including, trusses, frames, cables and beams. Dynamics: kinematics of particles; kinetics of particles, Newton's second law, energy, momenta, impact dynamics; systems of particles; kinematics of rigid bodies; kinetics of rigid bodies in two and three dimensions.",
            "comment_teaching": "It's ok but he talked with a few examples.&nbsp;&nbsp;It is advised to read books and do additional questions for revision after lessons",
            "comment_grading": "Very Good Grade.&nbsp;&nbsp;You can get A range easily if you know the problem solving technique",
            "comment_workload": "A few easy assignments.&nbsp;&nbsp;But it is advised to try more questions in textbook for practice to get good grades",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Euead9N6aQqXHifzf8ZtLThE8DTaTSL9",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "浪子",
            "date": "Aug 04, 2015",
            "title": "好grade",
            "comment_content": "主要都係phy 野,簡單講就係force 同moment , 冇d, 冇in, 只係用加減乘除,簡單易明, 唔明note 睇書都ok<br />content: mid term, final term ,assignments<br />assignment有d 難度,不過都係出番類似書d exercise, 有睇source就ok",
            "comment_teaching": "冇需要上堂, professor 最叻就係簡單複雜化<br />tutorial 都閒就上下la ,做下題目係好事<br />不過其實,完全靠自己都ok 的",
            "comment_grading": "好grade , mean都應該有 around B<br />mid term mean 好低,final 都唔太高<br />題目會出番書d exercise ,多做bk exercise la",
            "comment_workload": "一般la<br />mid term ,final , assignment <br />assignment 幾難, 有source會好d<br />都算輕鬆的",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lWS0apWeN66NX9GJVBZulQ26rrevcsLy",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "An225 Mriya",
            "date": "Jan 04, 2022",
            "title": "Good Teaching for Dull Content",
            "comment_content": "MECH2020 is divided into statics and dynamics, in which a major focus is placed on statics:<br /><br />In statics, your main task is to use Newton's First Law to solve most problems. While some described that the questions are on par or even easier than DSE Physics, one will need to consider that vectors are also deployed to solve 3D space questions, which may be unfamiliar with those who only acquainted them at the end of MATH1014. But for those who studied M2 in DSE (or equivalent subjects in other curriculum), life is boringly easy in MECH2020.<br /><br />That said, they do teach you how to find the internal forces of trusses, and such questions do need specific methods, so you should nevertheless listen to some contents taught by Robin. Some of the course's content, particularly the methods on finding internal forces, is essential in your next semester's MECH2040.<br /><br />In kinematics though, the contents are much complex than DSE Physics. You're often required to calculate relative motions, apply the more complex radial equations of motions, and so on. Also note that details are fatal, like if you miss that there are 2 strings in a pulley, you get wrong distance, and everything built on it screws up...<br /><br />For those who spam questions for grades, you are advised to focus more on harder statics questions and dynamics questions.",
            "comment_teaching": "Professor Ma (Robin) teaching is enthusiastic and patient. He keeps a slow and steady teaching pace, so that all students can catch up with the course content. While it's obviously boring or dull for an easy course, you'll likely thank for his teaching when he teaches more difficult MECH courses later.<br /><br />Robin also have a grasp in maintaining the course's learning environment, he asks questions frequently, and for some occasions, said that will add bonus marks to those who answered correctly.<br /><br />Speaking of our TAs, they are Mainland Chinese PG students, so one can imagine their heavy accents. Like MATH tutorials, they gave out questions to us, solve, and explain the questions to us. While my comment for them is that their teaching is generally mediocre, I do remember on one occasion that the TA-in-charge came upstairs to discuss a hard problem with me. I'll therefore make a honorable mention here.",
            "comment_grading": "Assignments: 20% (95%, 80%, 100%, 100%, 100%)<br />Quizzes: 45% (100%, 100%, 95%)<br />Final: 35% (Never released)<br /><br />As stated in the Workload part, with only 1 to 2 questions, the assignments are generally easy, though you should check your answers twice to avoid careless mistakes that cost you a lot. Quizzes are also not hard as well, and I suspect that the grading for quizzes are laxer than that of assignments. After all, according to Robin, the quizzes were designed to facilitate staged revisions.<br /><br />Regarding the final exam, while someone previously reported that the questions were hard and tedious, this time the questions are all normal: no extra-hard questions, and I see a majority of students left early in the final exam. It is therefore quite likely that the previously reported harder questions are temporary measures for online teaching.<br /><br />While it is reported that MECH courses are notorious for not releasing final results, and at the end I also didn't receive any such results, I get an A for MECH2020. That said, I can't ascertain whether this means good grading or is because of the simple contents, as Robin did say that all grades are distributed in accordance to the recommended range (aka pulling the curve).",
            "comment_workload": "Assignments are generally light and easy, with usually only 1 to 2 questions for us to solve. They're to be submitted within 1 week. While the quiz questions are generally on the same level of difficulty with assignment questions, so doing some extra questions by Robin is also sufficient.<br /><br />If you want to prepare for the final, you are suggested to do extra challenging questions in the textbook. After all, most of the questions have fixed methods to solve, and aren't tricky. Questions involving unknowns are the hardest ones you'll encounter in MECH2020.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZpF84m47CooRW7pbJ8Y5gUBnux2AztL8",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "雨季之涯",
            "date": "Jan 22, 2017",
            "title": "",
            "comment_content": "Fundamental course on the analysis of the equilibrium and<br />dynamic behavior of mechanical systems<br /> Statics: equilibrium of particles and of rigid bodies; distributed<br />forces; analysis of structures, including, trusses, frames, and<br />beams<br /> Dynamics: kinematics of particles; kinetics of particles, Newton's<br />second law, energy, momentum, impact dynamics; systems of<br />particles; kinematics of rigid bodies; kinetics of rigid bodies in<br />two and three dimensions.",
            "comment_teaching": "教得都唔錯<br />上lecture同Tut差唔多, 一直講examplesssssss<br />其實唔上lecture都得",
            "comment_grading": "普遍人都有B range(&quot;應該&quot;有mean有B)<br />Assignments–15%<br /><br />Late submission of the assignment is not allowed<br /><br />Upload your assignment in pdf format to the Canvas<br /><br />Weeks3,6,8,10,12<br />Quiz–15%<br />Mid-termexam–25%<br /><br />No make up test will be provided and your 35%marks will go to the final<br />Finalexam–45%",
            "comment_workload": "好少野做<br />得5份Assignments<br />每份都係好簡單",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "lyWjUoNSczgKFE32x3poHJCsUAjYZscN",
                    "name": "MECH2020 mid term explanation with solution for students",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "wCL33Gp2nSqgQSo1RGPaJremNUhA7r8Z",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "jackywongkc",
            "date": "Jan 18, 2017",
            "title": "普普通通",
            "comment_content": "content 方面都唔算太深。只要肯上youtube 就會明白究竟教緊咩。",
            "comment_teaching": "上堂都明明地既。其實robin 教得幾有heart。但係有時都會唔係好明佢教緊咩。要自己讀番。",
            "comment_grading": "grade 就b range ，但係身邊d人都唔係太高grade",
            "comment_workload": "一般。assignment 唔算好難同多。2～3 個星期就會有一份到。",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Pl1eYtJXgRzDyfj6jnL6u2mNFkmuRf7L",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GK",
            "date": "Jan 14, 2016",
            "title": "Simple course",
            "comment_content": "Statics and Dynamics.<br />Statics: Total force = 0 and Total torque = 0<br />Dynamics: a = dv/dt, v = ds/dt, F = ma<br />That's all to it. Structure might be a bit more complicated than PHYS1112. However, simple questions are really simple. Difficult questions... everyone can't do. So don't be afraid of it.",
            "comment_teaching": "Tons of example on lesson. You can choose not to attend but I think it is quite fun to listen to Robin Ma. He is a nice person and funny person. No need to go to tutorial at all since they are completely useless.",
            "comment_grading": "Exam are shit difficult but midterm is super easy. Don't worry. The question you don't know is also not known by the other classmates. Easy A range on this course with a little bit of carefulness and exercise. Perharps A+ if you are hardworking to do all exercise on book",
            "comment_workload": "6 homeworks. Some on-lesson exercise which are kind of useless. More exercise on book should be done in order to be familiar with the style of questions. Otherwise, nothing much to be done within this course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1xPjg9CegAsxyRqm6glSRPJWzUxA8Dq0",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 565,
                    "name": "MA, Lok Wang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kkwo",
            "date": "Jan 21, 2016",
            "title": "",
            "comment_content": "midterm: 3 long questions on statics ( easy)<br />final: 3 questions on statics,3 questions on dynamics (very difficult)<br /><br /><br />Fundamental course on the analysis of the equilibrium and dynamic behavior of mechanical systems. Statics: equilibrium of particles and of rigid bodies; distributed forces; analysis of structures, including, trusses, frames, cables and beams. Dynamics: kinematics of particles; kinetics of particles, Newton's second law, energy, momenta, impact dynamics; systems of particles; kinematics of rigid bodies; kinetics of rigid bodies in two and three dimensions.",
            "comment_teaching": "slow process<br />do examples in the lecture<br />bad tutoring",
            "comment_grading": "assignments 10%<br />midterm 35 %<br />final&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;55%<br />Good grade",
            "comment_workload": "6 assignments in total",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PZ1GZQUDpsM7IuvlFXQEwOWIAiiZMsrP",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "on9",
            "date": "May 09, 2017",
            "title": "好好讀",
            "comment_content": "同dse phy差唔多<br />難得果小小<br />所以真係好鬼易",
            "comment_teaching": "唔洗上堂,全走A",
            "comment_grading": "全走lecture全抄hw 溫一個星期書考final :A<br />若要生活好,咪_做機佬",
            "comment_workload": "完全無workload,功課都係抄<br />完全無workload,功課都係抄<br />完全無workload,功課都係抄<br />因為好重要所以要講3次<br />記得拎source啦",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}