{
    "error": false,
    "course": {
        "id": 1393,
        "subject": "MECH",
        "code": "3640",
        "name": "Aerodynamics",
        "description": "Irrotational flow, circulation, lift and drag, aerofoil, conformal mapping, lifting line theory, Elliptical wing, swept wing, delta wing, supersonic flow. For science and engineering students in their second year of study or above.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"CENG\" data-code=\"2220\" href=\"/review/CENG2220\" target=\"_blank\">CENG 2220</a> OR <a class=\"course-link\" data-subject=\"CIVL\" data-code=\"2510\" href=\"/review/CIVL2510\" target=\"_blank\">CIVL 2510</a> OR <a class=\"course-link\" data-subject=\"MECH\" data-code=\"1907\" href=\"/review/MECH1907\" target=\"_blank\">MECH 1907</a> OR <a class=\"course-link\" data-subject=\"MECH\" data-code=\"2210\" href=\"/review/MECH2210\" target=\"_blank\">MECH 2210</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 5,
        "rating_teaching": 5,
        "rating_grading": 4.67,
        "rating_workload": 4.5,
        "review_count": 6,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 562,
                "name": "LI, Larry",
                "count": 6
            }
        ]
    },
    "reviews": [
        {
            "hash": "pPdE3HV6O8blsxEyEuCQipOPMvHaXLzS",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 562,
                    "name": "LI, Larry",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jason uy",
            "date": "Jan 20, 2018",
            "title": "",
            "comment_content": "1. Review of fluid mechanics<br />2. subsonic flow:<br />Thin Airfoil Theory <br />Lifting Line Theory<br />3. supersonic flow:<br />Shock waves<br />Prandtl-Meyer expansion fan<br />TAT for compressible flow<br />4. transonic flow",
            "comment_teaching": "Prof. Larry Li is definitely one of the best lecturers in UST. He explained the stuff clearly and in a vivid way. The course materials were also well prepared.<br />In this semester there was a little design project that gave us some bonus marks. It was in fact quite fun to play with and would enhance your understanding in designing airfoil in my opinion.",
            "comment_grading": "Cheatsheets would be allowed to bring along with during exams. <br />Mid-term mean was around 70%.<br />For the finals, just like other MECH courses the final marks were not known, but the question types were quite standard so if you prepare the cheatsheets well and have done the provided mock finals, you should be able to get a good grading.",
            "comment_workload": "1 assignment per 1-2 weeks, but the TAs will explain the homework during tutorials so there should be no worries.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PRfDIt1Nxz6rh3WBlFGMA124w4HOu8nI",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 562,
                    "name": "LI, Larry",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Animesh",
            "date": "Dec 09, 2016",
            "title": "",
            "comment_content": "This course deals with the fundamentals of aerodynamics, starting off with a reiteration of fluid mechanics from MECH2210, and then describing the various theories linked with incompressible flows, compressible flows, subsonic and supersonic flows.<br /><br />Prof Larry does an excellent job in linking the theory and mathematics behind each concepts to their actual application in real aircraft.",
            "comment_teaching": "Larry is hands down the most engaging and one of the best professors in Dept of MAE. <br /><br />He takes the effort to engage with as many as students as he can, and is very approachable and helpful.<br /><br />Also, his slides are very easy to understand and comprehend the material from.",
            "comment_grading": "I haven't got my final grade yet.<br /><br />However, the midterm and final exam papers were relatively easy but very long. The mean is generally very high- which makes the grading curve rather steep.",
            "comment_workload": "Larry's slides are sufficiently comprehensive if getting a good grade is your primary focus in this course- thus making your life a lot easy as compared to many other courses where you are left scurrying between different reference books and online videos trying to understand basic concepts.<br /> You will get a full grade on your weekly HW as long as you turn it in, although they are sufficiently easy.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KaKWpkin7sJ2SQkBkOEGtzMHiAJTvTog",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 562,
                    "name": "LI, Larry",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "An225 Mriya",
            "date": "Jan 04, 2023",
            "title": "An Enjoyable Learning Experience",
            "comment_content": "The contents can be roughly divided as follows:<br />Lectures 1-4: Introduction, fluid mechanics revision<br />Lectures 5-7: Incompressible flows over airfoil: Thin-airfoil theory<br />Lectures 8-10 Incompressible flows over wings: Lifting line theory<br />Lectures 11-12: Incompressible viscous flows and (a bit of) turbulence: Blasius similarity solution<br />*****************<br />Lectures 13-16: General compressible flows: Isentropic flows, shockwaves, expansion fans<br />Lectures 17-19: Compressible flows over airfoil: Linearized potential equation, Prandtl-Glauert transformation, transonic flow<br /><br />Note that Lectures 1 to 13 were all about incompressible flows, while Lectures 14 to 19 were related to compressible flows. As the course is built on previous knowledge of fluid mechanics (taught in last semester's MECH2210), Larry devoted 2 weeks to refresh our memory on the topic.<br /><br />In general, I'll say the contents were straight forward and easy to master. For compressible flows you'll need to frequently look for tables, something similar to MECH2210 last year.<br /><br />P.S. As a number of questions require reading various tables, you are recommended to bring 2 rulers with you to locate the intended range on tables and avoid confusing numbers of other rows and columns.",
            "comment_teaching": "Absolutely superb.<br /><br />Professor Larry Li indeed did a great job in making lectures memorable and lively. Perhaps owing to his own experience of growing up in Canada, he was really talkative and sociable, both in class and after class (in which I also had a few chats with him). Accent is totally not a problem. That said, attending students were few for the Friday lectures that started at 9AM. Printed lecture notes were distributed on lectures. You should collect them all, which would be extremely useful in revision and finishing open-book exams.<br /><br />Concepts and theories were explained step-by-step without referring to tedious amounts of equations, while steps that are too complex were left for self-reading. Moreover, real-life aircraft examples were used whenever possible, which is not only interesting to aviation enthusiasts, but also leave a deeper memory on students, and serve as useful reference in later design course (MECH3620).<br /><br />Throughout the semester, Larry maintained a steady teaching pace with sufficient time left. In fact he left 4 lectures unused for teaching and used them for project-related purposes, which made great contrast with Professor Fu who taught me MECH2310 last year (reportedly better this semester).<br /><br />Another good thing is that both Larry himself and the TAs designed not-for-grade assignments and quizzes, which I think is good for self-understanding without facing all of the stress and tension for graded assignments/quizzes.<br /><br />For the TAs, Jungjin Park was generally responsible for coordinating the project, wind tunnel experiment and tutorials, while Hiromi Kimishima was generally responsible for answering homework questions. As former HKUST AE undergraduate students, they provided enormous help to our homework and project questions. Emails and Canvas discussion threads were effectively replied. The TAs were also responsive to questions raised during tutorials. I'll consider them being one of the best postgraduate TAs in HKUST.",
            "comment_grading": "20%: Homework (&gt;97/100, mean &gt;91/100)<br />40%: Project (150.5/170, mean 118.31/170, median 132.5/170)<br />40%: Final Exam (Never released per MAE practice, but should be good enough)<br /><br />Homeworks were frequent, with most of them (except 2 freebies) required to be submitted within 1 or 2 weeks. However, Larry/TAs provided hints that were almost step-to-step solutions for the homeworks, so they act much similar to in-class examples than actual assignments.<br /><br />The project was a bigger assessment that consisted of assorted questions related to incompressible flows. You were given an airfoil and wing planform, and were required to answer the questions based on the results of theories, wind tunnel experiment and XFLR5 (a entry-level numerical CFD software).<br /><br />The final exam was an open-book exam consisting of 2 parts: Part 1 asked for conceptual questions, which was sufficiently easy with the force of printed lecture notes, while Part 2 was the long questions. Although Larry did give out mock papers for our revision, you should always do other questions by all means, particularly the supplementary questions. Per my experience, the long questions appearing in mock papers were the most unlikely to appear on real final papers.<br /><br />At the end another A+ grade. Another friend of me also got an A-range grade, so this course was a good grade course.",
            "comment_workload": "As mentioned, homeworks were frequent for MECH3640, and could be a problem when assignments from other courses were taken account. However, as there were ample hints, they could be solved in hours once you start working. Note that the one for lifting line theory may require you to deal with complex simultaneous equations, which could be a hassle.<br /><br />Larry described the project as a big homework, which was true to quite some extent. One should immediately start working with the project once you learned the corresponding topics: when the due date of the project approaches, you would be facing other projects and regular assignments when the semester enters November.<br /><br />Part of the project involved wind tunnel experiment and running simulations on XFLR5, in which you need to go to the wind tunnel lab to conduct experiment on a specific airfoil, and it did take considerable time to process all data obtained from them, plus you’ll need to deduce conclusions from all of the charts and observations in order to answer the questions... AeroTeam members may have an advantage, as they regularly hold workshops on XFLR5.<br /><br />All in all, start the project early, do what you can do once you know they’re understandable, don’t leave them after the midterm exams: you'll screw up.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "swGZ5LKb5JM607bt3bAleOE5JpsudKQ6",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 562,
                    "name": "LI, Larry",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LuQ",
            "date": "Jan 27, 2021",
            "title": "",
            "comment_content": "You can look at other reviews on the content, very straightforward, nothing more to it.",
            "comment_teaching": "Larry is arguably one of the best teachers I've had here. Explains things very clearly without all the crazy math equations, though enough of those so I wouldn't be that lost. His teaching pace was not all that rushed, though he'd often overrun class by 5-10 minutes. <br /><br />Larry also attends the tutorial sessions, and seems to be on friendly terms with the TAs, which was a first for me, as normally TAs and profs work very separately during classtime. The TA Jungjin teaches very well during tutorials, I recommend to avoid skipping those as he explains well from a student's perspective (he was a former Mech student at UST).",
            "comment_grading": "The homework was graded as pass/fail, as long as you submit is okay.<br /><br />The project mean was very high (80%), as expected since it wasn't too difficult nor asking for much. There's optional bonus points for 10 marks to use simscale.<br /><br />Exam was open book/open internet. Larry even gave us a bit of extra time. The exam was filled with easy-moderate difficulty questions, but the timing was a bit tight. Because of that, the mean may have been high, careless mistakes could cause a slip of grade.<br /><br />I got 90% for project and pass for all homework, but still get B, most likely from exam",
            "comment_workload": "Homework was given every 2 weeks, but the TA gave more than enough hints on Canvas to shorten the time to complete the homework.<br /><br />Larry decided to replace the midterm with a half-semester long project. Report is more like a lengthy homework, so it wasn't all that difficult, just give yourself at least 2 weeks to check everything is in working order since the project requires students to use XFLR5 to do simulation. Again the TA was more than helpful, by providing thorough tutorials and responds on Canvas discussions very quickly.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eGVGnC47NLeo0NjTGL94uHfbNOjR2RRP",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 562,
                    "name": "LI, Larry",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Koalak",
            "date": "Jan 19, 2021",
            "title": "",
            "comment_content": "A good introduction to Aerodynamic starting from subsonic airflow to supersonic airflow, even covered turbulence model. The course introduce a lot of useful equation and tools for analyzing airflow",
            "comment_teaching": "A really good professor who have a nice and clear voice. He puts aviation news and a lot of interesting research results in lecture. He is also a fun and considerate professor who delay the deadlines to couple with our workloads",
            "comment_grading": "For the project, the mean is about 80% <br />For the final, it is just like other MECH course which will not show the final results. But generally speaking the grading is very lenient. All reasonable answer is accepted.",
            "comment_workload": "There are 9 HW in total with hints provided. The project require us to use xflr5 and simscale to do the simulation. The workload is reasonable.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EOsB8IJQ8WzrWhhr4qTPE0qmFwc8BgN3",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 562,
                    "name": "LI, Larry",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ywtt_",
            "date": "Jan 12, 2017",
            "title": "",
            "comment_content": "Some fluid mechanics introduction in the first two lectures. Guys with MECH 2210 background can handle the course easily.",
            "comment_teaching": "Larry explained the contents clearly. You can feel he is a professor full of passion.",
            "comment_grading": "We didn't get the final marks. But the final exam is not difficult at all. Just get the cheat sheet well-prepared, and pay attention during lectures is already enough to get a good grading.",
            "comment_workload": "One homework in every one and a half to two weeks. Each homework didn't need much time to do it as there is a tutorial every week teaching the assignments. No quizzes. Only have assignments, midterm exam and final exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}