{
    "error": false,
    "course": {
        "id": 961,
        "subject": "MECH",
        "code": "3310",
        "name": "Heat Transfer",
        "description": "Transient and steady heat conduction.  Natural and forced convection.  Radiative exchange.  Introduction to computational methods.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1530,
            1430
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MECH\" data-code=\"2210\" href=\"/review/MECH2210\" target=\"_blank\">MECH 2210</a> AND <a class=\"course-link\" data-subject=\"MECH\" data-code=\"2310\" href=\"/review/MECH2310\" target=\"_blank\">MECH 2310</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.55,
        "rating_teaching": 3.73,
        "rating_grading": 4.09,
        "rating_workload": 3.45,
        "review_count": 11,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 577,
                "name": "YAO, Shuhuai",
                "count": 9
            }
        ]
    },
    "reviews": [
        {
            "hash": "NiLKNG8qYFo9O1sYHmQ8NHJgLttA9Ryc",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 577,
                    "name": "YAO, Shuhuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SushiOne",
            "date": "Jan 18, 2019",
            "title": "Fair",
            "comment_content": "Extension of Thermodynamics: <br />Conduction, Convection and Radiation",
            "comment_teaching": "I would say not the best lecturer out there, but not bad also. Among the courses in which you would have to take as a 3rd year MECH student, she is one of the better professors out there compared to other 3000 level courses. She is quick in responding to your emails and is quite passionate about the course and listens to you. Maybe her lecture pattern can be boring and dull, but I am not quite sure how to make lectures fun when the course itself has to cover a lot of contents and equations. I personally think she has done a descent job.",
            "comment_grading": "Almost full marks on HW<br />1 sd above for Midterm<br />1 sd above for Final (not sure since I dont know the sd)<br />Missed one quiz<br />Got an A <br /><br />The questions you get on the tests are reasonable - professor gives u practice questions, and you should definitely know how to solve them.",
            "comment_workload": "Frankly speaking, weekly HW is not bad at all compared to other courses which has weekly HW AND labs. If you invest&nbsp;&nbsp;If you invest enough time on HW not just copying answers, you should get some level of understanding.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oRCsJZhwLCHffCn2a56PhfrotWPRcWTZ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 577,
                    "name": "YAO, Shuhuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "CKL",
            "date": "Dec 31, 2018",
            "title": "",
            "comment_content": "1. Introduction<br />2. Introduction to conduction<br />3. One-dimensional, steady-state conduction<br />4. Transient conduction<br />5. Introduction to convection<br />6. External flow<br />7. Internal flow<br />8. Free convection<br />9. Radiation: processes and properties<br />10. Radiation exchange between surfaces<br /><br />This course explains three modes of heat transfer: conduction, convection and radiation. Conduction part explains how to find the temperature distribution and rate of heat transfer. Convection part explains how to find rate of heat transfer by calculating convection heat transfer coefficient in different situations. Radiation part explains how to find rate of heat transfer by calculating emissivity and heat transfer between surfaces.",
            "comment_teaching": "The teaching of the professor is average. Since it is 9am lesson, it is easy to fall asleep.",
            "comment_grading": "Homework: 15%<br />Midterm: 35%<br />Final exam: 45%<br />Attendance: 5%<br /><br />Statistics:<br />Homework mean: 92.4/100<br />Midterm mean: 69.1/100<br />Final exam mean: 60/100<br /><br />My scores:<br />Homework: 81.2/100<br />Midterm: 61/100<br />Final exam: 100/100<br /><br />Final grade: A-<br /><br />Few personal comments:<br />I was very desperate after the midterm since I got several marks below mean. The prof encourages us not to give us and encouraged us to study hard for the final exam. She said that if we could show great improvement in the final exam, she would help us a bit in the final grade, maybe 1 sub-grade up. I therefore worked very hard, studyed day and night for this course. Finally I got 100 marks in the final exam, which was 40 marks above mean. After some calculation and prediction, I predict that I am in between A and A-. I expect she would keep her promise and help me a bit to get an A. However, I was quite disappointed after the grade was released.&nbsp;&nbsp;Finally she broke her promise. Does this story means that if you perform somehow badly in midterm (just few marks below mean), even if you work super hard and have extra-ordinary performance in the final exam, you only deserve an A-. How about the rest of the class? I have heard some cases that they got only few marks below mean, they got C+. Frankly speaking, I am quite disappointed with this course. The prof seems to become a killer this year.",
            "comment_workload": "The workload is average. There is a weekly assignment with about 4 long questions. You have to submit the corresponding assignment within 1 week that the chapter has just been finished, so it is a bit rush to get all the concepts and finish the assignment on time.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 4,
            "attachments": []
        },
        {
            "hash": "y7Q6VxRaqJVwBl0lnGdHQtaR1fLfPYSX",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "killgor",
            "date": "Aug 20, 2018",
            "title": "",
            "comment_content": "The content is quite related to our daily life. It covered heat transfer in 3 ways, conduction, convection, and radiation.",
            "comment_teaching": "The lecture notes by prof. Yao is very detailed. It helps students to understand the principle and theory. On the lesson, she will explain the concept of heat transfer detailly and derive the equation step by step. Even I didn't take the differential equation course, I still can know how to do the question included it.",
            "comment_grading": "Mid-term and final exam exercise will be provided. The questions are quite similar to the real mid-term and final. Do it if possible.<br />9x% midterm<br />9x% final exam<br />A+",
            "comment_workload": "9 assignment in total, one mid-term, and a final exam. The assignment is helping students to understand and apply the knowledge learned from the lecture.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hHPkAy77wlthAanIqvLvyn8MTirdAkYN",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 577,
                    "name": "YAO, Shuhuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AE",
            "date": "Jan 21, 2022",
            "title": "Better Understanding in Heat Transfer (AE student tries MECH required course)",
            "comment_content": "Four main parts: Conduction, Convection, Radiation, Multimode Heat Transfer<br /><br />Fundamental Conduction<br />Thermal Circuit Analogy + Radial System<br />Conduction with Heat Generation<br />Extended Surfaces<br />Lumped Capacitance<br />Transient Conduction<br />Numerical Conduction<br /><br />Fundamental Convection<br />External Convection<br />Internal Convection Thermal Consideration + Energy Balance<br />Internal Convection Correlation<br />Natural Convection<br />Phase Change<br /><br />Radiation Intensity<br />Radiation Blackbody and Grey Surface<br />Environmental Radiation and View Factor<br />Radiation Exchange<br /><br />Multimode Heat Transfer<br /><br />Remarks:<br />Lots of equation<br />Require fundamental mathematics and physics knowledge, otherwise, it takes some time for you to understand it.<br />After that, the content is relatively straightforward.",
            "comment_teaching": "Professor just follows the slides, but she also tries to have some interactions, like asking questions or having some video demonstrations. I seldom attend the lessons as they are sometimes boring. I prefer reading notes to save some time. If you, however, don't understand the content, attending lessons may help you. <br /><br />I never attend tutorial sections so I know nothing about it. They upload TA notes which contain hints for the homework. Thus, I recommend reading their notes if you encounter difficulty when doing homework or studying.",
            "comment_grading": "Homework 20%<br />Class Participation 5% (sudden quiz)<br />Midterm 35%<br />Final 40%<br /><br />In my opinion, working steps are important. Even though your answer is wrong in homework and exam, written steps and equations can contribute to some marks. Thus, writing all you know is also fine as the TA/grading is kind.<br /><br />For midterm and final, questions are similar to those in homework and lecture notes. I recommend remembering the solving methods. Again, the grading is fine. Make sure you try to write all you know, like equations, correlation, etc. Cheatsheet is allowed in both midterm and final.<br /><br />My grade:<br />Homework (8 HWs in total): <br />mostly 100/100, [mean around 87]<br />Midterm: <br />100/100, [mean 72.73, highest 100, lowest 0]<br />Final:<br />93/100, [mean 45.1, highest 93, lowest 7]<br /><br />Overall: A+<br /><br />Put some effort into understanding the questions in lecture notes, TA notes, sample papers, and your grade will not be bad.",
            "comment_workload": "Just normal MECH course having assignments, quizzes, midterm, and final<br />One homework per week.<br />One quiz (attendance checking) per three weeks (?) Not sure.<br /><br />As an AE student, this additional course didn't affect my academic path in terms of time and effort. Thus, the workload was not high for me.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "P5YkzZA8O4dyCv21GRRDplUibUzQegKV",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 577,
                    "name": "YAO, Shuhuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bbmadevipalive",
            "date": "Jan 04, 2019",
            "title": "poor organisation of contents and teaching",
            "comment_content": "Mainly contents on conduction, convection and radiation.<br />Mostly radiation and convection covered in final, also lumped capacitance",
            "comment_teaching": "Poorly designed lecture notes. There are only equations typed in the notes and a few example questions with and without ans<br />Poor teaching. Strong mainland accent and not a nice voice...quite sleepy for 9am classes<br />Contents were not explained in details in terms of concepts<br />Focused mainly on example questions<br />Tutorial notes are too hard and each has one question only",
            "comment_grading": "fair grading<br />1sd below mean for midterm, mean 69 sd 18<br />Final mean 60 sd unknown me 44<br />got C",
            "comment_workload": "almost weekly homework <br />attendance quizzes counting for 5% (about twice only)",
            "rating_content": 5,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PQnBIeAt6weVOj4J5eiru5DTgogBW2dL",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 577,
                    "name": "YAO, Shuhuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kana_0728",
            "date": "Jan 04, 2019",
            "title": "",
            "comment_content": "1. Introduction<br />2. Introduction to conduction<br />3. One-dimensional, steady-state conduction<br />4. Transient conduction<br />5. Introduction to convection<br />6. External flow<br />7. Internal flow<br />8. Free convection<br />9. Radiation: processes and properties<br />10. Radiation exchange between surfaces<br /><br />This course explains three modes of heat transfer: conduction, convection and radiation. Conduction part explains how to find the temperature distribution and rate of heat transfer. Convection part explains how to find rate of heat transfer by calculating convection heat transfer coefficient in different situations. Radiation part explains how to find rate of heat transfer by calculating emissivity and heat transfer between surfaces.",
            "comment_teaching": "Only teach about how the equation come<br />Very less example<br />No need to attend because u can read through the notes<br />But you still don't know what u hv learnt",
            "comment_grading": "Below mean 1 Sd<br />Grade : c<br />Average",
            "comment_workload": "Hw everyweek<br />But easy",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qYoWEsDalpHRazOwGMv32dBfTQBcKDE0",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 577,
                    "name": "YAO, Shuhuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ceo",
            "date": "Dec 29, 2017",
            "title": "Good course!",
            "comment_content": "This course deals with heat transfer phenomena including conduction, convection and radiation. The basic knowledge of these 3 processes are taught in high school, and this course gives a deeper treatment of them in a more mathematical way and teaches you how to apply those knowledge in engineering applications. Read other reviews for the details of the course content.<br /><br />Conduction part is easy, but convection is another world because it requires knowledge from Fluid Mechanics (MECH 2210). Review the content from MECH 2210, or you aren't able to understand even one word from the lectures on convection. Although the radiation part is about Modern Physics, we just need to know the results and use them.<br /><br />Overall, this is just a computation course, for if you use the correct formula and plug the numbers correctly, you can get the right answer. The concepts are not that difficult if you have a strong foundation on thermodynamics and fluid mechanics. Better review MECH 2310 and 2210 before studying this course!",
            "comment_teaching": "Professor can clearly bring out the concepts we need to know from this course, though she has some Mainland accent. The teaching pace is appropriate for everyone to know what's going on. She would sometimes derive the formulas on the lecture notes using whiteboard or a piece of paper. I highly appreciate this, though the derivation is not required.<br /><br />I skipped all tutorials as it is at 9 am!",
            "comment_grading": "The grading is lenient. Both midterm and final have mean of about 68 or 69 and sd about 18 or 19.<br /><br />My results:<br />Assignments (count the highest 8 marks out of 9)(15%): 97.25/100<br />Midterm (35%): 100/100<br />Final(45%): 95/100<br />Grade: A+<br /><br />From past experience, the mean is about B or B+, which is typical for MECH courses.",
            "comment_workload": "9 assignments, 1 midterm, 1 final, quizzes<br /><br />The assignments are almost released weekly, and in this semester, we also have MECH 3610 giving weekly assignments, so it is tough. I can only find sources for some of the problems as some of them are actually past final or midterm questions set by the professor originally. <br /><br />If you try to do all of those problems by yourself, you will find this rewarding as the problems of the midterm and final have similar difficulty as the assignments.<br /><br />Quizzes are only used for checking attendance. Just hand in your name and it will count.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ard4YPeSXChVNmOfa5oWFUDKqMHBIHxs",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 577,
                    "name": "YAO, Shuhuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MS01",
            "date": "Dec 29, 2017",
            "title": "OK Course with good professor",
            "comment_content": "- 1D Steady Conduction<br />- 1D Transient Conduction<br />- External Convention<br />- Internal Convection<br />- Natural Convention<br />- Radiation Transfer<br /><br />The mathematics involved in the derivation of different equations and theorem are complicated, but they are useless in general. Instead, how to apply correct equations in different situations is more important.",
            "comment_teaching": "Compare with other MECH professors, her teaching style and English&nbsp;&nbsp;Proficiency is better. She will explain the proof of different equations in detail which may useful in homework. Lecture powerpoints contain some example questions which are useful in revision.",
            "comment_grading": "Homework:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;15%<br />Midterm Exam:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;35%<br />Final Exam:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;45%<br />Class Quiz:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5%<br /><br />Quizzes are very easy and they are basically equal to attendance.<br /><br />The difficulties for midterm and final exam are average. Not very easy or very challenging. <br /><br />Both midterm and final exam can bring cheatsheet, remember to write formula and other useful information on it!<br /><br />P.S.: Some of the questions appeared in both midterm and final exams may come from previous year's homework questions or pastpaper. Therefore, I may suggest you copy some of them WITH SOLUTION in your cheatsheet if you find previous homework sources. If you were lucky enough, you may find that the question are exactly the same!<br />-------------------------------------------------------------------<br />My Score:<br />Assignment: 93%<br />Midterm: 70/100 (mean: 62.7/100)<br />Final: 80/100 (mean: 60.5/100)<br /><br />Final Grade: B+<br /><br />P.S.: The mean score are shown in Canvas, and I did not know the SD of both midterm and final exams.",
            "comment_workload": "9 homework throughout the whole semester, homework set is released every week. The workload was heavy because the questions are difficult and need to spend hours to complete. However, 8 highest hw scores (out of 9) will be counted.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gxK5fhzZTEQNi2O1gLplIC1Ye3itxgKR",
            "semester": "2015-16 Spring",
            "instructors": [],
            "is_author": false,
            "author": "udidosa",
            "date": "Aug 20, 2017",
            "title": "Excellent",
            "comment_content": "It's essentially applied Physics and focuses on the principles of conduction, convection and radiation. Supposedly, you should have learnt this in earlier Physics classes and it just explores them in more depth. It is much more simpler than MECH 2310 (thermodynamics) and I would say more pratical.",
            "comment_teaching": "If we're only looking at MECH professors, she is already one of the better ones in terms of teaching style and clarity. Much better than most of the professors already.",
            "comment_grading": "If you have a cheat sheet with all the formulas written down, then the grading is quite 'good'. Both exams allow students to bring in cheat sheets and if you can even write down the formulas on the exam paper, you can get a couple of marks.",
            "comment_workload": "Workload is quite light, with there being weekly homework and some quizzes. So, I would recommend you attending the class.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NBLyi6TNIefZBvqCnPySRwYp5Y22SwWv",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 577,
                    "name": "YAO, Shuhuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Adrianop",
            "date": "May 21, 2017",
            "title": "ok course",
            "comment_content": "Transient and steady heat conduction. Natural and forced convection. Radiative exchange. Introduction to computational methods.<br /><br />Basically three modes of heat transfer: conduction, convection, radiation<br /><br />Contents are rather easy to understand.",
            "comment_teaching": "Ok teaching I will say,<br />She will explain with details for calculation parts, for the derivation of eqs. she will really write it out so her flow are easy to follow",
            "comment_grading": "Homework (15%)<br />Midterm (35%)<br />Final (45%)<br />Quiz(5%)<br /><br />Quiz ar very easy and it is basically equal to attendance.<br /><br />Midterm and Final are easy, don't make stupid mistakes can already give u an B.<br /><br />Got full mark in midterm and get an A <br />(as always we won't know the scores for mech final exam so I don't know the grades are good or not)",
            "comment_workload": "9 hws in total <br />quite heavy, as the hw are more difficult than exam for convective and radiative heat transfer parts, and the hw problems often have some issues we often need to ask TAs in order to clarify it.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "neSGMaiZ7k7rC6zL5WrIL6FfQV3aZv2P",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 577,
                    "name": "YAO, Shuhuai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Globas",
            "date": "Dec 16, 2016",
            "title": "A good course worth to take",
            "comment_content": "The lecture notes and textbook contain a lot of mathematical deduction of formulas that is useful in the exam, but in general they are unimportant. It is enough just to remember the method how equations, results and tables can be used to solve the problems, as well as setting the correct assumptions.<br /><br />The mathematics at the beginning may frighten the students, but the applications of concepts are rather easy.<br /><br />Topic 0: Introduction<br /> - Modes of Heat Transfer<br /> - Review of Thermodynamics<br />Topic 1: 1-D Steady Conduction **<br /> - Governing equations<br /> - Thermal circuit in Cartesian and Radial Systems<br /> - 1-D Steady Conduction /w energy generation<br /> - Extended Surfaces (Fins)<br />Topic 2: Transient Conduction ** <br /> - Lumped Capacitance Model<br /> - Semi-Infinite Solid<br />Topic 3: 2-D Conduction: Numerical Method (Optional)<br />Topic 4: Convection ***<br /> - Internal Convection<br /> - External Convection<br /> - Natural Convection<br />Topic 5: Phase Change (Optional)<br />Topic 6: Radiation ***<br /> - Radiation Intensity<br /> - Black and Grey Surfaces, Kirchoff's Law<br /> - Environmental Radiation<br /> - View Factors<br /> - Radiation Exchange Between Surfaces<br /> - Multi-mode Heat Transfer",
            "comment_teaching": "Her teaching in terms of English Proficiency is good relative to many MECH professors. She is patient to the questions raised by students.",
            "comment_grading": "Homework: 15% (9 assignments, 1 lowest score can be dropped)<br />Attendance: 5%<br />Midterm: 35%<br />Final: 45%<br /><br />Homework ~85% x 15% = 12.75%<br />Attendance 0% x 5%= 0%<br />Midterm 75% x 35%= 26.25%<br />Final 91% x 45% = 40.95%<br />Total = 80% B+<br />Lesson: Attendance is important!!!!!!!!!!",
            "comment_workload": "The homework problems are challenging and not easy, but should be OK if you have source. Expect 4-5 hours for each homework set.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}