{
    "error": false,
    "course": {
        "id": 999,
        "subject": "MGMT",
        "code": "3120",
        "name": "Managerial Leadership",
        "description": "Understand the nature of leadership and how it goes beyond managership. To develop an appreciation for the complexities of dealing with people who hold different values. To introduce, develop and encourage new strategies and techniques to enhance both teamwork and effectiveness in the workplace.",
        "categories": [],
        "website": null,
        "credits": 4,
        "semesters": [
            2230,
            2210,
            2110,
            2010,
            1930,
            1840,
            1830,
            1730,
            1640,
            1530,
            1430
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MGMT\" data-code=\"2110\" href=\"/review/MGMT2110\" target=\"_blank\">MGMT 2110</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.46,
        "rating_teaching": 4.38,
        "rating_grading": 4.46,
        "rating_workload": 4.46,
        "review_count": 13,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1457,
                "name": "MA, Jingjing",
                "count": 8
            },
            {
                "id": 597,
                "name": "ZHU, Jing",
                "count": 3
            },
            {
                "id": 588,
                "name": "YEUNG, Wai Mun Lucia",
                "count": 1
            },
            {
                "id": 1006,
                "name": "VAN NIEL, Penelope",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "CeTyrcLv5zNS2rJXV2zIX0GaA34xbOkr",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1457,
                    "name": "MA, Jingjing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "skrskrskr",
            "date": "Jan 07, 2021",
            "title": "Easy-understanding lectures about Leadership Topics",
            "comment_content": "The whole course teaches knowledge around Leadership. What traits, skills the leaders possess, how's the behaviour of leaders tend to be, more relationship-motivated or task-motivated, how a leader transform their subordinates to a better person and it's important to be an ethical leader. The knowledge may be quite abstract but it's pretty easy to understand. Moreover, there are some important frameworks and concepts taught which would be tested in the exams very likely.",
            "comment_teaching": "Very good professor who often carries out class discussion and give feedback to students every lesson, sometimes the discussion occupies for more than half of the time of the class. She has a good attitude, sometimes students answer too much but she still tries her best to give helpful feedback. The teaching speed is not fast which allows students to easily catch up the concepts, she also give examples.",
            "comment_grading": "Very good grading, didn't expect I would get an A since I got below mean in the first exam. The second exam is quite challenging because there are only 75 minutes for 4 essay questions, 13.75 marks for each question and each passage is quite long. The key to stand out in exam 2 is to be very clear with the concepts, fast reading and typing speed. Although the exam is open-book, it takes you time to locate the concepts, therefore it's important to have enough revision. Many people could not manage to finish the Exam 2 and lost mark for the final questions, I was lucky to finish it 5 minutes before the exam ended. How she graded the answers should be quite lenient since I got 54/55 in the exam.<br /><br />For the project, the presentation is more important than the report, 20% and 15%. She is a good grader that she often gives high marks to groups so the mean is high, just make sure not to include significant mistakes in the Powerpoint and prepare well for the Q&amp;A session during presentation.<br /><br />Learning Diary 8% (8/8)<br />Self-assessment 8% (8/8)<br />Exam1 14% (12/14) 23/25 Mean: 23.4<br />Exam2 25% (24/25) 54/55 Mean: 48.2<br />Team Project 35% (19/20+13/15) Mean: Present 17.8 Report 12.2<br />Participation 10% (?/10) I guess I have like maybe 8 at least<br /><br />Final Grade: A (84+?/100)<br /><br />Remember to submit the learning diaries and self-assessments, those are easy-earning points which you submit and gain full mark, she seems give no mercy to those who submit late, please remember to submit.<br /><br />The exams calculation is not normal, you got 1% less if you score 1 mark less in the exams. That means 55 = 25%, 54 = 24%, 52-53 = 23%, 51 = 22%, 50 = 21%...... Same calculation method for Exam 1, therefore it would be very painful for losing each mark. You can imagine in the Exam 2 not having time to do the last question will result in a disaster since the course is highly competitive (mean in Exam 1 which is MCs having mean at 23.4).<br /><br />The participation marks would be calculated in two parts, first part is the attendance of the presentation classes and the guest speaker session. The other part is the class discussion, if you contribute to it then you may earn extra credits from the 10% as the syllabus said.",
            "comment_workload": "The workload is low. Those assessments just take you little time to finish. For the revision, it may take you some time but I jotted notes each lesson so I just used little time to revise for the exams. <br /><br />The big boss would be the project. I am very thankful to have very good groupmates which we all work really hard for the projects and divide the workload evenly(I think), therefore the workload is light. I myself am not a very professional in doing projects, but the teamwork we had had made us a great success in both preparing and finishing the projects, it was also a very fruitful and exciting opportunity to work with them. I would like to use this platform to say thank you to them, hope they would see it.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "olCuPmCNptwxq13FuzPdOmCkV6MIpiAJ",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1457,
                    "name": "MA, Jingjing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mini1999",
            "date": "Aug 30, 2020",
            "title": "Good Prof, good grade",
            "comment_content": "Leadership traits<br />Leadership skills<br />Leadership behaviours<br />Leadership contingency<br />Transformational Leadership<br />Charismatic Leadership &amp; Ethical Leadership",
            "comment_teaching": "excellent teaching, eager to explain the concepts to student clearly",
            "comment_grading": "1. Learning Diary 10%<br />2. Self-assessment 10%<br />3. Exam 1 10%<br />4. Exam 2 15%<br />5. Group project 1 25%<br />6. Group project 2 20%<br />7. Participation 10%<br /><br />1. finish and probably you got full marks<br />2.some surveys or easy tasks, finish and get full marks again<br />3. mc questions, open book, test if you understand the concepts, but actually u can find the answers as it is open book, i got 24/25, if you get 24 or 25 marks she will give you all 10%<br />4. essay question, test if you know how to apply the concepts to the questions, i got 40/40 and got all 15%<br />5. a simulation about team cooperation, everyone has a role and you have to analyze what leadership skills you have been applied in the simulation, and then you have to write a report applying the leadership theories, we got 18/20 and mean is 17<br />6. choose a topic related to leadership she gave you, make a ppt and give a presentation in class, we got 18/20 and mean is 17.7<br />7. doesnt know how she counts participation, perhaps by discussion in class<br /><br />final grade: A<br /><br />overall, actually she gives good grades because the means for the group pj are high.<br />for the exams, work hard to understand the concepts then will be fine",
            "comment_workload": "little bit high workload because there are many concepts to understand and memorize, so that you can handle your exams<br /><br />for group pj, depends on what groupmates you have, if you are assigned with responsible groupmates, then you dont have to be worry, they will help you a lot.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OD3fw3sdrlpjAkiYcpajDSLrXl0TqWrf",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1457,
                    "name": "MA, Jingjing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "zyyzyyzyy",
            "date": "Jun 10, 2020",
            "title": "",
            "comment_content": "basically the leadership concepts<br />you need to know what are they<br />and adopt them in daily life",
            "comment_teaching": "good, very clear, easy to understand<br />especially the prof told you what was her expect to see",
            "comment_grading": "very good<br />don't expect can get A range<br />since one of my quiz somehow screwed up lol...<br />also, the presentation did not perform very well...<br /><br />but as you follow the requirements, seems like you can get good results",
            "comment_workload": "ok, 4 credit course<br />2 exam/quiz, 1 presentation for 1 project, 1 report for another project <br />there are some surveys, need to finish on time but count grade",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xHIAJxjbrfDoO2XU5AcgjtcE1ruZDIAq",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1457,
                    "name": "MA, Jingjing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yinnnnnnn:)",
            "date": "Jan 06, 2023",
            "title": "Easy course, Good Prof",
            "comment_content": "A bunch of leadership theories, require some application. Basically, it requires you to identify some relationship with the case study and ask you what you can do in this situation or what is not done.<br />List of Topics:<br />[Before Quiz 1]<br />Intro to Leadership<br />Trait Approach<br />Skills Approach<br />Problem-Solving, Emotional Intelligence, Political Skills<br />Special Topic: Gender and Diversity<br /><br />[After Quiz 1]<br />Behavioural Approach<br />Contingency Approach<br />Transformational and Transactional Leadership<br />Ethical Leadership<br />Special Topic: COVID-19 Application<br /><br />Not really very applicable and the dive in the content is not that deep. As long as you understand the content what it is talking about and you can explain in your own words then I think you will perform okay. No need good memory too cuz you can bring cheatsheet. Suggest you prep your cheatsheet well and include everything inside. Then you will be fine.",
            "comment_teaching": "Very passionate and willing to help. Very nice prof and you can ask her anything. Her pitch is very high, but you will still fall asleep :)",
            "comment_grading": "Very generous grading, and mainly depend on your performance in the 2 quizzes. Better answer her questions as she sometimes give out papers to write down you name for those who answer question, which I think will be used to count participation.<br /><br />Scores:<br />Quiz 1: 12/12 (Mean:/)<br />Quiz 2: 29/30 (Mean: 21.3)<br />Presentation (Deck): 14/15 (Mean: 14.2)<br />Final Essay: 18.5/21 (Mean:18.6)",
            "comment_workload": "Not very heavy to be true. For two quizzes, you can bring a 2-page A4 cheatsheet so just jam everything there. <br /><br />Total work:<br />Quizzes x2<br />Learning Diary x2<br />Assignment x4 (No one will check quality)<br />Final Presentation<br />Final Essay<br /><br />Suggest don't need to use too much effort in this course or else it will feel like a waste in time and energy. The final presentation and essay better use more case study cuz she likes that students are teaching with real examples.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ulnv6pQkcPp0u7HLjIl9DMXdaP0TqRrH",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1457,
                    "name": "MA, Jingjing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "stsmkn",
            "date": "Jan 26, 2022",
            "title": "",
            "comment_content": "Very easy to understand if you are well versed in business theory.<br />A lot of frameworks and theories, but all exams are open book so no need to memorize",
            "comment_teaching": "A bit repetitive and slow when she speaks, but explains concepts fully and her slides are very comprehensive. Easy to understand what is going on in class without attending lectures",
            "comment_grading": "Grading is not harsh, but mean is very high so difficult to get a higher score even if you understand course content",
            "comment_workload": "A few mandatory assignments, but they are take-home and do not take much time. The largest assignment was timed, so it is made so that you cannot spend too much time on it.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "NAW5YatR9P21mnVYDrORA05b5T5h086w",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1457,
                    "name": "MA, Jingjing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Eliz'",
            "date": "Jan 10, 2022",
            "title": "",
            "comment_content": "mostly practical uses of different leadership theories and concepts<br /><br />main leadership concepts/content include:<br />-trait approach<br />-skill approach<br />-behavior approach<br />-contingency approach<br />-transformational leadership vs transactional leadership<br />-ethical leadership<br />-Leader-member Exchange &amp; Within-person Perspective of Leadership<br />-Leadership in the Time of Covid-19",
            "comment_teaching": "her English is pretty fluent with some accent.<br />very friendly, always encourage students to express opinions and answer questions in class. （i consider myself as very introverted and shy but I found myself quite enjoy speaking up in her classes.）<br /><br />she tried to explain the concepts in a simple way and most of the time it was quite easy to understand",
            "comment_grading": "fair<br />-open book exam, the more you are familiar with the content, the higher grade you will get<br />-you can earn points for assignments by just simply completing and submitting them",
            "comment_workload": "fair<br />-1 midterm, 1 exam, both open book<br />-learning diary x 2 (just a reflection on what you have learned/your insights)<br />-self-assessment x 5 (most of them were just a survey)<br />-group presentation &amp; written report",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xmWKH1RVDsEJdUNfD6sJGrcRRtWSe81F",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1457,
                    "name": "MA, Jingjing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "M記",
            "date": "Jan 04, 2022",
            "title": "",
            "comment_content": "Mainly about the definition and different theories of leadership.",
            "comment_teaching": "Acceptable accent, she tried to explain the concepts with simple language. And also, she will teach how to answer the short and long answer for the final exam in the lecture.",
            "comment_grading": "Quite good. At least you put more for the course, you can see them represented in your grade",
            "comment_workload": "Fair workload. There are some self assessments and learning diary, you can earn submit by just submit it. The exam are quite simple, but the mean will be quite high too.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yIyUpL8EELMitoccrhSvNTc82wxKgoxJ",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1457,
                    "name": "MA, Jingjing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "vixxf6",
            "date": "Jan 21, 2021",
            "title": "Not good grade as expected",
            "comment_content": "1. Trait Approach<br />2. Skills Approach<br />3. Behavioural Approach<br />4. Contingency Approach<br />5. Transformational &amp; Transactional Approach<br />6. Ethical Leadership<br />7. Leader-member exchange<br /><br />Very easy content. Mainly introduce how can we measure, perform leadership and evaluate the performance. I can say the content is VERY EASY!",
            "comment_teaching": "The teaching is good, the professor taught everything in detail and it is very easy to follow.",
            "comment_grading": "I think it should be absolute grading but the grade range is very narrow. The professor told me that the mark range as below:<br /><br />86.5/100 -&gt; B<br />87.5/100 -&gt; B+<br />88.5/100 -&gt; A-<br /><br />I expected to get A range but eventually I got B+ because one of my groupmates overrun during the presentation and the professor had to deduct our marks. So make sure you did not have poor groupmates.",
            "comment_workload": "Not many workload<br />2 midterms<br />Group Report + Presentation<br />Some exercises after classes, so highly recommend to attend the class",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "GtnwUUpTOt32UBJAfl0UzkULmFmX0OgQ",
                    "name": "MGMT3120_Fall2020_Syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "LkOsispumaP8GC5m09p0UA4oGyTNhiKY",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 1006,
                    "name": "VAN NIEL, Penelope",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "msdaydream",
            "date": "Aug 03, 2019",
            "title": "",
            "comment_content": "Content quite boring. Mainly discussed leadership styles and different management theories.",
            "comment_teaching": "She tried to make it interesting by adding a lot of real life examples and inviting guest speakers to share their leadership experience.",
            "comment_grading": "Fair Grading<br />Didnt release results of the final exam<br />The mean of the midterm was around 20/24 and the SD was around 3<br />The simulation exercise, learning diaries are graded by submission",
            "comment_workload": "Since this is a summer course, I didnt make the effort to revise a lot. Most of the time was spent on making cheatsheets for both of the exams. The readings to be done before lectures dont really come up in the exam so I just read it over to write my learning diary. As for the group project and reading presentation, it depends on your groupmates.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5BkvSIGIms5QacprYQicTTqQ7xeYlxYz",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 597,
                    "name": "ZHU, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ltcc",
            "date": "Aug 20, 2018",
            "title": "",
            "comment_content": "content類似MGMT 2110<br /><br /><br />eg. path goal theory, theory X/Y, Big Five personallity, leader traits, leadership behaviors",
            "comment_teaching": "好悶",
            "comment_grading": "Attendance，self-assessment，reflection x3，mid term x2 ，project (written+presentation)<br /><br />Attendance:每堂人手簽名<br /><br />Self-assessment / reflection:有交有分<br /><br />Midterm: MC+簡單直接幾題short Q，2nd midterm 要睇reading material，唔睇short Q會唔識做<br /><br />每組用同一個simulation做project，佔重分，presentation prof 要求要creative",
            "comment_workload": "極少workload",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BV8rkBFwnvIjBFgVCBXUomlxhux8tqIH",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 597,
                    "name": "ZHU, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TC",
            "date": "Jun 09, 2018",
            "title": "",
            "comment_content": "Closely related to MGMT 2110 and actually it is an extension of it. <br />1st half is about the leadership in individual level (e.g. OCEAN personality), while the 2nd half is about the leadership application in group level (e.g. Path-Goal Theory, Transformational Leadership etc.)",
            "comment_teaching": "Prof. Zhu is a nice professor and she is willing to engage every student in the class. She explained the concept clearly and the PPT are reader-friendly as well",
            "comment_grading": "Assessments that are credited by hand in on time: <br />(Professor would not mark them) <br />1. Learning Diary x 3 = 15% for the course grade<br />2. Self-Assessment x8/9&nbsp;&nbsp;= 10% for the course grade<br />Assessments that would be graded:<br />1. Exam 1 = 15%: 40 mark is the full mark of the exam (combination of MCs and SQ) which was conducted on Mid-March<br />2. Exam 2 = 20%: 60 mark is the full mark of the exam (combination of MCs and SQ) was conducted on Late-April <br />3. Group Project = 25% <br />a) Presentation = 10% + b) Final Report = 15%<br />4. Participation = 15%<br />a) Attendance for regular lesson; b) Attendance for students' presentations (3%); c) Q&amp;A card during students' presentations <br /><br />After talking about the assessments required in this course, let me talk about the statistic for this course:<br />Exam 1: <br />Mean = 32.28/40;S.D.= 3.83; Min. =15/40;Max.= 40/40<br />(My score is 36/40)<br />Exam 2:<br />Mean = 49.31/60;S.D. = 7.36; Max. = 59/60<br />(My score is 55/60)<br />Group presentation: <br />Mean = 40.03/45; S.D. = 3.21; Max. = 45/45<br />(My score is 43/45)<br />Final Report: <br />Mean = 45/60; S.D. = 7.56; Max. = 60/60 <br />(My score is 49/60)<br />Participation:<br />The professor did not disclose the result yet from my observation most students have not raised questions in Q&amp;A sessions during students' presentation (which is one common practice for HK students lol)<br />And I have grabbed 5 Q&amp;A cards by actively asking questions in class <br />(I guess I got the most Q&amp;A cards among all three sessions; given that I have not missed a single lesson, I think my participation should be full marked) <br />As a result, I got A+ in this course which I think is quite decent",
            "comment_workload": "The workload is light as a 4-credit course <br />Personally, I think the workload is just like a 2-credit course as many assessments just require you to hand in them on time and they would be graded. <br />Just 4 types of assessment would not be graded (as I mentioned in 'Grading' part)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "k9EskkVnGDUosWtdyORNXKgpYvi2MNdT",
                    "name": "MGMT3120-Syllabusv2018_Final",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "HHxETD0cZPd1n2pnpzylQkCnpQU99QlF",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 597,
                    "name": "ZHU, Jing",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wmh",
            "date": "Jun 17, 2016",
            "title": "Typical MGMT course",
            "comment_content": "-Similar topics in MGMT2110 (Big5 personality, different types of leadership)",
            "comment_teaching": "Average teaching by professor Zhu but this did not affect your learning as 95% of the exam contents are in the assigned reading and the lecture notes",
            "comment_grading": "1.&nbsp;&nbsp;Learning Diary x3 15% (You will get full marks if you hand it in on time)<br />2.&nbsp;&nbsp;Self Assessment x9 10%&nbsp;&nbsp;(You will get full marks if you hand it in on time)<br />3.&nbsp;&nbsp;Exam 1 15% (27 MCs and 4 short questions) (Tips: you need to remember the correlation between different personal features and leadership performance as she will ask you about that!!)<br />4.&nbsp;&nbsp;Exam 2 20% (44 MCs and 5 short questions) (Tips: Most of the short questions are about the content of assigned reading)<br />5.&nbsp;&nbsp;Group project 25% (15%: report &amp; 10%: presentations)<br />6.&nbsp;&nbsp;Participation 15% (3% are from the attendance during presentations) (You can get 1 Q&amp;A card if you asked 1 question after the presentations in order to boost your scores)<br /><br />Comment on the grade:<br />Very good grade as I am above 0.7 sd in every exam and 39/40 in presentation and i get an A!",
            "comment_workload": "Light workload",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3vnZgT9DPQyd9TbbH9i89jrF8C4kjFXd",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 588,
                    "name": "YEUNG, Wai Mun Lucia",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ter",
            "date": "Feb 09, 2016",
            "title": "",
            "comment_content": "Topics are really good. Identify several types of leader and the framework to be a good leader.",
            "comment_teaching": "Lively teaching and Lucia will remember everyone's name which is very interactive. On-point teaching with clear and precise powerpoint!",
            "comment_grading": "Grading is pretty fair. hard-working will lead to high grade!",
            "comment_workload": "Only 2 in-class exam (a few short questions!!) and 1 case study with presentation. Workload is very light! However, attendance is required with occasional quiz, which are used to facilitate the class content and help for personal development, quite interesting!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}