{
    "error": false,
    "course": {
        "id": 3343,
        "subject": "OCES",
        "code": "2001",
        "name": "Survey of Ocean Science",
        "description": "The ocean defines the features of our planet. The ultimate goal of the course is to promote and enhance ocean literacy, which means the awareness and understanding of fundamental concepts of the history, functioning, and utilization of the ocean. By the end of this course students will understand the ocean's influence on individuals and their influence on the ocean. The course will cover a wide range of topics including ocean physics, marine chemistry, marine geology, and biological oceanography.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"OCES\" data-code=\"1001\" href=\"/review/OCES1001\" target=\"_blank\">OCES 1001</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4,
        "rating_teaching": 4,
        "rating_grading": 3.5,
        "rating_workload": 4.5,
        "review_count": 2,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 231,
                "name": "LIU, Hongbin",
                "count": 2
            },
            {
                "id": 1259,
                "name": "WANG, Yan",
                "count": 2
            },
            {
                "id": 1294,
                "name": "WYATT, Alex",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "WZmalFBOCjTF5QPbBXJshPj9E78ejhrg",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 231,
                    "name": "LIU, Hongbin",
                    "rating": 0
                },
                {
                    "id": 1259,
                    "name": "WANG, Yan",
                    "rating": 1
                },
                {
                    "id": 1294,
                    "name": "WYATT, Alex",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SST",
            "date": "Jan 10, 2021",
            "title": "",
            "comment_content": "[ZOOM teaching]<br />Covered ocean physics, marine chemistry and geochemistry, geology and geophysics, biological oceanography, ocean resource, and environmental concern.<br />Lecture<br />1. Ocean as a Key Component of Earth System<br />2. Ocean exploration<br />3. Origins<br />4. Earth structure<br />5. seafloor<br />6. sediment<br />7-8. Wind-Driven Circulations<br />9-11. Stratified Ocean Circulation<br />11-12. Ocean Turbulence and Climate<br />12. Air-Sea Interaction: El Ni˜no and La Ni˜na<br />13. Chemical Properties of Seawater<br />14. Nutrient cycles and energy flow<br />15. Introduction to marine ecology<br />16. Phytoplankton and primary production<br />17. Zooplankton food web<br />18. Biological pump and Iron limitation<br />19. Fisheries<br />(20. Don't know why this is missing)<br />21. Coastal processes and ecosystem<br />22. Marine resources and development<br />23. Ocean health and human impacts<br />24. Climate change and the ocean<br /><br />Officially no attendance required.<br />Prof. WYATT would have polls on zoom during lessons.<br />Some topics are only common sense.<br />Quite interesting if you like oceans.",
            "comment_teaching": "Prof. LIU is quite boring, luckily the lesson wasn't start at 9. But I usually not listening to him and his lectures (mainly about geology and biology) can be understood by reading lecture notes.<br /><br />Prof. WANG is one of the best professor I have met in HKUST. His lectures mainly about physics (L7-12). He is patient to explain the concepts and answer students' questions. Students are more active in his lessons rather than that of other professors.<br /><br />Prof. WYATT. Not much to say about his teaching, he is responsible for the chemistry and resources part. He would raise polls during lessons. His lecture notes uploaded on canvas are not full version (some words/ pictures are covered), you may ask for full version by emailing him but he is quite strict in the attendance stuff.",
            "comment_grading": "Homework assignments 30% <br />Final exam 70%<br /><br />3 Homework assignments(one long questions that contains 3-4 parts) assigned by each professor. Not a difficult one but it only covers 30% of the final grade, there are always students getting full marks.<br />Final is a take home exam which have 48 hours for you to finish it. There are 7 long questions.<br /><br />Assignment 1: mean: 4.4/5&nbsp;&nbsp;high:5/5<br />Assignment 2: mean: 4.1/5&nbsp;&nbsp;high:5/5<br />Assignment 3: mean: 3.7/5&nbsp;&nbsp;high:5/5<br />Final take home exam: mean: 49.6/70&nbsp;&nbsp;high: 66/70<br /><br />The grading is not good not bad (?)<br />My assignments: 4.5/5 ; 5/5 ; 4.5/5<br />Final take home exam: 52/70<br />Final Grade: B+",
            "comment_workload": "3 Assignment and 1 Final take home exam(48hours).<br />Light workload for the assignments but the take home exam held during final period and is a disaster for me especially I got another 2 finals within that 48 hours. The final exam requires citation as well.<br /><br />Overall: Not a heavy workload course if you have a good final schedule.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "y05J0lzxnlcYeO0n7VZ6dhaJk2002F2G",
                    "name": "OCES2001 course introduction 2020",
                    "format": "docx"
                }
            ]
        },
        {
            "hash": "bg5gpLRLW4a4St8M5VHptHeTk4jNUOEo",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 231,
                    "name": "LIU, Hongbin",
                    "rating": 1
                },
                {
                    "id": 1294,
                    "name": "WYATT, Alex",
                    "rating": 0
                },
                {
                    "id": 1259,
                    "name": "WANG, Yan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Ssskkkhkukst",
            "date": "Apr 13, 2023",
            "title": "OCES 2001",
            "comment_content": "1 topic per lecture: <br />Ocean Exploration<br />Earth history, Origin of Life<br />Earth structure and Plate tectonic<br />Ocean basin and sea floor<br />Ocean sediments<br />Wind, pressure, and Earth’s rotation<br />Ocean gyres and boundary currents<br />Buoyancy fluxes and seawater properties<br />Global overturning circulation<br />Gravity waves and ocean mixing<br />Mesoscale eddies and climate prediction<br />Ocean chemistry I: Chemical properties of seawater<br />Ocean chemistry II: Nutrient cycles and energy flow<br />Phytoplankton and primary production<br />Phytoplankton and primary production<br />Zooplankton and Microbial food web<br />Biological pump and iron limitation hypothesis<br />Fisheries oceanography<br />Benthic ecology<br />Deep-sea ecology<br />Marine resources and development<br />Ocean health and human impacts<br />Climate change and the ocean",
            "comment_teaching": "Hongbin LIU teaching is very chill, pacing is good, and his english is simple, so no stress and no hard work to pay attention <br />WANG and WYATT covered few lectures only",
            "comment_grading": "40% midterm exam<br />55% final exam<br />5% attendance<br /><br />the exam is easy, but some questions are not in the ppt<br />WYATT will reuse his iPRS questions in the exam",
            "comment_workload": "Hongbin LIU didnt taken any attendance, but will have one short pop-up quiz<br />Yan WANG will not take attendance<br />Alex WYATT will use iPRS to record class participation<br /><br />No hw",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}