{
    "error": false,
    "course": {
        "id": 1311,
        "subject": "PHYS",
        "code": "2022",
        "name": "Modern Physics",
        "description": "Introduction to relativity; introduction to quantum theory: particle-wave duality and Schrodinger equation; atoms, molecules; and statistical physics: Maxwell, Bose and Fermi distributions.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1114\" href=\"/review/PHYS1114\" target=\"_blank\">PHYS 1114</a> OR <a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1314\" href=\"/review/PHYS1314\" target=\"_blank\">PHYS 1314</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.83,
        "rating_teaching": 4,
        "rating_grading": 4.29,
        "rating_workload": 4.25,
        "review_count": 48,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 781,
                "name": "WANG, Yi",
                "count": 45
            },
            {
                "id": 613,
                "name": "DU, Shengwang",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "569plR07DFOOiFif1N0xVL5rtyQqDfe6",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Small_Potato",
            "date": "Dec 23, 2018",
            "title": "Interesting introductory course to modern physics with some very smart IRE people",
            "comment_content": "A required course for minoring physics/astrophysics.<br /><br />Syllabus:<br />1. Special relativity (E)<br />2. General relativity (A)<br />3. From action to laws of nature (A)<br />4. Quantum mechanics (E)<br />5. Quantum information (A)<br />6. Atoms and molecules (E)<br />7. Statistical physics (A)<br />8. Complexity (A, No time to teach)<br />9. Nuclear and particle physics (A, No time to teach)<br />10. Cosmology (A)<br />E: Essential Part, A: Advanced Part<br /><br />The essential parts determine whether you get A range or not, while the advanced parts determine whether you get A-, A or A+.<br /><br />The course covers a very wide range of topics, but professor does not go in too deep for each of them. Having some knowledge on linear algebra and differential equations will help you a bit on understanding some of the math-heavy concepts such as spin states. Calculus is very important for this course too.<br /><br />In general, the contents can get quite hard to understand when it comes to things like &quot;potential barriers and wells&quot;, &quot;principle of least action&quot; and &quot;Bell's inequality&quot;, at least for me. Therefore, it is advised that you re-watch the lecture videos and try to understand as much as possible. One good thing is that once you understood the concepts, you do not need to spend much time to prepare for the midterms and finals.<br /><br />There are some practice exercises at the end of each lecture notes. However, no answers will be posted and they will only be discussed in tutorial sessions. Some of them may appear in the finals and midterm too.<br /><br />Also, you do not need any knowledge from PHYS1114 to survive in this course.",
            "comment_teaching": "Teaching was really good. Prof. WANG is a very enthusiastic professor and his explanation of concepts is clear to me. For me, I find it a bit difficult to catch up to what he says in lesson because he talks rather slow at easier parts and a bit fast at harder parts. So, what I did was watch the lecture videos and adjust the speed at certain parts. Prof. WANG occasionally makes jokes (which are actually funny) to lighten up the mood. Also, he wore the Einstein T-shirt and Schrodinger's T-shirt to class as a way to cheer us up. Professor also has a spare hour after class and he ends the lesson early, so students can find him for questions.<br /><br />I think that the lecture notes are pretty detailed, with some good illustrations to make things easier to understand. There are clear subheadings and extra explanation on the sides. Sometimes there may be typos so be mindful of that.<br /><br />As for the tutorials, I attended the first few but I find it a bit difficult to understand what the TA said so in the end I just gave up and skip all the tutorials. No attendance will be taken.<br /><br />There is also a Facebook group which you can join and ask some questions there too.",
            "comment_grading": "Homework (20%):<br />4 in total, full mark is 5 for each assignment<br />Most people get 4 to 5 marks every time. You submit the homework through canvas.<br /><br />Midterm (35%):<br />(Essential) Mean:&nbsp;&nbsp;45.8 / 70 ; St.Dev.: 9.6<br />(Advanced) Mean: 13.6 / 30 ; St.Dev.: 9.8<br />(Total) Mean: 59.4 / 100 ; St.Dev.: 16.9<br />Me: 62/70 + 29/30<br /><br />Finals (45%):<br />(Essential) Mean:&nbsp;&nbsp;45.4 / 70 ; St.Dev.: 14.4<br />(Advanced) Mean: 15.3 / 30 ; St.Dev.: 9.1<br />(Total) Mean: 60.7 / 100 ; St.Dev.: 21.5<br />Me: 65/70 + 21/30<br /><br />Final grade:<br />Got an A. <br />I see quite a number of people got 90+ or even 100 in the midterms and finals, so when you take this course, be aware that the IRE-level people may take up all the A+s.",
            "comment_workload": "There are only 4 pieces of homework for the whole course. The 1st (Special Relativity) and 4th (Atoms) one are relatively easy, but the 2nd (Lagrangian) and 3rd (Potential Barrier) one can really hurt your brain and they are math-heavy. Homework is also divided into Essential and Advanced, so if you are not aiming for A or A+, you can ignore those Advanced homework. Usually, what I do is I search online for similar questions so I can get an idea of what is the correct approach to the questions. For the 2nd homework, it may take you an hour or so just to write a few lines, so prepared to be frustrated. Of course, if you are one of those IRE geniuses, then you can ignore what I have just said.<br /><br />For the lectures, it is alright if you skip them. However, be prepared to watch the lecture videos multiple times as some concepts and math can really mess up your brain. I highlighted the important points and added my own notes to the lecture notes. Took me quite some time.<br /><br />For midterm and finals, you can bring 1 double-sided A4 cheatsheet to each of them. Instead of just cramming the derivations and formulas in the cheatsheet, try to also understand the concepts behind, as conceptual questions also take up a large portion of the exams. MC takes up 30/70 of Essential Part and 10/30 of Advanced part.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PmBqMAXeStvRX3Ktya61FbU5qn4yzRc5",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sean Lau",
            "date": "Jan 17, 2018",
            "title": "",
            "comment_content": "Essential:<br />Special relativity<br />Quantum mechanics<br />Atoms and molecules<br /><br />Additional (optional): <br />General relativity<br />Action/Lagrangian Mechanics<br />Quantum information/entanglement<br />Statistical physics/entropy<br />Condensed matter<br />Complexity<br />Nuclear and particle physics<br />Cosmology<br /><br />Essential content will be used to determine your general grade, with the exception of the A range sub-grades. If your score from the essential part is high enough to reach A range, then your A sub-grade (e.g. A-, A, A+) will be determined from the additional content.<br /><br />The main essential topics are special relativity and quantum mechanics. Special relativity was quite easy, but I found the later parts of quantum mechanics to be quite difficult. The derivations used in atoms and molecules is also very hard to follow.<br /><br />The additional topics may in fact be easier than than most of the essential topics (with the exception of special relativity, which is the easiest). However, not all additional topics will be taught. During 2017-18 fall, only general relativity, action, quantum information/entanglement, and statistical physics/entropy were taught as the additional topics, as there wasn't enough time to cover the others.<br /><br />As there are so many different topics, there is a LOT of content covered in this course (although not too deep). Because of this, it may be difficult to keep up with the lectures' contents unless you revise after every single topic.",
            "comment_teaching": "Prof. Wang is very enthusiastic in his teaching and encourages students to ask questions. He often stays behind after lectures for students to ask him questions. His lectures are quite interesting as he often includes short anecdotes and jokes.<br /><br />However, sometimes it is difficult to keep up with the mathematical derivations that he writes on the whiteboard.",
            "comment_grading": "Grading is very good. I achieved mediocre scores for the essential parts but still managed to get an A.",
            "comment_workload": "The work required for this course is minimal, as there are only 3 assignments over the semester (including 2 essential, 1 additional).<br /><br />However, I personally had to spend a lot of time revising for this course simply due to the huge amount of content that it covers.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ChDtVqKn4YbhIBYn2rzAhl4RCZ8svMCM",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "William Yam",
            "date": "Jan 10, 2018",
            "title": "Very meaningful course to get idea about modern development of physics",
            "comment_content": "Syllabus:<br />1. Special relativity (6, E)<br />2. General relativity (1, A)<br />3. From action to laws of nature (2, A)<br />4. Quantum mechanics (5, E)<br />5. Quantum information (2, A)<br />6. Atoms and molecules (2, E)<br />7. Statistical physics (2, A)<br />8. Condensed matter (2, A, IF)<br />9. Complexity (1, A, IF)<br />10. Nuclear and particle physics (2, A, IF)<br />11. Cosmology (1, A)<br /><br />Numbers in mean the expected number of lectures for each topic. Letter E means &quot;Essential&quot; part and letter A means &quot;Advanced&quot; part (these decide grading). Remark IF means only taught if time permits.<br /><br />&quot;Essential&quot; material is pretty much all covered in Prof. Wang's lecture notes. &quot;Advanced&quot; material would require you own further reading for better understanding. In our semester, the &quot;IF&quot; topics were not taught.",
            "comment_teaching": "Prof. Wang is very enthusiastic and engaging in teaching. He tries to explain the physics in an accessible way, due to the low prequisite requirements on the course. However, some relevant knowledge in mathematics (linear algebra and differential equations) would be helpful for understanding derivations.",
            "comment_grading": "Assignments 20%<br />Midterm 35%<br />Final 45%<br /><br />&quot;Essential&quot; part decides grading for A-range and B-F. &quot;Advanced&quot; part helps in grading within the A-range. I remember the professor saying that &quot;Advanced&quot; material counts for 30% of the A-range grading, so it is still possible to score high in the A-range with &quot;Essential&quot; part alone albeit unlikely. Also, if your &quot;Essential&quot; score is too low, then the &quot;Advanced&quot; score does not matter for grade.<br /><br />Midterm and final have some multiple choice questions, which are quite straightforward. Then some short answer problems that either require written explanation or mathematical derivation. For assignments, turning in a satisfactory solution will result in full score; the marking is undemanding.",
            "comment_workload": "There is not much workload, only some assignments. The three assignments for our semester were on the topics of Special Relativity, Action Principle, and Quantum Mechanics.<br /><br />Most of &quot;Essential&quot; information is covered in Prof. Wang's lecture notes. However, the &quot;Advanced&quot; questions in midterm and final seem to expect students to have further knowledge than just the notes.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xL5aCX2KbVicOXOfnlZrxb7kLeDag9XD",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cooje",
            "date": "May 24, 2017",
            "title": "",
            "comment_content": "Here is the Syllabus:<br />1. Special relativity (6, essential)<br />2. General relativity (1, advanced)<br />3. From action to laws of nature (2, advanced)<br />4. Quantum mechanics (5, essential)<br />part 0. introduction 8<br />5. Atoms and molecules (2, essential)<br />6. Statistical physics (3, essential)<br />7. Condensed matter (2, advanced)<br />8. Complexity (1, advanced)<br />9. Nuclear and particle physics (2, advanced)<br />10. Cosmology (1, advanced)<br /><br />The number indicates the number of lectures planned to cover the topic. <br />As you can see, too many topics are planned to be covered, so the professor just finish the topic 1-6,",
            "comment_teaching": "The professor is very enthusiastic, always teaching with an amazing smile. Although there are too many points to be addressed, he tried his best to explain everything clearly. No textbook. Only the professor's own notes were used.",
            "comment_grading": "Great grade.",
            "comment_workload": "Very few assignments were given.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "ugZv6Gk8SX8IZJuJzTvIbw7Jk7VXcqX1",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "grqm",
            "date": "Dec 29, 2016",
            "title": "",
            "comment_content": "- Special relativity<br />- General relativity<br />- Quantum mechanics<br />- Atoms and molecules<br />- Thermal and statistical physics<br /><br />His notes are very confusing. There's no problem solving at all. Mostly tedious derivations. <br /><br />The goal of this course is extremely unclear. <br /><br />The midterm had an extremely difficult SR problem. And he tested us on how to derive the Einstein field equations from the principle of least action. <br /><br />In the final, he asked us to do quantum field theory (only the rudiments though, so it is more like an exercise on manipulating symbols. So I don't see the point of that problem.)",
            "comment_teaching": "He is a nice person and I do admire his passion.<br /><br />However I learned literally nothing from this course.",
            "comment_grading": "10% Presentation, which I didn't do<br />20% Three assignments, each having one to two problems. <br />30% Midterm (a few mcq + 3 problems), mean ~30/100<br />40% Final (a few mcq + 4 problems), mean ~65/100<br /><br />I went below mean in the midterm but got 1 sd above mean in the final. Got a B+.",
            "comment_workload": "This is not a conventional physics course like PHYS 1112 and 1114. <br /><br />Just read his notes as thoroughly as possible.",
            "rating_content": 1,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gQG6yVqQIscuPEk1zYoML7zEAkrOZrq6",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "fm",
            "date": "Dec 31, 2015",
            "title": "",
            "comment_content": "Unlike prof. Du spending most lecture time on relativity and quantum mechanics. Prof. Wang cover much more topic which really makes this course &quot;introduction to modern physics&quot;. Topic include (number of lecture time):<br />♦ - Introduction (1)<br />♠ - Action Principle (1)<br />♠ - Special Relativity (5)<br />♦ - General Relativity (1)<br />♠ - Quantum Mechanics (5)<br />♦ - Atom &amp; Molecule Physics (1)<br />♠ - Condensed Matter (2)<br />♠ - Statistical Physics (2)<br />♦ - Complexity (1)<br />♦ - Nuclear &amp; Particle Physics (1)<br />♦ - Cosmology (1)<br /><br />and emphasise the topic with&nbsp;&nbsp;♠ which count about 90% of the final grade and the remaining 10% is the topic of ♦",
            "comment_teaching": "Prof. Wang combine different topics from different books for writing his own lecture notes and sometimes with some jokes on it, e.g. after the lecture of action principle, he said many students complaint to him the topic is too difficult and he draw a deer without eyes to represent them (meaning no idea), after that he further explain more on the topic and said those students are now becoming a deer without eyes and legs (meaning still no idea). And he also explain the topic quite clearly with example.<br /><br />He is also willing to answer students' question in different method (a editable note on canvas,&nbsp;&nbsp;also his facebook account)<br /><br />However, he expected us to have a better mathematics background while most students start taking the multi-calculus and linger algebra&nbsp;&nbsp;at the same semester which sometimes students may get confuse on the maths used in the lecture.",
            "comment_grading": "The score is calculated by <br />(9 quiz) × 10% +<br />(3 assignments) × 20%<br />(1 mid-term exam) × 30%<br />(1 final exam) × 40%<br /><br />My final score is 87% and got an A while the cut off of A+ should be 95% which show the A range is quite wide but limited of A+. As prof. Wang teaches pg course before teaching this course, it is expected the mean may be B+ and the course is generally good grade.",
            "comment_workload": "The quiz are open-book but the quiz test your application on the topic while the lecture note usually only contain the theo. without application example. Each quiz worth 5marks with 2 marks be the participation marks.<br /><br /><br />Mid-term and final is similar in format and is a close-book examination with an exception of a double side A4 paper. Half of the marks are short question( True/ False, mc, one word ans) and the other half is long question which is more difficult. However, in order to get a higher grade, students should pay special attention on the short question since the marking on them is quite strict compare to the marking of long question.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kFRIwprhwfkIpa4YaA9r7XFtNF10KNKX",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Andy_Lin",
            "date": "Dec 09, 2022",
            "title": "Very Introductory Course to the Advanced Courses",
            "comment_content": "Special Relativity * 3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(E)<br />General Relativity&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(A)<br />Cosmology&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(A)<br />---------- Midterm ----------<br />Quantum Mechanics * 2 (E)<br />Atoms&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(E)<br />Quantum Information&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(A)<br />Action Principle&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(A)<br />Entropy and Information (A)<br />-------------------------------------<br />It would be better if you know something about linear algebra and simple differential equations, which would let you scan through the materials faster and get a bigger picture easier.",
            "comment_teaching": "Quite a blended learning class where you watch some videos each week on coursera (~8 min each and a total of ~1.5h per week). You only need to attend one face-to-face class each week which is more like Q&amp;A session.",
            "comment_grading": "Calculation:<br />(5% group presentation) + (10% weekly homework) + (35% midterm) + (50% final)<br />------------------------------------------<br />Very easy to get full in Group Presentation &amp; Weekly Homework. Homework is just 5~10 multiple choice questions in coursera.<br />------------------------------------------<br />Rather interesting grading scheme:<br />Exams are splitted into essential part (70%) &amp; advanced part (30%) specified in the content. Letter grades are assigned based on essential part while subgrades are based on advanced part.<br />------------------------------------------<br />Midterm distribution:<br />Mean: 59.50; SD: 15.65; Median: 58<br />Range: 0~40 40~60 60~70 70~80 80~90 90~100<br />Num:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;12&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;40&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;21&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;19&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2",
            "comment_workload": "Kind of light during the whole semester, but some exam questions are rather cumbersome and requires much understanding and derivation (beyond the weekly homework). Lecture notes are good materials to begin your self-study, especially those topics that could be extended into a single course.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1W7P4Rx4tx3ZsrIn7LBeDQ4iRhCuqfmp",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "EKKO",
            "date": "Nov 27, 2022",
            "title": "",
            "comment_content": "Relativity and Cosmology<br /> Quantum Mechanics<br /> Entropy",
            "comment_teaching": "relativity is taught clearly but after midterm, the QM part... it may be my ability problem, most of the content is difficult to understand.<br />This course tried to put a lot of things together but actually those content are just introduction to corresponding parts and you should take those courses in the future. (It is a bit difficult for students to learn so many things in one semester)",
            "comment_grading": "Not finished final yet..<br />70%E+30%A<br />I heard the grades are good<br />but also TA said this course is frustrating.",
            "comment_workload": "Not too much homework<br />But completely understanding each lecture's content can take much time.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sNuY1oSktspre7KhzLS9oWWtNyAnYD41",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TheodoreYuen",
            "date": "Feb 09, 2022",
            "title": "",
            "comment_content": "Part 1: Relativity and Cosmology<br />Part 2: Quantum Mechanics and Atoms<br />Part 3: Entropy<br /><br />Each topic are separated into the essential part (E) and the advanced part (A), see grading for more info<br /><br />The course tried to cramp too much into it, and can only give a very brief view of each topic. Good intention to let us experience different topics, but terrible execution",
            "comment_teaching": "Most teaching is done through videos made by the professor on Coursera, the professor tried to make it interactive/ entertaining/ aspiring, and while I could feel his enthusiasm for the topics, I found it pretty difficult to understand what was going on. There is also one class per week but I found it too unorganised to be useful.<br /><br />An update one semester later:<br />I have completed PHYS3037, and I can confidently say, this class isn't very good at making things clear. I don't understand most things about (and definitely don't enjoy) QM in PHYS2022, but the topic itself is actually quite manageable (and fun!). Of course, it might also be caused by the fact that it tried to fit too much into one course.",
            "comment_grading": "Group presentation: 5%<br />Homework: 10%<br />Midterm: 35%<br />Final exam: 50%<br /><br />Getting into the A range is solely determined by the essential part, while the classification within the A range depends on the weighted score (70%E+30%A). Depending on what strategy and what grade are you aiming for, this can be advantageous or disadvantageous. This grading scheme was decided through voting so you may have a different grading scheme to deal with.",
            "comment_workload": "The group presentation is pretty much free, you just need to present something that is related to modern physics, not covered within this course, and factually correct, you will get the full 5%.<br /><br />The homework is also free, you have infinite attempts on them so just do them on time and you will be good.<br /><br />For the rest, workload depends on your target, because of the grading scheme, if you are aiming for B+/A-, you can completely skip the advanced part, otherwise, you may have a bit more to work on. But either way, it's just 2 exams and nothing else.",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nFYI0ZucVu284ZghTeMlsnyWVlxd2I7T",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tdhvl",
            "date": "Jan 14, 2020",
            "title": "",
            "comment_content": "The purpose of this course is to give an initial taste about how modern physics is like so it covers many different topic but only introduce simple ideas and basic concepts. <br /><br />There are three essential topics: Special relativity, Quantum mechanics and Atoms and molecules. These topics are the most fundamental and the easiest parts of this course. They constitute the majority of the examinations and assignments. The remaining topics are labeled as advanced as they are harder to understand. The professor only try to give some simple examples but not entirely the full picture of these topics. The advanced topics are: General relativity, Action, Quantum entanglement, Entropy and Information, Cosmology.<br /><br />At the end of each topic, the professor often introduces useful resources to learn deeper the corresponding topics. You can enhance yourself by reading those materials to prepare for advanced courses and for research activities, but this is not necessary to get a good grade in this course.<br /><br />This course requires a good imagination to understand some new concepts, which could be a little bit confusing at the beginning.<br />The mathematical tools involved are just elementary algebra, calculus and a little bit of complex numbers. All steps involving mathematical tools other than elementary algebra and calculus during the proofs are listed as optional and will not be asked in examinations. Therefore, I think that first-year students can enroll in this course with no problems.",
            "comment_teaching": "Professor Wang is a good instructor. He explains carefully steps by steps and can introduce the content in humorous ways, making the lessons more relaxing. After each lecture, the professor often spend about 10 minutes answering questions.<br /><br />The tutorial classes are conducted by TAs. The TAs will usually solve some exercises in the lecture notes and show some videos about the topics learned in the lecture classes.",
            "comment_grading": "The grading of this course is very generous. During the course, the professor made a survey to decide the grading method. This year, the majority voted to use the scores in essential parts to determine the A-range and 70% essential + 30% advanced to determine the sub-grade (A+, A, A-). If the essential score is not high enough to attain A-range, then the advanced score would be meaningless. As the essential part is easy, many people got A-range. I don't know the cutoff for A+ grades. However, I guess that around 8 people get an A+ grade.<br /><br />The grading is based on 6 assignments (5 points each) and the midterm exam. The score is calculated by 50% assignments + 50% midterm exam.<br /><br />The midterm statistics is provided in the attached image.",
            "comment_workload": "The workload is very light. The assignments are easy and are released every 3 weeks.<br /><br />The professor does not take attendance and what he said in the class is identical to things written in the lecture notes. Therefore, you can save time by reading lecture notes and not coming to class if you are confident.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "GKmnqeKM0TNlpc7tOG9WFbGVXyScDTcY",
                    "name": "Midterm Exam Score Distribution",
                    "format": "jpg"
                }
            ]
        },
        {
            "hash": "QC4mVOtEy9JuQo2rzG2HwhKo353rJLY2",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Roy Sukjin Mun",
            "date": "Dec 31, 2017",
            "title": "An unorthodox modern physics class",
            "comment_content": "Course Syllabus:<br />1. Special Relativity (Essential)<br />2. General Relativity (Advanced)<br />3. Action Principle (Advanced)<br />4. Quantum Mechanics (Essential)<br />5. Quantum Entanglement (Advanced)<br />6. Atoms (Essential)<br />7. Entropy and Information (Advanced)<br />8. A 30 minutes introduction to cosmology at the very end of this course, but not tested in the exams<br /><br />Lecture notes are very irritating to read. Those who believe the lecture notes are well made, then they either have not understood the physics or are simply bluffing. In fact, the bad quality of the lecture notes should be more apparent to those who have already learnt the materials. The concepts are introduced in subtle ways, wordings are usually unclear and derivations are often hand-wavy. I understand that theorists in general are not aware of the boundary between &quot;introductory level&quot; and &quot;advanced level&quot;, but I cannot agree that the lecture notes are good especially for an introductory class. Students must attend the lectures (or watch the uploaded videos on Canvas) in order to fully understand what the professor was trying to say in the lecture notes. Professor Wang updates his lecture notes every year, so hopefully he will improve his writing for the updated versions. <br /><br />In addition, most recommended readings at the back of the lecture notes are baffling. For instance, Principles of Quantum Mechanics by Shankar, Modern Quantum Mechanics by Sakurai, Classical Mechanics by Goldstein are definitely not for students who have just started learning sophomore-level physics in an introductory modern physics class. I therefore personally recommend more suitable readings that may be helpful for the beginners to understand the lecture notes (at least minimally, even the list below may not be sufficient sometimes. As I said, the lecture notes are absurd. Some do overlap with what lecture note recommends). These references, including the solution manuals, are readily available online:<br /><br />&lt;Special Relativity&gt; + &lt;General Relativity&gt;<br />Introduction to Electrodynamics by Griffiths - Chapter 12.1-12.2<br />A General Relativity Workbook by Brown - just a few beginning chapters correspondent to the contents of the lecture note<br />Astrophysics Processes by Hale Bradt - chapter 7, beginning sections before relativity in electrodynamics. It has the most elegant proofs I have seen on a textbook so far. <br /><br />&lt;Action Principle&gt;<br />Mechanics by Landau, Chapter 1<br />The Feynman Lectures On Physics, Vol 1, Chapter 26<br /><br />&lt;Quantum Mechanics&gt;<br />Introduction to Quantum Mechanics by Griffiths, Chapter 1-4<br />Quantum Physics of Atoms, Molecules, Solids, Nuclei, and Particles by Elsberg, (if you find even the mathematics in Griffiths is hard, just read through this until you grasp the concept and then go back to Griffiths)<br /><br />&lt;Entropy and Information&gt;<br />Concepts in Thermal Physics by Blundell, Chapter 4, Example 4.1 (The example explains the concept of microstates clearly. The definition of microstates is overlooked in the lecture note. Other than this, reading through the lecture note is enough)<br /><br />Please note to always go back to wrap up the lecture notes as well when you rely on external references, as some problems in the exams were directly from the exercise questions at the back of lecture notes &amp; understanding of the contents on the lecture notes.<br /><br />For reference, the exercise questions are included as attachments below. These questions were easier than (or maybe somewhat similar to) the actual exams in this semester. However, some exercise questions are poorly designed, irrelevant to the course contents (exercise 6 for instance, was not included in the course syllabus).",
            "comment_teaching": "Professor Wang is enthusiastic about teaching. He always answers questions during the lecture and after the class. He also makes jokes in mandarin to make students engaged. His explanations are not always clear, but students can direcly ask him for clarifications.<br /><br />The tutorials are taught by the TAs. I chose not to attend the tutorials as I could barely understand the TA's English.",
            "comment_grading": "Grading seems to be fair, but the grading scheme is quite aberrant.<br /><br />The final grade is based on <br />Assignments (3 in total, a long answer question for each. 20%) <br />Mid-Term (35%, Special Relativity - peripheral contents of Quantum Mechanics)<br />Final (45%, Quantum Mechanics - Entropy and Information)<br /><br />If one does not get an A range grade for the Essential parts, then he will not be able to get above B+ for the final grade regardless of the grade earned in the Advanced sections. <br /><br />I suppose the difficulty of the exams in this semester has been significantly reduced compared to those of the past. I have looked through the past mid-term exam papers (2014, 2015 and 2016, if I recall correctly), and some problems in these exams required firm understanding in general relativity. In contrast, the questions in this year were much more straightforward (to the point that if you have been to class consistently, the professor has simply told you some answers for the mid-term &amp; final).&nbsp;&nbsp;&nbsp;<br /><br />Consistently scoring full marks in assignments and above mean for both mid-term and final (as mentioned, the essential parts need to be above mean) will give one an easy A for the final grade (my final percentage score on the Canvas is 88%, which is equivalent to A). I am not sure about the boundary for an A+.",
            "comment_workload": "Workload will be different depending on the student's academic background in physics. However, even if one has never studied relativity and quantum mechanics, the level of workload in general should be somewhat moderate (only in terms of the essential parts). The deadline of each assignment (three in total) was reasonable, and students were allowed to bring one A4 size (including the back side of the page, either typed or handwritten) cheat sheet for both mid-term and final. However, students will have to spend a lot of time to comprehend the lecture notes as they are very unclear and incoherent.",
            "rating_content": 2,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "MlwJzY1EFJVWpyIVDxrbtYm09UCZLaWp",
                    "name": "6_exercise",
                    "format": "pdf"
                },
                {
                    "key": "tbjc3KDEDEGRuiOzgT0Gqy1AjD9SoC5c",
                    "name": "5_exercise",
                    "format": "pdf"
                },
                {
                    "key": "5NOd6lslB5bLKuBsxH3b3CL1FXPSAzqZ",
                    "name": "4_exercise",
                    "format": "pdf"
                },
                {
                    "key": "XoA5yN1CTd9jil1OR6nNmUw3ppyHoZ8O",
                    "name": "3_exercise",
                    "format": "pdf"
                },
                {
                    "key": "cba6PBWcPlTNnmzTfs2N8W6YhGRGXiSS",
                    "name": "2_exercise",
                    "format": "pdf"
                },
                {
                    "key": "yoqhag0usKCcm2RdPvUue31Ks3oL3HzZ",
                    "name": "1_exercise",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "lVHfo0ikxNB2q5NH7KCJaCWYV09GMgwH",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YoC",
            "date": "Jan 13, 2017",
            "title": "Really Terrible",
            "comment_content": "Almost all branches of physics were being attempted to go through. However, professor ended up just going through a few, including SR, QM, Thermodynamics. <br /><br />Course attempts to introduce students to all of these wonderful physics, but ended up making things brief and shallow. Everything seemed like a rush and pretty much nothing was being learnt in class.",
            "comment_teaching": "Professor has passion, but fails to establish an effective way to teach the class. With the prerequisite of PHYS1114, it's pretty much impossible to keep up with the extensive maths being taught.<br /><br />Gave a C purely because he's really passionate, but in my opinion, the learning sequence is a complete mess.",
            "comment_grading": "Grading's pretty good, got really low for both midterm and final, but still ended up with a satisfactory grade.",
            "comment_workload": "There's basically no work, other than one homework question every now and then. But the work to catch up and to try and understand what the professor's trying to say took forever. It's really hard to keep up especially if you're not a top student.",
            "rating_content": 1,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RltswqrPCqIZ1efNIEcUiJDWRhqifYpy",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "YSA",
            "date": "Jan 02, 2017",
            "title": "Do not take unless required or you already have a very advanced understanding of math and physics",
            "comment_content": "Topics include:<br /><br />1. Special relativity (6, E)<br />2. General relativity (1, A)<br />3. From action to laws of nature (2, A)<br />4. Quantum mechanics (5, E)<br />5. Atoms and molecules (2, A)<br />6. Statistical physics (3, E)<br />7. Condensed matter (2, A)<br />8. Complexity (1, A)<br />9. Nuclear and particle physics (2, A)<br />10. Cosmology (1, A)<br /><br />The last 4 (topics 7 - 10) were not covered as there was no time.<br />The number in brackets shows how many lectures for each topics, and the letter 'E' means Essential, 'A' means Advanced. Essential topics are supposed to decide the grade between A, B, C,... and Advanced is to decide between A+, A, and A-.<br /><br />Like the other reviews have said, I am not sure what is the objective of this course... Very scattered and confused. There was no point in having the complicated Essential and Advanced topics structure. It should have just been 2 topics - special relativity and quantum mech. The level of the content is also very unclear. Some of the stuff is basic, but most of it is too complex for a 2000-level course and also requires advanced math which is not a prerequisite for this course.<br /><br />I have no idea why PHYS 1114 is a prerequisite for this course because this does not relate to that in any way. And also don't understand why this course is a prerequisite for PHYS 3071, and why this course is included in the Astrophysics and Cosmology Minor.",
            "comment_teaching": "He is a nice guy, but he messed up the structure, exams, and grading of this course.<br /><br />The lectures and lecture notes are not helpful to prepare for the exams or complete the assignments. Most of the questions are completely different which you have never seen before.<br /><br />Tutorials are a waste of time. Just attend 1 week's tutorial when you need to give your presentation, don't bother with the others.",
            "comment_grading": "(tutorial section) × 10%<br />(assignments) × 20%<br />(mid-term exam) × 30%<br />(final exam) × 40%<br /><br />The tutorial requires every student to have 1 presentation during the term, which is graded by the TA and also the other students in the tutorial section. Easy to get 10%.<br /><br />3 assignments, 2 are from essential topics and 1 from advanced. Mean is 3.3, 4.1, 4.3 out of 5.<br /><br />The midterm exam was a complete disaster. Most ridiculous mark distribution I've ever seen - 6 MCQ questions worth 5 marks each for total 30 marks + one 10 mark question + one 30 mark question = total 70 marks for Essential topics (+ a 30 marks Advanced question). So 1 mistake in the MCQ = 7% lost. but that doesn't matter cause the questions are too hard anyway. Mean was 32%<br /><br />Final was slightly better, but still followed the same marking with MCQ for 5 marks each. Mean was 56.<br /><br />The only reason for a C rating instead of E is that the overall grade at the end of the course was surprisingly good. I think he realized how messed up the exam scores were, so the grade boundaries were reduced a lot. I got ~0.6 SD below mean in midterm, slightly below mean in final, 10% in tutorial, ~mean in assignments = overall grade B.",
            "comment_workload": "Tutorial requires a 10-15 min presentation about any of the topics studied, with extra questions or facts or whatever.<br /><br />Assignments are quite difficult to complete with only the lecture notes for help.<br /><br />Not sure how to prepare for the exams really. Cheat sheets are allowed for both exams, but even those are not very helpful. Some questions need memorization of random facts which are not relevant, or derivation of equations, or very complex math.",
            "rating_content": 1,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PfNgsTHq52i4KVKo4yxE4bs5iC3c8pze",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TiffChan",
            "date": "Feb 06, 2023",
            "title": "其實做到一頭霧水",
            "comment_content": "Lectures Topics are:<br />Introduction &amp; Special Relativity: Relativity of Space and Time<br />Special Relativity: Length, Simultaneity and Lorentz Transformation<br />Special Relativity: Geometry, Energy and Momentum<br />General Relativity<br />Cosmology<br />Quantum Mechanics: Waves, Particles and Measurements<br />Quantum Mechanics: Schrodinger Equation<br />Atoms<br />Quantum Information<br />Action Principle<br />Entropy and Information<br /><br />Quantum mechanics are too hard for me to understand as a astrophysics minor student so I did not did well in the later part.<br /><br />Btw some are ESSENTIAL parts some are ADVANCED parts. Make sure you know the things in essential parts, it counts 70% of the grade.",
            "comment_teaching": "I think it is quite good to have lectures in coursera so that we can rewatch and rewatch it again<br /><br />but the lecture that we need to go back school and I think it is not necessary go back because it is just repeating the same thing and adding so extra knowledge which confuses me.",
            "comment_grading": "Marks are calculated by (5% group presentation) + (10% weekly homework) + (35% midterm) + (50% final).<br /><br />group presentation: 5/5 (all students got 5)<br />Weekly homework: 10/10 (unlimited attempts so you should get full marks)<br />Midterm: 73/100 (mean: 63.51)<br />Final Exam: 52/100 (mean: 53.14)<br /><br />Overall: B+ (satisfied coz just enrol for minor)",
            "comment_workload": "Assignment in coursera every online lesson. It is unlimited attempts so you can try until it is full mark but sometimes the homework is quite difficult. You can finish it first and wait the explanation from the TA in the tutorial after the deadline of the assignment.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ob6e80OqAZYzIDXe4lSxEKge6fCdKY3L",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Lucien▪Evans",
            "date": "Dec 09, 2021",
            "title": "a course changing my mind on whether keep learning in phyics",
            "comment_content": "it make you feel very confused because he didn't provide a good explanation for most theories",
            "comment_teaching": "he asked us to watch video and i think he overestimate the level of most students. Following his video will make you feel very confused because lots of knowledge without any explanation. This course is much worse than phys 3xxx, since you can at least really learn something in phys3xxx. In this course, you can't get anything useful, no matter a good grade or basic understand in modern physics.",
            "comment_grading": "70% essential part determine A range<br />30% advanced part for A+ A- A<br /><br />This term he stated that he will decrease the percent in A range.<br />although i got most scores in advanced part. i guess i can't got A since my essential part is around mean. The damn grading scheme……<br /><br />i really feel angry about this course! the older students told us its a good grading course and also teaches very well. From this term, you should be care if you choose phys2022<br /><br />Unfair grading scheme for those who got high scores in advanced part but mean in essential. Taking this course must be a mistake and I don't want to repeat it. I never thought it can significantly influence my tag and cha this term. If I have any choice, I would like to choose a honor math or phys course instead of this one .<br /><br />Finally got B+ but my effort put into this course deserve an A range grade.<br /><br /> After taking this course, i changed my mind on if i am suitable in learning physics. Now i am willing to pay more attention on cs or dsct instead of memorizing all of the knowledge on textbook.",
            "comment_workload": "you just need to finish a weekly multiple alternative questions .",
            "rating_content": 3,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WNqc9ZC0Bv75YdGb8R5KWXGI3ukApDLr",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bakuretsu",
            "date": "Feb 02, 2021",
            "title": "",
            "comment_content": "Lecture time is used for presentation, no teaching lecture. Teaching lecture is replaced by lecture videos, about 2 hours long for each week.<br /><br />This course give a very brief introduction to the most important topics of modern physics. Topics are divided into two parts.<br />Essential part:<br />Special relativity<br />Quantum mechanics<br />Atomic theory<br /><br />Advanced part:<br />General relativity<br />Cosmology<br />Quantum information<br />From action to laws of nature<br />Statistical physics<br /><br />For the mid-term and final exam, 70% of the score is about the essential part and 30% is about the advanced part.",
            "comment_teaching": "Prof Wang seems expect students already have certain level of knowledge about the content of this course, but most of the students in this course actually did not have. He is passionate but the teaching did not match the ability of students so much.",
            "comment_grading": "grading scheme:<br />35% mid-term exam (in lecture time)<br />35% final exam<br />15% assignments<br />15% group discussion<br /><br />For this semester, the essential part decides the range of A- and below, while the advanced part decides the range of A+, A and A-.",
            "comment_workload": "3 short assignments in total.<br />Each group need to submit a report before the lecture time or give a presentation during the lecture time alternatively.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "D0Iq9YVNzi2pbUOm9rnIWUinxz8hKJGT",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "elwc",
            "date": "Jan 07, 2021",
            "title": "Very interesting content, but not a good course",
            "comment_content": "No teaching lecture.<br />Lecture videos are provided and you watch on your own.<br /><br />The content in this course is probably the most attractive and fascinating to physics newbies and noobs. After learning the content, you will definitely gain a new understanding to this world. This deserves an A+ here.<br /><br />The presentation and report writing part ruins this course. I don't mind learning more physics beyond the curriculum but it feels really bad when it accounts for 15% of the course grade. It's like you are learning to get marks but not learning to learn. And something more controversial is that you spend quite a lot of time and efforts to be graded for something irrelevant to the course curriculum. If it's changed to optional or reduced to 5%, it'll be more reasonable.",
            "comment_teaching": "Prof Wang is passionate in teaching. But he might think most students are genius and then skip some details, which becomes a difficulty to me.",
            "comment_grading": "Average grading but quite messy scheme.",
            "comment_workload": "Only 3 short hw.<br />But every week, there is a report/ presentation to prepare for, which you need to self-learn.<br /><br />Average workload = C<br />:)",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XqyN5CpeTEQBPOYJihaRWl14My8gv5TP",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Harsh",
            "date": "Jan 23, 2020",
            "title": "",
            "comment_content": "Content was modern physics so things like relativity(mostly special and abit of general) and quantam mechanics. <br />Revising can be easy to compute and remember but to truly understand can be difficult",
            "comment_teaching": "Never been to class but the few times i did i could not sit around as the class was very boring though i think the professor was passionate but the class atmosphere and the other physics students are extremely quiet, boring and low on energy in my opinion compared to the professor.",
            "comment_grading": "Grading seems to be quite good also to score A to A+ range there is a special syllabus added ( general relativity and advanced quantam mechanics)<br /><br />I never went to class or watched lectures <br />Scored around 1SD above mean in both midterm and final. 10/10 in all assignments<br />Grade= -A<br />Fair system",
            "comment_workload": "5 assignments, quite easy to finish and compute but insanely hard to truly understand (for me and most people i saw doing it though they might claim otherwise :P ). <br />Mid term and final can be tricky but revising hard and perhaps some talent can get you through<br />Decent workload on the whole nothing too crazy",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tMQ3p6Dg3gXaRLMR3niZ3051Xi6aNHrm",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "想當年",
            "date": "Dec 27, 2019",
            "title": "【special semester because of HK situation】不是major phy的同學",
            "comment_content": "對小弟而言，content就好難啦！<br />不過好彩他分essential part及advanced part，只要essential part夠高分就有機會攞A range。",
            "comment_teaching": "俾心機教，畫圖好正，落堂耐心答同學問題。",
            "comment_grading": "Midterm Exam statistics <br />Mean = 63.29<br />Median = 63<br />SD = 18.18<br /><br />根據Canvas，<br />Essential part 4 份 assignment 的 mean 是3.9,4.9,4.8,4.5，midterm mean 49.4/75；<br />Advanced part 2 份 assignment 的 mean&nbsp;&nbsp;&nbsp;4.3,4.2，midterm mean 11.8/30。<br /><br />For me:<br />midterm (50%)：<br />essential 60/75 <br />advanced 2.5/30<br />assignment (50%)：<br />essential 4 份 攞滿分<br />advanced 2份 分別4/5,5/5<br /><br />Midterm 好彩TA俾分鬆，比我預期中高分。<br />Midterm below mean 少少（好彩essential part above mean 啫，因為essential part 決定你入唔入到A range），都仲有A-，好grade！",
            "comment_workload": "4份assignment，唔係太長。（原本final變左2份extra）",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "cnr8PFpODcZcS9KbeLSDMOTd4AR4efZB",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Crazypak",
            "date": "Sep 28, 2019",
            "title": "Short review",
            "comment_content": "The course has cover the basic contents about different topics in Modern Physics. Including relativity, action principle, quantum mechanics, atoms and molecules, statistical physics and Cosmology. Especially special relativity and basic quantum mechanics would be taken into the main parts of examination.",
            "comment_teaching": "Prof. Wang has teach us well in two reasons. One is he would explain the theory step-by-step and is willing to answer the questions. Second, he is teaching in funny way and he usually tells joke which makes the class more interesting. Although his pronunciation would not be vary well, he is a good instructor overall.",
            "comment_grading": "As the score of examination distribute into essential part and advanced part, where essential part contain 70% of marks. It is not difficult to obtain a B grade if you just follow the instructions.",
            "comment_workload": "This course has a small amount of homework. It is almost no workload through a semester.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BC3Qt4lSZ1VIJhc8GhdY1V6Kr0vU5ulQ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mickyyork",
            "date": "Jan 24, 2019",
            "title": "",
            "comment_content": "The content about the modern physics is so interesting.Including quantum mechanics,general relativity,special relativity,entropy... But,the background information for these contents is little difficult",
            "comment_teaching": "Prof Wang is a very funny teacher,he will try his best to make some fun in every lecture.I remembered once, he has dressed a t-shrit with a carton logo of Albert Einstein",
            "comment_grading": "The midterm is not difficult mainly including the special relativity,But the final exam challenge me so much.",
            "comment_workload": "Only four assignments in total, almost all of them can be found on the internet.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BefDJomIjCYUt0AIRmdVEgBXngv0H7cQ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "豐",
            "date": "Jan 22, 2019",
            "title": "",
            "comment_content": "Overall the syllabus is in an appropriate length. Students can gain the latest 100-year knowledge of Physics without overwhelming. The notes provided by professor Wang are excellent and well organised. Students can easily follow the notes even without attending lectures.",
            "comment_teaching": "Professor Wang is a excellent and enthusiastic instructor. His presentation of the learning material is clear and interesting. And he often makes jokes when he see the students are tired to wake them up. This makes the difference between Professor Wang and other &quot;boring&quot; (no offense) instructors.",
            "comment_grading": "Grading depends on the effort students paid. If you study as hard as average students, grading is not a problem for you",
            "comment_workload": "Don't worry about the workload. There are only a few assignments.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "er0kEGfql9a3gIaELSBADAT0g4MCc9q3",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nikolalam",
            "date": "Feb 17, 2018",
            "title": "Wang yi is one of the passionate professor I ever met.",
            "comment_content": "the course content include so many modern physics topic being studied from twenty century. eg: special relativity, general relativity, quantum mechanic, statistical physics, Cosmology... He&nbsp;&nbsp;gave lots of detail in each topic. Honestly, it would be an awesome lecture to those physics major student who is really love physics, but it would be a nightmare to others. The course content can give you the most updated thing in the field of modern physics. But you have to study so many topic in this course.",
            "comment_teaching": "Prof. Wang yi is one of the passionate teacher I ever met in UST. He always trying to make a relax atmosphere. I can believe that he spend lots of time to think the joke which can catch our attention before and after the class. He provided the lecture video&nbsp;&nbsp;&nbsp;&nbsp;on the canvas in order to allow the student reviewing any miss content in the course. Besides, he have a very clear and well organised explanation.",
            "comment_grading": "the midterm was covering around 35-40%... I forget the precise percentage. Surely, you can get a nice grade if you spend some times to figure out each detail in the lecture note and pay attention on the lecture. I got 85% mark in midterm. But in the exam, the paper was too difficult and too horrible. I remember I have to answer a question about the angular momentum operator in quantum mechanic and a question about gaussian wave packet equation in quantum mechanic. It is totally out of our knowledge background. Fortunately, the grading of this course is not absolute grading.",
            "comment_workload": "the workload is not really heavy. There are only two assignments which you can choose submit or not. These two assignment only being counted in the A-range, that means you can choose not to submit the assignment if you believe you cannot get the grade above A.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ORXZahHVj2SpbE6lTZEfrbq1DVXPWym8",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "IRE Guy",
            "date": "Jan 08, 2018",
            "title": "Good Introductory Course",
            "comment_content": "Topics:<br />1. Special relativity (6, E)<br />2. General relativity (1, A)<br />3. From action to laws of nature (2, A)<br />4. Quantum mechanics (5, E)<br />5. Atoms and molecules (2, A)<br />6. Statistical physics (3, E)<br />7. Condensed matter (2, A)<br />8. Complexity (1, A)<br />9. Nuclear and particle physics (2, A)<br />10. Cosmology (1, A)<br /><br />E: essential part<br />A: advanced part<br /><br />The exam was separated in 2 parts: E and A. Marks from E part would determine which letter grade you get (A-range, B+, B, B-, C+, ...). Marks from A part would ONLY determine whether you get A+, A or A- if you score high enough in the E part. That means if you fail to get in A-range from the E part, then A part would not do any good.<br /><br />Midterm: 1-3 + little bit of 4<br />Final: 4-6, the rest was not covered due to time limitation<br /><br />Personally I like part 1 special relativity most since he taught a lot in this part and explained everything in details. Other parts are also good but they were not being taught as detailed as special relativity in my opinion.<br /><br />You would learn a lot by taking this course. It is also a prerequisite to quantum mechanics I course unless you can waive it :)",
            "comment_teaching": "Prof. Wang Yi is one of the best professors I have come across with so far. He explains everything in details and in good logic and this makes it fun to learn modern physics. Apart from that, he also frequently gives out jokes (related to physics, of course) and I would not spoil them here. You will find out that he must be a huge cat lover xd. He is also keen to answer questions raised by students in class, and they were very good questions. Lecture videos were provided if you want to review them.<br /><br />For TAs, I chose Ming and he was definitely better than the other guy.",
            "comment_grading": "Good grade.<br /><br />Forgot about the statistics.... I got almost 2 sd above mean in midterm and less than 1 sd above mean in final ==&gt; A<br /><br />Even though the mean for midterm was quite low, the midterm was extremely easy (probably because people last year complained). The final was much harder and I forgot to revise for the atoms and molecules part so I lost a lot of marks there (I thought that was A part, but no).It won't be difficult to get A / A+ in this course.",
            "comment_workload": "Light.<br /><br />If I remembered correctly, there were only 3 homework for this course, each right after special relativity, action principle and quantum mechanics. There were only 3-4 questions and they were not difficult at all.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yBYFrhWKPaSqrpW6C5o2VRlY2zig7pVG",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "V5GmJ6",
            "date": "Dec 30, 2017",
            "title": "TEACHING",
            "comment_content": "Special relativity&nbsp;&nbsp;<br />&nbsp;&nbsp;General relativity&nbsp;&nbsp;<br />&nbsp;&nbsp;From action to laws of nature&nbsp;&nbsp;<br />&nbsp;&nbsp;Quantum mechanics&nbsp;&nbsp;<br />&nbsp;&nbsp;Atoms and molecules&nbsp;&nbsp;<br />&nbsp;&nbsp;Statistical physics&nbsp;&nbsp;<br />&nbsp;&nbsp;Condensed matter <br />&nbsp;&nbsp;Complexity&nbsp;&nbsp;<br />&nbsp;&nbsp;Nuclear and particle physics&nbsp;&nbsp;<br />&nbsp;&nbsp;Cosmology",
            "comment_teaching": "This course is very hilarious. The professor wears different every time and told hilarious jokes. Also the mid term and final questions are quite challenging and new that I have never see some of them elsewhere before. ^_^ He is definitely the best professor I have ever met.",
            "comment_grading": "The score tutorial is overall. Assignments, mid-term and final applies to&nbsp;&nbsp;essential and&nbsp;&nbsp;advanced separately. is calculated by<br /> <br /> tutorial 10\\%<br /> assignments 20\\%&nbsp;&nbsp;<br /> mid-term exam 30\\%<br /> final exam 40\\%",
            "comment_workload": "",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ORSEDi9HJ531lxc4tyXFeEznJ6mDQQJ8",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TCheung",
            "date": "Dec 18, 2017",
            "title": "Good Grade and Low Workload",
            "comment_content": "This course seems to be a follow-up of PHYS 1314, but NOT PHYS 1114. Many sub-topics for quantum mechanics are taught again. In fact, the only part new is Quantum Entanglement (which is only an advance part).<br /><br />Simply speaking, the course is mainly about: 1) General and Special Relativity and 2) Quantum Mechanics.<br /><br />What he actually taught includes:<br />1. Special relativity (essential)<br />2. General relativity (advanced)<br />3. From action to laws of nature (advanced)<br />-- Mid-term exam --<br />4. Quantum mechanics (essential)<br />5. Quantum information (advanced)<br />6. Atoms and molecules (essential)<br />7. Statistical physics (essential)<br />-- Final exam --<br /><br />For topic (3), it is basically PHYS 3032. <br />For topic (4), it's PHYS 1314.<br />For topic (6), it's somehow related to HKDSE's Atomic world elective.",
            "comment_teaching": "He is a nice professor, and always stay behind outside the classroom to answer students' questions. He has also opened a Facebook group too.<br /><br />I think it's quite good before mid-term. Nevertheless, I don't think he explains the quantum mechanics clearly.",
            "comment_grading": "20% Assignments<br />35% Mid-term Exam<br />45% Final Exam<br /><br />Essential Part's Mean<br />- Assignment 1: ~3.8/5<br />- Assignment 3: ~4.6/5<br />- Mid-term Exam: ~57/70<br /><br />Advance Part's Mean (only matters for those who get A-range)<br />- Assignment 2: ~2.8/5<br />- Mid-term Exam: ~9/30<br /><br />Final's statistics are not disclosed. But for both mid-term and final exams, the difficulty may be similar to two years ago.<br /><br />Again, 5 marks for each MC. I got 2 MC wrong for essential part, and this already dragged me to the mean.<br /><br />Mid-term 58/70 + 9/30, and full marks for all assignments,<br />→Eventually A!!!",
            "comment_workload": "Only 2 essential assignments and 1 advance assignment for the whole semesters. And also to prepare 2 cheat sheets, one for mid-term, one for final.<br /><br />Besides that, nothing else is needed.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "DsyyjeoBmIQzUYnTEdafC7bUkomCWP2l",
                    "name": "PHYS2022 Introduction",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "LKzzFYwlJbw6dnr2ZQeWbblWEqEqyPfR",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ah Long",
            "date": "Sep 06, 2017",
            "title": "",
            "comment_content": "雖然有advanced同compulsory ，但advanced啲野唔會難好多，有心睇會睇得明。不過考試份卷啲題目成日暴走……啲野温完都未必識做。",
            "comment_teaching": "教得好有heart，有時興起會講啲out of syllabus嘅野，鍾意phys嘅朋友應該會幾開心",
            "comment_grading": "個grade幾好，當大部份科都踩mean得c+嗰陣，依科有B-。聽講就算拎A都唔洗多好多分",
            "comment_workload": "好少assignment ，得三份，但要做presentation ，要自己揾個topic同揾下資料去講。btw依科好難揾題目做",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AmhlkMJfDn7v4T2ZgoQbyy58PG8Ih149",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Gowtham",
            "date": "Apr 22, 2017",
            "title": "",
            "comment_content": "Syllabus:<br />1. *Special relativity (6, essential)<br />2. General relativity (1, advanced)<br />3. From action to laws of nature (2, advanced)<br />4. *Quantum mechanics (5, essential)<br />5. Atoms and molecules (2, essential)<br />6. Statistical physics (3, essential)<br />7. Condensed matter (2, advanced)<br />8. Complexity (1, advanced)<br />9. Nuclear and particle physics (2, advanced)<br />10. Cosmology (1, advanced)<br /><br />The number indicates the number of lectures planned to cover the topic. Actually only topics 1-6 were covered.",
            "comment_teaching": "The professor is very inspiring and explains things with focus on physical intuition. He does not use slides in class and writes notes on the board. I found this very effective.",
            "comment_grading": "",
            "comment_workload": "Very few assignments occasionally. The midterm and final are challenging however.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4e0hTs2x9qhTKCS7LrhsoyQ5W3PLT9Ly",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ver",
            "date": "Apr 04, 2017",
            "title": "Necessary for QM",
            "comment_content": "This course introduces many different and relatively new (20th century) disciplines in physics, with an emphasis on Special Relativity and Quantum Mechanics. Students who are unfamiliar with many of these topics may find this course hard to follow.<br /><br />Syllabus:<br />1. *Special relativity (6, essential)<br />2. General relativity (1, advanced)<br />3. From action to laws of nature (2, advanced)<br />4. *Quantum mechanics (5, essential)<br />5. Atoms and molecules (2, essential)<br />6. Statistical physics (3, essential)<br />7. Condensed matter (2, advanced)<br />8. Complexity (1, advanced)<br />9. Nuclear and particle physics (2, advanced)<br />10. Cosmology (1, advanced)<br /><br />The number indicates the number of lectures Prof. Wang will use to cover the topic. If the topic is essential, it counts towards determining your letter grade. If it is advanced, it determines where you are in the A-range. Prof. Wang recommends focusing on the essential content if you find it difficult to revise for all the topics. <br /><br />Topics 1-3 and the introductory parts of QM were tested on the midterm, while topics 4-6 were tested for the final. &quot;Atoms and molecules&quot; became an &quot;advanced&quot; topic because Prof. Wang wanted to reduce our workload for studying.<br /><br />Prof. Wang ran out of time to cover topics 7-10, so he only went through them briefly in the final lecture.<br /><br />My greatest takeaway from this course was from the QM lectures, because they really helped me understand the course content for PHYS3036 more easily.",
            "comment_teaching": "Prof. Wang is a very enthusiastic and organized teacher. Rather than using presentation slides, he writes out all his notes neatly on the whiteboards. His lecture notes follow a logical order, and he occasionally cracks a joke or two to keep his lectures entertaining. He is very open to questions, and answers them well. I want to give him extra points for using cat memes in his presentations for the lab tutorials.<br /><br />Sometimes he teaches too quickly, and when he skips steps in his explanations, the lectures can become pretty confusing. Otherwise, I really liked his teaching.",
            "comment_grading": "10% presentation (you get 6% for simply doing the presentation!)<br />20% homework<br />30% midterm<br />40% final<br /><br />Cheat sheets are allowed for both exams.<br /><br />Prof. Wang seems to be pretty fair with his grading. Many students did poorly on the midterm because the questions were too difficult, but Prof. Wang kept that in mind and adjusted the grading accordingly. The questions for the final were much more reasonable.",
            "comment_workload": "Assignments are about 2-3 questions each, and you have adequate time to do them. However, to prepare for the exams, you might have to look for practice questions elsewhere, since the textbook questions are deceptively easy.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5vXb1e4qE6fnv05gpE0tBrgySZNc98KL",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tesserakt",
            "date": "Oct 03, 2016",
            "title": "",
            "comment_content": "As an introductory course to more advanced topics, the content in this course is very scattered. Here are the contents:<br /><br />Action principle (note that we are not supposed to know the calculus of variation at this stage, so this can prove to be a frustrating topic for many)<br />Special relativity and very brief general relativity<br />Quantum mechanics (until basic schrödinger's equation, you don't need to know the Mathematical formulation for deeper topics)<br />Condensed matter physics and thermodynamics (again, very mathematics light)<br /><br />Overall, even for the most complicated topic (action principle), they are glossed over very briefly, which can be unsatisfactory if one wants to attain a better understanding. This is expected from an introductory course, however.",
            "comment_teaching": "The accent of Prof. Wang is unfortunately quite hard to understand, though not to the degree of confounding my understanding. As a professor lecturing this course for the first time, it is understandable how his teaching is not very clear to beginners. However, as a very devoted professor, he will surely get better as the time goes on.",
            "comment_grading": "I am unsure about the grading. Informal statistics shows that a score of 95/100 overall was required for an A+. The mean and SD for mid-term was 77.57 and 14.61, and those for final were 68.72 and 18.07. I have heard that someone with a score of 87/100 overall could get an A, so it seems that the grading is quite good.",
            "comment_workload": "Can be either quite light or very heavy depending on your motivation to study. There are three relatively long assignments, but there are enough time to finish them. There were also weekly (open note) quizzes, but they are also not very difficult overall. Just make sure that you know how to deal with the equations and you should be fine.<br /><br />Note: I have heard that due to the feedback that the tutorial quiz was &quot;too boring,&quot; student presentation will be added to the tutorial session at the semester 2016-17. Take this into consideration.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GP7CPWTVwaiNaWKIeYIhrxLfMDL4DHRl",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Knar",
            "date": "Jan 26, 2016",
            "title": "Good Grade",
            "comment_content": "Prof Wang introduced a variety of concepts, most of which, however, are not in depth due to limited time",
            "comment_teaching": "Teaching with HEART &lt;3 &lt;3. This is Prof Wang's first lesson. I think overall he taught well.",
            "comment_grading": "Very good grading. The mean should fall into A. If you are above mean, you should get an A+ easily. Exams are not very hard, but number of questions are quite few that if you make a silly mistake, you will get very low mark.",
            "comment_workload": "Only three assignments throughout the semester. There will be one quiz in each tutorial, but they are not hard.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HCHHbit4bApTYWibLtJTYdl2FKZ6YPYq",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "butter",
            "date": "Jan 09, 2016",
            "title": "",
            "comment_content": "Content was good. It had everything that is required for Higher physics courses. Provided a good introduction to what modern physics is. The focus was on Special relativity and quantum mechanics and there was sufficient mathematical rigour in these topics. Other topics like Condensed Matter, Thermodynamics were qualitatively introduced. Overall, good",
            "comment_teaching": "The Professor said this was the first UG course that he taught but surprisingly he was able to teach us quite effectively.",
            "comment_grading": "The grading, I thought, was pretty good. If you go through his lecture notes, you should be done for the course.",
            "comment_workload": "Not much, I would say. The weekly quizzes are really helpful in retaining what has been taught in the lectures.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1OPnKVzlZ0Olmgu1BQgSVDPJ7QaGePmt",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Bread",
            "date": "Dec 29, 2015",
            "title": "",
            "comment_content": "This course covers some of the basic Physics concepts that are needed in higher level Physics course. Due to the change in instructor, the contents may be slightly different from the previous years:<br />Mid-term<br />-Action Principle (Principle of Extreme Action, symmetry and conservation laws) (1 lesson)<br />-Special Relativity (5)<br />-General Relativity (1)<br />-Quantum Mechanics (2)<br />Final:<br />-Quantum mechanics (more details with calculation problems) (3)<br />-Atoms and molecules (atom orbitals, bonding) (2)<br />-Condensed matter (Crystal structure, heat capacity, energy band and conductors, semi-conductors) (2)<br />-Thermodynamics and statistical mechanics (Entropy) (2)<br />-Complexity (chaos, fractals, complex network) (1)<br />Not included in exam:<br />-Nuclear and particle physics (1)<br />-Cosmology (1)<br /><br />As you can see, the course includes quite a lot of content--to the point I would say there are too much. Often times there are not enough time to go into details, and the professor may go over some topics too quickly (most students would probably agree on that for the action principle part) that the students may not understand completely.",
            "comment_teaching": "Being Professor Wang's first attempt at teaching an undergraduate course, I would say it is not bad. All of the notes for lecture are hand-written by himself, and he makes an effort to make the topics as interesting as possible, for example, by including jokes and his own drawings. He also encourages students to ask him questions, and even sets up an 'editable version of lecture notes' online, where students can post questions and he can addresses them.",
            "comment_grading": "The mark calculation are as follow:<br />-9 Weekly Quiz:10%<br />-3 Assignments: 20%<br />-Mid-term: 30%<br />-Final: 40%<br />Around half of the marks for the exams are dictated by short response questions (e.g. write down the position eigenstate of a free particle), with others being longer questions that require detailed calculations. They are not too difficult: in both exams there are people who get full marks, and sometimes even more than that thanks to bonus marks.<br />As for the grading, I really want to know as well. For me, I get ~0.8 SD for mid term, ~1.4 SD for final, all full marks for assignment and 93% combining all quizzes, and I got an A. However, I know of a few who get below mean for mid-term, around the same marks as me for final, assignment and quizzes, and they get a an A as well. Based on this, I would make the following conjecture (though I have no statistics to back it up, do not quote me on this):<br />-The A range is quite wide, and it probably takes around 80% score on canvas to achieve (which is not as hard as it sounds)<br />-A+, however, is much harder to achieve, and probably only a few, if any, gets it.<br />-The mean is probably around B+<br />Plus, based on the general impression of the professor, the grading is probably quite good, so do not worry too much about getting very bad grades.",
            "comment_workload": "Weekly quizzes includes a few really simple questions, and since the quizzes are open-book, they are not too difficult to handle. Definitely do not miss any quizzes--around half of the marks are participation marks, and the marking is really lenient. <br />Assignments includes some longer response questions, similar to the exam. Try to start doing the assignments earlier: some (especially the third one on quantum mechanics) are really time consuming.",
            "rating_content": 3,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TKdPoxTtP9Y3UxJJoy3MnzAUN5ARWGSD",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 613,
                    "name": "DU, Shengwang",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Wen Han",
            "date": "Aug 02, 2015",
            "title": "",
            "comment_content": "The course covers introductory special relativity and quantum mechanics.",
            "comment_teaching": "While Professor Du clearly tries to teach his students, he has trouble expressing himself in a clear and straightforward manner. His lectures on special relativity will leave a lot of his students confused which can be clearly seen from the midterm distribution. <br /><br />The tutorials were designed to not overlap with the lectures and instead provides supplementary information. While the content itself is interesting, it is not beneficial to students that cannot follow the lectures.",
            "comment_grading": "The course is graded based on the homework, PRS, quizzes, midterm examination and final examination.<br /><br />Out of 96 students, there are 18 students in the A range and 10 students with B+. This more or less falls within the university guidelines so the grade distribution is mediocre at best.",
            "comment_workload": "The workload of this course isn't too high. There are weekly assignments which aren't too difficult if you have a good understanding of the lecture materials. If the questions are too difficult, the TAs might provide students with a hint during the tutorial. <br />There are also bi-weekly quizzes which cannot be finished in the allocated time. However, the quizzes are graded based on steps rather than answers so most students can easily get full marks on the quiz.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xf5lPfuKWQ2kZVWy4Bu4kuE5nO3AYWpf",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 613,
                    "name": "DU, Shengwang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "O",
            "date": "Aug 02, 2015",
            "title": "",
            "comment_content": "I guess it is normal for Physics course but I really need to give it a D because I don't know what the course is about.<br />The whole content doesn't have any relationship with Phys1114 and I guess you need to preview the knowledge before having the course.<br />The content before midterm is simpler than after but still, hard work is needed.",
            "comment_teaching": "Professor Du is a Chinese Professor so his English is a bit confusing to me.<br />And I don't know whether it is the content's fault or the teacher's fault, I just cannot understand what he is talking.<br />My tutor is a Hong Kong guy but sometimes even he got confused by himself.",
            "comment_grading": "Got C- because I got 2 sd below in midterm and 1 sd below in final.<br />There are quizzes in the tutorial for every two weeks and make sure to have the quiz because the marks save you. And there are PRS in the lessons also and remember to have it.",
            "comment_workload": "Only written works for every week but it is really difficult to figure it out.<br />You can ask your driends or you can figure it out by your own with hours in front of the notes.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FDhbUH3fQbgf8sfguRPr8pKLbv3TECSf",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "xygy23",
            "date": "Dec 21, 2022",
            "title": "",
            "comment_content": "Mainly three parts: Relativity, Quantum Mechanics and Simplicity and Complexity<br /><br />Special Relativity (Length, Simultaneity, Lorentz Transformation, Geometry, Energy and Momentum)<br />General Relativity <br />Cosmology<br />--- Midterm ---<br />Quantum Mechanics (Waves, Particles, Measurements and the Schrodinger Equation)<br />Atoms<br />Quantum Information<br />Action Principle<br />Entropy and Information<br />--- Final ---",
            "comment_teaching": "This is a blended learning course. There is only one lecture each week. And you will go through the content by watching the videos (about 2 hr of videos per week) on Coursera first.<br /><br />The videos are clear and interesting enough as an introduction to the topics. However the examples are not adequate. You must go to the lecture notes for detailed explanations.<br /><br />The lectures are also well-delivered as a supplementary to the videos. Tutorials are quite coherent with the lecture pace and the tutorial notes included summary and homework solution.<br /><br />Prof. Wang and TA are nice and willing to answer your questions.",
            "comment_grading": "5% group presentation (in late September before midterm)<br />10% weekly homework<br />35% midterm<br />50% final<br /><br />About 5 mins of group presentation about a physics topic not covered by the course. You will get full marks easily as long as your presentation content is relevant. Weekly assignment (a few multiple choice questions) on Coursera. Unlimited attempts. Midterm and final both consist of 70% essential part and 30% advanced part. The question format is multiple choice plus long questions. Grading is fairly lenient.",
            "comment_workload": "Workload is relatively light. A few multiple choices weekly. Group presentation is not very demanding. But you need more self-practice to deal with midterm/final. There were also sample exam papers with solutions provided. Good luck.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fw5zKuxVktIEyLLNVmShcgDPbcfw9lka",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "UnconMarketeers",
            "date": "Dec 10, 2022",
            "title": "A mixture between &quot;popular science&quot; and &quot;rigorous science&quot;",
            "comment_content": "1. Official textbook: Instructor's notes. Everyone can download it by registering the course in Coursera.<br /><br />Comment: <br />-&gt; Template of lecture notes is well-designed.<br />-&gt; Content is quite introductory, seems the instructor aims to give a big picture for many modern topics in physics (or even in mathematics - The last part is a rigorous mathematical topic!), and do popular science with some degree of rigor.<br />-&gt; As a math student, I shall say only some understanding in calculus ,linear algebra and probability theory is needed to survive in this course. But based on my knowledge to the topics in the course, the following mathematical tools are also important for further study:<br />(i). Differential geometry (for general relativity and principle of least action)<br />(ii). ODE and PDE (for solving Schrodinger equation<br />(iii). Functional analysis (for many topics/concepts like observables and spectrum, and to understand the meaning of &quot;separable Hilbert space&quot; assumption in Quantum mechanics)<br />(iv). Real analysis (for understanding Hausdorff measure and dimension, an advanced topic in measure theory and Geometric analysis)<br /><br />2. Course topics: The course is divided in the following. (Note: Only &quot;Special relativity&quot;, &quot;Quantum mechanics&quot; and &quot;Atoms&quot; belong to &quot;essential&quot; part of the course)<br /><br />-&gt; Special relativity (Amendment of classical physics when closed to speed of light)<br />-&gt; General relativity (Einstein's equivalence principle)<br />-&gt; Cosmology (Evolution of universe)<br />-&gt; Quantum mechanics (Wave-particle duality; Measurement of physical quantities in quantum sense, Schrodinger equation, identical particle postulate)<br />-&gt; Atoms (Bohr's hydrogen atom model, 3D Schrodinger equation in spherical system)<br />-&gt; Quantum entanglement (Spin state, quantum computing)<br />-&gt; Action principle (Principle of least action, E-L equation, Noether's theorem)<br />-&gt; Particle (Elementary particles, quantum gravity, string theory)<br />-&gt; Entropy (Arrow of time)<br />-&gt; Complexity (Dynamic system, Hausdorff measure)",
            "comment_teaching": "The instructor shows his humor in his Coursera videos. In the class, he also encourages students to think, ask and answer questions.",
            "comment_grading": "15% Homework and presentation (Can get full mark easily in case you pay time on it)<br />35% Midterm, 50% Final<br /><br />Performance in &quot;essential part&quot; determines if you can get into A range.",
            "comment_workload": "This is absolutely a chill course!<br /><br />1. Videos available in Coursera, learning is self-paced.<br />2. Only one lecture per week, although attending lecture is not essential given the above reason<br />3. Easy to get full mark in homework and presentation<br />4. Get familiar to examples in notes is enough to tackle the exam - Exam is a lot easier than homework",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ltkyOTUJovLaRS52yShEw9J8A1sx0ZZY",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "PeterLin",
            "date": "Dec 25, 2020",
            "title": "",
            "comment_content": "Part I: Relativity and Cosmology<br />1. Special relativity (3, E)<br />2. General relativity (1, A)<br />3. Cosmology (1, A)<br />Part II: Quantum Mechanics and Atomic Theory<br />4. Quantum mechanics (2, E)<br />5. Atomic theory (1, E)<br />6. Quantum information (1, A)<br />Part III: Simplicity and Complexity<br />7. From action to laws of nature (1, A)<br />8. Statistical physics (1, A)<br />9. Complexity (1, A, not covered/tested due to time limit)<br />(E: essential, A: advanced, numbers represent the # of weeks of learning) <br />The content is diverse and mainly introductory (as the professor said, this course is &quot;an introduction to introduction to xxx&quot; ), but that doesn't mean the course material is trivial and memorizing-based. Actually, I felt ignorant after each topic as it felt like some problems/confusions were solved but more questions were raised",
            "comment_teaching": "Blended learning was used this semester and Friday's lecture was used for the group presentation. <br />Prof. Wang seems to be well-prepared in the MOOC-style lectures with a high-tech interactive whiteboard and he even cosplayed Einstein when talking about relativity and ps himself to the &quot;back of the wall&quot; when talking about quantum tunneling!",
            "comment_grading": "35% mid-term exam<br />35% final exam<br />15% assignments<br />15% group discussion:<br />Being group representer at least once (either report or representation) (3%)<br />- The best 3 of group representation marks (10%).<br /> The group representation marks for each time is calculated by 5% + 5% x (N – (group ranking) ) / (N - 1)<br /> - Grade of reports (2%).<br />Each report will be grades as 1 (worst), 1.5 and 2 (best), and the final grade will be (the average)%.<br /><br />Prof. Wang said mean ~ A- and he considers himself lenient when giving grades. <br />In my perspective, although the knowledge covered is diverse and difficult if you want to dig deeper, getting a satisfactory result in exams/assignments is not that difficult. Some interesting/puzzling theories/experiments were selected as the topic for the group meeting and the score for group meeting is unpredictable (because groups evaluate each other (and different people have different tastes)), but the score for group meeting is not that significant).",
            "comment_workload": "There are three assignments, each one with a single problem and a few subquestions. However, group discussion was introduced this year and it increased the workload a little bit (especially if you are the one to present).<br />Before the mt or final, a revision of lecture notes and lecture videos seems to be necessary because a lot of concepts were covered and you might not pay attention to some of them when you first learned them.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "h7UR4U0rQCoTKm35kqvYRgEy9Q2naktj",
                    "name": "Exam Score Distribution",
                    "format": "png"
                },
                {
                    "key": "kyvaiup9H89fsjuhj132pMcJCanhQBWm",
                    "name": "Final Exam Score Distribution",
                    "format": "png"
                }
            ]
        },
        {
            "hash": "fJscMgSLBiBM8EYljz3TOkCX795KmfHM",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "andy3278",
            "date": "Jan 16, 2020",
            "title": "",
            "comment_content": "Very brief introduction to each topic in modern physics. Special relativity, General relativity, Quantum mechanics, Atoms, entropy and Cosmology.",
            "comment_teaching": "Professor Wang’s teaching style really fits the content. In first lecture professor Wang wear a wig , cosplay as Einstein LOL. Topics in this course were well explained.",
            "comment_grading": "In this semester final were cancelled, so I am not sure the grading.",
            "comment_workload": "Workload is fine, cheat sheet allowed in midterm. Difficulty of assignment is easy and usually content 2 to 3 questions only. Advanced assignment were given for student who aim better grade, But it’s optional.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PBbvQxXiPAEeJWtgiq7dVujzsIvk4983",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Barry Cui",
            "date": "Jan 05, 2020",
            "title": "Very good grade",
            "comment_content": "The content of SR, the beginning of GR and QM is quite easy to understand but others are really difficult. But it doesn't related to your grade :P <br /><br />Syllabus<br />1. Special relativity (6, E)<br />2. General relativity (1, A)<br />3. From action to laws of nature (2, A)<br />4. Quantum mechanics (5, E)<br />5. Quantum information (2, A)<br />6. Atoms and molecules (2, E)<br />7. Statistical physics (2, A)<br />8. Complexity (1, A)<br />9. Nuclear and particle physics (2, A, IF)<br />10. Cosmology (1, A)<br /><br />Notes:<br />Numbers are approximate number of lectures.<br />E: Essential material<br />A: Advanced material<br />IF: Instructed only if time permits",
            "comment_teaching": "Professor is quite humor(pretended Einstein in his first lecture). He like to ask students questions and will wait for the answers. The flow and teaching pace is quite good, but you need to do some praparation(e.g. read the lecture notes before the lecture). After lecture he would stay for 10 mins to answer students' questions.",
            "comment_grading": "assignments × 15%<br />mid-term exam × 40% <br />final exam × 45%.<br />But due to some events the final exam was cancelled. Therefore,<br />(original assignments + 2 extra assignments) × 50%<br />mid-term exam × 50% <br /><br />The A range is determined by the essential part and the sub-grade is determined by the advanced part.<br /><br />HW full mark<br />Midterm essential 73/75 <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;advanced 19.5/30<br />Grade A+",
            "comment_workload": "Only assignments and exams, the workload was much less than PHYS 2023.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vxZrZon1wBJIiSel6P2MeozULKQhYEMC",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kate0217",
            "date": "Feb 08, 2019",
            "title": "",
            "comment_content": "PHYS 2022 is a very interesting introductory course to modern physics. The topics we covered in the semester including Speciality Relativity, General Relativity, Action Principle, Quantum Mechanics, Atom, Entropy, and Cosmology. Special Relativity and Quantum Mechanics have been carefully discussed among all the topics, even though they are just introduction to the topics. Also, the topics have been divided into the essential group and advanced group, I struggled with Action Principle, one of the advanced part, but I think all the other topics are just fine. The course followed a logical and reasonable way to help us understand and follow the derivation of the content. Also, the lecture notes are very carefully designed, and they also included a series of supplementary materials of suggested textbooks and relevant videos for all the topics. So there's no worry to find relevant materials if one is interested in certain topics and want to obtain a deeper understanding of it.",
            "comment_teaching": "I really like the teaching style of the course. Professor Wang doesn't take attendance, and lecture videos are also available online. One thing to signify is that the lecture videos were uploaded quite timely, so one can keep up with the schedule perfectly by self-study. The professor also had a good sense of humor, so every lecture there were several interesting jokes that keep us motivated and make the learning process enjoyable.&nbsp;&nbsp;There's also a facebook group available for students to ask and discuss problems. Also, Professor Wang scheduled one hour after each class to answer problems, so there are several available ways to ask for help.",
            "comment_grading": "I think the grading of the course is quite generous, most of the students could get good grades for the assignments if they have submitted. The final grade was decided by the essential and advanced part, this style of grading was voted by the students. The essential part decided where the A range are and the advanced part decided the position in A range. One A4 size of the cheat sheet can be taken to the exam, and the materials before midterm wouldn't be covered in the final. I think the exercises at the end of each chapter of the lecture notes are quite helpful. I didn't do well in the mid-term but got a quite good grade in the final, I was expecting a B+ as my final grade(I didn't calculate the grade, just have a general feeling), but got A, so I think the grading was quite generous.",
            "comment_workload": "The workload was not heavy at all for the course. There were 3 to 4 assignments to upload in the semester, and they weren't hard. So if one can keep up with the course, there won't be any problem with the assignments, and you can get quite good grades of the assignments.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qQ3WuDJPc2k5lWVlZgtEebBxRcyYm8Qp",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Fung06",
            "date": "Dec 22, 2017",
            "title": "",
            "comment_content": "1. Special relativity (6, E)<br />2. General relativity (1, A)<br />3. From action to laws of nature (2, A)<br />midterm(有少少Quantum mechanics)<br /><br />4. Quantum mechanics (5, E)<br />5. Quantum information (2, A)<br />6. Atoms and molecules (2, E)<br />7. Statistical physics (2, A)<br />final<br /><br />8. Condensed matter (2, A, IF)<br />9. Complexity (1, A, IF)<br />10. Nuclear and particle physics (2, A, IF)<br />11. Cosmology (1, A)<br /><br />Notes:<br />Numbers are approximate number of lectures.<br />E: Essential material to decide A-range, B-F.<br />A: Advanced material, helps grading&nbsp;&nbsp;A+, A, A-.<br />IF: Instructed only if time permits<br /><br />今年8-10冇時間教 11教咗但唔考<br />essential part 啲野唔難 <br />advanced part 啲野真係唔係好睇得明<br />今年midterm好易, final唔會考midterm前啲野但好難 <br />考試可帶cheat sheet",
            "comment_teaching": "佢係幾有心 幾有熱誠<br />但教得一般<br />啲notes 都唔係整得好好",
            "comment_grading": "assignments 20% <br />mid-term exam 35% <br />final exam 45%<br /><br />**professor話 如果essential part去唔到A range, advanced part係唔會count的!<br /><br />midterm mean (essential): 56/70<br />midterm mean (advanced): 9/30<br />final mean (essential): 33/70<br />final mean (advanced): 11/30<br /><br />我:<br />3份assignments 滿分<br />midterm (essential): 63/70 (聽TA講好似差唔多above 1 sd)<br />midterm (advanced): 7/30<br />final (essential): 30/70<br />final (advanced): 9/30<br />拎A-",
            "comment_workload": "3份assignments<br />唔難, 跟notes做都做到",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GioRja5NRe4UvziYHmJWreO3jceqrIhp",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "VictorWCF",
            "date": "Aug 19, 2017",
            "title": "",
            "comment_content": "Special and general relativity, quantum mechanics, Statistical physics, cosmology 等等<br />Cover好多野，但係佢有分compulsory 同advance，如果唔係aim A range既話讀compulsory既野就夠",
            "comment_teaching": "prof. 對physics同教書好有熱誠，好歡迎問題。 伶個topics都好細心咁教，不過佢教書個flow唔太好，所以D野都係有D難明。<br />佢份人都幾有趣，會用D好得意既圖畫黎教書。<br />基本上淨係睇lecture notes係一定唔夠，好多計數都係上堂既時候先會講，所以一定要專心上堂。",
            "comment_grading": "midterm below 0.6sd, exam below 0.3 sd 都有B- <br />我有個朋友 mdidterm below 0.5sd, exam above mean 0.7 sd 拎A-",
            "comment_workload": "呢個course workload 唔重，淨係要交幾份assignment，都幾輕鬆。<br />佢既additional exercise 唔多，唔係好夠題型操題，要自己不停係網上面搵exercise黎做",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2R3pQ6jTutCoFjJNwA0XL6VKjVWukDaV",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ChuaWanZhen",
            "date": "Jan 04, 2017",
            "title": "Can learn a lot of advance topics",
            "comment_content": "The content this year is much lesser than last year's content. It emphasizes on Special Relativity &amp; General Relativity, Quantum Mechanics, Action Principle, Thermodynamics and Statistical Physics, Atoms and Molecules.",
            "comment_teaching": "Professor Wang Yi is passionate in teaching. He is also a very responsible person. He understands the content very well and can answer questions almost immediately. He always welcome questions from students and encourages us to interact more often with him. You can ask him anything, regardless of whether your question is related to the topic, he is very happy to answer them.",
            "comment_grading": "The grading is very very good. Even though you screwed up in your midterms (below mean), you still stand a chance to receive an A if you excel in your finals. This year's midterm is a bit out of scope but I think the difficulty for the finals is reasonable. For me, I learn quite a lot from this course by self-studying. I think it is insufficient by just reading the lecture notes, you can have a better understanding of the topics by going through the quantum mechanics textbook (at least for me). Also, you need to do more exercises as it involves a lot of math, especially for quantum mechanics. Although, professor Wang did not provide much, you can always find more for yourself to have a better understanding of the content. By the way, we have the proof of Einstein's geodesic equation and introduction to quantum field theory for the midterms and finals respectively.",
            "comment_workload": "There are only 3 assignments and he gave us 2 weeks to finish it, which is more than enough. The difficulty is not that high.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MEeQ68YTTeN3gH7wbX8kFC4s8THzgw3X",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AloneJoseph",
            "date": "Jan 01, 2017",
            "title": "Good grade course but really difficult",
            "comment_content": "difficult. very difficult.",
            "comment_teaching": "He teach quite well",
            "comment_grading": "First, the grading system is quite different with other courses'. As other review mentioned, The content compose of two parts: essential and advanced. <br /><br />In the midterm examination, I got +2.0 s.d. when counting essential part only and +1.2 s.d. when counting the whole paper.<br /><br />However, i got both below counting ways below mean in the final examination. <br /><br />Finally i got an A-.<br /><br />The grading is very good.<br /><br />Even if I don't understand any content in the advanced part, i can still got an A-.<br /><br />However, the essential part doesn't mean that it is easy. The course is not recommended to any student that are not very good at physics. Even if those who are not in the physics major are not recommended.",
            "comment_workload": "low. very low.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Q92kfb7e21sX8F7JhbJzq03kjjQDG8as",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "0_0",
            "date": "Dec 30, 2016",
            "title": "If you don't like this course you probably don't really like physics",
            "comment_content": "Unlike the usual conventional &quot;modern physics&quot; courses, which focus on mainly and only on introductory Special Relativity and Quantum Mechanics, Prof. Wang had completely redesigned the course syllabus to include a large array of topics, including:<br /><br />1. Special relativity (6, E)<br />2. General relativity (1, A)<br />3. From action to laws of nature (2, A)<br />4. Quantum mechanics (5, E)<br />5. Atoms and molecules (2, A)<br />6. Statistical physics (3, E)<br />7. Condensed matter (2, A)<br />8. Complexity (1, A)<br />9. Nuclear and particle physics (2, A)<br />10. Cosmology (1, A)<br /><br />where,<br />Numbers are approximate number of lectures.<br />E: Essential material to decide A-range, B-F.<br />A: Advanced material, helps to distinguish&nbsp;&nbsp;A+, A, A-.&nbsp;&nbsp;<br /><br /><br />Although the SR and QM remained to be the most important part of the course, the course also introduces to the students a variety of topics linked directly to their future studies in physics and gives the student a taste of many more advanced &amp; modern ideas in physics.<br /><br />This redesigned syllabus has made the course become truly a board introduction to all of modern physics, but not just SR and QM, and in some sense, it even serves as an introduction to the &quot;higher physics&quot;.<br /><br />Unfortunately though, due to time constraint, my class only got to cover everything up to Statistical Physics (with an extra lecture on Cosmology, which was not tested). There are really a lot of topics to be covered in the course and many of them are really difficult (involve quite advanced mathematics), but I did learned a lot from them and I enjoyed the course very much.",
            "comment_teaching": "Excellent. Almost perfect. <br /><br />Prof. Wang is very passionate about teaching. He always talk with a big smile on his face, and he always try to improve his teaching by asking for feedback from the students. He always try to offer help to the students,. He officially hold an hour of office hour after each lecture to answer questions. You will see a lot of student surround him after each lecture to ask all kind of questions, and he will try to give a satisfactory answer to each of them. <br /><br />As a physics professor, I think his way of teaching serves as the perfect example of what a college physics course is supposed to be. He wrote his own lecture notes, both typed in LaTeX and drawn on OneNote. Based on these notes, he deliver his lecture using a white board (no more hideous PPT's). He is very knowledgeable about all the contents of the course and even all of physics (and probably not just physics too...), as you can see from the content of the lecture notes, and he has the ability to present and explain his ideas very clearly (Well, at least most of the time). His lecture notes are really beautifully made, both in terms of the writing style, the very clear structure, the developments of physical ideas, the explanation of very physical details, and all the beautifully drawn figure. And all his lecture inherited perfectly all these good things of his lecture notes.<br /><br />Though, there is still a few small defects in his teaching (that's why I said &quot;almost&quot; perfect):<br /><br />(1) He tended to assume the students have more mathematical skills &amp; knowledge than they actually have as a 2nd year student, and therefore often didn't give enough explanation on the mathematical details. I would suggest you don't hesitate to ask whenever you don't understand some math - when you don't know something, probably most of the class won't neither, and Prof. Wang will be more than happy to give you the explanation you want.<br /><br />(2) Prof. Wang doesn't like to give exercises, because he think if you truly understand the physics, then you can apply them to solve the problem right away. I do partially agree with him about this, but unfortunately, this is just too much of an idealization. But on the other hand, because of the uniqueness of this course, it is really hard to find exercise anywhere that fit the scope of it. Hopefully it will get better after a few more runs of this course.<br /><br /><br />This course is truly amazing and fantastic. And the big idea behind all of this course, is to teach the student to understand and appreciate the beauty of physics and to view it as an art. Honestly, if you find yourself hating this course (well, apart from the grading / exam maybe), it is probably a good sign that physics is not for you. Physics is not about taking exams and calculating things; engineers and DSE students do that.",
            "comment_grading": "Generous.<br /><br />I scored almost 1SD on both of the exams, got an A. I know people who blown up on the midterm but did OK on the final got A range. (partly because of the midterm disaster though)<br /><br />Your score contains two parts, the essential and the advanced (please refer to &quot;CONTENT&quot;). Each of the exam will contains a numbers of MC questions, a few free response (with various length) based on the essential part, and one long question on the advanced part.<br /><br />If the grading is not that generous I will give a C / D for grading though, because of the ridiculous design of the exams.<br /><br />Seriously, I was very surprised to ever see an exam even more difficult than PHYS1314's in my life. <br /><br />The midterm is completely a disaster, I don't think anyone know how to do the problems with only studying the course material (well maybe except for some crazy genius, or in other word 毒撚). And the problem for the advanced part is simply out of scope of the course (I looked at the solution, it involves quite some mathematical techniques that are not taught at all in class). Even the five MC questions (which intended to be some easy points, I suppose) are ridiculously difficult.<br /><br />The final is much more reasonable. The essential part are OK. But the advanced part is still ridiculous... Well, at least the final grade is not bad as promised.<br /><br />For those of you who are interested:<br /><br />Midterm -&nbsp;&nbsp;Mean: 32.64 S.D: 17.39<br />Final (E only) - Mean: 49.33 (70.47%) S.D.: 13.35 (19.07%)<br />Final (E &amp; A) -&nbsp;&nbsp;Mean: 59.81 S.D.: 18.69<br /><br />The topic of advanced problem:<br /><br />Midterm - &quot;Action principle for General Relativity&quot;&nbsp;&nbsp;(Derivation of Geodesics Equation)<br />Final - &quot;Fundamentals of Quantum Field Theory&quot;<br /><br />yeah, I know. How the hell an average undergrad can know these sort of things by himself / herself. They will be fun to do in HW with appropriate hints, but not so fun on exams...",
            "comment_workload": "There are three assignments over the semester. They are fairly easy to do, but unfortunately they help nothing in studying for the exams.<br /><br />After some requests from the students, Prof. Wang had uploaded the quizzes from last year. If they are still available when you take this course, I suggest you go through them carefully, as those are the only chance you can get something close to what you can expected on the exams.<br /><br />The tutorial won't be teaching anything, but instead every student has to give a presentation on something related to physics (time /&nbsp;&nbsp;content not limited). I think it is a pretty fun design, after all the usual tutorials are useless anyway.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "maasTFKW8PLXNFImEU05UPlfFlyQZnjc",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Sean3",
            "date": "Sep 09, 2021",
            "title": "",
            "comment_content": "This course give a very brief introduction to the most important topics of modern physics. Topics are divided into two parts.<br />Essential part:<br />Special relativity<br />Quantum mechanics<br />Atomic theory<br /><br />Advanced part:<br />General relativity<br />Cosmology<br />Quantum information<br />From action to laws of nature<br />Statistical physics<br /><br />For the mid-term and final exam, 70% of the score is about the essential part and 30% is about the advanced part.",
            "comment_teaching": "Prof Wang seems expect students already have certain level of knowledge about the content of this course, but most of the students in this course actually did not have. He is passionate but the teaching did not match the ability of students so much",
            "comment_grading": "35% mid-term exam (in lecture time)<br />35% final exam<br />15% assignments<br />15% group discussion",
            "comment_workload": "For this semester, the essential part decides the range of A- and below, while the advanced part decides the range of A+, A and A-.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6ODMdCChMOB1QNgDpHHyYnBI3ZmGOhEX",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Hit",
            "date": "Feb 18, 2016",
            "title": "",
            "comment_content": "We have covered topics of Action Principle, Special Relativity, General Relativity, Quantum Mechanics, Atom &amp; Molecule Physics, Condensed Matter, Statistical Physics, Complexity, Nuclear &amp; Particle Physics and Cosmology.<br />To me the content was really hard but there were still many smart Physics students in the class that could perform outstandingly in this course. I am actually interested in studying Physics but the difficulty seemed to freak me out a little bit.<br />And I heard that the curriculum of this course was deigned more difficult in this semester than the previous semesters.",
            "comment_teaching": "I am sorry but I could hardly understand his English in class so that was a hindrance for me in studying the course despite the fact that Professor Wang is humble and genuine. And to me, his explanation or interpretation of the concepts or laws are not clear nor easy to grasp.",
            "comment_grading": "I think it is not hard to not fail in this course, even for me as a dummie in Physics, I passed the course with a B, so good luck!<br />And there was a quiz for each tutorial per week, and it was not easy so do not think that you can get by without preparing for it.<br />The score was calculated by (quiz) × 10% + (assignments) × 20% + (mid-term exam) × 30% + (final exam) × 40%, no attendance is compulsorily required.",
            "comment_workload": "The workload was OK, not too much but the difficulty is quite high. We had 3 assignments in total throughout the semester and each had about 3 long questions.<br />And to get the quiz score you have to kinda study before each tutorial even though you are allowed to look at your notes during the quiz.",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}