{
    "error": false,
    "course": {
        "id": 1023,
        "subject": "PHYS",
        "code": "1314",
        "name": "Honors General Physics II",
        "description": "This course is a more in-depth version of PHYS 1114. It is intended to provide a solid foundation to students who wish to take more advanced physics courses in the future. Key topics include Coulomb’s law, electric field and potential, Gauss’ law, capacitance, circuits, magnetic force and field, Ampere’s law, electromagnetic induction, AC circuit, Maxwell’s equations, electromagnetic waves, geometric optics, interference and diffraction. Students without the prerequisite may seek instructor’s approval for enrolling in the course. For students under the 4-year degree only.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2030,
            1930,
            1830,
            1730,
            1630,
            1530,
            1430
        ],
        "prerequisites": "(Grade A- or above in <a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1111\" href=\"/review/PHYS1111\" target=\"_blank\">PHYS 1111</a> OR <a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1112\" href=\"/review/PHYS1112\" target=\"_blank\">PHYS 1112</a> OR Grade B- or above in <a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1312\" href=\"/review/PHYS1312\" target=\"_blank\">PHYS 1312</a>) AND (Level 5 or above in HKDSE Mathematics Extended Module M1/M2 OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1012\" href=\"/review/MATH1012\" target=\"_blank\">MATH 1012</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1013\" href=\"/review/MATH1013\" target=\"_blank\">MATH 1013</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1020\" href=\"/review/MATH1020\" target=\"_blank\">MATH 1020</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"1023\" href=\"/review/MATH1023\" target=\"_blank\">MATH 1023</a>)",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1114\" href=\"/review/PHYS1114\" target=\"_blank\">PHYS 1114</a>",
        "rating_content": 3.44,
        "rating_teaching": 2.81,
        "rating_grading": 3.19,
        "rating_workload": 3.06,
        "review_count": 16,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 617,
                "name": "YANG, Zhi Yu",
                "count": 8
            },
            {
                "id": 605,
                "name": "LIN, Nian",
                "count": 6
            },
            {
                "id": 1548,
                "name": "JAECK, Berthold",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "SE6IZJnXdAT7VmnAJFux4PXKUoE0IEZf",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 605,
                    "name": "LIN, Nian",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "BABA",
            "date": "Jun 09, 2016",
            "title": "Horrible course structure, awful teaching",
            "comment_content": "The course content is the same as that of Phys1114, with the exception of geometric optics and AC circuits. Some introductory quantum mechanics (mostly concerned with solving the wave equation for simple systems) is also covered. <br /><br />No extra content is taught, neither is the homework any harder, its just that you are sitting in class with a bunch of extremely smart people, and the exams questions are tougher. <br /><br />The homework before the midterm was any 6 questions from the back of the textbook (3 Qs from the chapter taught in class, 3 from the chapter which will be taught in class next week)<br />After the midterm, this was changed to 12 questions due to a midterm disaster. <br />The homework doesn't prepare you for the midterm or finals. This",
            "comment_teaching": "With all due respect, Professor Lin doesn't know a thing about teaching. <br /><br />He has a poorly made set of PowerPoint presentations, the versions of those presentations available on the course website are outdated and are missing important parts. <br /><br />He attempts to use a self-learning methodology to teach us, which is another way of saying he wants us to do everything, while he gets to sit back and relax. In the class he glides over the surface of the topics, without discussing them in depth. His emphatic voice modulation gives him the impression that he is imparting some life-changing knowledge, instead he is simply reading the slides verbatim. <br /><br />In class, he gives students in-class exercises (these are graded and are meant to be solved in groups of 3/4). After giving a certain exercise, he doesn't bother solving it himself. In total, he didn't solve more than 3-4 exercises out of a total of 60-70 of them. Even if he sees someone being unable to solve one, he wouldn't bother doing anything about it. <br /><br />He has a habit of rushing and skipping through important parts of the course, which is understandable since the content covered is vast and he gets just 3 classes a week. But what is not understandable is the fact that on certain occasions he spends half the lecture discussing the personal lives of dead scientists instead of teaching us important concepts, or solving problems with us.<br /><br />On top if all this, we can't miss the lectures because of the graded in class exercises. <br /><br />He didn't responded to any of the 3 emails I wrote to him (I finally had to go to his office to get him to talk). <br />In contrast, the TA was much more helpful and responsive.<br /><br />Phys 1312 was a much better course, and Professor Chan was infinitely better than Professor Lin. If you are expecting a course as enjoyable as Phys 1312, consider this a warning.",
            "comment_grading": "The grading is a complete mess. <br />He started out by telling that the grading would be absolute, above 90% for As, above 80% for Bs, 70% for Cs and so on.<br /><br />BEFORE THE MIDTERM, this was distributed as follows: In-class excercises(10%), Homework (30%), midterm (20%) and final (40%)<br /><br />The midterm was a disaster. Before the midterm, he told us that the format would be as follows: The exam was an hour long, and immediately after that, in the next 30 minutes you would have to mark another randomly chosen student's paper. 50% of the marks depended on your performance is the actual exam, 50% depended on how well you checked the other paper. <br /><br />The exam itself should've been a 2 hour long paper, instead he told us to do it in 1 hour. Midway through the exam, some students started panicking and he gave us 15 minutes extra. Midway through those 15 minutes, he gave us 15 minutes more. Midway through those 15 minutes, he scrapped the old format and stuck to the conventional format (100% marks based on our performance in the exam)<br /><br />AFTER THE MIDTERM, a lot of the students hadn't performed well in the midterm, so he decided to change the grading scheme reducing the weight-age for midterm by 10% and increasing that of the hw by 10%. Subsequently, he asked us to double the amount of hw we did. <br /><br />How the final grade was computed remains a mystery. So many changes in the grading scheme shows a complete lack of resolve. I'm wondering how he can even be allowed to do such a thing.<br /><br />I scored mean marks in the midterm, submitted half of all the hws, somehow got through the finals, ended up with a B-",
            "comment_workload": "The workload depends on how seriously you take the hw and what questions you choose to do, and whether you choose to do them yourself or copy answers from the solution manual. <br /><br />To conclude, I had a pretty bad experience with the course, and I recommend people not to take this course unless they really want to.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 11,
            "vote_count": 11,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fNefT5K8sV4bzKNVKUdoiWPCB7uLLKRK",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 617,
                    "name": "YANG, Zhi Yu",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Jeff Sun",
            "date": "Jun 04, 2019",
            "title": "DO NOT TAKE THIS! DO SWAP TO 1114! NO MATTER WHO YOU ARE!",
            "comment_content": "Yang skipped several parts, omitting all the proofs of important theories, while one of the only exclusions was derived from another which was a result of the one we are trying to derive (i.e. circular reasoning).<br />The tutorials covered the contents of the higher level courses as if the TA is showing off his skills. Both the lectures and tutorials are irrelevant to the mainstream and the exams.",
            "comment_teaching": "Professor: Reading lecture notes while the voice dies down halfway. Monotone voice lulls us to sleep for sure. Never stress the important points but wasting a long time on useless and irrelevant stuff.<br />TA: Unhelpful. Never expect a substantial help from him as he would say &quot;I don't know&quot; or &quot;You should know it&quot; if he does not ignore it, while in most cases he does. He also applies all kinds of approaches we haven't learned, I doubt whether he is &quot;helping&quot; us. Well, but those on good terms with him will actually gain swift responses, even for other courses like PHYS 30xx.",
            "comment_grading": "BAD! It's said that the mean score is ~B-. It has always been the case because Yang actually looks down upon the students. And he even threatens to lower the grade if he sees negative comments on SFQ, well, isn't that a revenge?<br />Opaque grading! The letter grade came out without the publishing of the final scores, not to mention the paper checking sessions!<br />So why do I care about the paper checking? Because I got almost 10 more credits by appealing. The grading in the midterm was by no means fair. Due to the weird questions and importance laid on steps, the TA now has the &quot;freedom&quot; to deduct marks arbitrarily, like what he did in PHYS1113.<br />In a word, Yang's irresponsibility and Pak's unfairness have led to the terrible grading, especially you are not on good terms with Pak.<br />Those got good grades are almost all those on good terms with Pak. They may communicate in Chinese (both Cantonese and Putonghua) aloud during tutorial sessions, leaving others confused. They also suspiciously have private contacts. Once a private email &quot;asking&quot; for more marks during the grading process of midterm was disclosed by someone. WELL...<br />The grading scheme is not worth mentioning as we do not even know the grades of the final. I got a B+. The A range is small I think.<br />Whenever you see Pak or Yang, take a detour. Especially when Yang's irresponsibility may magnify Pak's unfairness effect on grading.<br />A PHYS guy told me that we actually sacrificed to the sect battle within the PHYS department, though I am not a PHYS guy. Most of UG students in Pak's sect are not in 1314, so he intentionally lowered the whole grade.<br />Yang is also an arbitrary guy, he will sometimes announce weird regulations like &quot;The only time you can submit your homework in 14:50, or half of the marks will be deducted&quot;, knowing that we have a lesson at 15. If he is in an awful mood (which is quite often), things will get worse. (But the rankings decided by Pak will not change lol)<br />All in all, your grade is largely dependent on your personal relationship with Pak, which is quite similar to LANG courses, where the grading scheme does not play a role DE FACTO.",
            "comment_workload": "Medium. <br />There are ~10 questions from the textbook each week while the difficulty does not match that of the exams.<br />I also did half of the exercises (odd-numbered) ones.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 8,
            "vote_count": 9,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aI3aJlAiswAOmNwkz6MoaiYzIbu4IGFE",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 617,
                    "name": "YANG, Zhi Yu",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "7K",
            "date": "Jun 06, 2019",
            "title": "On9 YZY, good content with bad instructor and bad grades",
            "comment_content": "E&amp;M with vector calculus. Some fundamental quantum mechanics, the exam just focus on E&amp;M and the QM you have learnt in high school.",
            "comment_teaching": "He focuses a lot in trivial parts(high school stuff) but skips everything nontrivial(mathematical proofs). Going to his class is entirely useless, I have learnt nothing when attending lectures, I regret a lot for attending lectures, even playing 1.5 hours of DOTA Autochess can learn more than attending his lectures.",
            "comment_grading": "The grading is shit. This is the worst grade I received since the start of my study in HKUST.<br />As far as I know, 8 out of 8 IRE freshmen has got B range. Some of them even got B-.<br />Midterm mean: 46/80 me: 48/80<br />Final: ?????(never released)<br />my grade: B<br />An B- mean grade for an honor course is ridiculous",
            "comment_workload": "The workload is quite high in the sense that you have to master vector calculus in order to understand what is going on in his lecture notes(which I failed to do so). Reading Griffiths by yourself (and taking MATH 2023 simultaneously) is highly recommended.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "6iD2VNJQHeYfhVa81HA5dgRqSRCGcnjg",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 617,
                    "name": "YANG, Zhi Yu",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Orange_C",
            "date": "Jun 21, 2018",
            "title": "A good course that is taught in a wrong way",
            "comment_content": "The content are mostly normal things like circuit, EM wave, Maxwell's Equation, and diffraction. It's definitely worthy to learn these things in a deeper level than 1114, especially if you want to major in PHYS or do anything related to physics.",
            "comment_teaching": "I have to say that the profeesor expect too much from us by teaching something too difficult and unrelated to the topic in class. This makes students like me who does not have any previous experience to these topic very hard to follow. If you alrerady know quite a lot about all these things, you may find it interesting.",
            "comment_grading": "The worst part about this course is grading. 10% HW, 40% Midterm and 50% Final, the grading scheme is fine, but has no transparency at all, you don't know how much score you get in final and homework, only the scores of midterm is released. Worse still, there is no paper checking session, you get your grade directly. And as an honors course, only 25% of A range is kind of unacceptable, especially compared with 1312, which has an A range of over 50%",
            "comment_workload": "Around 10 questions from the textbook per week, not realy difficult though, just a little bit time consuming and exhausting if you can't understand the things taught in class and have to read the book by yourself.",
            "rating_content": 5,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ukpBR2wj9rbZbzRufO7JBt9kXPqvhlI0",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 617,
                    "name": "YANG, Zhi Yu",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Feibendehaozi",
            "date": "Jun 05, 2019",
            "title": "Rubbish course under YZY",
            "comment_content": "Covering the same as PHYS 1114, maybe added some QM compared. Midterm and final has no overlap with homework. Everything he taught is really easy but exams are difficult.",
            "comment_teaching": "REALLY POOR!!! So boring that every time I take I will watch youtube or lightnovel. Finally I gave up attending lectures and began studying other things.",
            "comment_grading": "WORST. He set all homework to full score to everyone.<br />Midterm 40%. Final 50%.<br />YZY you are so cute(ni meng si le)❤️.",
            "comment_workload": "Workload comes only before exam as you need to review.<br />who up who sand nose.<br />No matter whether you study physics or not.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 5,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "2ODPID5yWAtHWdNUpOE72vddnBITHCtj",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1548,
                    "name": "JAECK, Berthold",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "aXRei",
            "date": "May 29, 2023",
            "title": "Not so structured, but Appreciate the improvement",
            "comment_content": "Content is mostly the same as PHYS1114, so I am not repeating here. Electromagnetism and Optics are covered. AC circuit is skipped because it is said to be too easy. (which I don't think so) At the bonus lecture, Prof. Jaeck also taught some Special Relativity, but it is not examined. I think this is better than cramming Quantum Mechanics stuff because there are a lot to talk about in classical physics.<br /><br />More than PHYS1114, instructor also introduced some extra stuff like Poynting vector, differential Maxwell equations and derivation of diffraction formula.<br /><br />However, I think more can be included in 1314 to let students prepare for future physics courses. I don't mean to put the whole 3033/3038 into 1314, but some techniques, such as mirror image method, boundary conditions, and special functions (sine integral, Bessel functions etc) can be included. The soft skills would be useful.",
            "comment_teaching": "A to B for Prof. Jaeck, E for TA (Mr. Sankar)<br /><br />I went to the first lecture, just to find myself disappointed. Instructor was talking some easy high school stuff like Coulomb's Law. Afterward, I seldom went to lectures, or went to 1114 instead.<br /><br />But the instructor is willing to listen to our opinions. Once he urged us to attend tutorials, but he did not do so because some people reflected how bad tutorials were. Also, he included extra content after some complained that content in lectures was too easy.<br /><br />The instructor provides both 1114 notes and notes made by himself. Both serve as a good course material.<br /><br />Instructor lacks experience in teaching the course, but he is kind and open-minded.<br /><br />On the other hand, the TA is much worse<br /><br />He just asked us to write down homework answers on the board in tutorial. What is the purpose? He did no preparation, then what's the point of going to tutorial?<br /><br />With the 9-mark scale system, the TA marked HW and midterm without any explanation. Every steps were fine, no mistakes spotted, but still marks were deducted. As if the TA is using RNG to give the grades.<br /><br />Not discriminating Indian but TA has a very confusing tone, that I cannot understand what he says. Only way to communicate with him is via email.",
            "comment_grading": "At first, the instructor thought that the average should be B range. However, after it was pointed out that the average of PHYS1312 is in between B+ and A-, the instructor decided to give the grades that truly reflect our effort and dedication. The grade is even slightly better than PHYS1312, with more than half students getting A range.<br /><br />Midterm is more like bullshit. Highest is 28/36 because TA is very irresponsible. Once we asked about a question, which the answer provided is wrong. But the TA just responded &quot;it is talked about in tutorial&quot;, without thinking about the question. Also in a long question an approximation was not specified, hence should not be assumed. However, the solution used the approximation, and the TA thought if we don't use the approximation, then we are wrong.<br />Let alone questions are very cursed. With MCQs easier than 1114, long questions are very confusing.<br /><br />Final is much better. Questions are properly set with clear instructions. Most get high marks in the final, with median being 46-48/54. Also, I think the instructor marks the paper this time, so if you write down correct steps and answers, you get points, which is not the case in midterm",
            "comment_workload": "Workload depends<br />Every week there is an assignment. You don't need to use Mastering Physics. Instead, the instructor chooses some questions from Mastering Physics and designs some. He even encourages us to use ChatGPT to finish some of the questions. On average I spend 1 to 1.5 hours per week to finish the assignments.<br /><br />It may be very hard for you to catch up if you haven't studied university physics before. You would need hours per week to revise the content, find and finish exercises.<br /><br />However, if you studied the stuff before (dual program / physics olympiad training / self-study), you can spend less time on the course. Just remember to skim the notes and try some problems before exam to refresh your mind.<br /><br />In total, I put 5 to 10 hours outside lectures to revise the course, and I get a decent grade.<br /><br />Anyways, you may want to ask a problem, and this maybe the reason why you see this review:<br />Should I choose 1314 instead of 1114<br /><br />You studied some university level EM and optics before going to UST and you don't suck at them -&gt; 1314<br />You hate Mastering Physics -&gt; 1314<br />You wanna know some crazy people -&gt; 1314<br />You just wanna get rid of physics after studying 1 more course -&gt; 1114<br />You want to get good grades by hard-working -&gt; 1114<br />YZY teaches this course again -&gt; 1114<br />You think 1312 is too hard -&gt; 1114",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UYfb7bHKZ4nPqL857k2fQIRURbrNtk8V",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1548,
                    "name": "JAECK, Berthold",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "adqqqqqqqqm",
            "date": "May 30, 2023",
            "title": "Not as terrible anymore",
            "comment_content": "The content is essentially the same as PHYS1114, and potentially even less than that as the professor decided to skip the section about AC circuit (under the guise of being “too trivial”, which it definitely isn’t). There wasn’t as much added content as I expected and at the end I didn’t really learn much. Instead, the professor decided to have a bonus lecture on special relativity because he believed it is an important concept for physics students, though it will not be examined in this course. However, it was held during the study break before the finals so I did not attend.<br /><br />I think including a bit more content from higher level physics courses (3033/3038) would fit the intended difficulty of the “Honors” General Physics II better.",
            "comment_teaching": "Prof. Jaeck is a good instructor and you can tell he genuinely wants us to learn from this course. He starts almost every lecture with an experiment to demonstrate the content to be taught, so we can build intuition. Also, he included a feedback corner in canvas that allows us to provide anonymous feedback for him to improve, which did help improve the course.<br /><br />The only complaint I have is that he uses the whiteboard to teach, which is okay but he writes quite slowly and it is difficult to see what he is writing sometimes.<br /><br />The TA on the other hand… it’s best you don’t attend any tutorials because it’s not about providing and solving some difficult problems like PHYS1312. It is literally just calling students out to the whiteboard to write their solutions of the mastering physics homework that was due a week prior… It should come as no surprise that the attendance rate of the tutorials are very low.",
            "comment_grading": "The grading of this course is now way better after being freed from the reign of YZY. It is now similar or even better than that of PHYS1312, where half of the class received A range. Here is some stats and my scores<br /><br />Weighting:<br />HW 15%<br />Midterm 35%<br />Final 50%<br /><br />Midterm <br />Mean: 20.5/36<br />High: 28/36<br />My score: 25/36<br /><br />Final:<br />Mean: 45.1/54 <br />High: 56/54<br />My score: 51/54<br /><br />My letter grade: A<br /><br />Each long question in all exams and homework has an elusive 1 bonus mark, that’s why it is possible to get above the maximum mark. I have no idea how it is given..",
            "comment_workload": "1 problem set every week, 2 short questions and 2 long questions, with the due date being a little over one week from the homework release date. The short questions are made by the professor himself and the long questions are challenging problems from mastering physics textbook. Honestly, the workload is not heavy at all compared to the non honors version, considering you have to do the same mastering physics webwork questions in PHYS1114.<br /><br />As for preparation for the exams, just doing more problems in textbooks is enough.<br /><br />Overall, under the teaching of prof. Jaeck, this course is not the horror that the other reviews of this course described.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8bQIN6JfBBhpTp9yZp2piyNlnuWOXVPo",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 605,
                    "name": "LIN, Nian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "0_0",
            "date": "Sep 24, 2016",
            "title": "Full of traps",
            "comment_content": "Just like PHYS1312, this course covered a lot of topic in an extremely fast pace, including basic electromagnetism, optics (but of course in more depth, I suppose, than the usual PHYS1114) and some elementary quantum mechanics out of nowhere.<br /><br />The quantum mechanics part will take the whole last two or three weeks of the course to cover, as a result AC circuit will be excluded from the topic list and the optics part will be taught at an even faster rate.<br /><br />The content is not too bad. I actually like the idea of including a brief introduction to QM as an epilogue. But it is the way that Prof. Lin handled it, or in other words, the overall course design make everything look bad (more on that in &quot;teaching&quot;).",
            "comment_teaching": "In my opinion, Prof. Lin really have some thoughts on the physics education , and do really trying the best to teach physics in the &quot;right way&quot;. But it is just that he never actually achieving what he want the course to be.<br /><br />(1) He expect the students to do much of the learning by themselves, and expect the lecture (btw, the tutorial is used as an extra lecture as well) to be more like a &quot;discussion session&quot;.<br /><br />But in spite of that, in the lecture most of the time he just read aloud the very poorly-made PPT that more or less the same as the text book. (btw, I feel strange that why both of the &quot;honors&quot; introductory physics course rely so much on PPT for teaching, this is by far the worst way to teach physics and I seriously didn't expect this to been seen in an &quot;honors course&quot;.)<br /><br />He did add a discussion component to the lecture by occasionally asking the students to work out some &quot;discussion questions&quot; in groups and share their answers among each others. But this work fairly poorly, at least for me. Firstly, most of these so-called &quot;discussion questions&quot; are just some &quot;simple calculations&quot;, according to Prof. Lin,&nbsp;&nbsp;so it is either you get it right or wrong and there is really not much point of discussing. Second, although seldom there may be some exception, but most of these &quot;simple calculations&quot; are not anything that particularly inspiring in terms of helping you to think about the physics, and Prof. Lin won't even give out the correct answer to the class; I am no genius, so how the hell do I learn from these &quot;open-end&quot; yet &quot;right-or-wrong&quot; questions? Thirdly, although I myself am not a genius, but there are plenty of those really smart people siting around you, and from time to time I feel very pressured by how fast they can come up with the solution. I think competition is not really an element that Prof. Lin intended to put in the class, but he just accidentally did, and I feel bad about it. Finally, all these &quot;discussion questions&quot; count toward your grade (you need to submit your paper after each lecture), so this in effect make the lecture mandatory even though attending it may not be much of benefit. <br /><br />(2) I must emphasis once again, the PPT used in the lecture are very very poorly-made. The structure and layout are really messy, the figures are quite hard to read and not to mention that equations always look hideous in PPT. It is really unpleasant to read through the PPT and it is&nbsp;&nbsp;never a good idea to use them to review nor to even study the material for the first time.<br /><br />(3) The homework is another attempt of Prof. Lin of creating the &quot;self-engaging&quot; atmosphere. Every week you can choose freely from the textbook 3+3 problem to work out, 3 for the chapter the class currently on and 3 for the next chapter after you have pre-study it.<br /><br />This sounds quite good in theory but it doesn't work in practice. Firstly, the textbook chosen is again one of those commercial-kind of textbook that is not really suitable to a &quot;honors physics course&quot; which expects the students to obtain a very deep understanding of physics. Second, the homework completely fail to prepare you for the exams. The midterm, as many had already said, is just a disaster. None of the textbook problems, in my opinion, is comparable to the difficulty of the examination (simply because the textbook does not fit). And you can't really expect anything on the exam, because the Prof. didn't give you any chance to. To be honest, the exam is not really that difficult, but it just requires you to have a level of understand that one can't obtain just by simply doing the homework and attending the lecture.<br /><br />(4) Well, but the good thing is at least Prof. Lin is very willing to answer questions from students and have a very good attitude toward the students.",
            "comment_grading": "At the beginning of the course, Prof. Lin said that he is going to do absolute grading. But by the end of the course, I just can't trust any one word from him regarding grading and exams anymore, as there are so many changes over the the whole semester and he often says things so casually that I just can't decide whether to take it seriously.<br /><br />For your reference, I got (should be) 100% on homework and in-class exercise, scored about 1x points below mean on midterm (the mean is 6x/100), scored about 20 points above mean on final (the mean is 5x/100). And I got a B+. I have calculated that my overall performance should be 8x/100, which, if absolute grading is really used, should be in the B range. (btw, the mean and SD are never announced officially, I asked the TA directly about it.)<br /><br />A few more words on the exam for those who are interested:<br /><br />Both of the exams are open-book. The midterm originally have a somewhat interesting but impractical design (which someone else had already mentioned so I would save my words on that). All free response question, about 6 of them on each exam (Prof. Lin would ask in the class how many problem do you want on the exam) and like I said, don't expect them to be anything you see in class or textbook. In particular, there is always a QM problem in the final. There are some sample exam paper on the website but most of them don't come with solutions.",
            "comment_workload": "If you are not a genius, please expect to work real hard on your own if you want a good grade. If absolute grading is really used, you need about an overall 90% to get an A, and you can see that is really not too easy.<br /><br />Prof. Lin will keep saying things that make you feel like the course gonna be easy, things gonna turn out OK and you can just relax and sit back a little bit while studying, but don't get tricked, stay focused and don't let yourself go easy -- Never fall into the TRAP.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "otyrpj1YhacTcfCQTwhfTdPHzf9GFV01",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 617,
                    "name": "YANG, Zhi Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "adounope",
            "date": "Aug 26, 2022",
            "title": "actually not that bad",
            "comment_content": "it include the contents of PHYS1114, but also some introduction to basic quantum stuff,<br />including wave function, and the scrodinger equation (which are not covered in exam)<br /><br />by the end of the course, you will know how to use wave function to do basic stuff, like particle in a box and quantum tunnelling<br /><br />its exam range is same as 1114, but they are no longer those cute multiple choice questions<br /><br />exam paper is here<br />http://petergao.net/ustpastpaper/index.php?course=PHYS1314",
            "comment_teaching": "yang's progress is a bit fast,<br />sometimes he showed a equation, but to the next slide without explaining how it is derived.<br /><br />I think he expect us to read and understand the lecture notes before every lecture",
            "comment_grading": "90% score from final exam,<br />10% from weekly homework<br />each homework contribute about 1% of final score<br /><br />although I got an A+ at last,<br />I don't like the grading as its is very opague,<br />we don't even know the score distribution after the final.",
            "comment_workload": "homework:<br />weekly,<br />the amount is inconsistent, but doable within 4hrs<br /><br />besides the homework, should also need to read those lecture notes, but they did take time to digest.<br /><br />mid term:<br />no mid term<br /><br />final exam:<br />as this semester is purly online mode, the exams are also online, but unlike other course like comp 1021, Yang didn't require us to turn on any cameras during exam,<br /><br />instead, he require an oral exam after the final<br /><br />it is actually a 1-to-1 online interview to ask you how you derived the answers in your final exam, its for anti-cheat purpose.<br /><br />Yang said that if the exam were held face to face mode, then no oral exam is needed",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nyZyj8zBTBtxlSqVmQ8icGvD60oKtHUc",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 617,
                    "name": "YANG, Zhi Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hr8259",
            "date": "Jan 26, 2022",
            "title": "[late review] Not THAT bad on zoom",
            "comment_content": "Same as 1114 plus some quantum mechanics stuff, which is not tested. Teaching pace was extremely fast due to the amount of content.<br /><br />Even though this is a 1000-level course, it assumes that students know multivariable calculus (which is not the case for everyone-including me). If you are Year 1 and you haven't studied that before, don't take this course for now.<br /><br />The reason I give a C here is because the course assumes that student already know MATH2023 stuff (divergence, curl stuff) which really confuses students. If those are really that necessary, why don't make it a pre-requisite?",
            "comment_teaching": "Not bad but not good either. Voices a bit dull which may lure you to sleep, but it was online lecture anyway so you can do whatever you like. One complain is that he didn't really write anything in class and just talked about the powerpoint slides, which made it hard to follow. And again, he assumed too much on our math background.<br /><br />On the last class, there were 6 participants on zoom.",
            "comment_grading": "10% HW (you get full mark as long as you do it and write sufficient steps) me: 10/10, mean should be around 9<br />90% final - 3 hour take-home exam + 15 minute oral test (yes) in which he reads your script and ask you about why you write some particular steps to avoid cheating<br />Fortunately curl and div were not tested. Final is not too difficult but one of the questions have a bit confusing phrases<br />me: score not released, but according to professor in the oral test, I made some small calculation mistakes and therefore messed up the answers in one of the questions.<br />Final grade: A<br />The grade is reasonable for me, but the grading is pretty opaque. Mean/score of the final remains mystery.",
            "comment_workload": "Light for honor course. Just about 10 questions from the textbook, which are mostly pretty easy or with answers available online.<br /><br />Tip: since you don't need to use Mastering Physics to do the HW, you can just ask the TA to post the questions on Canvas (I did), or borrow a TB to do the questions. That way you can save the $$$ for subscription of MP. LMAO",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "TwRfjpou6XscZ3if4t4BiXXDH3OcSU8x",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 617,
                    "name": "YANG, Zhi Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wenziqi",
            "date": "Feb 17, 2019",
            "title": "",
            "comment_content": "是1312的延续，关于磁场电场等等，但是比1312难多了，不要上完1312信心爆棚直接想都不想来上这课",
            "comment_teaching": "一般般，在所有老师里算是个正常水平吧",
            "comment_grading": "非常烂龟因为太难了，Arange不会超过1/5（注意这是honor堂）",
            "comment_workload": "作业每周都有，但是很简单，考试会非常难",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SyhSTHHSguFAQffLyBPPvEBrXNw77jFJ",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 605,
                    "name": "LIN, Nian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "EJY",
            "date": "Aug 18, 2016",
            "title": "Interesting",
            "comment_content": "It's about general physics, with the content almost the same as PHYS1114. However, this course concentrate more on the proving of some well-known theories and have more calculation.",
            "comment_teaching": "Professor's CHENGLISH is quite attractive but may be difficult for international students to understand sometimes. His teaching materials are sufficient, though. He also loves to solve the students' problem and confusion.",
            "comment_grading": "It's easy to have a high grade if you follow the instructor's advice.",
            "comment_workload": "Faily heavy, to some extend. Besides doing homework, we also need to study the materials before we attend classes. Otherwise, we would definately be left behind.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QY5aswF3AJEwLLoFid22ERGxYE20n3pC",
            "semester": "2013-14 Spring",
            "instructors": [
                {
                    "id": 605,
                    "name": "LIN, Nian",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Wen Han",
            "date": "Aug 01, 2015",
            "title": "",
            "comment_content": "The course is essentially a rehash of PHYS 1413. It covers all of the content taught in 1114 except for AC circuits and geometric optics and also covers some introductory quantum mechanics.",
            "comment_teaching": "Professor Lin has set up the course to be more of a self study course. He expects all of the students to study the lecture materials before attending class and spends most of the lecture glossing through the notes and raising thought provoking questions. While his teaching method may increase one's interest in EM, students who lack the motivation to self study will perform poorly in class.",
            "comment_grading": "This course doesn't have a fixed grading scheme as a result of the midterm fiasco. The average grade for this course is ~A- which is standard in a physics honors course.",
            "comment_workload": "The workload for this course is fairly heavy. In addition to the self studying he expects us to do, Professor Lin has also assigned weekly written homework and an online interactive homework.<br /><br />The written homework only requires students to pick 3 &quot;hard&quot; questions from the textbook (University Physics) and answer them. For each question, students are required to draw extremely detailed&nbsp;&nbsp;diagrams otherwise, 40% of their marks will be deducted. Furthermore, students are required to only use knowledge from this course and must show each every step in their answer.<br /><br />The online interactive homework is even more infuriating. It is essentially a JavaScript based online experiment that we need to conduct. Students need to be very precise with their cursor to get sufficiently accurate data for the system to mark your answer as correct.<br /><br />The midterm for this course is the most challenging midterm I have taken. The midterm for PHYS 3053 is infinitely easier.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "K2mVDWnpdjayrhfbFUYhVOsulBnnzzI5",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 617,
                    "name": "YANG, Zhi Yu",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Excalibur",
            "date": "Sep 04, 2018",
            "title": "A nice course for those doesn't like plugging numbers",
            "comment_content": "It is similar to PHYS 1114 with a few additional materials<br />- Electrostatics: Coulomb's law, Gauss' law, electric field, and potential<br />- Capacitor and dielectric property<br />- Resistance, Ohm's law, Kirchoff law, DC Circuit<br />- Magnetostatic: Biot-Savart, Ampere, etc. <br />- Magnetism in matter<br />- Inductance, AC source, RLC circuit<br />- Electrodynamics<br />- Properties of light<br />- Physical optics: Interference, Polarisation, Diffraction, etc.<br /> - Introduction to quantum mechanics: some important discovery like the photoelectric effect<br />-&nbsp;&nbsp;(Does not included in the final) Schrodinger equation and some its applicable result<br /><br /><br />Overall it is good but it would be better if geometrics optics are taken into the course consideration",
            "comment_teaching": "I only came to his first few classes. As far as I know, the class is totally boring. I think it is a good idea to write down the formulas on the whiteboard explaining the idea",
            "comment_grading": "The grading might be bad because if you miss the concept you will lose many marks, however, if you make a slight calculation error, then you will get small deduction. As for its final grade, I think he is quite generous even though you messed up in one of the tests (as long as it is reasonable).",
            "comment_workload": "the workload seems to be quite heavy because there are weekly assignments you need to write on the paper and submit to TA during the tutorial session. The exam difficulties for midterm and final are medium and easy respectively. Beware, there is some numerical calculation for final.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mzjLNvbC2xPvZyQYW2YqYZ0AKr2kBup3",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 605,
                    "name": "LIN, Nian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ChuaWanZhen",
            "date": "Jun 09, 2016",
            "title": "",
            "comment_content": "The content is basically similar as PHYS 1114 except that Professor Lin Nian included some fundamental concepts in quantum mechanics. Alternating current circuits is not required. For quantum mechanics, he does not require us to fully understand the concept but he wanted us to know how to solve the Schrondinger Equation(basically it is solving the second order differential equation). So, you need some math here and the exam questions on quantum mechanics is just solving equations and drawing a graph (its all math). So, that is not much to worry about although the concept on quantum mechanics is quite hard",
            "comment_teaching": "I think Professor Lin Nian is a very good professor. He did not spoon feed students. He gave us some hints to solve a problem and would expect us to work it out ourselves. We can ask him again if we do not know how to solve it. If you have any questions, just ask him directly, don't hesitate about it. He is very approachable and friendly. He is always in his office (I can find him every time)",
            "comment_grading": "I think the grading is quite good. Professor Lin Nian emphasized much on a student's effort rather than his or her standard. Although I have never participated in any APHO or IPHO or any physics competition, I put in a lot of effort in studying this course and ask him a lot of questions. I did not do well in my midterm (below mean) due to the lack of time given and I was careless but I think I did quite well in the finals (we do not know about the mean and sd). He gave me A range. I think the professor also take into account your in class performance.",
            "comment_workload": "The workload is appropriate. It depends on how much you want to work on it as the questions are chosen by ourselves.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yF39LZ5QEisv3Wq0BOyFiyWPV2fS3jY4",
            "semester": "2013-14 Spring",
            "instructors": [
                {
                    "id": 605,
                    "name": "LIN, Nian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "小龜",
            "date": "Aug 09, 2015",
            "title": "平生不讀hon phy II, 徒稱phys人也枉然：重點在mid-term",
            "comment_content": "General Phys II,就是EM基本版,內容以溫習DSE為主，很多東西都是淺嘗即止（沒有differential equation和algebra的東西難度可以想象）。<br />但是，隨堂會教一些multivariable calcalus。<br /><br /><br />內容從coulombs law到RLC 到 diffraction/interference。最後因為林念說這課舊制課程其實包括Quantum Mechanics所以最後又教了一個月不知道哪兒來的Schrodinger equation，fourier transform(其實就是PHYS 2022下半學期的課程）",
            "comment_teaching": "教授：<br />教授的用心程度沒法批評，課後你總會見到一大群人圍著教授問一個小時問題，很多問題很奇怪但很有趣。如果有東西不懂儘管問，他不會嫌你煩的。<br /><br />教材：<br />沒有notes,只有powerpoint。說實話他教材準備得有點亂，至少如果你只溫習powerpoint你會死得很慘（據我所知應該沒有人這樣做）。要找note看mit的8.02。<br /><br />風格：<br />根據林念的說法，因為這是honor course，他其實預期你上課前就把教材讀懂。他希望上課時是一個discussion session 而不是 teaching session。上課他會提出很多有趣（奇怪）的題目讓你做，然後就是discuss with your neighbour。總之沒有預習你就自求多福吧。<br /><br />（接下來一年是張文峰在教，張文峰是一個很好的instructor,但沒有人能教出林念的味道，有點可惜了。如果林念再教這個course，不要擔心什麼，讀吧......）",
            "comment_grading": "林念很注重同學平時表現，平時interactive+written homework占了評分的一半，極其誇張，所以平時請好好表現，盡量拿高一點。<br /><br />考試很神奇，神奇得我不敢評價，但不要期望太多，隨機性太大，這個稍後再提。<br /><br />grade也很神奇（不含貶義），明明覺得考得像XXXX一樣結果grade出來你會覺得這半年值了。",
            "comment_workload": "Weekly: written hw+interactive hw<br />Exams<br /><br />Written homework:<br />format:每星期自選6題書本練習做，教過的課題選3題（challenging problems expected)，下堂會教的課題選3題（預習）。這個書的練習基本你會找到答案，但還是盡量自己做吧...<br />ps: 林念教我們的，就是無圖無真相，解題沒有畫graph直接扣一半分，不少同學頭兩份功課被扣得...<br />開始的時候TA還改的比較嚴，後來估計workload太大已經隨便給滿分了...<br /><br />Interactive（好像只有林念在用）：<br />這是一個簡陋的java軟件。<br />這是一個模擬實驗的平台。<br />你要自己take data,自己做analysis,自己找答案....<br />你要找一堆隊友避免分數被無聊的錯處扣光（比如小數位）....<br />很好玩，很多bug,很不人性化，很讓人抓狂，結果最後一堆人放棄治療去查java code...T<br />Tips:不要做estimation,請拿間尺對著熒光幕去量。<br /><br />Examination<br />林念教這個course的賣點在於mid term。<br />首先，林念是神。因為林念很神，所以這個course很神奇。<br />其次，因為讀的同學很神，所以mid-term很爽，但也很悲哀...<br />再因為mid-term很神奇，所以我要保密...<br />如果有一年林念再教這個course，然後通知你mid term分兩個時間考，期待吧.......<br /><br />Final正正常常open book exam，不值一提。",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 5,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}