{
    "error": false,
    "course": {
        "id": 1315,
        "subject": "PHYS",
        "code": "4051",
        "name": "Quantum Mechanics II",
        "description": "This course is mainly on approximation methods in quantum mechanics. Topics include stationary state perturbation theory, variational principle, WKB method, time-dependent perturbation theory, emission and absorption of radiation, adiabatic approximation and geometric phase, scattering theory.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1610,
            1510,
            1410
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"PHYS\" data-code=\"3031\" href=\"/review/PHYS3031\" target=\"_blank\">PHYS 3031</a>/<a class=\"course-link\" data-subject=\"MATH\" data-code=\"4052\" href=\"/review/MATH4052\" target=\"_blank\">MATH 4052</a>, AND <a class=\"course-link\" data-subject=\"PHYS\" data-code=\"3036\" href=\"/review/PHYS3036\" target=\"_blank\">PHYS 3036</a>/<a class=\"course-link\" data-subject=\"PHYS\" data-code=\"3037\" href=\"/review/PHYS3037\" target=\"_blank\">PHYS 3037</a>",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.56,
        "rating_teaching": 4.89,
        "rating_grading": 4.67,
        "rating_workload": 3.67,
        "review_count": 9,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 606,
                "name": "LAW, Kam Tuen",
                "count": 8
            },
            {
                "id": 608,
                "name": "LEUNG, Pak Wo",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "LMH0CGO5LEXHtLkXPMBGg0JxJ8BjRItw",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 606,
                    "name": "LAW, Kam Tuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "liwingyankobe",
            "date": "Jan 04, 2018",
            "title": "Enjoyable, challenging, inspiring, must-take",
            "comment_content": "The content was deviated from the syllabus described in the description of the course. I aduited this course in 2017 Fall and took it in 2018 Fall, and the content was actually changed quite a bit. Apart from the content in Griffiths' textbook (no WKB though), he talked about many advanced topics in Shankar's textbook such as angular momentum and rotational invariance, Dirac equation, second quantization (somehow informal) and Bloch's Theorem. He talked about path integrals only in 2017, but he added entanglement and tight-binding model in 2018. He also talked more on applications of Berry phases, including quantum Hall effect and topological phases. It can be quite hard to many students, but one passionate in Physics, especially QM would definitely enjoy his course. In my opinion, it helped me so much in other further studies. By the way, if you like this course, I recommend you to take/audit his Solid State Physics courses (5170 and 5370) which are even more exciting!",
            "comment_teaching": "Prof Law is enthusiastic in teaching. He explained the content clearly, especially he emphasized some details ignored by the textbooks. He also intended to teach the concepts behind the theory instead of performing boring computations. He encouraged students to think more by asking questions very often in the lessons. In addition, I think he is a kind professor as he always answered my questions patiently after lessons.",
            "comment_grading": "Well, I do not know so much about grading since I got very high marks in the exams. However, Prof Law mentioned that since this was a course with relatively small number of people, most people could get A range. I believe one can get a good grade easily if he or she performs &quot;normally&quot;.",
            "comment_workload": "Several questions per week with various difficulties. The simplest ones were simple questions in Griffiths' textbook. The difficult ones could require hours to finish, but they were to encourage one to think more and search for extra information instead of tedious computations (not the case in exams though). For example, one question was about using Dirac Equation to calculate the Landau levels of graphene layers, and another one is to calculate the topological phases of a topological insulator with square lattice using Berry phases and tight-binding model. They are indeed difficult and beyond the scope of QM2. However, for one passionate in Physics, it is definitely worth spending time.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 6,
            "vote_count": 7,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0brXUffsOkfomlA7qv87kCKpnF9eXkNP",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 606,
                    "name": "LAW, Kam Tuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tesserakt",
            "date": "Dec 27, 2017",
            "title": "Advanced QM in disguise",
            "comment_content": "In contrast to Prof. Leung's QM II, which focuses more on perturbation and other techniques to approximately solve QM problems, Prof. Law's one focuses much more on the detailed theories and some more advanced stuffs, owning to his theoretical solid states background. There are:<br /><br />1. A revisit of angular momentum and spin (Shankar Ch. 12, 14 and 15)<br />2. Dirac equation<br />3. Time-independent and dependent perturbation theory, with typical applications like fine structure and helium atom<br />4. Quantization of electromagnetic field (not included in final exam)<br />5. Scattering<br />6. Berry phase<br />7.&nbsp;&nbsp;Feynman's path integral",
            "comment_teaching": "Prof. Law is an enthusiastic teacher about the subject and is willing to talk to students at length after class to address their questions or know about their situations. Being a theoretician, he also attempted to introduce some of the more underlying theories behind, most notably the angular momentum as a generator of rotation, and other advanced topics like Dirac equation and path integral. <br /><br />Since he does not distribute any notes, you will need to jot notes yourselves. Luckily, he speaks quite slowly that it should not be difficult (and jotting notes do really help understanding the mathematics behind)<br /><br />And by the way, prepare for lots of advertisements about his Solid State II",
            "comment_grading": "Prof. Law said that he would grade according to the rank. Even though no statistics was released, the grading seems to be decent since the class is so small (~20 students). I got an A+ as one of the highest students in the final exam, while some of my colleagues who got around 10 marks lower than me get an A.<br /><br />Beware, though, as the grading scheme is quite funny. There are two options:<br /><br />10% homework +40% midterm+ 50% final<br />10% homework+90% final<br /><br />Since the final is much easier than midterm (due to the lack of time limit), the result is that most students do the all-in final thing.",
            "comment_workload": "There is a homework set every week which consists of mostly 2-3 questions. The difficulty varies from simple Griffiths problem to rather lengthy and abstruse stuffs that necessitates hours to solve. <br /><br />Otherwise, the content is not easy either. To understand the materials better, it is recommended to read Shankar's textbook.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xBnm7YBgpbkhBTSyl7Xx6PZ26FEfid4K",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 608,
                    "name": "LEUNG, Pak Wo",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "H_Barnes",
            "date": "Jan 10, 2017",
            "title": "&quot;Dirty&quot; quantum mechanics made easier by Prof. Leung",
            "comment_content": "This course is mainly about the &quot;dirty&quot; part of quantum mechanics because it is so hard that we have to apply approximation methods. Things like stationary state perturbation theory and the variational principle are taught to apply on hydrogen/helium atoms. The fine structure and the spectrum of hydrogen atom are taught as well but the course is without the WKB method. Refer to chapter 8 of Griffiths: Introduction to Quantum Mechanics 2nd Ed. <br /><br />More things like emission and absorption of radiation, adiabatic approximation and geometric phase, scattering theory are taught after the mid-term exam.<br /><br />Attached is a copy-and-paste of the Canvas page for the course syllabus.",
            "comment_teaching": "Prof. Leung is famous for his excellent way of teaching. He made this course simple by using different tools and similes to make his explanations clear;&nbsp;&nbsp;I am still impressed by how he deployed a Chinese lantern to explain and simulate the lift in energy levels in the stationary state perturbation theory; He once curled up a piece of paper to explain what a solid angle is in a lecture of scattering theory. <br /><br />He also made the math in this course easier to understand by telling stories or making jokes on it: He said 137 is not only the fine structure constant but also the room number in which Wolfgang Pauli passed away. <br /><br />Sometimes he talked about his own story with other physicists like he missed the chance to meet Richard Feynman in the US, meanwhile teaching some extra knowledge about physics outside the scope of this course. <br /><br />He would also make a quick review of the previous course PHYS3036 and linear algebra to refresh your memory. <br /><br />Overall his teaching is really good but you have to pay close attention to what he says and writes on the board because he talks quite fast or else you will easily get confused.",
            "comment_grading": "Either one formula to calculate the final grade: <br />Homework 10%<br />Midterm 30%<br />Final Examination 60%<br />OR<br />Homework 10%<br />Final 90%<br />If Midterm Score &lt; Final, use the latter one. <br /><br />Overall fair grading: not too good nor too bad, final exam score at mean = B range. No special comments.",
            "comment_workload": "One homework per week (basically some problems from Griffiths for practice) so not too much workload here. <br /><br />But it takes lots of time to review the notes and carefully study the math and the meaning after the lectures so it is quite a workload in this part.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "4w8ADeMLIQ7oMCOP2pmoUX3iXHOTowuN",
                    "name": "Course Syllabus",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "kSso14SzMW6mMZfHzm6sgtsj10PXsUdt",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 606,
                    "name": "LAW, Kam Tuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Philosophy_Cat",
            "date": "Jan 04, 2023",
            "title": "Very 靚 grade",
            "comment_content": "1. Orbital angular momentum<br />2. Spin angular momentum<br />3. Addition of angular momentum<br />4. Tensor products<br />5. Time-independent perturbation theory<br />6. Time-dependent perturbation<br />7. Scattering problem<br />8. Berry phase<br />9. Band structure<br />10. Path integral formulation (just a brief introduction)<br /><br />Three textbooks were used, incluing Griffths, Shankar’s Principle of Quantum Mechanics and Sakurai’s Modern Quantum Mechanics. The content is comprehensive yet difficult (e.g. I still don't know what tensor products are). I guess it is normal to feel puzzled at lectures, while the problems of midterm and final exams look much more normal (and difficult at the same time).",
            "comment_teaching": "Prof. Law is passionate in teaching, he always asked questions of students sitting at the first row (that's why I prefer sitting a few rows behind lol). He is also fluent in English and always trying to explain things clearly.<br /><br />The TA was very lenient in marking the homework. He always gave full score given that you had handed in the homework on time.",
            "comment_grading": "The midterm and final exams were challenging. 1 and 2 double-sided A4 cheatsheet were allowed respectively in the midterm and final. Your are adviced to write down the position and momentum in terms of ladder operators, and also the expansion of \\bra{n}(a+a^\\dag)^4\\ket{n} on your cheatsheet, it might be very useful.<br /><br />Homework 15%<br />Individual Project 15%<br />Midterm 30%<br />Final 40%<br /><br />The grading is extremely good. Out of 15 people there are 3A+, 7A, 2A- and 3B+. Prof. Law also said something like 'you don't need to worry about the grade in this course'.",
            "comment_workload": "The workload is fine, just an individual project and weekly homework with problems extracted from textbooks, which you can find solutions online easily. Sometimes the problems could be lengthy, and I once used up 8 double-sided A4 papers for 1 homework set.<br /><br />To alleviate our academic pressure, Prof. Law decided to remove the report part from the project. We only needed to give a 10 minute presentation during the study break.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oAtesZtsXDNHGONRMWe2Cb4hX2x5wGn8",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 606,
                    "name": "LAW, Kam Tuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Raiymbek718",
            "date": "Jan 03, 2022",
            "title": "For those who plan to go in condensed matter field. Generally good to understand qm better.",
            "comment_content": "1. Rotations, angular momentum<br />2. Addition of angular momentum, entanglement.<br />3. Relativistic QM(aka Dirac equation), origin of spin.<br />4. Time-independent Perturbation Theory<br />5. Various approximations (Fine structure, variation principle, Zeeman)<br />6. Time-dependent Perturbation<br />7. Scattering problem<br />8. Berry phase<br />9. Band Structure<br />My main concern is the content of the course. First part, before midterm is extremely challenging, mostly taken from Shankar and Sakurai. You have no clue what is going on, you were not prepared to study tensors and various problems regarding symmetry. All of that has to do with Advanced algebra that you do not know. But it is indeed very exciting and you somewhat understand the formalism of quantum mechanics better.<br />The second part is perturbation theory, approximations and some more advanced condensed mater theory topics. I personally find it not exciting as the first part. Though might be useful if you want to get involved in chemical physics.<br />So, this courses contents to me was problematic. As I was having a hard time in the first part of the course, where I wasn't prepared for all math, yet it was exciting. The second part was easy conceptually, problems were not hard but seemed like a bullshit for most of it and I didn't find it interesting at all.",
            "comment_teaching": "Professor Law is very enthusiastic about teaching, always engages with class, has a very good English and tries to explain clearly, though doesn't help some times. One issue is the style of content organization. I didn't like the way class ppt were organized as we constantly jumped back and fourth between Shankar, Griffiths and Sakurai. He also simply adds parts of the textbook to the slides, which is not really helpful.",
            "comment_grading": "Grading was very good. I didn't do well in midterm, got 30 on midterm and 65 after correction. Did most of the homeworks and solved 4 questions in final, though score wasn't released I expected 60-70 points in final. Ended up in B. Although was below mean in midterm didn't ace homeworks and didn't do exceptionally well in finals. Overall most of students got A and B. Grading is generous.",
            "comment_workload": "Lots of homework is given every week. Some home works have 5 pages long question where you need to do eigenvector calculation for a stupidly big matrix and repeat for spin 1 particle which takes more than 10 pages. The homework problems sometimes ask you to refer to the book of condensed mater theory and it takes 10 pages again.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PA0HXDPIFipaDHlk8ThAzQMjh461pN7p",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 606,
                    "name": "LAW, Kam Tuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Zechidlin",
            "date": "Dec 29, 2021",
            "title": "Must take, a course that you will not regret taking it",
            "comment_content": "Addition of angular momenta; Tensor operators (optional, will not be covered in exams); Dirac equation (optional); Perturbation theory: time independent non-degenerate/degenerate, time dependent; Variational principle (only half of a lecture), quantization of EM field (optional); Adiabatic theorem &amp; Berry’s phase; Scattering; Landau level problems, Block’s theorem, energy band; Path integral (optional, very brief introduction).<br /><br />Since professor himself is doing condensed matter physics, you can see that the latter part of this course inclines to the related topics in the respective field. However, final exam did not test the problems in Bloch’s theorem part, but Landau level problem was emphasized a lot and was tested. No WKB, but pretty much everything else in Griffths 2nd edition of intro to qm was covered.<br /><br />Some comments on the content: scattering is nothing more than SE with boundary conditions, Landau level problems are no more than ‘enhanced’ simple harmonic oscillator problems, addition of angular momenta is simply change of basis &amp; ladder operators. <br /><br />Four textbooks were used: Griffths, Shankar’s Principle of Quantum Mechanics, Sakurai’s Modern Quantum Mechanics, and another book Girvin’s Modern Condensed Matter Physics (mostly a reference). If you can master problems in Shankar, you will be fine. Griffths is but the least requirement.",
            "comment_teaching": "Many professors in Physics department are all very passionate. Prof. Law is definitely one of them, you will never feel boring during his lectures. Though I have to say that his slides were a little bit 随意, lol.",
            "comment_grading": "Very, extremely, unbelievably good grades.<br />Another comment on this year’s same course can be representative, which you can see by scrolling your screen up or down. I got pretty much the same score as that classmate in midterm, 45/100 and 73/100 after correction, hw mostly 9/10 or 10/10, final score was not released, ended up with an A. So final indeed matters. I have to say the final exams’ problems were…weird. Every problem you know how to solve them, but the calculation was very tedious and I doubted my correctness about every single problem. By the way, there were 6 problems in total, but you only need to complete 5. Two grading schemes… well you can read from another review, so I will be lazy here!<br /><br />Another comment: midterm may seem to be daunting, but actually…it is not that hard. When I was asked to correct the mistakes, I took 1 hour to finish the problems correctly that I did not know how to solve during the 1.5 hrs exam. So take it easy, be patient and calm and you will be fine. If you screwed up the midterm, take what you have lost back in final, as you can see a rubbish like me can still obtain a good grade after a rubbish mt.",
            "comment_workload": "You have two kinds of hw problems: Problems from textbooks, which can be a lot in amount but relatively easy; problems that have titles with them, which might be few but can be very tough. Conclusion: you calculate a lot. or you think a lot, or both. This course is not an easy one, so be ready to put some time in it.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "e6Wj8h6bYTFP3Emaf43B8vrHQ1Co81qv",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 606,
                    "name": "LAW, Kam Tuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "_NattU_",
            "date": "Dec 28, 2021",
            "title": "",
            "comment_content": "We had 3 main reference textbooks: Griffiths, Shankar, and Sakurai (Just google their names+'QM' and you can find a free pdf). The lecture notes contain extracts from these textbooks and the HW problems are mostly referenced off of them too. In addition, Prof. Law wanted the students to get a taste of condensed matter and other advanced stuff so he included some out-of-textbook content (they were actually from some graduate-level textbooks and literature lol)<br /><br />A summary of the contents is given below:<br /><br />1. Orbital Angular Momentum <br />2. Spin Angular Momentum <br />3. Addition of Angular Momentum <br />4. Tensor products <br />5. Time-independent Perturbation Theory <br />6. Time-dependent Perturbation <br />7. Scattering problem <br />8. Berry phase <br />9. Band Structure <br /><br />While taking this course, you might notice that some of the topics overlap in the textbooks. Disclaimer: You need to study all of them and get familiar with each of their techniques/methods. Prof. will indicate which ones you need to focus on so it's not like you need to study the 3 entire textbooks though.",
            "comment_teaching": "He's an enthusiastic and passionate lecturer. Friendly demeanor and nice English. Most importantly, he responds to emails and inquiries very quickly.",
            "comment_grading": "Two grading schemes:<br /><br />Scheme 1: Homework 20%, Midterm 30%, and Final 50%.<br />Scheme 2: Homework 20%, Final 80%. <br /><br />Whichever scheme results in a higher grade will be employed. Exams are closed book but you are allowed to bring in an A4 sized cheat paper (both sides)<br /><br />Midterm coverage: addition of angular momentum, the effect of rotation operators, perturbation theory (including degenerate perturbation theory).<br /><br />(Note: After the exam, prof later announced a midterm makeup and we would be able to re-do the problems where we lost marks and gain half marks. The makeup was takehome and you had a week to do it)<br /><br />Final coverage: Time-independent perturbation, Time-dependent perturbation, Scattering, Berry curvature, Landau levels. There were 6 questions in total and you could answer any 5.<br /><br />HW scores (out of 10)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;My score | Mean<br />HW1:&nbsp;&nbsp;10 | 9.64<br />HW2:&nbsp;&nbsp;12 | 10.46 (there was a question worth 30% bonus)<br />HW3:&nbsp;&nbsp;10 | 8.89<br />HW4:&nbsp;&nbsp;&nbsp;4&nbsp;&nbsp;| 4.82&nbsp;&nbsp;(out of 5)<br />HW5:&nbsp;&nbsp;&nbsp;5&nbsp;&nbsp;| 4.82&nbsp;&nbsp;(out of 5)<br />HW6:&nbsp;&nbsp;10 | 8.64<br />HW7:&nbsp;&nbsp;&nbsp;5&nbsp;&nbsp;| 4.39 (out of 5)<br />HW8:&nbsp;&nbsp;10 | 8.09<br />HW9:&nbsp;&nbsp;&nbsp;&nbsp;8 | 7.68<br />HW10:&nbsp;&nbsp;10 | 8.5<br />HW11:&nbsp;&nbsp;&nbsp;&nbsp;5 | 7.18<br /><br />My midterm score was originally 44/100 (lmao, the class overall performed very poorly). After the makeup, I got 72. (i.e. I correctly answered all the questions I had previously wronged and scored half of the remaining 56 marks: +28)<br /><br />Midterm mean after makeup was 70.8, with the highest score being a 97 and 29 being the lowest.<br /><br />The final scores were not released but if I had to guess, I probably scored in the 60s or 70s. My grade was a B+.<br /><br /> Prof. actually announced everyone's grades via email hhh (with SIDs instead of names, to have some sort of privacy I guess). There were 5 A+s, 5 As, 5 B+s, 8 Bs, 3 B-s, and 2 C+s. None of that curved BS. If you do well objectively, prof will give you an A range. ( I wish I got A- though lmao but my midterm scores talk for themselves)",
            "comment_workload": "Homework sets are assigned on a weekly basis(11 in total). They mostly consist of textbook questions (ofc, from all 3 textbooks in some cases) and take a considerable amount of time to solve. Fortunately, the TA is rather generous with his grading and will overlook any minor mistakes and give you a decent score as long as you implement the correct method. <br /><br />Much like its EM counterpart, this course requires you to do the exercises properly to learn the materials. So it can't be helped that the workload is pretty high. Still, it is certainly taxing and takes a chunk of your time.<br /><br />Other than the HW, what's really frustrating and time-consuming is the fact that you need to learn the materials from 3 different textbooks (especially, Griffiths and Shankar; they have different symbols/techniques and you need to know both). Expect to spend your weekends on this course. Add oil!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gE60Dj6PmgGYyP4HeJQjQpRMjgu8TADa",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 606,
                    "name": "LAW, Kam Tuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "RickyPang",
            "date": "Mar 06, 2020",
            "title": "Consolidated your knowledge in Quantum Mechanics",
            "comment_content": "The content of this semester may differ from others.<br /><br />1. Angular momentum and spin<br />2. Entanglement<br />3. Time-independent and dependent perturbation theory<br />4. Quantization of electromagnetic field( Just for fun, will not be examined)<br />5. Bloch theorem and Graphene bilayer<br /><br />The textbooks for this course are Shankar and Griffiths.",
            "comment_teaching": "Prof Vic Law is the best Professor in teaching&nbsp;&nbsp;that I have encountered in physics department. He explained the content in a very very clear way. Every lecture, he guided us to think the problem and constant raising questions. Indeed, I enjoy listening to him every lecture. <br /><br />Besides Prof Law, our TA John Sou is ver responsible. He typed the solutions in latex and explained every question very clearly. Besides, Prof Law constantly added questions into homework problem during lectures and John make those questions understandable and do-able for students. Without his hints and explanation in homework problems, we may need lots of effort to understand the question.",
            "comment_grading": "The grading is good in this semester. However, I don't think it is a good idea to use this semester grading for your reference. Due to the current situation ( social movement and outbreak of coronavirus), we do not have proctored midterm and final. Both midterm and final are take-home. Therefore, the mean will be very high.<br /><br />For me:<br />HW1: 95/100 ( mean = 88.3)<br />HW2: 93/100 (mean= 88.2)<br />HW3: 89/100 (mean = 76.5)<br /><br />Special Assignment1: 83/100 (mean = 79.3) <br />Special Assignment2: Not published <br />Special Assignment3: Not published <br /><br />Final exam: Not published<br /><br />Final letter grade: A",
            "comment_workload": "The workload is normal and you will have a feeling that doing those homework is very very beneficial. In fact, the homework is not very hard, they are all basic stuff in QM2. Each homework contains 6-7 questions and you have roughly 2 weeks to compute.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xvwOM8AQriATNz1IOa99A3lggTyxS4Ng",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 606,
                    "name": "LAW, Kam Tuen",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "billy1996",
            "date": "Dec 27, 2018",
            "title": "",
            "comment_content": "1. Angular momentum and spin<br />2. Entanglement<br />3. Dirac equation<br />4. Time-independent and dependent perturbation theory<br />(fine structure of Hydrogen atom and weak Zeeman effect)<br />5. Quantization of electromagnetic field (not included in final exam)<br />6. Scattering<br />7. Adiabatic theorem (berry phase, aharonov bohm effect)<br />8. Bloch theorem<br /><br />midterm去到perturbation<br />final主要考perturbation之後<br /><br />內容有趣，唔明可以睇Shankar，Griffith",
            "comment_teaching": "個prof真心教得好<br />每次落堂之後都留左好耐解答我地d問題<br />所有上堂內容好清晰",
            "comment_grading": "都係hw,midterm同final<br /> <br />功課唔算太難<br />唔識可以搵TA幫手<br /><br />midterm同final係homework level<br />識做功課同Griffith，有睇過Shankar應該ok<br />midterm後，prof仲叫我地改正，可以加分<br /><br />重點：有cheat sheet，唔洗背formula，所以明左內容就ok<br /><br />至於grading，聽講7x就有A-，神靚grade",
            "comment_workload": "平均一星期一份功課<br />難度有d係Griffith level<br />有d係prof上堂即興assign 所以有source都未必有用<br />仲要有d係計算好難 所以有時要多d時間<br /><br />每堂個訊息量都唔算大<br />容易handle",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}