{
    "error": false,
    "course": {
        "id": 1402,
        "subject": "PHYS",
        "code": "4071",
        "name": "Big Bang Cosmology and Inflation",
        "description": "In this course, a systematic introduction to modern cosmology will be provided, with the topics including: Robertson-Walker metric and Friedmann equation, spacetime evolution of the Universe, thermal history of the Universe, Big-Bang nucleosynthesis, cosmic microwave background, dark matter and dark energy, inflation. It aims at enabling students to catch up with the progress in cosmology in a timely way, and appreciate the beauty of the science on the Universe.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2030,
            1930,
            1830,
            1730,
            1630,
            1530
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"PHYS\" data-code=\"2022\" href=\"/review/PHYS2022\" target=\"_blank\">PHYS 2022</a> AND (<a class=\"course-link\" data-subject=\"PHYS\" data-code=\"2124\" href=\"/review/PHYS2124\" target=\"_blank\">PHYS 2124</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2351\" href=\"/review/MATH2351\" target=\"_blank\">MATH 2351</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2352\" href=\"/review/MATH2352\" target=\"_blank\">MATH 2352</a>)",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.63,
        "rating_teaching": 4.13,
        "rating_grading": 5,
        "rating_workload": 4.13,
        "review_count": 8,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 625,
                "name": "LIU, Tao",
                "count": 6
            },
            {
                "id": 781,
                "name": "WANG, Yi",
                "count": 2
            }
        ]
    },
    "reviews": [
        {
            "hash": "A3lDNGDcqLktvu9uCYhuQWpR8anFOKGh",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 625,
                    "name": "LIU, Tao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "H_Barnes",
            "date": "Jun 07, 2016",
            "title": "In-depth analysis in cosmology",
            "comment_content": "Big-bang theory, space-time evolution, dark matter and inflation are covered, which are the different analysis/events about cosmology and the early universe. <br />It provides a good analysis into cosmology and the universe-evolution model.",
            "comment_teaching": "Teaching is good that Tao can explain the concepts logically and systematically using analogy of known idea. The notes are also easy to understand, even though the concepts are really hard per se. <br /><br />Also it is important to jot down what Tao says in class because this is very important during the revision before the exams. As soon as Tao gives explanations to the phenomena/tendency/meaning of the graphs in the notes, it is particularly important to note them down because these will appear in the exams very straightforwardly. <br /><br />Tao sometimes will make some jokes/ask questions to grab your attention so that you can catch up with the progress. And at a point in the class he will ask everyone to take out a piece of paper for a sudden quiz! Make sure you pay attention to the class and make a good guess for the quiz. <br /><br />His spoken English is not very good so it takes time to understand every sentence that he says in class.",
            "comment_grading": "Very good grade. Even got a A range for course score at around 63. <br /><br />The exams are easy to handle that it is the exact copy of the materials given in the notes and it asks for some explanations. So it is good to understand the meaning of the graphs. So if you have a good understanding then it is not a big deal in the exams. Above mean equals very good grade.",
            "comment_workload": "Average workload: 1 assignment after 2 classes. The question, basically some proves/calculations/derivations, is not easy that you need a good understanding beforehand.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "lWxPF4DbleJK3DA4PzL8INNF7RWbg9Bu",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 625,
                    "name": "LIU, Tao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pepper409",
            "date": "Jul 29, 2023",
            "title": "Derive the equation yourself for revision",
            "comment_content": "Overall quite fun to see how we construct a model for the evolution of the universe with minimal math requirement.<br /><br />1. Einstein's field equations, Friedman's equation, energy budget<br />2. Standard model of particle physics, Higgs boson<br />3. Statistical thermodynamics, entropy<br />4. Thermal history of the universe: QCD symmetry breaking, neutrino decoupling, e+e- annihilation, big bang nucleosynthesis, recombination and photon decoupling<br />6. CMB anisotropy, power spectrum, acoustic oscillation<br />7. Dark matter<br />8. Inflation",
            "comment_teaching": "He is passionate and explains wells when he is talking, but does not present well when he starts to derive on the board. He is patient to answer any questions. <br /><br />The lecture notes are very concise that it only present the tools we have to know, so we don't really have to learn fundamentally why the theory is so and focus on the interpretation and observation of the universe. No textbook was recommended so it might not be convenient if you want to dive deeper.",
            "comment_grading": "Homework (35%) + in-class quizzes (20%) + mid-term (15%) + final exam (30%)<br /><br />The exams are closed book but they contribute really only a little. Everything tested were discussed in the lecture, so just make sure you can derive the equations that has been written on the whiteboard and you will be good. <br /><br />He takes the quizzes unpredictably during the lesson to make sure we are following well. They are supposed to be intuitive concepts that should not be difficult, but sometimes I cannot follow. You still get half the point if you submit the answer but get it wrong.",
            "comment_workload": "Weekly homework that vary in their difficulties that sometimes they are really easy and sometimes they take time to derive. Most of them are to derive the equations in the lecture notes that 'left as an exercise for the readers'.<br /><br />For the exams, don't just review the homework but also derive all the other equations taught. For the quizzes you really cannot prepare anything.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ssoiv8FsWD4rIctfOsfSVF5Z0To6vEdL",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 625,
                    "name": "LIU, Tao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "_NattU_",
            "date": "May 31, 2022",
            "title": "",
            "comment_content": "1) Space-time evolution of the universe (7 lectures): Einstein field equation, Robertson-Walker metric and Friedmann equation <br /><br />2) Thermodynamics of the early universe (3 lectures): thermodynamics, comoving entropy conservation, Standard Model of particle physics&nbsp;&nbsp;<br /><br />3) Thermodynamics&nbsp;&nbsp;and thermal history of the early universe (3 lectures) EW phase transition, QCD phase transition, electro-positron annihilation, Big-Bang Nucleosynthesis&nbsp;&nbsp;<br /><br />4) Cosmic microwave background (6 lectures): recombination, anisotropy, power spectrum, the related experiments <br /><br />5) dark matter and dark energy (5 lectures): thermal relic abundance, gravitational and non-gravitational detections; vacuum energy, cosmological constant <br /><br />6) Inflation (2 lectures): flatness problem, horizon problem, relic density problem,&nbsp;&nbsp;inflation, CMB radiation polarization and the related experiments",
            "comment_teaching": "Passionate teaching but sometimes it gets difficult to follow along with the lecture because of the advanced materials. He uses a lot of illustrative analogies which makes it a bit easier. Prof. likes to write on the whiteboard and he doesn't release the lecture notes until a few days later so it might be a good idea to take some notes in class for reference. <br /><br />Prof expects us to know all the basics and remember all the stuff he taught in previous lectures... He's got a high standard. And none of us lived up to it lol.",
            "comment_grading": "Course grade is calculated based on the following assessment scheme:<br /><br />- Homework (10 in total) (40%)<br />- In-Class Quizzes (13 in total) (30%)<br />- Final Presentation (30%)<br /><br />The homeworks are assigned weekly after lectures and the deadline is always set before the next-next lecture.For instance, if we have Wed-Fri lectures, and prof releases HW on Wed, then the deadline will be the start time of next week's Wed lecture. (granted, if there's a holiday on next week's Wed, then the deadline gets extended to Fri). The Homeworks can take some time and the solutions can't easily be found online. The final HW score is calculated by excluding your worst HW performance.<br /><br />The in-class quizzes are spontaneous but generally not too difficult (although there were some exceptions). They're all MCQ qns and you get 10 for correct ans, 5 for incorrect ans and 0 for no submission. As before, the final in-class quizzes' score is calculated by excluding your worst quiz performance.<br /><br />We normally have a midterm and final exam, but since the sem was online, Prof removed the midterm and gave extra weight to other components. The final exam was replaced by a presentation.&nbsp;&nbsp;You are to choose among 5 topics: Wave Dark Matter, Quintessence Dark Energy, Hubble Tension, Lithium-7 problem, and Hybrid Inflation. They're all out of syllabus topics and require some literature survey. You are guaranteed at least half the score as long as you give the presentation. Out of the assigned 30%, 15% is by the Prof, 10% by your Peers, and 5% by the TA.<br /><br />My HW score: 988/1000 (each HW is worth a 100 points). By excluding my lowest scoring HW, my HW score was 898/900.<br />The mean total score was 861.6/1000.<br /><br />My quiz score: 110/120.<br /><br />Presentation scores are not released. If I had to guess, I was probably in amongst the better half of the class in regards to my presentation. <br /><br />I got an A+. I think as long as you do okay on the HWs and do the quizzes and presentation, a B range is guaranteed.",
            "comment_workload": "Weekly HWs only. Contains 2-3 problems. Essentially, its a 'light workload'&nbsp;&nbsp;course. But since the course materials are advanced, they actually might take a while to solve.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iLmLYTTwD2J1LgU9so3cH4lKp4KJonoo",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 625,
                    "name": "LIU, Tao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "RickyPang",
            "date": "Jun 04, 2020",
            "title": "Introductory to modern cosmology and best grading course",
            "comment_content": "The contents of this course basically cover the followings: <br />1) Evolution of the universe<br />2) Thermal History <br />3) CMB<br />4) Dark Matter <br />5) Inflation<br /><br />Although this course is an introduction to cosmology, it requires the knowledges of different fields such as general relativity and thermodynamics.&nbsp;&nbsp;To master this course, students may need to put more effort in understanding the course materials. As a student who have studied the PG version of this course (PHYS6810E), I think the PG version is much more easy.",
            "comment_teaching": "Professor Liu is a passion teacher and he explains the detail of his notes clearly. Besides, the course structure is much more better than another course PHYS4055. Due to the online learning mode, my classmates always asked questions so the learning atmosphere was very good.",
            "comment_grading": "Grading is good",
            "comment_workload": "There are 10 homework in total. Some of them are easy to do and some of them are very time-consuming. Most of them require to use or to prove the equations on the lecture notes. <br /><br />Besides, there are some pop-up quizzes during lectures. However, we do not know the exact mark of these quizzes. Maybe it is just for taking attendance.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "o8YaiueHlBxBUJJroTyQcrnIkbhgtbt3",
                    "name": "lecture1_sld",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "LfJymPw6KZIjc5l0esMVixA8ud1WAp3l",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YSA",
            "date": "Jun 20, 2018",
            "title": "Interesting but poorly structured course, best grading of any course in UST: below mean = A-, take if you want an easy A grade",
            "comment_content": "The course has completely changed since the last few years, because the previous reviews for this course mention very different things and the professor was also different earlier.<br /><br />This course is a very brief introduction to several different topics related to cosmology:<br /><br />Fundamental Observations<br />Newton versus Einstein<br />Cosmic Dynamics<br />Single-Component Universes<br />Multiple-Component Universes<br />Measuring Cosmological Parameters<br />Dark Matter<br />The Cosmic Microwave Background<br />Nucleosynthesis and the Early Universe<br />Inflation and the Very Early Universe<br />The Formation of Structure<br /><br />The course was interesting, but felt a bit unfocused, as there were too many topics and not enough time spent on any topic. The course should have been just 5 or 6 of these topics.<br /><br />Need a strong physics and math background.",
            "comment_teaching": "He is very enthusiastic and explains each topic clearly and carefully, making sure to write every step of the calculations on the board.<br /><br />The topic selection of the course is too broad, which is why it feels like he is going too fast and it can be difficult to follow the lectures sometimes. The lectures are recorded and uploaded, make sure to watch every lecture missed.<br /><br />His lecture notes are not sufficient for exam revision, they are more like a cheat sheet with just a few key points written.",
            "comment_grading": "20% assignments<br />30% mid-term exam<br />50% final exam<br /><br />The exam formats are very messed up, similar to the professor's other courses like PHYS 2022.<br /><br />The midterm and final have very few MCQs, just 5 or 6, and each MCQ is worth ~5%. There are also 2 or 3 long questions, each is worth 20-30%.<br /><br />So it means getting 2 or 3 MCQ wrong, or getting 1 long question wrong can change your final grade from above mean to below mean...<br /><br />The assignments are easy. Most of them are just calculations, the last assignment is a short essay (400 words).<br /><br />Because of the weird exam formats, the mean is very low. (54 for midterm, 63 for final).<br /><br />Despite all of this, the course has probably the best grading in any UST course, similar to his other courses.<br /><br />I got mean in assignments, slightly below mean in midterm, and just below mean in final. Final grade = A-<br /><br />I think it's impossible to get a C or below in this course...",
            "comment_workload": "Very hard to prepare for the midterm and final, as the questions and format of the exams are very strange.<br /><br />The lecture notes uploaded by the prof are too small and not enough for revision. Probably should read from the textbook instead. The lecture notes are useful for making the cheat sheets though.<br /><br />There are 4 assignments. The first 3 are straightforward calculations, quite easy. The problems along with the solutions can be found online if needed. The 4th assignment is a 400-word essay, need to summarize an academic paper about some topic. 1-2 weeks are given for each assignment.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MMRCBwXSrWzjUbluA28dS3pwy8lcY4tV",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 781,
                    "name": "WANG, Yi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "grqm",
            "date": "Jun 01, 2018",
            "title": "",
            "comment_content": "The course content is largely based on the whole book &quot;Introduction to Cosmology&quot; by Barbara Ryden.<br /><br />Since the course is more about conceptual understanding than problem solving, only a basic knowledge of modern physics and calculus is required.",
            "comment_teaching": "The lecture notes are too brief as a lot of important details and explanations are omitted. They only came in useful when I was preparing my cheat sheet. <br /><br />Going through the textbook is absolutely necessary.",
            "comment_grading": "The mean grade is A-.<br /><br />Pretty sure it is **THE** best course at UST in terms of grades.",
            "comment_workload": "Only three assignments (one problem each) + one short essay (&lt; 400 words).",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RsCw7STeQGHMmwEE0Ghzs7RTz6CMg5bR",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 625,
                    "name": "LIU, Tao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Adrianop",
            "date": "Jun 16, 2017",
            "title": "奇妙旅程",
            "comment_content": "Introductory level cosmology.<br />Robertson-Walker metric and Friedmann equation, spacetime evolution of the Universe, thermal history of the Universe, Big-Bang nucleosynthesis, cosmic microwave background, dark matter and dark energy, inflation. <br />Basically, a modern description of the history and the dynamics of the&nbsp;&nbsp;universe.<br />Strongly suggested if you have interest in astronomy.",
            "comment_teaching": "Really good teaching, the only thing can be improved is his accents can be better(but his accents is already ok)",
            "comment_grading": "The grading is generous, midterm&amp; final will mainly determine your final grade.<br />Even for me, I got like just above mean in midterm already gives me an A<br />(probably due to final, I don't know, since the marks of final were not announced)<br />There should be lots of A since the class size is always small.<br />Finals are not difficult(lots of explanation, not much calculations)<br />Midterms are somehow difficult.",
            "comment_workload": "The workload is ok, there are small quizzes in every lesson (attendance purposes, write ur name only can get 8/10 already)<br />The difficult thing is the HW, 1hw each for every week, not much qs, but it requires time and good understanding of lectures to complete that.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ioV92gZZkfzrG0kNVDZWbQWugOTzPjaB",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 625,
                    "name": "LIU, Tao",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "BrianC",
            "date": "Aug 07, 2016",
            "title": "Very clear, well structured course in cosmology",
            "comment_content": "This course contains almost the whole timeline proposed by Big-Bang cosmology and analyzed every section very thoroughly. Also contains some background knowledge like general relativity. Prof tries to introduce as much as possible so the contents are not in the really crazy mathematical style. And the course is so well structured, many textbooks or reference has the same flow so it is fairly easy to find other resources on the topics.",
            "comment_teaching": "no specific textbook required, and prof prepare all the lecture notes. really need to attend the lecture although the contents are pretty much the same as the notes, but prof will explain the equations or questions in a very detailed manner. also there will be quizzes during lectures, but the questions are really simple, but very useful to help student to understand the theory.",
            "comment_grading": "BEST. GRADER. EVER.",
            "comment_workload": "in terms of assignments, not much,only once a week, mostly one or two questions. really take some time to solve each question, but there's only two questions after all. Also the assignments are from the theory, there's plenty of results on google.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}