{
    "error": false,
    "course": {
        "id": 1021,
        "subject": "PHYS",
        "code": "1115",
        "name": "Laboratory for General Physics II",
        "description": "A laboratory course to accompany PHYS 1114/1314. Experiments in static and current electricity and magnetism, and optics are chosen to illustrate the experimental foundations of physics presented in the lecture courses.",
        "categories": [],
        "website": "http://teaching.phys.ust.hk/phys1115",
        "credits": 1,
        "semesters": [
            2230,
            2130,
            2040,
            2030,
            1940,
            1840,
            1830,
            1740,
            1730,
            1640,
            1630,
            1540,
            1530,
            1440,
            1430
        ],
        "prerequisites": "",
        "corequisites": "<a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1114\" href=\"/review/PHYS1114\" target=\"_blank\">PHYS 1114</a> OR <a class=\"course-link\" data-subject=\"PHYS\" data-code=\"1314\" href=\"/review/PHYS1314\" target=\"_blank\">PHYS 1314</a>",
        "exclusions": "",
        "rating_content": 4.25,
        "rating_teaching": 4,
        "rating_grading": 4.38,
        "rating_workload": 1.38,
        "review_count": 8,
        "single_review": false,
        "enrollment_status": 4,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 601,
                "name": "NG, Yee Fai",
                "count": 7
            },
            {
                "id": 628,
                "name": "SU, Yumian",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "z897eFj0M0oKGlgfHvJuzpbhfb4aEhVU",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "BearBear",
            "date": "Sep 02, 2020",
            "title": "High workload, good grade.",
            "comment_content": "EM1 Coulomb's Law<br />EM2 Capacitance and Electrostatic Energy<br />EM3 Coulomb Constant<br />EM4 DC Circuits<br />EM5 Magnetic Field Generated by a Coil<br />EM6 The Current Balance<br />EM7 Introduction to the Oscilloscope<br />EM8 Faraday's Law of Induction<br />EM9 AC Circuits<br />O1 Two-slit Interference and Diffraction Grating<br />Paired with PHYS1114. We didn't do O1 due to lesson suspension in the pandemic.",
            "comment_teaching": "Although we can only see Dr. Ng in the two tutorials, it can be seen that he is helpful and open to questions. The IA Patrick is really helpful and passionate to teach. He gives very constructive comments in his marking of lab reports and summaries. He would also answer our queries patiently when we send him email. Most of the TAs are also quite friendly and we can feel free to ask them questions about the marking of lab report or practical questions.",
            "comment_grading": "Your scaled score (SS) is calculated using the class average and standard deviation (excluding bonus) of the final scores as<br />SS = 500 + {(your final score - class average) / standard deviation} * 100 + (Summary Bonus in %) * 50. You can get A range if your SS is above 560 and B range for above 440. It means that if you have done your summary, it is easy to secure a B range and you can get A range when your lab reports score less than 1 SD above the average.<br />Note that out of the 10 labs, the lab with the lowest score will be omitted in the calculation if you attend all 10 labs, while your score of all 10 labs will be considered if you did not complete any lab (i.e. you didn't attend or you didn't submit lab reports), so remember to complete all labs. Be careful with the number of significant figures in your results and try to be as detailed as possible in the pre-lab and post-lab questions for a better mark in lab reports, and I believe you can have a high performance mark if you finish your experiment early (but I rather take my time to be more careful since some experiments are dangerous, and to obtain a more accurate result.)",
            "comment_workload": "Extremely high workload considering that this is only a 1-credit course. One lab report (takes at least 3 hours in my opinion) per lab, and one summary (450 words) for even number reports (EM2, EM4, EM6, EM8, O1). So 2 lab sessions, 2 lab report and 1 summary writing per week, plus some time spent to read lab manuals before practical lab sessions, which is important especially because some labs involve using very high voltage sources and is really dangerous, and there may be some apparatuses that we have never used before (at least I haven't...). The only plus is that there is no mid-term and final exams.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eMUYiq3IFCK9DGdDml9tpp4bS0V7pgL5",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Anacreon",
            "date": "Jun 06, 2021",
            "title": "workload worth 3+ cre",
            "comment_content": "Being able to take f2f lab course was quite fun.<br />However, I think it would be better if we can cover more interesting experiments, e.g. Oil-drop Experiment &amp; Newton's rings, rather than Ohm's law (EM4 DC Circuits)...<br /><br />EM1 Coulomb's Law<br />EM2 Capacitance and Electrostatic Energy<br />EM3 Coulomb Constant<br />EM4 DC Circuits<br />EM5 Magnetic Field Generated by a Coil<br />EM6 The Current Balance<br />EM7 Introduction to the Oscilloscope<br />EM8 Faraday's Law of Induction<br />EM9 AC Circuits<br />O1 Two-slit Interference and Diffraction Grating",
            "comment_teaching": "The instructor, technician and TAs are good!!! I always had some problems regarding the questions(I felt many of them ambiguous, and it would be easy to lose marks if I couldn't understand them thoroughly), and they answered them quite patiently.<br />Once I was puzzled about a method of analyzing data, I asked the TAs and got VERY detailed replies, including an email of almost a thousand words with several attaching files! Very grateful for their patience.",
            "comment_grading": "The grading is quite fair in my opinion. It did reflect my effort in this course.<br />I got two 12/15 below mean but others were nearly all high or full marks.<br />In the tutorial, the instructor said that around mean was B+.<br />Finally, I got SS&gt;673 (600 &gt; SS ≥ 560 is A-, SS ≥ 600 is A or A+), 99.15/100, A+.",
            "comment_workload": "The workload was horrible.<br />Every week I spent more than 16 hours on this course, not including the time spent on doing the experiments. Please note this is a ONE credit course!!<br />BTW, we have to write the lab summary, less than 450 words each time, every two weeks. Although it was said to be a bonus, everyone wrote this and we have curve grading in this course. Quite time-consuming and paraphrasing skill was important.<br />Remember to attach the graph if the questions asked :D",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zwA133K9eQPQ16YbIuUvCaLBMrZMYupb",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kssdk",
            "date": "Aug 03, 2022",
            "title": "",
            "comment_content": "EM1 Coulomb's Law<br />EM2 Capacitance and Electrostatic Energy<br />EM3 Coulomb Constant<br />EM4 DC Circuits<br />EM5 Magnetic Field Generated by a Coil<br />EM6 The Current Balance<br />EM7 Introduction to the Oscilloscope<br />EM8 Faraday's Law of Induction<br />EM9 AC Circuits<br />O1 Two-slit Interference and Diffraction Grating<br /><br />Remark: EM3 was cancelled due to the maintenance of the lab",
            "comment_teaching": "All of the experiments were done on zoom due to pandemic and the TAs are willing to help you if you have any questions.",
            "comment_grading": "Acceptable grading<br />You can have a good grade if you are willing to pay effort and know the concepts well.<br />Three grading parts:<br /><br />-Lab performance<br />This was graded through the questions on through zoom due to pandemic, around 3 questions for each experiment in this sem.<br /><br />-Lab reports<br />As similar as PHYS 1113<br /><br />-Lab summaries<br />Those were the bonus parts for specific experiments. If you want to receive a good grade then it will be better for you finishing them.<br /> <br />My grading: A-",
            "comment_workload": "Quite heavy.<br />You will need to finish one report per week which contains Part A,B and C. <br />Also, some of the experiment contained summaries which needs to spend much time on it.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PgQqbmDs1v6BUFLeNO9rajdVX3LPhulA",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wbs77",
            "date": "Jun 29, 2022",
            "title": "high workload!!!",
            "comment_content": "EM1 Coulomb's Law<br />EM2 Capacitance and Electrostatic Energy<br />EM3 Coulomb Constant<br />EM4 DC Circuits<br />EM5 Magnetic Field Generated by a Coil<br />EM6 The Current Balance<br />EM7 Introduction to the Oscilloscope<br />EM8 Faraday's Law of Induction<br />EM9 AC Circuits<br />O1 Two-slit Interference and Diffraction Grating<br /><br />10 weeks 10 experiments 10 lab reports. Nice topics pretty fun!",
            "comment_teaching": "NG Yee Fai is a great instructor. Very nice and very helpful. Unfortunately the experiments were done by the TA's. Some of them were good but some were very hard to understand and a bit unhelpful.",
            "comment_grading": "Grading was fairly well but very complicated;<br />The final grade is determined as the followings:<br /><br />Calculate the lab score (LS) for each individual lab.&nbsp;&nbsp;e.g. EM1: (8/10)*15% + (93/100)*85% = 91.05%; EM2: (9/10)*15% + (96/100)*85% = 95.1% ...<br />Calculate the final score including drop:<br />If you complete# all 10 labs, you can drop the lowest score.&nbsp;&nbsp;Your final score is (sum of all 10 lab score - the lowest lab score) / 9<br />If you did not complete all 10 labs, you do not obtain the drop.&nbsp;&nbsp;Your final score is (sum of all 10 lab score) / 10<br /># To complete an experiment, you are required to (1) perform the lab activity and complete the data sheet with TA approval and (2) submitted the lab report.<br />Calculate your Scaled Score (SS).&nbsp;&nbsp;Your scaled score is calculated using the class average and standard deviation (excluding bonus) of the final scores as<br />SS = 500 + {(your final score - class average) / standard deviation} * 100 + (Summary Bonus in %) * 50<br />* Fail:&nbsp;&nbsp;If you are absent in more than three labs without approval from the instructor or TAs, you will obtain an &quot;F&quot; despite your scaled score and final score. <br /> ** Grade &quot;A+&quot; is reserved for the exceptional students.&nbsp;&nbsp;The condition of obtaining &quot;A+&quot; will be determined at the end of the semester.&nbsp;&nbsp;Be reminded that it is possible that no &quot;A+&quot; grades are assigned to any one in the entire class.",
            "comment_workload": "Terrible workload. One experiment per week. For each lab experiment you have to do pre-lab questions and after the lab you have to write a lab report. You have 10 of these in total. We also had 5 summaries to write in total. We did it for EM2, EM4, EM6, EM8, and O1.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AR78GVrfWk0TAvmk2CozUZVcViuRJTiz",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kemist",
            "date": "Oct 28, 2021",
            "title": "CLS workload course",
            "comment_content": "EM1 Coulomb's Law<br />EM2 Capacitance and Electrostatic Energy<br />EM3 Coulomb Constant<br />EM4 DC Circuits<br />EM5 Magnetic Field Generated by a Coil<br />EM6 The Current Balance<br />EM7 Introduction to the Oscilloscope<br />EM8 Faraday's Law of Induction<br />EM9 AC Circuits<br />O1 Two-slit Interference and Diffraction Grating",
            "comment_teaching": "Basically, you need to read all the materials yourself before the experiment. When you do the experiment, just follow the manual and everything will be good. If don't, ask the TAs. But some TAs have poor English and it's hardly understandable.",
            "comment_grading": "Fair, mean is B+, unique grading system <br />SS ≥ 600 A or A+<br />600 &gt; SS ≥ 560&nbsp;&nbsp;A-<br />Got 653, A only wtf",
            "comment_workload": "One experiment and pre-lab and lab report per week, which is more than PHYS1114. I was also doing CHEM 1050 and 1055 lab together in the same semester and the workload for the two chem labs combined is only a quarter of that for 1115. It should be a 9 cre lab course.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ktMKUqiTy2RW8qX0VGdGT5VTu8fUIbRu",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "elwc",
            "date": "Aug 24, 2020",
            "title": "If this course isn't compulsory, don't take this.",
            "comment_content": "10 experiments in total<br />9 EM experiments + 1 optics experiment<br /><br />EM1 Coulomb's Law<br />EM2 Capacitance and Electrostatic Energy<br />EM3 Coulomb Constant<br />EM4 DC Circuits<br />EM5 Magnetic Field Generated by a Coil<br />EM6 The Current Balance<br />EM7 Introduction to the Oscilloscope<br />EM8 Faraday's Law of Induction<br />EM9 AC Circuits<br />O1 Two-slit Interference and Diffraction Grating (cancelled due to WARS)<br /><br />A lab manual will be provided and everything you need for this course is inside. Before each experiment, you need to finish the pre-lab questions and you should read all the procedures. After the lab, you need to finish the post-lab questions within a week. For some lab, you can write an optional 400 word summary.<br /><br />Of course you should not miss any lab.<br /><br />Sometimes the TA will require students to finish the lab earlier than the end of the lab session. I really don't think this is a good idea. In 1113 it may be fine but here we are dealing with high voltage. Seriously I don't like to be in a hurry during these rather dangerous experiments.",
            "comment_teaching": "Although there're just two online tutorials, I can see that Ng is a very benign person. And certainly he can teach normally.",
            "comment_grading": "Absolute grading. But the grading intervals will be adjusted a little bit at the end of the course.<br /><br />You won't get a bad grade as long as you are smart or hard-working :)<br /><br />I did the lab questions and summary a bit better than the average.<br />Eventually I got a B+.",
            "comment_workload": "1. One credit course with three credit workload<br />2. What a crazy course. The workload is absolutely heavier than PHYS 1113. The experiment summary part is claimed to be &quot;optional&quot; but ... the instructor also said there would be an obvious grade difference between people who do summaries and people who don't.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MJDYwfh8koH6fA2WPpfWbUj0ulFtkZWm",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wayway Ma",
            "date": "Aug 28, 2019",
            "title": "",
            "comment_content": "EM1 Coulomb's Law<br />EM2 Capacitance and Electrostatic Energy<br />EM3 Coulomb Constant<br />EM4 DC Circuits<br />EM5 Magnetic Field Generated by a Coil<br />EM6 The Current Balance<br />EM7 Introduction to the Oscilloscope<br />EM8 Faraday's Law of Induction<br />EM9 AC Circuits<br />O1 Two-slit Interference and Diffraction Grating",
            "comment_teaching": "Liu Bin is my TA and Lee Che Kin is the technician for my lab. They are quite nice and if you have any questions just feel free to ask them. (asking the technician will help you better tho, at least from my experience... cause sometimes the TA may give the wrong instructions and has to ask the technician as well. The technician is more experienced and solves problems in a quicker way.) They both don't speak good English, especially my TA. Often he couldn't explain things in English, and we would just be like.. okay...",
            "comment_grading": "Lab performance 30%<br />Lab reports 70%<br />Lab report summary is optional but would add bonus to your score. (only for alternating weeks)<br /><br />My lab report score range: 89-100/100<br />My lab performance scores are all 8/10, except one is 9 and one is 6.<br />I didn't submit a summary once. (I just didn't have the time) <br />My final grade: B+",
            "comment_workload": "heavy!<br />One lab report for the previous lab and one pre-lab for the coming lab, per week.<br />Usually the lab report requires you to plot graph using Excel and print it out.<br />You can submit summary for EM2, EM4, EM6, EM8 and O1 along with your lab report if you want to but the workload would be no joke.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qdU5lxeuiaZmrjTNhPqg3HTuWIebnUyj",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 628,
                    "name": "SU, Yumian",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "marcus_glucagon",
            "date": "Jul 17, 2017",
            "title": "",
            "comment_content": "This course is to let you do experiments on the topics that you have learned in PHYS1114. The lab report may have some more difficult questions, or sometimes ambiguous. The most reliable method is to ask the professor directly or via email. Sometimes even if you directly ask her whether your thoughts on the question and answer are correct, her replies can be a significant hint.",
            "comment_teaching": "There will be a briefing session at the very beginning of the lab session. They may give you some tips during this session. As mentioned in the content session, ask the professor or TA if you have ANYTHING don't know or uncertain.",
            "comment_grading": "The grade is based on your class level (class mean and standard deviation). In the other words, it depends on your luck. <br />BE AWARE OF YOUR LAB PARTNER even though you cannot choose your own. Your performance score almost ENTIRELY depends on your speed of completing the experiment, unless you did something wrong and it was so obvious that you got caught.",
            "comment_workload": "This is only a 1-credit course, but the workload exceeds many typical 3-credit courses. One lab report and one pre-lab every week. Especially if you intended to answer many things on each question so that it's more likely to get a higher score (just like in DSE, writing excessive works for each question is fine as long as there's nothing wrong or totally irrelevant), it will be a torture every week.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 1,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}