{
    "error": false,
    "course": {
        "id": 1015,
        "subject": "PHYS",
        "code": "1005",
        "name": "Physics in Movies",
        "description": "Films and movies are for entertainment. As such, actions and episodes in movies frequently violate the basic laws of physics. By analyzing the situations portrayed in movies, we seek to establish some basic principles of physics such as the laws of motions, conversation laws, principles of thermodynamics and notions of modern physics. Using films to illustrate the correct (or wrong) concepts of physics is a good way to help the students to comprehend and apply the basic principles of science in an enjoyable way. Movies and films also frequently describes, sometimes in a grossly exaggerated manner, the dire consequences when science or technology falls in the hands of the bad people or when good science is applied for a wrong purpose by unsuspecting people who have good intentions. Analyzing such situations can help students to evaluate the social and philosophical implications of scientific discoveries and technological development. Students without the physics prerequisite but have taken PHYS 1001 or equivalent may seek instructor’s approval for enrolling in the course.",
        "categories": [
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2010,
            1810
        ],
        "prerequisites": "A passing grade in HKCEE Physics; OR Level 3 or above in HKDSE 1/2x Physics OR HKDSE 1x Physics",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.82,
        "rating_teaching": 4.91,
        "rating_grading": 5,
        "rating_workload": 4.82,
        "review_count": 11,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 601,
                "name": "NG, Yee Fai",
                "count": 10
            }
        ]
    },
    "reviews": [
        {
            "hash": "HAWF8IJeI52EIQfqHfmIqsrEgDqZVQyl",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "toughgalll",
            "date": "Jan 28, 2019",
            "title": "Relaxing and fun course",
            "comment_content": "You'll come across a large amount of profound physics knowledge you didnt expect learning in a 1000 level course but dont be scared! The exam is very easy with some questions directly from ppt slides. The questions are about some movie clips which will be announced a week before final; you'll know what he wants to test you right after watching them. <br />Just sit back and relax during lessons! The content is actually interesting (refer to other reviews)<br />He doesnt take attendance until group presentation sessions starting from nov. Make sure you attend all the lectures to fill the peer evaluation forms.",
            "comment_teaching": "Ng Yee Fai is so nice!!!<br />He always smiles and talks gently in lectures, clearly explaining the theories. I saw many students asking him questions after lesson and he never hesitated to answer them. I emailed him before final and he replied quickly.",
            "comment_grading": "Presentation 40%<br />proposal 10%<br />documentation 5% (just upload all the materials in your presentation to canvas)<br />final 40% (easy)<br />attendance 5% (secured if you attend all lectures starting from the presentation session. rmb to complete the peer evaluation form)<br /><br />I think the grading is lenient. Our group talked about projectile motion, momentum and impact force. Some groups mentioned space travel. We got ~35/40 <br />For final, the mean is high becoz the paper is easy. around 70 out of 80. <br />I got 76/80.<br /><br />Grade: A",
            "comment_workload": "Quite light.<br />2-ppl presentation: you are free to choose whatever topic you want as long as it is physics!! even high school physics like the Newton's Law or projectile motion will do. Before the presentation you need to submit a proposal on your topic, movie clips to be included, and related theories. There's a QnA session after the presentation where the prof will raise questions if no one does. But no need to worry he won't scold at you~After the presentation just upload all the documents used for presentation (ppt, clips, proposal etc.) to canvas.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "AxBsQJC4rjSvgh0Vqx2z4qvMSS6FZMnO",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "astro7",
            "date": "Dec 18, 2020",
            "title": "A really fun and chill course!",
            "comment_content": "What Is the Nature of Space and Time?<br />What Is the Universe Made of?<br />Can a Machine Become Self-Aware?<br />Are We Alone in the Universe?",
            "comment_teaching": "Hands down one of the BEST professors you could find in HKUST. I did not get into this course at first and was placed on the waitlist, however, I kept coming back during the add/drop period, hoping that I could register successfully. Professor Ng is really chill and he's always so friendly during his lectures! He has such a calm tone while teaching, and despite the content being quite daunting to a non-science major like myself, I always felt at ease when learning from him. <br /><br />He makes sure that this isn't just a regular UST course, and honestly, this class has a high school vibe to it. It was very engaging and the content is much more interesting, and he analyzes a lot of movies using physics (even better if you're a Star Trek fan, he uses that movie a lot). <br /><br />If you went through HKDSE physics or any other highschool equivalent, this course won't be too challenging for you. You can definitely learn a thing or two from this course, and it's one of the best common core options out there.",
            "comment_grading": "Attendance / Participation: 10%<br />Individual Presentation: 25%<br />Essay: 25%<br />Final Examination: 40%<br /><br />The attendance is taken during the documentary sessions through Q&amp;A polling in Zoom. As long as you respond, your participation marks will be recorded, and there are only three documentaries to show up for. <br /><br />The presentation part is pretty interesting, you can choose any topic and find relevant movies, and you can do analysis just like how the professor did during his lectures. A Q&amp;A session comes after it, but the classmates rarely ask questions. It's usually a question or two from the prof and also the TA, and they're just related to your presentation.<br /><br />The essay isn't too difficult, but it will be quite time-consuming. There is no strict format, but the maximum limit is 10 pages (including diagrams and references). So, you have to choose a topic that you're really interested in so that your essay won't be torture to go through. He lets you choose the topic from the course textbook, and it can be anything from machine learning to particle accelerators to space travel.<br /><br />Finally, the exam, which is not like a typical physics exam in UST. Our final exam was 1.5 hours long and consisted of 7 long questions. The professor uploads movie clips that will give you some context to the examination questions prior to the examination. Statistics for reference (out of 90): (Mean: 76.1, SD: 14.2, Max: 90)",
            "comment_workload": "Barely any workload at all for the first 10 weeks of the course, just show up during the documentary sessions and secure those participation marks. However, plan your presentation and essay beforehand, because they come at the worst possible time. Definitely, nothing too much that will stress you out though compared to other courses. <br /><br />The final doesn't need much preparation, especially if it's an online and open book exam. Just keep the lecture notes ready, they're very useful for the final exams. You only need to go through basic concepts, nothing too difficult will be tested, no calculus at all.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6S3JJwfnOTmWHExRQ2mmRQKTwAffmqnV",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Paijai",
            "date": "Jan 27, 2021",
            "title": "",
            "comment_content": "Physics in Movies<br />顧名思義，就係講電影入面既physics，一係講當中既理論係點，一係就講係現實生活中可唔可以做到同樣既野，或者用睇下戲入面既physics真唔真實。<br /><br />整體黎講，依個course分左兩part，第一part係教，第二part係present，咁佢教既野就分4個topics，分別係:<br /><br />(1) What is the Nature of Space and Time<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;依個topic主要講Newton's law, Newton's law of universal gravitation, time dilation, distortion of spacetime, circular motion同GPS<br />(2) What is the Universe Made of<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;依個topic就係講particle physics, atom, gas, kinetic theory, solid state material, phase transitions, heat&amp;power, transparent material, comouflage, stealth technology, pefractive index, metamaterial, PE&amp;KE, matter&amp;antimatter<br />(3) Can a Machine Become Self-Aware<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;soft&amp;hard AI, analog computer, planet detection, digital computer, information storage, robot, law of robotic behavior, singularity<br />(4) Are We Alone in the Universe<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;最後一個topic係講exploration, communication, planet detection (詳細少少，少少咁多), condition necessary for life, origin of life, 4.462GHz<br /><br />當prof教完一個topic既時候就要睇一套相關既documentary，每個documentary都會用一整堂既時間去播，而每個documentary既長度都係少過一堂既時間，所以每次documentary都可以早20分鐘落堂",
            "comment_teaching": "Prof. NG係一個香港人，所以啲英文一定唔會聽唔明。雖然啲topic睇落去好似有好多咁，但係prof每個topic都會點到為止，唔會教到太深入，但係足夠學生學到一定既程度。平時prof教既時候會周不時講下gag咁，所以平時上堂唔會太悶。上堂前後都會同學生傾下少少計咁(即使係zoom上堂都係咁)<br /><br />個syallbus都會講解都好清楚，所有present，essay，exam既content都會不厭其煩咁講好多次，所以唔會怕做唔啱。<br /><br />不過個TA好似成日都游魂，唔係好focus係上堂咁，不過TA既作用都只係播documentary同present問問題，所以問題不大。",
            "comment_grading": "依個course既weighting係:<br /><br />Attendance/Participation: 10%<br />Individual Presentation: 25%<br />Essay: 25%<br />Final Examination: 40%<br /><br />佢既attendance係每堂都會計，但係只係會計你係zoom入面出值既時間，而唔會係用iprs或者問問題既方式去計attandance，所以變相無咁chur。除此之外，attandance仲包埋present既evaulation同documentary答問題。咁peer evaulation難聽啲講，你可以亂咁比都得，唔駛真係聽...(利申我無咁做)，而documentary答問題就真係無得避，TA會係個documentary播到咁上下就會開個survey比學生答問題，但係佢就唔計你啱定錯，有答就可以。但係上面所有既野都只係值10%，所以大家識諗喇。<br /><br />咁present入面仲有用weighting，instructor:TA:peer evaulation係6:3:1<br /><br />依個course相當好grade，除左final exam同peer evaulation既分會公開之外，其他分都係唔知既，由於peer evaulation既佔分太少，就唔係公開。<br /><br />而final exam既stat係<br />Mean: 76/90<br />SD: 14.2<br />而我拎左82分<br />Overall grade: A<br />好grade!!!",
            "comment_workload": "依個course既weight就分attandance, present, essay同final exam，話多workload又唔多，但係同時又唔係少，因為佢無mid term，但係present, essay同final exam都係推晒係sem尾，所以workload黎講還好。咁下面都講下每樣野係要做咩:<br /><br />(1) Present<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;首先個present係自己一個做，無限你做咩topic，present既內容都好大，可以係講解一個topic，可以係分析戲入面既physics真唔真。但係你present既topic係要包括一條片，條片就係你present既重心，但係條片唔一定係戲，可以係卡通，可以係動漫，只要關physics既topic就可以。而個powerpoint就係要係第一個同學present之前既一日就要交，之後就只可以細改。Present既長度係10分鐘，present完之後prof就一定會問至少一條問題，之後就睇下TA同其他同學有冇問題。<br /><br />(2) Essay<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;同present一樣，topic都係一樣無限，但係最好就係textbook既exploration topic(s)度搵(P.S. textbook唔駛買，亦都唔駛用)。個maximum page係10頁，包埋圖同figure，面reading material就係依個時候要用，你要搵唔同既literature去寫依份essay。<br /><br />(3) Final exam<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Open-book / notes (physical / digital)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3個鐘頭做大概8條問題，每條問題都有一條片睇，但係唔一定要睇，因為佢question book都會好清楚咁寫左條片既重點，但係睇左可能會好清楚啲。平均每條問題都有3條sub question，所以都唔算好多題目要做。當中可能會考返啲好basic既問題，當然都有依個course教果啲，有啲題目好直接，甚至可能會係上堂既example，所以難度唔係好高。",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "j00ZEmQp3qxyt8tIL46w62CaZ12x486O",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Tofu",
            "date": "Jan 21, 2021",
            "title": "Chill course",
            "comment_content": "This course is good because you can learn physics though watching movies. You can explore many interesting movies in this course !<br /><br />First half of this course is teaching about physics in movies. The second half of this course is just watching your classmates to have individual presentation. The topics are free to choose so you can talk whatever you want to talk in the presentation. You can also learn a lot in the presentation time from your classmates.",
            "comment_teaching": "Very chill prof. and TA is also helpful.<br />You are free to ask the prof. and TA about the course and they are willing to answer all of your question. <br /><br />Physics concepts are delivered clear and you can learn some interesting concepts like time dilation.",
            "comment_grading": "Final exam is easy as the content is from the lecture notes. The questions are just similar to the lecture notes. Just changed some number and then you can do it. <br />The lectures in add-drop period are counted as bonus mark for grading. You don't need to be very good in physics as it is just the basic concepts. You just need to hand in all the things on time then the grade will be very good. <br /><br />Attendance / Participation: 10%<br />Individual Presentation: 25%<br />Essay: 25%<br />Final Examination: 40%<br /><br />I got A-<br />Attendance / Participation: 10%<br />Individual Presentation: 20.1/25<br />Essay: 22.5/25<br />Final Examination: 79/90",
            "comment_workload": "Workload is very small. In this semester only need to one individual presentation and submit one documentary. <br /><br />Attendance is needed but you will not want to miss it because they are very interesting. There were 3 lectures for watching documentary video and just a little boring but just fine the questions asked in these lectures doesn't count any marks.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "nr8x586yBpFan3NJhAcrNTTIuzQXKQyL",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Cert",
            "date": "Dec 23, 2020",
            "title": "Pretty chill common core",
            "comment_content": "4 main topics<br />1. What Is the Nature of Space and Time<br />2. What Is the Universe Made of<br />3. Can a Machine Become Self-Aware (This feels like basic IT + robotics rather than physics tbh)<br />4. Are We Alone in the Universe<br /><br />Lectures are pretty relaxing. The lecturer shows movie clips to introduce concepts, and analyze scenes with physics to see whether they make sense. Contents are not too hard to understand with secondary school physics background. No stress at all attending lectures. Just chill and have some fun watching sci-fi movies (most of them rather old but that makes them fun)",
            "comment_teaching": "This semester is purely online (with some mixed mode lectures). The lecturer is a native Hongkonger and he speaks pretty clearly. He is quite nice to students. The content is easy to there's not much to talk about teaching.",
            "comment_grading": "Attendance / Participation: 10% (Zoom record)<br />Individual Presentation: 25%<br />Essay: 25%<br />Final Examination: 40%<br /><br />The grading is good. I got 78/90 in the final exam while the mean is 76.1. Essay score and presentation overall score are unknown, though the peer-evaluation scores for presentation are released and I got 30/40. The presentation overall score is given by a 6:3:1 weighting of Lecturer:TA:Peers' average, all using the same score sheet.<br /><br />I got A- which is very good to me since I'm just slightly above mean in the final exam. Perhaps my presentation and essay scores are high.",
            "comment_workload": "As mentioned in the grading section, there are individual presentation, individual essay, and final exam. No Homework. The presentation is 10min with 5min of Q&amp;A, where you pick a movie and talk about the physics in it, similar to what the instructor does in lectures. Just pick a topic you are familiar with and avoid concepts that are too complex. Make sure you know what you are talking about and your analysis is correct and without misconceptions, so that you won't screw up the Q&amp;A. <br /><br />The essay is maximum 10 pages basing on the &quot;Exploration Topic(s)&quot; in the adopted textbook. The textbook is free to download on the library website so everyone will have access. <br /><br />The final exam is pretty easy and should be ok for students who have secondary school physics knowledge. A question was even exactly the same as the one in lecture notes. No need to worry too much. It was open-book.<br /><br />Though I have the say the guidelines and instructions are generally lacking in this course. The instructor said the presentation and essay can be &quot;free-style&quot;, so basically no specific requirements had been given. It makes the requirements vague and you don't really know what you need to achieve in your work. The instructor also didn't give any sample question or pastpaper to us so we basically had no idea how the exam would be like. Luckily things aren't harsh or difficult and it turned out fine for me.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EROlvyS3OKzQjflrtexih8fi83PWtCYx",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "blurcache",
            "date": "Dec 03, 2020",
            "title": "Very good and interesting",
            "comment_content": "4 topics in this course:<br /><br />1. What Is the Nature of Space and Time?<br />2. What Is the Universe Made of? <br />3. Can a Machine Become Self-Aware?<br />4. Are We Alone in the Universe?<br /><br /><br />4 documentaries during lecture time:<br /><br />1. The Real History of Science Fiction--Space<br />2. The Real History of Science Fiction--Robots<br />3. The Real History of Science Fiction--Invasion<br /><br />The fourth documentary was cancelled due to typhoon.",
            "comment_teaching": "Fai Fai is so good! He explain everything clearly and are willing to answer questions. The TA XiangXu is also good. <br /><br />Just relax during the lessons. A nice course for those who are interested in Physcis.",
            "comment_grading": "Attendance / Participation: 10%<br />Individual Presentation: 25%<br />Essay: 25%<br />Final Examination: 40%<br /><br />Attendance during add / drop period will be counted as bonus<br /><br />Final is conducted online so open-book.",
            "comment_workload": "Very light. Only one presentation and one essay.<br /><br />Presentation:<br />Individual, can choose any movie that you like (as long as it has something related to physics). The presentation is about 10 minutes and a Q&amp;A section for around 5 minutes. Questions may come from professor, TA or other students.<br /><br />Essay:<br />Write an essay based on the &quot;Exploration Topic(s)&quot; in the adopted textbook (you can download pdf version from ust library website). No template, free style writing.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "G4ipWH6VCVt6rpznE4FaRXAhAVDBxKBt",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Donaldcch",
            "date": "Aug 26, 2019",
            "title": "Very Good Very Interesting",
            "comment_content": "What Is the Nature of Space and Time?<br />What Is the Universe Made of?<br />Can a Machine Become Self-Aware?<br />Are We Alone in the Universe?<br /><br />There would be a group project and 15-minutes presentation (with 2 people in a group).",
            "comment_teaching": "Clear explanation and interesting topics. Very good for those who have strong passion in physics but not studying in the science school.",
            "comment_grading": "proposal 10%<br />doc. 5%<br />present 40%<br />final 40%<br />attendance 5%<br /><br />Full mark in Final Exam, got A in the end",
            "comment_workload": "Minimal workload. For a 3 credits course, the workload was incredibly light.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BQoEMuxN2F8MP54Hfxx7uwIuU1A2NhKF",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "marcus_glucagon",
            "date": "Aug 21, 2019",
            "title": "Excellent course with excellent grade",
            "comment_content": "This is a course with a lot of useful and interesting contents related to physics and modern technology. Only those easiest contents would appear in the final exam, but the course covered a wide rage of physics knowledge in terms of the difficulty (from secondary school level to postgraduate level).<br /><br />It was an interesting and intriguing course to discover how physics is related to movies. For students with at least year 1 level physics knowledge, revision for final exam is often not necessary.<br /><br />It is fun to watch movies in the course.<br /><br />There would be a group presentation (with 2 people in a group).",
            "comment_teaching": "A very nice tutor with intriguing tone clearly explaining course materials.<br /><br />Patient and willing to answer questions (even the weirdest question) from students.<br /><br />Willing to give advice to students for their group presentations to such an extent that we could more or less guess the score before the presentation was actually performed.<br /><br />A fun and nice guy to chat with.",
            "comment_grading": "Perfect... provided that we did not make stupid careless mistakes.<br /><br />Making the presentation funny is crucial... of course better being slightly more imformative and inspiring too.<br /><br />Attendance counts when other groups are presenting and we have to submit our comments on them (quality of comment is not important).<br /><br />Presentation 38/40<br /><br />Final exam 80/80 (Mean 72.3 SD 6.0)<br /><br />Despite many people got very high scores (as the course is easy), this score was enough for an A+.",
            "comment_workload": "Uncharacteristically light, nowhere like a UST course in terms of the class atmosphere and course workload.<br /><br />For a 3 cred course the workload was incredibly light, maybe laughting and chilling during the lecture counts as part of the workload.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ceBeLadiP3KSXisPyTq6bukqMNSdKxau",
            "semester": "2017-18 Summer",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "blunder_",
            "date": "Jan 25, 2019",
            "title": "Good course",
            "comment_content": "Teaches basics of physics. Also dwells a bit on more advanced physics like Relativity. All around very interesting syllabus",
            "comment_teaching": "Clear explaination of various topics with suitable movie clips. All formulas and laws clearly provided in slideshows.",
            "comment_grading": "Have a Final presentation and Exam, the latter can be passed with ease if you know physics prior to to taking this course. Attendance only starts being taken at the end of term, during other student's presentations.",
            "comment_workload": "Minimal workload. The workload only starts accumulating near the eand of term when the final presentation has to be prepared. However, since the range of topics to be chosen in the presentation is vast, if you picked an enjoyable topic, researching isn't tedious at all.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DBUDDjCU0tEY7tnVLvoA6ptGDsDslZxJ",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pccw",
            "date": "Jan 17, 2019",
            "title": "幾得意嘅phy course",
            "comment_content": "分4個大topic<br />What Is the Nature of Space and Time?<br />What Is the Universe Made of?<br />Can a Machine Become Self-Aware?<br />Are We Alone in the Universe?<br /><br />上堂會睇movie clips,大部份都幾舊,197幾年都有,跟住會分析岩唔岩phy law, 上左16堂之後就會開始present 同計attendance, 除左自己present 個一堂其他堂基本上可以做自己野,非常輕鬆",
            "comment_teaching": "講野好聽,有耐性",
            "comment_grading": "proposal 10%<br />doc. 5%<br />present 40%<br />final 40%<br />attendance 5%<br /><br />present 21/40<br />final 77/80 mean 70 sth<br />B+<br />幾靚grade",
            "comment_workload": "除左present 用兩三日去搞, final 有cheatsheet 半日ok",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Okwp5Zs4D3RmysoV5bdf9iAyIn84fOI7",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 601,
                    "name": "NG, Yee Fai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Eggtart",
            "date": "Jan 08, 2019",
            "title": "Take a break between lessons:)",
            "comment_content": "由電影學physics。因為跟書教，所以好多戲都好舊，反而別有一番趣味。頭半個sem上堂，後半d堂留返俾我地present。好似同班好多Physics人，不過大部份內容都係中學physics冇乜影響嘅；係present嗰陣會聽到好多唔係1000-level expect嘅physics啫。",
            "comment_teaching": "Nice教得幾清楚，好有耐性解答大家問題",
            "comment_grading": "Good",
            "comment_workload": "最大workload係兩人一組15mins present， 搵啱用嘅電影分析比較花時間， 但其實過程都幾好玩嘅。",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}