{
    "error": false,
    "course": {
        "id": 1031,
        "subject": "PHYS",
        "code": "2124",
        "name": "Mathematical Methods in Physics I",
        "description": "This course will cover most of the mathematical tools required for studying classical mechanics, electromagnetism, quantum mechanics and statistical mechanics. Key topics include complex numbers, vector analysis, Fourier series and transform, ordinary differential equations and series solutions.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2030,
            1930,
            1830,
            1730,
            1630,
            1530,
            1430
        ],
        "prerequisites": "<a class=\"course-link\" data-subject=\"MATH\" data-code=\"2023\" href=\"/review/MATH2023\" target=\"_blank\">MATH 2023</a> AND (<a class=\"course-link\" data-subject=\"MATH\" data-code=\"2121\" href=\"/review/MATH2121\" target=\"_blank\">MATH 2121</a> OR <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2131\" href=\"/review/MATH2131\" target=\"_blank\">MATH 2131</a>)",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"MATH\" data-code=\"2350\" href=\"/review/MATH2350\" target=\"_blank\">MATH 2350</a>, <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2351\" href=\"/review/MATH2351\" target=\"_blank\">MATH 2351</a>, <a class=\"course-link\" data-subject=\"MATH\" data-code=\"2352\" href=\"/review/MATH2352\" target=\"_blank\">MATH 2352</a>",
        "rating_content": 4.64,
        "rating_teaching": 4.64,
        "rating_grading": 4.91,
        "rating_workload": 4.82,
        "review_count": 11,
        "single_review": false,
        "enrollment_status": 3,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 607,
                "name": "JO, Gyu Boong",
                "count": 7
            },
            {
                "id": 1175,
                "name": "DAI, Xi",
                "count": 4
            }
        ]
    },
    "reviews": [
        {
            "hash": "HYFiGlcl0Fmj7MFGfUgLz06AdUdVLyHs",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 607,
                    "name": "JO, Gyu Boong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "0_0",
            "date": "Sep 25, 2016",
            "title": "One of the best physics professor",
            "comment_content": "Basically a differential equation course aimed specifically to physics students. The material covered are more or less the same as that of MATH2352, but less focused on the theoretical aspect of the subject and is taught more in the context of physics.<br /><br />Topics: (1) Complex numbers (2) First order differential equations (linear and some others) (3) Second order differential equations, mostly constant coefficient (4) Laplace Transform (5) Dirac-delta function, Green function, convolution (6) System of differential equation, bifurcation (7) Fourier series and Fourier Transform<br /><br />Notice that complex number only appear in the quiz, and for some unknown reasons, almost the whole final is filled with Fourier.<br /><br />The content is solid for a first course in differential equations and is well chosen for a course aimed at physics students, but some of the topics are not covered in much depth much more than the computation method, which leave me quite puzzled by their physical meanings or theoretical details sometime.",
            "comment_teaching": "I am surprised that only that few reviews are written for this course. Prof. Jo is one of the best professor I encountered so far in UST and is far better than many of the professors in the physics department. He is very enthusiastic in teaching, and he is always trying his best to help the students, as he said in the first lecture, &quot;your enemy is not me but the university's regulation. I want to give a good grade to everyone, but I need you to help me&quot;.<br /><br />I really enjoyed Prof. Jo's teaching style. His spoken English is very good and clear (one of the best in the Physics department) and he doesn't speak with a monotonic voice. He write on the whiteboard during lectures, which is by far better than all the hideous PPT that many physics professors love to use. More importantly, he created a somewhat relaxed and encouraging learning environment that help making the whole learning progress positive.<br /><br />Prof. Jo writes his own lecture notes (either hand-written or typed), on which his lecture are based on. The hand-written notes are quite pleasant to read, but the typed notes are sometime a little bit loosely organized (especially the Fourier part), so I would recommend you to also have a look in the textbook (which is also very good). Also, the pace of Prof. Jo's lecture can be quite fast and even hard to follow sometime (especially those after the midterm) , so it is a good practice to preview a little bit before the lecture.",
            "comment_grading": "In additional to midterm and final, there is also a quiz quite early in the course. But depending which gives you a better final grade, the quiz may or may not be counted toward your final grade. Also, because of the early quiz, the midterm is pushed backward accordingly, which make you have more time to study for it and helped a lot in reducing the workload during the crazily busy midterm period.<br /><br />There are also a few homework assignment (about 6 of them) throughout the semester, each of them consist of about 3-5 problems. The assignments are counted as bonus to your grade, but given that virtually everyone will do the homework and relative grading is implemented, it is really not that much of a bonus.<br /><br />The grading is very transparent, an excel file is available on canvas for you to keep track of your grade.<br /><br />I don't know exactly how the grade is distributed, but as many people got over 100% due to the homework bonus, the cut-off for A+ seen very strict. I got an A for an overall 96%.",
            "comment_workload": "Like I said, the extra quiz make the midterm misses out the usual midterm period and help a lot in making room for you to study for it. (Though the quiz itself is held way before the midterm period, which prompt your to study early.) The difficulty of both of the exams are appropriate and reasonable. Some of the problems are even those in the lecture examples or in the homework assignment, just like Prof. Jo like to said, &quot;I am not trying to test your intelligence, but whether you actually learned the material in the course.&quot; That being said, if you spend the time to go to the lecture (or at least study the lecture notes) and do the homework, you would be fine.<br /><br />For the homework, the problems are well-chosen for you to practice what you learned in the lecture, and they are of reasonable difficulty (except for one ridiculous Laplace Transform problem). You should be able to finish them in about an hour or two. <br /><br />You can expect the exams to be at the same difficulty and style as the homework.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fWiqHrG2sAI9eobcjtra2pJHrEu992zU",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 1175,
                    "name": "DAI, Xi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "二十一世紀精分男",
            "date": "Jun 08, 2023",
            "title": "one of the post-covid 2124 review",
            "comment_content": "1. Complex numbers<br />2. 1st order ordinary differential equation (ODE)<br />3. 2nd order ordinary differential equation (ODE)<br />4. Various techniques solving ODEs (Laplace transformation, Green’s function etc.)<br />5. Higher-order ODEs<br />6. Systems of ODEs<br />7. Fourier series and transformation<br /><br />Textbook: Mathematical methods in Physical Sciences, by Mary L. Boas<br /><br />Somehow too few, for an year-2 course.&nbsp;&nbsp;And so that there is PHYS3031 later...",
            "comment_teaching": "Lectures:<br />Sleepy, as he only uses hand-written notes on whiteboard, the handwriting was, in some extent, ugly (he may put all the words together, or using the RHS of the board then LHS, and sometimes hard to read.... (-_-|||<br />While the good thing is that he introduces more than what we have to learn (nano-generators etc.), you may easily see his passion on the topics. <br /><br />Tutorials:<br />The TAs did a good job: the tutorial notes were good enough and some questions that requiring some skills were given as exercises in every tutorial session, we were asked to finish within ~20 minutes and they would give detailed explanations.&nbsp;&nbsp;Apart from these, the TA would be nice enough and very patient for answering your questions correctly.",
            "comment_grading": "Good: <br />the grading scheme: <br />20% Assignments<br />30% Midterm<br />50% Final<br />1. as the exams are not quite hard and short (3 questions for midterm, and 4 for final).&nbsp;&nbsp;Time was very sufficient for both of them, just be careful is enough. <br />2. the assignments were just as textbook exercises, not quite hard as well: 4~5 problems per piece of asm.<br />==&gt;easy to get good grade for both assessments.",
            "comment_workload": "really small.&nbsp;&nbsp;<br />1. I like what he designs for the whole structure for the assignments: he only gave 6 assignments in the whole semester, and every question was useful for your revision, such that you don't have to do too much supplementary works.<br />2. the exams, as I said, the number of questions were obviously small.&nbsp;&nbsp;Also, they were regular that were just the examples appeared on the lecture notes.<br /><br />Anyways, among all the courses that you worry for, this one could be an exclusion.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fKj3esQQcyzj867qb38u9KQn4XezOlMB",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1175,
                    "name": "DAI, Xi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JacieMay",
            "date": "Aug 23, 2022",
            "title": "",
            "comment_content": "mainly differential equations",
            "comment_teaching": "Becuase it's mainly online this semester, the lecturer uses zoom and write notes on the withe board. There are no hand-written notes, but there are relevant PPTs and some documents&nbsp;&nbsp;available on cancas. And it's hard for him to answer questions becuase he couldn't see the chat room and you need to ask him directly.",
            "comment_grading": "the homework counts for 50% and there's a project counts for 50%. The exams are cancelled, so as long as you put efforts in the assignments and the project, it's easy to get a good grade.",
            "comment_workload": "5 assignments and 1 project. About two weeks for each homework. The lecturer will give hints in class. The homework is not different as long as you understand what is taught in the course. For the project, there was about one month for you to handle it, and the professor talked a lot about the topic in the last few classes and also gave enough hints for the project. And some coding is needed for the project",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yj8Wk6e9EdpcpR75KaZT7qocZXEz6SGu",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1175,
                    "name": "DAI, Xi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "FY",
            "date": "Jun 28, 2022",
            "title": "",
            "comment_content": "not hard",
            "comment_teaching": "It was on zoom, lecturer write on white board, and there are notes one canvas.",
            "comment_grading": "good grade. Grade is mainly based on homework and finial project. Easy to get A. No finial exam and midterm. So as long as working hard on homework and project, obtained A grade is not hard.",
            "comment_workload": "workload is ok, send the homework to TA in mail. The workload is not large, an average of one homework for two weeks. For finial project, lecturer gave many hints to us. The only challenge is to plot graph by Python or matlab or mathematica.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QmPizTgAwuXMgYT5bjjJ38RoArCOGVZ4",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1175,
                    "name": "DAI, Xi",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Philosophy_Cat",
            "date": "Jun 08, 2022",
            "title": "Lenient grading :)",
            "comment_content": "Chapters<br />1. Complex numbers<br />2. First order linear ordinary differential equations<br />3. Second order linear ordinary differential equations<br />4. Higher orders of ordinary differential equations<br />5. Systems of ordinary differential equations<br />6. Laplace's transform<br />7. Green's function<br />8. Fourier series &amp; transform<br /><br />This course covers some necessary mathematical stuff for a Physics student.",
            "comment_teaching": "Prof. Dai explained the concepts clearly, though you may need some time to get used to his English accent. However, I think the final project is more related to computer programming rather than the mathematical concepts taught.",
            "comment_grading": "This semester didn't have midterm or final exam. Prof. Dai replaced them with homework and a final project.<br /><br />Homework: 50%<br />Final project: 50% (choose 1 topic out of 2)<br /><br />The grading of the project was much more lenient than I thought, Prof. Dai gave me 100 out of 100 (I guess most people got full mark due to his kindness).<br /><br />I lost 1 mark out of 50 in the homwork part, so my overall percentage is 99%. I thought I may get an A only, because of the lenient grading of the project. Still, I managed to get an A+.",
            "comment_workload": "For the homework part, the workload was quite light. There were in total 5 assignements throughout the semester.<br /><br />The workload of the final project was much bigger. We were required to write a computer program to do the calculations, e.g. solving for the eigenvalues and eigenvectors of a very large matrix, and generate plots. I spent 10% of the time in writing the main part of the program, and the rest 90% in debugging (common struggle of an IT dog lol). I felt pressured since I was approaching the deadline, and I am not good at programming.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VI6CcWkxpeKb1yi8082y5DLfSILh5B8e",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 607,
                    "name": "JO, Gyu Boong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GAYO",
            "date": "Aug 20, 2021",
            "title": "Nice and Necessary",
            "comment_content": "Chapters <br />1. Complex numbers<br />2. First order linear ordinary differential equations<br />3. Second order linear ordinary differential equations<br />4. Higher orders of ordinary differential equations<br />5. Systems of ordinary differential equations<br />6. Laplace's transform<br />7. Green's function <br />8. Fourier series &amp; transform <br /><br />Practical mathematics tools that a physics major student needs",
            "comment_teaching": "Prof. Jo is nice guy and knows how to teach. <br />For each lecture, there's a pdf file serves as lecture notes while Prof. Jo will write notes on lectures as well. <br />He briefly follows the sequence in lectures notes but sometimes he might skip or rearrange them. <br />The way that Prof. Jo teachs isn't just being an audio lecture notes player. Instead when we start a new topic, he will explain where does it comes, why we need it and more to have a comprehensive understanding of the topic. Also, basic examples is used quite often. <br />For me personally, reading the notes will be enough but in case if you want something like summary or a tidy note then please refer to lecture notes. <br />Of course, Prof. Jo is welcome to questions. <br />Very kindly, Prof. Jo will upload the related part of reference book to canvas after the topic is finished.",
            "comment_grading": "The grading is quite nice as well. You can definitely feel that Prof. Jo is trying his best to give out good grades. <br />The total score is 100%, 5% for bonus from homework.<br />20% from two quizzes and 30% from midterm, final counts for 50%. You can give up your quiz then midterm will scale up to 50%. <br />The average of total is 70.2%, since the content isn't that hard so some students score 105% (if I am not mistaken it's 4 students got full marks where totally around 75~80 students in this course). Plus, 10 students score around 90~100%.<br />I scored 90 and get an A-. I guess students scored 90~100% will get A and over 100% get A+. Rather than spending a lot of time and efforts to do math, it is better to make sure you don't make minor mistakes in tests. The questions ain't that difficult so everyone can score high.",
            "comment_workload": "Light. One homework per two or three lectures. Each homework contains three to four questions. Answers can be easily found on google or Chegg. Sometimes questions maybe modified but just same principle.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FtUonkwR5WHHi0llWKbVZZbOXUTFps4N",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 607,
                    "name": "JO, Gyu Boong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jaeyoung",
            "date": "Jan 19, 2021",
            "title": "good course",
            "comment_content": "Basically teaches you math stuff that you'll need in <br />other future physics lessons.<br />I found the content of this course quite useful and fun at the same time.<br />Reasonable amount of teaching content that is just about right.",
            "comment_teaching": "One of the best physics professors in this school<br />Great teaching, uses a whiteboard and handwrites to teach.<br />Much better than useless ppts that most other professors prefer to use.<br />His accent is clear, he cares for his students and welcomes any questions.",
            "comment_grading": "Godd<br />Compared to some other nonsense courses in the physics department which requires you to study almost everything in a thick textbook that the professor didn't even teach, you just have to study what was on the lecture.<br />The exam is not that hard and makes sense. <br />The grading is generous compared to other physics courses, I think if you get mean on everything, you would probably get something like b- or something.",
            "comment_workload": "Not much, if you just concentrate during the lecture and <br />do your homework, you won't need a lot of extra time to prepare for <br />your exams. <br />The homework is also appropriate in length and difficulty.<br />The exam is not too difficult, asks you about more practical stuff rather than hideous derivations.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "u4XB8LcgIMqbtQxcNziERwAV6IEMfg1y",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 607,
                    "name": "JO, Gyu Boong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JUNN",
            "date": "Jun 09, 2020",
            "title": "",
            "comment_content": "This course will cover most of the mathematical tools required for studying classical mechanics, electromagnetism, quantum mechanics and statistical mechanics. Key topics include complex numbers, vector analysis, Fourier series and transform, ordinary differential equations and series solutions.",
            "comment_teaching": "One of the best professors in physics department. Good pace, always clarifies doubts on the spot and overall very knowledgeable.",
            "comment_grading": "The grading is really good<br /><br />Quiz: 20% or 0%<br />Midterm: 30 or 50%<br />Final: 50%<br />HW: 5% (bonus)<br /><br />If you do well on quiz but not so well on midterm the quiz grade will be included in your final score.",
            "comment_workload": "Virtually no workload,except homework that is assigned 6 times in the whole course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LMczfTweW4EFriKjZKbwJ8rhtTiKBgrE",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 607,
                    "name": "JO, Gyu Boong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "holymama",
            "date": "Jun 02, 2019",
            "title": "",
            "comment_content": "Complex Number<br />1st Order ODE (Separable eqn., exact eqn. etc.)<br />2nd order ODE (homogeneous, stability, expotential/sinusoidal output, etc.)<br />Laplace Transform<br />Dirac Delta Function<br />Green's Function<br />System of ODEs<br />Stability of Linear systems<br />Bifurcation<br />Fourier Series, Fourier Transform<br /><br />Quiz: Complex No., 1st ODE<br />Midterm: 2nd ODE to Green's Function<br />Final: All except complex No.",
            "comment_teaching": "JO is a very nice professor (and he can write beautiful words omg) and he gave a lot of advice to study 2124. I skipped all the lessons before midterm as the second half of the content are quite challenging.",
            "comment_grading": "Quiz: 20%<br />Mid-term exam:30%<br />Final exam: 50% <br />Homework: 5% bonus**<br />or<br />Mid-term exam:50%<br />Final exam: 50% <br />Homework: 5% bonus**<br /><br />Cannot comment too much on grading as I get quite high in the position (but I shxt in the quiz, below mean omfg and I all-in midterm and final). But I do know that it is quite competitive towards the grading.",
            "comment_workload": "If you have source, almost no workload. <br />You should know how to make your cheatsheet, rlly important ahha.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "H7B5y9PtFycNND5nAfQp8ieUjlUX4e6p",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 607,
                    "name": "JO, Gyu Boong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kelvin",
            "date": "Aug 03, 2015",
            "title": "",
            "comment_content": "This course mainly focuses on the techniques in solving ODEs, and some basic introduction to complex numbers. <br />The materials taught in this course is actually quite practical. Compared with MATH2352, some relatively complex technique such as variation of parameter and reduction of order are excluded, but instead gives an introduction to some special function such as Green's function.",
            "comment_teaching": "Prof. Jo is enthusiastic in teaching. He always asks for feedbacks from students before lectures start. The pace of his teaching is relativley slow as he will show the steps one-by-one in detail(may be too slow for some sthdents). Also, the lecture notes are well-prepared in terms of content for revision.",
            "comment_grading": "The grading is based on the quiz, midterm and final exam. Homeworks are treated as bonus. However, as the exams are too easy and many students get higher than full mark when hw are included. So getting full mark does not lead to A+ finally(Actually, A is ranged from slightly lower than full mark).It means that hw are actually not a bonus.",
            "comment_workload": "The number of hw sets is small and there are no in-depth thinking problem. All are straight forward and are prepared for getting familar with the techniques.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UeKcRzeFUUy5fenQsZWk2Oz8oEYJZLdJ",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 607,
                    "name": "JO, Gyu Boong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "O",
            "date": "Aug 02, 2015",
            "title": "",
            "comment_content": "I think the content is quite manageable and fun compare to other maths course I learnt so far.<br />Compare to its couterparts Math2352 (which is requirement for Maths and Phys track, I think), the content is broader but shallower. There are not so much proof work to do and all you need to do is using right way to do it (Because there are many ways to solve ODE and Green's theroem is quite difficult)",
            "comment_teaching": "Professor Jo is amazing. He is the best lecturer I seen in this campus so far.<br />He explains things nicely and talks with smile and non-monotonic voice.<br />He will write all the notes on the blackboard so please be punctual. And the notes he put in the LMES (maybe Canvas also in future) is just equal to he wrote but without steps and pictures.",
            "comment_grading": "There is a quiz, a test and a final exam and curriculum of test and exam is a bit overlap (only a bit). There is also hw and these all counts marks.<br />But as long as you are attentive in class, (which I did) and you will get a good grade. ( I got B+)",
            "comment_workload": "Homework can be difficult if you are not paying attention in class but otherwise it is easy to finish it.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}