{
    "error": false,
    "course": {
        "id": 1110,
        "subject": "SCIE",
        "code": "1110",
        "name": "Great Ideas in Science",
        "description": "The course is designed for students with no science background. Using historical great breakthroughs in science and mathematics as examples, the course intends to inspire students to appreciate scientific approaches and develop a genuine appreciation towards human curiosity in the understanding of the world and the power of ingenuity observation to overcome ignorance. The course is composed of 4 modules covering topics in mathematics, physics, chemistry and biology. Examples of topics include geometry, quantum physics, forensic chemistry and theory of evolution. In addition, the course develops students' sense of enquiry thinking and foundation of scientific methods through various active learning processes.",
        "categories": [
            "Common Core (SSC-S&T)",
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2210,
            2110,
            2010,
            1910,
            1810,
            1710,
            1630,
            1610,
            1530,
            1510,
            1430,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 3.48,
        "rating_teaching": 3.35,
        "rating_grading": 3.08,
        "rating_workload": 3.15,
        "review_count": 40,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 57,
                "name": "WILLIAMS, Ian Duncan",
                "count": 33
            },
            {
                "id": 484,
                "name": "CHOW, King Lau",
                "count": 25
            },
            {
                "id": 623,
                "name": "FOREMAN, Bradley Alan",
                "count": 21
            },
            {
                "id": 534,
                "name": "YAN, Min",
                "count": 19
            },
            {
                "id": 640,
                "name": "LOY, Michael Ming-tak",
                "count": 7
            },
            {
                "id": 639,
                "name": "LI, Weiping",
                "count": 6
            },
            {
                "id": 502,
                "name": "WONG, Joseph Tin Yum",
                "count": 5
            },
            {
                "id": 776,
                "name": "FONG, Tsz Ho",
                "count": 5
            },
            {
                "id": 610,
                "name": "CHEN, Tian Wen",
                "count": 3
            },
            {
                "id": 472,
                "name": "WU, Zhenguo",
                "count": 2
            },
            {
                "id": 889,
                "name": "CHEUNG, Sai Kit",
                "count": 2
            },
            {
                "id": 917,
                "name": "CHEUNG, Pak Hang Peter",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "MksFCoQC5R3EUDTHpT2ygrmIScyu9bum",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 0
                },
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 0
                },
                {
                    "id": 610,
                    "name": "CHEN, Tian Wen",
                    "rating": 0
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Kabul",
            "date": "Mar 14, 2017",
            "title": "The worst of all",
            "comment_content": "This course is designed for those without any science background?!! ARE YOU FUCKING KIDDING ME???<br /><br />📂 MATH:<br />After 3 weeks of lectures I was still wondering what the heck he was actually talking bout.<br /><br />1️⃣ Number<br />🔶 Different numerical systems<br />🔶 Conversion between bases<br />🔶 Modular number and divisibility rule<br /><br />2️⃣ Sequence<br />🔶 Sum of powers<br />🔶 Infinite sum<br />🔶 Domino tiling<br />🔶 Fibonacci<br /><br />3️⃣ Proof<br />🔶 Viviani's theorem<br />requires knowledge of geometry, vectors and vector normalization<br />🔶 Arrow's impossibility theorem<br />involves some basic understanding of a voting system, including secrecy, monotonicity, unanimity, fairness and independence of irrelevant alternatives<br />🔶 Formation of formal, logical mathematical proof<br />abstraction, consistency, independence, completeness will be discussed.<br /><br />📂 CHEM:<br />All the DSE stuff AND year-1 course contents crammed in the 3-week schedule. Terrible.<br /><br />The first part was the boring-as-fuck history of chemistry development, including the false Phlogiston theory, discovery of elements, and contribution from different chemists. (need to RECITE!!!)<br /><br />It also included the introduction to the concepts of atoms, several fundamental laws of chemistry, the atomic theory, the periodic table, Bohr's quantum model of atom, concepts of atomic orbitals, chemical bondings, electronegativity, chemical structures, the mechanism of chemical reactions, thermochemistry, chemical equilibria and at last, chemical analysis.<br /><br />📂 PHYS:<br />The first part is the boring-as-fuck history of astronomical science, including a lot of false theories like Celestial Dome theory, geocentric model, and the Copernican revolution.<br /><br />Then it was followed by the philosophy of Newtonian's mechanics, thermodynamics, Carnot cycle, Einstein's general and special relativity (with its application in GPS), quantum mechanics, EPR paradox and Bell's theorem. <br /><br />At last, it ended up in the philosophy of what we perceived as &quot;objective reality&quot; and a description of every unobservable thing as &quot;wavefunction&quot; which would certainly burn your head and fuck you up in the exams. My warning - physics without maths is even more horrible.<br /><br />📂 LIFS:<br />Lots and lots of endless reading materials causing intense headache.<br /><br />He will blast you in the lectures by challenging you philosophical questions like what defines you, or whether you're obliged to take drugs which hinders the progress of elimination and survival of the fittest in evolution, or whether &quot;gene drive&quot; or eliminating the whole species of a certain mosquito to prevent virus spreading is morally justifiable.<br /><br />Nothing much to say. One word to conclude - crazy, at least for normal person like me. 哲學撚 might find it interesting.<br /><br />DUN TAKE THIS COURSE IF U DIDN'T KNOW SCIENCE!!!",
            "comment_teaching": "Very very fast. You can't follow the lectures if u didn't have science background.<br /><br />Especially King Chow's lectures. He's fucking CRAAAAZZZZZZZZY!!!!!!!!!!<br /><br />DUN TAKE THIS COURSE IF U DIDN'T KNOW SCIENCE!!!",
            "comment_grading": "Good grade of you're science students.<br />Sh!t grade if you're from business or engineering.<br /><br />✏️ MATH exam:<br />A game of all or none. The whole exam only consists of 3 questions. If you know how to solve them, you get all. If you are a math noob, you get 0. Good luck!!!<br /><br />✏️ CHEM exam:<br />Students with previous CHEM background can get easy marks, while others have to prepare to write long answers in the alternative part D. Non-science students already lose at the starting line.<br /><br />✏️ PHYS exam:<br />If u didn't have any previous science background and dun even understand what entropy is, then u'll fail miserably.<br /><br />✏️ LIFS exam:<br />The hardest of all. I'm a LIFS student but I still ate shit in the exam, let alone all other business students who dun even know what a prokaryote is and what a eukaryote is. I wasn't even able to finish it in the 1-hour time limit and Ieft like a third of the whole paper blank. Damn!!! But after all it's King Chow's crazy style. Btw your English level and your writing speed are directly related to your exam result. But dun feel disappointed when u receive low marks, cuz EVERYONE will screw up the lifs part (mean is below 30%).<br /><br />Note the increased cut-off compared to previous years: (DAMN!!!)<br />82% -&gt; A+ (1)<br />76% -&gt; A (5)<br />73% -&gt; A- (5)<br />68% -&gt; B+ (9)<br />64% -&gt; B (8)<br />60% -&gt; B- (14)<br />56% -&gt; C+ (12)<br />51% -&gt; C (8)<br />41% -&gt; C- (9)<br />35% -&gt; D (2)<br />&lt;35% -&gt; F (2)<br /><br />15% A-range, 41% B-range, 39% C-range<br /><br />I got the second highest score (78.4%) in the class and ended up in an A. My project-mates got B, C, C- respectively.<br /><br />DUN TAKE THIS COURSE IF U DIDN'T KNOW SCIENCE!!!",
            "comment_workload": "If u're a science student, there's no workload.<br />If u aren't, that's a lot of workload.<br /><br />Oh except King Chow's lifs part...As a lifs student I can tell u almost all the content was new to me and I had tons to read before the exam. If u didn't know any lifs then it doesn't really matter whether u read them or not - there is no way u can understand the assigned readings... REST IN PEACE.<br /><br />DUN TAKE THIS COURSE IF U DIDN'T KNOW SCIENCE!!!",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 25,
            "vote_count": 29,
            "voted": false,
            "is_upvote": false,
            "comment_count": 3,
            "attachments": []
        },
        {
            "hash": "rdvAw5MAdAbCmN7jLERiiHfsVz6S79Lg",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 0
                },
                {
                    "id": 776,
                    "name": "FONG, Tsz Ho",
                    "rating": 1
                },
                {
                    "id": 472,
                    "name": "WU, Zhenguo",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Saber Athena",
            "date": "Jun 17, 2020",
            "title": "勤力有回報 靚Grade Common Core",
            "comment_content": "IMPORTANT: Don't take this course if you haven't learnt CHEM and PHYS before, trust me, you will die. <br /><br />If you have science background, continue reading, I'm here to help. :)<br /><br />Course is split into 4 modules, 6 lessons each. Mid term covers the CHEM and PHYS modules, Final covers the MATH and LIFS modules. <br /><br />=CHEM=<br />&nbsp;&nbsp;Talks about the history of Chemistry. The first few lectures are about the discovery of elements, and then we explored the discovery of chemical structures, and a bit of analytical Chemistry. (Fun fact: Wanna know how phosphorus was discovered? Well a guy tried to make gold by boiling his own piss. He was left with a glowing residue which turned out to be phosphorous.) Sounds fun, right? Now imagine that repeated for 6 lectures 60 pages per lecture. <br />&nbsp;&nbsp;The main problem is, the exam consist of questions like identifying isomers, chemical structures, finding chiral centers... which the professor spent like 5 minutes explaining (really?). If you haven't studied chemistry before, there is no way in hell that you will be able to understand the concept, so please do yourself a favor and don't take this course. <br />&nbsp;&nbsp;//How to survive// <br />&nbsp;&nbsp;If you have studied chemistry before, here's what you wanna do: <br />-Focus more time on revising the CHEM exam cuz that will earn you easy marks. <br />-Memorize the scientists' name and year of discovery. (This is have absolutely no use in your life but at least you will have a decent grade)<br />-**Study the past paper very carefully!!! MUST OF THE QUESTIONS FROM THE EXAM ARE COPIED DIRECTLY FROM THE PAST PAPER!!!<br />-**There will be a part in the exam where you will have to fill out missing boxes in the periodic table. All of the elements that you are required to fill in will start with the same alphabet. So you can easily predict what will be in the exam. <br /><br />=PHYS=<br />&nbsp;&nbsp;This will be worst sh_t in your life. This will be worse than anything you have ever experienced before. First they attempted to teach all of the contents in the HKDSE mechanics (From F=ma up to gravitation) in one lecture. Then they introduced first and 2nd law of thermodynamic.&nbsp;&nbsp;Wave-Particle duality, quantum physics and relativity. (Each of those topics they spent 1 lectures to go through)<br />&nbsp;&nbsp;No, I am not kidding. <br />&nbsp;&nbsp;Unless you have learnt all those topics before, (For example if you are a theoretical physicist) There is really no way that you will be able to understand the concepts. <br />&nbsp;&nbsp;//How to survive// <br />-Take a look at the HKDSE physics textbook before taking the exam. Some of the questions are extremely easy HKDSE level questions. They will allow you to get easy marks. <br />-Memorize as much of the PowerPoint as you can (For example: What happened in Fukushima, how does a laser pointer work etc...) They do not require physics knowledge, but will grant you easy 10-12 marks. <br />-If you have time, go for the &quot;low hanging fruits&quot; such as first and second law of thermodynamics. <br />-**Memorize the year and the scientist of discovery. There will be a 5 mark MC asking those. (5 marks are quite a lot)<br /><br />=MATH= <br />&nbsp;&nbsp;No Calculus required!<br />&nbsp;&nbsp;Contents are quite good. <br />&nbsp;&nbsp;Talks about 2 of the unsolvable mysteries in MATH (Fancy name is &quot;millennial problems&quot;). Essentially someone some years ago found out that 7 Maths problems are unsolvable, and decides to award 1 million to whoever solves the problem. Some years later, a Russian dude actually solved one of the problem but refuses the 1 millions award cuz he was &quot;picking mushroom&quot; (?) (Seriously look it up). <br />&nbsp;&nbsp;The two unsolvable problems discussed in the course are &quot;Riemann Hypothesis&quot; and &quot;Poincare conjecture&quot;. <br />&nbsp;&nbsp;You just have to understand what the problems are about and are not required to actually solve them (Apparently). <br />&nbsp;&nbsp;//How to survive// <br />-Try to understand the problems and their derivation, this is no use memorizing in this part. <br />-Watch the lecture videos, ask the professor if necessary. <br /><br />=LIFS= <br />&nbsp;&nbsp;There is nothing much I can say about this part. At late November school was suspended and we were sent annotated Powerpoints to study ourselves. Final exam consist of an essay question which we have 24 hours to workout, subjected to Turnitin.&nbsp;&nbsp;<br />&nbsp;&nbsp;If you are taking this course this year, chances are your exam will be nothing like ours, so don't bother. <br /><br />=Poster= <br />&nbsp;&nbsp;We are asked to create a poster in one of the topics they provided. The competition is NOT strong. Just try to throw as many contents as possible into a piece of very large paper and you will be fine. (I wrote like 3749 words, our poster came second) <br />&nbsp;&nbsp;The winning group won by their great design and good explaining. <br />&nbsp;&nbsp;One of our group mate went missing. I tried to contact him 5 times through out the project but he replied to nothing. I reached out to the professors for help, they couldn't care less. <br />&nbsp;&nbsp;A ended up doing almost everything for my group cuz Athena is a goooood guyyyyy.",
            "comment_teaching": "=William= (CHEM)<br />Cool guy. I can see that he enjoys teach this subject very much. <br />Attending his lesson feels more like listening to him telling stories. Lessons are enjoyable to attend, exam not much so. <br /><br />=Foreman= (PHYS) <br />&nbsp;&nbsp;He is like the walking definition of Physics. Talks in a very flat tone, makes you wanna sleep, loves his mug of coffee.<br />He does not bother explaining the difficult concepts. You won't understand them anyways. He knows that perfectly well. He does not care. <br /><br />=Frederick Fong= <br />&nbsp;&nbsp;I would date him. (No joke)<br />&nbsp;&nbsp;Makes many joke (Although most of them are awkward). Makes the topic very interesting to study. Does a good job explaining the concepts. Willing to answer any questions. Designed the exam in a way that if you revise, you will get full marks. <br />&nbsp;&nbsp;He is just... very cute! xx<br /><br />=Wu something= (LIFS)<br />&nbsp;&nbsp;Because school was suspended, I have not seen him before, and I have only heard his voice through the annotated ppt. (Actually Im not sure if that is him)",
            "comment_grading": "Good grading if you are willing to work hard. When I say working hard, I mean it. <br /><br />Grading scheme: Highest component: x0.25 Lowest Component: x0.15. The rest: x0.20 <br /><br />=CHEM=<br />&nbsp;&nbsp;Exam consist of a mixture of rote memorization questions and Chemistry questions. There is no two ways to tackle to rote memorization ones, you have to study them hard. On the other hand, you will tackle the Chemistry problem with ease if you paid attention in DSE Chem. <br />My Grade: 92/100<br />Highest: 93/100<br />Average: 72.9<br />Median: 76<br /><br />=PHYS= <br />&nbsp;&nbsp;Exam consist of a mixture of rote memorization questions and calculation questions. Don't be scared if you don't know how to do the calculation ones, In my exam, I stared at the relativity derivation question for a while, whispered to myself:你都癡綫 and skipped it. <br />My Grade: 77/100 <br />Highest: 77/100 <br />Average: 48.5<br />Median: 49<br /><br />=MATH= <br />&nbsp;&nbsp;The professor said that the questions are based on logic reasoning instead of correct answer. So you can get the full mark even if you cant get the questions right. Do the revision, its worth it.<br />My Grade: 100/100 (8 Students got full mark!)<br />Highest : 100/100<br />Mean: 74.1<br />Median: 83 <br /><br />=LIFS= <br />24 hours essay, research done online. <br />My Grade: 87.5/100<br />Highest: 87.5/100 <br />Mean: 48.3<br />Median: 47.5 <br /><br />=POSTER= <br />Our Grade: 8.1<br />Highest: 8.4",
            "comment_workload": "=CHEM= <br />Most of the time was consumed in making my own notes. <br />Total work time: About 20 hours. <br /><br />=PHYS= <br />Most of the time was consumed in making my own notes. I would strongly NOT recommend making your own notes as they don't seem to really work. Spend more time memorizing the PowerPoint. <br />Total work time: About 15 hours. <br /><br />=MATH= <br />Make your own notes as the exam is open book. <br />Total Work time: About 10 hours. (Maybe less)<br /><br />=LIFS= <br />Total Work Time: About 30 hours (Including lessons) <br /><br />=Poster= <br />I basically did all the work for my group. <br />Total work time: 30 hours (Maybe a bit less) <br />(Three days worth of work in 園周角自修室) <br /><br />-Saber Athena",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 10,
            "vote_count": 10,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "5NIwxLoHHLrRkmfMf28GfgIqgOALH0S1",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 502,
                    "name": "WONG, Joseph Tin Yum",
                    "rating": 0
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 0
                },
                {
                    "id": 776,
                    "name": "FONG, Tsz Ho",
                    "rating": 1
                },
                {
                    "id": 917,
                    "name": "CHEUNG, Pak Hang Peter",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TR",
            "date": "Jan 10, 2021",
            "title": "Do NOT take this course, science background or not.",
            "comment_content": "Chemistry<br />Lecture 1 Atoms and Elements<br />Lecture 2 The Periodic Table<br />Lecture 3 Chemical Bonding<br />Lecture 4 Chemical Structure<br />Lecture 5 Chemical Reactions<br />Lecture 6 Chemical Fingerprints<br />It was nothing too special, just an extension of IB HL Chemistry.<br /><br />Physics<br />Lecture 1 -- Energy and Entropy: Basic Ideas<br />Lecture 2 -- Energy and Entropy: Applications<br />Lecture 3 -- The Quantum Revolution: Wave-Particle Duality<br />Lecture 4 -- The Quantum Revolution: Applications and Entanglement<br />Lecture 5 -- Theory of Relativity: Basic Concepts of Space and Time<br />Lecture 6 -- Theory of Relativity: General Relativity and GPS<br />This was by far the most difficult module. I studied HL Physics at IB and even then I was like what the heck is going on. It's unrealistic to expect students to fully grasp thermodynamics, quantum mechanics and relativity in 9 hours!<br /><br />Mathematics<br />Week 1: Poincaré Conjecture<br />Week 2: Google PageRank and use of matrices<br />Week 3: Arrow's Impossibility Theorem of Voting<br />This was my favourite module. I didn't learn any of this in IB (besides matrices) but it was still quite simple.<br /><br />Life Sciences<br />L1&nbsp;&nbsp;Biology Numbers<br />L2 Cells and Genes<br />L3 Recombinant DNA<br />L4a Viruses<br />L4b Malaria<br />L5b Microlagae, blooming and Bleaching<br />L6 More biological numbers<br /><br />Presentation<br />We were assigned groups and had to choose a topic to give a presentation on. We chose computers and the quantum revolution.<br /><br />Overall",
            "comment_teaching": "Chemistry<br />Professor Williams was ok - he made attempts to engage the class and didn't just read off the lecture notes.<br /><br />Physics<br />Professor Foreman's teaching was lackluster given the fact that he did not explain any of the calculations which made up half of our physics exam. This lack of care led the class average of the physics exam to be 52% which was shocking given the average of the other tests were around 70%. To make up for this, the professor and TA (Dr. Peter Cheung) decided to basically add 20% to everyone's grade. Also, more than half the class got the PRS questions wrong.<br /><br />Mathematics<br />I think professor Fong was by far the best instructor of the four. He made the content simple, engaged the class and generally brought a good vibe to lectures. His teaching is the only reason why I'm not giving this section an E.<br /><br />Life Sciences<br />The lectures were extremely boring. Professor Wong made little effort in making the material interesting, and instead jumped from topic to topic which made the lectures confusing.<br /><br />TA<br />Dr. Peter Cheung was amazing. He was incredibly nice and really tried his best to help the students. He facilitated our group chat and gave us lots of advice and was the bridge between the students and professors. He also gave us appropriate feedback while planning the group project.",
            "comment_grading": "Chemistry<br />So there are 3 parts - you need to do part A and B and either C (calculations) or D (essay). The professor takes the higher grade of part C and D. I personally did part D because I messed up some questions in part C.<br />Me: 84% (49/60 in parts A/B, 35/40 in part D)<br />Average: 74.3%<br /><br />Physics<br />This was reallllly difficult. As mentioned in the teaching section, professor Foreman did not go over any of the calculations which then pulled the average down since half the paper was just calculation questions.<br />Me: 81.67% (61% before they made the adjustment)<br />Average: (52%)<br /><br />Mathematics<br />Three questions, one on each topic. As long as you understand the lecture notes the questions should be fairly straightforward.<br />Me: 82% (2% was deducted for submitting it one minute late)<br />Average: 72.4%<br /><br />Life Sciences<br />Ten questions, nothing too difficult. I made some silly mistakes though.<br />Me: 70%<br />Average: 84%<br /><br />Presentation<br />Me: 76.55% (didn't get any bonus points for participation).<br />Average: 80%<br /><br />Overall<br />Me: 79.55%<br />Average: 77.4%<br />Grade: B<br />B+ is 81%.<br /><br />I took IB HL Maths, HL Physics and HL Chemistry and I can confidently say this is not a suitable common core course for anyone, science background or not.",
            "comment_workload": "There were no assignments but I think it's bold to assume that in two weeks students will have a solid grasp on the subject.<br /><br />To prepare for the maths and chemistry exams, I just made notes from the lecture notes which got me a decent grade in both. For biology I just went on biology MCQ websites to prepare because there was nothing really useful on the lecture notes. For physics I really struggled with the content so I reviewed my IB physics textbook (the engineering, quantum mechanics and relativity options) as well as going through online courses because c o n f u s i o n.<br /><br />Since everything is online and open book you can just google the answers if you're not sure.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 6,
            "vote_count": 6,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HusT3n45u9K1Gs1KK3Io3jxfEFIxOBzn",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 502,
                    "name": "WONG, Joseph Tin Yum",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ttteeoo",
            "date": "Sep 10, 2021",
            "title": "Don't, don't, take, this, course",
            "comment_content": "Look. If you haven't studies much sciences stuff before, hell, even if you had studied science stuff before, if ur not some science GENIUS, in love with science or CRAZY, try not to take it, ok ? Trust me<br /><br />The content shouldn't be too hard, if the teacher actually taught WELL !",
            "comment_teaching": "Pretty bad.",
            "comment_grading": "I don't know yet, it's my third lecture and I'm out.",
            "comment_workload": "I've only done three lectures so I don't know. I don't even wanna know. Must be crazy.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ddteHAnmKkpQGW4nG0zFY7fhihwzkVKC",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 0
                },
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "292807",
            "date": "Jan 23, 2017",
            "title": "",
            "comment_content": "Content was very interesting, especially the LIFS and the PHYS module. However, I feel so pointless learning all these &quot;interesting&quot; information. Math was just horrible. There were mistake in every 5 slides in his ppt",
            "comment_teaching": "For YAN, Min, he is pretty horrible.So many mistakes and he doesn't know how to explain.",
            "comment_grading": "Grading is okay. I didn't do that well however, still got a decent grade. Mean could be low, however, the grading is indeed lenient.",
            "comment_workload": "Workload isn't that tough either. What I do find good in this course is the group project. That was something interesting and fun to do.",
            "rating_content": 4,
            "rating_teaching": 1,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sd6GxkSiOozYqi1G29SPZbVLELnWyUTX",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 0
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 0
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kenxd",
            "date": "Jan 23, 2017",
            "title": "",
            "comment_content": "Lots of HISTORY and HISTORY.",
            "comment_teaching": "For the Maths part, I totally didn't understand what Prof. Min trying to express. And he made lots of mistake in his notes and kept saying sorry for making mistakes on this slides again and again. He just told us to search on Internet for more and he just searched on the Internet to make these notes. Mid-term scores were released in the final exam period and with no mean scores and standard deviations.",
            "comment_grading": "For maths part, three questions were given and each one carries about 20 points. And you don't even understand the questions and then scored low.",
            "comment_workload": "With notes and Internet sources provided, you can learn&nbsp;&nbsp;new things in these four fields, but you are advised self learning for scoring high (Maybe).",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "c9Ub9qozlONT5MHBvAf6LazOrkzfIVr6",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 0
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 1
                },
                {
                    "id": 610,
                    "name": "CHEN, Tian Wen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Starry Miracle",
            "date": "Jan 03, 2018",
            "title": "",
            "comment_content": "Terribly HARD<br /><br />Yes do not trust that &quot;the course is designed for students with no science background.&quot;<br /><br />It will teach you from the easiest to the hardest (eg. LIFS1XXX ~&gt;4XXX) in only 6 lessons.<br /><br />Chem is talking about history (memorize+F.4~5 CHEM please)<br />LIFS (memorize and attend lessons)<br />PHYS (memorize and attend lessons)<br />MATHS (if you ain't maths team in Primary/Secondary life, good luck and have fun)<br /><br />//\t(course background excerpt)<br />The course is designed for students with no science background. .... The course is composed of 4 modules covering topics in mathematics, physics, chemistry and biology. Examples of topics include geometry, quantum physics, forensic chemistry and theory of evolution ....",
            "comment_teaching": "Williams is the best &lt;3<br />He is the only one using a (so call) normal pace to teach.<br /><br />If you don't know anything about that module, it will be very hard to keep up with. (利申: 中學有讀 Phy, Chem, 數有5)",
            "comment_grading": "Take this if you are passionate in science and not caring about your grade.<br /><br />有science底(自問above average) C+ REALLY....",
            "comment_workload": "King Chow will ask you to read some articles and will play some videos during lessons.<br /><br />Williams will do the IPRS (right?) for 5% attendance score.<br /><br />Also a stupid group project covering 1 of the 4 modules have to be done. You will have to do the presentation and a poster (3 days exhibition)<br /><br />At least no homework, right?",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "BQZaX8LPVGhrrZEYJbPYW6Rj2plx9A7k",
                    "name": "SCIE 1110 Course outline Fall 2017 Revised",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "Kii3wMmS2ktg1kibcFC9mWBC3k7GL3F9",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "東",
            "date": "Dec 08, 2016",
            "title": "",
            "comment_content": "The course involved too much in-depth knowledge and is not really designed for students with no science background.",
            "comment_teaching": "Fair. Kind of boring though. Skip lessons if you want to.",
            "comment_grading": "Not sure as the grade is not released. Won't recommend it if you are not confident enough in science sector, as you will find it extremely difficult to catch up the class.",
            "comment_workload": "No individual assignments. You have to work as a team to create a poster for a certain science-related topic and present to the professor at the end of the semester.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mtjhS8U7vdtS9CmHFVY3Gs4fVSpzKKYZ",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rezzaldo",
            "date": "Dec 07, 2016",
            "title": "Abort mission unless you want to be mentally abused by this course!",
            "comment_content": "Content is suitable for non-science students.<br />I initially came to learn physics in this fast-track course. Cramming the physics theories and explaining them accurately closed-book in 3 weeks are absolutely hard though.<br />And the difficulty is not for non-science students who didn't excel in science subjects!",
            "comment_teaching": "YAN: so many uh...uh...uhs, but explains the math concepts clearly, just that you need time to digest ancient maths.<br />WILLAMS: takes iPRS for additional points to your chem exam. Average teaching.<br />FOREMAN: teaches a lot of informative stuff in physics. If you are a student with little/no prior phys knowledge, I suggest you read and try to understand the slides before lectures coz there's a hell lot of crappy formulae to memorise.<br />CHOW: such a lively biology prof. Uses the surroundings to explain some biology concepts (e.g. genetic drift from smarter students to students who like to fall asleep in class). Conceptualisation is much more important than rote reciting.",
            "comment_grading": "Only chem and phys exam are closed-book. (But what's the difference?)<br />For average students like me, I was expecting below mean for the course.<br />You either understand the slides thoroughly or just flunk the course and curse the hell out of it. Otherwise, say bye bye to your GPA.<br />Luckily, I've met terrific groupmates that could be relied upon and we all had excellent scores on both our poster and oral presentations. :)",
            "comment_workload": "Poster presentation + ppt on 2 separate days.<br />Q&amp;A session afterwards.<br />No homework. No attendance-taking. That's the good thing of this whole course.<br />Provides sample exams with answers.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fU0aOQwkdODqKkU2OOE5E1FuuXfh9bF4",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 639,
                    "name": "LI, Weiping",
                    "rating": 1
                },
                {
                    "id": 640,
                    "name": "LOY, Michael Ming-tak",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "marcovong",
            "date": "Jan 22, 2016",
            "title": "Don't recommend",
            "comment_content": "Need to learn for all PHY, CHEM, MATH, and LIFS module. Mid term is the PHY and MATH module exam while final is the CHEM and LIFS module exam. All of them share the same amount 20% each, along with the presentation and poster that includes the other 20%.",
            "comment_teaching": "It's really boring to attend to class since the professors just read from the powerpoint slides and there are a lot of content that requires prior knowledge to understand what the professors' are saying",
            "comment_grading": "The grading is really bad. I got Physics 0.5 SD above mean, math on mean, Chem 0.5 sd below mean, LIFS below mean 2 sd, project mean, presentation mean. the outcome is a C-. <br />Even though I didnt perform well, but I think the LIFS module really depends on whether the professor likes your answer or not.",
            "comment_workload": "There's one randomly group project which you need to make a poster and do presentations (during the study break). The workload is low, which only King Chow's part require reading materials.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ichFA1jQjMYUNj9VKkMizo3rh9bU9tX4",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 639,
                    "name": "LI, Weiping",
                    "rating": 1
                },
                {
                    "id": 640,
                    "name": "LOY, Michael Ming-tak",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YY_",
            "date": "Jan 14, 2016",
            "title": "Please take this course if you wanna ruin your gpa",
            "comment_content": "Physics and Maths is fine<br />Although the content of physics is hard to follow without any background.<br />Chemistry content is fine, but is not really relevant to exam.<br />Life Science is hard and exam sucks.",
            "comment_teaching": "They are nice tutor but its sooooo bored.",
            "comment_grading": "Physics, Maths and Chemistry's exam is not bad since they will provide you enough practice(past papers) which is very similar to the real exam.<br />Life Science's exam is totally a nightmare.<br /><br />Project group mates were assigned, free-ridersssss<br />Professors are expecting you to know all the details of the topic, even the course content do not include",
            "comment_workload": "This semester they arrange 2 presentations in the study period, which is so annoying.<br />Only exams there, no quiz",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YoKqHw7DPshsw3slOxOfhQePYoct21zU",
            "semester": "2014-15 Fall",
            "instructors": [],
            "is_author": false,
            "author": "V.lylit",
            "date": "Aug 16, 2015",
            "title": "",
            "comment_content": "Factual summary: Physics and Maths before midterm; chem and bio after midterm.<br />Non-factual: 6 classes for each component but think about it as one semster in each part. Some parts could be quite easy for people who took sciences in high school (me inclusive), but other parts... well that depends on how much you know *way* beyond the books. Otherwise the content is pretty interesting (provided that you're into sciences.)",
            "comment_teaching": "I'm quite alright with all of them - they are all nice people and none of them made me fall asleep (...) but I'm especially in favor of Prof Chow: he conveyed the necessary messages (along with mountains of info) very passionately - to me that's the most important thing to decide whether I would end up sleeping in class or not.",
            "comment_grading": "1. There are a lot of science geniuses in this class, so don't expect good grades unless you feel like you could get at least 1.5sd above mean or something... in everything.<br />2. Don't choose a lifs topic for your project if you're not ready (i.e. willing and able to survive being blasted) in the presentation. <br />3. Good luck if you have groupmates that screw you up - and don't let that screw your mood while you prepare for the exams.<br />4. God knows if you'll be asked about what differentiates alive from merely living in the lifs exam (aka half of the final exam). You can answer anything you want, but make sure you're writing it out logically.",
            "comment_workload": "In sum: lectures that I absolutely recommend that you go to, a project that entails making an A0 sized poster and presentations (one for the respective professor, one for generally other people who want to look at your poster), a midterm and a final exam. Given that there are lots of things to learn in class, there are lots of things to remember... @@<br />Tip: if I'm not wrong, you can print your posters in the library (at lg1 or sth). <br /><br />Final note: if anyone assigns you things to read, READ. Plus, if there are past papers or &quot;homework&quot;, do them - they can directly aid your revision, if not your grade.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5KBenD5Nucplhs53BhWGmSvdJGdO0E51",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 502,
                    "name": "WONG, Joseph Tin Yum",
                    "rating": 0
                },
                {
                    "id": 776,
                    "name": "FONG, Tsz Ho",
                    "rating": 1
                },
                {
                    "id": 889,
                    "name": "CHEUNG, Sai Kit",
                    "rating": 0
                },
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wai Ching",
            "date": "Jan 04, 2022",
            "title": "Even with science background, it may be catastrophic due to poor performance in one part: Got C-grade!!!!!",
            "comment_content": "This course was divided into 4 parts: Life Science(LIFS), Maths(MATH), Physics(PHYS) and Chemistry(CHEM). <br /><br />LIFS: I didn't know what was going on. I could only keep jotting down notes for those information that did not include in lecture notes. I predicted it may appear in mid-term, and my prediction was correct: Quite a lot of MCs were those information. I could feel that more than half of the content was related to everyday life, yet poor teaching, poor elaboration and messy lecture notes undermined my impetus.<br /><br />MATH: It seemed there were lots of stuff to study, graded content was only as little as a particle of sesame. Don't panic. Simply complete past papers provided will be OK, given that you understand the definitions of some specific terms will be fine. Professor will unexpectedly state the key of how to distinguish between some properties.<br /><br />PHYS: First came a bunch of physics quantities, then discussed the history of the discovery of some important theories.<br /><br />CHEM: Seemed like a history of Chemistry discoveries mixed with Chemical knowledge.<br /><br />Even if the content seemed interesting at first, the course was dull in some modules.",
            "comment_teaching": "Wong was the professor of LIFS part. His teaching was unsatisfactory as his notes were messy, he spoke softly, jumped from one idea to another irregularly. Despite you still need to jot down some information that was not stated in lecture notes since mid-term may appear such questions.<br /><br />Fong was the professor of MATH part. With the help of the easy and little content, he may be the only professor that I was willing to listen. The calculations were simple that he needed not to elaborate much. <br /><br />Cheung was the professor of PHYS part. He either only read out the words of Powerpoint or elaborated inadequately for some complicated parts.<br /><br />Williams was the professor of CHEM part. Even if the content was lack of linkage, Williams still tried to elaborate them in a simpler way or using definitions, where I was astonished. He used iPRS to let us gain bonus marks, not matter we answered correctly or not. This might increase our willingness to attend his lessons.",
            "comment_grading": "LIFS 20% 1 hour (20 MCs but deleted one MC due to mistake made)<br />MATH 20% 1 hour (3 conventional Qs, two highest marks Qs will be multiplied by two, the remaining one remained the same)<br />PHYS 20% 1 hour(22 MCs)<br />CHEM 20% 1 hour (True/False, MCs, Short Questions OR Long Questions, I suggest Short rather than Long as Short Qs were much easier than Long Questions) <br />Group Presentation 20%(groupmates were assigned randomly, chose a topic in mid-late-September, submit the final version on 3rd December)<br /><br />My grades: LIFS: 11/20 (Mean:11.8/20)<br />MATH:73/100(Mean: 70.1/100) (Overall student's performance please see Gradebook in attachments)<br />PHYS:30/100(Mean:58.2/100) (This is why I got C-grade!!!!)<br />CHEM:69/100(Mean:74.4/100) (Overall student's performance please see third attachments)<br />Presentation:6.5/10(Mean:7.5/10)<br /><br />Overall: 58.4/100(C grade)<br /><br />Please see SCIE1110 Mark+%26+grade for overall student's performance<br /><br />Note that LIFS and MATH will have exam during mid-term whereas other two will be in final.",
            "comment_workload": "Although there were not any homework except Presentation, you ought to study the materials immediately after lessons as early as you can. Otherwise you may be in trouble. I studied early for LIFS and MATH due to much lower workload in first half semester. Despite I could only memorise LIFS content as much as I could due to messy materials. Oh don't forget to complete the MATH module pastpaper and submit it to Canvas provided by Prof. Fong as he will provide feedback for us. He really want us to understand the materials rather than memorising the answers. Good job Prof. Fong!!!!!<br /><br />PHYS and CHEM's performance were poor due too much workload in last half of Fall Sem, especially for PHYS. Even if I had studied PHYS in high school, the questions were in great amount of memorisations with deep understandings. CHEM was not as disastrous as PHYS as I&nbsp;&nbsp;at least recalled those learnt in high school through lectures. <br /><br />Unless you could go through what you have learnt after lectures as soon as possible, don't choose this course!!",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "WWQ0wXFyeVy1QKF91d6wrqlGykqbIMM7",
                    "name": "Gradebook",
                    "format": "pdf"
                },
                {
                    "key": "WIoXbbG6b1oEGDC2eUT8nUpkWeuH14XX",
                    "name": "SCIE1110_Mark+_26+grade",
                    "format": "pdf"
                },
                {
                    "key": "kFxeAjRkb38t4fD9K0NriS5DphMRhJVH",
                    "name": "CHEM module overall performance",
                    "format": "docx"
                }
            ]
        },
        {
            "hash": "g7VG2PsFw3pDsK06UFHLoDkhy46LHe5c",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 502,
                    "name": "WONG, Joseph Tin Yum",
                    "rating": 0
                },
                {
                    "id": 776,
                    "name": "FONG, Tsz Ho",
                    "rating": 1
                },
                {
                    "id": 889,
                    "name": "CHEUNG, Sai Kit",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "/",
            "date": "Dec 28, 2021",
            "title": "The professors you get decide your experience",
            "comment_content": "IMPORTANT: You can look at previous reviews, but make sure to look for the right instructor since how good or bad your experience is totally depends on who your prof is. I am only writing this review based on the professors I met in this term.<br /><br />The contents for my term are listed in the attached files.<br /><br />The course title and contents may sound interesting at first glance but honestly, reality is often far worse. The reviews are true in that you should really not take this course if you don't have a strong science background.",
            "comment_teaching": "LIFS: Prof Wong's lectures are nearly impossible to follow since he jumps from one topic to the next with virtually no coherence. His slides are badly organized and you can't really read anything from them. His pronunciation is bad and sometimes just inaudible, which especially stands out when you attend his lectures through Zoom. He often throws in tiny bits of info, including some very advanced ones like cyclin-dependent kinase, which makes things even worse.<br /><br />MATH: Perhaps the best module. Prof Fong is already popular among students so I bet no need to explain more. He is the only prof who actually treats this course as a 1000-level course. His lectures contain much fewer content compared to other profs' but he spend much time into explaining the concepts carefully so it is worthwhile.<br /><br />PHYS: Dr Cheung's lectures are quite boring since he throws in lots of advanced contents with few detailed explanations and also not good pronunciation. His exam is also quite hard.<br /><br />CHEM: Prof Williams' lectures are also very heavily bombarded with contents on his slides but he does try to explain things a bit clearer. Exam is also not easy but he gives out bonuses based on class activities and he also tries to give you full points for &quot;close-enough&quot; answers.",
            "comment_grading": "Midterm exam: 40% (LIFS 20%, MATH 20%)<br />Final exam: 40% (PHYS 20%, CHEM 20%)<br />Presentation: 20%.<br /><br />LIFS: 20 MCs, containing various bits of info in the lectures, some can be hard. Half of them are actually high school biology (he did mentioned those things in the lectures but I managed to answer those questions merely thanks to my high school biology background).<br /><br />MATH: 3 long questions, not easy to finish in 60 min but the question with lowest point will be halved in your total score so try to go all in for 2 questions that you are more confident with before attempting the third one.<br /><br />PHYS: 22 MCs (only 20 needed to get max score). There might be many tricky and difficult questions.<br /><br />CHEM: T/F, MCs and short ans. First 2 parts are mostly theoretical stuff (incl. memorizing chemists and their contributions, this topic carries a significant amount of points so be careful), part 3 has some calculations. If you are not confident with calculations, you replace part 3 with part 4 (long questions) which can be prepared at home (no notes allowed in exam, you have to memorize the info you researched). But be informed that the prof is more lenient in grading part 3 (e.g. full points given for close answers) and stricter for part 4, as he also actively encourages students to choose part 3.<br />Also, many questions are copied from past papers so do have a look at them.<br /><br />My scores:<br />LIFS: 90 (mean 58.75)<br />MATH: 84 (mean 70.08)<br />PHYS: 85 (mean 58.16)<br />CHEM: 100 (mean 74.37)<br />Presentation: 90 (mean 74.8)<br />Total: 89.8<br />Grade: A+",
            "comment_workload": "It might take some time for you to revise for the exams. I would say it's best to review the contents periodically during the term since cramming would be nightmarish, as there is just too many to dealt with as once. And it would be even harder if you haven't learnt these subjects in high school.<br /><br />The presentation won't take long, just spend several days researching, making slides and you'll be fine. You might also want to finish this one early because there is a chance to submit the draft to the profs who can give you feedbacks (especially prof Williams). Our group submitted the slides to him before the deadline for feedbacks so we were able to make lots of crucial changes and had a high score.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "P4CKlEKJjXCzziIHE2WrqsgSslilS1Zi",
                    "name": "SCIE1110_Course Outline",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "jmez4EK5zqFMAz5h6BM5nrRYX80jklZH",
            "semester": "2019-20 Fall",
            "instructors": [],
            "is_author": false,
            "author": "frankcheng",
            "date": "Sep 15, 2020",
            "title": "",
            "comment_content": "The professors say that it is for students with no science background, but I really don't think so. I studied only chemistry in high school and it is the only part I got good result. I barely passed physics (50/100) and mathematics (28/50), failed the biology exam (3/10 and 4/10) and got 84/100 in chemistry.",
            "comment_teaching": "Though the professors are nice people and really trying to teach, the topic are sometimes too difficult to understand, for me physics especially.",
            "comment_grading": "Not too bad, but probably because the exams were taken online.<br />Before midterm: chemistry and physics<br />After midterm: mathematics and biology<br />The weightings are slightly different starting this year, the best part would weight 25%, 2 weight 20% and the worst one would weight 15%, so it would be easier to pass. The remaining 20% is group project asking to make a poster about certain scientific topics, group mates will be assigned by the professors so no need to worry about finding group mates. The project is fairly easy so you should work hard on it.",
            "comment_workload": "The only work required is the poster, which should not be too time-consuming and fairly easy, but you may need to study hard if you did not study phy/chem/bio in high school.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "RsH4TruqiTS0xupTG4RkikmWHpNdhkGD",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 472,
                    "name": "WU, Zhenguo",
                    "rating": 0
                },
                {
                    "id": 776,
                    "name": "FONG, Tsz Ho",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "licyleo",
            "date": "Sep 08, 2020",
            "title": "good luck",
            "comment_content": "PHY:<br />Energy and Entropy:&nbsp;&nbsp;Basic Ideas<br />Energy and Entropy:&nbsp;&nbsp;Applications<br />The Quantum Revolution: Wave-Particle Duality<br />The Quantum Revolution: Applications and Entanglement<br />Theory of Relativity:&nbsp;&nbsp;Basic Concepts of Space and Time<br />Theory of Relativity:&nbsp;&nbsp;General Relativity and GPS<br />** GOOD LUCK if you aren't a physics enthusiast<br />** the contents are definitely not for those who dun hv science background<br /><br />CHEM:<br />The Elements &amp;&nbsp;&nbsp;Periodic Table:\t<br />•\tDiscovering the Elements: A Brief History; Ancient ideas &amp; metallurgy; Alchemy and the Phlogiston Theory; Lavoisier; Gaseous Elements; Discovering metals; Buchner and atomic spectroscopy; <br />•\tDalton and Cannizarro - atomic masses; Dmitri Mendeleev; Arranging the Elements; Modern atomic theory; Electronic configurations; Periodicity; Expanding the table - man-made elements <br />\t<br />Chemical Bonds &amp; Structures: <br />•\tHistory of bond theory - Covalent, Ionic and Metallic bonds; Linus Pauling, Electronegativity and the Chemical Bond; Bonding and conductivity in solids<br />•\tStructure of organic molecules - stereochemistry; X-ray diffraction the Braggs; the story of Rosalind Franklin, Crick and Watson - DNA; Protein structure<br /><br />Chemical Reactions &amp; Fingerprints<br />•\tTypes of reaction; REDOX and acid /base reactions; Le Chatalier and Chemical equilibria; Chemical synthesis; Catalysis; Pasteur, Buchner, and Enzymes; Petrochemical industry; Energy from a chemical reaction<br />•\tChemical and elemental analysis; Molecular separation and spectroscopy; Forensic and environmental chemistry; CFCs and the Ozone layer; CO2 and climate change; Pollution and remediation<br />** if you took chemistry in your high school, you can aim high in this module.<br />** RECITE all scientist names and the year of discoveries<br />** rmb to study the past paper! The format is nearly the same, even the answers. <br /><br />MATH:<br />Topology<br />Poincaré Conjecture<br />Basel's Problem<br />Riemann Hypothesis<br />** easy to understand<br />** you don't really have to do calculations in this module<br />** if u understand the concepts, u can basically get full marks in this module<br /><br />LIFS:<br />Cells and Biomolecules<br />DNA and its structure<br />DNA Replication and Decoding Genetic Codons<br />DNA Amplification byPolymerase Chain Reaction<br />DNA Sequencing<br />DNA editing",
            "comment_teaching": "PHY: Prof Foreman<br />- boring af, flat intonation<br />- Not sleeping in his class is difficult (as hard as the physics module content)<br /><br />CHEM: Prof Williams<br />- Super nice<br />- Willing to explain in a simple yet detailed way<br /><br />MATH: Prof Fong<br />- I love his jokes<br />- good vibes<br /><br />LIFS: Prof Wu<br />- never seen him before",
            "comment_grading": "Exam part = 80% in total<br />25% (best) 20%, 20% and 15% (worst) <br />Poster = 20% in total (3 students per group)<br /><br />There will be a total of 20-30 topics distributed among all four areas. The group project will count for 20% of the final grade. 15% will come from faculty grading and 5% will come from peer review.<br /><br />Hard work pays off, but definitely not understanding all concepts within a short period of time.",
            "comment_workload": "the workload of the project is fine - easy to handle<br /><br />PHY: <br />- I didnt expect I had to understand the concepts abt quantum mechanics, relativity... mastering these within a short period of time is basically impossible... so GOOD LUCK<br /><br />MATH, CHEM: <br />most time spent on doing past paper/ practice paper<br /><br />LIFS:<br />binge watching lecture videos, nothing more",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4WoZ4qm3BgEfGtTLegM3167QWwhFQhea",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Vilanna",
            "date": "Sep 02, 2019",
            "title": "",
            "comment_content": "It is my first class, so I can't really talk about the content. He taught little about the atoms, molecules and periodic table, and only thing I want to say is that this course is really not for the people who have no science background...You may need to self-study the basic knowledge of science",
            "comment_teaching": "I think Professor Williams is alright but he teaches so fast, I only have one lesson so far, so I can't say more...But I think it may get boring if I have more lessons...",
            "comment_grading": "I don't have grading yet, but I don't really think I can get a really good grade...",
            "comment_workload": "The content for the whole year is quite a lot, so I think the workload will be large...",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tzdoP0FDkimPseOdOZrYWIjPobxE4zi7",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 0
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "lmk",
            "date": "Jul 22, 2019",
            "title": "Terrible course for non-physics background",
            "comment_content": "Maths - talk about the history of Maths like the number history in China and Greek. Also, include the base calculation and the expression of the past. <br /><br />Chem - talk about the background of chemistry and the fundamental concepts like the nature of chemical and the bonding. If you have studied chemistry in your secondary school, you could understand the content easily. <br /><br />Biology - some history and background of biology. No difficult concepts.<br /><br />Phys - the most difficult part in the course. It covers many difficult topics like quantum physics and the calculation is very difficult. I have not studied Physics before and I could not understand the concepts even though I had tried my best.",
            "comment_teaching": "For the physics professor Alan, the tone is very flat and boring which make you hard to focus. <br /><br />For the biology professor, he is very funny and his lessons are funny. He always said that if you memorize the notes, mark will be deducted.<br /><br />For the maths professor, his notes are disorganized. There are many errors. <br /><br />For the chemistry professor, he could explain the concepts clearly and his notes are better.",
            "comment_grading": "It is very terrible ! ! ! !<br /><br />First exam -&nbsp;&nbsp;below mean 0.5 sd (bio - above mean, maths - below mean near 1 sd)<br />Second exam - unknown (chemistry part is in mean)<br />Project - unknown<br /><br />Final Grade - D ! ! ! ! ! !&nbsp;&nbsp;I think it is because I screwed up the phys exam as I know nothing in the exam although I had tried my best to study the content through lecture video and YouTube. Basically, if you dont have physics background or you are not genius, dont register this course.",
            "comment_workload": "2 exam with 2 parts each. (maths+bio/chem+phys)<br />Project. You need to create a banner to answer the chosen questions and present to the professor.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Bz8XnutzoQoM21QCJQPAYCIQ6kvJjSGG",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 1
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Chapmann",
            "date": "Jan 13, 2019",
            "title": "Omg worst course",
            "comment_content": "Absolutely not suitable for any student without science background. Should not be a 1000 course. Stuffed the entire senior high school Chemistry course into 6 lectures.",
            "comment_teaching": "Real demonstration of spoon feeding education. King Chow is a bit better, with some discussion in lessons. But other 3 instructors are really only lecturing, and barely reading the wordy powerpoints( I'd rather read them on my own...)",
            "comment_grading": "Poor, poor, poor. Repeat important facts for 3 times.",
            "comment_workload": "Loads of revision, but you still can't get the job done. Contents are really hard to understand and you really have to read a lot. The poster project is not even a poster thing. I made a poster together with my friends, a real poster with the most important concepts in words and some pictures, but then the instructors say that the content is not enough. So that is not a poster, that is an info board!!!! Come on this is a stupid course don't take it please.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "8H6q3RDh5Asaucw7L11JcieFPMCy3LLP",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 0
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "AceOfSpades",
            "date": "Dec 10, 2018",
            "title": "DO NOT TAKE THIS COURSE, NOT SUITABLE FOR THOSE STRIVING FOR GPA",
            "comment_content": "The 2018-19 order is MATH, LIFS, PHYS and CHEM. Video lessons are provided.<br /><br />Let's be straight. The course description is completely misleading. You must have at least some of the background scientific knowledge, especially PHYS and LIFS.<br /><br />I certainly do not advise you to take this course, even though you are a Science student. It is not efficient to acquire knowledge from four different modules in one semester. I would rather take 4 separate courses from each of these fields rather than a 4-in-1 package.",
            "comment_teaching": "MATH:<br />The professor is decent. Can understand what he says during the lectures. However, what needs for the exam is actually less than his ppt. I could say more than half of his ppt is not being taught, instead they are some information for the group project.<br /><br />LIFS:<br />Very interactive with students. May require some reading, but not for exam, just for your own knowledge. The professor is very kind, always trying to let us engage in his lessons.<br /><br />PHYS:<br />Be prepared that some parts are DSE knowledge, e.g. conservation of energy, heat transfer, atomic world, etc. The earlier part of the session is some of the basic knowledge, but it gets harder as the module progresses. <br />It has to be pointed oout that the content it teaches is quite random, from thermodynamics to quantum theory. It's like squeezing different fields of Physics into 6 - 8 lectures. Personally, I find it difficult as I don't know where to start my revision.<br /><br />CHEM:<br />The professor takes 5% attendance from the IPRS system, but that's trivial. Same as LIFS, he is quite interactive. The earlier part is also the fundamentals, but as it progresses, the content is more or less similar to the HKALE syllabus.",
            "comment_grading": "Nothing can be said about the grading as I haven't taken the final exam at the time I write this review. All I could say is the exam paper style is entirely different from each module.<br /><br />MATH:<br />Only consists of 3 questions with sub-questions in each of it. If you happen to get the wrong answer, game over.<br /><br />LIFS:<br />The exam style is interesting, but whether it helps getting a good grade is up to you. The professor emphasized that ALL scientific terms (e.g. DNA, enzyme) should not be memorized, and thus must not appear in your answers. It might be difficult to adapt to this style when formulating an answer.<br /><br />PHYS and CHEM:<br />Their exam papers are very similar. You need to remember the contributions of past scientists and their names for certain questions.<br />PHYS is very random. It's like squeezing lots of random knowledge into one package, leaving you for your own revision.<br />CHEM might be fairly easy since there's not much to memorize. Lots of them are just common sense if you have a scientific background in high school/secondary school.",
            "comment_workload": "Only LIFS requires some reading for in-class discussion. The articles are quite interesting to read through. Perhaps the reading materials for the last LIFS lecture is the most important of all, since you need to debate of certain LIFS topics later on.<br /><br />The workload focuses on group project, which includes Powerpoint presentation and poster presentation. Again, the workload is related to your groupmates. Note that the groupmates are randomly assigned to you, and it usually consists of Year 1, 2, 3, one from each year. In my case, 2 of them are free-riders and deadline fighters. You have to urge them to cooperate, otherwise they won't do it until the last moment. As for the poster presentation, it is the most annoying of all. You need to do a joint payment to print A0 poster for manned presentation during the study break.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "zOFjdCt6lkR7KkxYfwA7AwmghUprOsiG",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "dani23",
            "date": "Feb 06, 2018",
            "title": "Ok SSC Common Core Course",
            "comment_content": "To begin, I am a first year SBM student some basic knowledge of biology and physic. 0 knowledge of Chemistry <br /><br />There are 4 different part (5 if including the project)<br /><br />Chemistry - Mostly history, and some basic things like chemical bonds (I didn't take any Chem course in high school but it was acceptable)<br /><br />Biology - about all kinds of theory like evolution, cell, genetics <br /><br />Physic- (Hardest part for me) - simple kinetic and potential energy, thermodynamics<br /><br />Math - (quite fun) - Mostly about proof theorem - also things like binary numbers, Euclidean geometry, Domino theory, etc<br /><br />Overall, there was quite a lot of content, but it is split into 2 parts with BIo and Chem being first for us, so our midterm was only about this. Our final is only about math and physics.",
            "comment_teaching": "Prof Williams (CHem) - great professor, teach things clearly and was also helpful to give us a review session that basically tells us what to prepare for the mid-term 1 day before the test<br /><br />Prof King Chow (BIo) - great professor and really fun. He keeps telling us to think deeper than what is given on the ppt, and seem like he love teaching Bio to us<br /><br />Prof Yan (Math) - great professor, he speak really good English unlike what other people say in other reviews, I was able to follow easily what he teaches me<br /><br />Prof Foreman (Physic) - dull professor, but is clear about what he teaches, many people just seem to do other things when he teaches<br /><br />Overall, all the professor is great, they speak fluent and understandable English (maybe because I am a good English speaker)",
            "comment_grading": "The Grading is ok, I received an A, but I don't know my final exam score. THe score was not released. <br /><br />Chem - I did part D, which is just long answer questions given to a student that does not have chemistry background (you can also pick C which is calculations relating to Chemistry). Part D is around 50% of your score, and the other half is multiple choice (easy if you go through the notes). THere was also 5 extra points if you attend the professor class.<br /><br />I think the mean was around 75 points or so, I got a 92.5 (5th highest in the class). <br /><br />Bio -&nbsp;&nbsp;I got a 31 out of 40, which is 11SD above the mean (the SD was 1 point). We were given 2 choices, long question or an essay which we have 1 week to plan and write before mid-term. I pick the essay and received the 2nd highest score in class i think. Most of my friend that pick long answer score under or on the mean.<br /><br />Math - open-note, and only 3 questions<br />Physic - there is a formula sheet, I think I failed this module (i study the most in this part, but seem to forgot almost everything)<br /><br />Project- make a huge poster, and our team won a price<br /><br />The last three parts' score was not released, so I don't know the score.",
            "comment_workload": "The only workload is a group project<br />Easy if your group member works and our members meet a lot and finished the project easily.<br />Also, it is easy if you are able to pick a easy topic (changes every term)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ox4RSqdfBWNYdZlKxrNy20FehHKIR4x8",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Kiss",
            "date": "Jan 24, 2018",
            "title": "",
            "comment_content": "The content of the course is interesting ,math parts really&nbsp;&nbsp;needs logical thinking.And for life science part ,King Lau tried to make us more creative .",
            "comment_teaching": "King Lau is PASSIONATE,and actually rpofessors really well prepare the lectures",
            "comment_grading": "For me, it is fine .For chemistry and physics, you can get good scores as long as you really reviewed the contents the professors taught in the lectures.",
            "comment_workload": "The workload is fine for me.You dont need to prepare a lot for math and life science part a lot since the exams need more logical thinking rather than remembering.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PS1nMf4zxRI8QRAdZb1PzTvyrYSJ1Zf8",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Johnson162",
            "date": "Jan 20, 2018",
            "title": "",
            "comment_content": "The course is divided into three parts-- chemistry, life science, physics and mathematics. The materials covered are very special that probably no other courses would cover the same thing ( I guess that's why it's a SSC course). For life science, all the things taught are crazily deep and difficult that I was thinking whether I am taking a graduate course. For Physics, things were easy at first but eventually went quite deep ( like proof of thermodynamics, theory of relativity and quantum mechanics). For math, it covered some special topics like different number systems in the world, the logic in math, etc. Chemistry is the only normal part (here abnormal does not necessarily mean a bad thing, I actually love the Physics part). But the professor tended to focus more on history, that is the historical development of chemistry. Some false theories in the old days would be taught too. I think the course name suits the course very much, it's really about great ideas in science.",
            "comment_teaching": "The instructors had great freedom in teaching (I guess mostly becoz it's a SSC course). Fair teaching for the chemistry professor and he did iPRS. King Chow(head of IPO), who is the life science professor, is a crazy guy, but the kind of crazy that I admire. Really a figure in academia. Apart from teaching life science materials he would also cover some philosophical questions like what defines you and what is right and what is wrong (no clear answer usually for these questions). He made the lesson lively and interactive. Once one guy was late and was bombed with tons of questions(questions that requires no knowledge but a lot of thinking) which made the lesson so fun. He is so impressive. The physics professor is a very good teacher and his presentation was clear and often asked for questions. Fair teaching for the math professor but his notes were kind of messy.",
            "comment_grading": "not sure about grading, but I can tell the exam is soooooo difficult. Chemistry part is of fair difficulty (lots of people got&nbsp;&nbsp;over 80%). The physics part consisted of some easy questions but also some very difficult questions. For math part, haha. For life science part, we had a choice between one essay question about difference between life and living, or answering the questions regarding technical materials learned before. If you choose the latter, good luck.",
            "comment_workload": "There are huge amount of optional workload, becoz king chow will bomb you with crazy amount of readings. There is also a group project which requires poster presentation. Overall workload is fair. I got B- in the course, the worst in my semester but also the course was the most impressive and interesting course for me. So a trade-off of grade from having fun in class haha.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GttffZG2bPWF17AJs7DbqlICIkbRxDqN",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 1
                },
                {
                    "id": 640,
                    "name": "LOY, Michael Ming-tak",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Naoki",
            "date": "Dec 21, 2017",
            "title": "",
            "comment_content": "For math part,&nbsp;&nbsp;it is only some simple calculation and logic.&nbsp;&nbsp;For chemical part,&nbsp;&nbsp;it is a introduction and history of chemistry. Without studying chemistry before, i only learned the periodical table after the course.&nbsp;&nbsp;For physics part,&nbsp;&nbsp;it is about specific relativity but very simple. For bio,&nbsp;&nbsp;it's totally introduction to gene.",
            "comment_teaching": "It is fun of king chow teaching,&nbsp;&nbsp;although i learn no things about biology.&nbsp;&nbsp;Other professors also good i thinks,&nbsp;&nbsp;at least they don't have obvious accent problem.",
            "comment_grading": "Above mean a bit in all four areas and high marks in project.&nbsp;&nbsp;Finally get a B+.",
            "comment_workload": "Workload is just normal.&nbsp;&nbsp;I remember there is a group project, present,&nbsp;&nbsp;and poster.&nbsp;&nbsp;However,&nbsp;&nbsp;it is not very serious and just spend 1or2 days to work it out.&nbsp;&nbsp;No homework and attendance.&nbsp;&nbsp;Just prepare for exams only.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JqNNtPJE8yq6tGwA2QbBBYtdi4B6f02R",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 0
                },
                {
                    "id": 610,
                    "name": "CHEN, Tian Wen",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "GeeGee",
            "date": "Jul 03, 2017",
            "title": "Only take this if you like science–– you'll thank me later",
            "comment_content": "Not for those without science background PLEASE<br /><br />I'm sure what I write here will be a repeat of the other reviews below so I won't go into too much detail. The info you really want is in the workload section.<br /><br />Maths: Numerical proofs (sums, fibonacci, viviani) geometrical proofs (euclidean/non euclidean)<br /><br />Chemistry: atomic concepts/theories throughout history, molecular structure, energetics, applications in the environment <br /><br />Physics: scientific method, astronomy, basic mechanics/energy concepts, newton, relativity, quantum theories<br /><br />Lifs: GENETICS ! Dna structure, evolution – a lot of debates about different theories used to describe a singular concept",
            "comment_teaching": "Maths: Yan Min - goes through proofs quite thoroughly but is such a bore<br /><br />Chemistry: Williams, Ian Duncan – a bit more passionate, explains concepts decently<br /><br />Physics: Chen, Tian Wen– Boring boring! couldn't make it through 2 hours without procrastinating on something else<br /><br />Lifs: Chow, King Lau– very passionate about what he teaches and does explain things fairly well",
            "comment_grading": "Distribution:<br />Poster:<br />20%<br />Maths/Chemistry/Physics/Lifs:<br />20/20/20/20%<br /><br />Attained Grades:<br />Maths: 1.5SD above mean<br />Chemistry: 0.5SD above mean (without bonus attendance)<br />Physics/Life Science: mean (I studied the syllabus the night before because I couldn't be fucked anymore tbh)<br /><br />If you put in more effort than I did for the final, 0.5SD+ above mean is quite attainable",
            "comment_workload": "Honestly, I only showed up to five lectures throughout the whole course...<br /><br />Maths:<br />The lecture slides from maths are really vague so if your math background isn't strong you should go as this will be difficult. Since I'm from engineering, I didn't bother and literally read some of the slides for the first time during the exam (open book) as it's more about proofs and bullshitting than actual formulas or problems. <br /><br />Chemistry:<br />There are attendance marks for chemistry- if you need an extra ~10% boost in your grade then go to lectures. Overall, as long as you've taken Chemistry in high school this won't be difficult, it just involves memorization of lecture slides.<br /><br />Physics:<br />Once again, it won't be difficult as long as you've taken Physics in high school. Very cookie cutter MCQs and open book exam. <br /><br />Life Science:<br />This is an absolute clusterfuck tbh but I haven't studied biology since year 11 HAHAHA <br />The exam is a wild card, has consistently low means and changes every year depending on the professor. While it's open book but there is so much information you can't possibly process it all during the exam. I suggest you focus on the other three components unless you have a dying passion for this sort of thing. There are ethical/philosophical debates involved so attending lectures may actually be useful for you.<br /><br />Group Project:<br />Teammates are key!!! Luckily I was grouped with people who did their share of the work. Just choose a physics or chemistry module topic and your life will be easier.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "u8hvqxy8P1HsVCKICQxyvslOypsCFPVk",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wassup",
            "date": "Mar 29, 2017",
            "title": "",
            "comment_content": "The content is definitely not for &quot;students with no science background&quot;. The content is tough and students who took Science subjects in high school might still struggle. <br />For the Mathematics module, you have to learn ancient mathematics, postulates and etc which probably is the hardest module of the course. <br />The Chemistry module is the easiest and you probably have learned it in high school. <br />For the physics module, you have to learn relativity, thermodynamics and etc. Quiet tough. <br />For the biology module, you have to read the assigned readings and understand them. The professor will test you on your understanding of the concepts. He doesn't want us to memorize stuff. <br />Overall, do not take this course if you are a student with no science background as this course can be very challenging.",
            "comment_teaching": "All of the four professors are really nice and they are really passionate about teaching.",
            "comment_grading": "The mean is usually low but it is hard to score high in the course. If i remember correctly, 69% above will put you in the A range.",
            "comment_workload": "No homework but you have to make a poster and then a presentation about the poster. They will choose your group mates for you.",
            "rating_content": 2,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6HR42DMVpawsYlssAZADMdkGC7waV3wx",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 0
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mcreng",
            "date": "Dec 27, 2016",
            "title": "Not recommended to those who never took science before",
            "comment_content": "This course is separated into four different modules, namely Mathematics, Chemistry, Physics and Life Science. Mathematics and Chemistry modules are assessed during the midterm, while the rest are assessed in final.<br /><br />Let's start with the teaching materials.<br />MATHEMATICS:<br />- Some brief history of maths<br />- Bases<br />- Plane geometry, neutral geometry, non-euclidean geometry<br />- Logic, proof, maths system<br />- Maths in art (it is kinda an irrelevant topic, as this part is taught when there were some visitors coming possibly from Mainland China, it is more like a demonstration of teaching, and this is even not included in the exam)<br /><br />CHEMISTRY:<br />- History of chemistry<br />- Periodic Table<br />- Chemical bonds, structures, reactions<br />- Analytical chemistry (just very briefly because he didn't have enough time to cover)<br /><br />PHYSICS:<br />- Energy and entropy (and its application - engine and refrigerator)<br />- Quantum effects (wave-particle duality and its application)<br />- Special relativity<br /><br />LIFE SCIENCE:<br />- What is biology, how it starts<br />- Some DNA mechanism<br /><br />In my opinion, the content in math, physics and life science modules are great.",
            "comment_teaching": "Prof. Yan and Prof. Foreman explained the concepts really clearly so they were great.<br /><br />Prof. Chow took a philosophical approach on teaching life science, it might be controversial but personally i enjoyed it. He sometimes used some metaphor to explain how evolution/DNA works and I think he did pretty well here.<br /><br />Prof Williams in the other hand didn't do so well, because he didn't explain deep enough in some of the concepts. I think it's alright for those who took chemistry before, but for those who didn't, it might be painful.",
            "comment_grading": "MATH (out of 50, 20%)<br />Mean: 25.74<br />SD: 12.63<br /><br />CHEM (out of 100, 20%)<br />Mean: 75.1<br />SD: 18.5<br /><br />PHYS (out of 100, 20%)<br />Mean: 42.78<br />SD: 16.6<br /><br />LIFS (out of 45, 20%)<br />Mean: 12.6<br />SD: 7.08<br /><br />Project (out of 20, 20%)<br />Mean: 6.47 (poster) + 6.85 (oral)<br />SD: 2.26 (poster), 2.66 (oral)<br /><br />Overall (out of 100)<br />Mean: 52.79<br />SD: 14.46<br /><br />Grades Cut-off<br />77.93 A+<br />71.13 A<br />69.58 A-<br />62.68 B+<br />57.33 B<br />54.02 B-<br />51.48 C+<br />44.00 C<br />38.04 C-<br />30.16 D<br />0 ~ 26.03 F",
            "comment_workload": "Well, not much, because the only thing that you really need to work on is the project, in which you need to prepare a powerpoint slide and a poster for it.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fT7QANcQZWLadNSB3peIPwTNw1u2hdOG",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 640,
                    "name": "LOY, Michael Ming-tak",
                    "rating": 1
                },
                {
                    "id": 639,
                    "name": "LI, Weiping",
                    "rating": 1
                },
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "當科",
            "date": "Dec 19, 2015",
            "title": "Overall a good course, easy if you have some science background",
            "comment_content": "As stated in the title, the content should be easy for anyone who has science background, but fairly difficult to those who don't.<br /><br />Course is divided into 4 modules, physics, mathematics, chemistry and life science. The course is generally about the important breakthroughs in the 4 fields (e.g. quantum revolution in physics, the development of euclidean geometry in maths, the development of the periodic table in chemistry, the discovery of DNA's structure in life science).<br /><br />The topics are somewhat related to high school science studies, but they are all taken one step further. The professors also talked about the social impacts of the breakthroughs. To sum up, the course consists of about 60% science history and 40% science. Personally I enjoyed the topics a lot.",
            "comment_teaching": "Don't recommend skipping lessons (except maybe Chemistry lessons) because they are all interesting and informational. <br /><br />I especially enjoyed Prof. Loy's and Prof. Chow's lessons. Prof. Loy speaks a bit slower but he explains things very clearly. Prof. Chow's classes are interesting and interactive. Make sure you attend his lessons since he gives information that are not included in the lecture notes.",
            "comment_grading": "Quite good<br />~20% A range, ~30% B range",
            "comment_workload": "Mid term on first 2 modules (Phy+Maths)<br />Final on last 2 modules (Chem+Life Sci)<br />Require a bit of studying, but not too unreasonable<br /><br />Most of the workload comes from the group project, in which you have to make an A0 poster on a specific topic, then give a poster presentation, then give a PowerPoint presentation. (poster presentation requires you to explain more about the design of the poster, but the PowerPoint presentation is more about the topic itself) To make matter worse, the presentations are in the 1-week study break, which might disrupt your study plans.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "in7WVShHQWd5hq672iKnVZSEK96OFZbL",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 502,
                    "name": "WONG, Joseph Tin Yum",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gonpachirou",
            "date": "Oct 30, 2021",
            "title": "Definitely NOT for non-science background students",
            "comment_content": "I was only introduced to the LIFS module of this course so take this review with respect to that part only.<br /><br />This course is quite advanced especially if you do not have a biology background in HS. Prof. WONG began with DNA and polymerase chain reaction which even in LIFS1901 is introduced later in the year, ~after the midterm. The slides are extremely messy and confusing and mostly consist of diagrams which makes studying difficult. I always find myself asking what parts I have to memorize, and after a while I dropped this course.",
            "comment_teaching": "Prof. WONG isn't bad at teaching per se, but he's not good either. His explanations dart from one concept to another and often he goes on a tangent to discuss dinoflagellates (the subject of his personal research). This often wastes almost 1/4 of the lecture duration.",
            "comment_grading": "I have not completed the course hence I cannot share my grades.<br />However, the syllabus for this term states that:<br />Mid-term exam LIFS &amp; MATH 40% (20% per module) <br />Final exam PHYS &amp; CHEM 40% (20% per module)<br />Group presentation LIFS/ MATH/ PHYS/ CHEM 20%",
            "comment_workload": "No homework but studying is a real hell if you rely on the slides only. And you basically have to rely only on the slides because there's no reference textbook.",
            "rating_content": 2,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "l4TNpOwAVCAgQQ8UTaKlerBpZAXgqZ80",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 0
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "app_Sci",
            "date": "Jan 05, 2017",
            "title": "",
            "comment_content": "In the course you learn 4 modules, Math, Chemistry, Physics, and Life Science.<br />In all of the modules, they began with shallow things that are easy to understand, then proceed to hard things that are, well, hard.<br />But the process is too quick for most of the students, and you will need to struggle to understand the deeper concepts.<br />Having a Chemistry, Physics and/or Biology in your DSE will help you greatly in the contents, but not a must.<br />For example, I studied Chemistry in DSE and almost 75% of the slides in class can be skipped as I knew them already.",
            "comment_teaching": "Overall, the 4 tutor's teaching are OK<br />Min Yan: 7.5-8/10, average teaching. (Math module)<br />Williams Ian Duncan: 6/10, not so good. (Chemistry module)<br />Foreman Bradley Alan: 7/10, satisfactory. (Physics module)<br />Chow King Lau: 9/10, a good tutor (Life Science module)",
            "comment_grading": "At the end of the course they put out the grades for different students on Canvas. <br />15 out of 86 students got A range.<br />40% midterm (20% for math paper and 20% for Chemistry paper)<br />40% final (20% for Physics paper and 20% for life science paper)<br />20% group project",
            "comment_workload": "It actually depends on whether you meet good teammates.<br />If you met a freerider, then congrats, your workload for group project is very high.<br />But even if your groupmates are nice people, you will need to review for the test yourself.<br />It is indeed quite challenging to review for the test as the test involves deep concepts.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "PWdlvFA7jRTOykMTqlxQC5XPOsSECeBQ",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "xelostar",
            "date": "Dec 27, 2016",
            "title": "Nice course for students interested in science",
            "comment_content": "There are four subjects - Math Chemistry Physics and Life Science as well as a group project. <br /><br />Course outline:<br /><br />Math: History, Geometry, Non-Euclidean Geometry, What is Mathematics, Mathematical World<br /><br />Chemistry: The Elements, Periodic Table, Chemical Bonds, Chemical Structures, Chemical Reactions, Chemical Fingerprints<br /><br />Physics: Energy and Entropy, Global Climate Change, Quantum Revolution and its Applications, Einstein's theory of relativity, Space-Time Dilation<br /><br />Life Science: Definition of the Living World, Definition of Life, Understanding Manipulating Restoring and Creating Life<br /><br />Project: There will be a list of topics that you can choose from. However, you cannot choose your own teammates and they will be randomly assigned",
            "comment_teaching": "Prof YAN: I really like his teaching style and you can see he is really interested in what he is teaching. However, the concepts can get quite difficult at times and you might need some extra time to catch up after class.<br /><br />Prof WILLIAMS: Classic chemistry professor. Explains the concepts and applications clearly and in detail, but can get a bit boring at times. Answering the PRS questions in his lectures will give you extra points on the chemistry module.<br /><br />Prof FOREMAN: Likes to have class discussions on difficult topics such as quantum theory to help us understand the ideas better. Classes are quite interesting but his exam was a nightmare.<br /><br />Prof CHOW: My favorite LIFS professor XD. Great teaching style and is really interested in what he is teaching. Asks questions in class to try and deepen our understanding. Also likes to make interesting examples of vague concepts. And likes to say that getting the Nobel Prize isn't actually that difficult lol.",
            "comment_grading": "Normal grading.<br /><br />The five topics are each worth 20%. <br /><br />Midterm was on the first two: math and chemistry, and final was on physics and life science. <br /><br />Grades: Mean / Total / SD<br />Math: 25.74 / 50.00 / 12.70<br />Chem: 77.8 / 100.00 / 12.01<br />Phys: 42.78 / 100.00 / 16.69<br />Lifs: 12.60 / 45.00 / 7.12<br />Project: 13.32 / 20.00 / 4.81<br />Total: 52.79 / 100.00 / 14.54<br /><br />For me:<br />Math: 45 (+1.1 SD)<br />Chem: 100 (+2.01 SD)<br />Phys: 45 (+0.13 SD)<br />Lifs: 20.5 (+1.1SD)<br />Project: 17.8 (+0.93 SD)<br />Total: 71.91 (+1.31 SD)<br /><br />Letter Grade: A<br /><br />only 3 A+ in the whole class<br />rip physics....",
            "comment_workload": "Workload really depends on the quality of the group-mates you are assigned at the beginning of the course. If you get good group-mates, workload is small to minimal. If not, then you will need to spend quite a bit of time completing the poster and presentations. As for the exams:<br /><br />Math: Open book, open notes, open mobile phones (no laptops). Only three question in total and two are proofing questions. However, there will be sample exam beforehand and it is important to go through it very thoroughly.<br /><br />Chemistry: Closed book. I found the exam quite easy actually, he had explained a lot of the questions clearly in class already and most of the others you could solve with a bit of extra thought. There will also be an option to write long answers that are worth half the exam instead of the normal questions. However, I personally recommend doing the normal exam.<br /><br />Physics: Closed book. As usual, class was nice and fun, exam was a total and absolute nightmare. The sample paper he gave was totally useless unfortunately. Unless you understand all the concepts and calculations very very clearly, it is easy to flunk the exam.<br /><br />Life Science: Open book, open notes, open laptop, open everything. But it really doesn't matter because he asks 15 or 16 long answer questions that you need to complete in one hour. So if you need to check the internet for every question, you are pretty much guaranteed to run out of time. Another thing is a lot of questions were based on the examples and discussions that he gave in the lectures, and not on the lecture notes, so attendance is recommended.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Vtlp4BtKHPRDC2K7Y9X6leT5qCktQKf7",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 1
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Alpha703",
            "date": "Dec 23, 2016",
            "title": "Science 'god' must register this course, others should think twice",
            "comment_content": "There are 4 modules in the course: Maths, Chem, Phys, Lifs. Each module take 6 lessons.<br /><br />Maths: Numbers(Numerical systems, Modular Numbers, Bases, Numerical Operations), History(Mathematics of ancient cultures and development of modern mathematics), Geometry(Euclidean geometry, deductive reasoning in geometry, postulates, hyperbolic and elliptic geometry, curvature), nature of Mathematics, Mathematics in arts<br />(The time is not enough, so Prof. Yan teaches the latter 2 parts very briefly)<br /><br />Chemistry: Atoms and elements, Periodic Table, Chemical Bonding, Chemical Structures, Chemical Reactions, Chemical Fingerprints(Analytical Chemistry)<br />The lesson have a significant emphasis on the scienticfic history of these aspects of knowledge<br /><br />Physics: Basic mechanics, Thermodynamics(1st and 2nd law, energy and entropy, applications), Quantum Mechanics(Particle and waves, Double-slit experiments, Quantum Revolution, Quantum Theories, Applications, Entanglement), Relativity(Luminiferous ether, Special relativity)<br /><br />Life Science: Meaning of life, Genetics(Genetic codes, associated technologies, mechanisms, historical advancements, applications, related issues, ...), Evolution(Lamarck and Darwin evolution, validity of these evolution theories)",
            "comment_teaching": "Prof. Yan (Maths), Prof. Willams(Chem): Standard teaching, clear explanations and English<br />Prof. Foreman(Phys): Will try to stimulate discussions on some important issues raised by quantum mechanics(Entanglement) and relativity<br />Prof. Chow(Lifs): Great teaching, very clear explanations and examples, like asking students questions and stimulating thoughts (You should focus on his teaching, instead of his lecture notes)",
            "comment_grading": "Grading scheme: 20% Maths, 20% Chem, 20% Phys, 20% Lifs, 20% Project. Grading is fair.<br /><br />'The course is designed for students with no science background.' is actually not really true, since the course does not put any science courses/DSE science results into exclusions, so actually 70-80% students in this course have science background.<br /><br />They will directly provide a table with detailed of marks and grades of all students and you can look them up by student number. Important info summarised below(I will not post the table directly due to privacy): <br />18% A range, 33% B range, 39% C range, 5% D, 6% Fail<br />Maths: Mean:25.7/50 SD:12.6<br />Chem: Mean: 75.1/100 SD:18.5<br />Phys: Mean: 42.8/100 SD:16.6<br />Lifs: Mean: 12.6/45 SD:7.1<br />Project: Mean: 15.02/20<br />Total: Mean: 52.8/100 SD:14.5<br /><br />Me: Math +1.45SD Chem +1.05SD Phys +0.89SD Lifs +0.34SD Project: 15.3/20<br />Total: 69.97/100 (+1.18SD) --&gt; A-<br />(Only 1.16 total marks before getting an A. What a pity.)<br /><br />Btw Prof. Yan and Prof. Foreman teach this course for the first time, instead of Prof. Li and Prof. Loy.. The difficulties of the exams set by the two new professors are significantly higher than the previous ones. Keep this in mind if you have sources/past papers of Maths and Phys module before this semester.",
            "comment_workload": "Assignment: No compulsory homework. Maths 'Homework' are practice questions, but a must-have for the Maths exam.<br />Project: Choose a topic from a provided list and make a poster about it. Also need a ppt presentation. Basically you only need to work for ~1 week after the mid-term period to submit a poster draft, and 1 week before the study break to finalize the poster and ppt. You can punish freeriders by a peer evalution form(Their project marks will be greatly reduced)<br />Attendance: PRS in Chem module for bonus points<br />Exam: Maths and Chem in mid-term, Phys and Lifs in final<br /><br />Maths: Open-notes and internet(only mobile phone is allowed, not laptop). Make sure to print out the 'Homework' and its answers provided by Prof. Yan.. Exam is very similar to the homework. Even if you don't understand the questions try to look up similar questions in the homework and figure out something from answer key.<br /><br />Chem: Close-book. Not much to say about this. If you studied Chem in DSE or CHEM1020 it's not hard.<br /><br />Phys: Close-book. Insanely difficult. Good luck.<br /><br />Lifs: Try to review the lecture videos of Prof. Chow as many times as possible. Read the 'reading materials' provided by him, as they enables you to understand the questions(but doesn't help in answering them anyway). Don't focus too much on lecture notes. Open-book and open-internet, but minimize use of Internet as much as possible to save time and finish more questions. Some of us students discussed with Prof. Chow after the exams and found out that most questions are addressed in some part of his lectures verbally(but not in lecture notes)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "14s0u2b5ZTtzjnrZsbST3cvaexkw2Jw0",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 639,
                    "name": "LI, Weiping",
                    "rating": 1
                },
                {
                    "id": 640,
                    "name": "LOY, Michael Ming-tak",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "maize",
            "date": "Aug 16, 2016",
            "title": "A good course for people with science background",
            "comment_content": "There are 4 modules in the whole syllabus, PHY, MATH, CHEM, BIO. All of the contents are relatively introductory (if you have studied science before). <br /><br />I think the whole course is pretty easy if you attend the lessons and really try to understand the topics. However, it could be quite something when you try to master a subject in 3 weeks (3 months 4 subjects = 3 weeks per subject)<br /><br />Physics focused on wave and relativity; Maths focused on some very conceptual maths and math theories, like how to prove the Euclid Elements and mod; Chemistry focuses on periodic table and the arrangement of electrons and also some history of chemistry; Biology focuses on the meaning of life (a topic that King Chow likes a lot XD) and some basic genetics.<br /><br />All in all, the contents are more elementary level with some science historical knowledge. I think it is pretty well balanced.",
            "comment_teaching": "All of the professors are very nice people and they really try to make the lessons less boring by inducing some interactions and some small jokes (but not always successful)<br /><br />All 4 of them have different teaching style but it is quite easy to follow and they are all very willing to answer questions from students. So if you really do not understand a certain topic or concept, be sure to ask them until you grasp the idea (which is very important to the exam)<br /><br />I remember that my poster topic was on Biology so I sent LOTS of very LONG emails to Professor Chow asking for feedback and opinions, he replied every one of them and answered most of my questions (except those that would directly affect the content of the posters), that really helped me a lot in the poster making process, so just don't be afraid to ask, you may be surprised haha",
            "comment_grading": "I think the grading is fair. The grade is directly affected by how well do you understand the topics, instead of how well you remember stuff from the slides. So like I said before, don't be afraid to ask question and clear any concepts that you don't understand asap. By doing so, it is pretty much guaranteed that you can get above mean results in exams.<br /><br />Grade weighting:<br />80% exams (4 finals, 20% each)<br />20% project (poster presentation and ppt presentation)<br /><br />I got 1 SD higher in the physics, maths exam and mean on the chem exam and the highest in bio (66/100, mean 2x/100). The project part I guess I did ok/above mean (I forgot the score). At last, I got an A+ as an overall grade.",
            "comment_workload": "The only workload that the course have is the poster preparation and powerpoint presentation at the end of the semester, it would be quite an easy task if you and your groupmates are on the same page.<br /><br />However, if you do not have science background, the workload can be quite high. You will have to catch up with the concepts every week and spend maybe 2-3 hours to fully understand the concepts plus you need some extra time to study for the exams.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hXLiKLp3o1z82Vcb4v4Ga1TXaYaQjQYZ",
            "semester": "2014-15 Spring",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 639,
                    "name": "LI, Weiping",
                    "rating": 1
                },
                {
                    "id": 640,
                    "name": "LOY, Michael Ming-tak",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "Adrianop",
            "date": "May 12, 2016",
            "title": "The course is suitable for students with science background only.",
            "comment_content": "Four modules in total:<br /><br />Phys: introduction to basic physics concept, introduction to quantum mechanics, introduction to special relativity. DSE level except introduction to special relativity part (but the math is very simple)<br />Not much equation need to remember.<br /><br />Chem: DSE level Chem + a little bit of atomic orbital <br /><br />Math: History of math, introduction to Euclidean space and Non Euclidean space, a little bit of number theory, introduction to geometric construction.<br />Focus on concept only, there is only one or two equation need to remember.<br /><br />Bio: Evolution theory, Genes. etc.<br />Really focus on concept, the professor even told us if you only remember those specific words (eg. chemical name of DNA) and answer the exam question by only these words, your mark will be deducted.",
            "comment_teaching": "Williams, Ian Duncan: responsible for Chem part. Not much to say, an ordinary professor. If you have already taken DSE level Chem, you can skip most of his lesson<br />Li Weiping: responsible for Math part. Not much to say, another ordinary professor.<br />LOY, Michael Ming-tak: responsible for Phys part. Bad teaching, self-study is better than him. Cannot clearly explain physics ideas.<br />CHOW King Lau: responsible for Bio part. Good professor, especially when explaining Bio concepts. However, his online notes are not sufficient, therefore you better not skip his lesson.",
            "comment_grading": "Midterm 40% <br />Final 40% (things included in midterm will not include in final exam)<br />Project 20%<br /><br />General suggestion: focus on understanding concept, not remembering, especially for Bio part and Chem part.<br />For Math part, do try to do the practice question.<br /><br />If you have strong science background, the exam will be very easy for you.<br /><br />Got 8x/100 overall and got a A+,however there is only 3 A+s in 1xx/200 class. Therefore I don't know the grading is good or bad.",
            "comment_workload": "No HW, only practice problem which does not need to submit.<br /><br />There is a project, making a poster and the topic is chosen by you and your group mates from 4 category (PHY CHEM BIO MATH). and a presentation after you finish the poster. (explaining your poster content to professor and other students)<br /><br />4 students in a group, group mate are randomly assigned. The topics are pretty simple, most of the details related to the topic can be found by google",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ymV1mgXnO1l1dXba73JWImmo1UqO1eGA",
            "semester": "2015-16 Fall",
            "instructors": [],
            "is_author": false,
            "author": "wood",
            "date": "Feb 10, 2016",
            "title": "good for science student, bad for others",
            "comment_content": "phy and bio module learnt a lot of things, know more about science history<br /><br />math learn more about geometry, but the perspetive part is useless lol<br /><br />chem.... i skip most lesson, but it is actually not bad, just tired about hlth 1010",
            "comment_teaching": "i would say all four&nbsp;&nbsp;are good.<br /><br />michael loy is very professional, willing to answer my question.<br />king chow is awesome lol<br />prof li is good at teaching , and want to give A to us lol<br />dont even know the chem prof, cuz he speak too fast and i know the things already.",
            "comment_grading": "i got an A and my fd have a A+.<br /><br />but many ppl complain about it, i guess if you study phy, chem ,bio in high school , you should be able to handle that. on the other hand, if you didnt or u only memorize the content, you are done. do not try to memorize the things.<br /><br />the project is grouped by the instructor, i dont have freerider in my group so i am fine. no big trouble on anythings, just rememebr to send email for topic asap and contact you groupmate as fast as you can.",
            "comment_workload": "just one poster and presentation,<br /><br />the exam is troll, math is easy as hell, as long as you went to the class , he gave you almost the paper, just changing the figures.<br /><br />phy is ok for me<br /><br />chem have past paper, easy<br /><br />bio, it is real that you dont remmeber the things, he really deduct marks :D",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UvsghsClXIsB5YQ5lFqI8a1EMlCZA1Xt",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 640,
                    "name": "LOY, Michael Ming-tak",
                    "rating": 1
                },
                {
                    "id": 639,
                    "name": "LI, Weiping",
                    "rating": 1
                },
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Dok",
            "date": "Dec 29, 2015",
            "title": "Take it if you love science",
            "comment_content": "The course is &quot;designed for students with no science background,&quot; but it will be quite difficult for students with no science background. However it would be easy for people who took a lot of science courses.<br /><br />The course is divided into 4 modules: physics, mathematics, chemistry, and life science. In each module, the professors discuss scientific breakthroughs in each field. <br /><br />Also, there is a project that you have to do with randomly assigned groupmates (4 including yourself).",
            "comment_teaching": "I don't recommend skipping lessons (especially life science), but it's not a huge deal if you do. The physics and life science professors uploaded their lecture videos. <br />They're all nice people. All very passionate, too. They will gladly answer students' questions.",
            "comment_grading": "Midterm exam consists of physics portion and mathematics portion, final exam consists of chemistry portion and life science portion.<br />Each exam is worth 40% of the final grade (i.e. each module is worth 20% of final grade)<br />The project is worth 20% of the final grade.<br /><br />About 20% of all students got A- or above.<br />More than half of all students got B- or above.",
            "comment_workload": "A bit of studying is needed, but not too much.<br />For physics, understand the powerpoints and how to derive special relativity<br />For maths, go over all of euclidian postulates and do the practice tests!! Doing practice tests/past exams will save you.<br />Same for chemistry: do all the practice tests and you won't regret it.<br />For life science, read all of his assigned readings because they will help you a lot in answering the test questions. But don't expect to score high in this section. The mean was less than 30%.<br /><br />The presentation is quite annoying (esp. if u have shitty groupmates). You have to make an A0 size poster on the topic and give a poster presentation to each of the professors. Also, you have to make a powerpoint on the topic and give an oral presentation to the topic's respective professor.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Eg1IuTh3gn5AeeiViSqPoVqfgIc4MY2r",
            "semester": "2013-14 Fall",
            "instructors": [],
            "is_author": false,
            "author": "sableye",
            "date": "Aug 16, 2015",
            "title": "",
            "comment_content": "There were 4 modules: Physics, Maths, Chemistry, and finally Life Science. This course was designed for people who hasn't studied science before, but it didn't check for DSE results like some other courses did.<br /><br />Physics: half of them are like DSE physics: waves, light, optical fibres etc. And towards the end, there are more difficult things like Theory of relativity which is surprisingly easy to understand (with a DSE physics background)<br /><br />Mathematics: the infamous rule of The sum of interior triangles &lt; 180 degrees. It's all about ancient mathematics like old Mathematics theories. Doesn't really relate to daily mathematics or MATH1013.<br /><br />Chemistry: all about DSE chemistry again and something on top of those. But in addition, the professor taught a lot about chemistry history, and the history is tested as well (e.g. who discovered what elements)<br /><br />Life Science: the professor is more like a Psychology professor in this course. There are technical things that were in the DSE syllabus, but the professor raised a lot of questions about life you have never thought about before.",
            "comment_teaching": "All 4 are nice professors. I enjoy their teaching because I have studied Phys and Chem in DSE. Otherwise it could be a pain.<br /><br />Could be a bit boring, but what science is interesting.<br /><br />I had no idea what the maths module professor was teaching at that time, but when I did all his sample questions, I got 100/100 in the math exam, so did almost 1/3 of the class.",
            "comment_grading": "Mid term and Final carry same weighting. Mid term tests Phys and Maths. Final tests Chem and Life Science.<br /><br />And there is a project in which you have to choose a topic among the 4 modules, and the professor of the module will grade your project.<br /><br />There is PRS questions for the Chemistry module, but the professor said it's not for attendance, but will be used for reference if you get need a few marks for an increase in sub grade.<br /><br />I got above 1.5 sd in mid term and above less than 1 sd in final (don't know about project) and I got an A-. I think there was only 10% A range in my class (because they sent an excel of grades of the whole class to us).",
            "comment_workload": "The only workload is project, which is report + design poster + poster presentation + powerpoint presentation.<br /><br />And there are reading materials for life science module.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1CipD1frAgMemh5lT3pD88wZ0gEaCs7P",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 1
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ykym11",
            "date": "Jan 25, 2017",
            "title": "",
            "comment_content": "Suitable for those who love science or want to explore more about science.<br />Content of the course is generally interesting, about history and some famous theory the respective field.",
            "comment_teaching": "Prof Chow's teaching is great. He is so engaged in teaching. Always asks us to think and express our ideas.<br />Prof Foreman: you better not to sit too far away if you want to listen to his teaching since his voice is not that audible.<br />Other two are ok.",
            "comment_grading": "fair. <br />Chemistry's mean tends to be higher, about 70%.<br />Maths mean is about 50%.<br />Phy's mean is about 43%<br />Lifs mean is low, about 28%.",
            "comment_workload": "midterm, final, poster, presentation.<br />Groups are divided randomly by instructor.<br />no other assignments.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wu9jRdW8QFaSclMRK3fbogpXY6ewf6IF",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 1
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 1
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Mayl",
            "date": "Jan 07, 2019",
            "title": "Not bad in terms of SSC courses",
            "comment_content": "The course covers the scientific development in the four areas. The topics included are roughly as follows:<br />Math: number systems, divisibility, axioms (not tested)<br />Lifs: microscopy, cells, genetics, heredity<br />Phys: energy and entropy, relativity, quantum mechanics<br />Chem: elements, chemical reactions, qualitative and quantitative analysis<br />The topics are quite interesting and inspirational, but the time is really insufficient, resulting in a very shallow coverage of each topic. I would rather to have one topic discussed in-depth for each module.<br />Of course, students with science background would be advantaged (around half of the course content is prior knowledge to me), but I guess this applies to all S&amp;T common core courses.",
            "comment_teaching": "Math: Prof. Yan teaches in an interesting way. The topics chosen are quite interesting and easy to follow. However, the teaching is behind schedule a lot, and only half of the expected contents were taught.<br />Lifs: Prof. Chow basically forces people to interact with him and do discussions. His teaching is good or not really depends on your own point of view. For me, this style of teaching is fine.<br />Chem and Phys: Not much to be said. I did not attend much, and from my experience, the teaching is really what you have on an average course. They did not do anything wrong, but there were not any highlights either.",
            "comment_grading": "The grading is 20% on each module, and a 20% on a project. The mean of each module is:<br />Math: around 55%<br />Lifs: around 50%<br />Phys: not provided<br />Chem: ~77%<br /> For details, some statistics are uploaded below. (The phys score is not provided)<br />My results are as follows:<br />Math: ~95%<br />Lifs: ~65%<br />Chem: ~95%<br />Phys: no statistics<br />Project: should be around middle compared to other groups<br />Grade: A+<br /> This shows that the A+ grade is attainable, and not too hard to do so. This is better compared to other SSC courses.",
            "comment_workload": "The workload is fine. The is no need for attendance and no assignments and quizzes. The major workload is about the project. This workload varies in two aspects: the topic and your groupmates. For me, I chose an easy topic for myself (divisibility for a math major student) and my groupmates are good, so things are quite easy.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "365Hc6uqmxnD1g5MlzpMU9H8px3KMgeb",
                    "name": "SCIE 1110 Fall 2018 mid-term_LIFS",
                    "format": "pdf"
                },
                {
                    "key": "zzdOXmWbYiaXIQ1ddOqqpwSDUvXSCsUs",
                    "name": "SCIE 1110 Fall 2018 mid-term_MATH",
                    "format": "pdf"
                },
                {
                    "key": "0P8AfnuhMFydJFVisA0oq7CqCxUZUDaM",
                    "name": "1110_Chem_Grades_Noname",
                    "format": "xlsx"
                }
            ]
        },
        {
            "hash": "tsYUIrwFNUfMnTEJgT8vaK9hZA0GMgpM",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 57,
                    "name": "WILLIAMS, Ian Duncan",
                    "rating": 1
                },
                {
                    "id": 484,
                    "name": "CHOW, King Lau",
                    "rating": 0
                },
                {
                    "id": 534,
                    "name": "YAN, Min",
                    "rating": 0
                },
                {
                    "id": 623,
                    "name": "FOREMAN, Bradley Alan",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "uraniumgun1127",
            "date": "Aug 26, 2018",
            "title": "믿고거르는 SSC과목",
            "comment_content": "굉장히 부실하다고 느꼈다. 제목은 GREAT IDEA라고 써놨지만 사실상 마구잡이로 배우는 것이 가깝다 느꼈다. 화학은 역사쪽을 가르치고, 생물은 철학을, 수학은 진법등을 가르치는데 그동안 고등학교 과학시간에 졸지않고 열심히 했다면 한번쯤은 봤었을 법한 내용들과 디테일한 설명이 부족해서 과학을 보는 시각을 넓히는데 큰 도움이 되지 않았다.",
            "comment_teaching": "화학교수님: WILLIAMS, Ian Duncan<br />초반에 성실히 가르쳐 주시는 모습은 눈여겨 볼만 하다. 영어는 능숙하시고 궁금증을 유발하게 하는 몇몇 질문도 가끔 한다. 그러나 치명적인 단점은 이 교수님은 수면제다. 가르쳐 주시는게 너무 지루하다. 그렇지만 교수님 탓이기 보단 콘텐트가 지루한게 더 큰거 같다.<br /><br />생물교수님:CHOW, King Lau<br />최악의 교수님. 가르치는 내용은 거의 없고 열정적이기만 할 뿐이다<br /><br />수학교수님:YAN, Min<br />결석왕. 수업 6번빼고 얼굴을 드러낸 적이 한번도 없다. <br />그래도 내용은 빠짐없이 다 가르키시고 다 시험에 나오는 걸 보면 평타인 교수님<br /><br />물리교수님: FOREMAM, Bradley Alan<br />일명 스캐너. PPT에 있는 내용을 그대로 읽어주시는 선생님이다.<br />자세한 설명은 생략한다.",
            "comment_grading": "이 과목을 수강한 순간부터 성적은 보장할수 없다.<br /><br />1. PPT에 글자보다 그림이 더 많다. 그리고 대부분의 설명이 부실하며 시험문제를 푸는데 대부분 도움이 않된다고 느꼈다. PPT로 복습할수 없기때문에 배운내용을 다시 떠올리는 데 지장이 있다<br /><br />2. 생물시험은 PPT와 전혀 무관한게 출제된다. 생물선생님의 생물과목에 관한 철학을 듣고 배껴적는 문제<br /><br />3. A1크기의 포스터를 만들어서 게시해야 하는데 성적을 매기는 평가기준이 교수님 맘대로다.",
            "comment_workload": "많지는 않지만 A1크기 포스터를 만드는 조별과제가 있다. 조별과제 조원을 잘못 만날경우 workload는 D. 조원이 캐리할경우 B.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 12,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}