{
    "error": false,
    "course": {
        "id": 3357,
        "subject": "SOSC",
        "code": "1510",
        "name": "Politics Through Film",
        "description": "This course discusses key concepts in politics using films as course materials. Movies illustrate human lives and feelings in a dramatic way, which often allows us to experience historical events or lives in the other side of the world indirectly. The purpose of this course is to provide an overview of the field of political science and key events in political history by watching movies describing them. Often political concepts such as state, democracy, dictatorship, repression and protest, representation, and election, are considered too abstract or too complicated. Addressing those concepts through movies will allow students to understand those concepts with living examples and empathy. The course explores important political topics and themes including political power and election, democracy, protest and repression, media, corruption, and war. By watching movies, attending lectures, and participating in discussions, students not only learn these concepts but also understand that political issues are part of our society and history and have a substantial influence on individual's life.",
        "categories": [
            "Common Core (SA)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2130,
            2010
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.5,
        "rating_teaching": 4.1,
        "rating_grading": 4.9,
        "rating_workload": 4.3,
        "review_count": 10,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 665,
                "name": "HONG, Jean (Ji Yeon)",
                "count": 9
            }
        ]
    },
    "reviews": [
        {
            "hash": "aW0uRHz8IuKGGCALRWu8YAweArwSgSl9",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 665,
                    "name": "HONG, Jean (Ji Yeon)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "RyanCookie",
            "date": "Aug 17, 2022",
            "title": "Nice course",
            "comment_content": "Nice movie list. Many movies on the list are interesting, you can learn a lot from these.",
            "comment_teaching": "Nice teaching. Professor is helpful and if you ask her questions, she will",
            "comment_grading": "Nice grading. Although some movie quiz is hard, you can get most of the point if you really watch the movie.",
            "comment_workload": "Nice workload. There is no homework, so no need to discuss workload at all! <br /><br />Actually, there is a final essay to hand in, but it's fun to do since you are writing the movie you love.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fmAGi8LQArKGKjfgllpO6IHlh56Qvv8A",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 665,
                    "name": "HONG, Jean (Ji Yeon)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "italiangoat",
            "date": "Apr 26, 2022",
            "title": "Light workload + leng grade",
            "comment_content": "Excellent course if you like to watch movies other than Hollywood blockbusters. The course invokes a lot of reflection on your societal views. In short this course is one of the few courses you can truly enjoy, plus it is a CC!<br /><br />- Covers multiple social aspects such as poverty, corruption and racism<br />- Required readings given out every week but it is not really covered in the quizzes or finals<br />- One movie is watched out of class every week, then the contents and thoughts are discussed in detail in class",
            "comment_teaching": "The professor is Korean but her English is easy to understand.<br />Lectures are 3 hours long so it might get a bit boring",
            "comment_grading": "Grade obtained:<br />B+ (probably because I never turn on the camera lol)<br /><br />Structure:<br />40% weekly quiz<br />- The quizzes are strictly about the movie contents, where it is very easy to get most of them right if you did not fall asleep during the movie.<br /><br />30% Finals<br />- Lecture slides and required readings are covered in the final exam. However since there are too many pages to read on the required reading, I just skipped them all together and studied the slides only, getting a score slightly above mean<br /><br />20% Essay<br />- A 1000 word movie critique about a movie you watched (has to be a movie not in the course syllabus) that can be be used to show you understand the materials taught in class. There are no fixed format, but I went with a Plot - Insight - Final Verdict format.<br /><br />10% attendance",
            "comment_workload": "One movie every week at a fixed time, shown on zoom and the professor watches it with the class (or you can figure out the less legal ways, so you don't have to watch the movie at a specific time)<br />Final essay requires no research apart from watching the movie",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3AOnrvCCF4LKiEKZKSRqKf37qIS1zfvu",
            "semester": "2020-21 Fall",
            "instructors": [],
            "is_author": false,
            "author": "tony big",
            "date": "Feb 03, 2021",
            "title": "",
            "comment_content": "this course include different topic of politics including democracy, election, dictatorship, constitution, civil conflict etc.<br />Each week students are require to watch a movie and some reading in order to answer quizzes (which is 40% of the final grade). The readings are also important as the final exam questions are mainly from the content of the essential reading.<br />Students are required to complete a film critique after the final exam, the movies are chosen by student themselves, but it must be not older than the students.",
            "comment_teaching": "the teacher require you to turn on the camera during classes.<br />So the first half of the lessons is basically reviewing the film and explaining about scenes that are political. Then professor will talk more about the topic of that day lecture( giving some more data for you to remember for the final exam)",
            "comment_grading": "film quiz is quite important for this course(40%), and the questions are relative simple( if you have watched to movie recently then you must have fresh memories about the movie scenes,then you can answer most the questions correctly).<br />about the attendance check, you just have to turn on your camera, then you can earn the 10%<br />For the final exam, you have the revisit all the lecture notes and essential readings thoroughly or else you wont able to answer most of the question correctly ( I only have 1x/50)<br />after all i got b (given i never really read the essential reading and my final exam just screwed) I think this professor give grade very loosely",
            "comment_workload": "you have to watch a movie night before the lecture which will take you 2 to 3 hours each week, you also have to read some essential reading ( which is the hardest and the harshest part of the course ) about the final movie critique, the deadline was at day which the semester end, so you will have plenty of time to finish the essay.<br />After all if you want a GOOD grade, then you have to read all the essential readings ( which is absolutely heavy workload)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3FSf0cBkvM0sfPwPedtitiqrf8zs1OaT",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 665,
                    "name": "HONG, Jean (Ji Yeon)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Elssio",
            "date": "Jan 31, 2021",
            "title": "",
            "comment_content": "The course is good for people who have not learnt any world history in high school but interested in politics. Topics include election, poverty, democracy, constitution, economic inequality, etc. Each topic will only be discussed once in one lecture with a movie. Students need to watch the movie before each class to do the in-class quiz.",
            "comment_teaching": "I think her teaching is quite good because she will play us some videos of the movie again to analyze it after the introduction of basic principles in the lecture. But if you are not interested in politics, you may find it boring.",
            "comment_grading": "I would say the grading is very good for me. Since I always attend the class but not paying attention to the lecture. But since I read all the PPT and some of the required reading before final, my final exam is still above mean. On the other hand, most of my in class quizzes are below mean or just the mean. But I guess I did well in the essay and final exam so i still got A- eventually.",
            "comment_workload": "Need to watch a movie every week before lesson since inclass quizzes for the movie content are required. You may have to spend lots of time for the required reading, revision and essay if u want to get a good grade.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ioANA1ud14RodZ6aSKUKgNenA0A486RI",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 665,
                    "name": "HONG, Jean (Ji Yeon)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chiaa",
            "date": "Jan 19, 2021",
            "title": "Super NICE professor",
            "comment_content": "这堂课主要是透过电影看不同的政治议题，包含democracy, autocratic, election, racism等。虽然主题是&quot;politics&quot;，但其实还包括social issues，像是refugee跟economics都有在这堂课提到。<br /><br />每个星期都有一部不同电影，该周主题就是当周电影的议题。教授一开始特别说过他选择的电影会是我们出生以后的电影而且没有documentary（最早的大概是2002?）。但他会在学期末开投票feedback，让他决定下次要进行哪些调整，所以不太确定下次开课会不会有2000以前的电影或documentary。",
            "comment_teaching": "教授是韩国人，但完全没有口音问题，纯正美式发音。<br /><br />教授人非常好，上课会回答学生问题，回email也很快。上课认真，会详细解释ppt的所有概念，不是SHSS的学生也可以轻松上这堂课。<br /><br />两堂课连上时间有点长，但教授会提早20-30分钟下课。<br /><br />（可能因为教授是韩国人，这堂课韩国学生比例特别高）",
            "comment_grading": "Attendance: 10%<br />Movie Quiz: 40%<br />Final: 30%<br />Final essay: 20%<br /><br />attendance: 每堂课都算，学期初有规定要开镜头，但其实至少有一半的人没开镜头。<br /><br />movie quiz: 每周小考，大概十分钟左右。8-12题mc，一题short answer（有写就好）。考试只要有看电影就不会有问题，基本上都是问电影细节（ex. 主角的车是什么颜色）。大家的分数都很高（mean 9/11之类的），每次错一两题不会有太大问题，但要尽量高分。<br /><br />final: open book，mc, short answer, long answer，可以看ppt跟material，mean 25.6/50。答案几乎都可以在ppt上找到。不难，但细节不少。<br /><br />final essay: movie critique，1000字内，基本上主题是推荐一部电影，并说服她在下学期的课上播这部电影（跟politics有关，但其实social issues也可以，弹性很大）。free style writing, semi formal，教授说尽量make it as fun as possible。<br /><br />好龟，a range真的不难，假设attendance满分，其他都在mean附近，大概B+没问题。",
            "comment_workload": "每周会有电影时间，开zoom分享画面看电影，看电影时长决定，大部分都两小时左右，自由参加。<br />电影字幕是全英，且会有外语电影（俄语、德语等），可能对非英语系国家的学生会有点压力，但可以自己去网路上寻找片源自己看电影。<br />不管没有参加movie time建议一定要看电影，不然movie quiz一定不会写。<br /><br />除了一定要看电影以外就没作业了，但没事的话能看一下每周的material，提早复习。",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "u89cxrpPRsn44zFfMRvFrZZTD4lzbA4b",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 665,
                    "name": "HONG, Jean (Ji Yeon)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "jnjaem0825",
            "date": "Jan 19, 2021",
            "title": "Good sosc course to take",
            "comment_content": "主要是用一週一部電影帶入各種不同的政治及社會學觀念，例如: democracy, corruption, racism等等等。基本上都是很淺顯易懂而且常常聽聞的主題。<br />教授選的電影也都非常好看，像這學期就有parasite, the post, the idea of march等等等<br />lecture內容主要是解說從電影裡衍生出的政治社會學觀念以及reading material 的重點",
            "comment_teaching": "Excellent! 雖然這堂課是從13:30~16:20上課時間比較久，但教授會非常仔細的剖析每個觀念，即使不是SHSS專業也不用擔心聽不懂! 內容不硬很好理解。<br />Prof is very passionate in teaching，每堂課都想教我們更多的知識，課後有問題也很快會回覆email，超讚!<br />可能因為教授是韓國人的關係吧 這堂課韓國學生好像特別多",
            "comment_grading": "好龜好龜好龜，平常認真看電影movie quiz不要錯太多，movie critique 認真寫且符合教授規定，final exam 把上課ppt讀熟，A range 真的不難，prof很看重attendance，所以每一堂課都要全程上線(但不一定要開鏡頭)，不然可能會被扣attendance分。<br />好課一生推! 大推sosc1510!",
            "comment_workload": "平常每周課前要看一部指定的電影，上課一開始有10分鐘左右的quiz，內容基本上就是考電影細節及有沒有認真看電影，整體而言其實不難。<br />期末essay是自己選一部電影寫movie critique，沒有特定格式，這學期是規定1000字以內<br />final exam的話主要是考上課ppt和每週reading material的內容，prof上課都教的非常詳細，所以準備起來基本上不會太吃力<br />雖然說每周都有reading material，但其實教授上課都會講解裡面的重要觀念，所以其實看不看reading material都ok啦",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "p0nvfv8813HQZPdV0DOcsLfOZvdyFp6R",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 665,
                    "name": "HONG, Jean (Ji Yeon)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TheodoreYuen",
            "date": "Jan 19, 2021",
            "title": "Recommended for Common Core (SA) requirement",
            "comment_content": "Introduction of the course and some basic idea of &quot;politic&quot; for the first lecture<br />Starting from the second lecture, we focused on different topics related to the movie we watched that week:<br /><br />*The Lives of Others (German film) - Democratic vs Autocratic Regime<br />*No (Chilean film) - Democracy<br />*Lincoln - Separation of power<br />The Ides of March - (American) Election, Populism<br />Selma - Universal suffrage<br />*Green Book - Racism<br />*The Post -Media and &quot;fake news&quot;<br />Leviathan (Russian film) - Corruption<br />*American Sniper - War<br />Capernaum (Lebanese film) - Poverty, Refugee<br />Parasite (Korean film) - Poverty, Inequality<br /><br />Personally enjoy the movies with a *, overall a decent list. The topics are elementary but still quite interesting",
            "comment_teaching": "1 lecture per week, 2-3 hours per lecture, mostly going through the lecture notes with additional details, reviewing certain scene in the movie by the end of the lecture.<br /><br />The professor is friendly, encourage discussion and will answer questions from students.",
            "comment_grading": "Attendance: 10%<br />Film Quiz: 40%<br />Final Exam: 30%<br />Final Essay: 20%<br /><br />Final Exam:<br />Mean: 25.6/50<br />Highest: 41.3/50<br />Lowest: 11/50<br />SD: Not published",
            "comment_workload": "Overall pretty light<br /><br />Film Quiz:<br />Basically a way to check if you have watched the movie, if you paid attention during the movie, you should be able to get full marks<br /><br />Final Exam:<br />Mostly cover the content of the lecture notes, reading would help but not necessary if you are just looking for a pass<br /><br />Final Essay:<br />A critique of a movie not covered in the course, 1000 words limitation but you can go slightly over it. The grade for the essay was not published. The essay was due after the final exam week which made things a bit easier",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "GjzIg4yWpLQ7ZKWrPAxg8gqLQeRQuScr",
                    "name": "SOSC1510_2020Fall_Syllabus_updated_Oct2020",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "jNKsiwlhzQMBDWmzwWtCcWQMUGCsEkj5",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 665,
                    "name": "HONG, Jean (Ji Yeon)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "eshamahbu",
            "date": "Jan 18, 2021",
            "title": "Not too difficult, high time commitment",
            "comment_content": "Format: Watching movies every Monday then discussing the movie during the lecture the next day <br /><br />The movies you watch are half foreign language and half English films. Many are boring, except for the ones near the end of the syllabus.<br /><br />Attendance: She apparently takes attendance but it's just turning on your camera at the start of class<br /><br />Syllabus: <br />Week 1: Introduction: Politics and Conflicting Values<br />Week 2: State and Power <br />Week 3: Democratization<br />Week 4: Presidency, Congress, and Constitution<br />Week 5: Election and Campaign<br />Week 6: Universal Suffrage and Civil Rights<br />Week 7: Discrimination and Racism<br />Week 8: Media<br />Week 9: Corruption and Lobbying<br />Week 10: Civil Conflict<br />Week 11: Terrorism and Human Rights<br />Week 12: Poverty (and Refugee)<br />Week 13: Economic Inequality (and Poverty)<br /><br />All of these topics are quite basic, and if you read the lecture notes, you don't really need to attend the lectures. Also go through the readings!!! They're really important for the final exam.",
            "comment_teaching": "Boring teaching, but slides are pretty interesting<br /><br />Lectures are 2-3 hours depending on how she's feeling, and half the lecture is just rewatching scenes from the day before<br /><br />She just goes through the slides and adds her own input, but none of what she says is relevant to what will be on the exam.",
            "comment_grading": "Attendance: 10% --&gt; I got 100%<br />Film Quiz: 40% --&gt; I got 70%<br />Final Exam: 30% --&gt; I got around 70%<br />Final Essay: 20% --&gt; ?<br /><br />The final exam (online) wasn't that hard if you prepared with the readings and lecture notes. Keep all the tabs open for lecture notes and readings, and make sure you know where the information is (ex. she asks about 'corruption', go through the corruption slides)<br /><br />The final essay is very easy, it's just recommending a film that has politics involved. It's very vague, so do with it as you will. <br /><br />Even though I got low marks on the quizzes and final exam, I ended up with a B. Grading isn't very transparent.",
            "comment_workload": "Two hour lecture + movie session every monday<br />Besides the in-class quizzes, there's no work to do besides the final paper<br />Honestly, just a shitty time commitment because lectures are so long",
            "rating_content": 3,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "zGvs47DaCYADVtBKNBV8PKYUmrCQabYC",
                    "name": "SOSC1510_2020Fall_Syllabus_updated",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "lfCNZcO2OCtz4KIbRxMwm50kKLBWNHnK",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 665,
                    "name": "HONG, Jean (Ji Yeon)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "科大虧佬",
            "date": "Jan 17, 2021",
            "title": "Good course especially interested in politics",
            "comment_content": "The whole course is not the type of deep politics study but some easy understanding issue on politics. Such as discrimination, corruption, housing problem, etc. The course is suitable for people even having 0 knowledge on politics study. Content is different from my expectation but still satisfactory and inspiring.",
            "comment_teaching": "Nice professor. Good accent. Her teaching is fun and inspiring. She will listen to the opinion of the students. But the lesson duration is VERY LONG. Eventually, I found it bored and play my phone.",
            "comment_grading": "Quiz 40%<br />Attendance 10%<br />Final Exam 30%<br />Essay 20%<br /><br />I attended every lecture and almost score full marks on every quiz. I score 16/50 on the final as I did not do revision. I don't know the score of my essay but I think it may meet mean. I rushed the essay but I have deeply think of the topic and the content before. I score a B for the course which I would say is quite good as I did not study hard and score a very low mark in the final.",
            "comment_workload": "I would say the workload is actually quite light as I enjoyed the movie every time and for me, it is not an assignment. Students are required to watch a movie every week and finish a quiz before the lecture. The quiz is effortless, which is straightforward to the movie content. Such as: where does the character go for the meeting. So it is very easy to score full marks every time if you fully understand the movie. I strongly recommend watching subtitles in MOTHER LANGUAGE(just simply google the movie for yourself). I watch the movie myself in Chinese subtitles every time and it really helps a lot. The final exam is open book this semester and it is not that difficult(unless stupid like me forget to make good use of combined pdf) And a maximum of 1000 words for the essay which is reasonable amount for me. Btw there are TONS of reading material but I read none of them :) And Jean won't mention it in the lecture but friendly remind you to read.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0nUUaMLuJJ8dWTy3ufuO4mBorETvbv6c",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 665,
                    "name": "HONG, Jean (Ji Yeon)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "louloulou",
            "date": "Jan 07, 2021",
            "title": "",
            "comment_content": "The overall content should be fun, but the course hours each week was way too long (3 hours), so ppl could fall asleep quite often during the class. Since it is a film-based class, we need to watch a movie every week and have a quiz solely about the movie content during the lecture. Every week, the course will have a different theme, for the first two and a half hours, professor would discuss about the key concept of the political theme, and then she would discuss the movie plot.",
            "comment_teaching": "The content could be fun, but since the lecture hour was toooooo long, I could feel quite bored some time. The teaching was okay (I wouldn't say good cuz it wasn't). If the faculty makes the course duration lowered to 80 minutes it would be better.",
            "comment_grading": "Quite satisfactory. Quizzes consisted of 40% of the grade, which is great because quizzes are usually straight-forward (as long as you watched the movie). As much as I remember, attendance 15%, final film critique 20%, final exam 30%. I got below mean for final, but since it was only 30%, that was not a big deal I guess. Got a A- at the end tho I didn't prepare much for the final.",
            "comment_workload": "Not much, as long as you just need to watch the movie every week (and those movies are fun actually), then you'll be fine. Although there were tons of readings, I have to be honest that I didn't read any of them carefully. The final will be closely related to those readings, so if you're thinking of doing this course, you should be prepared to read a lot.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}