{
    "error": false,
    "course": {
        "id": 1135,
        "subject": "SOSC",
        "code": "1190",
        "name": "China and the World:  China's Development in Historical and Comparative Perspectives",
        "description": "In order to help the students better understand the causes and consequences of the economic development in contemporary China, this course examines this phenomenon from both historical and comparative perspectives. The course starts by reviewing the formation of a vibrant market economy in China from 1700 onward and introduce progress made in the studies of Chinese economic history. This historical background is important to view the socio-economic characteristics of the pre-1949 Chinese society and their relevance to modern economic growth. This course also exposes the students to the basic concepts and analytic tools in political economy such as market economy, the state, conflict of interests, correlation and causality, and selection bias. This illustrates the importance of causal explanations in social scientific inquiry and encourages students to compare it with similar causal reasoning in science and engineering.",
        "categories": [
            "Common Core (SA)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2110,
            1940,
            1910,
            1740,
            1730,
            1710,
            1610,
            1530,
            1510,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.48,
        "rating_teaching": 4.37,
        "rating_grading": 4.15,
        "rating_workload": 3.74,
        "review_count": 27,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 652,
                "name": "HE, Wenkai",
                "count": 18
            },
            {
                "id": 784,
                "name": "SAUTMAN, Barry Victor",
                "count": 8
            }
        ]
    },
    "reviews": [
        {
            "hash": "hhBgL7jR5vKV2WfiOhXTJtbJOsBF6C9i",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "vault34overseer",
            "date": "Dec 21, 2015",
            "title": "",
            "comment_content": "佢係將中國嘅經濟發展由明末一直講到宜家。佢講到點解中國明清嘅時候點解同西方走上一條唔同嘅路,同埋分析現代中國嘅原因同埋影響。除此之外，呢一科好重視訓練學生嘅邏輯思維同分析因果關係嘅能力。比如就中國明清時期嘅發展佢會講一啲學者提出過嘅理論,然後同你比較唔同理論再要求學生提出一啲論據去測試一啲理論嘅真確性。對於會讀sosc為主嘅學生係一定唔可以錯果嘅一個course,係一個好好嘅sosc入門course。",
            "comment_teaching": "佢啲英文講得okay嘅，上堂亦都唔會無聊，因為佢講嗰啲嘢都會引起你嘅思考。但我自己就唔鐘意佢唔畀上堂嘅時候唔同學生之間自己討論。一見到你傾計就會叫你發表意見，但係好多時自己都未整理好，所以焗住唔出聲。",
            "comment_grading": "二成parti,midterm final各四成<br />midterm同final都可以揀做paper,但我就揀曬考試。<br />考試有短同長問答,有啲fact要記,theory嘅名同內容要記,同內容真係要明得透徹。<br />個grade就唔差嘅，印象中我midterm同final都有零點幾個sd,最後出嚟都有B+.",
            "comment_workload": "reading我淨係睇咗一份<br />除咗midterm final之外都冇其他嘢做<br />但係要高分嘅話就都要上足堂(唔只係講parti分)，明曬啲theory,有背到少量重要嘅fact同term,所以我都建議想讀呢個course嘅人真係要畀時間心機",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 4,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uC4zuuPr7Cn1mfow8sF0oS1dF16rsewj",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GutenAbend",
            "date": "Dec 24, 2020",
            "title": "",
            "comment_content": "Week 1: Introduction: The connection of late imperial China to the world<br />Week 2: Commercial development in China: 1684-1820<br />Week 3: Growth without Development?<br />Week 4: The land issue: Cause or effect?<br />Week 5: Business ethics and development<br />Week 6: Famine relief in late imperial China: State and Economy<br />Week 7: A revisionist view of the pre-20th century Chinese economy<br />Week 8: Silver in and silver out<br />Week 9: The deadly good: The opium trade and the Opium War<br />Week 10: The Self-Strengthening Movement: 1863-1895<br />Week 11: Civil Society and the Public Sphere in the Chinese Society, 1870-1895<br />Week 12: The tributary system and the international law: China in East Asia<br />Week 13: What is China? The legacy of the Qing empire<br /><br />There are 13 Topics in the course and there are lots of content inside a ppt. So it is better to take the course in summer semester.",
            "comment_teaching": "Professor speaks English really clearly and he is willing to answer any questions during the lectures.",
            "comment_grading": "6-8 pages written report (40%)<br />3-hour open-book exam (60%)<br /><br />Marks will not be released, both the written report and the exam<br /><br />However TA will give advices on your English writing and grammar regarding to the written report. That is really good!<br /><br />Final Grade: A <br /><br />Professor is really generous in giving good grades!",
            "comment_workload": "Writing Report takes lots of time to do as you need to find second-hand information regarding a modern factory or corporation, or important entrepreneurs in modern economic sectors such as banking, transportation in the late 19th and early 20th century<br /><br />Exam focus more on the implementation of the concepts made by the sociologists than Chinese history. So full understanding on the sociology’s concepts and ideas is much more important than reciting all of the content in the ppt.<br /><br />Of course knowing a little bit on Chinese History before is absolutely an advantage.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IfRWmKs9LHm9TqX49ZGXvBtzcJEEPTo8",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bigboy777",
            "date": "Aug 20, 2020",
            "title": "",
            "comment_content": "Mostly about Chinese history from the Qing Dynasty. Mainly talking about why China didn't achieve industrial revolution while the UK did. <br /><br />Not everything is in the ppt, some key points are elaborated in the lectures, so I recommend you going to the lectures (at least watch the recorded lectures).",
            "comment_teaching": "Prof. He has good English, unlike other professors at ust. However, if you have no prior background knowledge of Chinese history, some of his explanation is not going to make very much sense. <br /><br />While you can ask questions, don't expect a discussion. It can get boring as the class is almost 3hrs in summer semester.",
            "comment_grading": "As I am writing this, the grades have been released without any breakdown of scores. However, it is lower than I expected. <br /><br />Again, if you are an int'l student with no knowledge of Chinese history (and not very interested), I don't recommend this course. It's not just the difficulty of fully understanding the concept, there's just too many Chinese students that have the edge.",
            "comment_workload": "From my perspective, unless you are going to devote your whole summer (I guess no one), you probably won't be able to finish the optional readings and fully grasp the ppt slides as there is a lot content.<br /><br />Analysis report on an enterprise/individual that benefitted from Chinese traditional resources (40%)<br /><br />3-hr exam on 8 long-response questions. IB style. (60%).",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kkoDtYgLjvGtDaDWQCXCl7AzefZ0j3dh",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Typhoon",
            "date": "Aug 02, 2020",
            "title": "Dont take this if you dont have faith in this",
            "comment_content": "The content is too heavy for 1 lesson. You have to digest the content. If you&nbsp;&nbsp;are not familiar with the Chinese background, I suggest you not to take this.",
            "comment_teaching": "The teaching is quite clear. You can ask questions through online and he will respond.",
            "comment_grading": "The grading is really not good<br />The final exam is all long questions and each cost about 10 marks and it's quite hard to understand the scenario of the questions",
            "comment_workload": "You have to digest the powerpoint before you attend the lessons or you are really lost in the lesson. There are a lot of sources and articles too you have to read too.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "S7nhVFj2M82dBkHmyvtzbNBAa3pAWrYM",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "木村森美",
            "date": "Aug 07, 2020",
            "title": "Meaningful",
            "comment_content": "two main stories<br /><br />Development or Modernisation of England and Western Europe<br />Qing's dynasty 清帝國<br /><br />involved some causality or reverse causality in what-if historical analysis. eg <br />A. no industrial development in China, then no such investment?<br />OR <br />B. no risky investment by merchants, then no industrial development?",
            "comment_teaching": "clear and quite proficient in English even though there are some words mixed by both British and American accents. <br /><br />Compared to some instructors from Maths Dept and SENG, his delivery skills are quite good.",
            "comment_grading": "hope it would be rational and fair unlike some courses from the Department of Maths",
            "comment_workload": "● 1 report with about 6-8 A4 pages. (40%)<br />● 1 final exam with 8 long questions in 3 hours if I rmb correctly. (60%)<br />● optional readings(0%)<br />but I think just glancing through those headings are enough if you take more than 1 course in summer semester.<br /><br /><br />acceptable and reasonable for a 3-cred course",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kKEiXBe1OIQNqHZaKfrDKsjYX9JTKwdB",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Freeds",
            "date": "Jan 02, 2020",
            "title": "a good course to get a taste of social science",
            "comment_content": "This course mainly examines one question: why China didn't have industrial breakthrough while at the same time Western countries were developing rapidly. The course introduces some theories and discussed about several factors in Chinese economy. You can learn a lot of background knowledge and also get to know some research methods like causality in social science.",
            "comment_teaching": "It's hard to follow prof's logic if you know little about the course topic. Prof always raised some questions and encouraged students to share their views, but if no raise-hand then he wouldn't elaborate that questions, which always made me confused. Notes are very detailed and take a lot time to read.",
            "comment_grading": "grading scheme:<br />40% midterm<br />60% final group essay<br /><br />I got 96/100 (high 98, only around 6% of students are above 90) in midterm, don't know my grade for essay.<br />Final grade is A.<br /><br />I guess Prof is overall generous in grading (as he said), A range should be large, but only 1 or 2 students can get A+.",
            "comment_workload": "The workload would be light if you are comfortable with English reading or Chinese history.<br />Reading is not necessary, and seems not helpful to the midterm either.<br />Reviewing notes can take a lot of time.<br />Final group essay is about analysis into Chinese economy using materials from newspaper at that time, can be very time-consuming if you are bad at searching information.<br />No other assignments or tasks.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gvamTsqRWUJ7nZtZGHjFDh9gZq14IhMB",
            "semester": "2017-18 Summer",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "thyc0309_",
            "date": "Jul 20, 2018",
            "title": "A fair course to take in the summer vacation",
            "comment_content": "1. Introduction and opening<br />2. Macro-regions and the Smithian growth in late imperial China<br />3. Growth without development<br />4. Agricultural capitalism: family farming in late imperial China: cause or result of underdevelopment?<br />5. Religion and the rise of capitalism: the Weber thesis<br />6. State and market: famine relief in Qing China<br />7. Salt merchants and the great divergence<br />8. Silver in and out<br />9. The opium war<br />10. The self-strengthening movement<br />11. Great North China famine<br />12. The collapse of China's world order",
            "comment_teaching": "His teaching was quite inspiring as he would raise some questions which could stimulate our thinking. However, most of the time the lessons were boring that I fell asleep. Also, he would try his best to encourage class discussions but only very few students (particularly those exchange students) would answer him.",
            "comment_grading": "Since this course is in summer, there is only one in-class final exam at the end of the course due to the time constraint. The exam consists of factual questions (answers in 1-2 words or 1 sentence) and short essay evaluation and analysis questions (in 1 paragraph).",
            "comment_workload": "Since there is only one final exam, the workload is very small. However, there are 12 ppts with 5X slides each to revise, so better start revision early. As for the readings, not much are useful for the exams and only helps slightly in understanding the content. For me I only finished half of them.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "M4U88oyNT4MUsSk8hn1fAWJWcImL7gL3",
                    "name": "2018-Summer-semester",
                    "format": "doc"
                }
            ]
        },
        {
            "hash": "HwzPgdeci9xZJFZPmMYabsSsuHCaPX4n",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cccccla",
            "date": "Feb 01, 2023",
            "title": "Good Course",
            "comment_content": "Week 1: Introduction<br />Week 2: Macro Regions<br />Week 3: Growth without Development <br />Week 4: The Land Problem<br />Week 5-6: The Weber Thesis<br />Week 7: Famine Relief<br />Week 8: The Great Divergence <br />Week 9: Silver In and Out <br />Week 10: Midterm<br />Week 11: The Opium War<br />Week 12: Early Modernisation<br />Week 13: The Collapse of Qing Dynasty",
            "comment_teaching": "His English is good, clear teaching, he also plays documentaries in class which is enjoyable.",
            "comment_grading": "Midterm mean: 49.1 <br />Lowest: 3<br />Highest: 92<br />My grade: 84<br /><br />Final project grade: Unknown <br /><br />Overall: A",
            "comment_workload": "Only midterm and a final group project (Essay).<br />You should attend the lessons or watch the lecture videos because he keeps repeating what will be tested in the midterm—for example, the key concepts and some factual information. You should understand the concept without having to memorise it too hard. Basically, the content after the midterm is not important tbh. <br />Don't need to read the reading material.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vmgVyNXjUS4vOx9MEmJKWI5aelStYxqY",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ELLLLE",
            "date": "Sep 01, 2020",
            "title": "Insightful interpretation of Chinese modernization with some up-to-date content",
            "comment_content": "Basically focus on late Qing Imperial China (about 1680~1920) and follows the time order.<br /><br />Almost every topic comes with a method in soscial analysis raised by a famous scholar, e.g. reverse causality.<br />Week 1: Introduction: The connection of late imperial China to the world<br />Week 2: Commercial development in China: 1684-1820<br /><br />Week 3: Growth without Development?<br />Week 4: The land issue: Cause or effect?<br />Week 5: Business ethics and development<br />Week 6: Famine relief in late imperial China: State and Economy<br /><br />Week 7: A revisionist view of the pre-20th century Chinese economy<br />Week 8: Silver in and silver out<br />Week 9: The deadly good: The opium trade and the Opium War<br />Week 10: The Self-Strengthening Movement: 1863-1895<br />Week 11: Civil Society and the Public Sphere in the Chinese Society, 1870-1895<br />Week 12: The tributary system and international law: China in East Asia <br />Week 13: What is China? The legacy of the Qing empire",
            "comment_teaching": "It's really precious to have such an open-minded prof to teach us to have an inclusive mindset in both history investigation and today's politics. <br /><br />Prof. HE is super patient and very kind to everyone, even to students asking rude questions. Most important of all, always being very analytical and rational on political-related issues in both history and today. <br /><br />But the 3 h lecture could be a bit boring and hard to follow if you didn't finish reading the material before class.(even a galnce at all the subtitles would help)",
            "comment_grading": "Two parts:<br />1.&nbsp;&nbsp;&nbsp;A written report of one modern factory or corporation, or important entrepreneurs in modern economic sectors such as banking, transportation in the late 19th and early 20th century: to examine the contribution of Chinese market economy (networks, business ethics, or entrepreneurship, etc.) to the growth of modern sectors. 40 %<br /><br />about 10 pages <br />2.&nbsp;&nbsp;&nbsp;The final exam (3 hours).: 60 %<br /> <br />8 short essay questions<br /><br /><br />The due date of the report is 2days after the exam.",
            "comment_workload": "All lectures are recorded. <br />Final is not that hard but needs intensive extra reading for the report.<br />I skipped about 50% of classes and only did all the readings for the first week.(after that, just have a quick look of the subtitles)<br />I spent 2 whole days reviewing all the ppts (which is really well organized) and reading materials. I think I did well in the Final and I put a lot of effort in my report. <br />Got an A- at last . <br />Fair grading for my attendance and overall efforts.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bwEix8yJbGqheMaRT7Xn5eYiQOaQV2mQ",
            "semester": "2019-20 Summer",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HonestReview01",
            "date": "Aug 28, 2020",
            "title": "",
            "comment_content": "The first half of this course mainly focuses on the agricultural development of China and why the Industrial Revolution began in the core region of Europe but not the core region of China. Different approaches like the Weber thesis and the reverse causality method are used to investigate the differences between China and the West. The second half of this course focus on the political situation of Late Qing-China.<br /><br />Lecture 1:Introduction<br />Lecture 2:Macro Regions<br />Lecture 3:Growth Without Development<br />Lecture 4:Agricultural Capitalism<br />Lecture 5:The Weber Thesis<br />Lecture 6:Famine Relief<br />Lecture 7: Salt Merchants And The Great Divergence <br />Lecture 8: Silver In And Out<br />Lecture 9: The Opium War<br />Lecture 10: The Self-strengthening Movement<br />Lecture 11: The Great Famine In North China and A Global Civil Society<br />Lecture 12: The Collapse of China's World Order",
            "comment_teaching": "He has a nice English accent and willing to answer your questions during the Lecture. Feel free to raise any questions if you have any.",
            "comment_grading": "-A Written Report of A Modern Factory, Corporation or Entrepreneur (40%)<br />-The Final Exam (3 hours) (60%)<br />Final Grade:B<br /><br />The questions of the final exam are quite challenging in my point of view but I think the overall grading is fair as a SOSC-Course.",
            "comment_workload": "There are supplementary readings before each lecture and you have to spend some time digesting the content of each lecture. I faced some difficulties in analyzing some topics even though I have some basic knowledge about Chinese History. Moreover, you have to invest your time in finishing the Written Report.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Q30Q6xiXAazlNwAL4xeJicLqxggonCTu",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GW17",
            "date": "Jan 23, 2020",
            "title": "",
            "comment_content": "From about Qing dynasty until around the Opium War.",
            "comment_teaching": "No talking was allowed. A several students tried to talk to their friends and the professor may asked them to share their views. <br /><br />The content was quite clear and he encouraged students to think more.",
            "comment_grading": "Midterm:86/100<br />(lowest is around 0?)<br /><br />Essay: 90 sth/100 <br />(I chose to do individual essay)<br /><br />No attendance",
            "comment_workload": "Around 40 slides of ppt per lecture and 2 readings every week. <br /><br />There are midterm which consisted of short and long questions. You must be very familiar with the readings to gain good grades. In the long questions part, the profession may asked you to use a certain reading to interpret a statement (3-5 questions and 1-2 pages per question). <br /><br />For the essay, we were required to do newspaper cutting from the old newspaper. Therefore, you may need to translate the old style Chinese or English to something readable in your essay.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "4n9sGf3DpMOjYxRuhZ9mBTyqzEsYxN3H",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "msdaydream",
            "date": "Jan 03, 2020",
            "title": "",
            "comment_content": "Mainly on Fairbank's theory, industrial development of China and Qing Dynasty",
            "comment_teaching": "His teaching was quite confusing. He would raise questions in class and ask people for opinion. His notes lack linkage and people who are unfamiliar with Chinese history would be puzzled. His suggested readings are also quite unrelated to his lecture PPTs so I would suggest to treat the ppts, lectures and readings as 3 separate set of materials.",
            "comment_grading": "40% midterm<br />60% final project<br />He was quite lenient to students and said he would allocate more marks to the final project if students performed poorly in the midterm.",
            "comment_workload": "The key to having a light workload is to choose the right groupmate for the project. He suggested having 3 in a group so you can collect more newspaper material for a better essay. The newspaper sources were all blurry and hard to read and it would be painful of you are the only one working on it.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WOaVg99K6vmbndzdfloXFdQdMoH3TwVJ",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "99",
            "date": "Nov 05, 2018",
            "title": "good grades",
            "comment_content": "介紹中國和其他國家（主要中美和中非）關係<br />notes非常詳細（中英）",
            "comment_teaching": "教得幾好幾有趣<br />但係我就好少去上堂 考前睇翻notes就得",
            "comment_grading": "本人認為淨去midterm同final已經足夠<br />miterm同final考前睇咗一日<br />midterm同final both mc（每一條題都有中英文對照，難度唔大）<br />midterm同final啱啱過mean，b-",
            "comment_workload": "非常小<br />no quiz ，no homework<br />得midterm同final，both mc <br />可選擇present（本人認為唔present影響唔大）",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vfWoP67CHEdLwOHfZlIJVxGF1vXBA9pT",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yktse",
            "date": "Oct 20, 2018",
            "title": "",
            "comment_content": "內容唔難, 容易明白, 大部分ppt中英對照",
            "comment_teaching": "Prof英文好聽",
            "comment_grading": "可以揀做唔做project, 做左midterm&amp;final會計少d<br />係拉curve派grade, 本身讀嘅人唔多, 所以每個",
            "comment_workload": "唔做project基本上冇workload, 得一次midterm一次final, 全mc, 題目仲要中英對照<br />lecture唔計attendance, 有lecture video<br />有tutorial, 不過係optional, 去唔去都冇所謂",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vM0AZ7DVtxaRWl92HKZ4VXLYeClCHoQP",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "USTheagod",
            "date": "May 15, 2018",
            "title": "Nice common core course for you to learn more about China's relations with other countries",
            "comment_content": "Midterm (48MCQ):<br />- theories of development (6MCQ)<br />- China-Africa relations (42MCQ) (remark: lots of slides but you don't need to memorize as the exam won't ask you to recall some hard facts)<br />(*quite easy in my opinion)<br /><br />Final (52MCQ):<br />- China-US relations (&amp; TW,Tibet) (32MCQ)<br />-** Student presentations (20MCQ) (there were 10 presentations in last 4 lectures, their powerpoints will be uploaded after the presentation)<br />(*the questions esp. China-US relations were so difficult for me that I 9guessed so many of them even though I studied hard.... so I screwed up my final:(<br /><br />- (Optional)&nbsp;&nbsp;project+presentation (12-15 pages/ topic is China's relations with any other countries) <br />(50% project, 50% exam if you choose to do the project)",
            "comment_teaching": "Professor is an expert in China studies especially China-Africa relation ( he had a research team and did some research in Africa wtf..) He is a nice teacher who always welcomes students to raise questions during the lecture :)<br />He speaks so slowly that I have to use 1.5/2X when I watch the lecture video in canvas lol",
            "comment_grading": "I guess it is fine:<br />A-range: 29 people <br />B-range: 36 people<br />C-range: 32 people<br />D: 10 people<br />F: 6 people<br />BUT the professor only gave 4 A+ and 4 A in a 108 people class and there are some very strong people who almost get full mark in the exam<br /><br />Here's my marks for your reference:<br />Midterm: <br />42/48<br />Mean:&nbsp;&nbsp;36.1 <br />Median: 37<br />Highest: 47<br />Lowest: 21 (exclude some 0)<br />SD: 5.3<br /><br />Final:<br />35/52<br />Mean: 32.3<br />Median: 33<br />Highest: 47<br />Lowest: 19<br />SD: 5.2<br /><br />Overall: 77/100 A-",
            "comment_workload": "fair. All you have to do is to prepare for midterm &amp; final (non-cumulative) if you choose not to do a project(only a few people chose to do it; remark: on average, grades on papers are one full grade above the average grades from the exams alone)<br /><br />-Tutorial is optional <br />-Optional reading provided in every lecture",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "t98la7hpJim0rLr5TAVhAen6Sve5RxCD",
                    "name": "China and the World Syllabus 2018",
                    "format": "docx"
                }
            ]
        },
        {
            "hash": "8iSxyd9CnpsZrzEg5arIEjInJZEqU8ZJ",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "alexchw",
            "date": "May 06, 2018",
            "title": "Quite good for both lazy and hard-working students",
            "comment_content": "I think it can bring convenience to students as there will be the video of lecture after the end of lecture so the students who are absent can do through once for it, which is really good.<br />During lecture, Prof. will explain different issue with different tones, so you can get the knowledge easier.<br /><br />Nothing to add, really rich in the content of the course, definitely deserve A in content part.",
            "comment_teaching": "As i have mentioned, he can use different tones to explain different concepts and issues to students, so I think students can get the knowledge easier...<br />Besides I think Prof. can show plenty of knowledge which can definitely meet the requirement of the course and also the forecast of students.<br /><br />So A.",
            "comment_grading": "I think the grade is sensible, but writing essay is not a must to get the good grade...<br /><br />Before choosing whether to write essay and present, think carefully about the time planning.<br /><br />To myself, I like to work by my own as presentation and project may meet some free-riders.",
            "comment_workload": "I think it is almost zero workload<br /><br />no attendance requirement<br />no mid-term<br />no final <br />just two small quizzes<br />Optional for essay and presentation",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "r1659virWgjD3er4fbO2atsba8bOQSkd",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "anosn",
            "date": "Jan 26, 2018",
            "title": "Not a bad choice for a common core",
            "comment_content": "There are quite a lot of reference have been assigned to read, but it is not necessary to&nbsp;&nbsp;read them all. Most of the point are included in the PPT. Most of the content is about the late- imperial empire which was taught in secondary school.&nbsp;&nbsp;It will not take attendance and you can read all the reading material for midterm exam without taking any lessons.",
            "comment_teaching": "Most of the lecture are reading the main point in the reference. One of the lesson are midterm and one is for students sharing their work. If you are not concentrate in the lesson, the professor may ask you to leave.",
            "comment_grading": "I get one&nbsp;&nbsp;A- &amp; B in assignment.The marks for final essay is unknown.&nbsp;&nbsp;Midterm is&nbsp;&nbsp;quite difficult. You have to do 10 mc + 10 short essay questions in hour. Midterm score below 0.7 SD <br />Final grade: B",
            "comment_workload": "There are 3 assignment and one final essay you have to do. The assignment is around 800 words and the final essay is about&nbsp;&nbsp;2000 words which is acceptable as there is no final exam and the are quite&nbsp;&nbsp;a lot of reference for your assignment.&nbsp;&nbsp;Grammar mistakes did not take an important role in the assignment.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "D74ECUNucgbRi7OBCoR0bTiHnmdvasl9",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LouisLaw",
            "date": "Jan 09, 2018",
            "title": "",
            "comment_content": "basic historical background and critically examine the causal structure of “growth without development”<br />specific topics in agrarian economy, city and market, merchant ethics, state-market interactions in famine relief, industrial development and capital formation, and monetary system and public finance<br />some of the institutional defects of the Chinese economy and how they affected the transformation of China into a modern economy in the late nineteenth century. <br />There is also some portion about Sino-Korea and Sino-Japan relationship in the very end of the course.",
            "comment_teaching": "Excellent teaching. I love how he speak English &lt;3<br />His lectures are inspiring, he often ask questions that I never thought of and I can't help thinking after lecture, and those questions only lead you to more questions. so I encourage you to actively engage in discussion during lectures, it helps a lot!<br />But his slides are poorly made, only consist of some basic information about the questions he wants to discuss, sometimes only a question for a slide, so you better go to lectures as there is also no lecture videos.",
            "comment_grading": "For the midterm I above mean about 20 marks, and A for every assignments, I don't know how he rate my final essay, but I eventually got a B+.",
            "comment_workload": "2 response paper, asking you to write your own thoughts on the material provided, 2 pages only.<br />1 newspaper reading, this one is slightly complicated. You have to find a news report on a Chinese newspaper a century ago, and write some review on the news report you selected, 8 pages. Some outstanding students will be selected to do a presentation of their own review.<br />And a in-class midterm exam, very easy though, attending to lectures and a little revision is all you need.<br />Readings is surely not necessary but helpful for in-class discussion.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "GaJBMLhlCa0ILQf61Ej9hyBZOj9Y7sBA",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Percy",
            "date": "Dec 22, 2017",
            "title": "",
            "comment_content": "the course mainly deals with the motivation and process of modernisation in late imperial China. every week some theory (mainly from sinology) and facts will be introduced and there will be some logical reasoning and discussion in class. there is also assigned reading concerning the topic of the week. but the lecture is actually professor's own understanding about the topic and is not exactly the same with the reading.",
            "comment_teaching": "the professor speaks very good English and encourages discussion in class. there was active interaction in the class among students from very diverse backgrounds, which was quite interesting to me.",
            "comment_grading": "normally if you finish all the tasks (which are not that much<br />) you can at least get B, but A requires some more effort and writing skills. there is also opportunity to do presentation if your essay is well-written, which may help your grade.",
            "comment_workload": "you need to write 3 short essays (2 pages) throughout the semester and a long essay at the end, and there is also a midterm, which strongly requires understanding the weekly assigned reading. no final exam.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "7BzbbpqYE1DqGRANGYxew7om1Jf89Gfb",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sigga",
            "date": "Aug 23, 2017",
            "title": "China and the World",
            "comment_content": "The course goes over China's development and its relationship with Africa, Tibet and Taiwan. The content is quite interesting as it offers a different aspect on many of the activities which China is often known and frowned upon for.",
            "comment_teaching": "Teaches through lectures only but they are easy to comprehend as he speaks slowly and clearly, always has the presentations uploaded before class. He also always uploads lecture videos so attendance isn't vital.",
            "comment_grading": "The grading is fair. You can choose to write an essay which will most likely help raise your grade.",
            "comment_workload": "The workload is very light with only a few readings which still aren't mandatory.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vxvyvQllMSjp7ZZ7au38c1QZbCIclgSM",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "TF",
            "date": "Jan 20, 2017",
            "title": "",
            "comment_content": "The professor focused only on two specific topics of China diplomatic relations (China-US and China-Africa). There are 4 and 9 ppts for the topics respectively. For China-US relation, he mentioned about economic and political (human rights, Taiwan and Tibet) issues between the two countries. For China-Africa relations, he started the topic by explaining some of the theories of development. After that, he looked at several aspects&nbsp;&nbsp;&nbsp;including mining, agriculture, neo-colonialism, etc, followed by some additional discourse such as localization and rationalization of labour.",
            "comment_teaching": "The prof has plentiful knowledge and experiences in this domain and he is willing and able to answer questions from the students. The issues and concepts selected are quite suitable for students to have better understanding on those topics.<br />However, the bilingual ppts are a bit lengthy and not well-designed. The Chinese part can be useful but sometimes misleading. Students may feel difficult to go through all the content.<br />The tutorials are optional, mainly recapping the lecture materials.",
            "comment_grading": "Mid-term (48 MCs): 48% (all about China-Africa)<br />Final (52 MCs): 52% (35Qs on China-US + 17Qs on student presentations)<br />Gradings are based on absolute percentages.\t\t\t<br /><br />Students can volunteer to write a research paper for a topic related to China's relation with any of the countries in the world and present it during the last few lectures. Then the grading policy will become 50% on research paper and 50% on exams. The professor said on average, grades on papers are one full grade above the average grades from exams alone (in my case, the final grade increased from B+ to A-).",
            "comment_workload": "Students who attend most of the lectures (or watch lecture videos) and read the ppts should be able to understand and memorize the majority of the content tested in the exams. There can be a few questions that are more challenging and require deeper thinking. The questions about the student presentations are the most difficult and unpredictable. It depends on the topics chosen by those students as well.<br /><br />The workload will increase sharply if you do the paper as it requires a lot of relevant information and research. The presentation will become compulsory as well. After all, it is still worth accomplishing since you will gain more experience of doing a research by yourself.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WaCzLnsxDbnMuIc8UIJ6TfC0PAD0ns0B",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "CANDICE ZHUANG",
            "date": "Jan 20, 2017",
            "title": "",
            "comment_content": "講了什麼聽不太懂",
            "comment_teaching": "照念ppt，有時候不及時跳ppt，你說老師教的好還是不好。",
            "comment_grading": "考試太坑爹，寫了paper還不好龜。",
            "comment_workload": "寫paper workload大，但是寫了還沒有什麼卵用，如果你報了名寫paper但你最後沒有寫，你就可以放棄治療了。有位midterm final第一的人這麼做，然後就掛了。",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Kv16OhZK3HCqUwlAMbmTT7SgByz2LHvR",
            "semester": "2015-16 Spring",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "veda",
            "date": "Jan 19, 2017",
            "title": "Good Course if Prof. He teaches",
            "comment_content": "課程主要分為兩部分。前半學期是關於晚清的一些情況。在課程中會與同時期歐洲的國家進行一些對比。期中essay也適合這個相關的。<br /><br />後半學期是對現代中國進行分析，涵蓋了計劃生育，60年代等現代中國的關鍵時間。",
            "comment_teaching": "超棒的！教授本人是清華大學學精密儀器出身的，但是後來逐漸走上了社會學的道路。英文很標準很容易聽清楚。上課的時候說不上風趣，但是會讓人覺得很有趣，一掃睏意。課外也可在office hour去跟教授探討一些話題，個人覺得受益匪淺。可惜教授去哈佛進修了，希望他回來後還能再上一些有趣的課",
            "comment_grading": "課程成績主要取決於期中期末。期中期末的考核方式可以自由選擇是參加考試還是寫essay。寫essay的話結果會直接以字母rank的形式展示在essay上。Prof本人也比較推薦寫essay。<br /><br />essay的話是寫Prof給定的一個題目。因為這門課本身需要閱讀大量的材料，這些材料會被用到essay中。個人覺得給🐢公平，付出多少努力就能拿怎樣的🐢。",
            "comment_workload": "每週需要閱讀一定量的閱讀。教授每週會放到Canvas上。個人讀的比較慢，大概需要每週八九個小時左右，但覺得還是很值得去看的。",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xWBJ4uKvZJ7Ycmh30CyU5v1aPQZPh6Ek",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DT523",
            "date": "May 22, 2022",
            "title": "SOSC 1190 China and the World: China’s Development in Historical and Comparative Perspectives, 1550-1911",
            "comment_content": "Week 1: Introduction: The connection of late imperial China to the world<br /><br />Gang Zhao, The Qing Opening to the Ocean: Chinese Maritime Policies, 1684-1757 (Honolulu: University of Hawai‘i, 2013), pp. 116-36.<br /><br />Week 2: Commercial development in China: 1684-1820<br /><br />Susan Naquin and Evelyn S. Rawski, Chinese Society in the Eighteenth Century (New Haven: Yale University Press, 1987), pp. 138-216.<br /><br />Week 3: Growth without Development?<br /><br />John K. Fairbank and Merle Goldman, China: A New History, enlarged edition (Cambridge: The Belknap Press of Harvard University Press, 1998), pp. 167-86.<br /><br />Mark Elvin, The Pattern of the Chinese Past (Stanford: Stanford University Press, 1973), pp. 298-315.<br /><br />Week 4: The land issue: Cause or effect?<br /><br />Robert C. Allen, The British Industrial Revolution in Global Perspective (Cambridge: Cambridge University Press, 2009), Chapter 3, “The Agricultural Revolution”<br /><br />Philip C.C. Huang, The Peasant Family and Rural Development in the Yangzi Delta, 1350-1988 (Stanford: Stanford University Press, 1990), pp. 44-92.<br /><br />Week 5: Business ethics and development<br /><br />Max Weber, The Protestant Ethic and the Spirit of Capitalism (New York: Charles Scribner’s Sons, 1976), “Author’s Introduction”, pp. 13-27 and Chapter 2 “The Spirit of Capitalism,” pp. 47-78.<br /><br />Yu Ying-shih, The Religious Ethic and Mercantile Spirit in Early Modern China, translated by Yim-tze Kwong, edited by Hoyt Cleveland Tillman, (New York: Columbia University Press, 2021), pp. 168-199.<br /><br />Week 6: Famine relief in late imperial China: State and Economy<br /><br />Lillian M. Li, Fighting Famine in North China: State, Market, and Environmental Decline, 1690s-1990s (Stanford: Stanford University Press, 2007), Chapter 8, “Famine Relief: The High Qing Model,” pp. 221-49.<br /><br />Pierre-Etienne Will, Bureaucracy and Famine in Eighteen-Century China, translated by Elborg Forster (Stanford: Stanford University Press, 1990), Chapter 12, “The Evolution of the State’s Economic Means,” pp. 289-301.<br /><br />Week 7: A revisionist view of the pre-20th century Chinese economy<br /><br />Madeleine Zelin, The Merchants of Zigong: Industrial Entrepreneurship in Early Modern China (New York: Columbia University Press, 2005), Chapters 1 and 2.<br /><br />Kenneth Pomeranz, The Great Divergence: China, Europe and the Making of the Modern World (Princeton: Princeton University Press, 2000), “Technology?” pp. 43-68.<br /><br />Week 8: Silver in and silver out:<br /><br />Lin Man-houng, China Upside Down: Currency, Society, and Ideologies, 1808-1856 (Cambridge: The Harvard University of Asia Center of the Harvard University Press, 2006), chapters 1 and 3.<br /><br />Week 9: The deadly good: The opium trade and the Opium War<br /><br />Chen Li, Chinese Law in Imperial Eyes: Sovereignty, Justice, and Transcultural Politics (New York: Columbia University Press, 2016), Chapter 5.<br /><br />Week 10: The Self-Strengthening Movement: 1863-1895<br /><br />Stephen R. Halsey, Quest for Power: European Imperialism and the Making of Chinese Statecraft (Cambridge, MASS.: Harvard University Press, 2015), either chapter 6 or 7.<br /><br />Benjamin A. Elman, “Naval Warfare and the Refraction of China’s Self-Strengthening Reform into Scientific and Technological Failure, 1865-1895,” Modern Asian Studies, vol. 38, No. 2 (May, 2004): 283-326.<br /><br />Week 11: Civil Society and the Public Sphere in the Chinese Society, 1870-1895<br /><br />Kathryn Edgerton-Tarpley, Tears from Iron: Cultural Responses to Famine in Nineteenth-Century China (Berkeley: The University of California Press, 2008), pp. 90-155.<br /><br />Week 12: The tributary system and the international law: China in East Asia<br /><br />Yuanchong Wang, Remaking the Chinese Empire: Manchu-Korean Relations, 1616-1911 (Ithaca: Cornell University Press, 2018), chapter 5 and 6.<br /><br />Week 13: What is China? The legacy of the Qing empire<br /><br />Joseph W. Esherick, “How the Qing Became China,” in Joseph W. Esherick and Hasan Kayalu and Eric Van Young, eds., Empire to Nation: Historical Perspectives on the Making of the Modern World (Rowman &amp; Littlefield Publishers, 2006), pp. 299-259.",
            "comment_teaching": "The rapid economic development in China after 1978 and particularly the high-speed growth after the mid-1990s have attracted increasing attention to the historical background of this great economic transformation. Scholarship in recent decades has demonstrated the emergence of a vibrant market economy in China between the late seventeenth and early nineteenth centuries, many key characteristics of which were similar to those of the market economy in pre-Industrial Revolution Western Europe. Why, then, didn’t an industrial breakthrough occur in late imperial China?<br /><br />This course focuses on the interactions between the state and economy in late imperial China from comparative and social science perspectives. In the first two weeks of the course, we will introduce some basic historical background and critically examine the causal structure of “growth without development”. Upon this basis, we will explore specific topics in agrarian economy, city and market, merchant ethics, state-market interactions in famine relief, industrial development and capital formation, and monetary system and public finance. Beyond observing parallels between pre-Industrial Revolution Western Europe and late imperial China, we will also examine some of the institutional defects of the Chinese economy (state?) and how they affected the transformation of China into a modern economy in the late nineteenth century.<br /><br />Methodologically, this course will expose students to the basic concepts and analytic tools in political economy such as market economy, the state, conflict of interests, correlation and causality, and selection bias. The aim is to illustrate the importance of causal explanations in social scientific inquiry and encourage students to make comparisons with similar causal reasoning in science and engineering.",
            "comment_grading": "Mid-term exam: 40 percent<br /><br />The mid-term exam will be a closed-book exam.<br /><br />Final Group Project: 60 percent<br /><br />For the final group project, three students will form one group to work on the following topic and collectively submit a term paper; the length of the paper should be 14-16 double-spaced pages.<br /><br />Topic: Suppose that there had been no Sino-Japanese War in 1894-95 and only international trade in a peaceful East Asia after 1895. What kind of changes, if any, do you think would have happened in the Chinese economy in the 30 years after 1895, and why?<br /><br />Your hypothetical scenario should be based upon the indigenous resources for economic development in China and the strengths and weaknesses of the Chinese political economy as of 1895 as discussed in this course. You MUST collect some materials from contemporary newspapers published in China in either English (such as the North China Herald) or in Chinese (Shenbao 申報) and use these in the term paper. <br /><br />This is an open-ended exercise; there is no single “right” answer. Each paper will be evaluated on the group’s ability, as demonstrated in the paper, to lay out the scenario clearly, to argue logically for your conclusion, to utilize concepts introduced in the course, and to marshal relevant and compelling evidence to support your argument from class materials and your own research.<br /><br />Please note that all three students in the group will receive the same grade based upon the quality of the paper.",
            "comment_workload": "Read the assigned readings before the class and participate in class discussion.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fdHatGhfhrAUW9y7Oc7ILocSItG6N30G",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 784,
                    "name": "SAUTMAN, Barry Victor",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "nonane",
            "date": "Dec 22, 2016",
            "title": "",
            "comment_content": "因為教授換了，內容是講中國與非洲和美國的關係，有很多例子，powerpoint都非常仔細。教授對這個題目非常熟悉。如果對中國有偏見，在這課堂上可能會有轉變，教授看來相當支持中國。",
            "comment_teaching": "Prof 很有熱誠，課堂上會有時間讓學生發問，他對中非，中美關係很熟悉。而且有額外的tutorial，可以加深認識。教授英文口音好好，很容易聽，而且都幾有趣",
            "comment_grading": "個人認為考試不難，容易拿高分，只需要記得一些主要內容，就可以應付midterm，但final會難些。grade應該算是正常吧，around 75%就有A-",
            "comment_workload": "基本上沒有workload，會有些addditional reading，但其實不看也影響考試，而且沒有assignment，wordload是很輕的",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DBEjvlOC1ngJX8xJoOnc4OND8LVG0rXK",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 652,
                    "name": "HE, Wenkai",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "13chanj5",
            "date": "Sep 22, 2016",
            "title": "useless but interesting course",
            "comment_content": "The course goes over the economic development and societal changes of China over the last 1000 years or so, with more focus on recent centuries. The changes are analysed under different social theories and analysis methods.<br /><br />For someone with a lot of experience in social science, the stuff learned here might be pretty simple and boring, but for the average engineering student (me) this course was pretty interesting.<br /><br />The worst part is that the credits for this course is relatively useless for an engineering student",
            "comment_teaching": "The prof speaks good English, goes more in depth than the lecture notes, and invites a bunch of class discussion. Pity no one says anything.<br /><br />His delivery isn't that interesting, but that's alright.",
            "comment_grading": "For the exams, you have the option of writing a essay before the exam, and if you don't write an essay, you take the written exam. The exam focuses a little on trivia, but the main focus is on applying the social theories you learn, which is nice.<br /><br />This is by no means a good GPA booster course, I tried quite a bit, and only ended up with a B+.",
            "comment_workload": "You go to class. You make notes. You do the exam. There's quite a bit of stuff to memorize, but it's interesting, so its not that much work.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YQcpTlFjpfHjADjPshZE0hhvGdpxfw3I",
            "semester": "2014-15 Summer",
            "instructors": [],
            "is_author": false,
            "author": "HepburnMu",
            "date": "Aug 20, 2015",
            "title": "成绩和用时成正比",
            "comment_content": "讲的内容从古到今，还是充分体现了‘比较’二字<br /><br />给的READING可真是不少，我也是拼了老命读完。至于考试，如果你认真听讲做笔记的话还是可以COVER一些知识点，读那些资料主要就是找一个感觉···而且上课的时候不至于打瞌睡，能听得懂讨论的内容并且能够发言（发言很重要）",
            "comment_teaching": "教授英文清楚流畅就足够啦<br /><br />回答问题很热情，调动课堂气氛也不错<br /><br />用邮件问他什么问题还是很热心而且巨快速就给你回答，人还是蛮好",
            "comment_grading": "给龟来讲我觉得马马虎虎<br />期中期末都在前列（10%）但是最后也没有A，而是A-<br />感觉教授在这方面还是挺严格的<br />不过我是两次都选择了考试，听写ESSAY的同学说龟还好，见仁见智啦，我这种ESSAY写手估计就是C了",
            "comment_workload": "每周40页左右的READING<br /><br />期中期末可以选择考试或者写文章<br /><br />没有PRE3",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}