{
    "error": false,
    "course": {
        "id": 1140,
        "subject": "SOSC",
        "code": "1420",
        "name": "Poverty",
        "description": "This course aims to make students gain familiarity with poverty issues including poverty measurement, underlying causes of poverty, the impact of poverty on society and government programs and policies that address poverty. We will illustrate principles with real-world applications. Though the course discusses poverty in a broad context of developing and developed countries, an extra emphasis will be put on poverty related issues in Hong Kong and mainland China.",
        "categories": [
            "Common Core (SA)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2130,
            2030,
            1930,
            1840,
            1810,
            1730,
            1710,
            1630,
            1530,
            1430
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.25,
        "rating_teaching": 4.23,
        "rating_grading": 4.33,
        "rating_workload": 4.15,
        "review_count": 40,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 672,
                "name": "WANG, Jin",
                "count": 39
            }
        ]
    },
    "reviews": [
        {
            "hash": "Yuwy9fhgNHKJ5bqGwWMIBbbyYfhkNzGk",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rororooo",
            "date": "Jun 03, 2017",
            "title": "Not a bad choice,if you don't mind memorisation!",
            "comment_content": "it'll will be much better if you have interest in humanities subjects such as geography, history etc cuz it requires quite A LOT OF MEMORISATION. it will also be an advantage if you have an economic background (tho the math is quite easy to catch up) <br /><br />The course talks about the poverty situation all over the world (it does not focus only in a certain region) so I find it quite interesting. <br /><br />The course teaches you:<br />- how to analyse poverty with different statistical methods. <br />- WHY are some countries wealthier and poorer than others in multiple aspects <br />- Then talks a bit about what are the solutions of poverty",
            "comment_teaching": "tbh the professor is quite boring. She is a mainland professor but her accent is quite easy to understand, she also tries to be interactive but cuz the class is in LTD most ppl ignore her.&nbsp;&nbsp;I don't skip classes but it's quite hard to concentrate as she mainly reads the powerpoint. <br /><br />However you have to go to class as she leaves blanks in the powerpoint slides! Sometimes she has pop-up attendance checking and asks you to complete a simple task or calculation and hand it to the TA. ( a part of class participation) <br /><br />The videos she chooses are quite entertaining and related to the course, you can take some time to watch them during your study (links in the ppt)",
            "comment_grading": "Not bad, it doesn't require you to be above 1 SD for everything to get A range. With most above mean i think you can get B to B+ <br />------------------------------------<br />10% Class participation <br />5% Assignment <br />25% Group Project (self group 6 people) <br />30% Midterm (non-cumulative) <br />30% Final <br />|Assignment mean: 35/40<br />Midterm: 59/75 SD:6 <br />Final 74/85 SD:8 <br />Project: 79/100|<br />Format: MC and calculation <br />------------------------------------<br />For me: <br />all components above mean. (Midterm and Final slightly below 1 SD, project around mean)&nbsp;&nbsp;<br />Total near 90% got&nbsp;&nbsp;A-range",
            "comment_workload": "The assignment is simple and there is only one quiz and final! but the most annoying part is the project, it requires your group to type 20 pages (double spacing). A poverty analysis of a country or region your group desires. The time given is not a lot and it is near the project deadlines so it's quite a lot to research. The guidelines are quite brief too. However if everyone does their part and rmb to paraphrase and make CITATION. then it will be alright. (no marking scheme or sample tho, hard to understand what the professor requires exactly)",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MRQoCjadtfGgcPKhw3i4qlOmuPyi29mp",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "aaronic92351",
            "date": "Jul 18, 2020",
            "title": "Pretty Good Course",
            "comment_content": "Contents are non-cumulative which means contents before midterm won't be examined in the final.<br /><br />Textbook is not required as exams only covered the lecture notes and videos played during lectures (so u won't be able to answer those if u missed the lesson)<br /><br />There are also data and case studies included in the lecture slides for better understanding, so it is important to understand the implications of those data.<br /><br />Topics delivered (according to lecture notes)<br />Part ONE - Who is Poor?<br />2. Defining and Measuring Poverty<br /><br />Part TWO - Consequences of Poverty<br />3. Poverty and Inequality<br />4. Dimensions of Poverty and Inequality<br />5. The Economic Lives of the Poor<br />------------------------------------------------<br />Part THREE - Different Views on the Causes of Poverty<br />7. &quot;Geography&quot; vs &quot;Cultural&quot; vs &quot;Institutional&quot; views<br /><br />Part FOUR - Fighting Poverty<br />10. Welfare Policy Design<br />11. Education<br />12. Finance: credit, saving and insurance<br />13. Health",
            "comment_teaching": "The professor is very passionate in teaching and she likes to engage students by asking questions and try to make it interactive, as well as explaining the insights from the data shown in the lecture slides.<br /><br />Although she followed the lecture slides, you still need to attend the lesson as there is in-class exercise for each lesson which will be counted towards class participation.",
            "comment_grading": "Good grading!<br /><br />10% Class Participation (only count whether submitted)<br /><br />5% Individual Assignment<br />me: 40/40&nbsp;&nbsp;&nbsp;mean: 37&nbsp;&nbsp;&nbsp;max: 40&nbsp;&nbsp;&nbsp;min: 0<br /><br />25% Group Project - Regional Poverty Analysis<br />me: 90/100&nbsp;&nbsp;&nbsp;mean: 83&nbsp;&nbsp;&nbsp;max: 92&nbsp;&nbsp;&nbsp;min: 60&nbsp;&nbsp;&nbsp;sd: 5.56<br /><br />30% Midterm Exam<br />me: 64/85&nbsp;&nbsp;&nbsp;mean: 56.3&nbsp;&nbsp;&nbsp;max: 77&nbsp;&nbsp;&nbsp;min: 27&nbsp;&nbsp;&nbsp;sd: 10.01<br /><br />30% Final Exam<br />me: 74/80&nbsp;&nbsp;&nbsp;mean: 63.9&nbsp;&nbsp;&nbsp;max: 78&nbsp;&nbsp;&nbsp;min: 0&nbsp;&nbsp;&nbsp;sd: 9.81<br /><br />Final Grade: A",
            "comment_workload": "Class Participation: just complete the in-class exercise and and submit it<br /><br />Individual Assignment: easy<br /><br />Group Project: (medium workload)<br />1. A 15-20 page essay to analyze a particular region's poverty situation.<br />2. It is better to divide the workload among the group mates beforehand so that everyone can focus on their own parts. Yet, it is important to proofread the whole passage and to make amendments so that there are linkages between different sections of the essay.<br />3. There will be a consultation session around 3 weeks before the deadline of the project. Grab the chance to ask the professor on the region chosen and ask for some advice/directions as well!<br /><br />Exams: <br />1. MC + Simple Calculations / Graph sketching<br />2. just pure memorization, not much skills needed<br />3. i started my revision 2 days before the exams.<br />4. Expect MCs are harder than Calculations.<br /><br />Overall pretty light workload.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "v6HtiTObMrEjTjCnKYrJZCbogn8kGVpx",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "LMAO",
            "date": "Aug 14, 2019",
            "title": "",
            "comment_content": "I did not get many insights from the course, just basic. But the prof shared a lot of things happening in different countries and societies.",
            "comment_teaching": "Boring, because of the personality of prof. She tried to make it interesting but her story telling skills is not that good. But you can feel that she is trying to make the course content good and willing to answer questions.",
            "comment_grading": "B+<br />Project grading criteria is not clear and no punishment on freeriders. <br />Assignment and exams questions have simple calculation and if you make any minor mistakes, that could cause you far below mean.",
            "comment_workload": "Not too much. <br />Assignment, mt, exam. As usual.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "yIZX7sxo1r9NwH5cLX1BaPhDG4rNEEof",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Churchill123",
            "date": "Feb 01, 2019",
            "title": "Very good grade, if you don't mind doing group project",
            "comment_content": "10% Class Participation: Presence in the lecture will benefit the students greatly in understanding related topics. Some lectures involve interactive game, group discussion and video session. For those activities, students will be randomly selected to share your opinion.<br />&nbsp;&nbsp;&nbsp;&nbsp;30% Two Problem Sets:<br />&nbsp;&nbsp;&nbsp;&nbsp;5% Individual assignment: Problem sets must be handed in to the canvas system by the due date/time (expected Sept 27th, week 4). Late submission will NOT be accepted.<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;25% Group project: Each group (composed of 6 people) is to submit a regional poverty analysis (week 13). The individual score will be based on the group performance and the individual contribution to the group, which is subject to peer evaluation. <br />&nbsp;&nbsp;&nbsp;&nbsp;30% Midterm Exam: in class <br />&nbsp;&nbsp;&nbsp;&nbsp;30% Final Exam: to be arranged by ARRO.<br />The exams will cover lecture notes, required readings and all materials presented in the class. The mid-term and final exam will be closed-book and mutually exclusive. The exams include multiple-choice questions and calculations.",
            "comment_teaching": "The professor's voice is loud and her accent is quite easy to understand, although she is from mainland China. She is just reading the powerpoint and it doesn't matter if you don't pay attention in the class. However, don't skip classes since she will give in-class exercises, which counts the class participation. Besides, some blank boxes in lecture slides will be revealed in the lesson.",
            "comment_grading": "Problem set: 40/40<br />Group project: 84.25/100 mean:80.1<br />midterm: 70/80 mean: 59.6<br />Final: 84.5/90 mean:70<br /><br />final grade: A",
            "comment_workload": "There is only one assignment and it is easy to finish. About the group project, you better form groups with your reliable friends.<br /><br />The final exam consists of mc questions and three calculation questions, which are quite straightforward. The calculation is easy. The first one is about simple compound interest. The second one and the third one are simply copied from the lecture slides without any changes. If you study the slides, you will definitely get the marks.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wyigW0fmtSZPQJFW2Gdkj1Szf7L79xq7",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "peanut",
            "date": "Jun 11, 2018",
            "title": "",
            "comment_content": "easily understandable content<br />- defining and measuring poverty<br />- poverty and inequality<br />- dimensions of poverty and inequality<br />- the economic lives of the poor<br />- causes of poverty<br />- fighting poverty (solution)<br />textbook is not required for this course.&nbsp;&nbsp;you just simply need to memorise all the lecture notes and you can go for exams and assignment<br /><br />class participation 10%<br />assignment 5%<br />group project 25%<br />mid-term 30%<br />final exam 30%",
            "comment_teaching": "professor is nice and interactive.&nbsp;&nbsp;she often ask students answer her questions.<br />she will also have some in-class exercise for counting class participation points<br />she is not super good in speaking english, but you can feel that she is passionate in teaching the topics",
            "comment_grading": "very good grading!!!!!!!!<br /><br />the following is my performance in this course<br />assignment: 40/40 (mean: 37)<br />midterm: 72.5/75 (mean: 60.4)<br />group project: 79.77/100 (mean: 79.8)<br />final exam: 62/100 (mean:68)<br />class participation: unknown<br /><br />final grade: B+",
            "comment_workload": "light workload<br />assignment <br />- super easy<br />- draw Lorenz curve<br />- mc questions <br />- simple calculations with your own steps<br />midterm <br />- easy as well<br />- includes mc questions <br />- simple calculations with your own steps<br />- cover 9 powerpoint, but with short and easy content<br />final exam<br />- a bit difficult when compared with the midterm<br />- includes mc questions <br />- simple calculation with your own steps<br />- cover 8 powerpoint, but longer content<br />group project<br />- requires a 15-20 page report<br />- choose a country as your project topic and do research on its poverty situation<br />- presentation is NOT required<br />- you can form your own groups<br />so you can actually find some friends to join the course together and form groups for that",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "f4cjIDDezr6mGJVnUVa10LpYaUeGmQtT",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wtever",
            "date": "Jun 01, 2017",
            "title": "考勤力嘅course",
            "comment_content": "係通識, stat, geog都有涉獵嘅course <br />學嘅內容幾闊 包括poverty嘅causes, calculation, impacts, solutions 但唔算好難 <br />就算上堂miss咗 自己睇番notes都會明",
            "comment_teaching": "幾好人 做project之前會有consultation 佢會俾意見你點做份project大陸professor英文嚟講算係幾好 聽得明<br />教書係跟lecture notes讀<br />上堂會播下有關嘅videos<br />lectures notes 有blanks要填<br />冇compulsory attendance 好多人走堂 不過佢會突然間有class activities 姐係其實都係計participation",
            "comment_grading": "1. 10% Class Participation<br />Presence in the lecture will benefit the students greatly in understanding related topics. Some lectures involve interactive game, group discussion and video session. For those activities, students will be randomly selected to share your opinion. <br /><br />2. 30% Two Problem Sets:<br />5% Individual assignment<br />25% Group project: Each group (composed of 6 people) is to submit a regional poverty analysis. The individual score will be based on the group performance and the individual contribution to the group, which is subject to peer evaluation. <br /><br />3. 30% Midterm Exam <br /><br />4. 30% Final Exam<br />The exams will cover lecture notes, required readings and all materials presented in the class. The mid-term and final exam will be closed-book and mutually exclusive. The exams include<br />multiple-choice questions and calculations. <br />---------------------------------------------------------------------------<br />自己overall B+, assignment 40/40 mean 35.2, midterm 64.5/75 mean 59.2 highest 72.5, group project 78.4/100 mean 79 highest 90, final exam 83/85 mean 74.3 highest 85",
            "comment_workload": "workload 唔多 睇晒啲lecture notes基本上巳經足夠 reading materials for final exam 冇考過",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0ZtY4yxKmrVBU8fPjSMJck26HPaQKaep",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Angez",
            "date": "May 31, 2023",
            "title": "背多分，背背佳",
            "comment_content": "This course aims to make students gain familiarity with poverty issues including poverty measurement, underlying causes of poverty, the impact of poverty on society and government programs and policies that address poverty. We will illustrate principles with real-world applications. Though the course discusses poverty in a broad context of developing and developed countries, an extra emphasis will be put on poverty related issues in Hong Kong and mainland China.",
            "comment_teaching": "Professor Wang is passionate, and she is a good teacher. <br />The lecture notes for her entire course are very logical, interconnected, and well-organized. Reading these PPTs will give you a feeling of enlightenment and mental clarity. All course content is cleverly linked together. <br />I must say that the course design for SOSC1420 is excellent. You always know what you are doing, what you need to do next, and why you are doing it.<br /><br />Attendance in class is taken by randomly asking questions during class and requiring students to write their answers on paper and submit them. Students need to bring their own pen and paper, and as long as they submit their answers, they will be marked as present, regardless of whether the answers are correct or not.",
            "comment_grading": "Class Participation — 10%<br />Individual Assignment — 5%<br />Group Project — 25%<br />Midterm Exam— 30%<br />Final Exam — 30%<br /><br />Mine:<br />Class Participation: Full<br />Individual Assignment: 39/40<br />Group Project: 19.46/25; Mean: 20.1 Median: 21.2 SD: 1.5<br />Midterm Exam: 72.5/75; Mean: 55 Median: 56 SD: 11<br />Final Exam: 82.5/85; Mean: 62 Median: 64.5 SD: 12.9<br /><br />Grade: A+<br /><br />If you can achieve a good grade in SOSC1780, then you can most likely obtain a satisfactory grade in this course as well. Although they are different in many ways, the study methods for these two courses are similar.",
            "comment_workload": "The workload is very small. <br />The group project is writing a report, which can be completed quickly. <br />The assignment is only one and is a very simple problem set with almost no differentiation in the score. <br />The midterm and final exams are very similar in format, consisting of multiple-choice questions and calculations, and are both very easy. You only need to spend 1 to 3 days before the exam to memorize the PPT to get a full score (I am not joking, as long as you can recite the content on the PPT, you can almost get a full score on the exam).",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "IUzuhjp4p4gYQW9GaHfzTp8ExVDg1WR2",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "zn",
            "date": "Jan 25, 2022",
            "title": "nice cc",
            "comment_content": "easy content, lecture notes have blanks that you might need to attend lecture to get the answers. she occasionally stops recording when students answer the question so you may not get the answer when you watch the recording after class.<br /><br />project just find your friends and choose easy but interesting places to work on, read more research paper and you can get insights to reference to your project",
            "comment_teaching": "prof is very nice but you may find her lecture a little boring, since the content is too simple and straightforward.<br />she tries to incorporate interesting videos in class, that u must need to watch because it could be included in final exam",
            "comment_grading": "very good. i did barely anything and got an A",
            "comment_workload": "very light, just attend lectures and finish the easy assignments in class, talk to prof sometimes and she might remember you<br />only quite a few assignments which are crazily easy lol",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eVAZVkXpkvTDFaTOTuq4rbLqKfQV07sd",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "PyothePro",
            "date": "Aug 29, 2021",
            "title": "A great GPA Booster",
            "comment_content": "The course mainly taught the students the definition of poverty by different standards, the reason for poverty, and possible solutions for it. <br /><br />All in all, the course covers pretty useful information that will help us understand the concept of poverty better. The only drawback would be that the content is very superficial, as it covers broad information yet being a common core subject.",
            "comment_teaching": "Ms.Wang was a pretty nice professor. She sincerely to enjoy making the students aware of the economical inequality around the world(especially Hong Kong). She enjoys student-professor interaction. Whenever students have a question, she wouldn't hesitate to answer our questions during class so that no student would feel left out.",
            "comment_grading": "I got +1.2 sd on the mid-term, +1.5sd on the final, 100 percent on minor assignments and a c+ for the group project.<br />I ended up with an A. (If I had put on some actual effort into the project, I would've gotten an easy A+. Dumb Freshman me :( )<br /> (Everyone in the group was pretty lazy imo, including myself.)<br />Other than having to write a short essay, the tests are relatively easy. The test shows very accurately if you have studied the course enough.<br /><br />Like it or not, you'll have to not just understand, but MEMORIZE many concepts that are on the slideshows. Just be ready to memorize some calculation formulas.",
            "comment_workload": "As I mentioned before, the mid-term and final exams are actually quite easy. Just listen to her lectures in class and review it for 3 days before the exam. Bam. You'll get an A- at least. For the group project, don't get lazy like I did, and I'm pretty sure you'll get an A on the project as well.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "R2cmULNtyeHgGjN0ekq9SCf16lFtUTKv",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "The_Unknown",
            "date": "Jun 07, 2021",
            "title": "Easy grades",
            "comment_content": "Contents are rather easy and understandable. Frankly speaking, exam MCQs are mostly based on lecture so you should be fine if you regularly attend lectures.<br /><br />Main topics include-<br />1. Introduction<br />2. Defining and Measuring Poverty <br />3. Poverty and Inequality<br />4. Dimensions of Poverty and Inequality<br />5. The Economic Lives of the Poor&nbsp;&nbsp;<br />6. The Causes of Poverty&nbsp;&nbsp;<br />7. Fighting Poverty -Welfare Policy, Education, Finance",
            "comment_teaching": "Professor Wang has an interaction based teaching. So, the value of teaching depends on how high the classroom participation is. My classmates were very interactive so it was pretty fun and I could understand most of lecture content even without going through the slides while revising before exam.",
            "comment_grading": "The assessments of the course consist of the following parts-<br /> Class Participation — 15%<br /> Individual Assignments — 20%<br /> Group Project — 30%<br /> Final Exam — 35%<br /><br />As long as you attend classes well, it should be easy to get good grades. <br />Also, it would be best to check calculation related problems before exam because knowing appropriate formulas can give you full marks on calculation easily. A reason is that there are only about 4-5 possible calculation questions throughout course and they will definitely appear in exam for 30 marks or more.<br /><br />Problem Set One - Mean: 36.48/40 My score: 39/40<br />Problem Set One - Mean: 29.17/35 My score: 35/35<br />Project Individual Grade - Mean: 82.02/100 My score: 94/100<br />Final Exam Total - Mean: 67.33/100 My score: 90/100<br /><br />Final Grade- A+",
            "comment_workload": "If you have good team members, there should not be much workload in the course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xGvN6UwuOPNSm7KomoqiuxbuRSa1ZbZk",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ferfer",
            "date": "Sep 02, 2020",
            "title": "靚grade course",
            "comment_content": "Defining and Measuring Poverty<br />Poverty and Inequality<br />Inequality and Social Exclusion<br />The Economic Lives of the Poor<br />Causes of Poverty<br />Causes of Poverty (Cont’d)<br />Fighting Poverty I: Welfare Policy Design<br />Fighting Poverty II: Education<br />Mandatory Meetings on the Group Project<br />Fighting Poverty II: Education (Cont’d)<br />Fighting Poverty III: Health Intervention<br />Fighting Poverty IV: Credit and Financial Institutions",
            "comment_teaching": "除咗講英文有d口音之外，其他都okay<br />多in-class assignments, total 7 份, 但全部唔計分，交就得<br />會需要同學積極答問題，parti 分會高d",
            "comment_grading": "grading is fair<br />30%mid-term: 51/85 (mean: 56.5, below 0.5 sd)<br />30%final: 64/80 (mean: 63.9)<br />5%assignment: 40/40 (mean: 37)<br />25%project: 90/100 (mean:83)<br />10%participation: unknown<br />final grade: B",
            "comment_workload": "好低workload <br />得2 assignments<br />-5% assignment 超易做 輕鬆滿分 <br />-25% project 有好隊友 個個做野就輕鬆搞掂 <br />mid-term, final are mutually exclusive<br />只要有上堂，考前睇下就有mean <br />但個mean 都幾高, 要 a range&nbsp;&nbsp;就要再努力d",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "vi9Q3hHnYqU2bMjfWiueRIFKm9zOjTtt",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mirandawudd",
            "date": "Aug 22, 2019",
            "title": "",
            "comment_content": "Content is quite easy<br />10% Class Participation: Presence in the lecture will benefit the students greatly in understanding related topics. Some lectures involve an interactive game, group discussion and video session. For those activities, students will be randomly selected to share your opinion.<br />2. 30% Two Problem Sets:<br /> 5% Individual assignment: Problem sets must be handed in to the canvas system by the due<br />date/time (expected June 27th). Late submission will NOT be accepted.<br /> 25% Group project<br />3. 30% Midterm Exam<br />4. 30% Final Exam<br /><br />Part One: Who is poor?<br />2. Defining and Measuring Poverty<br />An overview of the poverty definition, official poverty measure and critiques<br />Alcock, Chapter 5, 6; Banerjee Chapter 1; Sen, Chapter 4<br />Case study: measuring world poverty/Hong Kong’s poverty/mainland China’s poverty<br />Part Two: Consequences of Poverty<br />3-4. Inequality and Social Exclusion<br />1) Inequality: Lorenze Curve (Gini Coefficient)<br />Alcock, Chapter 6, 8; Banerjee, Chapter 4<br />Case study: inequality and Gini coefficient in Hong Kong and mainland China<br />2) Dimensions of Inequality and Social Exclusion<br />a. Gender Discrimination, fertility and Poverty: Sen, Chapter 8; Banerjee, Chapter 9, 10; Alcock, Chapter 9 b. Ethnicity and Poverty: Banerjee, Chapter 12; Alcock, Chapter 10<br />c. Age and Poverty: Banerjee, Chapter 16; Alcock, Chapter 11<br />5. The Economic Lives of the Poor<br />Banerjee, Abhijit, and Esther Duflo (2007), &quot;The Economic Lives of the Poor.&quot; The Journal of Economic Perspectives 21, no. 1: 141-167.<br />Case study: The Economic Lives of Hong Kong’s poor<br />Part Three: Different Views on the Causes of Poverty<br />6-7. The “Cultural” vs. the “Institutional” view; The “Pathological” vs. the “Structural” View Alcock, Chapter 3; Banerjee, Chapter 2, 3<br />Case study: the causes of poverty in Hong Kong<br />Part Four: Fighting Poverty<br />8. Welfare Policy Design<br />Alcock, Chapter 14-17; Banerjee, Chapter 13, 14<br />9-10. Education and Health Intervention<br />1) Education and human capital accumulation: Banerjee, Chapter 18 2) Vaccines and Eradication of disease: Banerjee, Chapter 21<br />3) Infrastructure<br />11-12. Credit and Financial Institutions<br />To provide the poor with access to credit and get out of poverty: Banerjee, Chapter 23 Case study: micro-finance in India<br />13. Summary and Future Directions",
            "comment_teaching": "The professor is very nice and she explained the content very clearly",
            "comment_grading": "Good grading <br />problem set 33.5/40 <br />group project 82/100<br />final 82.5/95<br />midterm 72.5/80<br />grade A-",
            "comment_workload": "only 1 problem set + 1 project",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "MDWocZYggFiFDqjTMPBbPQllq4ndbaZ3",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hieu",
            "date": "Aug 22, 2019",
            "title": "",
            "comment_content": "Mid term:<br />Introduction<br />Defining and measuring poverty <br />Poverty and inequality<br />Dimensions of Poverty and Inequality <br />The economics lives of the poor <br /><br />Final:<br />The causes of poverty <br />Fighting poverty: Welfare policy<br />Fighting poverty: Education<br />Fighting poverty: Finance<br />Fighting poverty: Infrastructure<br />Summary",
            "comment_teaching": "The professor's voice is loud and her accent is quite easy to understand, although she is from mainland China. She is just reading the powerpoint and it doesn't matter if you don't pay attention in the class. However, don't skip classes since she will give in-class exercises, which counts the class participation. Besides, some blank boxes in lecture slides will be revealed in the lesson.",
            "comment_grading": "Midterm Statistics: Mean:&nbsp;&nbsp;62.98/80, SD = 10<br />Final Statistics: Mean = 71.27 out of 95, SD = 14.88",
            "comment_workload": "not too much. just need to focus on Lecture note",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "78VXMkpaICgq7iHBfilHKpzhdFQUeXwx",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Jacky 01",
            "date": "Aug 12, 2019",
            "title": "Good course",
            "comment_content": "It is about the cause of poverty, such as the effect of colonialism, climate and institution. It also introduce the policy to tackle poverty. The contents are not very difficult to understand.",
            "comment_teaching": "The teacher will explain the topic in detail, it is easy to understand. Also she will sometimes ask student questions. I recommend you to attend the lesson to fully understand the topic. Once you understand the relationship, you don't need to remember a lot for the exam.",
            "comment_grading": "Good grading.<br />10% participation <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-5% for peer evaluation of group project<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-5% for classwork<br />30% two problem set<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-5% for individual assignment<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-25% for group project<br />30% mid-term exam<br />30% final exam<br />My mark: <br />mid-term exam&nbsp;&nbsp;70/80&nbsp;&nbsp;mean 62.98/80<br />Final exam 85/95&nbsp;&nbsp;mean 71.27<br />Group Project 81/100&nbsp;&nbsp;mean 80.01/100<br />Individual assignment 40/40<br />Final grade: A-<br />The mid-term and final exam consist of mc questions and calculation. The calculation part is mainly from the power point, so remember to do all the calculation questions in the power points. It is easy questions such as compound interest , Gini coefficient and taxes. The mc question is tricky, you need to carefully read the questions. Also, remember not to freeride for the project. The peer evaluation will affect your project score. Not everybody get the same project score in the same group.",
            "comment_workload": "Light workload. Only one individual assignment and group project.<br />The group project is 15-20 pages, form group of 5 or 6. The topic is about poverty of a place. You can choose any places as you want. But if you want to choose Hong Kong, the you need to choose district. Our group choose Kwun Tong. No need to do presentation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "leTDaoc5HcYh7cOaX4NzoGhVcH7R7SUG",
            "semester": "2018-19 Summer",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chrischrisyiu",
            "date": "Aug 02, 2019",
            "title": "",
            "comment_content": "Mid term:<br />Introduction<br />Defining and measuring poverty <br />Poverty and inequality<br />Dimensions of Poverty and Inequality <br />The economics lives of the poor <br /><br />Final:<br />The causes of poverty <br />Fighting poverty: Welfare policy<br />Fighting poverty: Education<br />Fighting poverty: Finance<br />Fighting poverty: Infrastructure<br />Summary",
            "comment_teaching": "Fluent English <br /><br />include in class exercises which will be tested in the mid term and exam <br /><br />would pick students to answer questions",
            "comment_grading": "Midterm Statistics: Mean:&nbsp;&nbsp;62.98/80, SD = 10<br />Final Statistics: Mean = 71.27 out of 95, SD = 14.88",
            "comment_workload": "10% Class Participation<br />5% Individual assignment<br />25% Group project<br />30% Midterm Exam<br />30% Final Exam<br /><br />mid term and final include calculation and plotting graph and 2x MC questions",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UFQQst8zyw2nYyzDviF37OuS2RP4GhJb",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sumkt",
            "date": "Jan 24, 2019",
            "title": "比心機上堂 肯背就OK",
            "comment_content": "Poverty measurement<br />Causes of poverty<br />Impact of poverty on society<br />Government programs and policies that address poverty",
            "comment_teaching": "口音易明<br />鍾意問問題<br />講解都幾詳細",
            "comment_grading": "10% Class Participation<br />30% 2 Assignments<br />- individual assignment : 5% <br />- group project : 25% (poverty analysis report)<br />30% mid term exam<br />30% final exam<br /><br />Grading都唔差",
            "comment_workload": "workload都幾細<br />上堂唔聽其實都OK 但會有in-class questions<br />readings係可以唔洗睇既 唔重要 都唔會考<br />唯一多D野係既都只係份report 但6個人一組其實都好快搞掂 仲有guide跟住做",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ntmozIfqrJ6NZS3vDXDfGieWgBLLkiLO",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Quito",
            "date": "Jan 19, 2019",
            "title": "",
            "comment_content": "This lesson contains very little knowledge, most of which are based on data. Content distribution is relatively uniform, many countries have been mentioned, it is worth noting that curriculum knowledge includes national comparison, which is very important.",
            "comment_teaching": "Proceed in an orderly way and step by step. Data, videos and graphs are provided for students to understand the content easily.",
            "comment_grading": "Scores are based on several different disciplines such as, mid-term, homework, team project, in-class performance and final exam. Hence, in order to get a high score, hard working through the whole term is required",
            "comment_workload": "low workload but need to pay attention to the essay",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ikowJ3thnUvfTi2PsSmBQ52INUBvNdtW",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "pak pak",
            "date": "Jan 19, 2019",
            "title": "輕鬆sosc course",
            "comment_content": "偏common sense 嘅嘢<br />牽涉少少簡單計數<br /><br />內容就根本講下 <br />definition of poverty<br />measurements of poverty(indicators)<br />reasons and solutions <br />易明&nbsp;&nbsp;&nbsp;唔好預學到好多野",
            "comment_teaching": "教poverty教咗幾耐<br />有心備課 教書<br />份人都nice <br />鍾意同學生互動(點人答問題)",
            "comment_grading": "10% Class Participation<br />30% 2 Assignments<br />- individual assignment : 5% <br />- group project : 25% (poverty analysis report)<br />- 30% mid term exam<br />- 30% final exam<br /><br />high mean scores of assignment, MT and final <br />but generally I think grading is fair<br />All above mean&nbsp;&nbsp;&nbsp;&nbsp;<br />A",
            "comment_workload": "workload 偏細<br />堂可上可唔上&nbsp;&nbsp;上會易明d<br />基本上reading 可以skip<br />係份final report 要多d時間準備&nbsp;&nbsp;不過都會guide 住做<br />問題唔大",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "D2H1UmWtV7BIkUrIweVOQIH477sl2mHm",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yaaaaa",
            "date": "Jan 15, 2019",
            "title": "",
            "comment_content": "Poverty measurement, causes of poverty, impact of poverty on society, government programs and policies that address poverty <br /><br />Rich and interesting content, quite simple too<br />Requires some memorisation",
            "comment_teaching": "Reads off slides but some elaboration <br />Accent quite understandable<br />Tries to make class interactive <br />Some in-class exercises that count toward class participation <br />Some blank boxes in lecture slides that will be revealed in lectures",
            "comment_grading": "10% Class Participation<br /><br />30% Two Problem Sets:<br />- 5% Individual assignment - problem set<br />- 25% Group project - regional poverty analysis in groups of 5/6<br /><br />30% Midterm Exam<br /><br />30% Final Exam",
            "comment_workload": "Light workload, just have to keep up with lecture content <br />Groups for the project are formed by students, so it is better if you take this course with reliable friends",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Wza2Q7aH0SKtTJoWJICadmY1YckY2b5D",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Joooooo",
            "date": "Jan 13, 2019",
            "title": "",
            "comment_content": "leading you throughout the whole process to understand what poverty is, how to calculate (measure) poverty, and policies in varies countries on tackling poverty in different aspect (e.g. educational, institutional, econ, etc.) <br />The content is rich and interesting.",
            "comment_teaching": "She is very passionate about teaching, she likes to interact with students in class a lot. but don't worry if you can't answer her qs, she will guide you through.",
            "comment_grading": "good grading.<br />midterm and exam are easy as long as you study her ppt and know all the calculations (not difficult at all); there are some historical backgrounds that may need some memorization tho(you will be fine if you follow the lecture ppt to study). However, be aware that the mean will be quite high coz the midterm and final paper are quite easy, plz study before that.<br />Some in-class exercises (attendance taking) will be done randomly, which also helped you to understand better the content, so I will suggest you to fully participate in all the lectures.",
            "comment_workload": "very reasonable. only one individual assignment throughout the whole semester and one group project in which not much time is needed when your groupmates do their parts.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WH8MQwWRhtRiDm4YPYzE417XvnD0EzEf",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "cheeeeeeeeee",
            "date": "Dec 21, 2018",
            "title": "",
            "comment_content": "1. introduction<br />2. defining and meauring poverty<br />3. ineaulity<br />4. dimensions of poverty, inequality<br />5. economic lives of the poor<br />7. causes of poverty<br />8. case study<br />9. fighting poverty<br /><br />Contents were pretty easy, everything could be understood at a glance. <br />Right at that common core level <br /><br />Some memorization, but never hard, and actually enough with just understanding what is going around because she is never too specific with the contents.",
            "comment_teaching": "Her teaching is okay, <br />She basically reads off the slides, but keeps things to the point. <br /><br />I was pretty satisfied with her teaching anyways.",
            "comment_grading": "10% Class Participation<br />30% 2 Assignments<br /> - individual assignment : 5% <br /> - group project : 25% (poverty analysis report)<br />- 30% mid term exam<br />- 30% final exam<br /><br />As the content is easy, the questions for midterm and finals are also very easy, which makes lots of high-scoring people. <br />But as long as you know all the contents and be careful in the exam,&nbsp;&nbsp;you can score well.",
            "comment_workload": "Not really heavy. <br />Individual assignment can be done really quickly.<br />For group project, better if you get supportive groupmates. <br /><br />But reviewing for the content does not really take long, so you can focus more on your major subjects! :D",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OzigPU3GRN46BaQ50mzzl4Zed390Bm6C",
            "semester": "2017-18 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Anson Lam",
            "date": "Sep 13, 2018",
            "title": "",
            "comment_content": "主要講下貧窮既成因<br />政府應付貧窮既方法<br />量度貧窮既唔同方法<br />都係比較簡單既common sense<br />Project 就係自已選個地區,分析該區貧窮既成因,已有應付貧窮既方法,同自已既建議",
            "comment_teaching": "好好人,上堂成日笑<br />間唔中會睇下片<br />教既野唔算深,<br />考試亦簡單,<br />MC加簡單既long question. <br />不過條mean都高",
            "comment_grading": "mid term 唔記得<br />考試接近滿分<br />project 普通分<br />A-",
            "comment_workload": "唔算重,上堂有少少class work,唔難既<br />有project,但唔駛present<br />mid term<br />Exam",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "I0KuAZjEgzu2wQrSbhykbAgE4UbtomZp",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "messixo",
            "date": "Jun 15, 2018",
            "title": "leng grade :)",
            "comment_content": "Very simple stuff about poverty and causes.<br />Some even covered by economics in HKDSE before e.g. GDP<br />On the second half of the course it is a bit like history, studying some huge incidents around the world eg the split of North Korea and South Korea",
            "comment_teaching": "Her teaching is quite good and it is quite interesting. As a business student, I never imagined this common core course would be the best course I have taken this semester in terms of teaching.<br />Some say her English is not that good but I think that is fine.",
            "comment_grading": "Made a huge careless mistake on the finals while I still got A-. The curve should be really high as both midterms and finals only include MC questions and calculations. The questions are as simple as the worksheets in secondary schools",
            "comment_workload": "one major part of taking this course: registering this course together with your reliable friends<br />As the group is formed by students themselves, it is better to reg with friends and work on the project. <br />The project is about a poverty analysis on one specific country. Not much collaborations are required as it is only about figuring out the country we would like to work on and job allocation lol. (given that you trust your groupmates, meetings are not even required)",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gMnFJ3OD4zbpcmrak5RC4JhW3hYzSmtG",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rubbishstudent",
            "date": "Jun 07, 2018",
            "title": "interesting but a lot of memorization",
            "comment_content": "Other reviews have already covered the topics taught. <br />Prof like to use a lot of stat (number and correlation) to justify that her reasonings are correct <br />you do not need to memorize the exact number for the data <br />but in exams you will be asked for xx is higher/lower than yy <br />A lot of memorization needed",
            "comment_teaching": "Prof is so nice and she always smile <br />The teaching is clear but it is ok if you just read the notes yourself <br />there will be blank boxes in the notes and the answer will only be revealed in class",
            "comment_grading": "Midterm(30%) mean: 60/75 MC+calculation <br />Final (30%) mean:68/85 MC+calculation <br />Group Project (25%) mean:80/100 report on poverty situation of a country/region that you pick<br />Individual Assignment (5%): 37/40 easy MC and calculation <br />Participation(10%) not revealed, but there is in class activity in which you will be asked to answer short questions and hand in the paper <br /><br />My mark:<br />Midterm 72.5 <br />Final: 82.5 <br />Group Project: 90 <br />Individual assignment: 38 <br />Participation: attend all lesson <br />A+ at the end",
            "comment_workload": "Nothing to do throughout the semester except for the group project which cost you around 1 month to finish it <br />but you can pick your own group mates and there is guideline for the project",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "c4wLHMvQnHTjSgOdJPas26Cu3f9unm3X",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kaykay",
            "date": "Jan 27, 2018",
            "title": "quite interesting",
            "comment_content": "1. Why study poverty? A bird view of the course<br />2. Defining and Measuring Poverty<br />3-4. Inequality and Social Exclusion<br />1) Inequality: Lorenze Curve (Gini Coefficient)<br />2) Dimensions of Inequality and Social Exclusion<br />5. The Economic Lives of the Poor<br /><br />Part Three Different Views on the Causes of Poverty 6-7. The “Cultural” vs. the “Institutional” view<br />The “Pathological” vs. the “Structural” View<br />Part Four Fighting Poverty<br />8. Welfare Policy Design<br />9-10. Aid and Public Infrastructure Support<br />11-12. Credit and Financial Institutions<br /><br />As suggested by the topics, some economic concepts like Gini coefficient are involved, and some very simple calculations are needed in exam.<br /><br />But overall the course is interesting for people who are concerned about global and HK poverty issue.",
            "comment_teaching": "Dr. Wang is really nice and very passionate about teaching. She tried her best to interact with students and assigned simple group work in lecture.",
            "comment_grading": "10%class participation <br />5% individual assignment <br />25% group project <br />30% midterm<br />30% final <br />______________________<br />FOR ME:<br />10/10 participation<br />4.x/5 individual assignment <br />67/75 midterm (mean59, s.d.11.x)<br />75/85 final <br />76.X/100 project (mean 82.3)<br />and finally got A-<br />the grading is good for me",
            "comment_workload": "workload is ok.<br />the assignment is easy, I spent an hour on it.<br />HOWEVER you have to spend more time on the project which accounts for 25%.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jP12JWzNiIVxMtrwjIagESHcPavxH2O2",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "tttttssy",
            "date": "Jan 20, 2018",
            "title": "",
            "comment_content": "The content includes quite a lot of items, e.g. the reasons, impacts and the solutions of poverty and that examples from a lot of countries will be given to support the views.<br /><br />The content taught before the mid term is each easier.",
            "comment_teaching": "The professor simply read from the ppt. (btw the content of the ppt is quite easy to understand) But she would ask some questions during the class to maintain interaction and would play some videos to make the lessons funnier.<br /><br />She is very nice that she would answer your questions after class patiently and that she would ask question to create interaction in classes.",
            "comment_grading": "The grading is quite good and that group project does matter.<br /><br />To get a good grade in this course, all you have to do is to recite everything on the ppt. and perform well in the group project.",
            "comment_workload": "The workload is really light as you don't have to read the required reading at all as they won't be tested. The professor has given us enough time for the group project so the workload would not be so heavy and you don't have to rush at all.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eavf46tdQuVkvMl3aey9ywwuobLUKTsf",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Oscar Wong",
            "date": "Jan 16, 2018",
            "title": "",
            "comment_content": "Content is easy.&nbsp;&nbsp;Although I am just a year 1, the content is not difficult at all.&nbsp;&nbsp;Just some basic graphs, analyzing the trends of the poverty situation of some countries and some measures to fight poverty.&nbsp;&nbsp;You are required to remember some facts about the poverty situation.&nbsp;&nbsp;However mid term and final will not ask those facts in a very detailed way.&nbsp;&nbsp;Maybe 1 or 2 MC questions asking those facts.&nbsp;&nbsp;No worry if you did not study that part!!!!!!",
            "comment_teaching": "Professor Wang tried to create a more interesting teaching atmosphere.&nbsp;&nbsp;She requires us to have some kind of discussions with our group members during class.&nbsp;&nbsp;However, due to the content of this course, it is very difficult to have an interesting learning atmosphere.&nbsp;&nbsp;She explained the graphs and trends clearly in class.&nbsp;&nbsp;Overall acceptable teaching.",
            "comment_grading": "Super simple homework 5%<br />Mid term 30%<br />Project 25%<br />Final 30%<br />Class participation 10%<br />I got higher than above 1 sd in mid term, final and full mark in that super easy homework.&nbsp;&nbsp;However my project below mean 2 sd.&nbsp;&nbsp;Final grade is B+.&nbsp;&nbsp;So it is actually quite good.&nbsp;&nbsp;Just try your best to find some reliable group members than you will be fine.&nbsp;&nbsp;The mid term and final are also easy.&nbsp;&nbsp;Just some calculations and MC.&nbsp;&nbsp;Not much revision is required.",
            "comment_workload": "A super simple homework, no reading materials.&nbsp;&nbsp;Also have a project studying the poverty situation about a region or a country.&nbsp;&nbsp;The project is maximum 20 pages.&nbsp;&nbsp;No presentation afterwards is required.&nbsp;&nbsp;I think the workload is fine.&nbsp;&nbsp;Just try your best to find some responsible group mates.&nbsp;&nbsp;Recommend you all to register this course together with some friends so that you can form groups easier and be sure about the quality of your group members.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "pN5tzwivBx9Z4AiFVba1p5KQY5BqG5vD",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "eatingfreak",
            "date": "Jan 11, 2018",
            "title": "Good course!",
            "comment_content": "Defining and Measuring Poverty<br />Poverty and Inequality<br />Dimensions of Poverty and Inequality<br />The Economics Lives of the Poor<br />The Causes of Poverty<br />Fighting Poverty I Welfare Policy<br />Fighting Poverty II Education<br />Fighting Poverty III FInance<br /><br />The topics would be easier to be handled for students who are from humanities or business. As a science student, sometimes it is interesting yet sometimes it is difficult to understand and have to try a bit harder to catch up.",
            "comment_teaching": "The professor is active and knows very well on how to draw your attention. She encourages students to think more than telling us the facts from the slides. Sometimes there are only some questions on the slide so we have to think and then answer them on our own. Although she might not know every student, she tried her best to get to know you so her lessons were quite fun.",
            "comment_grading": "There are many international students and higher year students in the class so it might be difficult for students to score high. The MCs in the mid-term and final are not difficult but you really have to work hard to get high marks for a good grade. I heard someone score full marks in the mid-term",
            "comment_workload": "There are two problem sets, a mid-term, a final and a group project. Not quite heavy, the problem sets and tests were okay but the project did cause some challenges.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wb345I70mFPiPfz6vd8xt30g75fA8AeZ",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kiddo",
            "date": "Jan 09, 2018",
            "title": "Fun Course",
            "comment_content": "Content is fun, you don't get bored in class, although a lot of it are knowledge you already know, but once in a while lectures do surprise you.",
            "comment_teaching": "The professor is enthusiastic and knowledgeable, knows how to attract your attention and teach.",
            "comment_grading": "A lot of exchange students and senior year students took this course in the semester, so wasn't exactly easy to get good grades.",
            "comment_workload": "One mid-term, one final, one assignment, and one project. Quite easy, exams are MC and short questions, just chillin there.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "g6hb1ennDfFuYR3CVKpDilNltItuOpV2",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "JJJJJJJ",
            "date": "Jan 09, 2018",
            "title": "尚可",
            "comment_content": "內容都幾多, 而且範圍都幾大, 如果本身有睇開港台時事節目, 應該覺得內容係幾有趣. lecture notes都有條理, 走左堂睇返都會明, 但裡面有D內容係上堂先講, 所以都要問返人.",
            "comment_teaching": "上堂似討論多過教書, 無咁悶又易有記憶d. 至少唔太係照讀. 問佢問題都答得詳細.",
            "comment_grading": "10% class participation<br />5% individual assignment<br />25% group project<br />30% mid-term<br />30% final exam<br /><br />有peer evaluation.<br /><br />想要好grade就真係要比D力, 因為無論assignment定mid-term個mean都幾高. assignment差唔多個個都滿分. <br />好處係mid-term 同final都係mc同calculation. final 唔會考返mid-term既野, 相對比較輕鬆, 不過容易既反而仲難好grade. 想好grade真係一分都不能少.<br />Class participation唔係堂堂有, random, 唔會知幾時有. 不過都係計下數或者寫少少野.",
            "comment_workload": "assignment就得一份, 唔難做, 都係mc計下數.<br />group project都相對輕鬆, 因為最多可6人一組, report 20頁左右. 又唔洗presentation. <br />由於final 唔會考返mid-term d 野, 唔洗一次過記咁多野相對輕鬆d.<br />看似好多野做, 但唔難, 用既時間唔係話要好多.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "86ZSu8ZRvo40is3hgdVj3qWHOXlqC2a6",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bonobono",
            "date": "Jan 01, 2018",
            "title": "highly recommend",
            "comment_content": "- very straight forward<br />- common sense<br />- simple",
            "comment_teaching": "She's knowledgeable and passionate but from time to time, it might get boring since the contents are not so complex.",
            "comment_grading": "fair<br />- one homework submitted through canvas which takes around 15-20 minutes <br />- group project, research paper (6 people in a group), you can choose the group mates (no presentation)<br />- midterm (multiple choice and calculation) <br />- final (multiple choice and calculation)",
            "comment_workload": "one group project that is acceptable unless you have a free rider, but there is peer evaluation.<br /><br />in preparation for midterm and final, only need to read ppt, no need to memorise word by word since the questions are multiple choice.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ol9XTiT8T3St9nG9uOsGYe9XkjlHMnWj",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "2535",
            "date": "Dec 30, 2017",
            "title": "Quite good grade course",
            "comment_content": "Very boring course as the content is really simple<br />There is reading material but it is not necessary to read them<br /><br />This course aims to make students gain familiarity with poverty issues including poverty measurement, underlying causes of poverty, the impact of poverty on society and government programs and policies that address poverty. We will illustrate principles with real-world applications. Though the course discusses poverty in a broad context of developing and developed countries, an extra emphasis will be put on poverty related issues in Hong Kong and mainland China.",
            "comment_teaching": "Just read out the content on the slides<br />Boring and often starts late and ends early",
            "comment_grading": "Quite good<br /><br />10% Class participation (Evaluation of group project + attendance of lectures)<br />The lecturer has chosen 4 lectures to ask students to write their opinion about some simple questions in order to take attendance.<br />5% Assignment<br />25% Group Project<br />30% Midterm<br />30% Final<br /><br />Overall about 90% --&gt; A<br />Assignment, midterm and final slightly lower than 1 sd above mean<br />Project = mean",
            "comment_workload": "Low for midterm and final exam<br /><br />But it takes about a week to finish the 20 page project",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "BhDn4x1mMLicsV8bkgYGOrBgaoAnCVqT",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "anday",
            "date": "Dec 23, 2017",
            "title": "Good sosc course for non-SHSS students",
            "comment_content": "The first half of the course is about the concept of poverty; how to measure poverty; gender, ethnic and age inequality. The later half is about the cause of poverty from the perspective of geography, culture and institutions and the focus is how to fight poverty. <br /><br />Easy to understand and can raise your interest if you haven't taken any sosc course.",
            "comment_teaching": "The professor has been teaching the course continually for several semesters, so the teaching is quite skillfully. You can find every sentence the professor says on the slides, which largely reduces the burden of revision during the exam period. She talks quite slow and keeps putting forward encouraging questions, helping us to have a better understanding of the situation of the poor by considering ourselves living the life of the poor.",
            "comment_grading": "Problem set: 45/45 Mean 40<br />Midterm: 70/75&nbsp;&nbsp;Mean 59<br />Group project: 91/100 Mean 82.34<br />Final: 80/85 Mean: 64.3<br />Peer evaluation: don't know<br />Class participation: don't know<br />got A+",
            "comment_workload": "Only one problem set for homework.<br />Group project could be either easy or tough. Choose an area as small as possible (I saw a group choosing Mainland China that I really hope they managed it in the 20-page double-spaced work). Get familiar with the people you group with and schedule meetings and deadlines in advance so that you will have plenty of time to do the literature review. Additionally, pay attention to the peer evaluation since it depends on individual contribution, that is you grade your teammates and yourself with a total mark of 100. Everyone gets 100/(number of members) is not likely to happen.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "QA5V5UEMEDTwsktmixA0zxcNXE9WNMnu",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Ust Toxic Boy",
            "date": "Aug 25, 2017",
            "title": "",
            "comment_content": "The Content is very very easy and general. You can understand all of the questions easily.<br />All of the contents are just like LS ,geog with simple calculations. You can study 2-3days before the exam and still can get a satisfactory mark.~",
            "comment_teaching": "The Teaching is fine. She will ask many questions to students and provide a lot of supplementary video for us. Since the content is easy, I do think teaching doesnt make huge difference",
            "comment_grading": "Very Good Grade.<br />1.10% Class Participation<br />Presence in the lecture will benefit the students greatly in understanding related topics. Some lectures involve interactive game, group discussion and video session. For those activities, students will be randomly selected to share your opinion. <br /><br />2. 30% Two Problem Sets:<br />5% Individual assignment<br />25% Group project: Each group (composed of 6 people) is to submit a regional poverty analysis. The individual score will be based on the group performance and the individual contribution to the group, which is subject to peer evaluation. <br /><br />3. 30% Midterm Exam <br /><br />4. 30% Final Exam<br />The exams will cover lecture notes, required readings and all materials presented in the class. The mid-term and final exam will be closed-book and mutually exclusive. The exams include<br />multiple-choice questions and calculations.<br /><br />Mid Term Below 2SD Final Scored Full Mark(Above1.5SD)<br />Finally turn-out -&gt; B+<br />The grading is absolutely good since I have missed some class and pop quiz. I still got a B+. Thats really good for Sosc Course. RMB to go to the class and you should be able to get a A+ or A.",
            "comment_workload": "Workload is fair.<br />1 Project (Written Report)<br />5 pop-up class quizz<br />1 Mid term <br />1 Final <br />No presentation is needed.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HCsmpUnrsknOgFgLDIsCyG5Tagx1i0dC",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "BryanYum",
            "date": "Jun 25, 2017",
            "title": "",
            "comment_content": "Mostly about poverty before mid term, and policy analysing after mid term, all of them are easily understanding.",
            "comment_teaching": "Good instructor with prominate language skills, strong interaction between teacher and students.",
            "comment_grading": "10% Class Participation: Presence in the lecture will benefit the students greatly in understanding related topics. Some lectures involve interactive game, group discussion and video session. For those activities, students will be randomly selected to share your opinion.<br /><br />30% Two Problem Sets:<br /><br />-5% Individual assignment<br /><br />-25% Group project: Each group (composed of 6 people) is to submit a regional poverty analysis (week 13).<br /><br />30% Midterm Exam<br /><br />30% Final Exam",
            "comment_workload": "Mid term and final exam are easy and the heaviest workload comes from the group project.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "As0OKLR6BhmKh3OgHCppDM2zUY94c0rR",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Aimee",
            "date": "Jun 02, 2017",
            "title": "OKAY",
            "comment_content": "Poverty is the main concept in this course. You don't have to be familiar with the situation in Hong Kong since lecture notes cover examples from all over the world. If you are interested in studying poverty, it is a great basic course.",
            "comment_teaching": "Although there are many words on the lecture notes, it may be slightly difficult to understand the concepts or meaning behind. I think Prof. Wang did some explanation in class to help you think and understand. For those who don't like to do revision, attending the lecture and listening to professor can help! Just try not to fall asleep in class because you may skip some fill in the blank in the notes.",
            "comment_grading": "There are detail in others review about the grading,&nbsp;&nbsp;please just check them out.<br />For me,<br />assignment: 37/40<br />Mid-term: 65/75<br />Group Project: 82.5/100 (I love my groupmates!)<br />Final exam: 83/85<br />participation: Full Mark<br />overall A-<br />Grades are pretty good in THIS semester.",
            "comment_workload": "Workload is light.<br />All you have to do are:<br />1. Find some gpmates that are willing to work.<br />2. Attending the lectures so you will have a better idea about the lecture notes. Also, attendance will be recorded in random lectures.<br />3. Memorize all the words and EXAMPLES and BLANKS on the lecture notes. <br />4. Be really careful during exams, no rush!<br />5. Enjoy your good grade in CC course if you got one.<br />Wish you all the best!!!!!!!",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xdHzG40XO5DtvZcuyvpOTMksq9JLoYi6",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chy",
            "date": "Jun 02, 2017",
            "title": "",
            "comment_content": "考嘅嘢都係powerpoint嘅嘢<br />大概教香港同埋其他地方嘅貧窮問題，解決方法<br />但係又個別lecture講埋history<br />書其實可以唔洗買因為佢考嘅都係lecture powerpoint嘅嘢<br />midterm考嘅範圍比較少 所以final考嘅範圍就相對地多",
            "comment_teaching": "prof都係照lecture powerpoint讀<br />堂上間中會有突擊participation exercise <br />(prof話係想獎勵有上堂嘅同學)",
            "comment_grading": "10% Class Participation<br />30% Two Problem Sets （5% Individual assignment，25% Group project）<br />30% Midterm Exam ( MCs and calculations)<br />30% Final Exam (MCs and calculations) <br />計番grading應該mean嘅就會係b至b-",
            "comment_workload": "workload唔算大 只係得一個problem set 同埋 15-20頁 project 除返開每人其實都唔係做好多",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eOeVCdwmqV52BYV2fXoJ6mLUcL5d74Qq",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "app_Sci",
            "date": "Jun 02, 2017",
            "title": "Be very very careful in this course. A minor mistake could cost a lot.",
            "comment_content": "The course starts from the basics of poverty, such as Gini coefficient, lorentz curve, parade of dwarfs, absolute and relative concepts of poverty in different areas, economic lives of the poor, and dimensions of poverty and inequality.<br />Above are materials from before the midterm. They will not be tested in the finals. Below are materials after the midterm, which are tested in the final exam.<br />Different causes of poverty, institutional and economical reasons, historical reasons (like european colonization), and different ways to tackle poverty, welfare, education, health and finance.",
            "comment_teaching": "I think Wang Jin's teaching is OK. She will try her best to have more interactions. But she just reads ppt directly most of the times. She will also give guidance to us on how to do our projects.",
            "comment_grading": "The grading is not bad, not good. I think the mean is around B-.<br />There are 5 parts.<br />10% Class participation (i.e. attendance)<br />5% Problem set<br />25% Group Project<br />30% Midterm exam<br />30% Final exam<br />Stats (Mean and SD):<br />Problem set: 35.2/40,&nbsp;&nbsp;N/A<br />Midterm: 60/75, 9.0<br />Final exam: 74.3/85. 8.7<br />Project: 79/100, 5.8<br />My scores:<br />Problem set: 37/40<br />Midterm: 54/75<br />Final exam: 69/85<br />Project: 77/100<br />Got a C+.",
            "comment_workload": "The workload is OK. You have to memorize the materials from the PPTs. Some of them are common sense but others are in more advanced levels. As the exam only involves multiple choice questions and calculations (around junior secondary level, calculators are allowed), and the questions are relatively easy, the mean is thus high for midterm and final exams. If you are not careful, then you can get below mean very easily.<br />Bear in mind to remember all the contents in the notes and be careful to score a good mark.<br />You have to do a group project after the midterm. The workload of the project is satisfactory.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "e1gNZcT91jLE2BuL7OgaEBY2Oz6LYZrJ",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "愛lam的男人",
            "date": "Jun 01, 2017",
            "title": "見冇人有review就打下自己嘅主觀意見啦",
            "comment_content": "可能自己本身係活喺低收入家庭<br />對讀嘅內容真係唔覺得悶<br />簡單D講句就係:長知識咁囉<br />包括入嘅內容有點樣定義貧窮呀<br />貧窮個率應該點計? (head count/gini index)<br />唔同地方/國家幫窮人嘅approach等<br />overall係一個幾有意義同有趣嘅course<br />如果搵到朋友一齊做project又唔追grade<br />可以考慮下",
            "comment_teaching": "除左最尾project日子走左幾堂<br />之後都冇走過<br />佢教落似照讀powerpoint<br />但其實真係好洗腦好有用<br />之後走左個幾堂溫極都溫唔入腦<br />都有D後悔LOL<br />英文大陸prof黎講算係咁<br />唔會話聽唔明<br />可能需要集中少少<br />note要填窿<br />仲有要帶定張紙<br />因為有可能要答即時問題作計participation用途,好似有答就有分",
            "comment_grading": "10% Class Participation<br />5%Individual assignment <br />25%Group project <br />30% Midterm Exam <br />30% Final Exam<br />--------------------------------------------------------<br />assignment我below mean<br />participation分齊曬<br />midterm: 71.5 highest 72.5 full mark:75<br />final:83 highest 85 full mark:85<br />project:81.6 highest 90 full mark:100 冇marking scheme <br />最後拎左A",
            "comment_workload": "project可以幾日內做曬<br />最緊要求神拜佛唔好遇到freerider<br />midterm final都唔難<br />唔洗背圖嘅數據<br />除非佢再專登寫左句句子總結<br />如果唔係只要背張圖想帶出嘅correlation/causation就夠<br />仲有佢嘅reading material唔係compulsory<br />完全冇考過<br />考嘅野100%係notes到有<br />所以最後都係鬥勤力/小心",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0hSDtr6IDWb4UtFvrTCzoypEi8G1pNQJ",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 672,
                    "name": "WANG, Jin",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "lepetite055097",
            "date": "Jun 12, 2018",
            "title": "Really boring and horrible English",
            "comment_content": "This course aims to make students gain familiarity with poverty issues including poverty measurement, underlying causes of poverty, the impact of poverty on society and government programs and policies that address poverty. We will illustrate principles with real-world applications. Though the course discusses poverty in a broad context of developing and developed countries, an extra emphasis will be put on poverty related issues in Hong Kong and mainland China.",
            "comment_teaching": "Mainland instructor. I don't want to be personal, but her English accent is really driving me and my friends crazy,",
            "comment_grading": "10% Class Participation:<br />30% Two Problem Sets:<br />5% Individual assignment: Problem sets must be handed in to the canvas system on the due date/time (expected Mar 2nd, week 4). Late submission will NOT be accepted.<br /><br />25% Group project: Each group (composed of 6 people) is to submit a regional poverty analysis. <br />30% Midterm Exam: in class (expected Mar 23rd, week 7).<br />30% Final Exam: to be arranged by ARRO.",
            "comment_workload": "The workload is very little because the material is extremely easy. Only the group project needs to be taken care of nicely, and make sure that you select your teammates wisely otherwise the workload will be extremely heavy.",
            "rating_content": 1,
            "rating_teaching": 1,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}