{
    "error": false,
    "course": {
        "id": 1404,
        "subject": "SOSC",
        "code": "2310",
        "name": "Introductory Environmental and Health Economics",
        "description": "This course introduces students to basic theories and findings in environmental and health economics. The emphasis is on how the economic models and concepts can be used to analyze environmental and health issues. The course begins with an introduction of theoretical economic concepts and models; then it moves on to several policy-relevant environmental and health topics. Particular issues include externality, common goods and public goods, valuation of environmental goods and health, market failure and health, environmental regulations, pollution and health, and the economics of climate change.",
        "categories": [
            "Common Core (SA)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2010,
            1930,
            1830,
            1710,
            1610,
            1510
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "<a class=\"course-link\" data-subject=\"ECON\" data-code=\"2310\" href=\"/review/ECON2310\" target=\"_blank\">ECON 2310</a>, <a class=\"course-link\" data-subject=\"ENVR\" data-code=\"2310\" href=\"/review/ENVR2310\" target=\"_blank\">ENVR 2310</a>",
        "rating_content": 4.2,
        "rating_teaching": 4.3,
        "rating_grading": 4.2,
        "rating_workload": 3.2,
        "review_count": 10,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 225,
                "name": "HE, Guojun",
                "count": 10
            }
        ]
    },
    "reviews": [
        {
            "hash": "4e9inAFquRcmkIEH8Djq3sV5FMGJ3FsP",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 225,
                    "name": "HE, Guojun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kabul",
            "date": "Jun 07, 2019",
            "title": "Very rich content and very challenging.",
            "comment_content": "Basic Economics<br />🔷 2 Economics and Methodology<br />🔷 3 Principles of Economics<br />🔷 4 Supply and Demand<br />🔷 5 Welfare Analysis<br />🔷 6 Externality<br />🔷 7 Coase Theorem<br />🔷 8 Public Goods and Common Resources<br /><br />Environmental and Health Economics<br />🔶 9 Valuation of Environment<br />🔶 10 Value of Statistical Life<br />🔶 11 Benefit-Cost Analysis<br />🔶 12 Environment and Health<br />🔶 13 Information Asymmetry<br />🔶 14 Health Care and Insurance<br />🔶 15 Second Best Theory<br /><br />The pre-midterm topics are basic microeconomic concepts taught in high school or ECON2103/2113, with additional topics such as the Coase theorem and public goods/common resources. The post-midterm topics are advanced economic concepts applied to the scenarios of the environment and healthcare markets. These include estimation of the &quot;value&quot; of the environment and human lives, policy decision making, risk aversion in the insurance market, etc.<br /><br />These topics will stimulate you to re-think about the counter-intuitive part of economics and public policy decisions, and looking into its controversial aspects. The professor also digs into a few pieces of academic research and try to look at issues from an economic perspective, such as how to know whether the local government officials in China have faked the environment data or not, or how to quantify the effect of a certain policy on the environment.<br /><br />Unlike what is said at the beginning of the course, no calculus is involved. Prior knowledge in microeconomics is crucial though. The content is really rich and will become progressively more difficult after the midterm. Make sure you only enroll in this course after you've a basic understanding of microeconomics.",
            "comment_teaching": "Prof He delivers the content and explains the concepts very clearly. He also prompts us to think beyond the surface and adopt a critical mindset. Overall he is really good at stimulating us to think.",
            "comment_grading": "❓ 10% Class Participation<br />✏️ 20% Film / News Article Analysis<br />✏️ 20% 4 problem sets<br />✏️ 20% Midterm<br />✏️ 30% Final Exam<br /><br />I got 17/20 (mean = 15.6) in the news article analysis, 19.15/20 (mean = 18.35) in the problem sets, 18.5/20 (mean unknown) in the midterm and 85/100 (mean = 70.3) in the final exam. I made a minor slip in the final exam because of poor time management and not being able to finish the paper.<br /><br />💯 Grade: A<br /><br />Not quite sure how he gives class participation marks though.",
            "comment_workload": "The film / news article analysis consisting of a maximum of 5 pages (1.5 spacing) is quite challenging as we are required to dig out relevant economic issues from a film / news article and analyze them. The connection between the issues and economics is often not that trivial and requires a lil bit of thinking.<br /><br />The 4 problem sets are of reasonable difficulty and should not cost you much time. The exam style is usually straightforward and you will do decently well as soon as you really grasp the concepts.<br /><br />Prof He would give you some reading materials but these are only for supplementary purposes and are not absolutely required.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wiOuyloiDVKuS52F3aTn41G1M4bPYKRi",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 225,
                    "name": "HE, Guojun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MelMel",
            "date": "Jan 19, 2021",
            "title": "",
            "comment_content": "1. Principles of Economics<br />2. Supply, Demand and Market Equilibrium &amp; Comparative Statics<br />3. Consumer Surplus and Producer Surplus &amp; Welfare Analysis<br />4. Social Optimum and Economic Efficiency &amp; Externalities<br />5. Coase Theorem<br />6. Common Resources &amp; Public Goods<br />7. Political Economy of Public Goods Provision <br />8. Valuing the Environment<br />9. VSL &amp; Benefit and Cost Analysis<br />10. Pollution and Health<br />11. Asymmetry Information &amp; Health Care and Insurance<br />12. Environmental Regulations &amp; Second Best<br />13. Climate Change and the Future",
            "comment_teaching": "The professor is super good. He talks about a lot of good examples and provides chances to discuss with the classmates.",
            "comment_grading": "Participation 10%<br />Assignment 20%<br />Essay 35%<br />Final 35%<br /><br />The grading is supper fair. 25% of the students are in the A range. Not hard to get high grade in the essay. And there is no mid-term for the course.",
            "comment_workload": "The workload is small. Only a few easy assignment. But remember to start planing the essay early. Then you will have no problem with the course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "jVNhjSC1H18KcZxU5zMOuZHxWv2z1roa",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 225,
                    "name": "HE, Guojun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wantgoodgrade",
            "date": "Dec 31, 2020",
            "title": "Do not take this course or you will regret it",
            "comment_content": "the content is overly rich.<br /><br />when you do the revision, you will be very confused because there are too few resources and instructions<br /><br />Especially if you didn't learn economics in high school, just don't take this course.",
            "comment_teaching": "the professor taught with passion. But his teaching speed is a bit too fast so if you didn't learn economics in advance, it is hard to catch up the lessons.",
            "comment_grading": "problem sets (20%), news article analysis/film review (35%), participation (10%), and the final exam (35%).&nbsp;&nbsp;&nbsp;<br /><br />the grading is not that good, to be honest.",
            "comment_workload": "the workload is quite heavy. You need time to understand the concepts",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "kaYDoF1f1aQASHdDWlsGF0REU4jk1mRG",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 225,
                    "name": "HE, Guojun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "maec_trash",
            "date": "Jul 11, 2019",
            "title": "Heavy workload but interesting",
            "comment_content": "Super interesting to me. Mind-blowing. Non-econ major students can manage this course.<br /><br />Course Outline (Tentative)<br />Week 1:<br />Overview<br />Principles of Economics<br />Week 2:<br />Supply, Demand and Market Equilibrium<br />Comparative Statics<br />Week 4:<br />Consumer Surplus and Producer Surplus<br />Welfare Analysis<br />Week 5:<br />Social Optimum and Economic Efficiency<br />Externalities<br />Week 6:<br />Coase Theorem and Discussions<br />Week 7:<br />Common Resources<br />Public Goods<br />Week 8:<br />Political Economy of Public Goods Provision and Discussions*<br />Midterm<br />Week 9:<br />Valuing the Environment: Revealed Preference and Stated Preference<br />Week 10:<br />VSL<br />Benefit and Cost Analysis<br />Week 11:<br />Pollution and Health<br />Documentary Film<br />Week 12:<br />Asymmetry Information, Moral Hazard, and Adverse Selection<br />Health Care and Insurance<br />Week 13:<br />Environmental Regulations: Market-Based vs. Command and Control<br />Second Best",
            "comment_teaching": "Not bad. Professor delivers the content clearly but sometimes the lectures are just boring. There is discussion time in the lecture sometimes but they seemed not very effective as most of the students are so confused at first place. (Probably this is a CC course but many economics concepts and techniques are applied)",
            "comment_grading": "20% 4 sets of assignment: most people got 90% or above<br />assign. 1: mean 9.2/10, me 9.3/10<br />assign. 2: mean 8.9/10, me 9.5/10<br />assign. 3: mean 9.2/10, me 9.5/10<br />assign. 4: mean 9.4/10, me 9.9/10<br /><br />20% Film review/News article analysis: confused, don't have ideas on how to do well<br />mean 15.6/20, me 15/20<br /><br />10% Participation: not disclosed<br /><br />20% Mid-term exam: not too difficult<br />(statistics are disclosed in the lecture if I don't remember wrong)<br />mean: around 14.5-14.7/20, me 16.5/20<br />SD: around 2.2<br /><br />30% Final exam<br />mean: 70.3/100, me 81/100, SD unknown<br /><br />finally got a B+. I guess B range is wider than normal university standard as my friend messed up in this course (every task is around mean) and he got B-",
            "comment_workload": "Comparing to other SOSC courses, this course requires much more effort in order to understand the topics thoroughly. Also, there are mid-term and final exams, assignments and film review.<br />Although I am an ECON major student, still I spent relatively more time on this course as more than half of the topics are new to me. Besides, I spent lots of time finishing the assignments, especially the film review, because there is no guideline on each task. (I've asked the TA and he said that he was sometimes confused by the prof about grading LOL)",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "81K9o3hRLdAaQpnzCajoFa78E0c1UVo7",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 225,
                    "name": "HE, Guojun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "NOIUE",
            "date": "Jan 12, 2018",
            "title": "Interesting economic class about environment and economic (if you are an economics lover :) )",
            "comment_content": "At the beginning (before the midterm) it went through some basic economic concepts which has been taught in high school.<br />The midterm covers:<br />1. Law of Demand <br />2. Demand and Supply <br />3. Equilibrium and efficiency <br />4. Externality <br />5. Coasm Theorem<br />6. Public goods<br />If you are a local student and studied ECON in DSE, those should be easy. But be careful about the efficiency part in midterm, because the question the prof asked about externality and efficiency is quite complicated for me. <br /><br />After the midterm, the topics taught are new to me. <br />The final covers:<br />1. Valuing the environment <br />(This part is about how to measure the value of a good which does not have a market price. i.e. Hedonic approach, travel cost modelling and avoidance costs)<br />2. VSL (Value of a Statistical Life) <br />(Trying to estimate a single human life in the society and discussion on the ethical issue)<br />3. Benefit-Cost Analysis<br />(A method to determine whether we should implement a policy or not, a process to go through in policy making)<br />4. Environmental and Health<br />(Link environmental risk to human health and quantify the effect with the above methods)<br />5. Markets with asymmetric information <br />(the lemon effect, moral hazard and averse selection)<br />6. Climate change and its effect in China<br />7. Second Best Theory",
            "comment_teaching": "quite good i think<br />The prof likes to ask question in the lesson.<br />Clear voice and providing enough material for you to study the exam.",
            "comment_grading": "10 % Class Participation (0/10) (i think.....) (the prof didnt give us the result but I didnt attend any class)<br />20% Film / news article review (15/ 20)<br />20% Assignment&nbsp;&nbsp;(16/20)<br />20% Midterm (66/100) (adjusted score: 81) (Did badly in midterm)<br />30% Final Exam (27.6/30)<br /><br />Grade: B+",
            "comment_workload": "Personally dislike attending class<br />Others are good<br /><br />The assignments are not very difficult. Around 4 to 5 question in each assignments. 4 in total in the semester. <br /><br />4- page review with 1.5 <br /><br />Exam is very easy if you did the assignment yourself.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "Axgkixd5NwkDboaUhQU8ZrRYwyK6N3PZ",
                    "name": "0_Syllabus_updated",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "G2fhWICrBqDs7U70pQY68ofO4x3Em6kg",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 225,
                    "name": "HE, Guojun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "I.048S96",
            "date": "Jan 02, 2018",
            "title": "Great course and content. But be careful with the exams.",
            "comment_content": "The content is extremely rich... (overly rich) When you are studying for the finals, you will find yourself cursing at the fat presentation slides that you need to study. Otherwise, I think I learned a lot of useful stuff in this course.",
            "comment_teaching": "First of all, most of the students do not listen to the lecture. There are a few reasons why: <br /><br />1) The professor's voice is extremely boring... The content is okay. <br />2) The seat in the lecture hall is too comfortable. I don't think the lecture hall was designed for academic purposes.",
            "comment_grading": "Midterm average was very low. Around 69. He adjusted the scores but students were not very happy about not having enough time to finish the exams. Plus, the exam had an entirely new, application problem that most of the students couldn't solve. So the midterm scores determined the term score because the final exam was not very hard. <br /><br />Midterm: 91 (adjusted score: 95) /100<br />Final: 27.3/30 (91/100) <br /><br />But most of all, the grades for assignments are not very high. It is difficult to get a 100 on the assignments. <br /><br />Assignment 1: 4.4/5.0<br />Assignment 2: 4.63/5.0<br />Assignment 3: 4.5/5.0<br />Assignment 4: 4.7/5.0 <br /><br />I talked to the TA about the grading but it seems that he does relative grading. He compares the answers with other students so the best few gets 20, the next few gets 19 ... and so on. <br /><br />News Article Review/Film Review: 18/20 (High: 19/20)",
            "comment_workload": "I'd say light workload.<br /><br />The assignments take quite a long time (3~5 hours maybe?) but there are only 4. The film review takes a little longer than that. But you should invest more time on the film review, which is worth 20% of your grade. <br /><br />If not for the stress of the exams, I'd say I enjoyed the course very much. <br /><br />And seek help from the TA, the TA has lot to offer. He may even give answers for the assignment questions (mainly because he also does not know what the professor is expecting for the questions. There are many open questions that's why)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "tc8LfG9yX094i5BCeakxvpQUl4mqk9bS",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 225,
                    "name": "HE, Guojun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "To Cheuk Hei",
            "date": "Jan 28, 2016",
            "title": "",
            "comment_content": "Majority of topics involve basic economic background, it may not be a great choice to some who have no economic background at all. <br />Overall the lessons were fun and content is easy to comprehend.",
            "comment_teaching": "Professor speaks fluent English and teaches pretty well in classes even if most students were not very responsive. He is very nice so feel free to ask about content or materials taught in lessons.",
            "comment_grading": "Got final grade B, was not too surprised as the grading was normal and if you do not anticipate too much in class, it is hard to get into a-range. <br />Mid-term and Final exams did have some challenging questions, so be prepared to study thoroughly. Also, you will be given a study guide before exams, which is very helpful in terms of picking topics to study in the very last minute.",
            "comment_workload": "Workload was not too heavy, 5 assignments with 2 newspaper article before each exam, the mean scores were quite high but some answers can be found on the Internet so no worries.<br />Also, some games and interactive activities may help students to furthermore understand topics and concepts involved in the course.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "YDTJkRMAzsTAqGuhezfYhpG5mJUTpdlS",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 225,
                    "name": "HE, Guojun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Neurotoxin",
            "date": "Jan 23, 2016",
            "title": "reasonable grade, but challenging for people with no econ background",
            "comment_content": "The instructor first teaches the basics of microeconomics, like supply and demand, price ceiling and price floors, cs and ps and so on, people with dse econ background can easily follow the course. Later he teaches monopoly and externalities and so on. I think the content is interesting but the instructor teaches quite fast.",
            "comment_teaching": "instructor speaks well in english and people are generally not sleepy in class, he doesn't just follow the powerpoint and read aloud but add his own explanations and examples, he allows class discussions and will hear your suggestions on how to improve the course.",
            "comment_grading": "reasonable grading, i got below one sd in mid term and above one sd in the finals, did all my hw and got a B. honestly, I didn't study a lot so I am happy that I got a B.",
            "comment_workload": "workload is a bit high, with 5 long questions homework and 2 newspaper article, but help consolidate your knowledge, the mean in the homework is quite high, always up to 9.5/10. So, you need to hand in all your hw.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "q8zRyfPgIjLZl2A89GynnuQLQQ0273rs",
            "semester": "2015-16 Fall",
            "instructors": [
                {
                    "id": 225,
                    "name": "HE, Guojun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mlmlml",
            "date": "Dec 26, 2015",
            "title": "Not difficult to get B range",
            "comment_content": "Use some basic economic models and concepts to analyze environmental and health issues (Actually it is more similar to econ course).&nbsp;&nbsp;Students with basic economics concept may find it easier.",
            "comment_teaching": "Overall, he teaches quite well.&nbsp;&nbsp;As our class misses several class due to public holiday, so he taught faster after midterm exam, in which students without basic econ background may hard to follow.&nbsp;&nbsp;But his notes are easy to follow and understand, and he is willing to answer students' question and explain the concepts clearly after class.",
            "comment_grading": "Assignment: 20%<br />There are in total 5 individual problem sets.&nbsp;&nbsp;The problem set with lowest score will be eliminated when computing the final course grade.<br /><br />News Article Analysis: 10%<br />In this course, students are required to discuss 2 newspaper articles which relate to environmental or health issue.&nbsp;&nbsp;Write one page analysis of the article including a brief summary of the article and discuss how it relates to the concepts covered in the course.<br /><br />Midterm Exam: 25%<br />Explain key concepts, True or false and long questions.&nbsp;&nbsp;No calculator is allowed.<br /><br />Final Exam: 35%<br />Course material is cumulative.&nbsp;&nbsp;Same format as midterm exam.<br /><br />Participation: 10%<br /><br />The grading is pretty fair.&nbsp;&nbsp;I got few marks below mean for both exams but slightly above mean for all homework.&nbsp;&nbsp;Got a B grade at last.",
            "comment_workload": "The workload of this course is a bit high as there are 7 assignment in total and some of the problem set are a bit long and difficult.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3jIm1Mb5wLuIMx3gZm58nDO8Woj2Pkgy",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 225,
                    "name": "HE, Guojun",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "pepelover",
            "date": "Aug 15, 2019",
            "title": "",
            "comment_content": "Midterm教demand&amp;supply基本野<br />中學有讀econ應該比輕鬆<br />Midterm後期開始教新野難啲<br /><br />Course Outline (Tentative)<br />Week 1:<br />Overview<br />Principles of Economics<br /><br />Week 2:<br />Supply, Demand and Market Equilibrium<br />Comparative Statics<br /><br />Week 4:<br />Consumer Surplus and Producer Surplus<br />Welfare Analysis<br /><br />Week 5:<br />Social Optimum and Economic Efficiency<br />Externalities<br /><br />Week 6:<br />Coase Theorem and Discussions<br /><br />Week 7:<br />Common Resources<br />Public Goods<br /><br />Week 8:<br />Political Economy of Public Goods Provision and Discussions*<br />Midterm<br /><br />Week 9:<br />Valuing the Environment: Revealed Preference and Stated Preference<br /><br />Week 10:<br />VSL<br />Benefit and Cost Analysis<br /><br />Week 11:<br />Pollution and Health<br />Documentary Film<br /><br />Week 12:<br />Asymmetry Information, Moral Hazard, and Adverse Selection<br />Health Care and Insurance<br /><br />Week 13:<br />Environmental Regulations: Market-Based vs. Command and Control<br />Second Best<br /><br />Week 15:<br />Climate Change and the Future*<br />Final Review",
            "comment_teaching": "無tick attendance <br />powerpoint可以自己睇 <br />成日skip堂 唔知Teaching如何",
            "comment_grading": "normal grading<br /><br />my grade:<br />Assignment 1: 9.8/10 (mean:9.2)<br />Assignment 2: 9.7/10 (mean:8.9)<br />Assignment 3: 9.5/10 (mean: 9.2)<br />Assignment 4: 9.6/10 (mean: 9.4)<br />News Article Analysis: 15.5/20 (mean: 15.6)<br />Midterm: 17/20 (mean:15)<br />Final Exam: 72/100 (mean: 70.3)<br />Final grade: B",
            "comment_workload": "assignments (20%)<br />news article analysis/film review (20%)<br />participation (10%)<br />midterm (20%)<br />final exam(30%)<br /><br />assignments都幾多 而且每份都要放唔少時間做 week 13仲有news article analysis<br />workload都幾大",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}