{
    "error": false,
    "course": {
        "id": 2689,
        "subject": "SOSC",
        "code": "1000E",
        "name": "Politics through Film",
        "description": "This course discusses key concepts in politics using films as course material. Movies illustrate human lives and feelings in a dramatic way, which often allows us to experience historical events or lives in the other side of the world indirectly. The purpose of this course is to provide an overview of the field of political science and key events in political history by watching movies describing them. The course explores important political topics and themes including political power and election, democracy, protest and repression, media, corruption, and war. By watching movies, attending lectures, and participating in discussions, students not only learn these concepts but also understand that political issues are part of our society and history and have an substantial influence on individual's life.",
        "categories": [],
        "website": null,
        "credits": 3,
        "semesters": [
            1810
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.33,
        "rating_teaching": 4,
        "rating_grading": 5,
        "rating_workload": 4.67,
        "review_count": 3,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 665,
                "name": "HONG, Jean (Ji Yeon)",
                "count": 3
            }
        ]
    },
    "reviews": [
        {
            "hash": "DLcWmfHNGlgfksEk4qqiQ0lJ10ADUZ0U",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 665,
                    "name": "HONG, Jean (Ji Yeon)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Paaklam",
            "date": "May 14, 2023",
            "title": "",
            "comment_content": "Week 1. Introduction: Politics and Conflicting Values<br />Week 2. State and Power<br />Week 3. Democratization<br />Week 4. Presidency, Congress, and Constitution<br />Week 5. Election and Campaign<br />Week 6. Universal Suffrage and Civil Rights<br />Week 7. Discrimination and Racism<br />Week 8. Media<br />Week 9. Corruption and Lobbying<br />Week 10. Civil Conflict<br />Week 11. Terrorism and Human Rights<br />Week 12. Poverty (and Refugee)<br />Week 13. Economic Inequality (and Poverty)<br /><br />每個topic都有一部電影要看",
            "comment_teaching": "課外時間看電影，可以跟prof看也可以自己找資源看，上堂就講電影和政治課題<br />那時候zoom上堂，加上個人對這個政治topic不太感興趣，完全聽不進<br />有興趣聽的可能會覺得不錯",
            "comment_grading": "quiz 40%<br />final 30%<br />attendance 10%<br />essay 20%<br /><br />小弟B-，以我的角度看，非常好grade。原因如下：<br />1. 我miss了兩個Quiz<br />2. 經常Absent<br />3. final 最低11分我14.83，mean25.58，滿分50<br /><br />建議trytry",
            "comment_workload": "1. 一篇影評 Movie Critique<br />2. 每個禮拜 quiz，測試對電影內容的了解，所以一定要看一看電影，每個禮拜要抽點時間<br />3. final exam （考reading同lecture內容，MC加open-end）<br /><br />中規中矩，不算太多，特別是現在有GPT&nbsp;&nbsp;（以前冇-_-）<br /><br />reading好多，追求靚grade可以睇，小弟英文唔好，多concept我就睇到瞓著。放棄了。",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KWnwVEcrrsweRKBmfCRzAGt3DSfnfSv9",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 665,
                    "name": "HONG, Jean (Ji Yeon)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AKIRA",
            "date": "Jan 31, 2019",
            "title": "No Academic Pressure but Emotional Stress from the Movies",
            "comment_content": "Course content<br />week 1: Introduction about Politics<br />Definitions of state, nation, nation-state etc, social contract law, state of nature etc.<br />week 2: Authoritarianism<br />Types of autocracy and the regime survival rates&nbsp;&nbsp;etc.<br />week 3: Democratization<br />week 4: Presidency and Congress (+the US Civil War)<br />Presidential vs Parliamentary Systems<br />week 5,6: Election Campaign <br />Again the US Election as an example<br />week 7: Discrimination and Resistance<br />universal suffrage, civil right movement (Martin Luther King)<br />week 8: Corruption and Lobbying<br />Principal-Agency Theory, rent-seeking<br />week 9: Media<br />Freedom of speech, fake news and ideology (fascism [extreme nationalism], communism etc.)<br />week 10, 11,12: War, Civil Conflict, Terrorism and Human Right<br />Rational causes of war, suicide terrorism<br />Week 13: Economic Inequality and Poverty<br />Only macroeconomic topic to be covered<br />Solutions to eradicate poverty, Gini coefficient (Lorenz Curve), correlation between economic growth and inequality<br /><br />Movies <br />Comment<br />1. some are meaningful but together with high emotional pressure [quite bloody for war movies/ with very critical moral thinking]<br />2. some are not quite friendly to non-native English speakers even with English subtitles [the subtitles are in poor presentation]<br />3. some are quite boring and most of them are in typical Hollywood style<br />4. some require definite, basic understanding of the movie background (like Lincoln for the American civil war) <br />You may not understand when you watch it for the first time. Professor will first explain some of the background in the lecture before the movie playing, it does help yet you may still encounter the problem in understanding the movie.<br /> <br />I had watched none of the movies before taking this course, it was still manageable to answer the movie quizzes in the canvas despite limited understanding. But it may cause you quite a lot of pressure to watch the movies that you are uninterested/ emotionally stressed. (the largest problem of this course for some of you)<br /><br />No movies in add-drop period<br />week 2: The Lives of Others (2006)<br />week 3: 1987: When the day comes (2018)<br />week 4: Lincoln (2012)<br />week 5: The Ides of March (2011)<br />week 6: Selma (2014)<br />week 7: Casino Jack (2010)<br />week 8: Good Night and Good Luck (2005)<br />week 9: Assembly (JiJieHao, 集結號) (2007)<br />week 10: American Sniper (2015)<br />week 11: Unthinkable (2010)<br />week 12: Slumdog Millionaire (2008)<br />No movie for the last week (lecture only)",
            "comment_teaching": "2/3 3-hr lesson is for movie watching<br />1/3 3-hr lesson is remained for limited teaching<br />The professor teaches clearly and explains the concepts well<br />Sometimes the professor will reveal 1-2 questions to be examined in the final exam in the lecture~<br />*The essay is in freestyle (stressed by the professor for many times)and the professor does not provide much guidance on the writing for the essay",
            "comment_grading": "Class Size &gt; = 50<br />Film Quiz: 40%<br />Final Exam on Readings and Lectures: 40%<br />Final Essay: 20%<br />Attendance: ?<br /><br />Class Size &lt; 50 (the case for this semester)<br />Film Quiz: 40%<br />Final Exam on Readings and Lectures: 30%<br />Final Essay: 30%<br />Attendance: ?<br /><br />The grading is not transparent, yet it is not difficult to manage the course content and quite easy to obtain a good grade, although there are quite a number of non-local students in the class.<br />The final exam is not hard and can be finished within an hour. There are only MCQs, True or false and short questions.",
            "comment_workload": "For Reading<br />1 Reading per week yet the reading is quite academic, long and difficult to understand<br />However, don't worry, the professor will summarize, highlight and explain the important points of every reading in the lecture with the PowerPoint. In fact you don't really need to read it~<br /><br />For Movie Quizzes in Canvas<br />Movie is usually played in the beginning of the class (09:00 am for this semester)<br />You have to take the quiz for every movie just after watching the movie in Canvas (so don't skip the class!)<br />The quiz has time limitation, 10 minutes for 9 MCQs and 1 Self-reflection (self-reflection is not grade-counted)<br />You cannot re-do the quizzes after submission<br />you cannot flip back to redo the question even you haven't submitted the whole quiz (once you have chosen the answer and click the button &quot;next question&quot;, you cannot review the previous question)<br />For fairness, you cannot sit with others to prevent the discussion during the quiz.<br />The quiz questions are all about the key movie facts (about some important scenes) (not in critical/ conceptual level) yet they are quite tricky! You may answer wrong easily...be careful and Wiki does help! Sometimes the quiz asks about the first scene of the movie, so late comers may miss the 1st answer for the quiz (punctuality is important). If you make 7 out of 9 MCQs correct, then you have no worries about the grading.<br /><br />For Essay<br />About the depth of the political insight and analysis, so the choice of movie is important to write a good essay<br />You can refer to the syllabus, there are some additional movies suggested and relate to the course content. You can choose these or any other films for your essay.<br />Freestyle about 1000 words (not strict in word limit, upmost 2000 words)<br />The professor had once changed the word limit in the middle of the semester to 2000 words and you may ask her if you can write 2000 words or not.<br />The essay is submitted at the last day of the semester (last day of the exam period), so there is no time pressure to write it up.<br /><br />For Attendance Checking<br />The professor has randomly taken the attendance in the very beginning of the class (first 5 minutes at most) twice. It may count some points, so don't miss it. Also, there is a questionnaire-like quiz in the canvas to ask for your opinion to the movies in the last lecture as attendance checking.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "viCgQR40olDeGYkzGj4u0fAhiSDHASqk",
                    "name": "SOSC1000E_2018Fall_Syllabus (1)",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "11ybBFzAqMeNs4L9eOUfZ9w6Wb5kXlMl",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 665,
                    "name": "HONG, Jean (Ji Yeon)",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "grqm",
            "date": "Jan 09, 2019",
            "title": "",
            "comment_content": "I enjoyed this course a lot because I love films and I care about politics. Movies are not mere entertainment. Many good films are politically and socially relevant. The course is all about watching those movies and thinking about their political implications. <br /><br />My only complaint would be the selection of films screened. All movies screened were made in the 21st century. Two of them are TV movies. Not bad in terms of their political message, but they are artistically and technically unimpressive. <br /><br />The oldest and my favourite film screened in class is &quot;The Lives of Others&quot;, released in 2006. It is a fictional story about how politics has a profound influence on individual lives. <br /><br />Unfortunately, many older, and in my opinion more insightful political films are only recommended but not screened. I mean, how could you not show &quot;Dr. Strangelove&quot; and &quot;All the President's Men&quot; in a class about politics and film? The former is a Cold War satire which is still relevant 50 years later. The latter is probably the best film about politics and the media, which is more relevant now than ever before.",
            "comment_teaching": "There wasn't much teaching. Most of the course is film screening.",
            "comment_grading": "Very good because quizzes take up 40% of the grade.",
            "comment_workload": "We had to watch a film every week and take a really easy quiz. <br /><br />Also had to write a short (1000-word) essay on a movie and its political implications.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}