{
    "error": false,
    "course": {
        "id": 1172,
        "subject": "SOSC",
        "code": "2780",
        "name": "Modernization and Social Change",
        "description": "This course is designed to acquaint students with the major concepts and theoretical perspectives of modernization and social change. Development experiences from both developing and developed countries will be used as examples to illustrate the merits and shortcomings of different theoretical perspectives in the field of modernization and social change.",
        "categories": [
            "Common Core (SA)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            1810,
            1730,
            1630,
            1410
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "",
        "rating_content": 4.62,
        "rating_teaching": 4.77,
        "rating_grading": 4.85,
        "rating_workload": 4.15,
        "review_count": 13,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 663,
                "name": "SO, Alvin Yiu-cheong",
                "count": 13
            }
        ]
    },
    "reviews": [
        {
            "hash": "Wx6ruhBiKa7H4tgFFwKewMXtTpBSKy6d",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "simonskso",
            "date": "Jan 23, 2018",
            "title": "Extremely good grade if you spend more time on it",
            "comment_content": "The course consist of three parts, the content is actually quite easy to understand as a 2000 level course.",
            "comment_teaching": "Professor taught quite well. He is quite funny and explained everything in detail. But his English speaking may not be accurate enough sometimes.",
            "comment_grading": "There are three exams in total, all exam questions are essay format.<br />First exam (60 points), Second Exam (60 points), Final Exam (80 points) with a total of 200 points. <br /><br />Also, there are a total of 5 extra quizzes, in which you can earn 2 extra points at maximum in each quiz. It is very easy to get full mark. The quiz is held before the end of particular lesson and Professor will tell in the class in advance. <br />Grades: 180-200 = A; 160-179 = B; 140-159 = C; 120-139 = D; 119 &amp; less = F<br /><br />The course is absolute grading as told by professor in the class. But I think it is not actually because I got only like 87% even though I counted the 10 points from extra quiz. I got A.<br />First exam: 51/60&nbsp;&nbsp;Mean: 51.7<br />Midterm: 52/60&nbsp;&nbsp;Mean: 52.9<br />Final exam: 70/80&nbsp;&nbsp;Mean: 67.4<br />The lowest scored person still have 7x%, which implies it is very difficult to get C range.",
            "comment_workload": "Three exams are distributed throughout the semester. The good thing is it is non-cumulative. <br /><br />It is important to attend every lessons so as to jot note. There are so extra information and examples that can help you better understand it as well as preparing the exam. Those examples are quite useful.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3iGr1ivy6Gt0x03wWvKg1rKV7IEiJIVq",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hillainecheung",
            "date": "Jan 25, 2019",
            "title": "",
            "comment_content": "divided into 3 big parts<br />1. modernization and dependency<br />- included demographic, psychological, political, economic, cultural modernization theories; and the classical colonialism theory and the new dependent development theory.<br />2. world system analysis, development and globalization project<br />- new phenomenon such as de-industrialization and re-industrialization, the restructuring of nation-state, hybrid cultural identity, flexible employment, and the widening of social inequality in the 21st century will be covered.<br />3. historical study of East Asia<br />- explains the rise of it, plus the socialist revolution and post-socialist transformation, the rise of Japan and China, and how the national reunification project has shaped the path of development of mainland China, Taiwan, and Hong Kong since the 1980s.",
            "comment_teaching": "kind and talkative, very willing to answer students' questions during and after class, so far my favourite prof. in ust.<br />explains clearly on every topic and theories, give out adequate examples to deepen our understanding.<br />but need to be very concentrate in class or else you will miss out some points.",
            "comment_grading": "absolute grading<br />2 mid-terms (full marks 60) and 1 final (full marks 80)<br />got about 85% on 3 exams and my grade is B+<br />need good time management and high writing speed",
            "comment_workload": "no workload at all<br />just 5 in-class quizzes to express your own opinion on a certain topic which he covers in class<br />may be pop-up or will be announced before hand, better for you to attend all lectures to get the 5 bonus marks",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VpiEtfzgsWXeAbbVe4Ix4U8uyAZgyyj7",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wingyungxdxd",
            "date": "Jan 09, 2019",
            "title": "",
            "comment_content": "1. Modernization and Dependency<br />2. World-Systems Analysis and the Globalization Project<br />3. The rising of East Asia",
            "comment_teaching": "Professor is very kind and he talked clearly about every slides of the powerpoint. When he is talking about the points, he would further elaborate by using the examples from the reading. Therefore, there are brief elaboration and description about every point.",
            "comment_grading": "The grade is good and it doesn't need to make curve. There are five quizzes inside the lesson but all are open book. The professor will remind us about the coming quiz and we can open book when doing the quizzes. It is very easy and straightforward to copy the answer from the powerpoint. There are also two mid terms and&nbsp;&nbsp;one final. The professor will give us all the topics to prepare first and he will choose from them directly. If you prepare well and recite all the points, it is extremely easy to get a high marks.",
            "comment_workload": "The workload Is not heavy because there are no assignments and online quizzes. But if you doesn't like any recite, then you should think carefully about taking this coarse.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "OL86PfiqqYjbAatpuOmd6qDUtU4mj2a4",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "chcx",
            "date": "Dec 27, 2018",
            "title": "",
            "comment_content": "I. Modernization and Dependency<br />II. World-Systems Analysis and the Globalization Project<br />III. East Asia<br /><br />內容大概係用唔同theories嘅角度睇全球嘅發展，讀落其實係幾有趣的",
            "comment_teaching": "prof英文講得唔快，用字都唔深，感覺佢係已經熟到唔洗備課<br />個人幾中意聽佢講書 每堂都大部分人有出席<br />用心聽佢講書其實已經cover左好多readings<br />TA都好用心 出grade好快",
            "comment_grading": "absolute grading.<br />Three essay exams<br />exam1 (60points) + exam 2(60points)+ exam3(80points)<br />my grade: 51/60 + 54/60 +69/80<br />5 bonus quizzes, I went 4<br />Overall: B+",
            "comment_workload": "主要睇prof寫嘅書<br />佢有印啲其他writers寫嘅 但嗰啲睇得好辛苦 唔知佢寫乜<br />我就淨係睇哂prof寫嗰啲readings<br />其實睇哂全部readings都幾heavy 每份廿幾頁 <br />明嗰theory然後用日常知識答會更高分",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PiyPP9c8SpqUQi8ruIKUAvI5rwVQyicL",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "御前带瓜侍卫",
            "date": "Dec 24, 2018",
            "title": "",
            "comment_content": "Theories about modernisation and social development. Basically contains three parts:<br />1. Modernisation theory and dependency theory;<br />2. World-system analysis and globalisation;<br />3. Case study--East Asia development.<br />The concepts are abstract if you know little about social science, but I think the course provides a good insight into the society and the process of development.",
            "comment_teaching": "The powerpoint slide is very clear but professor's accent is sometimes confusing. <br />By the way Professor So is an expert in social science( he uses his own books as additional reading materials), and he is retiring next year. So please take the course in spring if you want to meet him.",
            "comment_grading": "Absolute grade.<br />Exam 1(60pts)+Exam 2(60pts)+ Final(80pts)+5 in-class quizzes(1pt for each)<br />In-class quizzes are actually attendance check because he will not tell you the exact dates of them.<br />180-200 = A; 160-179 = B; 140-159 = C; 120-139 = D; 119 &amp; less = F<br /><br />Time is limited in exams, and you need to develop logical essays in a very short time. I didn't even finish the last essay in the first exam, so I recommend not taking this course if you are not confident about your vocabulary and writing.",
            "comment_workload": "The workload is heavy if you are pursuing for A or A+. You need to read the ppt slides and additional reading materials, which will be around 15 pages of concepts and examples for each lecture. Some topics in exams will only appear in additional reading materials.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "g2Oadu9WCfEEI74yo5NkifJOIwwkVn4a",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "rei",
            "date": "Oct 16, 2018",
            "title": "very good grade if you put effort in it",
            "comment_content": "very easy if you have studied Chinese history before. It is more or less the same as the history lesson in Secondary school. Talks about Chinese society before 90 centuries and sometimes associate with Japan, Taiwan also. Overall not a very hard content",
            "comment_teaching": "Professor basically read out the powerpoint. He will capture and cite the examples which could be found in the readings. a little bit boring but still in a very clear organized structure. it is funny that seeing him drink one coca cola each lesson. I was very worried about him having diabetes or not.",
            "comment_grading": "if you put effort into it, you must have a good grade. Don't skip the quiz in class as I miss 2 of them and result in getting a B+ only. (suppose my midterm and final could help me get an A) basically, if you don't go to a lesson, you just memorize all the things on the powerpoint and finish all the reading. No sophisticated mind is needed as it prefers to memorize than analyze.",
            "comment_workload": "no assignments. only quiz for 5 times. and one midterm and final. it is the most easy and relax course i have in UST.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ssI7mxDbeJ216hp1nJDLP5oPCnIYUJFL",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Law~",
            "date": "Aug 22, 2018",
            "title": "滄海遺珠",
            "comment_content": "Very solid content. The lectures are based on a few key readings on different Modernization theories, including publications by Alvin, and significant theorists on dependency, world system theories. Students who enjoy studying sociology and history of modern East Asia (particularly after the WWII) will find the course content amazing and inspiring.",
            "comment_teaching": "Prof. Alvin So is a highly experienced and respectful scholar in HKUST. The teaching content in this course is solid, and he conducts lectures in a calm, professional way (he is an expert in modernization theories). Well, it is believed that Prof. So will leave HKUST very soon so it is better to take this course asap.<br /><br />The very minor issue of this course &amp; his teaching is that there were some difficult sociological terms being introduced along the lectures but the Prof. rarely explained them in details (i was okay with it since I did take some introductory &amp; advanced sociology in HKUST). Taking SOSC1850 before may be a plus in studying this course. If you haven't done any sociology courses before or you are not interested in this topic, you will suffer very hard immersing yourself in endlessly long reading materials.<br /><br />(P.S. We will all remember Prof. Alvin So enjoying his red can Coca-cola all the time :D)",
            "comment_grading": "Very Good Grading.<br /><br />There are three exams (in short + long essays format) in total for this course. The first 2 take place in lecture (60 marks each) and the last 1 will be conducted during Final Exam Period (80 marks). The teaching team will release exam topics and pick a few from the list. Therefore, you can complete all the reading materials and prepare the answers of questions before sitting the exam.<br /><br />Your efforts paid will be paid accordingly! Although absolute grading is adopted and the grading scheme seems quite tough, the teaching team grade the papers quite leniently that you can easily score a decent score. Exact wordings of definitions are usually not required -- The ability to demonstrate your understanding to knowledge &amp; critical thinking on the issues (well sociology is heavily based on critical theories) will secure you a safe A-Range.<br /><br />My grade = A+<br />I did pretty well in the first two exams, but experienced a minor slip in Final. I didn't expect I could get A+ but eventually did so. I personally guessed almost 50% of the class got A-range, and many B+ should have been given at the end. If you are interested in social science and wanted to get good grade (let's be realistic), 2780 is by far the best choice.",
            "comment_workload": "Fair Workload.<br /><br />No assignments, presentation or compulsory attendance (although 5 short and sudden bonus quizzes will be taken in classes). All you need is to study hard before the exam. You can search all the points to answer the questions in exams from the assigned reading materials, but the reading materials are so freaking long, and usually written in professional academic English.<br /><br />I usually spent 2 nights (overnight studies) to complete the revision of the course. The revisions were usually super painful. But again, the course provides you super solid knowledge over different streams of modernization theories &amp; super good grade. Just take this course if you are confident in your English command, intermediate Social Science and essay writing abilities :D",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9ZGF3JxKdq46DBigeU1lkM51t3JLQADQ",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Liu Yuen Chi",
            "date": "Aug 08, 2018",
            "title": "",
            "comment_content": "1 midterm, 1 final in the format of&nbsp;&nbsp;essay<br />List of questions will be provided beforehand and will be selected as those on the actual paper.<br /><br />Topics are divided into 3 main themes:<br />1. Basic intro to modernization, dependency and world system analysis",
            "comment_teaching": "Clear and detailed <br />Acceptable accent and pace.",
            "comment_grading": "Grading is fair.<br />As long as you prepare, you will get a good grade.",
            "comment_workload": "If you want to get A range, you have to read most of the readings so as to provide a more comprehensive answer in the exams.<br /><br />No project, no assignments,no attendance.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "sTi8h8lR6tSlS4dCbIr1m06DAFOgLpIE",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "HELLO:)",
            "date": "Sep 02, 2017",
            "title": "Nice course if you want to know more about world development",
            "comment_content": "The lecture can be divided into three parts. <br /><br />Part I studies theories of modernization and dependency and new dependent development theory. These concepts help explain why there are differences in development for the third world countries and developed countries. You can treat this part as a foundation.<br /><br />Part II studies the world-systems perspective and this is useful for explaining development project (1945-1970s) and the globalization project (the 1980s -the present).<br /><br />Part III is about the historical study of East Asia over the past two centuries.&nbsp;&nbsp;It covered the issues related to socialist revolution and post-socialist transformation in China, the rise of Japan, national reunification project etc.",
            "comment_teaching": "Professor So explains the concept very clearly and he is willing to answer your questions. He will give us some reading material and include some of them in the powerpoint.",
            "comment_grading": "There are in total three essay examinations. <br />60 points First examination<br />60 points Second examination<br />80 points Third examination<br />10 points 5-minute quiz (2 points each and a total of 5 quizzes)<br /><br />My score:<br />56/60+55.5/60+71.5/80<br />Absolute grading so you can work with your classmates to prepare the essay questions together.<br />Got A at last:)",
            "comment_workload": "You need to read one chapter of the book for one lecture in order to have more examples to write the essay. Also, when you read those required reading, you can have a deeper understanding in the lecture.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "VpoSfP2fC85EVt4KkS0fzMVfSdFqfpyr",
            "semester": "2016-17 Spring",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "MLDL",
            "date": "Jun 03, 2017",
            "title": "",
            "comment_content": "(I) Modernization and Dependency<br /><br />#1\tIntroduction to sosc 2780 and\t\t&nbsp;&nbsp;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Modernization<br /><br />Modernization Theories<br />#2\tModernization-Social/Psychological\t&nbsp;&nbsp;&nbsp;<br />#3\tModernization-Political/Eco\t\t&nbsp;&nbsp;&nbsp;So: Ch 3 #4\tAcademic critique of Modernization theory\t\t\t#5\tNew Modernization school\t\t&nbsp;&nbsp;&nbsp;So: Ch 4<br /><br />Dependency Theories<br />#6\tDependency-Colonialism\t\t\t&nbsp;&nbsp;<br />#7\tNew dependency theory &amp; review session&nbsp;&nbsp;&nbsp;&nbsp;<br /><br />(II) World-Systems Analysis and the Globalization Project<br /><br />World-Systems Analysis and the Development Project<br />#8&nbsp;&nbsp;&nbsp;&nbsp;The World-Systems Analysis\t<br /> #9&nbsp;&nbsp;&nbsp;&nbsp;Developmt Project:Emergence/unravel<br />\t&nbsp;&nbsp;<br />The Globalization Project<br />#10&nbsp;&nbsp;Global Project: Emergence (Deindust &amp; Reindustrialization)\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />#11&nbsp;&nbsp;Globalization: economic dimension\t<br />#12&nbsp;&nbsp;Globalization: political dimension\t<br />#13&nbsp;&nbsp;Globalization: cultural dimension<br />#14&nbsp;&nbsp;Globalization: flexible employment<br />\t<br /> (III) East Asia<br />Theories and History<br />#15\tTheories of East Asian development\t<br />#16\tIncorporation of China &amp; Japan\t<br />#17\tChina - Socialist Withdrawal &amp; re-entry\t<br />#18\tChina - State Neo-Liberalism &amp; the rise of China\t <br />#19\tJapan Rise to the core\t<br />#20\tHong Kong become a NIE\t<br /><br />National&nbsp;&nbsp;Reunification of China<br />#21\t Impact on Mainland\t\t<br />#22\t Impact on Taiwan<br />#23\tImpact on Hong Kong",
            "comment_teaching": "Professor ge 英文未去到native,但係絕當聽得明佢講咩",
            "comment_grading": "Absolute Grade<br /><br />Take three essay exams. First exam (60 points), Second Exam (60 points), Final Exam (80 points) with a total of 200 points. <br />Grades: 180-200 = A; 160-179 = B; 140-159 = C; 120-139 = D; 119 &amp; less = F<br /><br />Yes, You Can Earn Extra-Credit by taking a 5-minute Quiz!<br /><br />The quizzes will be given at the end of the class period ( around2.45 p.m.). You will have around five minutes to answer an essay question drawn from the lecture materials in that class.<br /><br />I haven’t decided on which dates to give out these quizzes.&nbsp;&nbsp;This extra-credit quiz is aimed to discourage you from skipping too many classes.<br /> <br />The grading of the extra-credit exams is as follows: Good or Excellent = 2 point. Average = 1 point. Poor or if you fail to show up to answer the quiz = 0 point. Up to 5 quizzes will be given, enable you to earn a max of 10 points.<br /><br /><br />I got an &quot;A&quot;<br />1 st exam: 54/60<br />2 nd exam: 51.5/60<br />3 rd exam: 68/80<br />Bonus: 10/10<br />Total: 183.5 --&gt; A",
            "comment_workload": "背reading 夠拎A",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "uMtMppRaFnEZcxwFJ6bwXjYJPlYxM3bG",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "papabubble",
            "date": "Jan 08, 2016",
            "title": "",
            "comment_content": "Divided into three parts, social movement, modernization and globalization. It talk about theory of these three parts and give examples show how the world looks like now.",
            "comment_teaching": "Prof is kind and helpful. He reply emails really fast.<br />It might a bit boring if you don't like the topics covered.",
            "comment_grading": "Pop-up quizzes for bonus mark, Prof will tell you when to quiz in advance, most students get full mark.<br />2 midterms and 1 final with similar format, 50 marks in for each exam.<br />Absolute grading for the final grade.",
            "comment_workload": "No assignment and project but many reading materials which are books written by prof himself. Actually the reading content are mostly cover in the lecture.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "xMlQOUB2StQAEt6Vju3TLOGanUJUyZEp",
            "semester": "2012-13 Fall",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mlmlml",
            "date": "Dec 26, 2015",
            "title": "",
            "comment_content": "The course covers a lot of topics and is a bit difficult for those who did not have any social science or history background.",
            "comment_teaching": "Good professor and willing to answer students' questions.&nbsp;&nbsp;Classes may be a bit boring if you are not interested in the course or do not understand it.",
            "comment_grading": "3 exams including final exam and the exams are non-cumulative.&nbsp;&nbsp;The format is explaining key concepts (you can write anything related to that concepts) and 3 long questions.&nbsp;&nbsp;Professor will provide a list of key concepts and 6 long questions (exactly the same) one lesson before exam, so that you can prepare the questions before exams.<br /><br />Absolute grading, so students can easily track which grade they can get or set target for themselves<br />Professor did not take attendance but there are in total 5 short quiz during lectures, which provide chance to earn extra credits.&nbsp;&nbsp;Quiz is open-note and based on which he taught during lecture.",
            "comment_workload": "No assignments, no tutorials but a lot of reading materials.&nbsp;&nbsp;Reading the additional readings help you get a better grade (A range).",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Pg2nOwQhJDUk9rdbkIYE1WKNP5KoDjfa",
            "semester": "2014-15 Fall",
            "instructors": [
                {
                    "id": 663,
                    "name": "SO, Alvin Yiu-cheong",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "xxxxx5",
            "date": "Sep 03, 2015",
            "title": "Modernization and Social Change",
            "comment_content": "This courses explains the history between countries that lead to the political and economical situation nowadays. There is a lot of background information provided",
            "comment_teaching": "The professor is friendly and funny. The speech is lively.",
            "comment_grading": "most of the students got an A, the reminding got B, only very very few or even none of them got C or below. As the grading system of this course is absolute grading .",
            "comment_workload": "However, there are quiet a lot readings, the recommended reading materials are the books written by the professor, so he will upload the e-version for students. Although there is no attendance taking, the things being told during class are extremely important that will be very likely to appear in the exam.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}