{
    "error": false,
    "course": {
        "id": 1577,
        "subject": "SUST",
        "code": "1000",
        "name": "Sustainability Fundamentals",
        "description": "This course provides students with an interdisciplinary perspective in comprehending the challenging issues on human sustainability on the limited planet earth. It also provides an overarching framework covering economic development, individual lifestyle and policies to deal with global, regional and local emerging issues to provide students with a good foundation for their sustainability related majors and minors.",
        "categories": [
            "Common Core (SSC-SA)",
            "Common Core (SSC-S&T)",
            "Common Core (SA)",
            "Common Core (S&T)"
        ],
        "website": null,
        "credits": 3,
        "semesters": [
            2230,
            2210,
            2130,
            2110,
            2030,
            2010,
            1930,
            1910,
            1830,
            1810,
            1730,
            1710,
            1630,
            1610
        ],
        "prerequisites": "",
        "corequisites": "",
        "exclusions": "CORE 1940",
        "rating_content": 3.98,
        "rating_teaching": 3.98,
        "rating_grading": 3.88,
        "rating_workload": 3.36,
        "review_count": 81,
        "single_review": false,
        "enrollment_status": 0,
        "is_favourited": false,
        "is_subscribed": false,
        "user_review_hash": "",
        "contributor_has_more": false,
        "instructors": [
            {
                "id": 1402,
                "name": "STEUER, Benjamin",
                "count": 14
            },
            {
                "id": 215,
                "name": "LAU, Pui Sang",
                "count": 13
            },
            {
                "id": 978,
                "name": "SAUERWEIN, Meike",
                "count": 13
            },
            {
                "id": 1214,
                "name": "LU, Zhongming",
                "count": 13
            },
            {
                "id": 1242,
                "name": "SHI, Xiaoming",
                "count": 7
            },
            {
                "id": 908,
                "name": "MOLE, David Stewart",
                "count": 4
            },
            {
                "id": 1401,
                "name": "DELINA, Laurence Laurencio",
                "count": 4
            },
            {
                "id": 223,
                "name": "FORSTER, Paul Whitfield",
                "count": 3
            },
            {
                "id": 78,
                "name": "LAU, Alexis Kai Hon",
                "count": 2
            },
            {
                "id": 230,
                "name": "CHAN, Kit Yu Karen",
                "count": 1
            },
            {
                "id": 640,
                "name": "LOY, Michael Ming-tak",
                "count": 1
            },
            {
                "id": 761,
                "name": "BOOKHART, Davis Boyd",
                "count": 1
            },
            {
                "id": 1584,
                "name": "DELINA, Laurence L.",
                "count": 1
            }
        ]
    },
    "reviews": [
        {
            "hash": "Tdsje150I4PwMe8n9Cddv995hylc4vrI",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1214,
                    "name": "LU, Zhongming",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "dawns",
            "date": "Dec 28, 2020",
            "title": "The professor is retarded",
            "comment_content": "The content is normal. quite interesting for someone who concerns about the environment.",
            "comment_teaching": "A lot of group discussion. A hell for introverts.",
            "comment_grading": "The professor has some problems with his brain. I said we should have more subsidies for certain things and he said there are already subsidies for it. I KNOW SO I SAID MORE. DOES HE NOT UNDERSTAND THE DIFFERENCE BETWEEN HAVE AND HAVE MORE? And he cannot read a simple graph. He should be studying primary school and learn how to read graphs again. Also, I copied some paragraphs from his notes and he said he don't know what I was talking about. Does that mean he doesn't understand his notes? I explained why the issue would happen in the first sentence of the paragraph and he asked me why the issue would happen in the last sentence of the paragraph. DOES HE HAVE GOLDFISH MEMORY? The TAs are also retarded. Don't know how to read a graph with only a few lines.",
            "comment_workload": "2 group reports and 1 group presentation. 1 final essay. 1 midterm exam but no final exam.<br /><br />Btw if you do not have good teammates it's over. There were two freeriders in my group and they almost did nothing. The other two groupmates and I did 5 people's work with 3 people.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 1,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 24,
            "vote_count": 28,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "DTZYWEqwZhNhJ0JdacoUH0Yue3GwwBlS",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 978,
                    "name": "SAUERWEIN, Meike",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LIFEGOOD",
            "date": "Jun 05, 2022",
            "title": "a retarded course",
            "comment_content": "easy contents, but ridiculously hard to get good grades<br />Hard work DOEST NOT pay off",
            "comment_teaching": "9am lectures and 3 hours long.<br />Teaching assignment itself is already retarded. I mean, who the fuck will be paying attention? <br />There will be a lot of discussions, so need to be awake. <br /><br />Teaching is sometimes too boring, and not straight to the point. Professor talks too much. Her teaching makes me wanna go sleep. <br />TA never answer email. Retarded Teaching staff.",
            "comment_grading": "Ridiculous (Fucked up) grading.<br />Your final grade will largely depend on your midterm grade. <br />If you fuck up your midterm, you will fuck up your final letter grade.<br />For group work, the mean is high, with very low SD. The mean was 9/10 and the min and the high are 8.8 and 9.2 respectively. Then why the fuck bother to grade them? just change it to P/F.<br /><br />We worked so hard for the group poster and presentation, but we got below mean. Hard work does not pay off for this course. Do not take this course if you want to aim for high grades. I find this course really retarded, and professor and TA are not helpful at all. A lot of group discussions, and Professor is also kind of retarded. There was a free-rider in my group as well, and she did not act anything about this. TA never answer my email. Retarded TA. <br /><br />I assume there must be using ridiculous mark scheme when grading mid-term and posters. I will recommend you NOT to take this course, if you are a hard working person, as the grade will not reflect on how hard you work.<br /><br />Also, I have never seen teaching staff as lazy as this one. They PROMISED to release mid-term grade at least 2 weeks after the midterm examination. However, can you guess when they release grade? Fucking at early JUNE. (At least 2 weeks after exam? wtf?, then why the fuck you promise?). Can you imagine receiving midterm grade AFTER the end of semester? I have no words to say. To professor or TA if you are reading this, you should do something about this in the future. Keep your words !",
            "comment_workload": "Not very much work load, just group poster and many discussions.<br /><br />I emphasize again. Hard work does not pay off. So if you have to take this course, then don't work hard. You will not get around mean marks anyway. Just try your best in midterms. The most retarded course I have ever took in UST. Retarded professor, retarded TA, and retarded course.",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 8,
            "vote_count": 8,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "vCTEi87zLO5nRhQoImfykQzxFBy0hJLN",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 215,
                    "name": "LAU, Pui Sang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "bj",
            "date": "Jun 11, 2020",
            "title": "Good grade course but syllabus and workload may be tough.",
            "comment_content": "As this is a SCC-S&amp;T course, I think this course is best for those who have a weak science background. The syllabus mainly surrounds existing environmental issues and possible solution to these pressing problems. Peeps who took LS in DSE and Geography in IB should find this course interesting.<br />Be aware that we have a three hour lecture weekly, so the content is quite lengthy. The midterm is tested on the first half of the syllabus, so essentially you only have to pay attention in class for the lectures up until the midterm.",
            "comment_teaching": "Prof. Lau is a really passionate and kind professor. He is really down to earth with his students, as he likes to begin our lectures by asking how we are doing individually. <br />Teaching wise, he has a very fluent Konglish accent which is clear. Despite his quality teaching, it is still very difficult to stay engaged in a three hour online lecture.<br />He also likes to incorporate fun and educational activities in our classes, which to some may seem annoying and childish. But personally, I think it's good because it allows me to take a break from the lecture.<br />As said, he is a very kind person and he would be happy to listen if you have any questions or feedback for him.",
            "comment_grading": "Our grade is determined by our midterm, group assignments, group project and a reflection essay. The midterm was a bit difficult as we had to answer a few essay questions under limited time, but I think the difficulty is fair if you revised enough. The group assignment and project are also very important, so be sure to find yourself with group teammates.<br />My midterm and reflection essay were above mean, and I got A range at last.",
            "comment_workload": "Workload may be heavy, depending on your teammates. After each lecture, we are given a group assignment to do which is usually due one or two days afterwards. Those assignments require research which may take up an hour or two of your day.<br />Aside from that, the final group project can also be quite intense, once again depending on your teammates. We had to propose a solution to solve a given country's probelms and we had to present it in form of a video. It was not an easy task, but it could be a lot worse if I had free-riding teammates.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "f3xP1Ne9FmsUd5KGBbxjhUZw1gABmYOX",
            "semester": "2017-18 Spring",
            "instructors": [],
            "is_author": false,
            "author": "cherrytsui26",
            "date": "Aug 21, 2018",
            "title": "Not suitable for year 1",
            "comment_content": "Content and topic covers widely <br />That’s why there are so many tutors are teaching in the course <br />Need to learn everything related to sustainability",
            "comment_teaching": "Quite a lot class activities, discussion,presentations <br />Not really focus on PowerPoint material <br />Before class revision required otherwise it is hard to understand the topic and fail the in-class quizzes",
            "comment_grading": "No exam <br />Online tests, group project and reflection paper<br />A bit difficult for year 1 students who haven’t studied relative envn course before",
            "comment_workload": "Not really heavy workload <br />But actively involved in class and do well in every quiz and assignment are needed if you want to get a good grade",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 3,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "F0R61KhgRVfTyaZ49KNG8Hl8bzMzTKOn",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "youth222",
            "date": "Jan 04, 2022",
            "title": "Demanding but rubbish course",
            "comment_content": "Simply asking: WTF is this???<br /><br />A water-blowing course, just like HKDSE LS.",
            "comment_teaching": "I am tired of those primary-school-like in-class activities.<br />Going to the toilet to calculate the water flow of the taps..... WTF?????<br />I still remember we are required to play a board game for the whole lesson to &quot;study&quot; the class concept.......<br /><br />C'mon, we are already at least 20 yo.",
            "comment_grading": "Despite the course is a trash, the grading is reasonable",
            "comment_workload": "Forcing students to be deadline fighters....<br />For all the stages of the projects, they release the detail 5-6 days beforehand. And then, you still need to arrange meetings with your groupmates... which totally drives people crazy.<br /><br />I think the main grading component of the poster is the design part.... better to change this course code to be DESIGN1000. No matter how trashy the content is, you can still get a satisfactory score if your poster is fancy enough. <br />Why do I say this? If you can really give some concrete and feasible solutions the regions regarding the sustainability issues, you should be working for the region's environmental department but not blowing water in this course.",
            "rating_content": 1,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "N2yRjMGUE5BQiaKN0MgwTS3OdevNkCxL",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1214,
                    "name": "LU, Zhongming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "kobeyip",
            "date": "Jan 31, 2023",
            "title": "rubbish course",
            "comment_content": "the lesson is boring, but the knowledge about environmental sustainability is quite useful, we can know more about the environment and what problems different countries is facing",
            "comment_teaching": "the professor just read out the powerpoint accordingly, so is really boring and sleepy",
            "comment_grading": "I do not get a high mark in all the marking, but I still got a C- at the end, I think it's quite ok",
            "comment_workload": "have a group project, which are required to hand in 2 reports and 1 poster, it costs lots of time which is more equal to a 3-credit course",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "12G6LlJwelehtN9x7VPQwNzU8n6wO8do",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "goddamnit",
            "date": "Jan 29, 2023",
            "title": "",
            "comment_content": "The contents and concepts are not difficult, especially if you have studied geography in high schools.<br /><br />L1 - Introduction<br />L2 - Anthropogenic Impact on Natural Systems<br />L3 - Planetary Boundaries<br />L4 - Human Thriving<br />L5 - Policy<br />L6 - Sustainable Development<br />L7 - Energy<br />L8 - Fresh Water<br />L9 - Design for a Circular Economy<br />L10 - Sustainable Consumption<br />L11 - Futures Thinking<br />L12- Poster presentation and sharing",
            "comment_teaching": "Benjamin is a really nice professor, but there are lots of discussions and group activities throughout the course. So if you are an introvert, rip. (Just kidding, its not that bad actually",
            "comment_grading": "Quite good for me. <br />All of my scores are above mean, except for the god damn poster, and get a B+ eventually.<br /><br />Mid-term Exam (30%) <br /><br />Group project (35%) <br />Including two group reports and poster presentation<br /><br />Mini quizzes (15%) <br />5 mini quizzes but only the best 3 will be counted<br /><br />Written Essay (10%) <br /><br />Class attendance and participation (10%)",
            "comment_workload": "A bit high.<br /><br />Mid term: The lecture ppt are 90% useless, you don't need to study very hard. It's just bullshitting for the whole time. <br /><br />Project: If you have good teammates, then the workload is okay. But the reports and the posters are really stupid.<br /><br />Mini quiz: Fuck the mini quizzes, you only have three minutes to answer three multiple choice questions that are very long and have many choices. Some even have two correct ans. Even though you can open book, but its really hard for you to find the ans in the 70 pages slides within the time limit.<br /><br />Essay: Like mid term, bullshitting is enough",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "86vacwH1V2InyznreqJMMaoj8pB8rBMo",
            "semester": "2018-19 Spring",
            "instructors": [],
            "is_author": false,
            "author": "Annana",
            "date": "Aug 26, 2021",
            "title": "Introduction to Sustainability",
            "comment_content": "Part A (Weeks 1 to 5) –the main features of the challenge of sustainability will be covered, including the principal impacts of human activity on the global environment and the options for managing these challenges. Students’ understanding of the issues covered in Part A will be tested in a mid-term exam.<br /><br />Part B (Weeks 6 to 12) –possible and preferred futures for human thriving within planetary boundaries will be explored.",
            "comment_teaching": "The prof is good, very friendly, down-to-earth and interesting,",
            "comment_grading": "Pretty good grade.<br /><br />Mid-term Exam (35%) - like DSE exam, questions include definition of some terms, feasibility and effectiveness analysis long question etc. <br />Group project (40%)<br />Reflection paper (15%)<br />Class attendance and participation (10%)",
            "comment_workload": "Not too many workload, the final group project is to make a which present the key sustainability challenges and possible solutions for a selected region.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aHkVDnKwjfoymQX3HHYzLtTXHgLmka2A",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Leoli0619",
            "date": "Aug 24, 2021",
            "title": "Grading is fine for introverts",
            "comment_content": "Since it only has one lecture per week, the lectures notes are quite long. But it is quite easy to understand.",
            "comment_teaching": "Benjamin delivers the ideas clearly and talks in a funny way. Most of the notes are important.",
            "comment_grading": "The grading of it is acceptable. The outgoing people who talk a lot and answer professors' questions have extra marks. <br />However, even the introverts (me) who didn't speak still gets B range.",
            "comment_workload": "Each lecture is too long. I could barely concentrate during the lectures.<br />Need to read one reading material before each lecture, so I think the workload is adequate.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "1GI2AJdhQgOB903SZfB1h99B9IVkfppI",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1214,
                    "name": "LU, Zhongming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Rsternyin",
            "date": "Dec 30, 2020",
            "title": "",
            "comment_content": "Environmental protection and sustainability thing<br />1. Introduction<br />2. Anthropogenic impact on natural systems<br />3. Planetary boundaries <br />4. Human thriving <br />5. Policy<br />6. Sustainable development <br /><br />7. Energy futures<br />8. Futures for fresh water<br />9. Design for a circular economy<br />10. Sustainable consumption<br />11. Futures thinking",
            "comment_teaching": "Strong mainland accent, quite a lot of examples used in class and try to make it interesting. <br />Usually half of lecture for materials and half for in-class activities, so won't be too boring.<br />However, you need to turn on your camera in class for participation, and the lecture is 3 hours. Sitting in front of the camera for 3 hours is horrible.",
            "comment_grading": "Fair grading with weird comments on your reports and essay<br /><br />Midterm: 35%<br />Syllabus covering ch1-6, just as same as writing LS paper under sustainability module<br />Me: 35/35 (FYI my LS is 5*)<br /><br />Mini quizzes: 15%<br />5 in-class quizzes for each chapter (ch6-10), picking the highest 3<br />Me: 5/5, 5/5, 4/5<br /><br />Group project: 25% <br />(Interim report x2, 5% each; <br />poster with presentation 10%; <br />peer review 5%)<br />The comments and grading are weird. Make sure you follow the instruction given line by line and explain like they are idiots, cuz they will comment on something that you have explained as still ask you why and what.<br />For poster, they either comment your poster with too many information, or saying not enough information, so add oil guys<br />Me: 4.9/5 (Mean:4.5) , 3.2/5 (Mean 3.8) , 6.6/10 (Mean 7.9), 5/5<br /> <br />Essay: 15%<br />Again, weird comment. If you have mentioned something in the beginning of the paragraph, explained everything, and mention again in the end of the paragraph, they gonna ask you why that thing, and treating all your explanation as nothing.<br />And make sure your suggestions are practical and effective in their eyes, saying things like education and economic incentives (which are what prof taught in class) will be challenged and saying &quot;can they solve the problem?&quot; lol. Then why are you teaching these in class.<br />Me: 11/15 (Mean: 11.5)<br /><br />Class attendance and participation: 10%<br />I participated in all in-class exercises, turned on camera every lecture, and actively participated in class<br /><br />Final grade: A-",
            "comment_workload": "Not too heavy<br />Two interim reports with 1500 words each<br />A A1 poster<br />A 8 min present <br />All shared among your group members, so not heavy if you start early enough<br /><br />A 800-word essay<br />easy to manage",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fOaYeKFv9LPBACZrKpJgnEVDfug1IbtW",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1401,
                    "name": "DELINA, Laurence Laurencio",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hongjj",
            "date": "Jun 11, 2020",
            "title": "DSE LS + Geog, and a hell for introvert",
            "comment_content": "Typical liberal studies stuff together with some geography concept. You know, social, economy, and environment these kinds of stuff. <br /><br />1. Introduction<br />2. Anthropogenic (human) impact on natural systems<br />3. Planetary boundaries and Earth systems<br />4. Human thriving within planetary boundaries<br />5. Policy approaches for sustainability<br /><br />(1-5 is midterm material)<br /><br />6. Sustainable development and sustainable communities<br />7. Energy futures<br />8. Futures for fresh water<br />9. Design for a circular economy<br />10. Sustainable consumption<br />11. Futures thinking",
            "comment_teaching": "THIS COURSE IS A HELL FOR INTROVERT LIKE ME. IN-CLASS ACTIVITIES EVERY FREAKING LESSON AND THERE IS A NEED TO DISCUSS THEM WITH YOUR GROUPMATE AND DO PRESENTATION TO THE WHOLE CLASS AFTERWARDS.<br /><br />The online learning is just making things way more awkward as no one will speak until the breakout room session is almost over.<br /><br />I can't really comment on Laurence, I didn't listen to him at all when he is presenting lol. he just read out from the ppt. but I do feel his passion in sustainability and his trying his best to give as many feedback as possible.<br /><br />TA Christine is so nice and helpful, trying her best to help students in need.",
            "comment_grading": "Fair and transparent<br />35% midterm<br />15% group worksheet (do 4 count best 3)<br />15% group video <br />10% Peer Evaluation <br />15% reflection paper<br />10% participation<br /><br />but seriously everyone got nearly the same score. I think the only way to get an A in the class is do well in midterm. since everyone got the same marks in all different grade component and the range is so small.<br /><br />FYI mean for each:<br />midterm 24.5/35<br />group worksheet 4.7-4.8/5 <br />group video + Peer evaluation 19.1/25<br />reflection paper 12.1/15<br />participation 7.4/10<br /><br />everything above mean (1-2 marks), midterm 33/35. eventually got an A<br /><br />midterm is easy as long as you have geography knowledge and LS thinking, put them together with some term taught in the ppt then will get full mark",
            "comment_workload": "it is said in the syllabus that you have to read the powerpoint slides before going to lesson. I don't find the need to do so. every in-class activities is just common sense and making reasonable judgement. little to no ppt material is needed when doing those in-class activity.<br /><br />I think the main workload comes from the group project. so after midterm you will be busier. in week 6-9 you have to finish a worksheet (which you find data and statistics and provide analysis and elaboration) with your group mate. <br /><br />and in week 11 you have to submit a 10min video discussing the sustainability issues in your assigned country.<br /><br />if your group have freeriders then sure you will have higher workload.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 3,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "EgsCnJzLTa9KrFSO5HGzJktER3El88Tu",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1401,
                    "name": "DELINA, Laurence Laurencio",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "ci_5z2",
            "date": "Jun 10, 2020",
            "title": "Bad professor",
            "comment_content": "Midterm Part:<br />L1: Introduction<br />L2: Anthropogenic Impacts on Natural System<br />L3: Planetary Boundaries<br />L4: Humans Thriving<br />L5: Policy<br />L6: Sustainable Development<br />---------------------------------------------<br />Part 2:<br />L7: Energy Future<br />L8: Future For Water<br />L9: Circular Economy<br />L10: Sustainable Consumption<br />L11: Future Thinking<br /><br />L12: Video presentation",
            "comment_teaching": "Lesson flow: 1hr lecture + 1.5hr activities<br />His lectures are rubbish, he just read through the slides word by word without adding any new things. All you need is read through the pre-lesson slides and you can get all you want.<br />The activities are interactive, but his instructions are often unclear, especially for the flow of group discussion and the following activities.<br />However, the TA Christine is very helpful and she is willing and able to answer all our requests clearly and comprehensively.<br />E for professor and A for TA.",
            "comment_grading": "Midterm exam: 35%<br />Mean: 24.5/35&nbsp;&nbsp;&nbsp;&nbsp;Me: 32/35<br />Worksheets: 15% (Highest 3 out of 4)<br />Mean for all WS are above 4.5&nbsp;&nbsp;Me: 4.9/5,4.9/5 and 4.6/5<br />Presentation and Peer Review: 25%<br />Mean: 19.1/25&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Me: 20.25/25<br />Reflection paper: 15%<br />Mean: 12.1/15&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Me: 12/15<br />Class attendance and participation: 10%<br />Mean: 7.4/10&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Me: 7.3/10<br />Overall Mean: 77.4 (B)&nbsp;&nbsp;&nbsp;&nbsp;Me: 85.95 (A-)<br />Since this is a course adopting absolute grading policy, getting mean score overall will get you a B. <br />B: &gt;=76<br />B+: &gt;=80<br />A-: &gt;=84<br />A: &gt;=88",
            "comment_workload": "Midterm: Just revise days before and get a big picture of the first-half of the course, since all are short questions and they require your understanding of concepts and some recitations on definitions, you need to prepare. As this is the only assessment that has varied grading, do your best and you can secure a B+ or above.<br />Worksheets: Work with group members in the group project, the better you do, the more preparation you can get for your project.<br />Present and Peer: Just a 10-min video about sustainability issue and SDG goals in a country, easy to do if no free-riders in your group and you have done well in the worksheets<br />Reflection Paper: Just an 800-word essay explaining what you have learnt from the lectures. Probably spend you within an hour.<br />Class attendance and parti: 5% attendance and 5% participation, I don't know how it counts as lessons are conducted online.",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ee7ZL1tUZfyPsEupvQEPYKWHZQsYIkFF",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wilhelm_aye",
            "date": "Jun 09, 2020",
            "title": "",
            "comment_content": "Part 1:<br />L1: Introduction<br />L2: Anthropogenic impact on natural system<br />L3: Planetary boundary<br />L4: Human thriving<br />L5: Policy<br />L6: Sustainable development<br />---------------------------------------------<br />Part 2:<br />L7: Energy future<br />L8: Future for water<br />L9: Circular economy<br />L10: Sustainable consumption<br />L11: Future thinking<br /><br />L12: Video presentation<br /><br />Contents in part 1 are included in the midterm exam.<br />Although there is no final exam for part 2, you still need to understand the concepts as they will be used in other assessments.",
            "comment_teaching": "A 3-hour lecture every week, usually started by talking about ideas in different topics and in the later half of the lesson there would be some activities and games.<br /><br />Lectures are very interactive and participation is needed.<br /><br />Benjamin was able to deliver the ideas clearly with further explanation.<br /><br />At the start of the semester, you will be invited to join the lesson even though you are still on the waitlist (around top 20, I was at 18 and still managed to enroll in it). If you are waitlisted, remember to attend the lectures so you would not miss out on the contents.",
            "comment_grading": "Midterm exam: 35%<br />&nbsp;&nbsp;&nbsp;&nbsp;&gt;30.25/35<br />Group project: 40%<br />&nbsp;&nbsp;&nbsp;&nbsp;&gt;3 worksheets out of 4 with highest mark would be calculated<br />&nbsp;&nbsp;&nbsp;&nbsp;&gt;4.75/5, 4.3/5, 4.3/5<br />&nbsp;&nbsp;&nbsp;&nbsp;&gt;Video presentation &amp; peer review 21.5/25<br />Reflection paper: 15%<br />&nbsp;&nbsp;&nbsp;&nbsp;&gt;14/15<br />Class attendance and participation: 10%<br />&nbsp;&nbsp;&nbsp;&nbsp;&gt;8/10<br /><br />Grade: A-",
            "comment_workload": "For every lessons there would be reading material that on average is around 70 pages of powerpoint slides. It takes at least 1 hour to finish reviewing them and they are mostly the same as those to be discussed in lesson.<br /><br />There are also additional sources that you can read if you are interested (I didnt do so).<br /><br />For L6 to L9, there will be a worksheet every week to be finished together with your groupmates. They are usually handed in within 24 hours of the end of the lecture, and some time is provided near the end of the lesson for you to discuss with your groupmates.<br /><br />These worksheets are in preparation for the final video project in which a random country would be assigned to your group and you will have to discuss the sustainability issues in said country. In L12 you will take turn to comment on 2 other groups' video as well as being asked a few questions by the instructors, so be prepared for that by remembering some related information that you are responsible for in the video.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "aHxkDfnJ4dNtNH3DFYxKTrASxrG9sHIr",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 908,
                    "name": "MOLE, David Stewart",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "VLi",
            "date": "Jun 23, 2018",
            "title": "Register if you want a B",
            "comment_content": "Mainly about learning to protect the environment. As a business student, it was only interesting to me was when the professor talked about how businesses can be conducted in a more sustainable manner. Real life examples are listed and some interactive and awkward exercises are conducted in class every once in a while. The content is broad, yet it sacrifices depth and it is very confusing for most students. Yet as this is a new course, it is conducted differently every semester, so please anticipate change when you register.",
            "comment_teaching": "To be frank, it's really boring unless you're all about conserving the environment. The class is conducted in an awkward manner. Don't expect much from the class; learn more via pre-assigned materials every week before class if you really want to learn. <br />Every class is 3 hours and around 1.5 hours into the class you get a tea break; the professor puts out bowls of snacks and fruits for the class to eat, which after that half of the class leaves.<br />The teaching can really be improved.<br />Attached are a few of the slides for students to read before class, which everyweek there is a new set of slides to read on and be tested on.",
            "comment_grading": "The grading system is like communism; some people work very hard for this course, some just chill and both of these people get a B range score. As the professor said, this course is graded with the absolute grading system, not relative or curve-based. Don't expect too much even though you work very hard, because if the content of your assignment does not align with the professor's views, you won't get a high score. Please take note that professor David mole studied his BA in Economics in Cambridge UK, so don't take him lightly. The bright side is, he is very generous with giving out Bs.",
            "comment_workload": "In comparison to the other courses in HKUST, this course has a rather light workload. Once in a while, there will be an important assignment; which for my course, it was 5 in-class quizzes (25%), 2 reflection papers (each paper requires about 800 words), a group project which only requires you to present in less than 2 minutes.<br />No attendance needed. Grading doesn't matter if you're active or not. No mid-terms, No finals. Just don't be too lazy and submit your assignments on time.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "TXl7xQqRRGasbvRmL2DeBVCtgbRsnDaR",
                    "name": "00 Human Thriving (Online)",
                    "format": "pptx"
                },
                {
                    "key": "9qWYdzejz1swKRTnUFY90pN0QxMEWpzw",
                    "name": "00 Urban Futures (online)",
                    "format": "pptx"
                },
                {
                    "key": "2JVPxSdaF3ALKuMS0mKOEPgYzWJagQFZ",
                    "name": "00 Policy (Online Materials)",
                    "format": "pptx"
                }
            ]
        },
        {
            "hash": "l2TKqiMTFX6FK8vgRCEZASvlT9pECyPX",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 215,
                    "name": "LAU, Pui Sang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Boy193",
            "date": "Jun 16, 2023",
            "title": "",
            "comment_content": "-Not very hard to understand <br />-but need to review different online materials in the <br />&nbsp;&nbsp;course during the project<br />-No final exam <br />-The lectures are required the attendence<br />L1 - Introduction<br />L2 - Anthropogenic Impact on Natural Systems<br />L3 - Planetary Boundaries<br />L4 - Human Thriving<br />L5 - Policy<br />L6 - Sustainable Development<br />L7 - Energy<br />L8 - Fresh Water<br />L9 - Design for a Circular Economy<br />L10 - Sustainable Consumption<br />L11 - Futures Thinking<br />L12- Poster presentation and sharing<br /><br />Part A (Weeks 1 to 5) –the main features of the challenge of sustainability will be covered, including the principal impacts of human activity on the global environment and the options for managing these challenges. Students’ understanding of the issues covered in Part A will be tested in a mid-term exam.<br /><br />Part B (Weeks 6 to 12) –possible and preferred futures for human thriving within planetary boundaries will be explored.",
            "comment_teaching": "-3 Hrs lecture <br />-Some lectures quite interesting can play cardboard games<br />-but some of them only study online or course materials",
            "comment_grading": "-Hard to have a higher score <br />but easy to pass<br />-Suitable for the students only aim B or C <br />Mid-term Exam (30%)<br /><br />Group project (35%)<br />Including two group reports and poster presentation<br /><br />Mini quizzes (15%)<br />5 mini quizzes but only the best 3 will be counted<br /><br />Written Essay (10%)<br /><br />Class attendance and participation (10%)",
            "comment_workload": "-Very depend on groupmates <br />-Need to find good groupmates in your team<br />-The project need to do the report about study different developing countries or places sustainable development",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6YCSf5E4zH6NJC8aBuXgdx1ulU1JAAKc",
            "semester": "2021-22 Fall",
            "instructors": [],
            "is_author": false,
            "author": "hjswift",
            "date": "Jan 23, 2023",
            "title": "",
            "comment_content": "Interesting Content, even if you have little to no experience in this field",
            "comment_teaching": "Teaching is very boring and do not have to listen even for midterm or presentation",
            "comment_grading": "Very good grading as long as your english ability is above average.<br /><br />Midterm, Presentation, Attendance, 5/6 Mini-Quizzes",
            "comment_workload": "Workload was high as it required you to do pre-reading for each lesson in order to score highly in the quiz. Other than this, there weren't many assignments but the pre-reading length is quite long and is often necessary as the Search and Replace function on the powerpoints often do not work.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "eP4efYgc9Cd480i2mKyicxPBuyZhmu6G",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 978,
                    "name": "SAUERWEIN, Meike",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Hayoha",
            "date": "Dec 30, 2022",
            "title": "",
            "comment_content": "Sustainability<br />Environment<br /><br />You probably have learnt the basic concepts in secondary school/ primary school. But this course will discuss more in-dept with technical terms and newest research.",
            "comment_teaching": "Meike is super super super nice professor. She explained all concepts well with good examples and there are activities during lectures so even 3 hours class on Zoom but I did not fall asleep. Short videos are played too. LOOP Game will be able to play within your own group.",
            "comment_grading": "Midterm 30%<br />Mini Quizzes 15% (total 5, counting best 3)<br />Group Project 35% Including:<br />--&gt;Team report 1 5%<br />--&gt;Team report 2 10%<br />--&gt;Final Poster and presentation 15%<br />Peer evaluation 5%<br />Written Essay 10%<br />Class attendance and participation 10%<br /><br /><br />I messed up Quizzes, overall should be 13/15<br />but all group work, individual essay and midterm above mean.<br /><br />Final Grade: A-",
            "comment_workload": "The workload is so heavy.<br />Having group meeting for many times for the group work. HELL.<br />My group members are all responsible and have the effective division of labor already. BUT the workload is still too much, the team report 1/ 2 is already the length of the final report of other courses. Not to mention you need to design the poster and present.<br />Since Meike was having one lecture less due to public holiday, she changed our presentation to hand in video.<br /><br />Need to prepare the midterm (all long questions about you views and need to explain). Typing answer on Canvas is torture. It is open book (online exam).<br />Many readings and they might be tested in the Quizzes.<br />The essay is asking your own reflection about what you have learnt in this course.<br /><br />Participation: for zoom, I just typed in the chat box but for f2f, it is important to raise your hand and share your opinion, no matter it is right or wrong, just give some reasons and make it has logics is ok.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "n1K5q93g5HUB69cy3onIdELxW4o1Y5kB",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1584,
                    "name": "DELINA, Laurence L.",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "DawDawDaw",
            "date": "Sep 01, 2022",
            "title": "Only the Midterm Matters",
            "comment_content": "Lots of geography content, which the prof skimmed through. The content itself, except for some political geography, is pretty challenging if you haven't studied geography before.",
            "comment_teaching": "The professor is energetic, but constantly spends lots of time playing in-class games with us. But it's not what I expect.<br /><br />The lectures are too long, with some extroverts &quot;bullshitting&quot;.<br /><br />Don't expect you will learn some profound geography knowledge in this course.",
            "comment_grading": "I got an A. (Midterm 28.5/30; time management matters, I failed to finish the whole exam.) Performing well in the midterm will be fine. The other assignments/projects don't really matter.<br /><br />Go for this course if you performed well in DSE/IB geography. Study the PPTs and answer with geographic terms.",
            "comment_workload": "Quite heavy. <br />Report &amp; Poster &amp; Presentation &amp; In-class quizzes &amp; Essay",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JnaGeQTxQVmq3nLF7lhk6pZ8gYz12kQp",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Pearl",
            "date": "Aug 25, 2022",
            "title": "take it when you have good groupmates + friends who can send you past quiz answers",
            "comment_content": "as outlined by everyone else tbh. always the same",
            "comment_teaching": "hes really passionate about sustainability its nice to listen to him get excited about course content",
            "comment_grading": "tbh only the midterm matters the most. got 30/30 and that brought me straight to a+. read through the slides and borrowed a cheatsheet that had everything in<br /><br />the second half there are 5 quizzes take best 3. make sure you get full marks. go ask for past quizzes from your friends cuz they reuse them otherwise it's not easy<br /><br />project i was above average for most except the poster, my group literally had the worst score in the class<br /><br />make sure you are on good terms with your teammates because there's a peer evaluation at the end. give each other 5s. be a good person",
            "comment_workload": "really depends on your teammates - theres diversity requirements on group forming but you get to choose your own teammates so its chill<br /><br />i had some wonderful teammates and we split on how much to contribute in part of the project depending on our other commitments (some made 1st internal report, some 2nd. finals some people worked on presentation + some work on poster)<br /><br />with that minimal workload",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fY0dGzvlcTuRTfmC7QUSFIEwLgY2phkX",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 978,
                    "name": "SAUERWEIN, Meike",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "vtecf22c",
            "date": "Aug 20, 2022",
            "title": "Not as good as I expected, but useful for academic requirements",
            "comment_content": "Course content is generally positive and relevant to most of us. Teaches quite a lot about the sustainablity issues and various case studies, which is engaging. For me it's more like a geography class from high school, but the difference is that the course tries to sell you ideologies at times you might agree or disagree.",
            "comment_teaching": "The lectures were engaging and interactive. Was not boring at all. But I have to remind each of you reading, that keeping a critical mind is key, whether you agree or disagree with the agenda the course is picturing.",
            "comment_grading": "Grading was not good for myself, I worked hard for the assignments but the effort don't really pay off in the end. Not sure what they are looking for here actually, i got a C+ btw.",
            "comment_workload": "The workload is not difficult but volume is huge. Group presentation and reports are required.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Ah0fOiNQtZ82ukWWVinNPeL5i0jQilct",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 978,
                    "name": "SAUERWEIN, Meike",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "SmallPotato02",
            "date": "Apr 01, 2022",
            "title": "OK course",
            "comment_content": "This course is about the challenges the world is facing to have a sustainable life by doing projects for respective countries for different groups. The course includes the concepts of planetary boundaries and circular economy. The whole course is divided into two main parts and the midterm exam only covers the first part. The structure of the midterm is like DSE LS exam. Therefore, for students who are good at these short essay writings, it is not difficult to have good results. Also, as it is an open book exam, students only need to remember the concepts but not the exact terms because you can check it on your tablet. As for the project, it is about a study for a specific random country and generate a poster to present.",
            "comment_teaching": "The professor's teaching style is quite interactive and she is a willing to answer questions. However, for the assignments of the projects which are mainly marked by the TAs, the grading structure is a little bit unclear.",
            "comment_grading": "The grading is quite OK because for our group presentation, it is just normal performance while the midterm is just slightly above mean. It results into a B+.",
            "comment_workload": "For the workload, in the first half of the course, it is normal because the quizzes are not there yet. However, for the second half of the course, we are having weekly quizzes in class which requires you to revise the whole ppt even they are open book quizzes since the quiz time is just 5 / 15 minutes (Sorry I can't remember correctly). Also, for our session, it is from 9 - 12 pm. So keep this in mind before you assess the workload.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HjaJSBrLpnvLfKLDlgWDagAJkxK5r8Zn",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 978,
                    "name": "SAUERWEIN, Meike",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Terryboltzzz",
            "date": "Jan 29, 2022",
            "title": "",
            "comment_content": "Mid term content<br />1-Introduction<br />2-Anthropogenic impact on natural systems<br />3-Planetary Boundaries &amp; Earth Systems<br />4-Human Thriving within planetary boundaries<br />5-Policy for Sustainability<br />6-Sustainable Development<br />Part B: After mid term<br /><br />7-Energy Futures<br />8-Futures for Fresh Water<br />9-Circular Economy<br />10-Sustainable Consumption<br />11-Futures Thinking<br />12- Presentation<br /><br />If you studied geo, it would be pretty easy to grasp the content cause there are some concepts you will have seen before. Some of the content is a bit common sense, a bit bsing/吹水 will do fine in the mid term.",
            "comment_teaching": "She teaches fine. She makes a 9am 3 hour lecture more bearable to endure through. She tries to use activities to try and deliver the content to make it easier to understand. Although some of the activities might not have a lot of connection towards the lecture itself and still have to do some self study at the end.",
            "comment_grading": "Midterm exam (25th Oct. 06:30 –08:30PM) 30%<br />6 long questions, just a bit of bsing and common sense<br /><br />Mini Quizzes (3 out of 5 count towards grade) 15%<br />The difficulty of the quiz is not difficult and is also open book. However once you answered a question, you can't go back and you don't know how many answers for each question (each question can have more than 1 answer)<br /><br />Group project* 35%<br />• Incl 15% poster presentation, 5% peer-review, 15% 2 interim reports; ** incl 3% peer review<br />-Do work and don't be a free rider and would secure ok grade<br /><br />Written assignment 10% - Ａ reflection on the course<br /><br />In-class engagement ** 10% - Do at least one answer one question the professor asks and it should be fine to secure a relative ok score. Fyi, I did this and I also dosed off during lectures, at the end I scored relatively high for this part<br /><br />My grade:<br />Scored slightly above mean for project<br />At least 1 SD above for mid term<br />A range",
            "comment_workload": "Workload before mid term is acceptable. Review the course material before the mid term like a day before should secure a decent grade. After mid term will have a quiz at the start of every lecture so recommend read the notes the night before. <br />Heaviest workload would be the group project, have to arrange out of class time to do work",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "9Sg3tDwTKxBznmZCrshEeK1r2pjdPTy0",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "gyy",
            "date": "Jan 11, 2022",
            "title": "",
            "comment_content": "The course consists of two parts. The first part provides a brief overview of the impact of human activity (such as deforestation, overconsumption etc.) on the environment. The second part focuses on how people (government, businesses, individuals, engineers etc) should help tackle the climate and other environmental problems.",
            "comment_teaching": "Professor is very kind, and encourages class discussion, and value everyone's opinion. The pace is great. There's a lot of class activities that will invoke a lot of discussions.",
            "comment_grading": "The professor likes people who provide their opinion and answer his question so you must be proactive if you want to score high in class participation<br /><br />There are 5 quizzes and only the best 3 is graded so no stress on the quizzes even if you screw some up <br /><br />Mid-term Exam (30%) <br />Mini quizzes (15%) <br />Group project (35%) <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;• Two Interim Report (15%) <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;• Poster (15%) <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;• Peer Review (5%) <br />Written Essay (10%) <br />Class attendance and participation (10%)",
            "comment_workload": "The detail about the project is released about a week before the deadline, so you have to work with your team members to divide the work equally and manage your time. Just find a good team and you should be fine.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "fY5WEoQa0PMDJwUfXW13NLsfTojprp02",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "/",
            "date": "Dec 28, 2021",
            "title": "Demanding but very well-organized course",
            "comment_content": "Have a look at the attached syllabus.<br /><br />This really is a blended-learning course, as you should expect to deal with concepts in sustainability, group activities in every lecture where you have to apply the concepts that have just been introduced, reading wordy ppts beforehand, doing a group project with 2 reports and 1 poster, and writing a final essay. Everything from the course just gives me the impression of a course very well organized by experienced professors and teachers.<br /><br />I don't know if this is because participation points are counted, but my section has a lot of students who are extremely proactive in raising/answering questions in class. Prepared to be overwhelmed by them, or if you can, be one of them!",
            "comment_teaching": "Prof. Benjamin is willing to let students take the stage during the lectures. He always encourages us to raise our ideas, and he would give encouraging feedbacks to teams that volunteer to present their work to the class during group activities.",
            "comment_grading": "Midterm exam: 30%<br />Quizzes: 15% (best 3 out of 5 quizzes counted, 5% each)<br />Group project: 35% (report #1 5%, report #2 10%, poster 15%, peer review 5%)<br />Final essay: 10%<br />Participation (including attendance): 10%<br /><br />Midterm exam: Books, notes and Internet allowed but the instructors are very strict in grading this exam, and there will be point deductions for even seemingly neglectable errors. Recommend to go through all the ppts one day before the exam so you know which ppt to look at and find the answers immediately when reading the questions.<br /><br />Quizzes: 3 MCs in 5 min for each quiz. Wrong answers are penalized, so be careful when guessing. Will only be conducted weekly after the midterm exam. Do go through the ppts in advance since you can't read them all in 5 min.<br /><br />Group project: Really depends on whether you have proactive members in your group who are willing to go to extreme lengths to make your group stand out.&nbsp;&nbsp;My group was not outstanding but not bad so we received above average scores. Workload can be heavy, especially for the poster, which requires lots of group meetings as we have to collectively decide on the contents to be put on the poster. Recommended to contact students from previous years so you can see how their group products look like.<br /><br />Essay: Not difficult, if you are really interested by this course, you can do this one with ease. Just remember to submit before deadline.<br /><br />Participation: Also an exhausting component, since lots of students are always ready to raise their hands, which means you really have to stay awake throughout the class to capitalize on your chance when it comes.<br /><br />My grades:<br />Midterm: 26.5 (mean 22.78)<br />Quizzes: 15 (mean must be high, around 13-14 I guess)<br />Report 1: 4.4 (mean 4.24)<br />Report 2: 9 (mean 8.8)<br />Poster: 12.33 (mean 11)<br />Peer review, essay, participation: not published<br />Grade: B+",
            "comment_workload": "Generally high, especially after the midterm when we have to study for weekly quizzes and at the same time do the group project in November, when all courses have deadlines. The group activities in every lecture can be really exhausting, and you don't want to come into a 3hr class haven't had any sleep the night before. But after all, it was a great course.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "9mrSGdwHCosNVze6D6G6hgjn6Bjv0rL0",
                    "name": "SUST 1000 Fall 21-22 Syllabus L5",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "dno1fej0eYxucfWnYV2Ra8OFYY3z4AAP",
            "semester": "2021-22 Fall",
            "instructors": [
                {
                    "id": 978,
                    "name": "SAUERWEIN, Meike",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Damien",
            "date": "Dec 13, 2021",
            "title": "Easy course, but require quite a bit of talking/bullshitting",
            "comment_content": "Part A<br />1-Introduction<br />2-Anthropogenic impact on natural systems<br />3-Planetary Boundaries &amp; Earth Systems<br />4-Human Thriving within planetary boundaries<br />5-Policy for Sustainability<br />6-Sustainable Development<br />Part B(relating to sustainable development goals)<br />7-Energy Futures<br />8-Futures for Fresh Water<br />9-Circular Economy<br />10-Sustainable Consumption<br />11-Futures Thinking<br /><br />Midterm only cover Part A.<br />Quizes only cover Part B(No Finals)<br />Overall the content is very easy, if you have learn general studies or geography, etc it would be a easy A course for you.",
            "comment_teaching": "Overall Meike, is a great teacher, she has quite low expectations imo,",
            "comment_grading": "Assessment<br />Midterm exam (25th Oct. 06:30 –08:30PM) 30%<br />Mini Quizzes (3 out of 5 count towards grade) 15%<br />Group project* 35%<br />• Incl 15% poster presentation, 5% peer-review, 15% 2 interim reports; ** incl 3% peer review<br />Written assignment 10%<br />In-class engagement ** 10%<br />-If you raise your hand to contribute; you get points<br />-If you are actively participating during class activity; you get points<br />-Attendance/Not being late to class; also get you points",
            "comment_workload": "There is no homework<br />Group project requires 2 reports, roughly 1500 words per group. <br />Group project is presented using a poster and 8 mins presentation.<br />Written assignment at the end of the course for reflection. <br /><br />Additionally, quizzes are open book, and based on the required reading materials. So if you don't read it beforehand, you might struggle in the 5 min duration of the quiz.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Zw6s8N3kRyLNScBcc37wYXxi0EoToIx9",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1214,
                    "name": "LU, Zhongming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "YwkRic",
            "date": "Sep 02, 2021",
            "title": "decent option for SSC common core",
            "comment_content": "The content are honest-to-heart meaningful and interesting, especially certain parts of interactive games/learning on a scale never seen before.",
            "comment_teaching": "Teaching is fine. Since it was first time for the course to adopt online teaching mode, some elements(e.g. student responsiveness) are yet to be desired. As a result, the teaching took a toll.",
            "comment_grading": "the grading was just fine, I guess. As long as you are attentive during the group activities and completed the essay, presentation and tests accordingly you should be fine. However one thing to be noted is that since some of the time students are silent, the group activities remained silent at times.",
            "comment_workload": "it is fine, you only have to complete some sort of questionnaires/preparation from websites/news websites. starting from the middle of the course, each group has certain presentations/essays to be handed in while following up the progress each week.",
            "rating_content": 5,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "KoCkbAegOIihpomYbb6xdIwqFssNMKyV",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 215,
                    "name": "LAU, Pui Sang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Sam23",
            "date": "Sep 02, 2021",
            "title": "Good Prof Good Grades but come with a lot of work",
            "comment_content": "A lot of interesting sustainability issues discussed in the course, which is very fascinating for students from other schools. Topics like System Thinking, “Whole is greater than sum of the parts “ , UNSDG, planetary boundaries, circular economy, etc, would be very relevant to the rising trends of ESG and sustainability in many companies.",
            "comment_teaching": "Arthur is really passionate and devoted in teaching the course where he spent extensive amount of time to prepare for the materials and fun games to engage the students. Him and the TA team also provided plenty of support throughout the course to help us accomplish the tasks.",
            "comment_grading": "Mid-term Exam (35%)<br />A mid-term exam, common to all sections, covering Part A (Lecture 1-6) <br /><br />Mini quizzes (15%)<br />Starting from Part B, a short quiz will be conducted for each class to test basic understanding of the concepts covered in the required reading. Each quiz will account for 5pt. The best three out of five quizzes will count towards the final grade.<br /><br />Group project (25%)<br />Students will work in groups to research and identify the key sustainability challenges and provide possible solutions for a selected region. Additional details with instructions will be made available in the coming weeks.<br /><br />Interim Report (10%)<br />Twointerimreportseachaccountingfor5ptarerequiredtoreportontheprogressof<br />the project work.<br /><br />Poster (10%)<br />o A poster, detailing the findings in a concise manner, should be presented in the last lecture.<br />o During the poster presentation, each group will have individual Q&amp;A session with instructors. You will also receive questions and feedbacks from your peers.<br /><br />Peer Review (5%) <br />Comments will be mandatory and will be reviewed by the instructional team to ensure fairness in evaluation.<br /><br />Written Essay (15%)<br />There will be one short (800-word) written assignment, due at the end of the Term to provide you with an opportunity to demonstrate your overall understanding of the issues covered in the course. <br /><br />Class attendance and participation (10%)<br />&nbsp;&nbsp;&nbsp;<br />The course includes many in-class activities and discussions to facilitate students’ learning. Class participation is therefore essential not only to promote your own learning, but contribute significantly to the learning experiences of others in the class.<br /><br />The grading is quite good, I got an A in the end. I got above mean for almost everything and 1-2 sd higher than mean for the midterm.",
            "comment_workload": "A LOT of work <br /><br />There are 2 midterms for the first half of the syllabus. Afterwards, you get quizzes every single week and the best 3 out of 5 would be used as your final score. <br /><br />For the group presentation, you have to submit assignments every other week, which is quite hectic. On top of that, you have to give a final presentation of a sustainability poster that you and your group compiled together as a whole.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "495D0RQIocXuW1qrK9OhHPy4nx0yjEfd",
                    "name": "SUST 1000 Fall 20-21 Syllabus L1",
                    "format": "pdf"
                }
            ]
        },
        {
            "hash": "tu7cKyC4xCoSqmJyzddOcvgVgMkG5Qkk",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 1242,
                    "name": "SHI, Xiaoming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lorleng",
            "date": "Aug 27, 2021",
            "title": "",
            "comment_content": "It starts off with very general things about the environment and then prof starts to teach rather detailed but easy-to-follow concepts and also teaches you how to apply.<br /><br />1. Introduction<br />2. Anthropogenic (human) impact on natural systems<br />3. Planetary boundaries and Earth systems<br />4. Human thriving within planetary boundaries<br />5. Policy approaches for sustainability<br />6. Sustainable development and sustainable communities<br />7. Energy futures<br />8. Futures for freshwater<br />9. Design for a circular economy<br />10. Sustainable consumption<br />11. Futures thinking",
            "comment_teaching": "Prof kind of reads off the slides but he speaks fairly well and he answers questions during the class. Pretty chill dude, I enjoyed being taught by him.",
            "comment_grading": "Midterm exam: 35%<br />Group project: 40%<br />Reflection paper: 15%<br />Class attendance and participation: 10%<br /><br />It's pretty easy to score if you put in a decent amount of effort.",
            "comment_workload": "The interim reports and projects are related, you really need good groupmates to get it done well because it involves a fair bit of reading and understanding. <br /><br />Highly encourage you to be active in class, ask questions and present mini-group discussions.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Kg3c3Kn4g48cHzq3LPTVhZ7antbXsVHw",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1214,
                    "name": "LU, Zhongming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "g",
            "date": "Aug 26, 2021",
            "title": "Big workload but you can get good grade if you put effort",
            "comment_content": "If you are interested in sustainability issues, the content of the course can give you an idea of the fundamentals. The topics are also related&nbsp;&nbsp;to our everyday life.<br />Class activities for attendance taking every lesson<br />Required to turn on camera",
            "comment_teaching": "There are discussions during every lesson. Did some interactive class activities (e.g. calculate your energy consumption and your household consumption), and played some online board games. Overall good teaching but could be boring sometimes.",
            "comment_grading": "Only spoke up a few times in the beginning of the semester for participation, show up every lesson<br />Put more effort into the group project if you want to get good grades",
            "comment_workload": "Big workload for cc but still manageable.<br />Quizzes every week for the second half of the semester (but the answers are in the ppt slides so should be able to get full mark if you read the ppt beforehand)<br />Two interim reports, final poster and presentation for the group project, should be manageable if you found good teammates, better find friends to reg this course tgt<br />Reflective essay at the end of the semester",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "HGVrO3pdPJTeGteJRmDDIfKFos3cB3qr",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1401,
                    "name": "DELINA, Laurence Laurencio",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Thomas Leung",
            "date": "Aug 25, 2021",
            "title": "Heavy workload course",
            "comment_content": "1. Introduction<br />2. Anthropogenic impact on natural systems<br />3. Planetary boundaries and Earth systems<br />4. Human thriving within planetary boundaries<br />5. Policy approaches for sustainability<br />6. Sustainable development and sustainable communities<br />7. Impact of Covid on SDG<br />8. Energy futures<br />9. Futures for fresh water<br />10. Design for a circular economy<br />11. Sustainable consumption<br />12. Futures thinking<br /><br />Content mostly revolves around how human activities impact on different aspects of sustainability, as well as introduce different perspectives of the problem and solution. Relatively simple ideas and concepts, no need to memorize a lot of content as well.",
            "comment_teaching": "Strong accent and poor connection, almost every lesson have connection problems. He does try to make every lesson interactive and fun, hence there are lessons that play games, which is a nice break from the 3 hr long lectures. TAs are supportive and knowledgeable as well.",
            "comment_grading": "Grading was not transparent. We got below average in the interim reports while the comment on it was overwhelmingly positive (the only bad thing mentioned was our formatting, which I believe was not a strong enough reason to have such grade). Presentation takes up a huge part of the total grade so be aware.",
            "comment_workload": "Attendance and group work is required for every lesson. There is a quiz for every lesson after mid-term, which is based on 50+ pages of required readings. The time given to prepare each of the two interim reports for the project was tight as well. After all of that there is a reflection essay you need to hand in. Very heavy workload for a 3 credit 1000 level course.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "mZDZRGAbB1lEkVtQZtU4pdJyYAlLgyP4",
            "semester": "2019-20 Spring",
            "instructors": [],
            "is_author": false,
            "author": "lovecoco",
            "date": "Aug 25, 2021",
            "title": "",
            "comment_content": "The content is quite interesting if you are interesting in understanding human pollution in different way and solutions.",
            "comment_teaching": "Discussion in every lessons, and you have to evaluate and being evaluated by your group mates, so participation is important. <br /><br />Different activities will be held in every lessons to deepen the idea. Usually half of lesson time is lecture and the other half is discussion and activities.",
            "comment_grading": "The grading is fair. Some mid-term tests (around 10 mins each), no final exam and the mark of project would not heavily depend on the final product, but disturbed evenly on different stages. <br /><br />The project can be in different topics depending on which one your group like, such as water pollution and land pollution, and you have to suggest how to solve it. The project requires some information research for statistic and lots of creativity to think of the your original solutions.",
            "comment_workload": "The workload is not very heavy, but the schedule is tight. Have work or part of the group project to hand in every week near the end of semester. And group project requires a lot of discussion with group mates and time to complete.",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "A7Hbf1yTHzXnSWAT4dSksfnDrTkFfRph",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1401,
                    "name": "DELINA, Laurence Laurencio",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "maps",
            "date": "Aug 24, 2021",
            "title": "",
            "comment_content": "1. Introduction<br />2. Anthropogenic (human) impact on natural systems<br />3. Planetary boundaries and Earth systems<br />4. Human thriving within planetary boundaries<br />5. Policy approaches for sustainability <br />6. Sustainable development and sustainable communities<br />7. Impact of Covid on SDG<br />8. Energy futures<br />9. Futures for fresh water<br />10. Design for a circular economy<br />11. Sustainable consumption<br />12. Futures thinking",
            "comment_teaching": "Prof Delina is a super nice guy, he always tries his best to explain all the concept in class through real life examples, which makes the concepts easier to grasp. Though the class duration is quite long, he always gives 10-15 mins break in between, making it a lot more bearable.",
            "comment_grading": "Midterm (30%) - the format of the midterm was long answer questions. I'd say the grading's relatively lenient.<br />Mini quizzes (15%) - there are 5 quizzes in total, and they'll choose the best 3 of the 5 that you've completed. The quizzes are done in the beginning of the class. They're relatively short, and will usually test your understanding of the concepts covered in the required readings.<br />Group project (35%) - in groups of 5, you'll need to create two interim reports that will eventually lead up to a final product of a poster. Each group will be assigned a country and they'll need to each do research about that country's sustainability issues.<br />Written essay (10%) - in the end of the course, you'll have to write a 800 word essay on a sustainability topic of your choice. They'll usually give you a guiding question to start with.<br />Class attendance and participation (10%) - there are a lot of class activity in this course, hence, I'd say that attendance is mandatory. Prof Delina tends to always encourage in class participation, hence, I would say that participation marks are not too tough to attain.<br /><br />Overall, I think the grading's fair. The mean was relatively high, especially for group project related tasks. Hence, it's crucial to find good teammates for the group project.",
            "comment_workload": "The workload's not too heavy. They'll give you weekly readings that will take max 60-90 mins to read, it'll come in handy for the mini quizzes that will be conducted in Part B of the course.<br /><br />The group project does take some time, but if you have fun teammates to work with, it should not be too burdensome. Plus, because it's a level 1000 course, the tasks itself are not too difficult.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "SmIBMzMajCaQVjMTPRPoYqRW6lblGXge",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1242,
                    "name": "SHI, Xiaoming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Umang",
            "date": "Aug 13, 2021",
            "title": "Overall Easy and good grading",
            "comment_content": "The content is well organised and easy to understand. However, revision is required in the later part of the course for quizzes as you will have weekly quizzes in the second half and the quizzes mostly vary in difficulty level across weeks so be sure to prepare well as some concepts can be abstract. Make sure to interact in the course for good participation scores which are quite important.",
            "comment_teaching": "The teacher is well versed in his material and the TAs were helpful as well",
            "comment_grading": "Very nice grading. Got an A after much effort though.",
            "comment_workload": "Workload is on the heavier side if you want to score well. Make sure to create a good poster and focus on the quizzes for maximum chances of a high grade.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "3QSNdyaK5y15Ae6Rzd2TqyDFwujYAYPc",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1242,
                    "name": "SHI, Xiaoming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kam Kee :)",
            "date": "Aug 08, 2021",
            "title": "Find good group mates before reg",
            "comment_content": "Part 1:<br />L1: Introduction<br />L2: Anthropogenic impact on natural system<br />L3: Planetary boundary<br />L4: Human thriving<br />L5: Policy<br />L6: Sustainable development<br />---------------------------------------------<br />Part 2:<br />L7: Energy future<br />L8: Future for water<br />L9: Circular economy<br />L10: Sustainable consumption<br />L11: Future thinking<br />L12: Zoom presentation<br /><br />There will be a midterm for Part A content, then mini quiz for Part B before each lesson, so never miss the first 10 minutes of the class",
            "comment_teaching": "Three hour lesson is quite demanding. For the first half of the lesson, it would be purely professor explaining the content for that lesson. Professor can be a bit boring but he tries his best to answer students' questions. The second half would be group activities. Depending on your group mates, if they are willing to speak up, it's actually quite enjoyable.",
            "comment_grading": "The grading is quite lenient! Our group had an issue for the final project poster and had to hand it in late. I emailed professor and he said he saw our group resubmitted it, so he wouldn't count us as late. Didn't participate much and I think our group did not have the best project presentation, but I got a B+. <br /><br />Midterm exam (35%)<br />Mini quizzes: best 3 out of 5 (15%)<br />Group project (25%)<br />Written Essay (15%)<br />Class attendance and participation (10%)",
            "comment_workload": "Workload for this course is quite heavy. <br /><br />For Part B, there is a mini quiz at the start of each lesson, so you will be required to read and understand all the required reading materials beforehand. <br />The workload for the project is heavy. Two interim reports, with final group poster project and presentation. Had to do a lot of researches and checking for information. Disaster when you have bad group mates, have to do everything yourself. <br />The midterm exam is open book, but I have to revisit the lecture notes as there is a lot of content. The written essay is a 800-word reflection essay on how to view sustainability.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "gm1xFEBscUqKYZetMEhhFNc7wKjDsfds",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 215,
                    "name": "LAU, Pui Sang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ayeung",
            "date": "Jun 15, 2021",
            "title": "",
            "comment_content": "i guess you'll just find out the syllabus from other reviews haha ;D",
            "comment_teaching": "Arthur is a really nice professor, somewhat like a dad figure :D he tries his best to engage with everyone in the class, even if it was only online. you really don't have to worry about embarrassing yourself during lectures cus he is tooooo encouraging haha. he'll definitely rmb everyone (except if you never respond / come to class) since he says hi to every one of us before class starts!",
            "comment_grading": "i got an A for overall, which is pretty surprising!<br /><br />1. Interim Report #1 (5%)<br />- Mean: 4.8/5<br />- Our group: 4.5/5<br /><br />2. Interim Report #2 (10%)<br />- Mean: 9.9/10<br />- Our group: 9.8/10<br /><br />3. Poster Presentation (15%)<br />- Mean: 13.2/15<br />- Our group: 14.15/15<br /><br />4. Peer Evaluation for Project (5%)<br /><br />5. Quizzes (15%)<br />- best 3/5 of your scores will be counted <br /><br />6. Mid-Term Exam (30%)<br />- Mean: 22.7/30<br />- Me: 27/30<br /><br />7. Reflection Paper (10%)<br />- Mean: 8.3/10<br />- Me: 8.5/10<br /><br />8. Class Attendance &amp; Participation (10%)<br />- i participate almost every lecture? but the score isn't released.",
            "comment_workload": "the most crucial thing about this course is finding good teammates :( there are certain requirements about forming groups like diff schools/years/majors etc.<br />to me, it's a pretty high workload course since there is class work for every lecture (to be done within the class with your teammates), then a mid-term exam, quizzes about reading materials for every lecture after the mid-term (probably 5 quizzes in the end?), a reflection paper of ard 800 words, not to mention the project zzz <br />the project includes 2 interim reports and a poster + final presentation, it might seem manageable, but you'll actually have to plan out and sort things out with your teammates!",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2ILMLS59NbjPEnjc1jxhumg7EZroihZ0",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "yoyo.y",
            "date": "Jun 09, 2021",
            "title": "",
            "comment_content": "Lecture 2 - Anthropogenic impact on natural systems<br />Lecture 3 - Planetary boundaries<br />Lecture 4 - Human Thriving<br />Lecture 5 - Policy<br />Lecture 6 - Sustainable Development<br />Lecture 7 - Energy futures<br />Lecture 8 - Futures for Water<br />Lecture 9 - Design for a Circular Economy<br />Lecture 10 - Sustainable Consumption<br />Lecture 11 - Futures Thinking<br /><br />You need to read the slide before the classes (especially after mid-term, the mini-quizzes are related to the slides)<br />The content is not difficult to understand but a bit long",
            "comment_teaching": "Half of the lesson is for the important concepts.<br />Then, half of the lesson is for activities or discussions (with groupmates). The activities (games) are quite interesting.",
            "comment_grading": "Mid-term Exam(30%)<br />Mini quizzes * 5 (scores for the highest 3 quizzes) (15%)<br />Group project (35%) [Two Interim Report (15%) + Poster (15%) + Peer Review (5%)]<br />Written Essay(10%)<br />Class attendance and participation (10%)",
            "comment_workload": "Before mid-term, almost very low workload - just one Interim Report. <br />After mid-term, the workload is much high. You need to read the slide about p.60-80 before the classes for preparing the mini-quizzes (MC) <br />And you need to finish another Interim Report, Poster and prepare the presentation.<br />Finally, you are required to write about 800 words essay.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "WvHndQvEzCs1Zhb0gEVLcHCS1OOIcIJ3",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 215,
                    "name": "LAU, Pui Sang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "AWY",
            "date": "Jun 05, 2021",
            "title": "",
            "comment_content": "Basic concepts covering what sustainability is from the socio-economic perspectives. <br /><br />Part A (Mid-term)<br />1: Introduction<br />2: Anthropogenic (human) impact on natural systems<br />3: Planetary boundaries and Earth systems<br />4: Human thriving within planetary boundaries<br />5: Policy approaches for sustainability<br />6: Sustainable development and sustainable communities<br /><br />Part B (mini-quizzes)<br />7: Energy futures <br />8: Futures for freshwater<br />9: Design for a circular economy<br />10: Sustainable consumption<br />11: Futures thinking<br />12: In-class presentation / Q&amp;A",
            "comment_teaching": "Interactive class but no as introvert-friendly. Arthur tried to engage everyone in the class and gave each group comments after the presentation.",
            "comment_grading": "(30%) Midterm exam for part A <br />(15%) Mini quizzes for Part B <br />(35%)Group project&nbsp;&nbsp;[made up of two Interim Reports (15%) + Poster Presentation (15%) + Peer Review (5%)]<br />(10%) End-of-course Written Essay <br />(10%) Participation <br /><br />Marks for interim reports were pretty much similar for every group so mid-term might mean a lot for the grading.<br /><br />Not sure about the grading yet.",
            "comment_workload": "Manageable workload. Open-book midterm and quizzes so I just went over the materials once and searched during the tests. It's actually quite chill if you could have good teammates for the project. But this course could be torturing for introverts as there were group discussions and presentations every lecture.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JbMvx2mGrsVZrVA3RrhmgmNiTFmkg8mO",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1242,
                    "name": "SHI, Xiaoming",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "hjhjhj",
            "date": "Feb 08, 2021",
            "title": "year 1s don't take it",
            "comment_content": "content is not bad; understandable for non-sci students<br />must attend all class because the second half of class is activity-based<br />starting from part b, there is a short quiz at the start of every class<br /><br />PART A<br />Introduction<br />Anthropogenic (human) impact on natural systems<br />Planetary boundaries and Earth systems<br />Human thriving within planetary boundaries<br />Policy approaches for sustainability <br />Sustainable development and sustainable communities<br />PART B<br />Energy futures<br />Futures for fresh water<br />Design for a circular economy<br />Sustainable consumption<br />Futures thinking",
            "comment_teaching": "i don't think the prof knows what he's is teaching<br />he just reads the ppt<br />the prof is new to this course; don't recommend",
            "comment_grading": "grading is not bad<br />didn't do well on midterm, above average for most of the assignments --&gt; got an adequate score<br />most students are above year 2, so i don't recommend for year 1 students",
            "comment_workload": "the workload is not bad, but you need a good teammate<br />your group stays the same throughout the course, so make sure to find a good group<br />mostly group work",
            "rating_content": 4,
            "rating_teaching": 2,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Wnji11DWqJ118ikXDrOYcn2g8oWq9p4X",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 978,
                    "name": "SAUERWEIN, Meike",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "supermin",
            "date": "Jan 22, 2021",
            "title": "Lots of things to do. But good course overall.",
            "comment_content": "Contents are not too difficult. Doing some memorization helps a lot<br /><br />L1 - Introduction<br />L2 - Anthropogenic Impact on Natural Systems<br />L3 - Planetary Boundaries<br />L4 - Human Thriving<br />L5 - Policy<br />L6 - Sustainable Development<br />L7 - Energy<br />L8 - Fresh Water<br />L9 - Designing a Circular Economy<br />L10 - Sustainable Consumption<br />L11 - Futures<br /><br />Syllabus is attached.",
            "comment_teaching": "She is very kind and will answer any question raised in class or off class.<br /><br />Her English is very good and fluent, so no problems in understanding her lectures.<br /><br />She gives out slides prior to her lectures, and you should read it through at least once to do the quizzes, and to understand the flow of the lecture. Slides are in good format and well organized.<br /><br />TAs are great as well. They will also answer any questions raised.",
            "comment_grading": "Participation and Attendance 10%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Join classes and answer questions actively to get high marks.<br />Midterm Exam 35%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Five Long answer questions. <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Not too difficult if you understand the lectures.<br />Mini Quizzes 15%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Five MC questions at beginning of lecture, from after midterms.<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Best three out of five are counted.<br />Group Project 25%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prepare TWO progress reports + ONE poster and presentation.<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Make sure to get good teammates.<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Also not too difficult if work is properly assigned.<br />Written Assignment 15%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Writing up short essays on given topics<br />&nbsp;&nbsp;<br />I had good teammates so group projects were 2nd in class<br />Midterms and Quizzes were slightly above mean<br />Written Assignment was 1sd above<br /><br />Final grade was B+ <br />slightly disappointing but is acceptable.",
            "comment_workload": "There's quite a lot you need to do.<br /><br />Reading prior to class (recommended if you want good quiz grades)<br />Quizzes<br />Midterms<br />2 Group Essay<br />1 Group Project + Presentation<br />1 Essay after presentation (more like reflection-like)<br /><br />Compulsory to join classes because there are lots of discussions and they are graded to participation!<br /><br />Not recommended if you don't like talking too much or introvert.<br />Recommended if you are interested in Sustainability and Environment, and if you don't mind talking in class.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": [
                {
                    "key": "hq0QM0ufOnj4p7PtekSK1lKgTsZKNMCG",
                    "name": "Syllabus",
                    "format": "docx"
                }
            ]
        },
        {
            "hash": "cpntFHDGcxCooh9v7QRIPi7qefLlUoQC",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "csheep",
            "date": "Jan 21, 2021",
            "title": "Good grade but also depends on your luck...",
            "comment_content": "Part 1:<br />L1: Introduction<br />L2: Anthropogenic impact on natural system<br />L3: Planetary boundary<br />L4: Human thriving<br />L5: Policy<br />L6: Sustainable development<br />Midterm: L1-L6<br />---------------------------------------------<br />Part 2:<br />L7: Energy future<br />L8: Future for water<br />L9: Circular economy<br />L10: Sustainable consumption<br />L11: Future thinking<br />One quiz per lecture at 9am<br />---------------------------------------------<br />L12: Video presentation",
            "comment_teaching": "Benjamin' teaching is interesting. His lectures won't let you feel boring. Half of the lectures are used for group exercises (easy for group exercises!!) But be prepared to present your idea in front of the class.<br /><br />MOST IMPORTANTLY, his PPT is very detailed. Just read all required reading (normally over 50 slides of PPT) then it is sufficient for midterm/ quiz.",
            "comment_grading": "35% midterm<br />15% short quizzes (do 5 count best 3)<br />10% 2 interim paper<br />10% group poster<br />5% Peer Evaluation<br />15% reflection paper<br />10% participation<br /><br />Midterm is super easy. (open book exam)<br />If you can get full mark in the midterm, then can secure A range.<br />But it also depends on your group mates, if your group mates did not provide high quality work to the report or presentation, then you will be in troubles.<br /><br />Overall, this course is a &quot;good-grading&quot; course.",
            "comment_workload": "Actually light workload, but be careful to the deadlines of report. <br />The professor/ TA may not remind you one/two weeks before the submission of report. <br /><br />If you have taken DSE GEOG/LS, then this course will be super easy for you.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ZBVSbER4OT7oSIwxC0XWcVF2YW5lBaWl",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 978,
                    "name": "SAUERWEIN, Meike",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Fab",
            "date": "Jan 19, 2021",
            "title": "",
            "comment_content": "Decent content imo, but take into consideration that this is my first course on sustainability in my entire life lol. Interesting content and easy to grasp if you pay attention which is the hardest since the lecture is like 3hrs...<br /><br />However, there's quite a number of slides containing graphs, statistics, and quantitative data that wasn't tested on and is just there for your information so ask the professor about the content.<br /><br />Mid term - only the first few topics are tested <br />Short 5 minute MC Quiz for the rest of the topics at the beginning of class. (only your best 3 are counted)<br /><br />There's also two lectures with games which I found enjoyable (fishing game and loop boardgame) <br /><br />Anthropogenic (human) impact on natural systems<br />Planetary boundaries and Earth systems<br />Human thriving within planetary boundaries<br />Policy approaches for sustainability <br />Sustainable development and sustainable<br />communities<br />Energy futures <br />Futures for fresh water<br />Design for a circular economy <br />Sustainable consumption",
            "comment_teaching": "Great professor, super kind, enthusiastic, great energy, interactive with the class.",
            "comment_grading": "Not too sure how grading works, I got a B+ from:<br />Mid term: 31/35 well above mean<br />Quiz: 4.5/5, 4.5/5, 5/5 (best 3 out of 5 quiz)<br />Group project: always below mean &gt;:( probably dragged my grade down",
            "comment_workload": "Readings every week (presentation slides 30-70slides cant rmber, its around there), no biggie, spend some time reading before class. <br /><br />Group project: depends on your group members, we didn't put a whole lot effort but always split the work evenly. <br /><br />That's about it.<br /><br />Recommend taking this course.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "brkUONQR0YGfns1wSZShP2NQsjt0HEbc",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 978,
                    "name": "SAUERWEIN, Meike",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "W_WhAtEvEr",
            "date": "Jan 19, 2021",
            "title": "",
            "comment_content": "Planetary boundaries<br />UNSDGs<br />Climate governance etc...",
            "comment_teaching": "Teaching is very good<br />Easy to understand<br />Speaks clearly at a very comfortable pace<br /><br />Team activities during lectures<br />Each group has to present what they have during the activities, but the prof never give bad comment",
            "comment_grading": "A 800 reflection essay end-of-term (15%): Slightly Above mean<br />Two group interim reports (10%): Highest<br />A 10 mins group presentation (10%): Slightly Below mean<br />Peer evaluation (5%): Almost highest<br />5 short mc quizzes before lectures (15%): Mean<br />A mid-term exam (35%): Upper quartile<br />Attendance (10%): Mean<br /><br />Overall: A-",
            "comment_workload": "A 800 reflection essay end-of-term (15%)<br />Two group interim reports (10%)<br />A 10 mins group presentation (10%)<br />Peer evaluation (5%)<br />5 short mc quizzes before lectures (15%)<br />A mid-term exam (35%)<br />Attendance (10%)<br />(seems a lot but honestly not that bad)",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "5BalfJMU5UlV9gHxZurVABxjHsD97lCy",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 215,
                    "name": "LAU, Pui Sang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "就黎升仙",
            "date": "Jan 18, 2021",
            "title": "Online Learning",
            "comment_content": "How people achieve win-win situation in three aspects: Environment, Society, Economic <br />Policy, marketing strategy of business",
            "comment_teaching": "Very nice<br />Just ask questions in chat room and professor would answer.",
            "comment_grading": "My score compared with mean:<br />Participation: 7/7 (mean: 6.43/7)<br />Participation (Peer Review): 2.85/3 (mean: 2.35/3)<br />Interim Report #1 4.7/5 (mean: 4.57/5)<br />Interim Report #2 4.9/5 (mean: 4.89/5)<br />Group Project (Poster Presentation): 7.8/10 (mean: 7.76/10)<br />Group Project (Peer Review): 4.5/5 (mean: 4.06/5)<br />Midterm Exam: 25/35 (mean: 23.93/35)<br />Reflection Paper: 12.5/15 (mean 12.15/15)<br />Mini Quiz Final Score: 14.5/15 (mean 11.81/15)<br />Total Point: 83.75/100 (mean: 77.95/100)<br /><br />Grade: B+ (better than I thought as my midterm is slightly above mean)<br /><br />Grade Distribution:<br />A range: 20 - 25%<br />B range: 30 - 40%<br />C range: 30 - 40%<br />The A range and B range are based on students' performance.<br /><br />Tips<br />Participation + Peer Review<br />1) attend every lecture<br />2) be active in in-class group activities<br />3) kill your group mates in peer review (8/100, I believe some group mates try to lower my points even I work very hard and lead the team!) <br /><br />Group Project<br />1) find good teammates<br />2) work hard<br />3) contribution will affect peer review<br /><br />Reflection Paper<br />1) do more researches and add more citation<br /><br />Midterm <br />1) Questions are related to environmental news<br /><br />Mini-quiz<br />1) Go through the lecture notes before the quiz",
            "comment_workload": "The group project is crazy! Find good teammates is the most important thing for this course!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 1,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ejbm9lw57XDjnq9CfEQ9tMaKwEoEpBrT",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "過3爆4",
            "date": "Jan 13, 2021",
            "title": "",
            "comment_content": "The course teaches general knowledge of current challenges and impacts of sustainable development. <br /><br />If you studied Geography and LS in English during secondary school, you might find most of the concepts of this course easy to handle.",
            "comment_teaching": "Benjamin is quite nice and kind",
            "comment_grading": "It is believed that the grading of the course is heavily based on your group projects and final presentation<br />So if you want a satisfied grading, you have to pay much effort to get high marks from TAs",
            "comment_workload": "Only one midterm exam and no final exam<br />A short quiz per week after midterm<br />3 Group projects<br />1 final presentation <br />1 self reflection<br />participation",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hqpR33JYHCiERyagw9juYy6P5Q0ZlyQr",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1242,
                    "name": "SHI, Xiaoming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "huich",
            "date": "Jan 05, 2021",
            "title": "Content is quite boring but a good grade course",
            "comment_content": "An introductory course about sustainability. The course is separated into two parts: challenges of sustainability (first half of course) and futures for human thriving within planetary boundaries (second half of course). The content is quite boring as it is just about the basics of sustainability and what humans can do to help the environment.",
            "comment_teaching": "The professor can be a bit boring but he tries his best to answer students' questions. It is a three-hour lesson so the second half of the lesson is a group activity. The group activities are fun sometimes (e.g. games).",
            "comment_grading": "The grading is quite lenient! Slighty above mean for both group project and midterm exam with full marks for mini quiz. Did not participate much in class. My final grade was A.<br /><br />Midterm exam (35%)<br />Mini quizzes (15%)<br />Group project (25%)<br />Written Essay (15%)<br />Class attendance and participation (10%)",
            "comment_workload": "Workload for this course is quite heavy. There are required readings before the class for the second half of the course, as there is a mini quiz at the start of each lesson. The workload for the project is heavy, with group poster+presentation and two group interim reports. The midterm exam is open book, but preparation is needed because there is quite a lot of content. The written essay is a short 800-word reflection essay on sustainability.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "XUgQM9O2xVemLzff0QChBeYKrgDyShtO",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "LapisDoughnut",
            "date": "Dec 30, 2020",
            "title": "Challenge yourself, go for Sust 1000",
            "comment_content": "CONTENT<br /><br />Part 1:<br />L1: Introduction<br />L2: Anthropogenic impact on natural system<br />L3: Planetary boundary<br />L4: Human thriving<br />L5: Policy<br />L6: Sustainable development<br />---------------------------------------------<br />Part 2:<br />L7: Energy future<br />L8: Future for water<br />L9: Circular economy<br />L10: Sustainable consumption<br />L11: Future thinking<br /><br />L12: Video presentation<br /><br />Part A is for the mid-term, and there will be a short quiz in front of every lectures of Part B so that it is essential to make preparations before every lectures.",
            "comment_teaching": "Prof is quite an interactive person and shares most of his experiences during lesson time.<br />I would say it can be entertaining enough because there are interactive activities and games, but definitely a hell for introverts like me.",
            "comment_grading": "This is the part I would say &quot;What the-&quot; in the course.<br />Here's the mix of the whole course:<br />35% midterm<br />15% short quizzes (do 5 count best 3)<br />10% 2 interim paper<br />10% group poster<br />5% Peer Evaluation<br />15% reflection paper<br />10% participation<br /><br />The midterm and quizzes are fair grading given that there are clear answers, but the problem is about the report part (Interim paper+ Group poster).<br /><br />Wang Rui, the TA responsible for our group is a really interesting person.<br />We followed the guidelines of the 1st interim report so we tried to include every part listed on the guidelines as possible given there is a limitation on word count, he says &quot;too broad&quot;. Low Mark.<br />Therefore we focused in the main points of the guidelines for the 2nd report, and this time he says &quot;a lack of comprehensiveness&quot;. Low mark.<br /><br />I tried to ask how should we improve our report in lessons between the deadline of two submissions, even he is looking at the screen he continues to mute as if nothing happened.<br />Not a great grade for me coz the report part is really disappointing, even I am above the mean for the midterm and quizzes.<br /><br />I regard this as a lottery instead. If you have other TAs marking your paper, you could strike for better grades. If you got Wang Rui, prepare for the harshest marking scheme while at the same time not receiving any comments of improvements from him.<br /><br />This is a course of absolute grading, any minor mistakes hurts a lot.",
            "comment_workload": "I would say the workload is quite appropriate. Not too heavy and not too light.<br />1 Mid-term covering the whole Part A,<br />5 quizzes for every lecture of Part B,<br />a group work consisted of 2 interim paper and 1 poster, and finally 1 reflection paper.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hRcG19pARyOaJ0zR3WADKmWltM3RLIt9",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 978,
                    "name": "SAUERWEIN, Meike",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "mkk",
            "date": "Sep 01, 2020",
            "title": "",
            "comment_content": "A bit lengthy but easy in terms of understanding. 3 hours lecture is a hassle but except that it seems alright to cope with. Reading before class help in class discussions and are important for the exams.",
            "comment_teaching": "Interactive teaching with multiple games used to explain concepts. TAs were helpful and help explain the concepts alongside the professor.",
            "comment_grading": "Very fair and good grading. Scored just above mean in the exam, Mean in the presentation and just above mean in the reflection.",
            "comment_workload": "Decent workload. If you pay attention in class its not that tough.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qN7k1CyI4O87n7XYhXJOD0wAriLAWkXg",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 215,
                    "name": "LAU, Pui Sang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Nicole Lee",
            "date": "Aug 31, 2020",
            "title": "",
            "comment_content": "This is a great choice as both a SSC- ST or SSC-SA course, especially if you're not looking for heavily science related courses. The content are mostly surrounding environmental issues and topics that have mostly been taught in high school (in biology or geography). <br /><br />Syllabus <br />L1: Introduction<br />L2: Anthropogenic Impacts on Natural System<br />L3: Planetary Boundaries for Human Thriving <br />L4: Humans Thriving<br />L5: Policy and Public Action For a Sustainable Future <br />L6: Sustainable Development<br />Midterm<br />L7: Energy <br />L8: Future For Water<br />L9: Circular Economy<br />L10: Sustainable Consumption<br />L11: Future Thinking<br />L12: Video presentation",
            "comment_teaching": "The professor is very nice and welcoming. He is open to questions whenever you ask both in class or through emails. He is also very open to suggestions to help improve his classes. We did games and did interesting activities which made the classes generally more entertaining since it is almost a 3 hour class!! He also gives us breaks (even on zoom) to help improve our concentration.",
            "comment_grading": "The grade is determined by weekly followup worksheets, midterm, group project and reflection essay. The worksheets are not hard to complete if you divide the work up evenly among your group and answer the questions accurately. The midterm is a little difficult since the time is quite limited. Memorize all content including specific examples for the midterm. The group project is not difficult but is research heavy. There is also a Q&amp;A session where you are asked questions by a panel of experts (professor and some other guests), this is the most challenging part of the whole course as they are very strict and critical when questioning about your solutions (group project).",
            "comment_workload": "The overall workload depends on your group mates (find good ones!!) since the group project and worksheets are all done as a group. You also need to discuss very often during classes and do tasks together. For final project, divide the tasks evenly and get everyone to answer questions during the Q&amp;A panel.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "UqDQbocpWEo9LQEe7Ep2TI1oFqyZbBzO",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "KDQL",
            "date": "Jul 07, 2020",
            "title": "NOT VERY GOOD GRADE",
            "comment_content": "DSE LS with something new<br />quite easy to understand <br />and quite interesting",
            "comment_teaching": "Not very funny <br />But you can learn a lot of new knowledge form him <br />He always share his own experience which is quite interesting.",
            "comment_grading": "midterm : mean <br />project : slightly above mean <br />worksheet: mean <br />personal reflection : mean <br />participation : mean <br />and i got B-<br />actually it is quite fair in UST<br />but it is not a good grade CC<br />as maybe you can get B if&nbsp;&nbsp;you got all things around mean.",
            "comment_workload": "Depends&nbsp;&nbsp;on your group-mate<br />project: quite easy to finish <br />mid-term : need some time to review the Powerpoint to get a mean",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "JVtU5ikcYpVnfJQfIva9Q0r1dBLEFbK6",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 215,
                    "name": "LAU, Pui Sang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "shirley115",
            "date": "May 09, 2020",
            "title": "",
            "comment_content": "Content mainly focuses on everything related to sustainability. There is only one lecture in a week but it lasts for three hours. There are in class activities each week and it is quite interesting and made the long lecture easier. The powerpoint slides were quite long and the words were a bit small",
            "comment_teaching": "Very dedicated professor as he has personal notes jotting down students' names and organises activities for student to participate each class, and it very interested in knowing student's thoughts",
            "comment_grading": "Grading is fair as I managed to get a B from the course with a little bit below mean from the midterm and above mean in the final project.",
            "comment_workload": "Not much to do for a common core course as there is only one midterm and the project, no final exam and worksheets(group work).",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "16Corm2kD4BB8vgEr26kiDPFoMVIXtPA",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 215,
                    "name": "LAU, Pui Sang",
                    "rating": 1
                },
                {
                    "id": 1242,
                    "name": "SHI, Xiaoming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Wendy123",
            "date": "Feb 18, 2020",
            "title": "",
            "comment_content": "Quite a lot of professional knowledge but it is interesting and let me know more about the environment. <br />There are group activities in every class.",
            "comment_teaching": "One professor always read from ppt<br />Other two can have more elaboration of the readings",
            "comment_grading": "As long as read materials the grade would be good<br />My midterm score is above mean and each group activity’s score is around mean. <br />I got B+ in final.",
            "comment_workload": "Midterm <br />One essay<br />Group project<br />A poster should be done but we didn’t need to finish it because of the missing class.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0DA4WeL0jHWcPIlHZja3im0a5zWI9Izl",
            "semester": "2019-20 Fall",
            "instructors": [
                {
                    "id": 215,
                    "name": "LAU, Pui Sang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Tyhxd",
            "date": "Jan 20, 2020",
            "title": "",
            "comment_content": "The content is quite straightforward and easy to understand. PowerPoint slides in the lessons is mainly the stuff you have to read for the exams and projects.",
            "comment_teaching": "Arthur's teaching is fair and there are lots of activities organised during the lessons, which can be annoying or interesting based on your perspective.",
            "comment_grading": "His grading for project is a little bit bad in my opinion. But the grading for exams is ok and fair.",
            "comment_workload": "The lessons are so long and can be very tiring, which can be good or bad based on your perspective as there is only one lengthy lesson per week. Attendance is also required.",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qF3misDB6dwuz5L3dTvxvqHMUFd2OwxG",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 215,
                    "name": "LAU, Pui Sang",
                    "rating": 1
                },
                {
                    "id": 908,
                    "name": "MOLE, David Stewart",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "*******",
            "date": "Aug 29, 2019",
            "title": "",
            "comment_content": "Stuff related to environmental issues with many specific terms.&nbsp;&nbsp;<br />Don't join this course if your English is really bad. <br />Suitable for hk students who are good at LS because you need to write a lot of meaningless words and construct a framework to explain your ideas.",
            "comment_teaching": "The prof. was quite nice with his Konglish accent. There were lots of presentations in class, nearly one per each lesson.",
            "comment_grading": "Grading is ok. Make sure your groupmates are good and responsible since the final project took us 40% of the grading. I shit the project which is below mean a little bit but I got all above mean in my written tasks then I just got into B range. <br />Also, attend every single lesson because you have 99% of chance to have a small group presentation in front of the class and that will be counted as your participation.<br />PS: I think it is better to make the prof. remembers you (otherwise I probably get a lower grade because of my project ;))",
            "comment_workload": "I think the workload is acceptable, we got one midterm, one final project and one reflection to be finished. There is no final. Although the prof. told us to read the ppt before coming to class, I never done that and that's still ok because the prof. will go through the slides with us finally. I only got tired by this course when having the lesson because I don't want to speak up in the class at all but you need to ;)<br />Last but not least, the workload of this course actually depends on your group ;))))))",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "oHApLADkDj6wF03rZSn1gon4A9jQvBqK",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 978,
                    "name": "SAUERWEIN, Meike",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "hii123",
            "date": "Jul 01, 2019",
            "title": "",
            "comment_content": "The course would also cover quite a lot of contents, and the concepts are mostly about geology and sustainability, yet the content is relatively easier when compared to other Common Core courses.<br /><br />The course would be divided into two parts. Part A would be explaining some key terms from the geography or anthropology field. Quite a lot of technical terms need to be memorized if you haven't studied Geography before. Part B would be covering the specific topics that are related to sustainability, such as energy consumption, fresh water usage etc. These topics are interesting as they are mostly related to daily issues. <br /><br />The course mainly consists of 2 grading parts, the project, and the midterm paper. For details, please refer to the latter part.",
            "comment_teaching": "Students are required to read a PowerPoint before going to class. The PowerPoint would be mainly about technical knowledge, which will be assessed in the midterm exam. <br /><br />The classes are interactive. The lecturer would throw out some questions and discussion would be carried out in a group format. Then the group would have to present their consensus in front of the whole class.<br /><br />BTW, there is only 1 lecture per week, and each lecture would last for around 3 hours. Therefore, sometimes you may find the lecture boring.",
            "comment_grading": "Mid-term Exam (35%)<br />Part 1 will require short answers to well-focused questions.&nbsp;&nbsp;&nbsp;&nbsp;<br />Part 2 will require longer, more open-ended responses to issues.<br /><br />Group project (40%)<br />- Pick 3 SDGs and investigate the SDG development in a chosen country.<br />- Complete a poster design and there will be an in-class presentation <br /><br />Reflection paper (15%)<br />- Reflect what you learn from the course<br /><br />Class participation (10%)<br />- Be active in class<br /><br />Generally, the sd for the group presentation, reflection paper, and class participation is very small. The only area that you could outperform in the class would be doing well in the midterm paper since the SD is quite high. If you are able to score 1-1.5 sd above the midterm paper and get a mean score for the rest, I think you are safe to get at least a B or B+.",
            "comment_workload": "The workload is not very heavy. I usually don't read the PowerPoint before class. It's OKIE to study them one to two weeks before the midterm.<br /><br />Each group would also have to complete a total of 5 research reports. They usually give out the research guidance 45 mins before the class ended and your group could complete it either within that 45 mins or after class. If the work is being evenly distributed, the workload is actually not that high.<br /><br />There is also a group project, which is to design a poster to illustrate the SDG development in a given country.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LX75HjgsdARKGMeAKwgWIyl6jLhYRS6V",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 1214,
                    "name": "LU, Zhongming",
                    "rating": 1
                },
                {
                    "id": 215,
                    "name": "LAU, Pui Sang",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "kero星人",
            "date": "Jun 07, 2019",
            "title": "",
            "comment_content": "So DSE LS like, in blended learning mode. Some are overlap with LIFS1030.<br />Personally think contents are quite easy, except factual stuff are much to memorise for midterm<br />First half will be more factual, required more understanding through self learn and will be examed in midterm<br />Second half is just project based, about sustainability goals of a specific country appointed, which four worksheets are done in class and only three count. Not difficult but need online researches. Some require submission in class, some 1 hour after class, and some 24 hours after class.<br /> A poster have to be completed based on the content in ws, and a presentation for three groups of assessor (10 min), but beware the time management and mode of assess for each grp are different.",
            "comment_teaching": "Very interactive, class activity and discussion every class.<br />My class Prof Lu is a very nice professor, and teach passionately. However, he has mandarin accent and not quite a funny one. I like his delivery style anyway :)<br />After midterm, the other two prof would take turns and deliver class to all sessions for the same lecture.<br />Prof Lau is a old style HK prof, do activities that are meaningless, eg measure water flow from tap which is kind of wastage of water.",
            "comment_grading": "Quite good.<br />Attendance, ws, and participation are easy to full marks.",
            "comment_workload": "Fair workload for project and reflection essay. Need to remember all ppt contents for midterm<br /><br />Midterm: write more than you need. Eg for choosing the important sustainable development goals in HK, 1 pt is given for suggestion of ways to improve HK<br />short questions + an essay question<br /><br />Project: having good groupmates are important (which must be compost of diff year and major)<br /><br />Essay: 500 words reflection for what you learnt and how it changed your vision.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "FQHcTGYm7rcTiQaSmzVXFJ5WQ2OoixYx",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "Tunaaaa",
            "date": "Jan 28, 2019",
            "title": "",
            "comment_content": "The content covered in class was very broad, and it teaches little stuff in every area. Its mostly memorising since it's hard to relate most of the content to our lives.",
            "comment_teaching": "The professor is very nice and talkative. She likes to interact with students and ask about how we think. There are also break time for us to relax after taking in the massive information in class.",
            "comment_grading": "Some of the grades are easy to get, like the participation mark and class work. The professor gives us time to work in group for the class work which makes it easier to work on. However for the final grade, which is based on a poster, is very bad.",
            "comment_workload": "Workload is mainly from reading the powerpoint provided&nbsp;&nbsp;since there're a lot of slides in every powerpoint. The class work wasn't that hard, since there is a lot of time to work on it.",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "LII7m3dCvTZr2QA6p1fwn2jO3irDeFZz",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 215,
                    "name": "LAU, Pui Sang",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "don11669",
            "date": "Dec 24, 2018",
            "title": "Maybe a choice for Year 1 students with the new, LS-like mid-term",
            "comment_content": "The course title is quite self-explanatory. It is basically an introduction on what is sustainability, what affect sustainability, and possible approaches to handle challenges to sustainability. For my own opinion, it is quite interesting that the course kept telling us how our daily behavior, other than policies, affect sustainability, and allow us to think what can we do daily as well as which approaches do we support and prefer for making our society more sustainable.&nbsp;&nbsp;Maybe a little difficult to understand some of the content though.",
            "comment_teaching": "One 3-hour lesson per week. This term the entire Part A is taught by one instructor, and instructors of other sessions came to teach in each other's lesson for Part B. Reading material is an important part of the course, we were expected to have done the reading, so on lesson they would rather introduce examples or having activities related to the concepts mentioned in the reading materials, mostly without repeating them. However the fact is most students didn't have a look of the reading materials at all, but due to the fact that they focus more on discussions and activities in class, you still won't have a really bad time in lesson, and can always look at the reading material in lesson if necessary. Overall, lessons were quite inspiring and led us to think.",
            "comment_grading": "Mid-term Exam (35%)<br />It seems like it is the first time we got a mid-term for this course. It involves content in Part A, and question type is quite similar to DSE LS, except you have to remember and use specific concepts from the reading materials, such as Planetary Boundaries, SDGs etc. , which would be stated in the questions.<br />Mean: 24.4 High: 32.6 Low: 0<br /><br />Take-home, written assignment (15%)<br />One written assignment on a given topic at the end of the course. They said they expect around 800 words, but I made it almost 1000 words and some maybe even longer. They mentioned that something like a diary entry rather than an essay is expected.<br />Mean: 11.8 High: 14 Low: 0<br /><br />Class attendance and participation (10%)<br />They takes attendance in each class and expect participation in in-class discussion. There were some really active students and they often raise questions of others conclusion on activities, thus discussions can happen anytime in class!<br />Mean: 6.9\tHigh: 10<br /><br />Group project (40%)<br />-15% for project worksheets done in week 7-10, each per week, and only the best 3 worksheets will be counted<br />-20% for poster and presentation done in week 13, which is about sustainability challenges and possible solutions in a specific, assigned country, and project worksheets can help its accomplishment a lot<br />-5% for peer reviews<br />Mean: 20\tHigh: 23.6 Low: 14.5<br /><br />30.1/35 for mid-term, 13/15 for reflection paper, 9.5/10 for participation, 14.4/15 for project worksheets, 21.7/25 for poster&amp;presentation+peer review---&gt;A<br /><br />I would say you can get a satisfying grade as long as you do treat this course seriously, and as the mid-term has a similar mode as DSE LS, maybe Year 1 student would get a little bit advantage.",
            "comment_workload": "Workload is quite light. Students were expected to read the reading material given every week before the lesson, which is around 70-80 pages of slides for Part A, and 50-60 pages for Part B. Mid-term Exam was basically set on the slides in Part A, and the content of them were mostly not repeated at lessons, so make sure you do read them. However, for Part B, those materials may not help a lot on the group project, but it will always be better to read them so that you understand easier what's going on at the lessons. <br /><br />Among the 4 project worksheets, 2 of them with deadlines set at 24 hours after the lesson may require a little bit research on the Internet after lesson, but it didn't really take much time for me. <br /><br />With all the project worksheets, the project also wouldn't bring too much workload, as long as you don't meet a full group of free- riders. Luckily, all of us in my group were willing to work, so workload is not too high for each of us.",
            "rating_content": 5,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 2,
            "vote_count": 4,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "AzrMyJWcJkw91o2G1MKR4Ifz1olDH8U6",
            "semester": "2018-19 Fall",
            "instructors": [
                {
                    "id": 978,
                    "name": "SAUERWEIN, Meike",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lonelyguy",
            "date": "Dec 04, 2018",
            "title": "",
            "comment_content": "The content was actually difficult and vague as you cannot relate the concept to daily life context. It makes me difficult to fully understanding those environmental concepts given that I am a business student. Yet, the contents were interesting after the midterm exam.<br /><br />Week 1: Introduction<br />Week 2: Anthropogenic (human) impact on natural systems<br />Week 3: Planetary boundaries and Earth systems<br />Week 4: Holiday<br />Week 5: Human thriving within planetary boundaries and strategies for sustainability<br />Week 6: Policy approaches for sustainability<br />Week 7: Sustainable development and sustainable communities<br />Week 8: Energy futures<br />Week 9: Futures for freshwater<br />Week 10: Urban futures<br />Week 11: Sustainable consumption and design for a circular economy<br />Week 12: Future<br />Week 13: Final project presentations",
            "comment_teaching": "Professor Meike is super nice. She always smiled at us and provided a casual and interactive learning atmosphere. She loved asking questions and answering her questions could gain class participation mark as well.<br /><br />Her class was 9 am class, so it was actually quite hard for students to attend a 3 hour class per week. But, many students would attend her lessons, perhaps attendance counting was one of the reasons.<br /><br />After midterm, her colleagues would teach some topics and I did not really love it as the consistency might be affected and their other professors were actually quite creepy. Luckily I did not choose their lectures.",
            "comment_grading": "Fair grading. This semester they added Mid Term Exam which it did not appear in the past few years. So, we did not have any sources and the format was unclear as well. The weighting was too heavy and it becomes the grade differentiator since everyone gets a similar score in other components, even in the project.<br /><br />35% Mid-term Exam (23.8/35 Mean: 25.7)<br />15% Reflection Paper (11.5/15 Mean: 10.8)<br />10% Attendance and Participation (8/10 Mean: 7.4)<br />40% Group project (36.04/40 Mean: 33.5)<br />- 15% Project Worksheet (best 3 out of 4) <br />- 5% Peer Evaluation<br />- 20% Poster and Presentation<br /><br />Final Grade: B (79.3%)<br />80% B+, 4% every sub-grade",
            "comment_workload": "A 3-hour class. Only 1 lecture per week so the workload was fine.<br /><br />Have powerpoint slide before class and they expected you to read them but every chapter's slides were 80 pages long and you won't understand all of those concepts. Yet, they won't repeat too much on those concepts bruh.<br /><br />The project was fine but required students from different school and year which was a bit nonsense in some ways, yet it means that you may not be able to stick with your friends to do the project together.<br /><br />Starting from week 8, your group will have to finish a project worksheet in class. First 2 worksheets only allow you to finish within 1 hour. The last 2 worksheets have 1 day for you to finish it. Yet, the grade for every group is high.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "2JNvc5W2KRj8tR23oOTG9xfNQPVPrtdf",
            "semester": "2017-18 Spring",
            "instructors": [
                {
                    "id": 908,
                    "name": "MOLE, David Stewart",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "淺水健",
            "date": "Aug 19, 2018",
            "title": "",
            "comment_content": "for the content of the course, it is similar to the LS course in our secondary school. Concerning social issues. But the topic of the assignment is not clear, they give a sentence of topic and you need to write two 800 words essay and hand in in mid-term and final period .",
            "comment_teaching": "teaching is boring, they just buy some snack to attract student to participate the class, many of us leave the lesson during break time.",
            "comment_grading": "grading not so good",
            "comment_workload": "there are not so many workload in this course, just one ppt before each lesson. It is optional to read and the instructor will ask questions that content about those information during lesson. If you want to get all 5 marks of class performance, that will be a good choice for you to do it",
            "rating_content": 2,
            "rating_teaching": 1,
            "rating_grading": 1,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "kfVdwXV3JAAbIs96uuDNmGrdNioFwfJt",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "smallpotato tom",
            "date": "Jan 31, 2018",
            "title": "Not bad not good",
            "comment_content": "diversified, but not easy to follow all materials<br /><br />at least this course made me think a lot<br /><br />but a lot of materials are quite hard, just like those in MECH1906",
            "comment_teaching": "some kind of bore, but he always gives snack break in the middle of lesson",
            "comment_grading": "i got 2 quiz full marks, 3 quiz around mean<br /><br />all individual reports got above mean<br /><br />grade around 'mean' in the final project<br /><br />B-",
            "comment_workload": "no homework<br /><br />but 3-hour lesson is not that easy<br /><br />pop quiz in every lesson<br /><br />if you got good project partners, it is better",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "iPa5dAZ6N00ljLjmLMtGU9GKJiuOYKEY",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "cynnie",
            "date": "Jan 20, 2018",
            "title": "Fair grading, okay workload",
            "comment_content": "Well in general, the content is about the sustainability of environment in different aspects, like overfishing or biosphere. Sometimes the content is really easy for instance global warming, but sometimes it requires some knowledge in biology to understand the life cycle",
            "comment_teaching": "A generally really interactive course as the professor tries to engage all the students to join in class discussions or activities. The slides used in classes are also different from the slides required to prepare beforehand, so it won’t be that repetitive.",
            "comment_grading": "Fair grading. I got slightly above mean for all assignments, quizzes and presentation, ended up with a B+.",
            "comment_workload": "I would say the workload is adequate considering that there are no midterms or no finals:)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "wC0HBudR5yJ9RYSBQm8KxLvrsuVAjBR7",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "ggyyfku",
            "date": "Jan 15, 2018",
            "title": "normal grading course",
            "comment_content": "It would be difficult to catch up if you did not take any chemistry and geography as electives in secondary school",
            "comment_teaching": "every time they taught with ppt, <br />questions and worksheets are designed for students to discuss in group on the lessons. <br />the only thing i like is that they provide free snack( biscuits and grapes) during break :D",
            "comment_grading": "normal grading<br />not so-called &quot;good grade course&quot;",
            "comment_workload": "almost has quiz in&nbsp;&nbsp;every lesson.<br />Quiz contains 5 mc/sq <br />No midterm and final<br />but have two assignments and one project <br />Quizzes contains 25%, participation&nbsp;&nbsp;in class contains 5%,<br />2 assignments contains&nbsp;&nbsp;30% and <br />Group project&nbsp;&nbsp;40% on total grade.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ch99RVxU0xf2X4U1oZfZ5YNzBDx1bNJL",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 223,
                    "name": "FORSTER, Paul Whitfield",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "ustkidhere",
            "date": "Jan 13, 2018",
            "title": "Grading system could be improved",
            "comment_content": "The content is fairly easy and provides a good insight into the issues of sustainability.",
            "comment_teaching": "Teaching style includes interactive powerpoints and group discussions, which are very different from the usual lectures. It's a fun way to learn if you hate spoonfeeding lecture styles. <br /><br />Best part is, since this is a 3 hour lecture, halfway through you get a 10 minute break and they provide snacks. It's absolutely sweet of the professors to do this and encourages students to attend the lectures.",
            "comment_grading": "Doesn't take attendance but there are quizzes during the beginning of some lectures about the required reading. <br /><br />In-class comprehension quizzes&nbsp;&nbsp;25%<br />Class participation&nbsp;&nbsp;5%<br />Take-home assignments&nbsp;&nbsp;30%<br />Group project&nbsp;&nbsp;40%<br /><br />The in-class quizzes are written in a way that the answer is questionable and can be debated. There have also been several mistakes in the in-class quizzes so hopefully they'll have corrected and improved these for the next semester.<br /><br />Take-home assignments include writing two short essays that don't require much research, but rather your thoughts on the course and topic of sustainability in general. <br /><br />Beware of the heavy grading for the group project. If you get free-riders then you're going to have more workload so the advice is, get the other marks from participation, in-class quizzes and take-home assignments so you worry less about the group project.",
            "comment_workload": "Compared to other courses, the workload is higher but if you like what you're learning, it shouldn't be too tough. You can finish the take-home assignments in less than a day. The one that requires most work is the group project, where you'll have to meet up with your groupmates for research and prep for presentation.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": false,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "rZk0TGJc1lOJZ8JhyUuKEbVDUzeXCbfU",
            "semester": "2016-17 Fall",
            "instructors": [
                {
                    "id": 908,
                    "name": "MOLE, David Stewart",
                    "rating": 0
                },
                {
                    "id": 761,
                    "name": "BOOKHART, Davis Boyd",
                    "rating": 1
                },
                {
                    "id": 230,
                    "name": "CHAN, Kit Yu Karen",
                    "rating": 1
                },
                {
                    "id": 223,
                    "name": "FORSTER, Paul Whitfield",
                    "rating": 1
                },
                {
                    "id": 78,
                    "name": "LAU, Alexis Kai Hon",
                    "rating": 0
                },
                {
                    "id": 640,
                    "name": "LOY, Michael Ming-tak",
                    "rating": 0
                }
            ],
            "is_author": false,
            "author": "kentanggoreng",
            "date": "Jan 25, 2017",
            "title": "New interesting yet really messy course",
            "comment_content": "It has a really broad content regarding sustainability, from its science perpective, toward business and engineering perspective. The class was heavy on lectures but shifted toward interaction in a small classroom.",
            "comment_teaching": "Some instructors were enjoyable, some were total crap. Karen is not teaching anymore next semester so I guess there will be more crap instructors than decent ones. Oops. :)",
            "comment_grading": "Grading was OK, but I think for very easy quizzes and project assignment, they shouldn't had curved the course. I was scared for my life waiting for my grades.<br /><br />The group project was worth 60% percent, which was hella lot, compared to the amount of workload we had to do.",
            "comment_workload": "5 quizzes, only 4 taken into final grade. 10% each. They started giving really short and easy quizzes (5 to 10 multicle choices) but changed it to a more problem solving essay kind of questions in the middle of the course. They were still &quot;treading the water&quot; and used us as guinea pigs. I think giving 5-MC-quiz a 10% weight is a bit saddistic, but some people like it that way.<br />There's no midterm and no finals. Only a group project that worth 60 whopping percent. Group members were randomized. You had to pick one out of 6 instructors as your mentor.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 5,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 0,
            "voted": false,
            "is_upvote": false,
            "comment_count": 2,
            "attachments": []
        },
        {
            "hash": "Ppi7RVXcaPa91Cmul8voEMTxcY4s0bol",
            "semester": "2016-17 Fall",
            "instructors": [],
            "is_author": false,
            "author": "janette",
            "date": "Jan 20, 2017",
            "title": "fair grading, low workload, but be aware of the heavy weighting of group project",
            "comment_content": "mostly simple concepts based on high school knowledge",
            "comment_teaching": "5-6 lecturer in total.<br />each of them comes from departments of engineering, science and&nbsp;&nbsp;business schools respectively<br />Every lecturer has their own teaching style.<br />some read powerpoints only, some encourage student discussion.",
            "comment_grading": "quite good, mean is around B to B+",
            "comment_workload": "the workload is quite low. <br /><br />1.Short in-class quizzes at the end of key sections of the course (40%)<br />2. Completion of a project to be presented in the final sessions of the course (60%)<br />In-class quizzes<br /><br />There will be 5 in-class quizzes, each worth 10% of the total course grade. Your best four results will be counted to the final grade",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 1,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 1,
            "attachments": []
        },
        {
            "hash": "pKzn5VA7BL6zBLM1YJryhMHr8aq3iuGY",
            "semester": "2022-23 Spring",
            "instructors": [
                {
                    "id": 978,
                    "name": "SAUERWEIN, Meike",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "G1gi",
            "date": "Jun 07, 2023",
            "title": "Good common core course!",
            "comment_content": "Assessment<br /><br />Mid-term Exam (30%)<br />Open book exam, common to all sections, covering Part A (Lecture 1-6) of the course (2-hour exam).<br /><br />Mini quizzes (15%)<br />Starting from Part B, a short quiz is conducted for each lecture to test our basic understanding of the concepts covered in the required readings, different to all sections. Each quiz will account for 5 points. The best three out of five quizzes will count towards the final grade.<br /><br />Group project (35%)<br />We worked in groups to research and identify the key sustainability challenges and provide possible solutions for a selected world region. <br /><br />Two Interim Reports (15%)<br />Two interim reports are required to report on the progress of the project.<br /><br />Interim report #1 (5%) – a broad overview of the selected countries' situation<br />Interim report #2 (10%) – evaluation of sustainability challenges in the selected country<br /><br />Poster (15%)<br />A poster concisely detailing the findings is presented during the final lecture. There were individual Q&amp;A sessions with the instructors. We also received questions and feedback from your peers. <br /><br />Peer Review (5%)<br />5pt of the grade was from peer evaluations based on the student's contribution to the group project. Comments were mandatory and reviewed by the instructional team to ensure fairness in evaluation.<br /> <br /><br />Written Essay (10%)<br />There was one short (800-word) written assignment to demonstrate our overall understanding of the issues covered in the course.<br /><br />Class attendance and participation (10%)<br /><br />The course included in-class activities and discussions to facilitate student learning. 7% of the grade is given for attendance and in-class participation (proactive in discussions and activities, interactions with instructors, TAs and peers, etc). 3% of the grade was on the peer evaluation of our group members based on their contributions during in-class activities.",
            "comment_teaching": "Meike is a good instructor, very friendly with excellent English. She managed to deliver the lectures and activities clearly, and we always had a chance to share our ideas. The class activities are fun and interesting.",
            "comment_grading": "GOOD GRADE!<br /><br />For our class: <br />LQ: 70.85/100<br />MEAN: 76.67/100<br />UQ: 87.18/100<br />ME: 84.85/100<br />My final grade: A- <br /><br />Even though you don't hit the upper quartile, you still have the chance to get A range",
            "comment_workload": "I won't say the workload is heavy when you have good time management. <br /><br />Part A content of the course will be tested in midterm only. There is not much to memorize as it is concept based, and we had an open-book exam (A4 papers were allowed). <br /><br />Part B content about SDGs will be tested in the quiz, and knowledge will be helpful for the project. There is also nothing to memorize as all the quizzes are open-book. Note that it is hard to score full points as there will be a mark deduction when you choose a wrong answer. <br /><br />Some people may be stressed out about scoring more in-class participation. I am also introverted and shy, but I still managed to score full marks for class participation by typing answers/ comments on Zoom and presenting our group's ideas occasionally.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "01tRMlw31qOf7p0aCqI6j3SwCuvCD1tf",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1214,
                    "name": "LU, Zhongming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "GorGor123321",
            "date": "Jan 31, 2023",
            "title": "SUST1000 short review",
            "comment_content": "Easy concepts related to sustainability<br /><br />L1 - Introduction<br />L2 - Anthropogenic Impact on Natural Systems<br />L3 - Planetary Boundaries<br />L4 - Human Thriving<br />L5 - Policy<br />L6 - Sustainable Development<br />L7 - Energy<br />L8 - Fresh Water<br />L9 - Design for a Circular Economy<br />L10 - Sustainable Consumption<br />L11 - Futures Thinking<br />L12- Poster presentation and sharing",
            "comment_teaching": "Interactive and relaxing mode of teaching skill is used. <br />It requires quite a lot group discussions which counted as participation marks. Long lecture (3 hours) but very interactive. First half is the traditional teaching (textbook), second half are the group discussion, some funny games, some videos.",
            "comment_grading": "Grading is fair. I have above mean in every assignments included the short quizzes and midterm. <br />Overall, I have a A-.<br /><br />All of my scores are above mean, <br /><br />Mid-term Exam (30%) <br />24/30 <br /><br />Group project (35%) <br />Including two group reports and poster presentation<br /><br />Mini quizzes (15%) <br />5 mini quizzes but only the best 3 will be counted<br />Me: 11/15<br /><br />Reflective Essay (10%) <br />9.5/10 (Highest) <br /><br />Class attendance and participation (10%)",
            "comment_workload": "Workload is fair. The group projects are very important. Those short quizzes are quite challenging which may test some minor stuffs in notes. Better spend more time in the revision of short quizzes.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "2adu4FyluJzSGs3q1UAZwSyfb2MW8kzd",
            "semester": "2022-23 Fall",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "sunshine&tmr",
            "date": "Dec 29, 2022",
            "title": "",
            "comment_content": "Provides students&nbsp;&nbsp;with a holistic, interdisciplinary, evidence-based understanding of the challenge&nbsp;&nbsp;of&nbsp;&nbsp;ensuring&nbsp;&nbsp;the&nbsp;&nbsp;sustainability&nbsp;&nbsp;of&nbsp;&nbsp;humanity&nbsp;&nbsp;on&nbsp;&nbsp;a&nbsp;&nbsp;planet&nbsp;&nbsp;with&nbsp;&nbsp;limited&nbsp;&nbsp;natural&nbsp;&nbsp;and&nbsp;&nbsp;social capacities. The course introduces frameworks, approaches and key trade-offs underpinning efforts to deal with existing and emerging global issues, and considers how these problems relate to&nbsp;&nbsp;our&nbsp;&nbsp;own lifestyles.",
            "comment_teaching": "Engaging, frequently holds discussions in-class. Appreciative to students' contributions, gives positive and constructive feedback. TA Liu and Chen are very responsible and helpful. Instructor is also friendly and willing to answer students' enquiries.",
            "comment_grading": "Quite Good.<br /><br />Mid-term Exam (30%) on first half of course content<br />Mini quizzes (15%) Counts best 3 out of 5. Make sure you are very attentive and awake when doing them.<br />Group project (35%) - 2 Interim Reports &amp; 1 Poster Presentation<br />Written Essay (10%) - Reflection Paper<br />Class attendance and participation (10%) - Peer Review (3%), Attendance (3.5%), In-class engagement (3.5%)",
            "comment_workload": "Satisfactory.<br />But significant increase in workload from the second half of the class, since you have to handle mini quizzes weekly, Interim Report 2, Poster &amp; Reflection Paper.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "PPdMhE8ONlBZjC1u3zHPDvsQCVdiHyqV",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1242,
                    "name": "SHI, Xiaoming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "samyuktha",
            "date": "Aug 19, 2022",
            "title": "Requires a lot of participation",
            "comment_content": "1. Introduction<br />2. Anthropogenic (human) impact on natural systems<br />3. Planetary boundaries and Earth systems<br />4. Human thriving within planetary boundaries<br />5. Policy approaches for sustainability<br />6. Sustainable development and sustainable communities<br />7. Energy futures<br />8. Futures for freshwater<br />9. Design for a circular economy<br />10. Sustainable consumption<br />11. Futures thinking",
            "comment_teaching": "The Professor is someone who is open to everyone's point of view. Even if it is wrong he will never say it to your face but will twist it a bit so that everyone in class understands what the correct point is. The first half an hour of the course is all about reviewing slides he assigns and possibly a mini quiz. The next half an hour involves group activities and presentations where you really get to participate in class. <br /><br />DO PARTICIPATE IN CLASS ITS SUPER SUPER IMPORTANT.",
            "comment_grading": "",
            "comment_workload": "While its a bit hard to sit through a 3 hour class (especially if online) you're done with majority of the workload for this course within the first half of the semester since midterm counts for 50% of grades. Mostly based on qualitative and factual reasoning they look for essay type answers in the assignments and exams.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 4,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": false,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "ABPimB5wDZE0TR3t8JbQpSzJjF9G4GXp",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "M.J.",
            "date": "Feb 14, 2021",
            "title": "",
            "comment_content": "This course is an introductory sustainability course, which is generally easy to understand.",
            "comment_teaching": "Generally, each lecture is divided into three parts. In the first part, Benjamin explains the concepts of sustainability. In the second part, we need to do group exercises in breakout rooms. In the last part, we will go back to the main room and each group needs to present their ideas of the group exercises. Benjamin will give comments after each group presents its ideas. So, this course is relatively interactive, as you do not need to be lectured for the whole of 3 hours.",
            "comment_grading": "It is an intensely competitive common core course. I do not know the grading scheme of this course. Even though I sent an email to the TA and the professsor, they did not tell me the grading scheme and the cut-off scores of each sub-grade. I guess our performance is graded by curve. <br /><br />The marking scheme of the group project is ambiguous. Even though our group tried to fulfill all requirements, we still did not get a high mark. We created a group poster with high quality, which might be better than others. But the mark we got in the poster was below mean.",
            "comment_workload": "The workload of this course is neither too heavy nor too light. It is generally acceptable. But you still have a lot of work to do.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 2,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Qglkdr6nwai4mi48qZdB2hHSm0eoPi9B",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1214,
                    "name": "LU, Zhongming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "summm",
            "date": "Jan 08, 2021",
            "title": "",
            "comment_content": "everything about sustainability and UN SDGs<br /><br />first half of the course (materials for midterm)<br />1. Introduction<br />2. Anthropogenic impact on natural systems<br />3. Planetary boundaries<br />4. Human thriving<br />5. Policy<br />6. Sustainable development<br />----<br />second half of the course (materials for mini quiz at the start of each lesson)<br />7. Energy futures<br />8. Futures for fresh water<br />9. Design for a circular economy<br />10. Sustainable consumption<br />11. Futures thinking",
            "comment_teaching": "haven't listen much in class because the lesson time is too long and it is hard to stay awake during class<br /><br />even though the professor often spells his words incorrectly and has a weird accent, but i can feel that he has his own passion in sustainability and he really does have hope that the world will not blow up (lol)",
            "comment_grading": "midterm: 35%<br /><br />mini quizzes (for each lesson of the second half of the course): 15%<br />- choose 3 out of 5 mini quizzes<br /><br />group project: 25%<br />- 2 interim report (5%*2)<br />- poster (10%)<br />- peer review (5%)<br /><br />written essay: 15% <br />- similar to reflection essay and guidelines will be given<br /><br />class attendance and participation: 10%<br /><br />my results: <br />midterm: 31/35 (mean: 27.9)<br />mini quizzes: 15/15<br />group project:<br />- interim report 1: 4.68/5 (mean: 4.5)<br />- interim report 2: 3.6/5 (mean: 3.8)<br />- poster presentation: 10/10 (mean: 7.9)<br />- peer: 5/5<br />reflection paper: 12/15 <br />participation: did not release grades; but i have participated in class discussions for 3 or 4 times in class (which is not a lot compared to many people who are actually very active) and presented class activity tasks in class for a few times<br />-- final grade: A <br />I originally thought that the grades will be quite competitive and there might be a narrow curve, but in the end I got an A, so I guess grading is quite good.",
            "comment_workload": "as expected<br /><br />learning about sustainability stuff means that there are a lot of projects and research, so if you want to reg this, expect doing research, thinking innovative ideas, writing reports, reading pre-lecture notes before class these stuff etc<br /><br />i think the workload is a bit big for me as the projects deadlines and midterms were always near my other course assignments or midterms so i end up having consecutive days of deadlines or midterms<br /><br />quite satisfied tho seeing yourself start from scratch in the interim reports and then creating an A1 poster and present your whole idea to prof and TA",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "py9L9ZSVJojfhoclOQcThj9cH37CE9OH",
            "semester": "2019-20 Spring",
            "instructors": [
                {
                    "id": 1402,
                    "name": "STEUER, Benjamin",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "freebus",
            "date": "Aug 09, 2020",
            "title": "SUST 1000",
            "comment_content": "Part A (Mid-term Content)<br />1. Anthropocene and Sustainability<br />2. Anthropogenic Impact on Natural Systems <br />3. Planetary Boundaries for Human Thriving<br />4. Human Thriving Within Planetary Boundaries<br />5. Policy and Public Action for a Sustainable Future <br />6. Sustainable Development <br /><br />Part B (No-one-cares Content)<br />7. Futures for Energy <br />8. Futures for Fresh Water <br />9. Design for a Circular Economy <br />10. Sustainable Consumption <br />11. Preferred Futures",
            "comment_teaching": "The professor is nice and friendly. Every lesson (3 hr) is divided into three sections: <br />(i) Introduction (going through the required reading slides that you should have studied before class)<br />(ii) Activities or Games (divided into groups of 4-5, having individual tasks and/or group discussions, and presenting to the class)<br />(iii) Conclusion (going through remaining slides)<br />You should always be ready to answer questions, i.e. about the required reading or the in-class discussion, which forces you to pay attention during class. The professor will random pick people to make sure everyone is participating, around ten times per lesson. But you will be fine with the questions because the professor will praise every reply for real.",
            "comment_grading": "Grade Distribution: A – 25%; B – 50%; C – 23-25%; D/F – 2%<br /><br />1. Midterm Exam – 35%<br />2. Group Project – 40%<br />-- In-class Worksheets (Lesson 6, 7, 8, 9) – 15% (5% each, best 3 out of 4)<br />-- Presentation (Lesson 12) – 15%<br />-- Peer-review – 10%<br />3. Reflection Assignment – 15%<br />-- 800 words maximum<br />-- 3 questions answering in one essay<br />4. In-class Engagement – 10%<br />-- Attendance – 5%<br />-- Participation – 5%<br /><br />Midterm Exam: 33.25/35 (Mean: 25.2/35)<br />In-class Worksheets: 14.5/15 (Mean: 13.5/15)<br />Presentation &amp; Peer-review: 23.6/25 (Mean: 21.3/25)<br />Reflection Assignment: 12/15 (Mean: 11.3/15)<br />In-class Engagement: 8/10 (Mean: 8/10)<br /><br />Overall: 91.35/100 (Mean: 79.3/100)<br />Grade: A+<br /><br />Midterm has the largest SD, so doing well in midterm means everything. The range of other assessments are always within 1-2 marks.",
            "comment_workload": "Average workload if no free rider in your group, but it won't be very light in general.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "qobDTZ7oSXtsk78hv4ZLpLvXf5iIlA7i",
            "semester": "2018-19 Spring",
            "instructors": [
                {
                    "id": 1214,
                    "name": "LU, Zhongming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "IY",
            "date": "Jul 06, 2019",
            "title": "Lesson time flies quickly",
            "comment_content": "Introduction to sustainability as the name suggests. Quite many slides in each powerpoint but easy to understand because some are just common sense. You need to understand the key concepts and explain them in your own words in midterm exam (but I don't think they expect you to recite every single technical term).<br /><br />Also, there is only one midterm exam (which covers part A of the course) and no final. So you don't actually need to care much about part B.<br /><br />PART A<br />Introduction<br />Anthropogenic (human) impact on natural systems<br />Planetary boundaries and Earth systems<br />Human thriving within planetary boundaries<br />Policy approaches for sustainability<br />Sustainable development and sustainable communities<br /><br />PART B<br />Energy futures<br />Futures for fresh water<br />Urban futures<br />Sustainable consumption and design for a circular economy<br />Futures thinking<br /><br />By the way, there is a group project in which we have to design a poster on the topic of sustainability in a group of 6 (with groupmates from different years and different schools). Many groups will put much content on the &quot;poster&quot; and make it like a infographic. The professor will probably show you some good samples as reference though.",
            "comment_teaching": "Quite interesting. There are many class activities so although each lesson lasts for 3 hours, you don't feel bored. Part A of the course was taught by my own professor (i.e. Prof Lu). Part B was taught by instructors from other sessions.<br /><br />Prof. LU has a pretty strong mainland accent. However, I think it is still easy to understand what he says. He doesn't speak too fast and is quite encouraging. He wants students to participate in class but he won't force you to do so. <br /><br />Other instructors are also nice and present their materials clearly.",
            "comment_grading": "I didn't pay much effort in this course and managed to get a B+ so it's fair grading for me. Many people say you need to answer a lot of questions in class. I only answered one question throughout the whole semester but still got a good mark in participation. Midterm consisted of long questions. A bit like LS and you need to apply the concepts in real life. Group project is the most important component in this course so make sure you do it seriously.",
            "comment_workload": "- Take attendance<br />- One midterm but no final<br />- A group project (need presentation)<br />- A reflection essay (800 words)<br />- One 3-hour lesson each week<br />- One to two class activities per lesson<br />- No quiz<br />- Required reading PPT slides (supposedly) to be read before each lesson (~70 slides usually)",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "bVeHRQRuGz3f2juJnf7cFHFxUPxQRwov",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "aspatel",
            "date": "Jan 29, 2019",
            "title": "",
            "comment_content": "Content is quite broad and as a result you don't get a lot of detail into each aspect however, it is quite interesting ad optional reading materials are provided. Topics include:<br />- anthropogenic impact<br />- planetary boundaries<br />- human thriving<br />- policy<br />- sustainable development<br />- energy<br />- water<br />- urban features<br />- sustainable consumption",
            "comment_teaching": "The teacher is very friendly and the classes are quite interactive. Most of the lectures are discussions and every week there is also an in-class activity. Although the lectures are long, time passes quickly because the content is interesting.",
            "comment_grading": "Grading is extremely fair. The midterm consists of short essay questions and the professor is willing to negotiate and accept any reasonable response. for the midterm, make sure you remember a case study for the main topics as it will help boost your grade a lot. <br />Group Project: 40%<br />Individual Reflection essay: 15%<br />Participation: 15%<br />Midterm:&nbsp;&nbsp;30%<br />In the end I got an A- even without much participation. Just make sure you attend every class so the professor remembers you.",
            "comment_workload": "Workload is extremely light and I think this class is an easy A. The slides for each class are released 24 hours in advance and you are supposed to read through them before attending so you have enough knowledge to participate in class, however I only did this once throughout the whole semester and was fine. Most of it is common sense so you can get away with just sharing your own opinions. Apart from that the only other work you have is the group project which is a poster you need to make. It doesn't take very long as you are given class time to work on it as well.",
            "rating_content": 4,
            "rating_teaching": 4,
            "rating_grading": 5,
            "rating_workload": 5,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": true,
            "has_essay": false,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "Xrh52Z5fG3Snd2otinm4TyQGDDmBD6Ip",
            "semester": "2017-18 Fall",
            "instructors": [
                {
                    "id": 78,
                    "name": "LAU, Alexis Kai Hon",
                    "rating": 1
                },
                {
                    "id": 223,
                    "name": "FORSTER, Paul Whitfield",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Stevekc",
            "date": "Jan 19, 2019",
            "title": "",
            "comment_content": "This course introduces students to the full scope of the issues related to the sustainability of humanity on a planet with limited natural and social capacities. The principal contributions of science, engineering, business management, the social sciences and humanities to understanding and resolving these issues will be reviewed, providing students with a gateway to further studies in sustainability.",
            "comment_teaching": "Lectures tend to focus on theories as opposed to solving questions. I suggest attending all tutorial lessons as they provide useful resources and teach you how to answer exam style questions.",
            "comment_grading": "",
            "comment_workload": "",
            "rating_content": 3,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": false,
            "has_project": false,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 1,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "g2zqQc2LBT7eB4xHCbxgQtL1AEWRz9Z2",
            "semester": "2021-22 Spring",
            "instructors": [
                {
                    "id": 1214,
                    "name": "LU, Zhongming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "Kennith",
            "date": "Aug 25, 2022",
            "title": "Weird Course",
            "comment_content": "introduction to sustainability<br />-basic topics and basically common sense knowledge, you can hardly find new/ difficult concepts, simply common sense explained in details and sustainability terms.<br />-Anthropogenic (human) impact on natural systems <br />-Planetary boundaries and Earth systems <br />-Human thriving within planetary boundaries <br />-Policy approaches for sustainability&nbsp;&nbsp;<br />-Sustainable development and sustainable <br />communities <br />-Energy futures&nbsp;&nbsp;<br />-Futures for freshwater&nbsp;&nbsp;<br />-Design for a circular economy&nbsp;&nbsp;<br />-Sustainable consumption<br />-Futures thinking",
            "comment_teaching": "-discussion and activities are prepared every lecture.<br />-lot's of videos and clips, it is quite boring using zoom but I guess it should be better with face-to-face teaching mode.",
            "comment_grading": "Mid-term Exam (30%) <br />Mini quizzes (15%) <br />Group project (35%) <br />Written Essay (10%) <br />Class attendance and participation (10%)",
            "comment_workload": "normal workload as you'll need to read pre-lecture materials every week, finish 5 mini-quizzes (5mcqs each), and 2 group projects and a written essay",
            "rating_content": 3,
            "rating_teaching": 4,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "hTYOqqrDHptcOdDjYdvAjb16Ue5i4uMK",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1214,
                    "name": "LU, Zhongming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "exwarty",
            "date": "Aug 26, 2021",
            "title": "",
            "comment_content": "1. Introduction<br />2. Anthropogenic impact on natural systems<br />3. Planetary boundaries and Earth systems<br />4. Human thriving within planetary boundaries<br />5. Policy approaches for sustainability<br /><br />Midterm<br /><br />6. Sustainable development and sustainable communities<br />7. Energy futures<br />8. Futures for fresh water<br />9. Design for a circular economy<br />10. Sustainable consumption<br />11. Futures thinking<br /><br />Overall content was broad but relatively easy to understand",
            "comment_teaching": "As there's only one lesson per week, the lecture is around 3 hrs long. It can get quite boring really quickly, but there are 2 breaks during class (at least for online courses)<br /><br />It feels like the professor kind of knows what he's talking about, but I feel like most of the time he's just reading off his own notes, which is fine but again, it can get quite boring at times when you can just read lecture notes yourself.<br /><br />TAs are only there when you are divided into breakout rooms and they monitor you to make sure that you have your cameras on for marks",
            "comment_grading": "30% midterm<br />35% group project (2 interim reports 15%, poster 15%, peer evaluation 5%)<br />15% mini quizzes (best 3 of 5)<br />10% reflection paper<br /><br /><br />Only way to get good grade is probably by getting good groupmates for worksheet and midterm",
            "comment_workload": "Workload was okay, there were some prior reading that was required before class. The quizzes were based on those readings, so if you want to get good grades then do those readings. It takes around 5 mins to go through the entire quiz anyways.<br /><br />Make sure you have good groupmates, or else it's going to be very difficult on you. I had 2 freeriders who did basically nothing during discussions and barely helped out with group project",
            "rating_content": 4,
            "rating_teaching": 3,
            "rating_grading": 3,
            "rating_workload": 3,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": true,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "P0Y3TcZChxQjTBLbGNuRaqQUHDtksCJY",
            "semester": "2020-21 Spring",
            "instructors": [
                {
                    "id": 1214,
                    "name": "LU, Zhongming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "wendyliang22",
            "date": "Aug 08, 2021",
            "title": "",
            "comment_content": "The content was good and it made me genuinely care about sustainability! Professor Lu goes into detail about the different contributors to climate change, and provides both (1) scientific and (2) sociological/business related insight on why and how climate change occurs.<br /><br />The part of the course which I enjoyed the most was the solutions oriented focus. Professor Zhongming spends a lot of time prompting students to consider not justhow and why climate change occurs, but what could be done to mitigate it.",
            "comment_teaching": "The teaching was in general quite good. Professor Zhongming has an accent but his english is clear and understandable. The professor also tries to integrate a number of activities into the lessons to make it more interesting despite the lesson times being three hours long.<br /><br />The only suggestion is that sometimes the activities may be a bit confusing, and especially when students are grouped into random breakout rooms - they may not know what to do.",
            "comment_grading": "Grading was quite good. As long as you read over the class materials, and make sure to understand the concepts clearly (they are not too hard).",
            "comment_workload": "Workload in general was quite light but there are readings to do every week and mini quizes based off the readings.",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": true,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": false,
            "has_project": true,
            "has_attendance": false,
            "has_reading": false,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "6lmZ1Ra4qdhH944k8Dg5Unve6XHE4k28",
            "semester": "2020-21 Fall",
            "instructors": [
                {
                    "id": 1214,
                    "name": "LU, Zhongming",
                    "rating": 1
                }
            ],
            "is_author": false,
            "author": "lolidek",
            "date": "Jan 11, 2021",
            "title": "Good Course, Good Grade",
            "comment_content": "The course-content was quite straightforward. The professor taught us about different sustainability concepts, namely: <br /><br />Part A (Before Midterm): <br />1. Anthropogenic (human) impact on natural systems<br />2. Planetary boundaries and Earth systems<br />3. Human thriving within planetary boundaries<br />4. Policy approaches for sustainability<br />5. Sustainable development and sustainable communities<br /><br />Part B (After Midterm): <br />6. Energy futures<br />7. Futures for fresh water<br />8. Design for a circular economy<br />9. Sustainable consumption<br />10. Futures thinking<br /><br />It was nice because only the first half of the syllabus was actually tested through an exam, whilst we could get a bit creative about the second half by displaying our knowledge through a group poster presentation.",
            "comment_teaching": "Zhongming was a very good professor in my opinion. Despite it having a 3 hour lecture every week, SUST1000 was an entertaining course as we had group activities every lecture. This lowered chances of us getting distracted.<br /><br />These group activities also helped illustrate the different concepts being taught in class, which made them very helpful sources of information when answering exam questions in the midterm, or even in the poster presentation.",
            "comment_grading": "The grading was very good. <br /><br />My Statistics:<br />(Group) Interim Report #1: 4.63/5 (Mean: 4.5)<br />(Group) Interim Report #2: 3.93/5 (Mean: 3.8)<br />Midterm: 33.5/35 (Mean: 27.9)<br />Mini-quizzes (Best 3/5): 15/15<br />Group Presentation: 9.3/10 (Mean: 7.9)<br />Group Project Peer Review: 5/5 (Mean: 4.3)<br />Reflection Paper: 12/15 (Mean: 11.5)<br />Participation: Not Provided<br /><br />I ended up getting an A+ at the end, even though I was only expecting to get an A- at best, as my reflection paper as well as the interim reports were only slightly above mean. Zhongming was also willing to answer questions regarding grading, and was very prompt in his replies, which made the grade review process very smooth.",
            "comment_workload": "Despite not being overwhelming, the workload was definitely not light. There were many components which required us to spend a-lot of time working together as a group.<br /><br />Furthermore, although it didn't look like much at the start, there were actually a-lot of readings that had to be done prior to the midterm exam. Nevertheless, it is easy to make stuff up during the exam when giving arguments (as long as they make logical sense). <br /><br />Overall it was a great course, one that I enjoyed a-lot more than I thought I would!",
            "rating_content": 5,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": false,
            "has_reading": true,
            "has_presentation": true,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "V0wy6PoD86B2jK0TOZFD8E3pyuC1C3lM",
            "semester": "2018-19 Fall",
            "instructors": [],
            "is_author": false,
            "author": "therock",
            "date": "Dec 25, 2018",
            "title": "Somewhat Easy A",
            "comment_content": "Standard sustainability topics, if you know anything about climate change and other environmental issues already, this class will just kinda review them using real world examples. A little bit on political/social/economic sustainability, but mostly environmental. If you don't care about the environment don't join this class!",
            "comment_teaching": "I liked our prof, Norman, and at one point we had a couple other specialist profs visit and teach a couple lectures which was a nice variety. The only downside is the class duration, even with the break in the middle the class feels wayyyy too long and half the students are falling asleep in the second half of class.",
            "comment_grading": "Best grading from any class I've taken at UST so far! I got an A and didn't put an insane amount of work into it. The two main things that will determine your grade are the midterm and final project so work hard on those.",
            "comment_workload": "Not too heavy, I probably spent the least amount of time on this course from all my classes. The final project was less work than my project for a 2 credit mgmt course. No homework assignments, only have to study a bit for the midterm (I started about 5 days before and studied around 2 hours a day). Group work is spread out evenly enough if you're lucky with your group members so you don't have too much to worry about there either.",
            "rating_content": 4,
            "rating_teaching": 5,
            "rating_grading": 5,
            "rating_workload": 4,
            "has_midterm": true,
            "has_final": false,
            "has_quiz": false,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": false,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        },
        {
            "hash": "0rTcGwsfbkBqSwnTGCUdYkB4c35Z6yGH",
            "semester": "2017-18 Fall",
            "instructors": [],
            "is_author": false,
            "author": "kelly1234",
            "date": "Jan 24, 2018",
            "title": "boring and silly course",
            "comment_content": "boring and useless content and it was 9am lesson. We had online quizzes every time, if u were late more than 15mins then the quiz would be closed and u got&nbsp;&nbsp;0 mark.",
            "comment_teaching": "boring and some of the contents are really difficult to understand lol Karen chan and David are bad tbh",
            "comment_grading": "Not a “good-grade course” tho I got a C<br />ppl told me that’s good grade course but it’s not.",
            "comment_workload": "A few pieces of essay u have to finish, silly topics and have to revise for the quizzes (around 6-8 quzzies?I forgot) every lesson, that were silly.",
            "rating_content": 2,
            "rating_teaching": 2,
            "rating_grading": 2,
            "rating_workload": 2,
            "has_midterm": false,
            "has_final": false,
            "has_quiz": true,
            "has_assignment": false,
            "has_essay": true,
            "has_project": true,
            "has_attendance": true,
            "has_reading": true,
            "has_presentation": false,
            "upvote_count": 0,
            "vote_count": 2,
            "voted": false,
            "is_upvote": false,
            "comment_count": 0,
            "attachments": []
        }
    ],
    "composer": []
}